{
  "ground_truth": "Gatsby notices Nick watching him and checks himself, and at the sound of the organ, Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer, a wild-haired young man with glasses, plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick, and they shimmy back and forth. As Gatsby watches, he remembers some time before in uniform, dancing with Daisy and kissing her. He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick.",
  "iterations": {
    "1": "Gatsby notices Nick watching him and checks himself, and at the sound of the organ, Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer, a wild-haired young man with glasses, plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick, and they shimmy back and forth. As Gatsby watches, he remembers some time before in uniform, dancing with Daisy and kissing her. He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick.",
    "2": "Gatsby notices Nick watching him and checks himself, and at the sound of the organ, Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer, a wild-haired young man with glasses, plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick, and they shimmy back and forth. As Gatsby watches, he remembers some time before in uniform, dancing with Daisy and kissing her. He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick.",
    "3": "Gatsby notices Nick watching him and checks himself, and at the sound of the organ, Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer, a wild-haired young man with glasses, plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick, and they shimmy back and forth. As Gatsby watches, he remembers some time before in uniform, dancing with Daisy and kissing her. He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick.",
    "4": "Gatsby notices Nick watching him and checks himself, and at the sound of the organ, Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer, a wild-haired young man with glasses, plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick, and they shimmy back and forth. As Gatsby watches, he remembers some time before in uniform, dancing with Daisy and kissing her. He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick.",
    "5": "Gatsby notices Nick watching him and checks himself, and at the sound of the organ, Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer, a wild-haired young man with glasses, plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick, and they shimmy back and forth. As Gatsby watches, he remembers some time before in uniform, dancing with Daisy and kissing her. He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick.",
    "6": "Gatsby notices Nick watching him and checks himself, and at the sound of the organ, Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer, a wild-haired young man with glasses, plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick, and they shimmy back and forth. As Gatsby watches, he remembers some time before in uniform, dancing with Daisy and kissing her. He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick.",
    "7": "Gatsby notices Nick watching him and checks himself, and at the sound of the organ, Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer, a wild-haired young man with glasses, plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick, and they shimmy back and forth. As Gatsby watches, he remembers some time before in uniform, dancing with Daisy and kissing her. He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick.",
    "8": "Gatsby notices Nick watching him and checks himself, and at the sound of the organ, Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer, a wild-haired young man with glasses, plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick, and they shimmy back and forth. As Gatsby watches, he remembers some time before in uniform, dancing with Daisy and kissing her. He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick.",
    "9": "Gatsby notices Nick watching him and checks himself, and at the sound of the organ, Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer, a wild-haired young man with glasses, plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick, and they shimmy back and forth. As Gatsby watches, he remembers some time before in uniform, dancing with Daisy and kissing her. He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick.",
    "10": "Gatsby notices Nick watching him and checks himself, and at the sound of the organ, Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer, a wild-haired young man with glasses, plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick, and they shimmy back and forth. As Gatsby watches, he remembers some time before in uniform, dancing with Daisy and kissing her. He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick."
  }
}