{
  "ground_truth": "Mike and Abby clasp hands and hold each other around the waist as they sink down, moving their shoulders seductively from side to side. They turn, round and round, moving smoothly to the music, and Abby leans back on Mike's arm as they dance with their hands held palm to palm. They hold hands above their heads as Mike sinks down, and Abby sways rhythmically to the music while Mike caresses her hair and runs his hands down her sides. Abby spins out, swishing her hair around, and Mike pulls her close as they continue to dance, smiling happily. Abby wraps her arms around Mike's neck and they dance close, as he spins her back and forth, then pulls her closer. Abby and Mike's noses almost touch, and they gaze at each other with their mouths slightly open, as if they're about to kiss. Abby blinks, surprised, and Mike forces himself to nod. Abby smiles nervously and heads off, with Mike following, looking dazed. Abby carries her shoes as she walks with Mike to an elevator, and he presses the call button. Mike turns and faces Abby, and they both fidget awkwardly before stepping into the elevator and standing side by side. Mike presses buttons and loosens his jacket as she flashes a smile at him. They hug, and he stops the doors from closing so they can hug again.",
  "iterations": {
    "1": "Mike and Abby clasp hands and hold each other around the waist as they sink down, moving their shoulders seductively from side to side. They turn, round and round, moving smoothly to the music, and Abby leans back on Mike's arm as they dance with their hands held palm to palm. They hold hands above their heads as Mike sinks down, and Abby sways rhythmically to the music while Mike caresses her hair and runs his hands down her sides. Abby spins out, swishing her hair around, and Mike pulls her close as they continue to dance, smiling happily. Abby wraps her arms around Mike's neck and they dance close, as he spins her back and forth, then pulls her closer. Abby and Mike's noses almost touch, and they gaze at each other with their mouths slightly open, as if they're about to kiss. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Abby blinks, surprised, and Mike forces himself to nod. Abby smiles nervously and heads off, with Mike following, looking dazed. Abby carries her shoes as she walks with Mike to an elevator, and he presses the call button. Mike turns and faces Abby, and they both fidget awkwardly before stepping into the elevator and standing side by side. Mike presses buttons and loosens his jacket as she flashes a smile at him. They hug, and he stops the doors from closing so they can hug again.",
    "2": "Mike and Abby clasp hands and hold each other around the waist as they sink down, moving their shoulders seductively from side to side. They turn, round and round, moving smoothly to the music, and Abby leans back on Mike's arm as they dance with their hands held palm to palm. They hold hands above their heads as Mike sinks down, and Abby sways rhythmically to the music while Mike caresses her hair and runs his hands down her sides. Abby spins out, swishing her hair around, and Mike pulls her close as they continue to dance, smiling happily. Abby wraps her arms around Mike's neck and they dance close, as he spins her back and forth, then pulls her closer. Abby and Mike's noses almost touch, and they gaze at each other with their mouths slightly open, as if they're about to kiss. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Abby blinks, surprised, and Mike forces himself to nod. Abby smiles nervously and heads off, with Mike following, looking dazed. Abby carries her shoes as she walks with Mike to an elevator, and he presses the call button. Mike turns and faces Abby, and they both fidget awkwardly before stepping into the elevator and standing side by side. Mike presses buttons and loosens his jacket as she flashes a smile at him. They hug, and he stops the doors from closing so they can hug again.",
    "3": "Mike and Abby clasp hands and hold each other around the waist as they sink down, moving their shoulders seductively from side to side. They turn, round and round, moving smoothly to the music, and Abby leans back on Mike's arm as they dance with their hands held palm to palm. They hold hands above their heads as Mike sinks down, and Abby sways rhythmically to the music while Mike caresses her hair and runs his hands down her sides. Abby spins out, swishing her hair around, and Mike pulls her close as they continue to dance, smiling happily. Abby wraps her arms around Mike's neck and they dance close, as he spins her back and forth, then pulls her closer. Abby and Mike's noses almost touch, and they gaze at each other with their mouths slightly open, as if they're about to kiss. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Abby blinks, surprised, and Mike forces himself to nod. Abby smiles nervously and heads off, with Mike following, looking dazed. Abby carries her shoes as she walks with Mike to an elevator, and he presses the call button. Mike turns and faces Abby, and they both fidget awkwardly before stepping into the elevator and standing side by side. Mike presses buttons and loosens his jacket as she flashes a smile at him. They hug, and he stops the doors from closing so they can hug again.",
    "4": "Mike and Abby clasp hands and hold each other around the waist as they sink down, moving their shoulders seductively from side to side. They turn, round and round, moving smoothly to the music, and Abby leans back on Mike's arm as they dance with their hands held palm to palm. They hold hands above their heads as Mike sinks down, and Abby sways rhythmically to the music while Mike caresses her hair and runs his hands down her sides. Abby spins out, swishing her hair around, and Mike pulls her close as they continue to dance, smiling happily. Abby wraps her arms around Mike's neck and they dance close, as he spins her back and forth, then pulls her closer. Abby and Mike's noses almost touch, and they gaze at each other with their mouths slightly open, as if they're about to kiss. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Abby blinks, surprised, and Mike forces himself to nod. Abby smiles nervously and heads off, with Mike following, looking dazed. Abby carries her shoes as she walks with Mike to an elevator, and he presses the call button. Mike turns and faces Abby, and they both fidget awkwardly before stepping into the elevator and standing side by side. Mike presses buttons and loosens his jacket as she flashes a smile at him. They hug, and he stops the doors from closing so they can hug again.",
    "5": "Mike and Abby clasp hands and hold each other around the waist as they sink down, moving their shoulders seductively from side to side. They turn, round and round, moving smoothly to the music, and Abby leans back on Mike's arm as they dance with their hands held palm to palm. They hold hands above their heads as Mike sinks down, and Abby sways rhythmically to the music while Mike caresses her hair and runs his hands down her sides. Abby spins out, swishing her hair around, and Mike pulls her close as they continue to dance, smiling happily. Abby wraps her arms around Mike's neck and they dance close, as he spins her back and forth, then pulls her closer. Abby and Mike's noses almost touch, and they gaze at each other with their mouths slightly open, as if they're about to kiss. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Abby blinks, surprised, and Mike forces himself to nod. Abby smiles nervously and heads off, with Mike following, looking dazed. Abby carries her shoes as she walks with Mike to an elevator, and he presses the call button. Mike turns and faces Abby, and they both fidget awkwardly before stepping into the elevator and standing side by side. Mike presses buttons and loosens his jacket as she flashes a smile at him. They hug, and he stops the doors from closing so they can hug again.",
    "6": "Mike and Abby clasp hands and hold each other around the waist as they sink down, moving their shoulders seductively from side to side. They turn, round and round, moving smoothly to the music, and Abby leans back on Mike's arm as they dance with their hands held palm to palm. They hold hands above their heads as Mike sinks down, and Abby sways rhythmically to the music while Mike caresses her hair and runs his hands down her sides. Abby spins out, swishing her hair around, and Mike pulls her close as they continue to dance, smiling happily. Abby wraps her arms around Mike's neck and they dance close, as he spins her back and forth, then pulls her closer. Abby and Mike's noses almost touch, and they gaze at each other with their mouths slightly open, as if they're about to kiss. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Abby blinks, surprised, and Mike forces himself to nod. Abby smiles nervously and heads off, with Mike following, looking dazed. Abby carries her shoes as she walks with Mike to an elevator, and he presses the call button. Mike turns and faces Abby, and they both fidget awkwardly before stepping into the elevator and standing side by side. Mike presses buttons and loosens his jacket as she flashes a smile at him. They hug, and he stops the doors from closing so they can hug again.",
    "7": "Mike and Abby clasp hands and hold each other around the waist as they sink down, moving their shoulders seductively from side to side. They turn, round and round, moving smoothly to the music, and Abby leans back on Mike's arm as they dance with their hands held palm to palm. They hold hands above their heads as Mike sinks down, and Abby sways rhythmically to the music while Mike caresses her hair and runs his hands down her sides. Abby spins out, swishing her hair around, and Mike pulls her close as they continue to dance, smiling happily. Abby wraps her arms around Mike's neck and they dance close, as he spins her back and forth, then pulls her closer. Abby and Mike's noses almost touch, and they gaze at each other with their mouths slightly open, as if they're about to kiss. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Abby blinks, surprised, and Mike forces himself to nod. Abby smiles nervously and heads off, with Mike following, looking dazed. Abby carries her shoes as she walks with Mike to an elevator, and he presses the call button. Mike turns and faces Abby, and they both fidget awkwardly before stepping into the elevator and standing side by side. Mike presses buttons and loosens his jacket as she flashes a smile at him. They hug, and he stops the doors from closing so they can hug again.",
    "8": "Mike and Abby clasp hands and hold each other around the waist as they sink down, moving their shoulders seductively from side to side. They turn, round and round, moving smoothly to the music, and Abby leans back on Mike's arm as they dance with their hands held palm to palm. They hold hands above their heads as Mike sinks down, and Abby sways rhythmically to the music while Mike caresses her hair and runs his hands down her sides. Abby spins out, swishing her hair around, and Mike pulls her close as they continue to dance, smiling happily. Abby wraps her arms around Mike's neck and they dance close, as he spins her back and forth, then pulls her closer. Abby and Mike's noses almost touch, and they gaze at each other with their mouths slightly open, as if they're about to kiss. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Abby blinks, surprised, and Mike forces himself to nod. Abby smiles nervously and heads off, with Mike following, looking dazed. Abby carries her shoes as she walks with Mike to an elevator, and he presses the call button. Mike turns and faces Abby, and they both fidget awkwardly before stepping into the elevator and standing side by side. Mike presses buttons and loosens his jacket as she flashes a smile at him. They hug, and he stops the doors from closing so they can hug again.",
    "9": "Mike and Abby clasp hands and hold each other around the waist as they sink down, moving their shoulders seductively from side to side. They turn, round and round, moving smoothly to the music, and Abby leans back on Mike's arm as they dance with their hands held palm to palm. They hold hands above their heads as Mike sinks down, and Abby sways rhythmically to the music while Mike caresses her hair and runs his hands down her sides. Abby spins out, swishing her hair around, and Mike pulls her close as they continue to dance, smiling happily. Abby wraps her arms around Mike's neck and they dance close, as he spins her back and forth, then pulls her closer. Abby and Mike's noses almost touch, and they gaze at each other with their mouths slightly open, as if they're about to kiss. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Abby blinks, surprised, and Mike forces himself to nod. Abby smiles nervously and heads off, with Mike following, looking dazed. Abby carries her shoes as she walks with Mike to an elevator, and he presses the call button. Mike turns and faces Abby, and they both fidget awkwardly before stepping into the elevator and standing side by side. Mike presses buttons and loosens his jacket as she flashes a smile at him. They hug, and he stops the doors from closing so they can hug again.",
    "10": "Mike and Abby clasp hands and hold each other around the waist as they sink down, moving their shoulders seductively from side to side. They turn, round and round, moving smoothly to the music, and Abby leans back on Mike's arm as they dance with their hands held palm to palm. They hold hands above their heads as Mike sinks down, and Abby sways rhythmically to the music while Mike caresses her hair and runs his hands down her sides. Abby spins out, swishing her hair around, and Mike pulls her close as they continue to dance, smiling happily. Abby wraps her arms around Mike's neck and they dance close, as he spins her back and forth, then pulls her closer. Abby and Mike's noses almost touch, and they gaze at each other with their mouths slightly open, as if they're about to kiss. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Abby blinks, surprised, and Mike forces himself to nod. Abby smiles nervously and heads off, with Mike following, looking dazed. Abby carries her shoes as she walks with Mike to an elevator, and he presses the call button. Mike turns and faces Abby, and they both fidget awkwardly before stepping into the elevator and standing side by side. Mike presses buttons and loosens his jacket as she flashes a smile at him. They hug, and he stops the doors from closing so they can hug again."
  }
}