{
  "ground_truth": "Forrest runs across a cobble-stone bridge with the Rocky Mountains in the distance, and split rail fences line the road as he runs through some meadowland. Meanwhile, three men in the barber shop watch the news on television, and Jenny fills customer's coffee cups. Forrest continues running as a young man runs up to him and jogs behind him, as Forrest runs up a slope on a high mountain road with a group of people jogging behind him. The large group follows Forrest across the desert road, through a small town, where a man runs up and talks to him, while a hippie stops to ponder a profound thought. A truck with a bumper sticker drives into an intersection and collides with a car. Forrest runs, followed by his group, as another man runs up to him. Forrest wipes his face on a towel and hands it back to the man, who looks at the T-shirt. Forrest runs with a group that follows behind him until he stops, and the group stops behind him. Forrest stands and looks as the group waits expectantly, then he turns and looks, walks toward the group, which parts for him as he walks down the middle of the road. A television shows President Reagan and his staff reacting to gunshots in front of a limo, while Forrest sits eating a sandwich, watching the news of the assassination attempt. Forrest takes a letter out of his pocket, which an elderly woman looks at, then hastily grabs his suitcase and letter as he stands. A truck honks its horn as Forrest runs across the street past the truck, and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door.",
  "iterations": {
    "1": "Forrest runs across a cobble-stone bridge with the Rocky Mountains in the distance, and split rail fences line the road as he runs through some meadowland. Meanwhile, three men in the barber shop watch the news on television, and Jenny fills customer's coffee cups. Forrest continues running as a young man runs up to him and jogs behind him, as Forrest runs up a slope on a high mountain road with a group of people jogging behind him. The large group follows Forrest across the desert road, through a small town, where a man runs up and talks to him, while a hippie stops to ponder a profound thought. A truck with a bumper sticker drives into an intersection and collides with a car. Forrest runs, followed by his group, as another man runs up to him. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Forrest wipes his face on a towel and hands it back to the man, who looks at the T-shirt. Forrest runs with a group that follows behind him until he stops, and the group stops behind him. Forrest stands and looks as the group waits expectantly, then he turns and looks, walks toward the group, which parts for him as he walks down the middle of the road. A television shows President Reagan and his staff reacting to gunshots in front of a limo, while Forrest sits eating a sandwich, watching the news of the assassination attempt. Forrest takes a letter out of his pocket, which an elderly woman looks at, then hastily grabs his suitcase and letter as he stands. A truck honks its horn as Forrest runs across the street past the truck, and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door.",
    "2": "Forrest runs across a cobble-stone bridge with the Rocky Mountains in the distance, and split rail fences line the road as he runs through some meadowland. Meanwhile, three men in the barber shop watch the news on television, and Jenny fills customer's coffee cups. Forrest continues running as a young man runs up to him and jogs behind him, as Forrest runs up a slope on a high mountain road with a group of people jogging behind him. The large group follows Forrest across the desert road, through a small town, where a man runs up and talks to him, while a hippie stops to ponder a profound thought. A truck with a bumper sticker drives into an intersection and collides with a car. Forrest runs, followed by his group, as another man runs up to him. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Forrest wipes his face on a towel and hands it back to the man, who looks at the T-shirt. Forrest runs with a group that follows behind him until he stops, and the group stops behind him. Forrest stands and looks as the group waits expectantly, then he turns and looks, walks toward the group, which parts for him as he walks down the middle of the road. A television shows President Reagan and his staff reacting to gunshots in front of a limo, while Forrest sits eating a sandwich, watching the news of the assassination attempt. Forrest takes a letter out of his pocket, which an elderly woman looks at, then hastily grabs his suitcase and letter as he stands. A truck honks its horn as Forrest runs across the street past the truck, and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door.",
    "3": "Forrest runs across a cobble-stone bridge with the Rocky Mountains in the distance, and split rail fences line the road as he runs through some meadowland. Meanwhile, three men in the barber shop watch the news on television, and Jenny fills customer's coffee cups. Forrest continues running as a young man runs up to him and jogs behind him, as Forrest runs up a slope on a high mountain road with a group of people jogging behind him. The large group follows Forrest across the desert road, through a small town, where a man runs up and talks to him, while a hippie stops to ponder a profound thought. A truck with a bumper sticker drives into an intersection and collides with a car. Forrest runs, followed by his group, as another man runs up to him. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Forrest wipes his face on a towel and hands it back to the man, who looks at the T-shirt. Forrest runs with a group that follows behind him until he stops, and the group stops behind him. Forrest stands and looks as the group waits expectantly, then he turns and looks, walks toward the group, which parts for him as he walks down the middle of the road. A television shows President Reagan and his staff reacting to gunshots in front of a limo, while Forrest sits eating a sandwich, watching the news of the assassination attempt. Forrest takes a letter out of his pocket, which an elderly woman looks at, then hastily grabs his suitcase and letter as he stands. A truck honks its horn as Forrest runs across the street past the truck, and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door.",
    "4": "Forrest runs across a cobble-stone bridge with the Rocky Mountains in the distance, and split rail fences line the road as he runs through some meadowland. Meanwhile, three men in the barber shop watch the news on television, and Jenny fills customer's coffee cups. Forrest continues running as a young man runs up to him and jogs behind him, as Forrest runs up a slope on a high mountain road with a group of people jogging behind him. The large group follows Forrest across the desert road, through a small town, where a man runs up and talks to him, while a hippie stops to ponder a profound thought. A truck with a bumper sticker drives into an intersection and collides with a car. Forrest runs, followed by his group, as another man runs up to him. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Forrest wipes his face on a towel and hands it back to the man, who looks at the T-shirt. Forrest runs with a group that follows behind him until he stops, and the group stops behind him. Forrest stands and looks as the group waits expectantly, then he turns and looks, walks toward the group, which parts for him as he walks down the middle of the road. A television shows President Reagan and his staff reacting to gunshots in front of a limo, while Forrest sits eating a sandwich, watching the news of the assassination attempt. Forrest takes a letter out of his pocket, which an elderly woman looks at, then hastily grabs his suitcase and letter as he stands. A truck honks its horn as Forrest runs across the street past the truck, and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door.",
    "5": "Forrest runs across a cobble-stone bridge with the Rocky Mountains in the distance, and split rail fences line the road as he runs through some meadowland. Meanwhile, three men in the barber shop watch the news on television, and Jenny fills customer's coffee cups. Forrest continues running as a young man runs up to him and jogs behind him, as Forrest runs up a slope on a high mountain road with a group of people jogging behind him. The large group follows Forrest across the desert road, through a small town, where a man runs up and talks to him, while a hippie stops to ponder a profound thought. A truck with a bumper sticker drives into an intersection and collides with a car. Forrest runs, followed by his group, as another man runs up to him. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Forrest wipes his face on a towel and hands it back to the man, who looks at the T-shirt. Forrest runs with a group that follows behind him until he stops, and the group stops behind him. Forrest stands and looks as the group waits expectantly, then he turns and looks, walks toward the group, which parts for him as he walks down the middle of the road. A television shows President Reagan and his staff reacting to gunshots in front of a limo, while Forrest sits eating a sandwich, watching the news of the assassination attempt. Forrest takes a letter out of his pocket, which an elderly woman looks at, then hastily grabs his suitcase and letter as he stands. A truck honks its horn as Forrest runs across the street past the truck, and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door.",
    "6": "Forrest runs across a cobble-stone bridge with the Rocky Mountains in the distance, and split rail fences line the road as he runs through some meadowland. Meanwhile, three men in the barber shop watch the news on television, and Jenny fills customer's coffee cups. Forrest continues running as a young man runs up to him and jogs behind him, as Forrest runs up a slope on a high mountain road with a group of people jogging behind him. The large group follows Forrest across the desert road, through a small town, where a man runs up and talks to him, while a hippie stops to ponder a profound thought. A truck with a bumper sticker drives into an intersection and collides with a car. Forrest runs, followed by his group, as another man runs up to him. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Forrest wipes his face on a towel and hands it back to the man, who looks at the T-shirt. Forrest runs with a group that follows behind him until he stops, and the group stops behind him. Forrest stands and looks as the group waits expectantly, then he turns and looks, walks toward the group, which parts for him as he walks down the middle of the road. A television shows President Reagan and his staff reacting to gunshots in front of a limo, while Forrest sits eating a sandwich, watching the news of the assassination attempt. Forrest takes a letter out of his pocket, which an elderly woman looks at, then hastily grabs his suitcase and letter as he stands. A truck honks its horn as Forrest runs across the street past the truck, and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door.",
    "7": "Forrest runs across a cobble-stone bridge with the Rocky Mountains in the distance, and split rail fences line the road as he runs through some meadowland. Meanwhile, three men in the barber shop watch the news on television, and Jenny fills customer's coffee cups. Forrest continues running as a young man runs up to him and jogs behind him, as Forrest runs up a slope on a high mountain road with a group of people jogging behind him. The large group follows Forrest across the desert road, through a small town, where a man runs up and talks to him, while a hippie stops to ponder a profound thought. A truck with a bumper sticker drives into an intersection and collides with a car. Forrest runs, followed by his group, as another man runs up to him. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Forrest wipes his face on a towel and hands it back to the man, who looks at the T-shirt. Forrest runs with a group that follows behind him until he stops, and the group stops behind him. Forrest stands and looks as the group waits expectantly, then he turns and looks, walks toward the group, which parts for him as he walks down the middle of the road. A television shows President Reagan and his staff reacting to gunshots in front of a limo, while Forrest sits eating a sandwich, watching the news of the assassination attempt. Forrest takes a letter out of his pocket, which an elderly woman looks at, then hastily grabs his suitcase and letter as he stands. A truck honks its horn as Forrest runs across the street past the truck, and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door.",
    "8": "Forrest runs across a cobble-stone bridge with the Rocky Mountains in the distance, and split rail fences line the road as he runs through some meadowland. Meanwhile, three men in the barber shop watch the news on television, and Jenny fills customer's coffee cups. Forrest continues running as a young man runs up to him and jogs behind him, as Forrest runs up a slope on a high mountain road with a group of people jogging behind him. The large group follows Forrest across the desert road, through a small town, where a man runs up and talks to him, while a hippie stops to ponder a profound thought. A truck with a bumper sticker drives into an intersection and collides with a car. Forrest runs, followed by his group, as another man runs up to him. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Forrest wipes his face on a towel and hands it back to the man, who looks at the T-shirt. Forrest runs with a group that follows behind him until he stops, and the group stops behind him. Forrest stands and looks as the group waits expectantly, then he turns and looks, walks toward the group, which parts for him as he walks down the middle of the road. A television shows President Reagan and his staff reacting to gunshots in front of a limo, while Forrest sits eating a sandwich, watching the news of the assassination attempt. Forrest takes a letter out of his pocket, which an elderly woman looks at, then hastily grabs his suitcase and letter as he stands. A truck honks its horn as Forrest runs across the street past the truck, and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door.",
    "9": "Forrest runs across a cobble-stone bridge with the Rocky Mountains in the distance, and split rail fences line the road as he runs through some meadowland. Meanwhile, three men in the barber shop watch the news on television, and Jenny fills customer's coffee cups. Forrest continues running as a young man runs up to him and jogs behind him, as Forrest runs up a slope on a high mountain road with a group of people jogging behind him. The large group follows Forrest across the desert road, through a small town, where a man runs up and talks to him, while a hippie stops to ponder a profound thought. A truck with a bumper sticker drives into an intersection and collides with a car. Forrest runs, followed by his group, as another man runs up to him. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Forrest wipes his face on a towel and hands it back to the man, who looks at the T-shirt. Forrest runs with a group that follows behind him until he stops, and the group stops behind him. Forrest stands and looks as the group waits expectantly, then he turns and looks, walks toward the group, which parts for him as he walks down the middle of the road. A television shows President Reagan and his staff reacting to gunshots in front of a limo, while Forrest sits eating a sandwich, watching the news of the assassination attempt. Forrest takes a letter out of his pocket, which an elderly woman looks at, then hastily grabs his suitcase and letter as he stands. A truck honks its horn as Forrest runs across the street past the truck, and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door.",
    "10": "Forrest runs across a cobble-stone bridge with the Rocky Mountains in the distance, and split rail fences line the road as he runs through some meadowland. Meanwhile, three men in the barber shop watch the news on television, and Jenny fills customer's coffee cups. Forrest continues running as a young man runs up to him and jogs behind him, as Forrest runs up a slope on a high mountain road with a group of people jogging behind him. The large group follows Forrest across the desert road, through a small town, where a man runs up and talks to him, while a hippie stops to ponder a profound thought. A truck with a bumper sticker drives into an intersection and collides with a car. Forrest runs, followed by his group, as another man runs up to him. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Forrest wipes his face on a towel and hands it back to the man, who looks at the T-shirt. Forrest runs with a group that follows behind him until he stops, and the group stops behind him. Forrest stands and looks as the group waits expectantly, then he turns and looks, walks toward the group, which parts for him as he walks down the middle of the road. A television shows President Reagan and his staff reacting to gunshots in front of a limo, while Forrest sits eating a sandwich, watching the news of the assassination attempt. Forrest takes a letter out of his pocket, which an elderly woman looks at, then hastily grabs his suitcase and letter as he stands. A truck honks its horn as Forrest runs across the street past the truck, and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door."
  }
}