{
  "ground_truth": "Natalie spins around and heads off. Ryan looks out of the window of a jet as it rises into the sky. In Las Vegas, Alex holds the cut-out of Julie and Jim in front of the pyramid-shaped Luxor Hotel. Ryan aims the digital camera, and Alex moves the cut-out closer. He takes a picture while Alex stares at the cut-out. Ryan smiles, and Alex looks surprised before smiling warmly. In Milwaukee, a jet comes in to land. Alex and Ryan walk through the airport terminal, with him pulling a black wheelie case and her a similar, neat red one. Later, they walk into the Chalet Suites, a Swiss lodge-themed hotel, and join a short queue of people checking in. Ryan notices a second counter with no queue. As Ryan opens a hotel room door, his sister Kara walks up holding a basket of washing. Alex and Ryan walk into their gaudily furnished room, where Ryan picks up a photocopied booklet with a picture of Julie and Jim on the front.",
  "iterations": {
    "1": "Natalie spins around and heads off. Ryan looks out of the window of a jet as it rises into the sky. In Las Vegas, Alex holds the cut-out of Julie and Jim in front of the pyramid-shaped Luxor Hotel. Ryan aims the digital camera, and Alex moves the cut-out closer. He takes a picture while Alex stares at the cut-out. Ryan smiles, and Alex looks surprised before smiling warmly. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In Milwaukee, a jet comes in to land. Alex and Ryan walk through the airport terminal, with him pulling a black wheelie case and her a similar, neat red one. Later, they walk into the Chalet Suites, a Swiss lodge-themed hotel, and join a short queue of people checking in. Ryan notices a second counter with no queue. As Ryan opens a hotel room door, his sister Kara walks up holding a basket of washing. Alex and Ryan walk into their gaudily furnished room, where Ryan picks up a photocopied booklet with a picture of Julie and Jim on the front.",
    "2": "Natalie spins around and heads off. Ryan looks out of the window of a jet as it rises into the sky. In Las Vegas, Alex holds the cut-out of Julie and Jim in front of the pyramid-shaped Luxor Hotel. Ryan aims the digital camera, and Alex moves the cut-out closer. He takes a picture while Alex stares at the cut-out. Ryan smiles, and Alex looks surprised before smiling warmly. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In Milwaukee, a jet comes in to land. Alex and Ryan walk through the airport terminal, with him pulling a black wheelie case and her a similar, neat red one. Later, they walk into the Chalet Suites, a Swiss lodge-themed hotel, and join a short queue of people checking in. Ryan notices a second counter with no queue. As Ryan opens a hotel room door, his sister Kara walks up holding a basket of washing. Alex and Ryan walk into their gaudily furnished room, where Ryan picks up a photocopied booklet with a picture of Julie and Jim on the front.",
    "3": "Natalie spins around and heads off. Ryan looks out of the window of a jet as it rises into the sky. In Las Vegas, Alex holds the cut-out of Julie and Jim in front of the pyramid-shaped Luxor Hotel. Ryan aims the digital camera, and Alex moves the cut-out closer. He takes a picture while Alex stares at the cut-out. Ryan smiles, and Alex looks surprised before smiling warmly. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In Milwaukee, a jet comes in to land. Alex and Ryan walk through the airport terminal, with him pulling a black wheelie case and her a similar, neat red one. Later, they walk into the Chalet Suites, a Swiss lodge-themed hotel, and join a short queue of people checking in. Ryan notices a second counter with no queue. As Ryan opens a hotel room door, his sister Kara walks up holding a basket of washing. Alex and Ryan walk into their gaudily furnished room, where Ryan picks up a photocopied booklet with a picture of Julie and Jim on the front.",
    "4": "Natalie spins around and heads off. Ryan looks out of the window of a jet as it rises into the sky. In Las Vegas, Alex holds the cut-out of Julie and Jim in front of the pyramid-shaped Luxor Hotel. Ryan aims the digital camera, and Alex moves the cut-out closer. He takes a picture while Alex stares at the cut-out. Ryan smiles, and Alex looks surprised before smiling warmly. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In Milwaukee, a jet comes in to land. Alex and Ryan walk through the airport terminal, with him pulling a black wheelie case and her a similar, neat red one. Later, they walk into the Chalet Suites, a Swiss lodge-themed hotel, and join a short queue of people checking in. Ryan notices a second counter with no queue. As Ryan opens a hotel room door, his sister Kara walks up holding a basket of washing. Alex and Ryan walk into their gaudily furnished room, where Ryan picks up a photocopied booklet with a picture of Julie and Jim on the front.",
    "5": "Natalie spins around and heads off. Ryan looks out of the window of a jet as it rises into the sky. In Las Vegas, Alex holds the cut-out of Julie and Jim in front of the pyramid-shaped Luxor Hotel. Ryan aims the digital camera, and Alex moves the cut-out closer. He takes a picture while Alex stares at the cut-out. Ryan smiles, and Alex looks surprised before smiling warmly. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In Milwaukee, a jet comes in to land. Alex and Ryan walk through the airport terminal, with him pulling a black wheelie case and her a similar, neat red one. Later, they walk into the Chalet Suites, a Swiss lodge-themed hotel, and join a short queue of people checking in. Ryan notices a second counter with no queue. As Ryan opens a hotel room door, his sister Kara walks up holding a basket of washing. Alex and Ryan walk into their gaudily furnished room, where Ryan picks up a photocopied booklet with a picture of Julie and Jim on the front.",
    "6": "Natalie spins around and heads off. Ryan looks out of the window of a jet as it rises into the sky. In Las Vegas, Alex holds the cut-out of Julie and Jim in front of the pyramid-shaped Luxor Hotel. Ryan aims the digital camera, and Alex moves the cut-out closer. He takes a picture while Alex stares at the cut-out. Ryan smiles, and Alex looks surprised before smiling warmly. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In Milwaukee, a jet comes in to land. Alex and Ryan walk through the airport terminal, with him pulling a black wheelie case and her a similar, neat red one. Later, they walk into the Chalet Suites, a Swiss lodge-themed hotel, and join a short queue of people checking in. Ryan notices a second counter with no queue. As Ryan opens a hotel room door, his sister Kara walks up holding a basket of washing. Alex and Ryan walk into their gaudily furnished room, where Ryan picks up a photocopied booklet with a picture of Julie and Jim on the front.",
    "7": "Natalie spins around and heads off. Ryan looks out of the window of a jet as it rises into the sky. In Las Vegas, Alex holds the cut-out of Julie and Jim in front of the pyramid-shaped Luxor Hotel. Ryan aims the digital camera, and Alex moves the cut-out closer. He takes a picture while Alex stares at the cut-out. Ryan smiles, and Alex looks surprised before smiling warmly. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In Milwaukee, a jet comes in to land. Alex and Ryan walk through the airport terminal, with him pulling a black wheelie case and her a similar, neat red one. Later, they walk into the Chalet Suites, a Swiss lodge-themed hotel, and join a short queue of people checking in. Ryan notices a second counter with no queue. As Ryan opens a hotel room door, his sister Kara walks up holding a basket of washing. Alex and Ryan walk into their gaudily furnished room, where Ryan picks up a photocopied booklet with a picture of Julie and Jim on the front.",
    "8": "Natalie spins around and heads off. Ryan looks out of the window of a jet as it rises into the sky. In Las Vegas, Alex holds the cut-out of Julie and Jim in front of the pyramid-shaped Luxor Hotel. Ryan aims the digital camera, and Alex moves the cut-out closer. He takes a picture while Alex stares at the cut-out. Ryan smiles, and Alex looks surprised before smiling warmly. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In Milwaukee, a jet comes in to land. Alex and Ryan walk through the airport terminal, with him pulling a black wheelie case and her a similar, neat red one. Later, they walk into the Chalet Suites, a Swiss lodge-themed hotel, and join a short queue of people checking in. Ryan notices a second counter with no queue. As Ryan opens a hotel room door, his sister Kara walks up holding a basket of washing. Alex and Ryan walk into their gaudily furnished room, where Ryan picks up a photocopied booklet with a picture of Julie and Jim on the front.",
    "9": "Natalie spins around and heads off. Ryan looks out of the window of a jet as it rises into the sky. In Las Vegas, Alex holds the cut-out of Julie and Jim in front of the pyramid-shaped Luxor Hotel. Ryan aims the digital camera, and Alex moves the cut-out closer. He takes a picture while Alex stares at the cut-out. Ryan smiles, and Alex looks surprised before smiling warmly. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In Milwaukee, a jet comes in to land. Alex and Ryan walk through the airport terminal, with him pulling a black wheelie case and her a similar, neat red one. Later, they walk into the Chalet Suites, a Swiss lodge-themed hotel, and join a short queue of people checking in. Ryan notices a second counter with no queue. As Ryan opens a hotel room door, his sister Kara walks up holding a basket of washing. Alex and Ryan walk into their gaudily furnished room, where Ryan picks up a photocopied booklet with a picture of Julie and Jim on the front.",
    "10": "Natalie spins around and heads off. Ryan looks out of the window of a jet as it rises into the sky. In Las Vegas, Alex holds the cut-out of Julie and Jim in front of the pyramid-shaped Luxor Hotel. Ryan aims the digital camera, and Alex moves the cut-out closer. He takes a picture while Alex stares at the cut-out. Ryan smiles, and Alex looks surprised before smiling warmly. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In Milwaukee, a jet comes in to land. Alex and Ryan walk through the airport terminal, with him pulling a black wheelie case and her a similar, neat red one. Later, they walk into the Chalet Suites, a Swiss lodge-themed hotel, and join a short queue of people checking in. Ryan notices a second counter with no queue. As Ryan opens a hotel room door, his sister Kara walks up holding a basket of washing. Alex and Ryan walk into their gaudily furnished room, where Ryan picks up a photocopied booklet with a picture of Julie and Jim on the front."
  }
}