{
  "ground_truth": "Felipe perspires profusely and glowers intensely before clicking a red trigger with his thumb, causing the hotel lobby to explode. In the stairwell, Javier checks his watch, and outside, an ambulance hits the streets with Sam on its radio. A Secret Service agent heads downstairs, only to be shot by Javier. Javier watches more agents pass beneath him in the stairwell, then heads downstairs, easing a door open on level seven. He dons a ski mask, lurches through the doorway, and stabs an agent in the back. Another agent rounds the corner, and Javier attacks, killing the agent and drawing his gun. Meanwhile, Sam drives the ambulance through the streets at breakneck speed, careening through a junction and causing two cars to crash. Javier uses a mirror to spot two agents outside the President's room, then opens fire, shooting a third agent, and sets charges which blow the door to the President's room. He ducks inside and guns down Cavic, McCullough, and Heinkin before pointing his gun at Ashton. The ambulance arrives at the bombed hotel, and Veronica and Sam climb out. Sam taps his cell phone screen as the agent leads him away, and they kneel by a casualty. Barnes enters the GNN OB truck and flashes his ID as Veronica enters the elevator with a gurney and presses the button for level seven.",
  "iterations": {
    "1": "Felipe perspires profusely and glowers intensely before clicking a red trigger with his thumb, causing the hotel lobby to explode. In the stairwell, Javier checks his watch, and outside, an ambulance hits the streets with Sam on its radio. A Secret Service agent heads downstairs, only to be shot by Javier. Javier watches more agents pass beneath him in the stairwell, then heads downstairs, easing a door open on level seven. He dons a ski mask, lurches through the doorway, and stabs an agent in the back. Another agent rounds the corner, and Javier attacks, killing the agent and drawing his gun. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Meanwhile, Sam drives the ambulance through the streets at breakneck speed, careening through a junction and causing two cars to crash. Javier uses a mirror to spot two agents outside the President's room, then opens fire, shooting a third agent, and sets charges which blow the door to the President's room. He ducks inside and guns down Cavic, McCullough, and Heinkin before pointing his gun at Ashton. The ambulance arrives at the bombed hotel, and Veronica and Sam climb out. Sam taps his cell phone screen as the agent leads him away, and they kneel by a casualty. Barnes enters the GNN OB truck and flashes his ID as Veronica enters the elevator with a gurney and presses the button for level seven.",
    "2": "Felipe perspires profusely and glowers intensely before clicking a red trigger with his thumb, causing the hotel lobby to explode. In the stairwell, Javier checks his watch, and outside, an ambulance hits the streets with Sam on its radio. A Secret Service agent heads downstairs, only to be shot by Javier. Javier watches more agents pass beneath him in the stairwell, then heads downstairs, easing a door open on level seven. He dons a ski mask, lurches through the doorway, and stabs an agent in the back. Another agent rounds the corner, and Javier attacks, killing the agent and drawing his gun. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Meanwhile, Sam drives the ambulance through the streets at breakneck speed, careening through a junction and causing two cars to crash. Javier uses a mirror to spot two agents outside the President's room, then opens fire, shooting a third agent, and sets charges which blow the door to the President's room. He ducks inside and guns down Cavic, McCullough, and Heinkin before pointing his gun at Ashton. The ambulance arrives at the bombed hotel, and Veronica and Sam climb out. Sam taps his cell phone screen as the agent leads him away, and they kneel by a casualty. Barnes enters the GNN OB truck and flashes his ID as Veronica enters the elevator with a gurney and presses the button for level seven.",
    "3": "Felipe perspires profusely and glowers intensely before clicking a red trigger with his thumb, causing the hotel lobby to explode. In the stairwell, Javier checks his watch, and outside, an ambulance hits the streets with Sam on its radio. A Secret Service agent heads downstairs, only to be shot by Javier. Javier watches more agents pass beneath him in the stairwell, then heads downstairs, easing a door open on level seven. He dons a ski mask, lurches through the doorway, and stabs an agent in the back. Another agent rounds the corner, and Javier attacks, killing the agent and drawing his gun. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Meanwhile, Sam drives the ambulance through the streets at breakneck speed, careening through a junction and causing two cars to crash. Javier uses a mirror to spot two agents outside the President's room, then opens fire, shooting a third agent, and sets charges which blow the door to the President's room. He ducks inside and guns down Cavic, McCullough, and Heinkin before pointing his gun at Ashton. The ambulance arrives at the bombed hotel, and Veronica and Sam climb out. Sam taps his cell phone screen as the agent leads him away, and they kneel by a casualty. Barnes enters the GNN OB truck and flashes his ID as Veronica enters the elevator with a gurney and presses the button for level seven.",
    "4": "Felipe perspires profusely and glowers intensely before clicking a red trigger with his thumb, causing the hotel lobby to explode. In the stairwell, Javier checks his watch, and outside, an ambulance hits the streets with Sam on its radio. A Secret Service agent heads downstairs, only to be shot by Javier. Javier watches more agents pass beneath him in the stairwell, then heads downstairs, easing a door open on level seven. He dons a ski mask, lurches through the doorway, and stabs an agent in the back. Another agent rounds the corner, and Javier attacks, killing the agent and drawing his gun. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Meanwhile, Sam drives the ambulance through the streets at breakneck speed, careening through a junction and causing two cars to crash. Javier uses a mirror to spot two agents outside the President's room, then opens fire, shooting a third agent, and sets charges which blow the door to the President's room. He ducks inside and guns down Cavic, McCullough, and Heinkin before pointing his gun at Ashton. The ambulance arrives at the bombed hotel, and Veronica and Sam climb out. Sam taps his cell phone screen as the agent leads him away, and they kneel by a casualty. Barnes enters the GNN OB truck and flashes his ID as Veronica enters the elevator with a gurney and presses the button for level seven.",
    "5": "Felipe perspires profusely and glowers intensely before clicking a red trigger with his thumb, causing the hotel lobby to explode. In the stairwell, Javier checks his watch, and outside, an ambulance hits the streets with Sam on its radio. A Secret Service agent heads downstairs, only to be shot by Javier. Javier watches more agents pass beneath him in the stairwell, then heads downstairs, easing a door open on level seven. He dons a ski mask, lurches through the doorway, and stabs an agent in the back. Another agent rounds the corner, and Javier attacks, killing the agent and drawing his gun. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Meanwhile, Sam drives the ambulance through the streets at breakneck speed, careening through a junction and causing two cars to crash. Javier uses a mirror to spot two agents outside the President's room, then opens fire, shooting a third agent, and sets charges which blow the door to the President's room. He ducks inside and guns down Cavic, McCullough, and Heinkin before pointing his gun at Ashton. The ambulance arrives at the bombed hotel, and Veronica and Sam climb out. Sam taps his cell phone screen as the agent leads him away, and they kneel by a casualty. Barnes enters the GNN OB truck and flashes his ID as Veronica enters the elevator with a gurney and presses the button for level seven.",
    "6": "Felipe perspires profusely and glowers intensely before clicking a red trigger with his thumb, causing the hotel lobby to explode. In the stairwell, Javier checks his watch, and outside, an ambulance hits the streets with Sam on its radio. A Secret Service agent heads downstairs, only to be shot by Javier. Javier watches more agents pass beneath him in the stairwell, then heads downstairs, easing a door open on level seven. He dons a ski mask, lurches through the doorway, and stabs an agent in the back. Another agent rounds the corner, and Javier attacks, killing the agent and drawing his gun. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Meanwhile, Sam drives the ambulance through the streets at breakneck speed, careening through a junction and causing two cars to crash. Javier uses a mirror to spot two agents outside the President's room, then opens fire, shooting a third agent, and sets charges which blow the door to the President's room. He ducks inside and guns down Cavic, McCullough, and Heinkin before pointing his gun at Ashton. The ambulance arrives at the bombed hotel, and Veronica and Sam climb out. Sam taps his cell phone screen as the agent leads him away, and they kneel by a casualty. Barnes enters the GNN OB truck and flashes his ID as Veronica enters the elevator with a gurney and presses the button for level seven.",
    "7": "Felipe perspires profusely and glowers intensely before clicking a red trigger with his thumb, causing the hotel lobby to explode. In the stairwell, Javier checks his watch, and outside, an ambulance hits the streets with Sam on its radio. A Secret Service agent heads downstairs, only to be shot by Javier. Javier watches more agents pass beneath him in the stairwell, then heads downstairs, easing a door open on level seven. He dons a ski mask, lurches through the doorway, and stabs an agent in the back. Another agent rounds the corner, and Javier attacks, killing the agent and drawing his gun. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Meanwhile, Sam drives the ambulance through the streets at breakneck speed, careening through a junction and causing two cars to crash. Javier uses a mirror to spot two agents outside the President's room, then opens fire, shooting a third agent, and sets charges which blow the door to the President's room. He ducks inside and guns down Cavic, McCullough, and Heinkin before pointing his gun at Ashton. The ambulance arrives at the bombed hotel, and Veronica and Sam climb out. Sam taps his cell phone screen as the agent leads him away, and they kneel by a casualty. Barnes enters the GNN OB truck and flashes his ID as Veronica enters the elevator with a gurney and presses the button for level seven.",
    "8": "Felipe perspires profusely and glowers intensely before clicking a red trigger with his thumb, causing the hotel lobby to explode. In the stairwell, Javier checks his watch, and outside, an ambulance hits the streets with Sam on its radio. A Secret Service agent heads downstairs, only to be shot by Javier. Javier watches more agents pass beneath him in the stairwell, then heads downstairs, easing a door open on level seven. He dons a ski mask, lurches through the doorway, and stabs an agent in the back. Another agent rounds the corner, and Javier attacks, killing the agent and drawing his gun. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Meanwhile, Sam drives the ambulance through the streets at breakneck speed, careening through a junction and causing two cars to crash. Javier uses a mirror to spot two agents outside the President's room, then opens fire, shooting a third agent, and sets charges which blow the door to the President's room. He ducks inside and guns down Cavic, McCullough, and Heinkin before pointing his gun at Ashton. The ambulance arrives at the bombed hotel, and Veronica and Sam climb out. Sam taps his cell phone screen as the agent leads him away, and they kneel by a casualty. Barnes enters the GNN OB truck and flashes his ID as Veronica enters the elevator with a gurney and presses the button for level seven.",
    "9": "Felipe perspires profusely and glowers intensely before clicking a red trigger with his thumb, causing the hotel lobby to explode. In the stairwell, Javier checks his watch, and outside, an ambulance hits the streets with Sam on its radio. A Secret Service agent heads downstairs, only to be shot by Javier. Javier watches more agents pass beneath him in the stairwell, then heads downstairs, easing a door open on level seven. He dons a ski mask, lurches through the doorway, and stabs an agent in the back. Another agent rounds the corner, and Javier attacks, killing the agent and drawing his gun. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Meanwhile, Sam drives the ambulance through the streets at breakneck speed, careening through a junction and causing two cars to crash. Javier uses a mirror to spot two agents outside the President's room, then opens fire, shooting a third agent, and sets charges which blow the door to the President's room. He ducks inside and guns down Cavic, McCullough, and Heinkin before pointing his gun at Ashton. The ambulance arrives at the bombed hotel, and Veronica and Sam climb out. Sam taps his cell phone screen as the agent leads him away, and they kneel by a casualty. Barnes enters the GNN OB truck and flashes his ID as Veronica enters the elevator with a gurney and presses the button for level seven.",
    "10": "Felipe perspires profusely and glowers intensely before clicking a red trigger with his thumb, causing the hotel lobby to explode. In the stairwell, Javier checks his watch, and outside, an ambulance hits the streets with Sam on its radio. A Secret Service agent heads downstairs, only to be shot by Javier. Javier watches more agents pass beneath him in the stairwell, then heads downstairs, easing a door open on level seven. He dons a ski mask, lurches through the doorway, and stabs an agent in the back. Another agent rounds the corner, and Javier attacks, killing the agent and drawing his gun. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Meanwhile, Sam drives the ambulance through the streets at breakneck speed, careening through a junction and causing two cars to crash. Javier uses a mirror to spot two agents outside the President's room, then opens fire, shooting a third agent, and sets charges which blow the door to the President's room. He ducks inside and guns down Cavic, McCullough, and Heinkin before pointing his gun at Ashton. The ambulance arrives at the bombed hotel, and Veronica and Sam climb out. Sam taps his cell phone screen as the agent leads him away, and they kneel by a casualty. Barnes enters the GNN OB truck and flashes his ID as Veronica enters the elevator with a gurney and presses the button for level seven."
  }
}