{
  "ground_truth": "Enrique approaches a security checkpoint and a female officer, who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them, the short cropped-haired man walks away, and the two exchange looks as Enrique strides up to the pretty long-haired woman, Veronica. He grabs her hair and pushes her against a pillar; she holds his head. As she hugs him, he hands her her bag. Enrique reluctantly lets go of her hand and moves away, stopping to glance back. She blows him a kiss. Enrique turns and walks to the security barrier, where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern, and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation. The young man leaves her, and Enrique looks up as the Mayor finishes his introduction.",
  "iterations": {
    "1": "Enrique approaches a security checkpoint and a female officer, who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them, the short cropped-haired man walks away, and the two exchange looks as Enrique strides up to the pretty long-haired woman, Veronica. He grabs her hair and pushes her against a pillar; she holds his head. As she hugs him, he hands her her bag. Enrique reluctantly lets go of her hand and moves away, stopping to glance back. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. She blows him a kiss. Enrique turns and walks to the security barrier, where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern, and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation. The young man leaves her, and Enrique looks up as the Mayor finishes his introduction.",
    "2": "Enrique approaches a security checkpoint and a female officer, who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them, the short cropped-haired man walks away, and the two exchange looks as Enrique strides up to the pretty long-haired woman, Veronica. He grabs her hair and pushes her against a pillar; she holds his head. As she hugs him, he hands her her bag. Enrique reluctantly lets go of her hand and moves away, stopping to glance back. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. She blows him a kiss. Enrique turns and walks to the security barrier, where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern, and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation. The young man leaves her, and Enrique looks up as the Mayor finishes his introduction.",
    "3": "Enrique approaches a security checkpoint and a female officer, who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them, the short cropped-haired man walks away, and the two exchange looks as Enrique strides up to the pretty long-haired woman, Veronica. He grabs her hair and pushes her against a pillar; she holds his head. As she hugs him, he hands her her bag. Enrique reluctantly lets go of her hand and moves away, stopping to glance back. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. She blows him a kiss. Enrique turns and walks to the security barrier, where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern, and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation. The young man leaves her, and Enrique looks up as the Mayor finishes his introduction.",
    "4": "Enrique approaches a security checkpoint and a female officer, who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them, the short cropped-haired man walks away, and the two exchange looks as Enrique strides up to the pretty long-haired woman, Veronica. He grabs her hair and pushes her against a pillar; she holds his head. As she hugs him, he hands her her bag. Enrique reluctantly lets go of her hand and moves away, stopping to glance back. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. She blows him a kiss. Enrique turns and walks to the security barrier, where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern, and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation. The young man leaves her, and Enrique looks up as the Mayor finishes his introduction.",
    "5": "Enrique approaches a security checkpoint and a female officer, who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them, the short cropped-haired man walks away, and the two exchange looks as Enrique strides up to the pretty long-haired woman, Veronica. He grabs her hair and pushes her against a pillar; she holds his head. As she hugs him, he hands her her bag. Enrique reluctantly lets go of her hand and moves away, stopping to glance back. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. She blows him a kiss. Enrique turns and walks to the security barrier, where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern, and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation. The young man leaves her, and Enrique looks up as the Mayor finishes his introduction.",
    "6": "Enrique approaches a security checkpoint and a female officer, who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them, the short cropped-haired man walks away, and the two exchange looks as Enrique strides up to the pretty long-haired woman, Veronica. He grabs her hair and pushes her against a pillar; she holds his head. As she hugs him, he hands her her bag. Enrique reluctantly lets go of her hand and moves away, stopping to glance back. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. She blows him a kiss. Enrique turns and walks to the security barrier, where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern, and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation. The young man leaves her, and Enrique looks up as the Mayor finishes his introduction.",
    "7": "Enrique approaches a security checkpoint and a female officer, who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them, the short cropped-haired man walks away, and the two exchange looks as Enrique strides up to the pretty long-haired woman, Veronica. He grabs her hair and pushes her against a pillar; she holds his head. As she hugs him, he hands her her bag. Enrique reluctantly lets go of her hand and moves away, stopping to glance back. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. She blows him a kiss. Enrique turns and walks to the security barrier, where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern, and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation. The young man leaves her, and Enrique looks up as the Mayor finishes his introduction.",
    "8": "Enrique approaches a security checkpoint and a female officer, who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them, the short cropped-haired man walks away, and the two exchange looks as Enrique strides up to the pretty long-haired woman, Veronica. He grabs her hair and pushes her against a pillar; she holds his head. As she hugs him, he hands her her bag. Enrique reluctantly lets go of her hand and moves away, stopping to glance back. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. She blows him a kiss. Enrique turns and walks to the security barrier, where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern, and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation. The young man leaves her, and Enrique looks up as the Mayor finishes his introduction.",
    "9": "Enrique approaches a security checkpoint and a female officer, who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them, the short cropped-haired man walks away, and the two exchange looks as Enrique strides up to the pretty long-haired woman, Veronica. He grabs her hair and pushes her against a pillar; she holds his head. As she hugs him, he hands her her bag. Enrique reluctantly lets go of her hand and moves away, stopping to glance back. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. She blows him a kiss. Enrique turns and walks to the security barrier, where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern, and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation. The young man leaves her, and Enrique looks up as the Mayor finishes his introduction.",
    "10": "Enrique approaches a security checkpoint and a female officer, who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them, the short cropped-haired man walks away, and the two exchange looks as Enrique strides up to the pretty long-haired woman, Veronica. He grabs her hair and pushes her against a pillar; she holds his head. As she hugs him, he hands her her bag. Enrique reluctantly lets go of her hand and moves away, stopping to glance back. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. She blows him a kiss. Enrique turns and walks to the security barrier, where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern, and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation. The young man leaves her, and Enrique looks up as the Mayor finishes his introduction."
  }
}