{
  "ground_truth": "An uneasy silence descends, during which Mrs. Bennet winks at Kitty and Lizzie, gesturing to Jane and Mr. Bingley. Kitty glances at Jane, then at her mother, in confusion. She nods to Mr. Bingley, then leaves the room, followed by Mary and Kitty. Once they have left, Mr. Bingley sits back down. Lizzie casually takes up her embroidery, turning slightly to afford Mr. Bingley and Jane some privacy. Lizzie puts down her embroidery, smiles at Mr. Bingley, then leaves the room. She gives Jane a warning glance as she leaves. Mr. Bingley looks nervously down at Jane, who eventually raises her eyes demurely to meet his. An anxious Mrs. Bennet and the rest of the girls are sitting in another room, waiting. Mrs. Bennet sits with a smug expression. Moments later, Lizzie is skipping quietly down the stairs. She treads silently up to the door of the parlor, then walks inside to find her sister and Mr. Bingley standing together at the mantelpiece.",
  "iterations": {
    "1": "An uneasy silence descends, during which Mrs. Bennet winks at Kitty and Lizzie, gesturing to Jane and Mr. Bingley. Kitty glances at Jane, then at her mother, in confusion. She nods to Mr. Bingley, then leaves the room, followed by Mary and Kitty. Once they have left, Mr. Bingley sits back down. Lizzie casually takes up her embroidery, turning slightly to afford Mr. Bingley and Jane some privacy. Lizzie puts down her embroidery, smiles at Mr. Bingley, then leaves the room. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. She gives Jane a warning glance as she leaves. Mr. Bingley looks nervously down at Jane, who eventually raises her eyes demurely to meet his. An anxious Mrs. Bennet and the rest of the girls are sitting in another room, waiting. Mrs. Bennet sits with a smug expression. Moments later, Lizzie is skipping quietly down the stairs. She treads silently up to the door of the parlor, then walks inside to find her sister and Mr. Bingley standing together at the mantelpiece.",
    "2": "An uneasy silence descends, during which Mrs. Bennet winks at Kitty and Lizzie, gesturing to Jane and Mr. Bingley. Kitty glances at Jane, then at her mother, in confusion. She nods to Mr. Bingley, then leaves the room, followed by Mary and Kitty. Once they have left, Mr. Bingley sits back down. Lizzie casually takes up her embroidery, turning slightly to afford Mr. Bingley and Jane some privacy. Lizzie puts down her embroidery, smiles at Mr. Bingley, then leaves the room. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. She gives Jane a warning glance as she leaves. Mr. Bingley looks nervously down at Jane, who eventually raises her eyes demurely to meet his. An anxious Mrs. Bennet and the rest of the girls are sitting in another room, waiting. Mrs. Bennet sits with a smug expression. Moments later, Lizzie is skipping quietly down the stairs. She treads silently up to the door of the parlor, then walks inside to find her sister and Mr. Bingley standing together at the mantelpiece.",
    "3": "An uneasy silence descends, during which Mrs. Bennet winks at Kitty and Lizzie, gesturing to Jane and Mr. Bingley. Kitty glances at Jane, then at her mother, in confusion. She nods to Mr. Bingley, then leaves the room, followed by Mary and Kitty. Once they have left, Mr. Bingley sits back down. Lizzie casually takes up her embroidery, turning slightly to afford Mr. Bingley and Jane some privacy. Lizzie puts down her embroidery, smiles at Mr. Bingley, then leaves the room. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. She gives Jane a warning glance as she leaves. Mr. Bingley looks nervously down at Jane, who eventually raises her eyes demurely to meet his. An anxious Mrs. Bennet and the rest of the girls are sitting in another room, waiting. Mrs. Bennet sits with a smug expression. Moments later, Lizzie is skipping quietly down the stairs. She treads silently up to the door of the parlor, then walks inside to find her sister and Mr. Bingley standing together at the mantelpiece.",
    "4": "An uneasy silence descends, during which Mrs. Bennet winks at Kitty and Lizzie, gesturing to Jane and Mr. Bingley. Kitty glances at Jane, then at her mother, in confusion. She nods to Mr. Bingley, then leaves the room, followed by Mary and Kitty. Once they have left, Mr. Bingley sits back down. Lizzie casually takes up her embroidery, turning slightly to afford Mr. Bingley and Jane some privacy. Lizzie puts down her embroidery, smiles at Mr. Bingley, then leaves the room. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. She gives Jane a warning glance as she leaves. Mr. Bingley looks nervously down at Jane, who eventually raises her eyes demurely to meet his. An anxious Mrs. Bennet and the rest of the girls are sitting in another room, waiting. Mrs. Bennet sits with a smug expression. Moments later, Lizzie is skipping quietly down the stairs. She treads silently up to the door of the parlor, then walks inside to find her sister and Mr. Bingley standing together at the mantelpiece.",
    "5": "An uneasy silence descends, during which Mrs. Bennet winks at Kitty and Lizzie, gesturing to Jane and Mr. Bingley. Kitty glances at Jane, then at her mother, in confusion. She nods to Mr. Bingley, then leaves the room, followed by Mary and Kitty. Once they have left, Mr. Bingley sits back down. Lizzie casually takes up her embroidery, turning slightly to afford Mr. Bingley and Jane some privacy. Lizzie puts down her embroidery, smiles at Mr. Bingley, then leaves the room. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. She gives Jane a warning glance as she leaves. Mr. Bingley looks nervously down at Jane, who eventually raises her eyes demurely to meet his. An anxious Mrs. Bennet and the rest of the girls are sitting in another room, waiting. Mrs. Bennet sits with a smug expression. Moments later, Lizzie is skipping quietly down the stairs. She treads silently up to the door of the parlor, then walks inside to find her sister and Mr. Bingley standing together at the mantelpiece.",
    "6": "An uneasy silence descends, during which Mrs. Bennet winks at Kitty and Lizzie, gesturing to Jane and Mr. Bingley. Kitty glances at Jane, then at her mother, in confusion. She nods to Mr. Bingley, then leaves the room, followed by Mary and Kitty. Once they have left, Mr. Bingley sits back down. Lizzie casually takes up her embroidery, turning slightly to afford Mr. Bingley and Jane some privacy. Lizzie puts down her embroidery, smiles at Mr. Bingley, then leaves the room. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. She gives Jane a warning glance as she leaves. Mr. Bingley looks nervously down at Jane, who eventually raises her eyes demurely to meet his. An anxious Mrs. Bennet and the rest of the girls are sitting in another room, waiting. Mrs. Bennet sits with a smug expression. Moments later, Lizzie is skipping quietly down the stairs. She treads silently up to the door of the parlor, then walks inside to find her sister and Mr. Bingley standing together at the mantelpiece.",
    "7": "An uneasy silence descends, during which Mrs. Bennet winks at Kitty and Lizzie, gesturing to Jane and Mr. Bingley. Kitty glances at Jane, then at her mother, in confusion. She nods to Mr. Bingley, then leaves the room, followed by Mary and Kitty. Once they have left, Mr. Bingley sits back down. Lizzie casually takes up her embroidery, turning slightly to afford Mr. Bingley and Jane some privacy. Lizzie puts down her embroidery, smiles at Mr. Bingley, then leaves the room. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. She gives Jane a warning glance as she leaves. Mr. Bingley looks nervously down at Jane, who eventually raises her eyes demurely to meet his. An anxious Mrs. Bennet and the rest of the girls are sitting in another room, waiting. Mrs. Bennet sits with a smug expression. Moments later, Lizzie is skipping quietly down the stairs. She treads silently up to the door of the parlor, then walks inside to find her sister and Mr. Bingley standing together at the mantelpiece.",
    "8": "An uneasy silence descends, during which Mrs. Bennet winks at Kitty and Lizzie, gesturing to Jane and Mr. Bingley. Kitty glances at Jane, then at her mother, in confusion. She nods to Mr. Bingley, then leaves the room, followed by Mary and Kitty. Once they have left, Mr. Bingley sits back down. Lizzie casually takes up her embroidery, turning slightly to afford Mr. Bingley and Jane some privacy. Lizzie puts down her embroidery, smiles at Mr. Bingley, then leaves the room. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. She gives Jane a warning glance as she leaves. Mr. Bingley looks nervously down at Jane, who eventually raises her eyes demurely to meet his. An anxious Mrs. Bennet and the rest of the girls are sitting in another room, waiting. Mrs. Bennet sits with a smug expression. Moments later, Lizzie is skipping quietly down the stairs. She treads silently up to the door of the parlor, then walks inside to find her sister and Mr. Bingley standing together at the mantelpiece.",
    "9": "An uneasy silence descends, during which Mrs. Bennet winks at Kitty and Lizzie, gesturing to Jane and Mr. Bingley. Kitty glances at Jane, then at her mother, in confusion. She nods to Mr. Bingley, then leaves the room, followed by Mary and Kitty. Once they have left, Mr. Bingley sits back down. Lizzie casually takes up her embroidery, turning slightly to afford Mr. Bingley and Jane some privacy. Lizzie puts down her embroidery, smiles at Mr. Bingley, then leaves the room. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. She gives Jane a warning glance as she leaves. Mr. Bingley looks nervously down at Jane, who eventually raises her eyes demurely to meet his. An anxious Mrs. Bennet and the rest of the girls are sitting in another room, waiting. Mrs. Bennet sits with a smug expression. Moments later, Lizzie is skipping quietly down the stairs. She treads silently up to the door of the parlor, then walks inside to find her sister and Mr. Bingley standing together at the mantelpiece.",
    "10": "An uneasy silence descends, during which Mrs. Bennet winks at Kitty and Lizzie, gesturing to Jane and Mr. Bingley. Kitty glances at Jane, then at her mother, in confusion. She nods to Mr. Bingley, then leaves the room, followed by Mary and Kitty. Once they have left, Mr. Bingley sits back down. Lizzie casually takes up her embroidery, turning slightly to afford Mr. Bingley and Jane some privacy. Lizzie puts down her embroidery, smiles at Mr. Bingley, then leaves the room. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. She gives Jane a warning glance as she leaves. Mr. Bingley looks nervously down at Jane, who eventually raises her eyes demurely to meet his. An anxious Mrs. Bennet and the rest of the girls are sitting in another room, waiting. Mrs. Bennet sits with a smug expression. Moments later, Lizzie is skipping quietly down the stairs. She treads silently up to the door of the parlor, then walks inside to find her sister and Mr. Bingley standing together at the mantelpiece."
  }
}