{
  "ground_truth": "Jenny puts her hand on Forrest's hand, and Forrest nods as he remembers while continuing to talk to the black woman, who looks up from her magazine. Jenny and Forrest walk, but a dirt clod hits Forrest in the back of the head, causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks, and Forrest is hit in the eye with another dirt clod, causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy #1 and Boy #2 throw more dirt clods at him, with another one hitting him in the arm. Forrest tries to run along the road, but his braces make it impossible, so he hobbles along as Jenny yells after him. Boy #1 and Boy #2 turn back toward the bikes, and the boys ride after Forrest, who continues to hobble along the dirt road while Jenny stands and watches. Forrest looks over his shoulder as the three boys race on their bikes, and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head, but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed, running from the chasing boys. The boys pedal faster as they gain on Forrest, who looks over his shoulder in fear and tries to run even faster to get away. Suddenly, his braces shatter, sending steel and plastic flying into the air. Surprised, Forrest runs and looks down at his legs as he continues to run faster, with the metal braces and straps flying off his legs.",
  "iterations": {
    "1": "Jenny puts her hand on Forrest's hand, and Forrest nods as he remembers while continuing to talk to the black woman, who looks up from her magazine. Jenny and Forrest walk, but a dirt clod hits Forrest in the back of the head, causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks, and Forrest is hit in the eye with another dirt clod, causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy #1 and Boy #2 throw more dirt clods at him, with another one hitting him in the arm. Forrest tries to run along the road, but his braces make it impossible, so he hobbles along as Jenny yells after him. Boy #1 and Boy #2 turn back toward the bikes, and the boys ride after Forrest, who continues to hobble along the dirt road while Jenny stands and watches. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Forrest looks over his shoulder as the three boys race on their bikes, and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head, but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed, running from the chasing boys. The boys pedal faster as they gain on Forrest, who looks over his shoulder in fear and tries to run even faster to get away. Suddenly, his braces shatter, sending steel and plastic flying into the air. Surprised, Forrest runs and looks down at his legs as he continues to run faster, with the metal braces and straps flying off his legs.",
    "2": "Jenny puts her hand on Forrest's hand, and Forrest nods as he remembers while continuing to talk to the black woman, who looks up from her magazine. Jenny and Forrest walk, but a dirt clod hits Forrest in the back of the head, causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks, and Forrest is hit in the eye with another dirt clod, causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy #1 and Boy #2 throw more dirt clods at him, with another one hitting him in the arm. Forrest tries to run along the road, but his braces make it impossible, so he hobbles along as Jenny yells after him. Boy #1 and Boy #2 turn back toward the bikes, and the boys ride after Forrest, who continues to hobble along the dirt road while Jenny stands and watches. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Forrest looks over his shoulder as the three boys race on their bikes, and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head, but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed, running from the chasing boys. The boys pedal faster as they gain on Forrest, who looks over his shoulder in fear and tries to run even faster to get away. Suddenly, his braces shatter, sending steel and plastic flying into the air. Surprised, Forrest runs and looks down at his legs as he continues to run faster, with the metal braces and straps flying off his legs.",
    "3": "Jenny puts her hand on Forrest's hand, and Forrest nods as he remembers while continuing to talk to the black woman, who looks up from her magazine. Jenny and Forrest walk, but a dirt clod hits Forrest in the back of the head, causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks, and Forrest is hit in the eye with another dirt clod, causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy #1 and Boy #2 throw more dirt clods at him, with another one hitting him in the arm. Forrest tries to run along the road, but his braces make it impossible, so he hobbles along as Jenny yells after him. Boy #1 and Boy #2 turn back toward the bikes, and the boys ride after Forrest, who continues to hobble along the dirt road while Jenny stands and watches. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Forrest looks over his shoulder as the three boys race on their bikes, and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head, but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed, running from the chasing boys. The boys pedal faster as they gain on Forrest, who looks over his shoulder in fear and tries to run even faster to get away. Suddenly, his braces shatter, sending steel and plastic flying into the air. Surprised, Forrest runs and looks down at his legs as he continues to run faster, with the metal braces and straps flying off his legs.",
    "4": "Jenny puts her hand on Forrest's hand, and Forrest nods as he remembers while continuing to talk to the black woman, who looks up from her magazine. Jenny and Forrest walk, but a dirt clod hits Forrest in the back of the head, causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks, and Forrest is hit in the eye with another dirt clod, causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy #1 and Boy #2 throw more dirt clods at him, with another one hitting him in the arm. Forrest tries to run along the road, but his braces make it impossible, so he hobbles along as Jenny yells after him. Boy #1 and Boy #2 turn back toward the bikes, and the boys ride after Forrest, who continues to hobble along the dirt road while Jenny stands and watches. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Forrest looks over his shoulder as the three boys race on their bikes, and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head, but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed, running from the chasing boys. The boys pedal faster as they gain on Forrest, who looks over his shoulder in fear and tries to run even faster to get away. Suddenly, his braces shatter, sending steel and plastic flying into the air. Surprised, Forrest runs and looks down at his legs as he continues to run faster, with the metal braces and straps flying off his legs.",
    "5": "Jenny puts her hand on Forrest's hand, and Forrest nods as he remembers while continuing to talk to the black woman, who looks up from her magazine. Jenny and Forrest walk, but a dirt clod hits Forrest in the back of the head, causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks, and Forrest is hit in the eye with another dirt clod, causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy #1 and Boy #2 throw more dirt clods at him, with another one hitting him in the arm. Forrest tries to run along the road, but his braces make it impossible, so he hobbles along as Jenny yells after him. Boy #1 and Boy #2 turn back toward the bikes, and the boys ride after Forrest, who continues to hobble along the dirt road while Jenny stands and watches. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Forrest looks over his shoulder as the three boys race on their bikes, and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head, but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed, running from the chasing boys. The boys pedal faster as they gain on Forrest, who looks over his shoulder in fear and tries to run even faster to get away. Suddenly, his braces shatter, sending steel and plastic flying into the air. Surprised, Forrest runs and looks down at his legs as he continues to run faster, with the metal braces and straps flying off his legs.",
    "6": "Jenny puts her hand on Forrest's hand, and Forrest nods as he remembers while continuing to talk to the black woman, who looks up from her magazine. Jenny and Forrest walk, but a dirt clod hits Forrest in the back of the head, causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks, and Forrest is hit in the eye with another dirt clod, causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy #1 and Boy #2 throw more dirt clods at him, with another one hitting him in the arm. Forrest tries to run along the road, but his braces make it impossible, so he hobbles along as Jenny yells after him. Boy #1 and Boy #2 turn back toward the bikes, and the boys ride after Forrest, who continues to hobble along the dirt road while Jenny stands and watches. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Forrest looks over his shoulder as the three boys race on their bikes, and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head, but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed, running from the chasing boys. The boys pedal faster as they gain on Forrest, who looks over his shoulder in fear and tries to run even faster to get away. Suddenly, his braces shatter, sending steel and plastic flying into the air. Surprised, Forrest runs and looks down at his legs as he continues to run faster, with the metal braces and straps flying off his legs.",
    "7": "Jenny puts her hand on Forrest's hand, and Forrest nods as he remembers while continuing to talk to the black woman, who looks up from her magazine. Jenny and Forrest walk, but a dirt clod hits Forrest in the back of the head, causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks, and Forrest is hit in the eye with another dirt clod, causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy #1 and Boy #2 throw more dirt clods at him, with another one hitting him in the arm. Forrest tries to run along the road, but his braces make it impossible, so he hobbles along as Jenny yells after him. Boy #1 and Boy #2 turn back toward the bikes, and the boys ride after Forrest, who continues to hobble along the dirt road while Jenny stands and watches. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Forrest looks over his shoulder as the three boys race on their bikes, and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head, but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed, running from the chasing boys. The boys pedal faster as they gain on Forrest, who looks over his shoulder in fear and tries to run even faster to get away. Suddenly, his braces shatter, sending steel and plastic flying into the air. Surprised, Forrest runs and looks down at his legs as he continues to run faster, with the metal braces and straps flying off his legs.",
    "8": "Jenny puts her hand on Forrest's hand, and Forrest nods as he remembers while continuing to talk to the black woman, who looks up from her magazine. Jenny and Forrest walk, but a dirt clod hits Forrest in the back of the head, causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks, and Forrest is hit in the eye with another dirt clod, causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy #1 and Boy #2 throw more dirt clods at him, with another one hitting him in the arm. Forrest tries to run along the road, but his braces make it impossible, so he hobbles along as Jenny yells after him. Boy #1 and Boy #2 turn back toward the bikes, and the boys ride after Forrest, who continues to hobble along the dirt road while Jenny stands and watches. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Forrest looks over his shoulder as the three boys race on their bikes, and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head, but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed, running from the chasing boys. The boys pedal faster as they gain on Forrest, who looks over his shoulder in fear and tries to run even faster to get away. Suddenly, his braces shatter, sending steel and plastic flying into the air. Surprised, Forrest runs and looks down at his legs as he continues to run faster, with the metal braces and straps flying off his legs.",
    "9": "Jenny puts her hand on Forrest's hand, and Forrest nods as he remembers while continuing to talk to the black woman, who looks up from her magazine. Jenny and Forrest walk, but a dirt clod hits Forrest in the back of the head, causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks, and Forrest is hit in the eye with another dirt clod, causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy #1 and Boy #2 throw more dirt clods at him, with another one hitting him in the arm. Forrest tries to run along the road, but his braces make it impossible, so he hobbles along as Jenny yells after him. Boy #1 and Boy #2 turn back toward the bikes, and the boys ride after Forrest, who continues to hobble along the dirt road while Jenny stands and watches. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Forrest looks over his shoulder as the three boys race on their bikes, and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head, but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed, running from the chasing boys. The boys pedal faster as they gain on Forrest, who looks over his shoulder in fear and tries to run even faster to get away. Suddenly, his braces shatter, sending steel and plastic flying into the air. Surprised, Forrest runs and looks down at his legs as he continues to run faster, with the metal braces and straps flying off his legs.",
    "10": "Jenny puts her hand on Forrest's hand, and Forrest nods as he remembers while continuing to talk to the black woman, who looks up from her magazine. Jenny and Forrest walk, but a dirt clod hits Forrest in the back of the head, causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks, and Forrest is hit in the eye with another dirt clod, causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy #1 and Boy #2 throw more dirt clods at him, with another one hitting him in the arm. Forrest tries to run along the road, but his braces make it impossible, so he hobbles along as Jenny yells after him. Boy #1 and Boy #2 turn back toward the bikes, and the boys ride after Forrest, who continues to hobble along the dirt road while Jenny stands and watches. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Forrest looks over his shoulder as the three boys race on their bikes, and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head, but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed, running from the chasing boys. The boys pedal faster as they gain on Forrest, who looks over his shoulder in fear and tries to run even faster to get away. Suddenly, his braces shatter, sending steel and plastic flying into the air. Surprised, Forrest runs and looks down at his legs as he continues to run faster, with the metal braces and straps flying off his legs."
  }
}