{
  "ground_truth": "Jenny smiles as she looks around the glamorous hall and all the table lamps while Helen and Danny exchange a worried look. David glances at Jenny, who freezes, but then she smiles happily and applauds the singer, keeping her eyes on the stage. Danny and Helen talk together as Jenny watches the glamorous couple. As David looks at her, she glances back at him and smiles self-consciously, while Helen and Danny are completely wrapped up in one another. Jenny smiles at David, and they both laugh; she grins happily to herself. Later, Jenny arrives home, cautiously opens the door, and walks quietly in. Her mother is in the kitchen and gives a non-committal nod before returning to her casserole. Margarie glances over her shoulder, and Jenny trudges sadly from the kitchen. The next day, David waits by his car outside the school as Jenny hurries out, having changed out of her school uniform. They both grin as she gets into the passenger seat and David gets behind the wheel, driving the Bristol off to the auction. At the auction, Danny smiles knowingly as a woman shakes her head, while Jenny reaches with excitement and David grins. Later, at Danny's palatial place filled with art and luxury furniture, Helen turns and stares at Jenny, and they shake on something.",
  "iterations": {
    "1": "Jenny smiles as she looks around the glamorous hall and all the table lamps while Helen and Danny exchange a worried look. David glances at Jenny, who freezes, but then she smiles happily and applauds the singer, keeping her eyes on the stage. Danny and Helen talk together as Jenny watches the glamorous couple. As David looks at her, she glances back at him and smiles self-consciously, while Helen and Danny are completely wrapped up in one another. Jenny smiles at David, and they both laugh; she grins happily to herself. Later, Jenny arrives home, cautiously opens the door, and walks quietly in. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Her mother is in the kitchen and gives a non-committal nod before returning to her casserole. Margarie glances over her shoulder, and Jenny trudges sadly from the kitchen. The next day, David waits by his car outside the school as Jenny hurries out, having changed out of her school uniform. They both grin as she gets into the passenger seat and David gets behind the wheel, driving the Bristol off to the auction. At the auction, Danny smiles knowingly as a woman shakes her head, while Jenny reaches with excitement and David grins. Later, at Danny's palatial place filled with art and luxury furniture, Helen turns and stares at Jenny, and they shake on something.",
    "2": "Jenny smiles as she looks around the glamorous hall and all the table lamps while Helen and Danny exchange a worried look. David glances at Jenny, who freezes, but then she smiles happily and applauds the singer, keeping her eyes on the stage. Danny and Helen talk together as Jenny watches the glamorous couple. As David looks at her, she glances back at him and smiles self-consciously, while Helen and Danny are completely wrapped up in one another. Jenny smiles at David, and they both laugh; she grins happily to herself. Later, Jenny arrives home, cautiously opens the door, and walks quietly in. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Her mother is in the kitchen and gives a non-committal nod before returning to her casserole. Margarie glances over her shoulder, and Jenny trudges sadly from the kitchen. The next day, David waits by his car outside the school as Jenny hurries out, having changed out of her school uniform. They both grin as she gets into the passenger seat and David gets behind the wheel, driving the Bristol off to the auction. At the auction, Danny smiles knowingly as a woman shakes her head, while Jenny reaches with excitement and David grins. Later, at Danny's palatial place filled with art and luxury furniture, Helen turns and stares at Jenny, and they shake on something.",
    "3": "Jenny smiles as she looks around the glamorous hall and all the table lamps while Helen and Danny exchange a worried look. David glances at Jenny, who freezes, but then she smiles happily and applauds the singer, keeping her eyes on the stage. Danny and Helen talk together as Jenny watches the glamorous couple. As David looks at her, she glances back at him and smiles self-consciously, while Helen and Danny are completely wrapped up in one another. Jenny smiles at David, and they both laugh; she grins happily to herself. Later, Jenny arrives home, cautiously opens the door, and walks quietly in. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Her mother is in the kitchen and gives a non-committal nod before returning to her casserole. Margarie glances over her shoulder, and Jenny trudges sadly from the kitchen. The next day, David waits by his car outside the school as Jenny hurries out, having changed out of her school uniform. They both grin as she gets into the passenger seat and David gets behind the wheel, driving the Bristol off to the auction. At the auction, Danny smiles knowingly as a woman shakes her head, while Jenny reaches with excitement and David grins. Later, at Danny's palatial place filled with art and luxury furniture, Helen turns and stares at Jenny, and they shake on something.",
    "4": "Jenny smiles as she looks around the glamorous hall and all the table lamps while Helen and Danny exchange a worried look. David glances at Jenny, who freezes, but then she smiles happily and applauds the singer, keeping her eyes on the stage. Danny and Helen talk together as Jenny watches the glamorous couple. As David looks at her, she glances back at him and smiles self-consciously, while Helen and Danny are completely wrapped up in one another. Jenny smiles at David, and they both laugh; she grins happily to herself. Later, Jenny arrives home, cautiously opens the door, and walks quietly in. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Her mother is in the kitchen and gives a non-committal nod before returning to her casserole. Margarie glances over her shoulder, and Jenny trudges sadly from the kitchen. The next day, David waits by his car outside the school as Jenny hurries out, having changed out of her school uniform. They both grin as she gets into the passenger seat and David gets behind the wheel, driving the Bristol off to the auction. At the auction, Danny smiles knowingly as a woman shakes her head, while Jenny reaches with excitement and David grins. Later, at Danny's palatial place filled with art and luxury furniture, Helen turns and stares at Jenny, and they shake on something.",
    "5": "Jenny smiles as she looks around the glamorous hall and all the table lamps while Helen and Danny exchange a worried look. David glances at Jenny, who freezes, but then she smiles happily and applauds the singer, keeping her eyes on the stage. Danny and Helen talk together as Jenny watches the glamorous couple. As David looks at her, she glances back at him and smiles self-consciously, while Helen and Danny are completely wrapped up in one another. Jenny smiles at David, and they both laugh; she grins happily to herself. Later, Jenny arrives home, cautiously opens the door, and walks quietly in. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Her mother is in the kitchen and gives a non-committal nod before returning to her casserole. Margarie glances over her shoulder, and Jenny trudges sadly from the kitchen. The next day, David waits by his car outside the school as Jenny hurries out, having changed out of her school uniform. They both grin as she gets into the passenger seat and David gets behind the wheel, driving the Bristol off to the auction. At the auction, Danny smiles knowingly as a woman shakes her head, while Jenny reaches with excitement and David grins. Later, at Danny's palatial place filled with art and luxury furniture, Helen turns and stares at Jenny, and they shake on something.",
    "6": "Jenny smiles as she looks around the glamorous hall and all the table lamps while Helen and Danny exchange a worried look. David glances at Jenny, who freezes, but then she smiles happily and applauds the singer, keeping her eyes on the stage. Danny and Helen talk together as Jenny watches the glamorous couple. As David looks at her, she glances back at him and smiles self-consciously, while Helen and Danny are completely wrapped up in one another. Jenny smiles at David, and they both laugh; she grins happily to herself. Later, Jenny arrives home, cautiously opens the door, and walks quietly in. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Her mother is in the kitchen and gives a non-committal nod before returning to her casserole. Margarie glances over her shoulder, and Jenny trudges sadly from the kitchen. The next day, David waits by his car outside the school as Jenny hurries out, having changed out of her school uniform. They both grin as she gets into the passenger seat and David gets behind the wheel, driving the Bristol off to the auction. At the auction, Danny smiles knowingly as a woman shakes her head, while Jenny reaches with excitement and David grins. Later, at Danny's palatial place filled with art and luxury furniture, Helen turns and stares at Jenny, and they shake on something.",
    "7": "Jenny smiles as she looks around the glamorous hall and all the table lamps while Helen and Danny exchange a worried look. David glances at Jenny, who freezes, but then she smiles happily and applauds the singer, keeping her eyes on the stage. Danny and Helen talk together as Jenny watches the glamorous couple. As David looks at her, she glances back at him and smiles self-consciously, while Helen and Danny are completely wrapped up in one another. Jenny smiles at David, and they both laugh; she grins happily to herself. Later, Jenny arrives home, cautiously opens the door, and walks quietly in. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Her mother is in the kitchen and gives a non-committal nod before returning to her casserole. Margarie glances over her shoulder, and Jenny trudges sadly from the kitchen. The next day, David waits by his car outside the school as Jenny hurries out, having changed out of her school uniform. They both grin as she gets into the passenger seat and David gets behind the wheel, driving the Bristol off to the auction. At the auction, Danny smiles knowingly as a woman shakes her head, while Jenny reaches with excitement and David grins. Later, at Danny's palatial place filled with art and luxury furniture, Helen turns and stares at Jenny, and they shake on something.",
    "8": "Jenny smiles as she looks around the glamorous hall and all the table lamps while Helen and Danny exchange a worried look. David glances at Jenny, who freezes, but then she smiles happily and applauds the singer, keeping her eyes on the stage. Danny and Helen talk together as Jenny watches the glamorous couple. As David looks at her, she glances back at him and smiles self-consciously, while Helen and Danny are completely wrapped up in one another. Jenny smiles at David, and they both laugh; she grins happily to herself. Later, Jenny arrives home, cautiously opens the door, and walks quietly in. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Her mother is in the kitchen and gives a non-committal nod before returning to her casserole. Margarie glances over her shoulder, and Jenny trudges sadly from the kitchen. The next day, David waits by his car outside the school as Jenny hurries out, having changed out of her school uniform. They both grin as she gets into the passenger seat and David gets behind the wheel, driving the Bristol off to the auction. At the auction, Danny smiles knowingly as a woman shakes her head, while Jenny reaches with excitement and David grins. Later, at Danny's palatial place filled with art and luxury furniture, Helen turns and stares at Jenny, and they shake on something.",
    "9": "Jenny smiles as she looks around the glamorous hall and all the table lamps while Helen and Danny exchange a worried look. David glances at Jenny, who freezes, but then she smiles happily and applauds the singer, keeping her eyes on the stage. Danny and Helen talk together as Jenny watches the glamorous couple. As David looks at her, she glances back at him and smiles self-consciously, while Helen and Danny are completely wrapped up in one another. Jenny smiles at David, and they both laugh; she grins happily to herself. Later, Jenny arrives home, cautiously opens the door, and walks quietly in. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Her mother is in the kitchen and gives a non-committal nod before returning to her casserole. Margarie glances over her shoulder, and Jenny trudges sadly from the kitchen. The next day, David waits by his car outside the school as Jenny hurries out, having changed out of her school uniform. They both grin as she gets into the passenger seat and David gets behind the wheel, driving the Bristol off to the auction. At the auction, Danny smiles knowingly as a woman shakes her head, while Jenny reaches with excitement and David grins. Later, at Danny's palatial place filled with art and luxury furniture, Helen turns and stares at Jenny, and they shake on something.",
    "10": "Jenny smiles as she looks around the glamorous hall and all the table lamps while Helen and Danny exchange a worried look. David glances at Jenny, who freezes, but then she smiles happily and applauds the singer, keeping her eyes on the stage. Danny and Helen talk together as Jenny watches the glamorous couple. As David looks at her, she glances back at him and smiles self-consciously, while Helen and Danny are completely wrapped up in one another. Jenny smiles at David, and they both laugh; she grins happily to herself. Later, Jenny arrives home, cautiously opens the door, and walks quietly in. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Her mother is in the kitchen and gives a non-committal nod before returning to her casserole. Margarie glances over her shoulder, and Jenny trudges sadly from the kitchen. The next day, David waits by his car outside the school as Jenny hurries out, having changed out of her school uniform. They both grin as she gets into the passenger seat and David gets behind the wheel, driving the Bristol off to the auction. At the auction, Danny smiles knowingly as a woman shakes her head, while Jenny reaches with excitement and David grins. Later, at Danny's palatial place filled with art and luxury furniture, Helen turns and stares at Jenny, and they shake on something."
  }
}