{
  "ground_truth": "Drover, Magarri, and Goolaj gallop across a plain while Japanese fighters fly over Mission Island. One plane dives down towards it, and squatting in his cell, King George raises his head and looks up. On the beach on the island, Nullah looks skywards as four planes peel away from the mass of fighters and swoop towards him. Sarah walks into the army operations room and looks at Cath with concern, while Nullah continues to stare at the planes. King George stands in his cell as the planes dive towards the children on the beach, and Nullah's eyes widen with fear as he sprints across the beach just as bombs fall on the Mission. A priest hurries to the radio hut, but a plane targets it, and as the bomb obliterates the radio shack, King George looks out through the barred window of his cell. Fletcher signs the contract to buy Faraway Downs, then turns and walks out onto the balcony surrounding his office at the top of a high clock tower. Dutton pauses, hearing the noise as fighters appear in the sky over Darwin. On his balcony, Fletcher watches the approaching black dots in the air as planes peel off from the formation to start their attack. Sarah stands up and slowly removes her headset as she stares out of the window, and then a bomb explodes just outside, engulfing her in smoke, flame, and flying glass. The planes, with the red rising sun on their wings, swoop and dive across the town, as soldiers desperately try to get organized. A bomb bursts outside the prison and fire billows into King George's cell, prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells.",
  "iterations": {
    "1": "Drover, Magarri, and Goolaj gallop across a plain while Japanese fighters fly over Mission Island. One plane dives down towards it, and squatting in his cell, King George raises his head and looks up. On the beach on the island, Nullah looks skywards as four planes peel away from the mass of fighters and swoop towards him. Sarah walks into the army operations room and looks at Cath with concern, while Nullah continues to stare at the planes. King George stands in his cell as the planes dive towards the children on the beach, and Nullah's eyes widen with fear as he sprints across the beach just as bombs fall on the Mission. A priest hurries to the radio hut, but a plane targets it, and as the bomb obliterates the radio shack, King George looks out through the barred window of his cell. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Fletcher signs the contract to buy Faraway Downs, then turns and walks out onto the balcony surrounding his office at the top of a high clock tower. Dutton pauses, hearing the noise as fighters appear in the sky over Darwin. On his balcony, Fletcher watches the approaching black dots in the air as planes peel off from the formation to start their attack. Sarah stands up and slowly removes her headset as she stares out of the window, and then a bomb explodes just outside, engulfing her in smoke, flame, and flying glass. The planes, with the red rising sun on their wings, swoop and dive across the town, as soldiers desperately try to get organized. A bomb bursts outside the prison and fire billows into King George's cell, prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells.",
    "2": "Drover, Magarri, and Goolaj gallop across a plain while Japanese fighters fly over Mission Island. One plane dives down towards it, and squatting in his cell, King George raises his head and looks up. On the beach on the island, Nullah looks skywards as four planes peel away from the mass of fighters and swoop towards him. Sarah walks into the army operations room and looks at Cath with concern, while Nullah continues to stare at the planes. King George stands in his cell as the planes dive towards the children on the beach, and Nullah's eyes widen with fear as he sprints across the beach just as bombs fall on the Mission. A priest hurries to the radio hut, but a plane targets it, and as the bomb obliterates the radio shack, King George looks out through the barred window of his cell. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Fletcher signs the contract to buy Faraway Downs, then turns and walks out onto the balcony surrounding his office at the top of a high clock tower. Dutton pauses, hearing the noise as fighters appear in the sky over Darwin. On his balcony, Fletcher watches the approaching black dots in the air as planes peel off from the formation to start their attack. Sarah stands up and slowly removes her headset as she stares out of the window, and then a bomb explodes just outside, engulfing her in smoke, flame, and flying glass. The planes, with the red rising sun on their wings, swoop and dive across the town, as soldiers desperately try to get organized. A bomb bursts outside the prison and fire billows into King George's cell, prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells.",
    "3": "Drover, Magarri, and Goolaj gallop across a plain while Japanese fighters fly over Mission Island. One plane dives down towards it, and squatting in his cell, King George raises his head and looks up. On the beach on the island, Nullah looks skywards as four planes peel away from the mass of fighters and swoop towards him. Sarah walks into the army operations room and looks at Cath with concern, while Nullah continues to stare at the planes. King George stands in his cell as the planes dive towards the children on the beach, and Nullah's eyes widen with fear as he sprints across the beach just as bombs fall on the Mission. A priest hurries to the radio hut, but a plane targets it, and as the bomb obliterates the radio shack, King George looks out through the barred window of his cell. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Fletcher signs the contract to buy Faraway Downs, then turns and walks out onto the balcony surrounding his office at the top of a high clock tower. Dutton pauses, hearing the noise as fighters appear in the sky over Darwin. On his balcony, Fletcher watches the approaching black dots in the air as planes peel off from the formation to start their attack. Sarah stands up and slowly removes her headset as she stares out of the window, and then a bomb explodes just outside, engulfing her in smoke, flame, and flying glass. The planes, with the red rising sun on their wings, swoop and dive across the town, as soldiers desperately try to get organized. A bomb bursts outside the prison and fire billows into King George's cell, prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells.",
    "4": "Drover, Magarri, and Goolaj gallop across a plain while Japanese fighters fly over Mission Island. One plane dives down towards it, and squatting in his cell, King George raises his head and looks up. On the beach on the island, Nullah looks skywards as four planes peel away from the mass of fighters and swoop towards him. Sarah walks into the army operations room and looks at Cath with concern, while Nullah continues to stare at the planes. King George stands in his cell as the planes dive towards the children on the beach, and Nullah's eyes widen with fear as he sprints across the beach just as bombs fall on the Mission. A priest hurries to the radio hut, but a plane targets it, and as the bomb obliterates the radio shack, King George looks out through the barred window of his cell. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Fletcher signs the contract to buy Faraway Downs, then turns and walks out onto the balcony surrounding his office at the top of a high clock tower. Dutton pauses, hearing the noise as fighters appear in the sky over Darwin. On his balcony, Fletcher watches the approaching black dots in the air as planes peel off from the formation to start their attack. Sarah stands up and slowly removes her headset as she stares out of the window, and then a bomb explodes just outside, engulfing her in smoke, flame, and flying glass. The planes, with the red rising sun on their wings, swoop and dive across the town, as soldiers desperately try to get organized. A bomb bursts outside the prison and fire billows into King George's cell, prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells.",
    "5": "Drover, Magarri, and Goolaj gallop across a plain while Japanese fighters fly over Mission Island. One plane dives down towards it, and squatting in his cell, King George raises his head and looks up. On the beach on the island, Nullah looks skywards as four planes peel away from the mass of fighters and swoop towards him. Sarah walks into the army operations room and looks at Cath with concern, while Nullah continues to stare at the planes. King George stands in his cell as the planes dive towards the children on the beach, and Nullah's eyes widen with fear as he sprints across the beach just as bombs fall on the Mission. A priest hurries to the radio hut, but a plane targets it, and as the bomb obliterates the radio shack, King George looks out through the barred window of his cell. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Fletcher signs the contract to buy Faraway Downs, then turns and walks out onto the balcony surrounding his office at the top of a high clock tower. Dutton pauses, hearing the noise as fighters appear in the sky over Darwin. On his balcony, Fletcher watches the approaching black dots in the air as planes peel off from the formation to start their attack. Sarah stands up and slowly removes her headset as she stares out of the window, and then a bomb explodes just outside, engulfing her in smoke, flame, and flying glass. The planes, with the red rising sun on their wings, swoop and dive across the town, as soldiers desperately try to get organized. A bomb bursts outside the prison and fire billows into King George's cell, prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells.",
    "6": "Drover, Magarri, and Goolaj gallop across a plain while Japanese fighters fly over Mission Island. One plane dives down towards it, and squatting in his cell, King George raises his head and looks up. On the beach on the island, Nullah looks skywards as four planes peel away from the mass of fighters and swoop towards him. Sarah walks into the army operations room and looks at Cath with concern, while Nullah continues to stare at the planes. King George stands in his cell as the planes dive towards the children on the beach, and Nullah's eyes widen with fear as he sprints across the beach just as bombs fall on the Mission. A priest hurries to the radio hut, but a plane targets it, and as the bomb obliterates the radio shack, King George looks out through the barred window of his cell. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Fletcher signs the contract to buy Faraway Downs, then turns and walks out onto the balcony surrounding his office at the top of a high clock tower. Dutton pauses, hearing the noise as fighters appear in the sky over Darwin. On his balcony, Fletcher watches the approaching black dots in the air as planes peel off from the formation to start their attack. Sarah stands up and slowly removes her headset as she stares out of the window, and then a bomb explodes just outside, engulfing her in smoke, flame, and flying glass. The planes, with the red rising sun on their wings, swoop and dive across the town, as soldiers desperately try to get organized. A bomb bursts outside the prison and fire billows into King George's cell, prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells.",
    "7": "Drover, Magarri, and Goolaj gallop across a plain while Japanese fighters fly over Mission Island. One plane dives down towards it, and squatting in his cell, King George raises his head and looks up. On the beach on the island, Nullah looks skywards as four planes peel away from the mass of fighters and swoop towards him. Sarah walks into the army operations room and looks at Cath with concern, while Nullah continues to stare at the planes. King George stands in his cell as the planes dive towards the children on the beach, and Nullah's eyes widen with fear as he sprints across the beach just as bombs fall on the Mission. A priest hurries to the radio hut, but a plane targets it, and as the bomb obliterates the radio shack, King George looks out through the barred window of his cell. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Fletcher signs the contract to buy Faraway Downs, then turns and walks out onto the balcony surrounding his office at the top of a high clock tower. Dutton pauses, hearing the noise as fighters appear in the sky over Darwin. On his balcony, Fletcher watches the approaching black dots in the air as planes peel off from the formation to start their attack. Sarah stands up and slowly removes her headset as she stares out of the window, and then a bomb explodes just outside, engulfing her in smoke, flame, and flying glass. The planes, with the red rising sun on their wings, swoop and dive across the town, as soldiers desperately try to get organized. A bomb bursts outside the prison and fire billows into King George's cell, prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells.",
    "8": "Drover, Magarri, and Goolaj gallop across a plain while Japanese fighters fly over Mission Island. One plane dives down towards it, and squatting in his cell, King George raises his head and looks up. On the beach on the island, Nullah looks skywards as four planes peel away from the mass of fighters and swoop towards him. Sarah walks into the army operations room and looks at Cath with concern, while Nullah continues to stare at the planes. King George stands in his cell as the planes dive towards the children on the beach, and Nullah's eyes widen with fear as he sprints across the beach just as bombs fall on the Mission. A priest hurries to the radio hut, but a plane targets it, and as the bomb obliterates the radio shack, King George looks out through the barred window of his cell. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Fletcher signs the contract to buy Faraway Downs, then turns and walks out onto the balcony surrounding his office at the top of a high clock tower. Dutton pauses, hearing the noise as fighters appear in the sky over Darwin. On his balcony, Fletcher watches the approaching black dots in the air as planes peel off from the formation to start their attack. Sarah stands up and slowly removes her headset as she stares out of the window, and then a bomb explodes just outside, engulfing her in smoke, flame, and flying glass. The planes, with the red rising sun on their wings, swoop and dive across the town, as soldiers desperately try to get organized. A bomb bursts outside the prison and fire billows into King George's cell, prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells.",
    "9": "Drover, Magarri, and Goolaj gallop across a plain while Japanese fighters fly over Mission Island. One plane dives down towards it, and squatting in his cell, King George raises his head and looks up. On the beach on the island, Nullah looks skywards as four planes peel away from the mass of fighters and swoop towards him. Sarah walks into the army operations room and looks at Cath with concern, while Nullah continues to stare at the planes. King George stands in his cell as the planes dive towards the children on the beach, and Nullah's eyes widen with fear as he sprints across the beach just as bombs fall on the Mission. A priest hurries to the radio hut, but a plane targets it, and as the bomb obliterates the radio shack, King George looks out through the barred window of his cell. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Fletcher signs the contract to buy Faraway Downs, then turns and walks out onto the balcony surrounding his office at the top of a high clock tower. Dutton pauses, hearing the noise as fighters appear in the sky over Darwin. On his balcony, Fletcher watches the approaching black dots in the air as planes peel off from the formation to start their attack. Sarah stands up and slowly removes her headset as she stares out of the window, and then a bomb explodes just outside, engulfing her in smoke, flame, and flying glass. The planes, with the red rising sun on their wings, swoop and dive across the town, as soldiers desperately try to get organized. A bomb bursts outside the prison and fire billows into King George's cell, prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells.",
    "10": "Drover, Magarri, and Goolaj gallop across a plain while Japanese fighters fly over Mission Island. One plane dives down towards it, and squatting in his cell, King George raises his head and looks up. On the beach on the island, Nullah looks skywards as four planes peel away from the mass of fighters and swoop towards him. Sarah walks into the army operations room and looks at Cath with concern, while Nullah continues to stare at the planes. King George stands in his cell as the planes dive towards the children on the beach, and Nullah's eyes widen with fear as he sprints across the beach just as bombs fall on the Mission. A priest hurries to the radio hut, but a plane targets it, and as the bomb obliterates the radio shack, King George looks out through the barred window of his cell. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Fletcher signs the contract to buy Faraway Downs, then turns and walks out onto the balcony surrounding his office at the top of a high clock tower. Dutton pauses, hearing the noise as fighters appear in the sky over Darwin. On his balcony, Fletcher watches the approaching black dots in the air as planes peel off from the formation to start their attack. Sarah stands up and slowly removes her headset as she stares out of the window, and then a bomb explodes just outside, engulfing her in smoke, flame, and flying glass. The planes, with the red rising sun on their wings, swoop and dive across the town, as soldiers desperately try to get organized. A bomb bursts outside the prison and fire billows into King George's cell, prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells."
  }
}