{
  "ground_truth": "They stand next to each other guiltily, as Nullah climbs down from the tree. Sarah stares at him curiously, as he moves pensively away from her. She looks shocked. He eyes her steadily. He draws near her, and she looks up at him. She smiles and looks down at the ground. He gives a tight smile and walks off. She hesitates, then wanders through the long grass. In daylight, a steer lies dead next to a watering hole. Magarri checks the water. Drover, Sarah, and Nullah ride up. Magarri looks thoughtful.",
  "iterations": {
    "1": "They stand next to each other guiltily, as Nullah climbs down from the tree. Sarah stares at him curiously, as he moves pensively away from her. She looks shocked. He eyes her steadily. He draws near her, and she looks up at him. She smiles and looks down at the ground. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. He gives a tight smile and walks off. She hesitates, then wanders through the long grass. In daylight, a steer lies dead next to a watering hole. Magarri checks the water. Drover, Sarah, and Nullah ride up. Magarri looks thoughtful.",
    "2": "They stand next to each other guiltily, as Nullah climbs down from the tree. Sarah stares at him curiously, as he moves pensively away from her. She looks shocked. He eyes her steadily. He draws near her, and she looks up at him. She smiles and looks down at the ground. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. He gives a tight smile and walks off. She hesitates, then wanders through the long grass. In daylight, a steer lies dead next to a watering hole. Magarri checks the water. Drover, Sarah, and Nullah ride up. Magarri looks thoughtful.",
    "3": "They stand next to each other guiltily, as Nullah climbs down from the tree. Sarah stares at him curiously, as he moves pensively away from her. She looks shocked. He eyes her steadily. He draws near her, and she looks up at him. She smiles and looks down at the ground. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. He gives a tight smile and walks off. She hesitates, then wanders through the long grass. In daylight, a steer lies dead next to a watering hole. Magarri checks the water. Drover, Sarah, and Nullah ride up. Magarri looks thoughtful.",
    "4": "They stand next to each other guiltily, as Nullah climbs down from the tree. Sarah stares at him curiously, as he moves pensively away from her. She looks shocked. He eyes her steadily. He draws near her, and she looks up at him. She smiles and looks down at the ground. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. He gives a tight smile and walks off. She hesitates, then wanders through the long grass. In daylight, a steer lies dead next to a watering hole. Magarri checks the water. Drover, Sarah, and Nullah ride up. Magarri looks thoughtful.",
    "5": "They stand next to each other guiltily, as Nullah climbs down from the tree. Sarah stares at him curiously, as he moves pensively away from her. She looks shocked. He eyes her steadily. He draws near her, and she looks up at him. She smiles and looks down at the ground. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. He gives a tight smile and walks off. She hesitates, then wanders through the long grass. In daylight, a steer lies dead next to a watering hole. Magarri checks the water. Drover, Sarah, and Nullah ride up. Magarri looks thoughtful.",
    "6": "They stand next to each other guiltily, as Nullah climbs down from the tree. Sarah stares at him curiously, as he moves pensively away from her. She looks shocked. He eyes her steadily. He draws near her, and she looks up at him. She smiles and looks down at the ground. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. He gives a tight smile and walks off. She hesitates, then wanders through the long grass. In daylight, a steer lies dead next to a watering hole. Magarri checks the water. Drover, Sarah, and Nullah ride up. Magarri looks thoughtful.",
    "7": "They stand next to each other guiltily, as Nullah climbs down from the tree. Sarah stares at him curiously, as he moves pensively away from her. She looks shocked. He eyes her steadily. He draws near her, and she looks up at him. She smiles and looks down at the ground. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. He gives a tight smile and walks off. She hesitates, then wanders through the long grass. In daylight, a steer lies dead next to a watering hole. Magarri checks the water. Drover, Sarah, and Nullah ride up. Magarri looks thoughtful.",
    "8": "They stand next to each other guiltily, as Nullah climbs down from the tree. Sarah stares at him curiously, as he moves pensively away from her. She looks shocked. He eyes her steadily. He draws near her, and she looks up at him. She smiles and looks down at the ground. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. He gives a tight smile and walks off. She hesitates, then wanders through the long grass. In daylight, a steer lies dead next to a watering hole. Magarri checks the water. Drover, Sarah, and Nullah ride up. Magarri looks thoughtful.",
    "9": "They stand next to each other guiltily, as Nullah climbs down from the tree. Sarah stares at him curiously, as he moves pensively away from her. She looks shocked. He eyes her steadily. He draws near her, and she looks up at him. She smiles and looks down at the ground. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. He gives a tight smile and walks off. She hesitates, then wanders through the long grass. In daylight, a steer lies dead next to a watering hole. Magarri checks the water. Drover, Sarah, and Nullah ride up. Magarri looks thoughtful.",
    "10": "They stand next to each other guiltily, as Nullah climbs down from the tree. Sarah stares at him curiously, as he moves pensively away from her. She looks shocked. He eyes her steadily. He draws near her, and she looks up at him. She smiles and looks down at the ground. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. He gives a tight smile and walks off. She hesitates, then wanders through the long grass. In daylight, a steer lies dead next to a watering hole. Magarri checks the water. Drover, Sarah, and Nullah ride up. Magarri looks thoughtful."
  }
}