{
  "ground_truth": "Over the sound of Adolf Hitler addressing a rally, grainy black and white footage shows him with his arm extended at an angle of 10 degrees from his shoulder, giving the Nazi salute as he reviews troops. A Nazi motorcade approaches a curved metal bridge, and a skull and crossbones on a black flag flutters in the breeze. A man is dragged across the street, while others, identifying labels on their backs, are hounded along by Nazi officers. Jews are shot into a ditch, and women, cowering, are pushed from their homes. One woman falls to the ground and is dragged to her feet. Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
  "iterations": {
    "1": "Over the sound of Adolf Hitler addressing a rally, grainy black and white footage shows him with his arm extended at an angle of 10 degrees from his shoulder, giving the Nazi salute as he reviews troops. A Nazi motorcade approaches a curved metal bridge, and a skull and crossbones on a black flag flutters in the breeze. A man is dragged across the street, while others, identifying labels on their backs, are hounded along by Nazi officers. Jews are shot into a ditch, and women, cowering, are pushed from their homes. One woman falls to the ground and is dragged to her feet. Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
    "2": "Over the sound of Adolf Hitler addressing a rally, grainy black and white footage shows him with his arm extended at an angle of 10 degrees from his shoulder, giving the Nazi salute as he reviews troops. A Nazi motorcade approaches a curved metal bridge, and a skull and crossbones on a black flag flutters in the breeze. A man is dragged across the street, while others, identifying labels on their backs, are hounded along by Nazi officers. Jews are shot into a ditch, and women, cowering, are pushed from their homes. One woman falls to the ground and is dragged to her feet. Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
    "3": "Over the sound of Adolf Hitler addressing a rally, grainy black and white footage shows him with his arm extended at an angle of 10 degrees from his shoulder, giving the Nazi salute as he reviews troops. A Nazi motorcade approaches a curved metal bridge, and a skull and crossbones on a black flag flutters in the breeze. A man is dragged across the street, while others, identifying labels on their backs, are hounded along by Nazi officers. Jews are shot into a ditch, and women, cowering, are pushed from their homes. One woman falls to the ground and is dragged to her feet. Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
    "4": "Over the sound of Adolf Hitler addressing a rally, grainy black and white footage shows him with his arm extended at an angle of 10 degrees from his shoulder, giving the Nazi salute as he reviews troops. A Nazi motorcade approaches a curved metal bridge, and a skull and crossbones on a black flag flutters in the breeze. A man is dragged across the street, while others, identifying labels on their backs, are hounded along by Nazi officers. Jews are shot into a ditch, and women, cowering, are pushed from their homes. One woman falls to the ground and is dragged to her feet. Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
    "5": "Over the sound of Adolf Hitler addressing a rally, grainy black and white footage shows him with his arm extended at an angle of 10 degrees from his shoulder, giving the Nazi salute as he reviews troops. A Nazi motorcade approaches a curved metal bridge, and a skull and crossbones on a black flag flutters in the breeze. A man is dragged across the street, while others, identifying labels on their backs, are hounded along by Nazi officers. Jews are shot into a ditch, and women, cowering, are pushed from their homes. One woman falls to the ground and is dragged to her feet. Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
    "6": "Over the sound of Adolf Hitler addressing a rally, grainy black and white footage shows him with his arm extended at an angle of 10 degrees from his shoulder, giving the Nazi salute as he reviews troops. A Nazi motorcade approaches a curved metal bridge, and a skull and crossbones on a black flag flutters in the breeze. A man is dragged across the street, while others, identifying labels on their backs, are hounded along by Nazi officers. Jews are shot into a ditch, and women, cowering, are pushed from their homes. One woman falls to the ground and is dragged to her feet. Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
    "7": "Over the sound of Adolf Hitler addressing a rally, grainy black and white footage shows him with his arm extended at an angle of 10 degrees from his shoulder, giving the Nazi salute as he reviews troops. A Nazi motorcade approaches a curved metal bridge, and a skull and crossbones on a black flag flutters in the breeze. A man is dragged across the street, while others, identifying labels on their backs, are hounded along by Nazi officers. Jews are shot into a ditch, and women, cowering, are pushed from their homes. One woman falls to the ground and is dragged to her feet. Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
    "8": "Over the sound of Adolf Hitler addressing a rally, grainy black and white footage shows him with his arm extended at an angle of 10 degrees from his shoulder, giving the Nazi salute as he reviews troops. A Nazi motorcade approaches a curved metal bridge, and a skull and crossbones on a black flag flutters in the breeze. A man is dragged across the street, while others, identifying labels on their backs, are hounded along by Nazi officers. Jews are shot into a ditch, and women, cowering, are pushed from their homes. One woman falls to the ground and is dragged to her feet. Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
    "9": "Over the sound of Adolf Hitler addressing a rally, grainy black and white footage shows him with his arm extended at an angle of 10 degrees from his shoulder, giving the Nazi salute as he reviews troops. A Nazi motorcade approaches a curved metal bridge, and a skull and crossbones on a black flag flutters in the breeze. A man is dragged across the street, while others, identifying labels on their backs, are hounded along by Nazi officers. Jews are shot into a ditch, and women, cowering, are pushed from their homes. One woman falls to the ground and is dragged to her feet. Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
    "10": "Over the sound of Adolf Hitler addressing a rally, grainy black and white footage shows him with his arm extended at an angle of 10 degrees from his shoulder, giving the Nazi salute as he reviews troops. A Nazi motorcade approaches a curved metal bridge, and a skull and crossbones on a black flag flutters in the breeze. A man is dragged across the street, while others, identifying labels on their backs, are hounded along by Nazi officers. Jews are shot into a ditch, and women, cowering, are pushed from their homes. One woman falls to the ground and is dragged to her feet. Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s."
  }
}