{
  "ground_truth": "The crowd yells for Forrest as he runs across the field with the defending team chasing him, continuing along the field until he runs into the end zone, prompting the crowd to cheer. Forrest stops in the end zone upon hearing the crowd and is met by band members rushing toward him with their hands up, signaling him to stop and stay in the end zone while a group of defending players falls over each other nearby. Forrest looks on as the crowd cheers wildly. President Kennedy holds an autographed football with the All-American Team, including Forrest in suits, standing behind him. The All-American players mingle around the food table, where Forrest steps up to see a large spread of food and soda, including numerous bottles of Dr. Pepper. He takes a bottle of Dr. Pepper from the buffet, a servant opens it for him, and Forrest begins to guzzle it, eventually setting down an empty bottle next to many others, holding his stomach, and burping. In black and white footage, President Kennedy shakes hands with the All-American football players, including Forrest, who steps up after another player and shakes the President's hand before President Kennedy turns and smiles. Forrest urinates in the bathroom, lowers the lid and flushes, then washes his hands and notices an autographed photo of Marilyn Monroe and a photo of John with his brother Bobby. Archival footage shows President Kennedy rising in a convertible and smiling, followed by Robert Kennedy at a podium receiving applause. Forrest, sitting on a bench, shakes his head as students in caps and gowns receive their diplomas, and upon his name being called, he steps up to accept his diploma with the dean shaking his hand vigorously. Looking out into the crowd, Forrest sees Mrs. Gump, who is crying, and later, they have their picture taken in front of a large statue. A military recruiter spots Forrest, steps up to him, and Mrs. Gump takes the diploma from Forrest as the recruiter slaps Forrest on the shoulder and hands him military literature.",
  "iterations": {
    "1": "The crowd yells for Forrest as he runs across the field with the defending team chasing him, continuing along the field until he runs into the end zone, prompting the crowd to cheer. Forrest stops in the end zone upon hearing the crowd and is met by band members rushing toward him with their hands up, signaling him to stop and stay in the end zone while a group of defending players falls over each other nearby. Forrest looks on as the crowd cheers wildly. President Kennedy holds an autographed football with the All-American Team, including Forrest in suits, standing behind him. The All-American players mingle around the food table, where Forrest steps up to see a large spread of food and soda, including numerous bottles of Dr. Pepper. He takes a bottle of Dr. Pepper from the buffet, a servant opens it for him, and Forrest begins to guzzle it, eventually setting down an empty bottle next to many others, holding his stomach, and burping. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In black and white footage, President Kennedy shakes hands with the All-American football players, including Forrest, who steps up after another player and shakes the President's hand before President Kennedy turns and smiles. Forrest urinates in the bathroom, lowers the lid and flushes, then washes his hands and notices an autographed photo of Marilyn Monroe and a photo of John with his brother Bobby. Archival footage shows President Kennedy rising in a convertible and smiling, followed by Robert Kennedy at a podium receiving applause. Forrest, sitting on a bench, shakes his head as students in caps and gowns receive their diplomas, and upon his name being called, he steps up to accept his diploma with the dean shaking his hand vigorously. Looking out into the crowd, Forrest sees Mrs. Gump, who is crying, and later, they have their picture taken in front of a large statue. A military recruiter spots Forrest, steps up to him, and Mrs. Gump takes the diploma from Forrest as the recruiter slaps Forrest on the shoulder and hands him military literature.",
    "2": "The crowd yells for Forrest as he runs across the field with the defending team chasing him, continuing along the field until he runs into the end zone, prompting the crowd to cheer. Forrest stops in the end zone upon hearing the crowd and is met by band members rushing toward him with their hands up, signaling him to stop and stay in the end zone while a group of defending players falls over each other nearby. Forrest looks on as the crowd cheers wildly. President Kennedy holds an autographed football with the All-American Team, including Forrest in suits, standing behind him. The All-American players mingle around the food table, where Forrest steps up to see a large spread of food and soda, including numerous bottles of Dr. Pepper. He takes a bottle of Dr. Pepper from the buffet, a servant opens it for him, and Forrest begins to guzzle it, eventually setting down an empty bottle next to many others, holding his stomach, and burping. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In black and white footage, President Kennedy shakes hands with the All-American football players, including Forrest, who steps up after another player and shakes the President's hand before President Kennedy turns and smiles. Forrest urinates in the bathroom, lowers the lid and flushes, then washes his hands and notices an autographed photo of Marilyn Monroe and a photo of John with his brother Bobby. Archival footage shows President Kennedy rising in a convertible and smiling, followed by Robert Kennedy at a podium receiving applause. Forrest, sitting on a bench, shakes his head as students in caps and gowns receive their diplomas, and upon his name being called, he steps up to accept his diploma with the dean shaking his hand vigorously. Looking out into the crowd, Forrest sees Mrs. Gump, who is crying, and later, they have their picture taken in front of a large statue. A military recruiter spots Forrest, steps up to him, and Mrs. Gump takes the diploma from Forrest as the recruiter slaps Forrest on the shoulder and hands him military literature.",
    "3": "The crowd yells for Forrest as he runs across the field with the defending team chasing him, continuing along the field until he runs into the end zone, prompting the crowd to cheer. Forrest stops in the end zone upon hearing the crowd and is met by band members rushing toward him with their hands up, signaling him to stop and stay in the end zone while a group of defending players falls over each other nearby. Forrest looks on as the crowd cheers wildly. President Kennedy holds an autographed football with the All-American Team, including Forrest in suits, standing behind him. The All-American players mingle around the food table, where Forrest steps up to see a large spread of food and soda, including numerous bottles of Dr. Pepper. He takes a bottle of Dr. Pepper from the buffet, a servant opens it for him, and Forrest begins to guzzle it, eventually setting down an empty bottle next to many others, holding his stomach, and burping. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In black and white footage, President Kennedy shakes hands with the All-American football players, including Forrest, who steps up after another player and shakes the President's hand before President Kennedy turns and smiles. Forrest urinates in the bathroom, lowers the lid and flushes, then washes his hands and notices an autographed photo of Marilyn Monroe and a photo of John with his brother Bobby. Archival footage shows President Kennedy rising in a convertible and smiling, followed by Robert Kennedy at a podium receiving applause. Forrest, sitting on a bench, shakes his head as students in caps and gowns receive their diplomas, and upon his name being called, he steps up to accept his diploma with the dean shaking his hand vigorously. Looking out into the crowd, Forrest sees Mrs. Gump, who is crying, and later, they have their picture taken in front of a large statue. A military recruiter spots Forrest, steps up to him, and Mrs. Gump takes the diploma from Forrest as the recruiter slaps Forrest on the shoulder and hands him military literature.",
    "4": "The crowd yells for Forrest as he runs across the field with the defending team chasing him, continuing along the field until he runs into the end zone, prompting the crowd to cheer. Forrest stops in the end zone upon hearing the crowd and is met by band members rushing toward him with their hands up, signaling him to stop and stay in the end zone while a group of defending players falls over each other nearby. Forrest looks on as the crowd cheers wildly. President Kennedy holds an autographed football with the All-American Team, including Forrest in suits, standing behind him. The All-American players mingle around the food table, where Forrest steps up to see a large spread of food and soda, including numerous bottles of Dr. Pepper. He takes a bottle of Dr. Pepper from the buffet, a servant opens it for him, and Forrest begins to guzzle it, eventually setting down an empty bottle next to many others, holding his stomach, and burping. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In black and white footage, President Kennedy shakes hands with the All-American football players, including Forrest, who steps up after another player and shakes the President's hand before President Kennedy turns and smiles. Forrest urinates in the bathroom, lowers the lid and flushes, then washes his hands and notices an autographed photo of Marilyn Monroe and a photo of John with his brother Bobby. Archival footage shows President Kennedy rising in a convertible and smiling, followed by Robert Kennedy at a podium receiving applause. Forrest, sitting on a bench, shakes his head as students in caps and gowns receive their diplomas, and upon his name being called, he steps up to accept his diploma with the dean shaking his hand vigorously. Looking out into the crowd, Forrest sees Mrs. Gump, who is crying, and later, they have their picture taken in front of a large statue. A military recruiter spots Forrest, steps up to him, and Mrs. Gump takes the diploma from Forrest as the recruiter slaps Forrest on the shoulder and hands him military literature.",
    "5": "The crowd yells for Forrest as he runs across the field with the defending team chasing him, continuing along the field until he runs into the end zone, prompting the crowd to cheer. Forrest stops in the end zone upon hearing the crowd and is met by band members rushing toward him with their hands up, signaling him to stop and stay in the end zone while a group of defending players falls over each other nearby. Forrest looks on as the crowd cheers wildly. President Kennedy holds an autographed football with the All-American Team, including Forrest in suits, standing behind him. The All-American players mingle around the food table, where Forrest steps up to see a large spread of food and soda, including numerous bottles of Dr. Pepper. He takes a bottle of Dr. Pepper from the buffet, a servant opens it for him, and Forrest begins to guzzle it, eventually setting down an empty bottle next to many others, holding his stomach, and burping. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In black and white footage, President Kennedy shakes hands with the All-American football players, including Forrest, who steps up after another player and shakes the President's hand before President Kennedy turns and smiles. Forrest urinates in the bathroom, lowers the lid and flushes, then washes his hands and notices an autographed photo of Marilyn Monroe and a photo of John with his brother Bobby. Archival footage shows President Kennedy rising in a convertible and smiling, followed by Robert Kennedy at a podium receiving applause. Forrest, sitting on a bench, shakes his head as students in caps and gowns receive their diplomas, and upon his name being called, he steps up to accept his diploma with the dean shaking his hand vigorously. Looking out into the crowd, Forrest sees Mrs. Gump, who is crying, and later, they have their picture taken in front of a large statue. A military recruiter spots Forrest, steps up to him, and Mrs. Gump takes the diploma from Forrest as the recruiter slaps Forrest on the shoulder and hands him military literature.",
    "6": "The crowd yells for Forrest as he runs across the field with the defending team chasing him, continuing along the field until he runs into the end zone, prompting the crowd to cheer. Forrest stops in the end zone upon hearing the crowd and is met by band members rushing toward him with their hands up, signaling him to stop and stay in the end zone while a group of defending players falls over each other nearby. Forrest looks on as the crowd cheers wildly. President Kennedy holds an autographed football with the All-American Team, including Forrest in suits, standing behind him. The All-American players mingle around the food table, where Forrest steps up to see a large spread of food and soda, including numerous bottles of Dr. Pepper. He takes a bottle of Dr. Pepper from the buffet, a servant opens it for him, and Forrest begins to guzzle it, eventually setting down an empty bottle next to many others, holding his stomach, and burping. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In black and white footage, President Kennedy shakes hands with the All-American football players, including Forrest, who steps up after another player and shakes the President's hand before President Kennedy turns and smiles. Forrest urinates in the bathroom, lowers the lid and flushes, then washes his hands and notices an autographed photo of Marilyn Monroe and a photo of John with his brother Bobby. Archival footage shows President Kennedy rising in a convertible and smiling, followed by Robert Kennedy at a podium receiving applause. Forrest, sitting on a bench, shakes his head as students in caps and gowns receive their diplomas, and upon his name being called, he steps up to accept his diploma with the dean shaking his hand vigorously. Looking out into the crowd, Forrest sees Mrs. Gump, who is crying, and later, they have their picture taken in front of a large statue. A military recruiter spots Forrest, steps up to him, and Mrs. Gump takes the diploma from Forrest as the recruiter slaps Forrest on the shoulder and hands him military literature.",
    "7": "The crowd yells for Forrest as he runs across the field with the defending team chasing him, continuing along the field until he runs into the end zone, prompting the crowd to cheer. Forrest stops in the end zone upon hearing the crowd and is met by band members rushing toward him with their hands up, signaling him to stop and stay in the end zone while a group of defending players falls over each other nearby. Forrest looks on as the crowd cheers wildly. President Kennedy holds an autographed football with the All-American Team, including Forrest in suits, standing behind him. The All-American players mingle around the food table, where Forrest steps up to see a large spread of food and soda, including numerous bottles of Dr. Pepper. He takes a bottle of Dr. Pepper from the buffet, a servant opens it for him, and Forrest begins to guzzle it, eventually setting down an empty bottle next to many others, holding his stomach, and burping. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In black and white footage, President Kennedy shakes hands with the All-American football players, including Forrest, who steps up after another player and shakes the President's hand before President Kennedy turns and smiles. Forrest urinates in the bathroom, lowers the lid and flushes, then washes his hands and notices an autographed photo of Marilyn Monroe and a photo of John with his brother Bobby. Archival footage shows President Kennedy rising in a convertible and smiling, followed by Robert Kennedy at a podium receiving applause. Forrest, sitting on a bench, shakes his head as students in caps and gowns receive their diplomas, and upon his name being called, he steps up to accept his diploma with the dean shaking his hand vigorously. Looking out into the crowd, Forrest sees Mrs. Gump, who is crying, and later, they have their picture taken in front of a large statue. A military recruiter spots Forrest, steps up to him, and Mrs. Gump takes the diploma from Forrest as the recruiter slaps Forrest on the shoulder and hands him military literature.",
    "8": "The crowd yells for Forrest as he runs across the field with the defending team chasing him, continuing along the field until he runs into the end zone, prompting the crowd to cheer. Forrest stops in the end zone upon hearing the crowd and is met by band members rushing toward him with their hands up, signaling him to stop and stay in the end zone while a group of defending players falls over each other nearby. Forrest looks on as the crowd cheers wildly. President Kennedy holds an autographed football with the All-American Team, including Forrest in suits, standing behind him. The All-American players mingle around the food table, where Forrest steps up to see a large spread of food and soda, including numerous bottles of Dr. Pepper. He takes a bottle of Dr. Pepper from the buffet, a servant opens it for him, and Forrest begins to guzzle it, eventually setting down an empty bottle next to many others, holding his stomach, and burping. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In black and white footage, President Kennedy shakes hands with the All-American football players, including Forrest, who steps up after another player and shakes the President's hand before President Kennedy turns and smiles. Forrest urinates in the bathroom, lowers the lid and flushes, then washes his hands and notices an autographed photo of Marilyn Monroe and a photo of John with his brother Bobby. Archival footage shows President Kennedy rising in a convertible and smiling, followed by Robert Kennedy at a podium receiving applause. Forrest, sitting on a bench, shakes his head as students in caps and gowns receive their diplomas, and upon his name being called, he steps up to accept his diploma with the dean shaking his hand vigorously. Looking out into the crowd, Forrest sees Mrs. Gump, who is crying, and later, they have their picture taken in front of a large statue. A military recruiter spots Forrest, steps up to him, and Mrs. Gump takes the diploma from Forrest as the recruiter slaps Forrest on the shoulder and hands him military literature.",
    "9": "The crowd yells for Forrest as he runs across the field with the defending team chasing him, continuing along the field until he runs into the end zone, prompting the crowd to cheer. Forrest stops in the end zone upon hearing the crowd and is met by band members rushing toward him with their hands up, signaling him to stop and stay in the end zone while a group of defending players falls over each other nearby. Forrest looks on as the crowd cheers wildly. President Kennedy holds an autographed football with the All-American Team, including Forrest in suits, standing behind him. The All-American players mingle around the food table, where Forrest steps up to see a large spread of food and soda, including numerous bottles of Dr. Pepper. He takes a bottle of Dr. Pepper from the buffet, a servant opens it for him, and Forrest begins to guzzle it, eventually setting down an empty bottle next to many others, holding his stomach, and burping. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In black and white footage, President Kennedy shakes hands with the All-American football players, including Forrest, who steps up after another player and shakes the President's hand before President Kennedy turns and smiles. Forrest urinates in the bathroom, lowers the lid and flushes, then washes his hands and notices an autographed photo of Marilyn Monroe and a photo of John with his brother Bobby. Archival footage shows President Kennedy rising in a convertible and smiling, followed by Robert Kennedy at a podium receiving applause. Forrest, sitting on a bench, shakes his head as students in caps and gowns receive their diplomas, and upon his name being called, he steps up to accept his diploma with the dean shaking his hand vigorously. Looking out into the crowd, Forrest sees Mrs. Gump, who is crying, and later, they have their picture taken in front of a large statue. A military recruiter spots Forrest, steps up to him, and Mrs. Gump takes the diploma from Forrest as the recruiter slaps Forrest on the shoulder and hands him military literature.",
    "10": "The crowd yells for Forrest as he runs across the field with the defending team chasing him, continuing along the field until he runs into the end zone, prompting the crowd to cheer. Forrest stops in the end zone upon hearing the crowd and is met by band members rushing toward him with their hands up, signaling him to stop and stay in the end zone while a group of defending players falls over each other nearby. Forrest looks on as the crowd cheers wildly. President Kennedy holds an autographed football with the All-American Team, including Forrest in suits, standing behind him. The All-American players mingle around the food table, where Forrest steps up to see a large spread of food and soda, including numerous bottles of Dr. Pepper. He takes a bottle of Dr. Pepper from the buffet, a servant opens it for him, and Forrest begins to guzzle it, eventually setting down an empty bottle next to many others, holding his stomach, and burping. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In black and white footage, President Kennedy shakes hands with the All-American football players, including Forrest, who steps up after another player and shakes the President's hand before President Kennedy turns and smiles. Forrest urinates in the bathroom, lowers the lid and flushes, then washes his hands and notices an autographed photo of Marilyn Monroe and a photo of John with his brother Bobby. Archival footage shows President Kennedy rising in a convertible and smiling, followed by Robert Kennedy at a podium receiving applause. Forrest, sitting on a bench, shakes his head as students in caps and gowns receive their diplomas, and upon his name being called, he steps up to accept his diploma with the dean shaking his hand vigorously. Looking out into the crowd, Forrest sees Mrs. Gump, who is crying, and later, they have their picture taken in front of a large statue. A military recruiter spots Forrest, steps up to him, and Mrs. Gump takes the diploma from Forrest as the recruiter slaps Forrest on the shoulder and hands him military literature."
  }
}