{
  "ground_truth": "Walt kicks a table, then marches into his front room and kicks over another table, then punches in some cupboard doors as Daisy runs for cover. Walt sits down in an armchair, blood dripping from his fingers, and stares into the distance, a frown on his face, his features fixed and grim. He sheds a tear, and the blood on his fists has dried. Daisy comes and sits beside him. Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette. Father Janovich perches on a coffee table beside an open photograph album and stares at Walt, who drags pensively on his cigarette and looks thoughtful. Father Janovich gets up, goes over to the cool box, returns with four cans, and passes a couple to Walt while keeping a couple for himself. They each take a swig, and Walt takes another swig as Father Janovich eyes him, who stares unwaveringly back. In the morning, Thao walks into Walt's kitchen and finds him sipping a mug of coffee. They sit at the kitchen table, Walt gives Thao a scornful look, Thao nods reluctantly, and then gets up and goes as Walt stares after him. Later, Walt is busy mowing his front lawn, and now he relaxes in the bath, lights a cigarette, and looks over at Daisy, who's sitting beside the tub. Martin gives Walt a haircut, chuckles, and pockets the money.",
  "iterations": {
    "1": "Walt kicks a table, then marches into his front room and kicks over another table, then punches in some cupboard doors as Daisy runs for cover. Walt sits down in an armchair, blood dripping from his fingers, and stares into the distance, a frown on his face, his features fixed and grim. He sheds a tear, and the blood on his fists has dried. Daisy comes and sits beside him. Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette. Father Janovich perches on a coffee table beside an open photograph album and stares at Walt, who drags pensively on his cigarette and looks thoughtful. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Father Janovich gets up, goes over to the cool box, returns with four cans, and passes a couple to Walt while keeping a couple for himself. They each take a swig, and Walt takes another swig as Father Janovich eyes him, who stares unwaveringly back. In the morning, Thao walks into Walt's kitchen and finds him sipping a mug of coffee. They sit at the kitchen table, Walt gives Thao a scornful look, Thao nods reluctantly, and then gets up and goes as Walt stares after him. Later, Walt is busy mowing his front lawn, and now he relaxes in the bath, lights a cigarette, and looks over at Daisy, who's sitting beside the tub. Martin gives Walt a haircut, chuckles, and pockets the money.",
    "2": "Walt kicks a table, then marches into his front room and kicks over another table, then punches in some cupboard doors as Daisy runs for cover. Walt sits down in an armchair, blood dripping from his fingers, and stares into the distance, a frown on his face, his features fixed and grim. He sheds a tear, and the blood on his fists has dried. Daisy comes and sits beside him. Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette. Father Janovich perches on a coffee table beside an open photograph album and stares at Walt, who drags pensively on his cigarette and looks thoughtful. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Father Janovich gets up, goes over to the cool box, returns with four cans, and passes a couple to Walt while keeping a couple for himself. They each take a swig, and Walt takes another swig as Father Janovich eyes him, who stares unwaveringly back. In the morning, Thao walks into Walt's kitchen and finds him sipping a mug of coffee. They sit at the kitchen table, Walt gives Thao a scornful look, Thao nods reluctantly, and then gets up and goes as Walt stares after him. Later, Walt is busy mowing his front lawn, and now he relaxes in the bath, lights a cigarette, and looks over at Daisy, who's sitting beside the tub. Martin gives Walt a haircut, chuckles, and pockets the money.",
    "3": "Walt kicks a table, then marches into his front room and kicks over another table, then punches in some cupboard doors as Daisy runs for cover. Walt sits down in an armchair, blood dripping from his fingers, and stares into the distance, a frown on his face, his features fixed and grim. He sheds a tear, and the blood on his fists has dried. Daisy comes and sits beside him. Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette. Father Janovich perches on a coffee table beside an open photograph album and stares at Walt, who drags pensively on his cigarette and looks thoughtful. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Father Janovich gets up, goes over to the cool box, returns with four cans, and passes a couple to Walt while keeping a couple for himself. They each take a swig, and Walt takes another swig as Father Janovich eyes him, who stares unwaveringly back. In the morning, Thao walks into Walt's kitchen and finds him sipping a mug of coffee. They sit at the kitchen table, Walt gives Thao a scornful look, Thao nods reluctantly, and then gets up and goes as Walt stares after him. Later, Walt is busy mowing his front lawn, and now he relaxes in the bath, lights a cigarette, and looks over at Daisy, who's sitting beside the tub. Martin gives Walt a haircut, chuckles, and pockets the money.",
    "4": "Walt kicks a table, then marches into his front room and kicks over another table, then punches in some cupboard doors as Daisy runs for cover. Walt sits down in an armchair, blood dripping from his fingers, and stares into the distance, a frown on his face, his features fixed and grim. He sheds a tear, and the blood on his fists has dried. Daisy comes and sits beside him. Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette. Father Janovich perches on a coffee table beside an open photograph album and stares at Walt, who drags pensively on his cigarette and looks thoughtful. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Father Janovich gets up, goes over to the cool box, returns with four cans, and passes a couple to Walt while keeping a couple for himself. They each take a swig, and Walt takes another swig as Father Janovich eyes him, who stares unwaveringly back. In the morning, Thao walks into Walt's kitchen and finds him sipping a mug of coffee. They sit at the kitchen table, Walt gives Thao a scornful look, Thao nods reluctantly, and then gets up and goes as Walt stares after him. Later, Walt is busy mowing his front lawn, and now he relaxes in the bath, lights a cigarette, and looks over at Daisy, who's sitting beside the tub. Martin gives Walt a haircut, chuckles, and pockets the money.",
    "5": "Walt kicks a table, then marches into his front room and kicks over another table, then punches in some cupboard doors as Daisy runs for cover. Walt sits down in an armchair, blood dripping from his fingers, and stares into the distance, a frown on his face, his features fixed and grim. He sheds a tear, and the blood on his fists has dried. Daisy comes and sits beside him. Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette. Father Janovich perches on a coffee table beside an open photograph album and stares at Walt, who drags pensively on his cigarette and looks thoughtful. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Father Janovich gets up, goes over to the cool box, returns with four cans, and passes a couple to Walt while keeping a couple for himself. They each take a swig, and Walt takes another swig as Father Janovich eyes him, who stares unwaveringly back. In the morning, Thao walks into Walt's kitchen and finds him sipping a mug of coffee. They sit at the kitchen table, Walt gives Thao a scornful look, Thao nods reluctantly, and then gets up and goes as Walt stares after him. Later, Walt is busy mowing his front lawn, and now he relaxes in the bath, lights a cigarette, and looks over at Daisy, who's sitting beside the tub. Martin gives Walt a haircut, chuckles, and pockets the money.",
    "6": "Walt kicks a table, then marches into his front room and kicks over another table, then punches in some cupboard doors as Daisy runs for cover. Walt sits down in an armchair, blood dripping from his fingers, and stares into the distance, a frown on his face, his features fixed and grim. He sheds a tear, and the blood on his fists has dried. Daisy comes and sits beside him. Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette. Father Janovich perches on a coffee table beside an open photograph album and stares at Walt, who drags pensively on his cigarette and looks thoughtful. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Father Janovich gets up, goes over to the cool box, returns with four cans, and passes a couple to Walt while keeping a couple for himself. They each take a swig, and Walt takes another swig as Father Janovich eyes him, who stares unwaveringly back. In the morning, Thao walks into Walt's kitchen and finds him sipping a mug of coffee. They sit at the kitchen table, Walt gives Thao a scornful look, Thao nods reluctantly, and then gets up and goes as Walt stares after him. Later, Walt is busy mowing his front lawn, and now he relaxes in the bath, lights a cigarette, and looks over at Daisy, who's sitting beside the tub. Martin gives Walt a haircut, chuckles, and pockets the money.",
    "7": "Walt kicks a table, then marches into his front room and kicks over another table, then punches in some cupboard doors as Daisy runs for cover. Walt sits down in an armchair, blood dripping from his fingers, and stares into the distance, a frown on his face, his features fixed and grim. He sheds a tear, and the blood on his fists has dried. Daisy comes and sits beside him. Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette. Father Janovich perches on a coffee table beside an open photograph album and stares at Walt, who drags pensively on his cigarette and looks thoughtful. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Father Janovich gets up, goes over to the cool box, returns with four cans, and passes a couple to Walt while keeping a couple for himself. They each take a swig, and Walt takes another swig as Father Janovich eyes him, who stares unwaveringly back. In the morning, Thao walks into Walt's kitchen and finds him sipping a mug of coffee. They sit at the kitchen table, Walt gives Thao a scornful look, Thao nods reluctantly, and then gets up and goes as Walt stares after him. Later, Walt is busy mowing his front lawn, and now he relaxes in the bath, lights a cigarette, and looks over at Daisy, who's sitting beside the tub. Martin gives Walt a haircut, chuckles, and pockets the money.",
    "8": "Walt kicks a table, then marches into his front room and kicks over another table, then punches in some cupboard doors as Daisy runs for cover. Walt sits down in an armchair, blood dripping from his fingers, and stares into the distance, a frown on his face, his features fixed and grim. He sheds a tear, and the blood on his fists has dried. Daisy comes and sits beside him. Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette. Father Janovich perches on a coffee table beside an open photograph album and stares at Walt, who drags pensively on his cigarette and looks thoughtful. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Father Janovich gets up, goes over to the cool box, returns with four cans, and passes a couple to Walt while keeping a couple for himself. They each take a swig, and Walt takes another swig as Father Janovich eyes him, who stares unwaveringly back. In the morning, Thao walks into Walt's kitchen and finds him sipping a mug of coffee. They sit at the kitchen table, Walt gives Thao a scornful look, Thao nods reluctantly, and then gets up and goes as Walt stares after him. Later, Walt is busy mowing his front lawn, and now he relaxes in the bath, lights a cigarette, and looks over at Daisy, who's sitting beside the tub. Martin gives Walt a haircut, chuckles, and pockets the money.",
    "9": "Walt kicks a table, then marches into his front room and kicks over another table, then punches in some cupboard doors as Daisy runs for cover. Walt sits down in an armchair, blood dripping from his fingers, and stares into the distance, a frown on his face, his features fixed and grim. He sheds a tear, and the blood on his fists has dried. Daisy comes and sits beside him. Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette. Father Janovich perches on a coffee table beside an open photograph album and stares at Walt, who drags pensively on his cigarette and looks thoughtful. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Father Janovich gets up, goes over to the cool box, returns with four cans, and passes a couple to Walt while keeping a couple for himself. They each take a swig, and Walt takes another swig as Father Janovich eyes him, who stares unwaveringly back. In the morning, Thao walks into Walt's kitchen and finds him sipping a mug of coffee. They sit at the kitchen table, Walt gives Thao a scornful look, Thao nods reluctantly, and then gets up and goes as Walt stares after him. Later, Walt is busy mowing his front lawn, and now he relaxes in the bath, lights a cigarette, and looks over at Daisy, who's sitting beside the tub. Martin gives Walt a haircut, chuckles, and pockets the money.",
    "10": "Walt kicks a table, then marches into his front room and kicks over another table, then punches in some cupboard doors as Daisy runs for cover. Walt sits down in an armchair, blood dripping from his fingers, and stares into the distance, a frown on his face, his features fixed and grim. He sheds a tear, and the blood on his fists has dried. Daisy comes and sits beside him. Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette. Father Janovich perches on a coffee table beside an open photograph album and stares at Walt, who drags pensively on his cigarette and looks thoughtful. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Father Janovich gets up, goes over to the cool box, returns with four cans, and passes a couple to Walt while keeping a couple for himself. They each take a swig, and Walt takes another swig as Father Janovich eyes him, who stares unwaveringly back. In the morning, Thao walks into Walt's kitchen and finds him sipping a mug of coffee. They sit at the kitchen table, Walt gives Thao a scornful look, Thao nods reluctantly, and then gets up and goes as Walt stares after him. Later, Walt is busy mowing his front lawn, and now he relaxes in the bath, lights a cigarette, and looks over at Daisy, who's sitting beside the tub. Martin gives Walt a haircut, chuckles, and pockets the money."
  }
}