{
  "ground_truth": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed.",
  "iterations": {
    "1": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed.",
    "2": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed.",
    "3": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed.",
    "4": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed.",
    "5": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed.",
    "6": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed.",
    "7": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed.",
    "8": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed.",
    "9": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed.",
    "10": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed."
  }
}