{
  "ground_truth": "The front door opens and Phyllis steps out. She closes the door and looks in the direction of the tracks. She opens the back door of the car and leans in. She pulls the rug off the corpse (which is not visible) and stands looking into the car, unable to take her eyes off what she sees, while at the same time her hands mechanically begin to fold the rug. The running steps grow louder and Neff comes into the shot breathing hard. He reaches her. Neff points back towards the tracks. He reaches into the car and begins to drag out the body by the armpits. Phyllis coolly reaches past him and takes the hat off the dead man's head. She turns to go. Phyllis releases the hand brake and puts the car in reverse. Neff is again busy unwrapping the tape from his leg.",
  "iterations": {
    "1": "The front door opens and Phyllis steps out. She closes the door and looks in the direction of the tracks. She opens the back door of the car and leans in. She pulls the rug off the corpse (which is not visible) and stands looking into the car, unable to take her eyes off what she sees, while at the same time her hands mechanically begin to fold the rug. The running steps grow louder and Neff comes into the shot breathing hard. He reaches her. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Neff points back towards the tracks. He reaches into the car and begins to drag out the body by the armpits. Phyllis coolly reaches past him and takes the hat off the dead man's head. She turns to go. Phyllis releases the hand brake and puts the car in reverse. Neff is again busy unwrapping the tape from his leg.",
    "2": "The front door opens and Phyllis steps out. She closes the door and looks in the direction of the tracks. She opens the back door of the car and leans in. She pulls the rug off the corpse (which is not visible) and stands looking into the car, unable to take her eyes off what she sees, while at the same time her hands mechanically begin to fold the rug. The running steps grow louder and Neff comes into the shot breathing hard. He reaches her. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Neff points back towards the tracks. He reaches into the car and begins to drag out the body by the armpits. Phyllis coolly reaches past him and takes the hat off the dead man's head. She turns to go. Phyllis releases the hand brake and puts the car in reverse. Neff is again busy unwrapping the tape from his leg.",
    "3": "The front door opens and Phyllis steps out. She closes the door and looks in the direction of the tracks. She opens the back door of the car and leans in. She pulls the rug off the corpse (which is not visible) and stands looking into the car, unable to take her eyes off what she sees, while at the same time her hands mechanically begin to fold the rug. The running steps grow louder and Neff comes into the shot breathing hard. He reaches her. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Neff points back towards the tracks. He reaches into the car and begins to drag out the body by the armpits. Phyllis coolly reaches past him and takes the hat off the dead man's head. She turns to go. Phyllis releases the hand brake and puts the car in reverse. Neff is again busy unwrapping the tape from his leg.",
    "4": "The front door opens and Phyllis steps out. She closes the door and looks in the direction of the tracks. She opens the back door of the car and leans in. She pulls the rug off the corpse (which is not visible) and stands looking into the car, unable to take her eyes off what she sees, while at the same time her hands mechanically begin to fold the rug. The running steps grow louder and Neff comes into the shot breathing hard. He reaches her. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Neff points back towards the tracks. He reaches into the car and begins to drag out the body by the armpits. Phyllis coolly reaches past him and takes the hat off the dead man's head. She turns to go. Phyllis releases the hand brake and puts the car in reverse. Neff is again busy unwrapping the tape from his leg.",
    "5": "The front door opens and Phyllis steps out. She closes the door and looks in the direction of the tracks. She opens the back door of the car and leans in. She pulls the rug off the corpse (which is not visible) and stands looking into the car, unable to take her eyes off what she sees, while at the same time her hands mechanically begin to fold the rug. The running steps grow louder and Neff comes into the shot breathing hard. He reaches her. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Neff points back towards the tracks. He reaches into the car and begins to drag out the body by the armpits. Phyllis coolly reaches past him and takes the hat off the dead man's head. She turns to go. Phyllis releases the hand brake and puts the car in reverse. Neff is again busy unwrapping the tape from his leg.",
    "6": "The front door opens and Phyllis steps out. She closes the door and looks in the direction of the tracks. She opens the back door of the car and leans in. She pulls the rug off the corpse (which is not visible) and stands looking into the car, unable to take her eyes off what she sees, while at the same time her hands mechanically begin to fold the rug. The running steps grow louder and Neff comes into the shot breathing hard. He reaches her. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Neff points back towards the tracks. He reaches into the car and begins to drag out the body by the armpits. Phyllis coolly reaches past him and takes the hat off the dead man's head. She turns to go. Phyllis releases the hand brake and puts the car in reverse. Neff is again busy unwrapping the tape from his leg.",
    "7": "The front door opens and Phyllis steps out. She closes the door and looks in the direction of the tracks. She opens the back door of the car and leans in. She pulls the rug off the corpse (which is not visible) and stands looking into the car, unable to take her eyes off what she sees, while at the same time her hands mechanically begin to fold the rug. The running steps grow louder and Neff comes into the shot breathing hard. He reaches her. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Neff points back towards the tracks. He reaches into the car and begins to drag out the body by the armpits. Phyllis coolly reaches past him and takes the hat off the dead man's head. She turns to go. Phyllis releases the hand brake and puts the car in reverse. Neff is again busy unwrapping the tape from his leg.",
    "8": "The front door opens and Phyllis steps out. She closes the door and looks in the direction of the tracks. She opens the back door of the car and leans in. She pulls the rug off the corpse (which is not visible) and stands looking into the car, unable to take her eyes off what she sees, while at the same time her hands mechanically begin to fold the rug. The running steps grow louder and Neff comes into the shot breathing hard. He reaches her. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Neff points back towards the tracks. He reaches into the car and begins to drag out the body by the armpits. Phyllis coolly reaches past him and takes the hat off the dead man's head. She turns to go. Phyllis releases the hand brake and puts the car in reverse. Neff is again busy unwrapping the tape from his leg.",
    "9": "The front door opens and Phyllis steps out. She closes the door and looks in the direction of the tracks. She opens the back door of the car and leans in. She pulls the rug off the corpse (which is not visible) and stands looking into the car, unable to take her eyes off what she sees, while at the same time her hands mechanically begin to fold the rug. The running steps grow louder and Neff comes into the shot breathing hard. He reaches her. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Neff points back towards the tracks. He reaches into the car and begins to drag out the body by the armpits. Phyllis coolly reaches past him and takes the hat off the dead man's head. She turns to go. Phyllis releases the hand brake and puts the car in reverse. Neff is again busy unwrapping the tape from his leg.",
    "10": "The front door opens and Phyllis steps out. She closes the door and looks in the direction of the tracks. She opens the back door of the car and leans in. She pulls the rug off the corpse (which is not visible) and stands looking into the car, unable to take her eyes off what she sees, while at the same time her hands mechanically begin to fold the rug. The running steps grow louder and Neff comes into the shot breathing hard. He reaches her. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Neff points back towards the tracks. He reaches into the car and begins to drag out the body by the armpits. Phyllis coolly reaches past him and takes the hat off the dead man's head. She turns to go. Phyllis releases the hand brake and puts the car in reverse. Neff is again busy unwrapping the tape from his leg."
  }
}