{
  "ground_truth": "A dark narrow corridor, dimly lit and festooned with cobwebs, leads to the scene where the patterned tiles underfoot are cracked and dirty. Harry hesitates, but Moody pushes past him impatiently, followed by the others moving toward an open door at the end of the gloomy passage. Nymphadora turns and winks at Harry, but she trips over an umbrella stand. Through the open door, Harry spots Mr. Weasley, Sirius, and Lupin, and as she comes out closing the door, she hugs him warmly and looks at him closely. A house elf emerges onto the landing dragging a wooden box. It has skinny arms, a long pointed nose and ears, and wears a ragged vest, glaring spitefully at Harry. The elf stands on the box and polishes a picture frame. Harry opens a door and is nearly knocked off his feet by Hermione, with Ron standing behind her. Harry looks around the bedroom and his eyes widen as the Weasley twins dangle a magic ear over the banisters. Hermione's cat, Crookshanks, sees the ear and grabs at it with his paw, then runs off with it, chased by Fred and George. Harry embraces his godfather Sirius, who holds him close. Harry's photograph is underneath, and Sirius looks directly at Harry and winks at him.",
  "iterations": {
    "1": "A dark narrow corridor, dimly lit and festooned with cobwebs, leads to the scene where the patterned tiles underfoot are cracked and dirty. Harry hesitates, but Moody pushes past him impatiently, followed by the others moving toward an open door at the end of the gloomy passage. Nymphadora turns and winks at Harry, but she trips over an umbrella stand. Through the open door, Harry spots Mr. Weasley, Sirius, and Lupin, and as she comes out closing the door, she hugs him warmly and looks at him closely. A house elf emerges onto the landing dragging a wooden box. It has skinny arms, a long pointed nose and ears, and wears a ragged vest, glaring spitefully at Harry. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. The elf stands on the box and polishes a picture frame. Harry opens a door and is nearly knocked off his feet by Hermione, with Ron standing behind her. Harry looks around the bedroom and his eyes widen as the Weasley twins dangle a magic ear over the banisters. Hermione's cat, Crookshanks, sees the ear and grabs at it with his paw, then runs off with it, chased by Fred and George. Harry embraces his godfather Sirius, who holds him close. Harry's photograph is underneath, and Sirius looks directly at Harry and winks at him.",
    "2": "A dark narrow corridor, dimly lit and festooned with cobwebs, leads to the scene where the patterned tiles underfoot are cracked and dirty. Harry hesitates, but Moody pushes past him impatiently, followed by the others moving toward an open door at the end of the gloomy passage. Nymphadora turns and winks at Harry, but she trips over an umbrella stand. Through the open door, Harry spots Mr. Weasley, Sirius, and Lupin, and as she comes out closing the door, she hugs him warmly and looks at him closely. A house elf emerges onto the landing dragging a wooden box. It has skinny arms, a long pointed nose and ears, and wears a ragged vest, glaring spitefully at Harry. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. The elf stands on the box and polishes a picture frame. Harry opens a door and is nearly knocked off his feet by Hermione, with Ron standing behind her. Harry looks around the bedroom and his eyes widen as the Weasley twins dangle a magic ear over the banisters. Hermione's cat, Crookshanks, sees the ear and grabs at it with his paw, then runs off with it, chased by Fred and George. Harry embraces his godfather Sirius, who holds him close. Harry's photograph is underneath, and Sirius looks directly at Harry and winks at him.",
    "3": "A dark narrow corridor, dimly lit and festooned with cobwebs, leads to the scene where the patterned tiles underfoot are cracked and dirty. Harry hesitates, but Moody pushes past him impatiently, followed by the others moving toward an open door at the end of the gloomy passage. Nymphadora turns and winks at Harry, but she trips over an umbrella stand. Through the open door, Harry spots Mr. Weasley, Sirius, and Lupin, and as she comes out closing the door, she hugs him warmly and looks at him closely. A house elf emerges onto the landing dragging a wooden box. It has skinny arms, a long pointed nose and ears, and wears a ragged vest, glaring spitefully at Harry. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. The elf stands on the box and polishes a picture frame. Harry opens a door and is nearly knocked off his feet by Hermione, with Ron standing behind her. Harry looks around the bedroom and his eyes widen as the Weasley twins dangle a magic ear over the banisters. Hermione's cat, Crookshanks, sees the ear and grabs at it with his paw, then runs off with it, chased by Fred and George. Harry embraces his godfather Sirius, who holds him close. Harry's photograph is underneath, and Sirius looks directly at Harry and winks at him.",
    "4": "A dark narrow corridor, dimly lit and festooned with cobwebs, leads to the scene where the patterned tiles underfoot are cracked and dirty. Harry hesitates, but Moody pushes past him impatiently, followed by the others moving toward an open door at the end of the gloomy passage. Nymphadora turns and winks at Harry, but she trips over an umbrella stand. Through the open door, Harry spots Mr. Weasley, Sirius, and Lupin, and as she comes out closing the door, she hugs him warmly and looks at him closely. A house elf emerges onto the landing dragging a wooden box. It has skinny arms, a long pointed nose and ears, and wears a ragged vest, glaring spitefully at Harry. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. The elf stands on the box and polishes a picture frame. Harry opens a door and is nearly knocked off his feet by Hermione, with Ron standing behind her. Harry looks around the bedroom and his eyes widen as the Weasley twins dangle a magic ear over the banisters. Hermione's cat, Crookshanks, sees the ear and grabs at it with his paw, then runs off with it, chased by Fred and George. Harry embraces his godfather Sirius, who holds him close. Harry's photograph is underneath, and Sirius looks directly at Harry and winks at him.",
    "5": "A dark narrow corridor, dimly lit and festooned with cobwebs, leads to the scene where the patterned tiles underfoot are cracked and dirty. Harry hesitates, but Moody pushes past him impatiently, followed by the others moving toward an open door at the end of the gloomy passage. Nymphadora turns and winks at Harry, but she trips over an umbrella stand. Through the open door, Harry spots Mr. Weasley, Sirius, and Lupin, and as she comes out closing the door, she hugs him warmly and looks at him closely. A house elf emerges onto the landing dragging a wooden box. It has skinny arms, a long pointed nose and ears, and wears a ragged vest, glaring spitefully at Harry. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. The elf stands on the box and polishes a picture frame. Harry opens a door and is nearly knocked off his feet by Hermione, with Ron standing behind her. Harry looks around the bedroom and his eyes widen as the Weasley twins dangle a magic ear over the banisters. Hermione's cat, Crookshanks, sees the ear and grabs at it with his paw, then runs off with it, chased by Fred and George. Harry embraces his godfather Sirius, who holds him close. Harry's photograph is underneath, and Sirius looks directly at Harry and winks at him.",
    "6": "A dark narrow corridor, dimly lit and festooned with cobwebs, leads to the scene where the patterned tiles underfoot are cracked and dirty. Harry hesitates, but Moody pushes past him impatiently, followed by the others moving toward an open door at the end of the gloomy passage. Nymphadora turns and winks at Harry, but she trips over an umbrella stand. Through the open door, Harry spots Mr. Weasley, Sirius, and Lupin, and as she comes out closing the door, she hugs him warmly and looks at him closely. A house elf emerges onto the landing dragging a wooden box. It has skinny arms, a long pointed nose and ears, and wears a ragged vest, glaring spitefully at Harry. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. The elf stands on the box and polishes a picture frame. Harry opens a door and is nearly knocked off his feet by Hermione, with Ron standing behind her. Harry looks around the bedroom and his eyes widen as the Weasley twins dangle a magic ear over the banisters. Hermione's cat, Crookshanks, sees the ear and grabs at it with his paw, then runs off with it, chased by Fred and George. Harry embraces his godfather Sirius, who holds him close. Harry's photograph is underneath, and Sirius looks directly at Harry and winks at him.",
    "7": "A dark narrow corridor, dimly lit and festooned with cobwebs, leads to the scene where the patterned tiles underfoot are cracked and dirty. Harry hesitates, but Moody pushes past him impatiently, followed by the others moving toward an open door at the end of the gloomy passage. Nymphadora turns and winks at Harry, but she trips over an umbrella stand. Through the open door, Harry spots Mr. Weasley, Sirius, and Lupin, and as she comes out closing the door, she hugs him warmly and looks at him closely. A house elf emerges onto the landing dragging a wooden box. It has skinny arms, a long pointed nose and ears, and wears a ragged vest, glaring spitefully at Harry. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. The elf stands on the box and polishes a picture frame. Harry opens a door and is nearly knocked off his feet by Hermione, with Ron standing behind her. Harry looks around the bedroom and his eyes widen as the Weasley twins dangle a magic ear over the banisters. Hermione's cat, Crookshanks, sees the ear and grabs at it with his paw, then runs off with it, chased by Fred and George. Harry embraces his godfather Sirius, who holds him close. Harry's photograph is underneath, and Sirius looks directly at Harry and winks at him.",
    "8": "A dark narrow corridor, dimly lit and festooned with cobwebs, leads to the scene where the patterned tiles underfoot are cracked and dirty. Harry hesitates, but Moody pushes past him impatiently, followed by the others moving toward an open door at the end of the gloomy passage. Nymphadora turns and winks at Harry, but she trips over an umbrella stand. Through the open door, Harry spots Mr. Weasley, Sirius, and Lupin, and as she comes out closing the door, she hugs him warmly and looks at him closely. A house elf emerges onto the landing dragging a wooden box. It has skinny arms, a long pointed nose and ears, and wears a ragged vest, glaring spitefully at Harry. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. The elf stands on the box and polishes a picture frame. Harry opens a door and is nearly knocked off his feet by Hermione, with Ron standing behind her. Harry looks around the bedroom and his eyes widen as the Weasley twins dangle a magic ear over the banisters. Hermione's cat, Crookshanks, sees the ear and grabs at it with his paw, then runs off with it, chased by Fred and George. Harry embraces his godfather Sirius, who holds him close. Harry's photograph is underneath, and Sirius looks directly at Harry and winks at him.",
    "9": "A dark narrow corridor, dimly lit and festooned with cobwebs, leads to the scene where the patterned tiles underfoot are cracked and dirty. Harry hesitates, but Moody pushes past him impatiently, followed by the others moving toward an open door at the end of the gloomy passage. Nymphadora turns and winks at Harry, but she trips over an umbrella stand. Through the open door, Harry spots Mr. Weasley, Sirius, and Lupin, and as she comes out closing the door, she hugs him warmly and looks at him closely. A house elf emerges onto the landing dragging a wooden box. It has skinny arms, a long pointed nose and ears, and wears a ragged vest, glaring spitefully at Harry. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. The elf stands on the box and polishes a picture frame. Harry opens a door and is nearly knocked off his feet by Hermione, with Ron standing behind her. Harry looks around the bedroom and his eyes widen as the Weasley twins dangle a magic ear over the banisters. Hermione's cat, Crookshanks, sees the ear and grabs at it with his paw, then runs off with it, chased by Fred and George. Harry embraces his godfather Sirius, who holds him close. Harry's photograph is underneath, and Sirius looks directly at Harry and winks at him.",
    "10": "A dark narrow corridor, dimly lit and festooned with cobwebs, leads to the scene where the patterned tiles underfoot are cracked and dirty. Harry hesitates, but Moody pushes past him impatiently, followed by the others moving toward an open door at the end of the gloomy passage. Nymphadora turns and winks at Harry, but she trips over an umbrella stand. Through the open door, Harry spots Mr. Weasley, Sirius, and Lupin, and as she comes out closing the door, she hugs him warmly and looks at him closely. A house elf emerges onto the landing dragging a wooden box. It has skinny arms, a long pointed nose and ears, and wears a ragged vest, glaring spitefully at Harry. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. The elf stands on the box and polishes a picture frame. Harry opens a door and is nearly knocked off his feet by Hermione, with Ron standing behind her. Harry looks around the bedroom and his eyes widen as the Weasley twins dangle a magic ear over the banisters. Hermione's cat, Crookshanks, sees the ear and grabs at it with his paw, then runs off with it, chased by Fred and George. Harry embraces his godfather Sirius, who holds him close. Harry's photograph is underneath, and Sirius looks directly at Harry and winks at him."
  }
}