{
  "ground_truth": "Each singer in the front row holds a huge toad as Professor Lupin stands and nods to the students, while Hagrid, the huge giant, stands up, knocking into the table and extinguishing a candle that relights itself before he leaves the Hall. Harry and his friends climb the moving staircase towards a portrait of a fat lady holding a glass and singing, which she smashes against a pillar. The portrait swings back, and they go into the common room where a ghost walks through them, and the boys try magic sweets. Neville chews the sweet, Ron tries one, and steam shoots from Harry's ears. Outside the window, the rain lashes down and lightning flashes as the storm rages around Hogwarts Castle, with black-cloaked Dementors hovering outside the school grounds. A small bird flies along the stone cloister, swoops down a grassy slope towards a crooked willow tree, which pulls back a branch and thwacks the bird, causing feathers to fly. In a classroom, she recoils, then outside the school, the students follow Hagrid around the edge of the sunlit forest to a grassy clearing surrounded by a low wall where Malfoy strokes his monster book, which purrs contentedly. Malfoy slowly approaches Harry, stares at him arrogantly, then, looking terrified, points over Harry's shoulder, and Harry spins round as his cronies pull up their hooded cloaks. Neville looks bedraggled next to a magnificent creature that stands in front of them, and all but Harry step back as Ron gives Harry a push. Nervously, Harry moves forward and bows to the creature, which flaps its huge wings and bows its birdlike head. Hagrid throws a tidbit while Malfoy pushes to the front, and Harry stretches out his hand as Hermione clutches Ron's hand and they both look embarrassed. Harry pats the creature, and as Hagrid smacks its hindquarters, it raises its huge wings and takes off while Harry hangs on desperately to Buckbeak's feathery neck, the four-legged creature, half-horse, half-eagle, rising above the trees.",
  "iterations": {
    "1": "Each singer in the front row holds a huge toad as Professor Lupin stands and nods to the students, while Hagrid, the huge giant, stands up, knocking into the table and extinguishing a candle that relights itself before he leaves the Hall. Harry and his friends climb the moving staircase towards a portrait of a fat lady holding a glass and singing, which she smashes against a pillar. The portrait swings back, and they go into the common room where a ghost walks through them, and the boys try magic sweets. Neville chews the sweet, Ron tries one, and steam shoots from Harry's ears. Outside the window, the rain lashes down and lightning flashes as the storm rages around Hogwarts Castle, with black-cloaked Dementors hovering outside the school grounds. A small bird flies along the stone cloister, swoops down a grassy slope towards a crooked willow tree, which pulls back a branch and thwacks the bird, causing feathers to fly. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a classroom, she recoils, then outside the school, the students follow Hagrid around the edge of the sunlit forest to a grassy clearing surrounded by a low wall where Malfoy strokes his monster book, which purrs contentedly. Malfoy slowly approaches Harry, stares at him arrogantly, then, looking terrified, points over Harry's shoulder, and Harry spins round as his cronies pull up their hooded cloaks. Neville looks bedraggled next to a magnificent creature that stands in front of them, and all but Harry step back as Ron gives Harry a push. Nervously, Harry moves forward and bows to the creature, which flaps its huge wings and bows its birdlike head. Hagrid throws a tidbit while Malfoy pushes to the front, and Harry stretches out his hand as Hermione clutches Ron's hand and they both look embarrassed. Harry pats the creature, and as Hagrid smacks its hindquarters, it raises its huge wings and takes off while Harry hangs on desperately to Buckbeak's feathery neck, the four-legged creature, half-horse, half-eagle, rising above the trees.",
    "2": "Each singer in the front row holds a huge toad as Professor Lupin stands and nods to the students, while Hagrid, the huge giant, stands up, knocking into the table and extinguishing a candle that relights itself before he leaves the Hall. Harry and his friends climb the moving staircase towards a portrait of a fat lady holding a glass and singing, which she smashes against a pillar. The portrait swings back, and they go into the common room where a ghost walks through them, and the boys try magic sweets. Neville chews the sweet, Ron tries one, and steam shoots from Harry's ears. Outside the window, the rain lashes down and lightning flashes as the storm rages around Hogwarts Castle, with black-cloaked Dementors hovering outside the school grounds. A small bird flies along the stone cloister, swoops down a grassy slope towards a crooked willow tree, which pulls back a branch and thwacks the bird, causing feathers to fly. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a classroom, she recoils, then outside the school, the students follow Hagrid around the edge of the sunlit forest to a grassy clearing surrounded by a low wall where Malfoy strokes his monster book, which purrs contentedly. Malfoy slowly approaches Harry, stares at him arrogantly, then, looking terrified, points over Harry's shoulder, and Harry spins round as his cronies pull up their hooded cloaks. Neville looks bedraggled next to a magnificent creature that stands in front of them, and all but Harry step back as Ron gives Harry a push. Nervously, Harry moves forward and bows to the creature, which flaps its huge wings and bows its birdlike head. Hagrid throws a tidbit while Malfoy pushes to the front, and Harry stretches out his hand as Hermione clutches Ron's hand and they both look embarrassed. Harry pats the creature, and as Hagrid smacks its hindquarters, it raises its huge wings and takes off while Harry hangs on desperately to Buckbeak's feathery neck, the four-legged creature, half-horse, half-eagle, rising above the trees.",
    "3": "Each singer in the front row holds a huge toad as Professor Lupin stands and nods to the students, while Hagrid, the huge giant, stands up, knocking into the table and extinguishing a candle that relights itself before he leaves the Hall. Harry and his friends climb the moving staircase towards a portrait of a fat lady holding a glass and singing, which she smashes against a pillar. The portrait swings back, and they go into the common room where a ghost walks through them, and the boys try magic sweets. Neville chews the sweet, Ron tries one, and steam shoots from Harry's ears. Outside the window, the rain lashes down and lightning flashes as the storm rages around Hogwarts Castle, with black-cloaked Dementors hovering outside the school grounds. A small bird flies along the stone cloister, swoops down a grassy slope towards a crooked willow tree, which pulls back a branch and thwacks the bird, causing feathers to fly. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a classroom, she recoils, then outside the school, the students follow Hagrid around the edge of the sunlit forest to a grassy clearing surrounded by a low wall where Malfoy strokes his monster book, which purrs contentedly. Malfoy slowly approaches Harry, stares at him arrogantly, then, looking terrified, points over Harry's shoulder, and Harry spins round as his cronies pull up their hooded cloaks. Neville looks bedraggled next to a magnificent creature that stands in front of them, and all but Harry step back as Ron gives Harry a push. Nervously, Harry moves forward and bows to the creature, which flaps its huge wings and bows its birdlike head. Hagrid throws a tidbit while Malfoy pushes to the front, and Harry stretches out his hand as Hermione clutches Ron's hand and they both look embarrassed. Harry pats the creature, and as Hagrid smacks its hindquarters, it raises its huge wings and takes off while Harry hangs on desperately to Buckbeak's feathery neck, the four-legged creature, half-horse, half-eagle, rising above the trees.",
    "4": "Each singer in the front row holds a huge toad as Professor Lupin stands and nods to the students, while Hagrid, the huge giant, stands up, knocking into the table and extinguishing a candle that relights itself before he leaves the Hall. Harry and his friends climb the moving staircase towards a portrait of a fat lady holding a glass and singing, which she smashes against a pillar. The portrait swings back, and they go into the common room where a ghost walks through them, and the boys try magic sweets. Neville chews the sweet, Ron tries one, and steam shoots from Harry's ears. Outside the window, the rain lashes down and lightning flashes as the storm rages around Hogwarts Castle, with black-cloaked Dementors hovering outside the school grounds. A small bird flies along the stone cloister, swoops down a grassy slope towards a crooked willow tree, which pulls back a branch and thwacks the bird, causing feathers to fly. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a classroom, she recoils, then outside the school, the students follow Hagrid around the edge of the sunlit forest to a grassy clearing surrounded by a low wall where Malfoy strokes his monster book, which purrs contentedly. Malfoy slowly approaches Harry, stares at him arrogantly, then, looking terrified, points over Harry's shoulder, and Harry spins round as his cronies pull up their hooded cloaks. Neville looks bedraggled next to a magnificent creature that stands in front of them, and all but Harry step back as Ron gives Harry a push. Nervously, Harry moves forward and bows to the creature, which flaps its huge wings and bows its birdlike head. Hagrid throws a tidbit while Malfoy pushes to the front, and Harry stretches out his hand as Hermione clutches Ron's hand and they both look embarrassed. Harry pats the creature, and as Hagrid smacks its hindquarters, it raises its huge wings and takes off while Harry hangs on desperately to Buckbeak's feathery neck, the four-legged creature, half-horse, half-eagle, rising above the trees.",
    "5": "Each singer in the front row holds a huge toad as Professor Lupin stands and nods to the students, while Hagrid, the huge giant, stands up, knocking into the table and extinguishing a candle that relights itself before he leaves the Hall. Harry and his friends climb the moving staircase towards a portrait of a fat lady holding a glass and singing, which she smashes against a pillar. The portrait swings back, and they go into the common room where a ghost walks through them, and the boys try magic sweets. Neville chews the sweet, Ron tries one, and steam shoots from Harry's ears. Outside the window, the rain lashes down and lightning flashes as the storm rages around Hogwarts Castle, with black-cloaked Dementors hovering outside the school grounds. A small bird flies along the stone cloister, swoops down a grassy slope towards a crooked willow tree, which pulls back a branch and thwacks the bird, causing feathers to fly. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a classroom, she recoils, then outside the school, the students follow Hagrid around the edge of the sunlit forest to a grassy clearing surrounded by a low wall where Malfoy strokes his monster book, which purrs contentedly. Malfoy slowly approaches Harry, stares at him arrogantly, then, looking terrified, points over Harry's shoulder, and Harry spins round as his cronies pull up their hooded cloaks. Neville looks bedraggled next to a magnificent creature that stands in front of them, and all but Harry step back as Ron gives Harry a push. Nervously, Harry moves forward and bows to the creature, which flaps its huge wings and bows its birdlike head. Hagrid throws a tidbit while Malfoy pushes to the front, and Harry stretches out his hand as Hermione clutches Ron's hand and they both look embarrassed. Harry pats the creature, and as Hagrid smacks its hindquarters, it raises its huge wings and takes off while Harry hangs on desperately to Buckbeak's feathery neck, the four-legged creature, half-horse, half-eagle, rising above the trees.",
    "6": "Each singer in the front row holds a huge toad as Professor Lupin stands and nods to the students, while Hagrid, the huge giant, stands up, knocking into the table and extinguishing a candle that relights itself before he leaves the Hall. Harry and his friends climb the moving staircase towards a portrait of a fat lady holding a glass and singing, which she smashes against a pillar. The portrait swings back, and they go into the common room where a ghost walks through them, and the boys try magic sweets. Neville chews the sweet, Ron tries one, and steam shoots from Harry's ears. Outside the window, the rain lashes down and lightning flashes as the storm rages around Hogwarts Castle, with black-cloaked Dementors hovering outside the school grounds. A small bird flies along the stone cloister, swoops down a grassy slope towards a crooked willow tree, which pulls back a branch and thwacks the bird, causing feathers to fly. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a classroom, she recoils, then outside the school, the students follow Hagrid around the edge of the sunlit forest to a grassy clearing surrounded by a low wall where Malfoy strokes his monster book, which purrs contentedly. Malfoy slowly approaches Harry, stares at him arrogantly, then, looking terrified, points over Harry's shoulder, and Harry spins round as his cronies pull up their hooded cloaks. Neville looks bedraggled next to a magnificent creature that stands in front of them, and all but Harry step back as Ron gives Harry a push. Nervously, Harry moves forward and bows to the creature, which flaps its huge wings and bows its birdlike head. Hagrid throws a tidbit while Malfoy pushes to the front, and Harry stretches out his hand as Hermione clutches Ron's hand and they both look embarrassed. Harry pats the creature, and as Hagrid smacks its hindquarters, it raises its huge wings and takes off while Harry hangs on desperately to Buckbeak's feathery neck, the four-legged creature, half-horse, half-eagle, rising above the trees.",
    "7": "Each singer in the front row holds a huge toad as Professor Lupin stands and nods to the students, while Hagrid, the huge giant, stands up, knocking into the table and extinguishing a candle that relights itself before he leaves the Hall. Harry and his friends climb the moving staircase towards a portrait of a fat lady holding a glass and singing, which she smashes against a pillar. The portrait swings back, and they go into the common room where a ghost walks through them, and the boys try magic sweets. Neville chews the sweet, Ron tries one, and steam shoots from Harry's ears. Outside the window, the rain lashes down and lightning flashes as the storm rages around Hogwarts Castle, with black-cloaked Dementors hovering outside the school grounds. A small bird flies along the stone cloister, swoops down a grassy slope towards a crooked willow tree, which pulls back a branch and thwacks the bird, causing feathers to fly. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a classroom, she recoils, then outside the school, the students follow Hagrid around the edge of the sunlit forest to a grassy clearing surrounded by a low wall where Malfoy strokes his monster book, which purrs contentedly. Malfoy slowly approaches Harry, stares at him arrogantly, then, looking terrified, points over Harry's shoulder, and Harry spins round as his cronies pull up their hooded cloaks. Neville looks bedraggled next to a magnificent creature that stands in front of them, and all but Harry step back as Ron gives Harry a push. Nervously, Harry moves forward and bows to the creature, which flaps its huge wings and bows its birdlike head. Hagrid throws a tidbit while Malfoy pushes to the front, and Harry stretches out his hand as Hermione clutches Ron's hand and they both look embarrassed. Harry pats the creature, and as Hagrid smacks its hindquarters, it raises its huge wings and takes off while Harry hangs on desperately to Buckbeak's feathery neck, the four-legged creature, half-horse, half-eagle, rising above the trees.",
    "8": "Each singer in the front row holds a huge toad as Professor Lupin stands and nods to the students, while Hagrid, the huge giant, stands up, knocking into the table and extinguishing a candle that relights itself before he leaves the Hall. Harry and his friends climb the moving staircase towards a portrait of a fat lady holding a glass and singing, which she smashes against a pillar. The portrait swings back, and they go into the common room where a ghost walks through them, and the boys try magic sweets. Neville chews the sweet, Ron tries one, and steam shoots from Harry's ears. Outside the window, the rain lashes down and lightning flashes as the storm rages around Hogwarts Castle, with black-cloaked Dementors hovering outside the school grounds. A small bird flies along the stone cloister, swoops down a grassy slope towards a crooked willow tree, which pulls back a branch and thwacks the bird, causing feathers to fly. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a classroom, she recoils, then outside the school, the students follow Hagrid around the edge of the sunlit forest to a grassy clearing surrounded by a low wall where Malfoy strokes his monster book, which purrs contentedly. Malfoy slowly approaches Harry, stares at him arrogantly, then, looking terrified, points over Harry's shoulder, and Harry spins round as his cronies pull up their hooded cloaks. Neville looks bedraggled next to a magnificent creature that stands in front of them, and all but Harry step back as Ron gives Harry a push. Nervously, Harry moves forward and bows to the creature, which flaps its huge wings and bows its birdlike head. Hagrid throws a tidbit while Malfoy pushes to the front, and Harry stretches out his hand as Hermione clutches Ron's hand and they both look embarrassed. Harry pats the creature, and as Hagrid smacks its hindquarters, it raises its huge wings and takes off while Harry hangs on desperately to Buckbeak's feathery neck, the four-legged creature, half-horse, half-eagle, rising above the trees.",
    "9": "Each singer in the front row holds a huge toad as Professor Lupin stands and nods to the students, while Hagrid, the huge giant, stands up, knocking into the table and extinguishing a candle that relights itself before he leaves the Hall. Harry and his friends climb the moving staircase towards a portrait of a fat lady holding a glass and singing, which she smashes against a pillar. The portrait swings back, and they go into the common room where a ghost walks through them, and the boys try magic sweets. Neville chews the sweet, Ron tries one, and steam shoots from Harry's ears. Outside the window, the rain lashes down and lightning flashes as the storm rages around Hogwarts Castle, with black-cloaked Dementors hovering outside the school grounds. A small bird flies along the stone cloister, swoops down a grassy slope towards a crooked willow tree, which pulls back a branch and thwacks the bird, causing feathers to fly. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a classroom, she recoils, then outside the school, the students follow Hagrid around the edge of the sunlit forest to a grassy clearing surrounded by a low wall where Malfoy strokes his monster book, which purrs contentedly. Malfoy slowly approaches Harry, stares at him arrogantly, then, looking terrified, points over Harry's shoulder, and Harry spins round as his cronies pull up their hooded cloaks. Neville looks bedraggled next to a magnificent creature that stands in front of them, and all but Harry step back as Ron gives Harry a push. Nervously, Harry moves forward and bows to the creature, which flaps its huge wings and bows its birdlike head. Hagrid throws a tidbit while Malfoy pushes to the front, and Harry stretches out his hand as Hermione clutches Ron's hand and they both look embarrassed. Harry pats the creature, and as Hagrid smacks its hindquarters, it raises its huge wings and takes off while Harry hangs on desperately to Buckbeak's feathery neck, the four-legged creature, half-horse, half-eagle, rising above the trees.",
    "10": "Each singer in the front row holds a huge toad as Professor Lupin stands and nods to the students, while Hagrid, the huge giant, stands up, knocking into the table and extinguishing a candle that relights itself before he leaves the Hall. Harry and his friends climb the moving staircase towards a portrait of a fat lady holding a glass and singing, which she smashes against a pillar. The portrait swings back, and they go into the common room where a ghost walks through them, and the boys try magic sweets. Neville chews the sweet, Ron tries one, and steam shoots from Harry's ears. Outside the window, the rain lashes down and lightning flashes as the storm rages around Hogwarts Castle, with black-cloaked Dementors hovering outside the school grounds. A small bird flies along the stone cloister, swoops down a grassy slope towards a crooked willow tree, which pulls back a branch and thwacks the bird, causing feathers to fly. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a classroom, she recoils, then outside the school, the students follow Hagrid around the edge of the sunlit forest to a grassy clearing surrounded by a low wall where Malfoy strokes his monster book, which purrs contentedly. Malfoy slowly approaches Harry, stares at him arrogantly, then, looking terrified, points over Harry's shoulder, and Harry spins round as his cronies pull up their hooded cloaks. Neville looks bedraggled next to a magnificent creature that stands in front of them, and all but Harry step back as Ron gives Harry a push. Nervously, Harry moves forward and bows to the creature, which flaps its huge wings and bows its birdlike head. Hagrid throws a tidbit while Malfoy pushes to the front, and Harry stretches out his hand as Hermione clutches Ron's hand and they both look embarrassed. Harry pats the creature, and as Hagrid smacks its hindquarters, it raises its huge wings and takes off while Harry hangs on desperately to Buckbeak's feathery neck, the four-legged creature, half-horse, half-eagle, rising above the trees."
  }
}