{
  "ground_truth": "Jenny takes a gold necklace out of a box, but wagging his tail playfully, Marley gets the necklace. John trips on a chair and the chase is on around the living room. The dog easily outmaneuvers Jenny, but John grabs him and forces open his jaws. John sprays Marley's poop with a hose, looking for the necklace. The doctor holds a probe to Jenny's stomach and moves a scanner around on gel on Jenny's stomach. A fuzzy picture appears on a screen, but the doctor frowns and removes the scanner, then walks out, leaving the Grogans waiting anxiously in the examination room. The doctor returns, smiles reassuringly, and places the scanner on Jenny's stomach. Jenny nods, tight-lipped, and the doctor withdraws with a sympathetic smile of apology. Jenny glances at her husband, who's lost for words as they drive down a palm tree-lined road. John glances at Jenny and gropes to break the silence; without looking at him, she settles back against her headrest and stares out of the window. They drive on down the sunny freeway toward the city. Back home, John opens the front door for his wife.",
  "iterations": {
    "1": "Jenny takes a gold necklace out of a box, but wagging his tail playfully, Marley gets the necklace. John trips on a chair and the chase is on around the living room. The dog easily outmaneuvers Jenny, but John grabs him and forces open his jaws. John sprays Marley's poop with a hose, looking for the necklace. The doctor holds a probe to Jenny's stomach and moves a scanner around on gel on Jenny's stomach. A fuzzy picture appears on a screen, but the doctor frowns and removes the scanner, then walks out, leaving the Grogans waiting anxiously in the examination room. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. The doctor returns, smiles reassuringly, and places the scanner on Jenny's stomach. Jenny nods, tight-lipped, and the doctor withdraws with a sympathetic smile of apology. Jenny glances at her husband, who's lost for words as they drive down a palm tree-lined road. John glances at Jenny and gropes to break the silence; without looking at him, she settles back against her headrest and stares out of the window. They drive on down the sunny freeway toward the city. Back home, John opens the front door for his wife.",
    "2": "Jenny takes a gold necklace out of a box, but wagging his tail playfully, Marley gets the necklace. John trips on a chair and the chase is on around the living room. The dog easily outmaneuvers Jenny, but John grabs him and forces open his jaws. John sprays Marley's poop with a hose, looking for the necklace. The doctor holds a probe to Jenny's stomach and moves a scanner around on gel on Jenny's stomach. A fuzzy picture appears on a screen, but the doctor frowns and removes the scanner, then walks out, leaving the Grogans waiting anxiously in the examination room. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. The doctor returns, smiles reassuringly, and places the scanner on Jenny's stomach. Jenny nods, tight-lipped, and the doctor withdraws with a sympathetic smile of apology. Jenny glances at her husband, who's lost for words as they drive down a palm tree-lined road. John glances at Jenny and gropes to break the silence; without looking at him, she settles back against her headrest and stares out of the window. They drive on down the sunny freeway toward the city. Back home, John opens the front door for his wife.",
    "3": "Jenny takes a gold necklace out of a box, but wagging his tail playfully, Marley gets the necklace. John trips on a chair and the chase is on around the living room. The dog easily outmaneuvers Jenny, but John grabs him and forces open his jaws. John sprays Marley's poop with a hose, looking for the necklace. The doctor holds a probe to Jenny's stomach and moves a scanner around on gel on Jenny's stomach. A fuzzy picture appears on a screen, but the doctor frowns and removes the scanner, then walks out, leaving the Grogans waiting anxiously in the examination room. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. The doctor returns, smiles reassuringly, and places the scanner on Jenny's stomach. Jenny nods, tight-lipped, and the doctor withdraws with a sympathetic smile of apology. Jenny glances at her husband, who's lost for words as they drive down a palm tree-lined road. John glances at Jenny and gropes to break the silence; without looking at him, she settles back against her headrest and stares out of the window. They drive on down the sunny freeway toward the city. Back home, John opens the front door for his wife.",
    "4": "Jenny takes a gold necklace out of a box, but wagging his tail playfully, Marley gets the necklace. John trips on a chair and the chase is on around the living room. The dog easily outmaneuvers Jenny, but John grabs him and forces open his jaws. John sprays Marley's poop with a hose, looking for the necklace. The doctor holds a probe to Jenny's stomach and moves a scanner around on gel on Jenny's stomach. A fuzzy picture appears on a screen, but the doctor frowns and removes the scanner, then walks out, leaving the Grogans waiting anxiously in the examination room. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. The doctor returns, smiles reassuringly, and places the scanner on Jenny's stomach. Jenny nods, tight-lipped, and the doctor withdraws with a sympathetic smile of apology. Jenny glances at her husband, who's lost for words as they drive down a palm tree-lined road. John glances at Jenny and gropes to break the silence; without looking at him, she settles back against her headrest and stares out of the window. They drive on down the sunny freeway toward the city. Back home, John opens the front door for his wife.",
    "5": "Jenny takes a gold necklace out of a box, but wagging his tail playfully, Marley gets the necklace. John trips on a chair and the chase is on around the living room. The dog easily outmaneuvers Jenny, but John grabs him and forces open his jaws. John sprays Marley's poop with a hose, looking for the necklace. The doctor holds a probe to Jenny's stomach and moves a scanner around on gel on Jenny's stomach. A fuzzy picture appears on a screen, but the doctor frowns and removes the scanner, then walks out, leaving the Grogans waiting anxiously in the examination room. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. The doctor returns, smiles reassuringly, and places the scanner on Jenny's stomach. Jenny nods, tight-lipped, and the doctor withdraws with a sympathetic smile of apology. Jenny glances at her husband, who's lost for words as they drive down a palm tree-lined road. John glances at Jenny and gropes to break the silence; without looking at him, she settles back against her headrest and stares out of the window. They drive on down the sunny freeway toward the city. Back home, John opens the front door for his wife.",
    "6": "Jenny takes a gold necklace out of a box, but wagging his tail playfully, Marley gets the necklace. John trips on a chair and the chase is on around the living room. The dog easily outmaneuvers Jenny, but John grabs him and forces open his jaws. John sprays Marley's poop with a hose, looking for the necklace. The doctor holds a probe to Jenny's stomach and moves a scanner around on gel on Jenny's stomach. A fuzzy picture appears on a screen, but the doctor frowns and removes the scanner, then walks out, leaving the Grogans waiting anxiously in the examination room. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. The doctor returns, smiles reassuringly, and places the scanner on Jenny's stomach. Jenny nods, tight-lipped, and the doctor withdraws with a sympathetic smile of apology. Jenny glances at her husband, who's lost for words as they drive down a palm tree-lined road. John glances at Jenny and gropes to break the silence; without looking at him, she settles back against her headrest and stares out of the window. They drive on down the sunny freeway toward the city. Back home, John opens the front door for his wife.",
    "7": "Jenny takes a gold necklace out of a box, but wagging his tail playfully, Marley gets the necklace. John trips on a chair and the chase is on around the living room. The dog easily outmaneuvers Jenny, but John grabs him and forces open his jaws. John sprays Marley's poop with a hose, looking for the necklace. The doctor holds a probe to Jenny's stomach and moves a scanner around on gel on Jenny's stomach. A fuzzy picture appears on a screen, but the doctor frowns and removes the scanner, then walks out, leaving the Grogans waiting anxiously in the examination room. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. The doctor returns, smiles reassuringly, and places the scanner on Jenny's stomach. Jenny nods, tight-lipped, and the doctor withdraws with a sympathetic smile of apology. Jenny glances at her husband, who's lost for words as they drive down a palm tree-lined road. John glances at Jenny and gropes to break the silence; without looking at him, she settles back against her headrest and stares out of the window. They drive on down the sunny freeway toward the city. Back home, John opens the front door for his wife.",
    "8": "Jenny takes a gold necklace out of a box, but wagging his tail playfully, Marley gets the necklace. John trips on a chair and the chase is on around the living room. The dog easily outmaneuvers Jenny, but John grabs him and forces open his jaws. John sprays Marley's poop with a hose, looking for the necklace. The doctor holds a probe to Jenny's stomach and moves a scanner around on gel on Jenny's stomach. A fuzzy picture appears on a screen, but the doctor frowns and removes the scanner, then walks out, leaving the Grogans waiting anxiously in the examination room. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. The doctor returns, smiles reassuringly, and places the scanner on Jenny's stomach. Jenny nods, tight-lipped, and the doctor withdraws with a sympathetic smile of apology. Jenny glances at her husband, who's lost for words as they drive down a palm tree-lined road. John glances at Jenny and gropes to break the silence; without looking at him, she settles back against her headrest and stares out of the window. They drive on down the sunny freeway toward the city. Back home, John opens the front door for his wife.",
    "9": "Jenny takes a gold necklace out of a box, but wagging his tail playfully, Marley gets the necklace. John trips on a chair and the chase is on around the living room. The dog easily outmaneuvers Jenny, but John grabs him and forces open his jaws. John sprays Marley's poop with a hose, looking for the necklace. The doctor holds a probe to Jenny's stomach and moves a scanner around on gel on Jenny's stomach. A fuzzy picture appears on a screen, but the doctor frowns and removes the scanner, then walks out, leaving the Grogans waiting anxiously in the examination room. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. The doctor returns, smiles reassuringly, and places the scanner on Jenny's stomach. Jenny nods, tight-lipped, and the doctor withdraws with a sympathetic smile of apology. Jenny glances at her husband, who's lost for words as they drive down a palm tree-lined road. John glances at Jenny and gropes to break the silence; without looking at him, she settles back against her headrest and stares out of the window. They drive on down the sunny freeway toward the city. Back home, John opens the front door for his wife.",
    "10": "Jenny takes a gold necklace out of a box, but wagging his tail playfully, Marley gets the necklace. John trips on a chair and the chase is on around the living room. The dog easily outmaneuvers Jenny, but John grabs him and forces open his jaws. John sprays Marley's poop with a hose, looking for the necklace. The doctor holds a probe to Jenny's stomach and moves a scanner around on gel on Jenny's stomach. A fuzzy picture appears on a screen, but the doctor frowns and removes the scanner, then walks out, leaving the Grogans waiting anxiously in the examination room. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. The doctor returns, smiles reassuringly, and places the scanner on Jenny's stomach. Jenny nods, tight-lipped, and the doctor withdraws with a sympathetic smile of apology. Jenny glances at her husband, who's lost for words as they drive down a palm tree-lined road. John glances at Jenny and gropes to break the silence; without looking at him, she settles back against her headrest and stares out of the window. They drive on down the sunny freeway toward the city. Back home, John opens the front door for his wife."
  }
}