{
  "ground_truth": "John walks down the front path of the house with a pool and palm trees at the front, where there's a large new car in the driveway. He unsmilingly bends down and picks the newspapers up off the drive. Holding a baby, he snaps at Marley, who's paws up on the breakfast table and taking an interest in Patrick's food. John frowns at the implication, and the moment's captured on camera. He arrives back home at night, driving his old blue Honda and parks up behind their new people carrier. Gloomily, he glances up, and through a window, sees Jenny holding the baby with Marley bouncing around, playfully. He leans back thoughtfully in the driving seat. Jenny spots him sitting in the car and gestures to him, asking if he's actually going to come indoors. He gets reluctantly out of the car. He sits with a blank expression. Jenny and Patrick sit glumly side by side at the table as John goes and sees to the baby. Marley is next to Patrick, eyeing his food, as she's trying to wrestle a book away from him.",
  "iterations": {
    "1": "John walks down the front path of the house with a pool and palm trees at the front, where there's a large new car in the driveway. He unsmilingly bends down and picks the newspapers up off the drive. Holding a baby, he snaps at Marley, who's paws up on the breakfast table and taking an interest in Patrick's food. John frowns at the implication, and the moment's captured on camera. He arrives back home at night, driving his old blue Honda and parks up behind their new people carrier. Gloomily, he glances up, and through a window, sees Jenny holding the baby with Marley bouncing around, playfully. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. He leans back thoughtfully in the driving seat. Jenny spots him sitting in the car and gestures to him, asking if he's actually going to come indoors. He gets reluctantly out of the car. He sits with a blank expression. Jenny and Patrick sit glumly side by side at the table as John goes and sees to the baby. Marley is next to Patrick, eyeing his food, as she's trying to wrestle a book away from him.",
    "2": "John walks down the front path of the house with a pool and palm trees at the front, where there's a large new car in the driveway. He unsmilingly bends down and picks the newspapers up off the drive. Holding a baby, he snaps at Marley, who's paws up on the breakfast table and taking an interest in Patrick's food. John frowns at the implication, and the moment's captured on camera. He arrives back home at night, driving his old blue Honda and parks up behind their new people carrier. Gloomily, he glances up, and through a window, sees Jenny holding the baby with Marley bouncing around, playfully. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. He leans back thoughtfully in the driving seat. Jenny spots him sitting in the car and gestures to him, asking if he's actually going to come indoors. He gets reluctantly out of the car. He sits with a blank expression. Jenny and Patrick sit glumly side by side at the table as John goes and sees to the baby. Marley is next to Patrick, eyeing his food, as she's trying to wrestle a book away from him.",
    "3": "John walks down the front path of the house with a pool and palm trees at the front, where there's a large new car in the driveway. He unsmilingly bends down and picks the newspapers up off the drive. Holding a baby, he snaps at Marley, who's paws up on the breakfast table and taking an interest in Patrick's food. John frowns at the implication, and the moment's captured on camera. He arrives back home at night, driving his old blue Honda and parks up behind their new people carrier. Gloomily, he glances up, and through a window, sees Jenny holding the baby with Marley bouncing around, playfully. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. He leans back thoughtfully in the driving seat. Jenny spots him sitting in the car and gestures to him, asking if he's actually going to come indoors. He gets reluctantly out of the car. He sits with a blank expression. Jenny and Patrick sit glumly side by side at the table as John goes and sees to the baby. Marley is next to Patrick, eyeing his food, as she's trying to wrestle a book away from him.",
    "4": "John walks down the front path of the house with a pool and palm trees at the front, where there's a large new car in the driveway. He unsmilingly bends down and picks the newspapers up off the drive. Holding a baby, he snaps at Marley, who's paws up on the breakfast table and taking an interest in Patrick's food. John frowns at the implication, and the moment's captured on camera. He arrives back home at night, driving his old blue Honda and parks up behind their new people carrier. Gloomily, he glances up, and through a window, sees Jenny holding the baby with Marley bouncing around, playfully. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. He leans back thoughtfully in the driving seat. Jenny spots him sitting in the car and gestures to him, asking if he's actually going to come indoors. He gets reluctantly out of the car. He sits with a blank expression. Jenny and Patrick sit glumly side by side at the table as John goes and sees to the baby. Marley is next to Patrick, eyeing his food, as she's trying to wrestle a book away from him.",
    "5": "John walks down the front path of the house with a pool and palm trees at the front, where there's a large new car in the driveway. He unsmilingly bends down and picks the newspapers up off the drive. Holding a baby, he snaps at Marley, who's paws up on the breakfast table and taking an interest in Patrick's food. John frowns at the implication, and the moment's captured on camera. He arrives back home at night, driving his old blue Honda and parks up behind their new people carrier. Gloomily, he glances up, and through a window, sees Jenny holding the baby with Marley bouncing around, playfully. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. He leans back thoughtfully in the driving seat. Jenny spots him sitting in the car and gestures to him, asking if he's actually going to come indoors. He gets reluctantly out of the car. He sits with a blank expression. Jenny and Patrick sit glumly side by side at the table as John goes and sees to the baby. Marley is next to Patrick, eyeing his food, as she's trying to wrestle a book away from him.",
    "6": "John walks down the front path of the house with a pool and palm trees at the front, where there's a large new car in the driveway. He unsmilingly bends down and picks the newspapers up off the drive. Holding a baby, he snaps at Marley, who's paws up on the breakfast table and taking an interest in Patrick's food. John frowns at the implication, and the moment's captured on camera. He arrives back home at night, driving his old blue Honda and parks up behind their new people carrier. Gloomily, he glances up, and through a window, sees Jenny holding the baby with Marley bouncing around, playfully. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. He leans back thoughtfully in the driving seat. Jenny spots him sitting in the car and gestures to him, asking if he's actually going to come indoors. He gets reluctantly out of the car. He sits with a blank expression. Jenny and Patrick sit glumly side by side at the table as John goes and sees to the baby. Marley is next to Patrick, eyeing his food, as she's trying to wrestle a book away from him.",
    "7": "John walks down the front path of the house with a pool and palm trees at the front, where there's a large new car in the driveway. He unsmilingly bends down and picks the newspapers up off the drive. Holding a baby, he snaps at Marley, who's paws up on the breakfast table and taking an interest in Patrick's food. John frowns at the implication, and the moment's captured on camera. He arrives back home at night, driving his old blue Honda and parks up behind their new people carrier. Gloomily, he glances up, and through a window, sees Jenny holding the baby with Marley bouncing around, playfully. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. He leans back thoughtfully in the driving seat. Jenny spots him sitting in the car and gestures to him, asking if he's actually going to come indoors. He gets reluctantly out of the car. He sits with a blank expression. Jenny and Patrick sit glumly side by side at the table as John goes and sees to the baby. Marley is next to Patrick, eyeing his food, as she's trying to wrestle a book away from him.",
    "8": "John walks down the front path of the house with a pool and palm trees at the front, where there's a large new car in the driveway. He unsmilingly bends down and picks the newspapers up off the drive. Holding a baby, he snaps at Marley, who's paws up on the breakfast table and taking an interest in Patrick's food. John frowns at the implication, and the moment's captured on camera. He arrives back home at night, driving his old blue Honda and parks up behind their new people carrier. Gloomily, he glances up, and through a window, sees Jenny holding the baby with Marley bouncing around, playfully. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. He leans back thoughtfully in the driving seat. Jenny spots him sitting in the car and gestures to him, asking if he's actually going to come indoors. He gets reluctantly out of the car. He sits with a blank expression. Jenny and Patrick sit glumly side by side at the table as John goes and sees to the baby. Marley is next to Patrick, eyeing his food, as she's trying to wrestle a book away from him.",
    "9": "John walks down the front path of the house with a pool and palm trees at the front, where there's a large new car in the driveway. He unsmilingly bends down and picks the newspapers up off the drive. Holding a baby, he snaps at Marley, who's paws up on the breakfast table and taking an interest in Patrick's food. John frowns at the implication, and the moment's captured on camera. He arrives back home at night, driving his old blue Honda and parks up behind their new people carrier. Gloomily, he glances up, and through a window, sees Jenny holding the baby with Marley bouncing around, playfully. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. He leans back thoughtfully in the driving seat. Jenny spots him sitting in the car and gestures to him, asking if he's actually going to come indoors. He gets reluctantly out of the car. He sits with a blank expression. Jenny and Patrick sit glumly side by side at the table as John goes and sees to the baby. Marley is next to Patrick, eyeing his food, as she's trying to wrestle a book away from him.",
    "10": "John walks down the front path of the house with a pool and palm trees at the front, where there's a large new car in the driveway. He unsmilingly bends down and picks the newspapers up off the drive. Holding a baby, he snaps at Marley, who's paws up on the breakfast table and taking an interest in Patrick's food. John frowns at the implication, and the moment's captured on camera. He arrives back home at night, driving his old blue Honda and parks up behind their new people carrier. Gloomily, he glances up, and through a window, sees Jenny holding the baby with Marley bouncing around, playfully. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. He leans back thoughtfully in the driving seat. Jenny spots him sitting in the car and gestures to him, asking if he's actually going to come indoors. He gets reluctantly out of the car. He sits with a blank expression. Jenny and Patrick sit glumly side by side at the table as John goes and sees to the baby. Marley is next to Patrick, eyeing his food, as she's trying to wrestle a book away from him."
  }
}