{
  "ground_truth": "He looks around the beach at the other owners with their dogs on leashes. He unclips the leash and Marley bounds down to the water. Other owners look at John, and with a smile, the tanned bikini beauty unclips the leash on her pet boxer. Others follow suit and a huge Rottweiler charges into the surf. John grins as the dogs play together in the shallows and more join the fun. An owner throws a Frisbee for his border collie. John grins as the dogs splash around. Bikini girl looks concerned. Marley is circling in the shallows, preparing to poop. Other owners watch in horror. The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley. The big man summons the Rottweiler and a police 4x4 noses onto the beach.",
  "iterations": {
    "1": "He looks around the beach at the other owners with their dogs on leashes. He unclips the leash and Marley bounds down to the water. Other owners look at John, and with a smile, the tanned bikini beauty unclips the leash on her pet boxer. Others follow suit and a huge Rottweiler charges into the surf. John grins as the dogs play together in the shallows and more join the fun. An owner throws a Frisbee for his border collie. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. John grins as the dogs splash around. Bikini girl looks concerned. Marley is circling in the shallows, preparing to poop. Other owners watch in horror. The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley. The big man summons the Rottweiler and a police 4x4 noses onto the beach.",
    "2": "He looks around the beach at the other owners with their dogs on leashes. He unclips the leash and Marley bounds down to the water. Other owners look at John, and with a smile, the tanned bikini beauty unclips the leash on her pet boxer. Others follow suit and a huge Rottweiler charges into the surf. John grins as the dogs play together in the shallows and more join the fun. An owner throws a Frisbee for his border collie. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. John grins as the dogs splash around. Bikini girl looks concerned. Marley is circling in the shallows, preparing to poop. Other owners watch in horror. The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley. The big man summons the Rottweiler and a police 4x4 noses onto the beach.",
    "3": "He looks around the beach at the other owners with their dogs on leashes. He unclips the leash and Marley bounds down to the water. Other owners look at John, and with a smile, the tanned bikini beauty unclips the leash on her pet boxer. Others follow suit and a huge Rottweiler charges into the surf. John grins as the dogs play together in the shallows and more join the fun. An owner throws a Frisbee for his border collie. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. John grins as the dogs splash around. Bikini girl looks concerned. Marley is circling in the shallows, preparing to poop. Other owners watch in horror. The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley. The big man summons the Rottweiler and a police 4x4 noses onto the beach.",
    "4": "He looks around the beach at the other owners with their dogs on leashes. He unclips the leash and Marley bounds down to the water. Other owners look at John, and with a smile, the tanned bikini beauty unclips the leash on her pet boxer. Others follow suit and a huge Rottweiler charges into the surf. John grins as the dogs play together in the shallows and more join the fun. An owner throws a Frisbee for his border collie. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. John grins as the dogs splash around. Bikini girl looks concerned. Marley is circling in the shallows, preparing to poop. Other owners watch in horror. The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley. The big man summons the Rottweiler and a police 4x4 noses onto the beach.",
    "5": "He looks around the beach at the other owners with their dogs on leashes. He unclips the leash and Marley bounds down to the water. Other owners look at John, and with a smile, the tanned bikini beauty unclips the leash on her pet boxer. Others follow suit and a huge Rottweiler charges into the surf. John grins as the dogs play together in the shallows and more join the fun. An owner throws a Frisbee for his border collie. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. John grins as the dogs splash around. Bikini girl looks concerned. Marley is circling in the shallows, preparing to poop. Other owners watch in horror. The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley. The big man summons the Rottweiler and a police 4x4 noses onto the beach.",
    "6": "He looks around the beach at the other owners with their dogs on leashes. He unclips the leash and Marley bounds down to the water. Other owners look at John, and with a smile, the tanned bikini beauty unclips the leash on her pet boxer. Others follow suit and a huge Rottweiler charges into the surf. John grins as the dogs play together in the shallows and more join the fun. An owner throws a Frisbee for his border collie. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. John grins as the dogs splash around. Bikini girl looks concerned. Marley is circling in the shallows, preparing to poop. Other owners watch in horror. The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley. The big man summons the Rottweiler and a police 4x4 noses onto the beach.",
    "7": "He looks around the beach at the other owners with their dogs on leashes. He unclips the leash and Marley bounds down to the water. Other owners look at John, and with a smile, the tanned bikini beauty unclips the leash on her pet boxer. Others follow suit and a huge Rottweiler charges into the surf. John grins as the dogs play together in the shallows and more join the fun. An owner throws a Frisbee for his border collie. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. John grins as the dogs splash around. Bikini girl looks concerned. Marley is circling in the shallows, preparing to poop. Other owners watch in horror. The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley. The big man summons the Rottweiler and a police 4x4 noses onto the beach.",
    "8": "He looks around the beach at the other owners with their dogs on leashes. He unclips the leash and Marley bounds down to the water. Other owners look at John, and with a smile, the tanned bikini beauty unclips the leash on her pet boxer. Others follow suit and a huge Rottweiler charges into the surf. John grins as the dogs play together in the shallows and more join the fun. An owner throws a Frisbee for his border collie. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. John grins as the dogs splash around. Bikini girl looks concerned. Marley is circling in the shallows, preparing to poop. Other owners watch in horror. The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley. The big man summons the Rottweiler and a police 4x4 noses onto the beach.",
    "9": "He looks around the beach at the other owners with their dogs on leashes. He unclips the leash and Marley bounds down to the water. Other owners look at John, and with a smile, the tanned bikini beauty unclips the leash on her pet boxer. Others follow suit and a huge Rottweiler charges into the surf. John grins as the dogs play together in the shallows and more join the fun. An owner throws a Frisbee for his border collie. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. John grins as the dogs splash around. Bikini girl looks concerned. Marley is circling in the shallows, preparing to poop. Other owners watch in horror. The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley. The big man summons the Rottweiler and a police 4x4 noses onto the beach.",
    "10": "He looks around the beach at the other owners with their dogs on leashes. He unclips the leash and Marley bounds down to the water. Other owners look at John, and with a smile, the tanned bikini beauty unclips the leash on her pet boxer. Others follow suit and a huge Rottweiler charges into the surf. John grins as the dogs play together in the shallows and more join the fun. An owner throws a Frisbee for his border collie. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. John grins as the dogs splash around. Bikini girl looks concerned. Marley is circling in the shallows, preparing to poop. Other owners watch in horror. The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley. The big man summons the Rottweiler and a police 4x4 noses onto the beach."
  }
}