{
  "ground_truth": "By its red glow, the mercenaries check their watches en masse. Lewis pulls a hood over his head. The team, including Rambo, make ready. His head covered by a black hat, School Boy stealthily climbs the wooden steps of the camp watch tower. He pulls out a vicious-looking knife with a serrated blade from a sheath. A guard in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance. He walks into the rain-soaked road as the truck approaches the camp. BN is at the wheel, dressed as a soldier. School Boy steals onto the watch tower platform where a lookout sits in a chair, oblivious to his presence. On the tower, School Boy clamps a hand over the guard's mouth and plunges the serrated blade into the soldier. He rests his rifle on the timbers of the watch tower. In the truck, Rambo's eye-line and bandana are reflected in BN's driving mirror.",
  "iterations": {
    "1": "By its red glow, the mercenaries check their watches en masse. Lewis pulls a hood over his head. The team, including Rambo, make ready. His head covered by a black hat, School Boy stealthily climbs the wooden steps of the camp watch tower. He pulls out a vicious-looking knife with a serrated blade from a sheath. A guard in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He walks into the rain-soaked road as the truck approaches the camp. BN is at the wheel, dressed as a soldier. School Boy steals onto the watch tower platform where a lookout sits in a chair, oblivious to his presence. On the tower, School Boy clamps a hand over the guard's mouth and plunges the serrated blade into the soldier. He rests his rifle on the timbers of the watch tower. In the truck, Rambo's eye-line and bandana are reflected in BN's driving mirror.",
    "2": "By its red glow, the mercenaries check their watches en masse. Lewis pulls a hood over his head. The team, including Rambo, make ready. His head covered by a black hat, School Boy stealthily climbs the wooden steps of the camp watch tower. He pulls out a vicious-looking knife with a serrated blade from a sheath. A guard in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He walks into the rain-soaked road as the truck approaches the camp. BN is at the wheel, dressed as a soldier. School Boy steals onto the watch tower platform where a lookout sits in a chair, oblivious to his presence. On the tower, School Boy clamps a hand over the guard's mouth and plunges the serrated blade into the soldier. He rests his rifle on the timbers of the watch tower. In the truck, Rambo's eye-line and bandana are reflected in BN's driving mirror.",
    "3": "By its red glow, the mercenaries check their watches en masse. Lewis pulls a hood over his head. The team, including Rambo, make ready. His head covered by a black hat, School Boy stealthily climbs the wooden steps of the camp watch tower. He pulls out a vicious-looking knife with a serrated blade from a sheath. A guard in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He walks into the rain-soaked road as the truck approaches the camp. BN is at the wheel, dressed as a soldier. School Boy steals onto the watch tower platform where a lookout sits in a chair, oblivious to his presence. On the tower, School Boy clamps a hand over the guard's mouth and plunges the serrated blade into the soldier. He rests his rifle on the timbers of the watch tower. In the truck, Rambo's eye-line and bandana are reflected in BN's driving mirror.",
    "4": "By its red glow, the mercenaries check their watches en masse. Lewis pulls a hood over his head. The team, including Rambo, make ready. His head covered by a black hat, School Boy stealthily climbs the wooden steps of the camp watch tower. He pulls out a vicious-looking knife with a serrated blade from a sheath. A guard in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He walks into the rain-soaked road as the truck approaches the camp. BN is at the wheel, dressed as a soldier. School Boy steals onto the watch tower platform where a lookout sits in a chair, oblivious to his presence. On the tower, School Boy clamps a hand over the guard's mouth and plunges the serrated blade into the soldier. He rests his rifle on the timbers of the watch tower. In the truck, Rambo's eye-line and bandana are reflected in BN's driving mirror.",
    "5": "By its red glow, the mercenaries check their watches en masse. Lewis pulls a hood over his head. The team, including Rambo, make ready. His head covered by a black hat, School Boy stealthily climbs the wooden steps of the camp watch tower. He pulls out a vicious-looking knife with a serrated blade from a sheath. A guard in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He walks into the rain-soaked road as the truck approaches the camp. BN is at the wheel, dressed as a soldier. School Boy steals onto the watch tower platform where a lookout sits in a chair, oblivious to his presence. On the tower, School Boy clamps a hand over the guard's mouth and plunges the serrated blade into the soldier. He rests his rifle on the timbers of the watch tower. In the truck, Rambo's eye-line and bandana are reflected in BN's driving mirror.",
    "6": "By its red glow, the mercenaries check their watches en masse. Lewis pulls a hood over his head. The team, including Rambo, make ready. His head covered by a black hat, School Boy stealthily climbs the wooden steps of the camp watch tower. He pulls out a vicious-looking knife with a serrated blade from a sheath. A guard in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He walks into the rain-soaked road as the truck approaches the camp. BN is at the wheel, dressed as a soldier. School Boy steals onto the watch tower platform where a lookout sits in a chair, oblivious to his presence. On the tower, School Boy clamps a hand over the guard's mouth and plunges the serrated blade into the soldier. He rests his rifle on the timbers of the watch tower. In the truck, Rambo's eye-line and bandana are reflected in BN's driving mirror.",
    "7": "By its red glow, the mercenaries check their watches en masse. Lewis pulls a hood over his head. The team, including Rambo, make ready. His head covered by a black hat, School Boy stealthily climbs the wooden steps of the camp watch tower. He pulls out a vicious-looking knife with a serrated blade from a sheath. A guard in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He walks into the rain-soaked road as the truck approaches the camp. BN is at the wheel, dressed as a soldier. School Boy steals onto the watch tower platform where a lookout sits in a chair, oblivious to his presence. On the tower, School Boy clamps a hand over the guard's mouth and plunges the serrated blade into the soldier. He rests his rifle on the timbers of the watch tower. In the truck, Rambo's eye-line and bandana are reflected in BN's driving mirror.",
    "8": "By its red glow, the mercenaries check their watches en masse. Lewis pulls a hood over his head. The team, including Rambo, make ready. His head covered by a black hat, School Boy stealthily climbs the wooden steps of the camp watch tower. He pulls out a vicious-looking knife with a serrated blade from a sheath. A guard in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He walks into the rain-soaked road as the truck approaches the camp. BN is at the wheel, dressed as a soldier. School Boy steals onto the watch tower platform where a lookout sits in a chair, oblivious to his presence. On the tower, School Boy clamps a hand over the guard's mouth and plunges the serrated blade into the soldier. He rests his rifle on the timbers of the watch tower. In the truck, Rambo's eye-line and bandana are reflected in BN's driving mirror.",
    "9": "By its red glow, the mercenaries check their watches en masse. Lewis pulls a hood over his head. The team, including Rambo, make ready. His head covered by a black hat, School Boy stealthily climbs the wooden steps of the camp watch tower. He pulls out a vicious-looking knife with a serrated blade from a sheath. A guard in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He walks into the rain-soaked road as the truck approaches the camp. BN is at the wheel, dressed as a soldier. School Boy steals onto the watch tower platform where a lookout sits in a chair, oblivious to his presence. On the tower, School Boy clamps a hand over the guard's mouth and plunges the serrated blade into the soldier. He rests his rifle on the timbers of the watch tower. In the truck, Rambo's eye-line and bandana are reflected in BN's driving mirror.",
    "10": "By its red glow, the mercenaries check their watches en masse. Lewis pulls a hood over his head. The team, including Rambo, make ready. His head covered by a black hat, School Boy stealthily climbs the wooden steps of the camp watch tower. He pulls out a vicious-looking knife with a serrated blade from a sheath. A guard in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He walks into the rain-soaked road as the truck approaches the camp. BN is at the wheel, dressed as a soldier. School Boy steals onto the watch tower platform where a lookout sits in a chair, oblivious to his presence. On the tower, School Boy clamps a hand over the guard's mouth and plunges the serrated blade into the soldier. He rests his rifle on the timbers of the watch tower. In the truck, Rambo's eye-line and bandana are reflected in BN's driving mirror."
  }
}