{
  "ground_truth": "The soldier with the dancing girl drags her towards his hut, and she struggles. He slaps her, causing her to fall to the ground, then gestures to the hut and crawls underneath it. Unseen by the soldier, En-Joo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl, and En-Joo dives towards him, plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it, seeing Sarah lying prone in the pig sty. He throws open a wooden bolt, opens a gate, and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious, and Rambo rushes over to the partition between them, pushing pigs out of the way. En-Joo checks his watch—10 seconds to 2. On the watch tower, School Boy has a soldier in the site of his weapon, and his watch shows 2 AM. He fires, starting by picking off the guard below and the guards in two adjacent watch towers.",
  "iterations": {
    "1": "The soldier with the dancing girl drags her towards his hut, and she struggles. He slaps her, causing her to fall to the ground, then gestures to the hut and crawls underneath it. Unseen by the soldier, En-Joo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl, and En-Joo dives towards him, plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it, seeing Sarah lying prone in the pig sty. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He throws open a wooden bolt, opens a gate, and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious, and Rambo rushes over to the partition between them, pushing pigs out of the way. En-Joo checks his watch—10 seconds to 2. On the watch tower, School Boy has a soldier in the site of his weapon, and his watch shows 2 AM. He fires, starting by picking off the guard below and the guards in two adjacent watch towers.",
    "2": "The soldier with the dancing girl drags her towards his hut, and she struggles. He slaps her, causing her to fall to the ground, then gestures to the hut and crawls underneath it. Unseen by the soldier, En-Joo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl, and En-Joo dives towards him, plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it, seeing Sarah lying prone in the pig sty. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He throws open a wooden bolt, opens a gate, and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious, and Rambo rushes over to the partition between them, pushing pigs out of the way. En-Joo checks his watch—10 seconds to 2. On the watch tower, School Boy has a soldier in the site of his weapon, and his watch shows 2 AM. He fires, starting by picking off the guard below and the guards in two adjacent watch towers.",
    "3": "The soldier with the dancing girl drags her towards his hut, and she struggles. He slaps her, causing her to fall to the ground, then gestures to the hut and crawls underneath it. Unseen by the soldier, En-Joo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl, and En-Joo dives towards him, plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it, seeing Sarah lying prone in the pig sty. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He throws open a wooden bolt, opens a gate, and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious, and Rambo rushes over to the partition between them, pushing pigs out of the way. En-Joo checks his watch—10 seconds to 2. On the watch tower, School Boy has a soldier in the site of his weapon, and his watch shows 2 AM. He fires, starting by picking off the guard below and the guards in two adjacent watch towers.",
    "4": "The soldier with the dancing girl drags her towards his hut, and she struggles. He slaps her, causing her to fall to the ground, then gestures to the hut and crawls underneath it. Unseen by the soldier, En-Joo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl, and En-Joo dives towards him, plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it, seeing Sarah lying prone in the pig sty. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He throws open a wooden bolt, opens a gate, and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious, and Rambo rushes over to the partition between them, pushing pigs out of the way. En-Joo checks his watch—10 seconds to 2. On the watch tower, School Boy has a soldier in the site of his weapon, and his watch shows 2 AM. He fires, starting by picking off the guard below and the guards in two adjacent watch towers.",
    "5": "The soldier with the dancing girl drags her towards his hut, and she struggles. He slaps her, causing her to fall to the ground, then gestures to the hut and crawls underneath it. Unseen by the soldier, En-Joo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl, and En-Joo dives towards him, plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it, seeing Sarah lying prone in the pig sty. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He throws open a wooden bolt, opens a gate, and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious, and Rambo rushes over to the partition between them, pushing pigs out of the way. En-Joo checks his watch—10 seconds to 2. On the watch tower, School Boy has a soldier in the site of his weapon, and his watch shows 2 AM. He fires, starting by picking off the guard below and the guards in two adjacent watch towers.",
    "6": "The soldier with the dancing girl drags her towards his hut, and she struggles. He slaps her, causing her to fall to the ground, then gestures to the hut and crawls underneath it. Unseen by the soldier, En-Joo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl, and En-Joo dives towards him, plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it, seeing Sarah lying prone in the pig sty. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He throws open a wooden bolt, opens a gate, and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious, and Rambo rushes over to the partition between them, pushing pigs out of the way. En-Joo checks his watch—10 seconds to 2. On the watch tower, School Boy has a soldier in the site of his weapon, and his watch shows 2 AM. He fires, starting by picking off the guard below and the guards in two adjacent watch towers.",
    "7": "The soldier with the dancing girl drags her towards his hut, and she struggles. He slaps her, causing her to fall to the ground, then gestures to the hut and crawls underneath it. Unseen by the soldier, En-Joo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl, and En-Joo dives towards him, plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it, seeing Sarah lying prone in the pig sty. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He throws open a wooden bolt, opens a gate, and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious, and Rambo rushes over to the partition between them, pushing pigs out of the way. En-Joo checks his watch—10 seconds to 2. On the watch tower, School Boy has a soldier in the site of his weapon, and his watch shows 2 AM. He fires, starting by picking off the guard below and the guards in two adjacent watch towers.",
    "8": "The soldier with the dancing girl drags her towards his hut, and she struggles. He slaps her, causing her to fall to the ground, then gestures to the hut and crawls underneath it. Unseen by the soldier, En-Joo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl, and En-Joo dives towards him, plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it, seeing Sarah lying prone in the pig sty. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He throws open a wooden bolt, opens a gate, and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious, and Rambo rushes over to the partition between them, pushing pigs out of the way. En-Joo checks his watch—10 seconds to 2. On the watch tower, School Boy has a soldier in the site of his weapon, and his watch shows 2 AM. He fires, starting by picking off the guard below and the guards in two adjacent watch towers.",
    "9": "The soldier with the dancing girl drags her towards his hut, and she struggles. He slaps her, causing her to fall to the ground, then gestures to the hut and crawls underneath it. Unseen by the soldier, En-Joo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl, and En-Joo dives towards him, plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it, seeing Sarah lying prone in the pig sty. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He throws open a wooden bolt, opens a gate, and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious, and Rambo rushes over to the partition between them, pushing pigs out of the way. En-Joo checks his watch—10 seconds to 2. On the watch tower, School Boy has a soldier in the site of his weapon, and his watch shows 2 AM. He fires, starting by picking off the guard below and the guards in two adjacent watch towers.",
    "10": "The soldier with the dancing girl drags her towards his hut, and she struggles. He slaps her, causing her to fall to the ground, then gestures to the hut and crawls underneath it. Unseen by the soldier, En-Joo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl, and En-Joo dives towards him, plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it, seeing Sarah lying prone in the pig sty. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He throws open a wooden bolt, opens a gate, and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious, and Rambo rushes over to the partition between them, pushing pigs out of the way. En-Joo checks his watch—10 seconds to 2. On the watch tower, School Boy has a soldier in the site of his weapon, and his watch shows 2 AM. He fires, starting by picking off the guard below and the guards in two adjacent watch towers."
  }
}