{
  "ground_truth": "Gatsby surveys the scene and stands, resting on a cane, as he looks at the clock on the mantelpiece and then at his watch. The clock has a robust, angular dark wood surround. Gatsby paces, undoes a button on his white jacket, and sits, frowning. Nick sits, looking quite relaxed, while Gatsby freezes and breathes tensely. Nick goes to look out of the window as a car comes up the drive, prompting him to hurry outside, holding an umbrella. Grey-faced, Gatsby sits with a newspaper. The driver puts down a rug, and Daisy steps out of the car onto it, wearing blue and gold shoes, a flouncy purple and pale blue dress with frills, and a matching hat. Daisy walks in and checks her immaculately bobbed blonde hair in a mirror, looks into the room full of flowers, and walks into the room amazed while Nick waits in the hall, looking unsure. Nick walks into the room to find Daisy admiring the orchids and, confused, looks to the chair and the window, noticing that the French windows are ajar. Nick smiles at Daisy, who hands him her hat. He goes to the front door and finds Gatsby outside, soaked through. With a steely-eyed, determined look, Gatsby marches into the cottage, stops in the hall to smooth back his hair, and walks into the flower-filled room to stop for a moment and look at Daisy, who turns sharply and sees him. They gaze at each other across the room, with Daisy's chest heaving as she breathes deeply, her eyes appearing glazed, looking entranced. Gatsby steps forward and regards her with an earnest expression as Nick watches from the hall, wide-eyed. Daisy continues to gaze at Gatsby, dewy-eyed, and they both nod slightly. Later, the kettle boils, and Nick carries a tray with a shiny silver tea set into the room. As he pours tea, Daisy sits on a couch while Gatsby stands leaning against the mantelpiece where the wooden clock sits. Nick finishes pouring tea through a strainer, and he and Daisy exchange furtive and nervous looks. Gatsby steels himself, turns to Daisy smiling, but accidentally knocks the clock off the mantelpiece, breaking it. He tries to push the bit that broke off back in place but finally gives up and sits across the coffee table from Daisy, resting his chin on his hand. Nick stands between Gatsby and Daisy, handing them cups of tea, then sits on the couch next to Daisy as they all look rather uncomfortable. Nick stares into space, while Daisy and Gatsby steal the occasional glance at each other. Suddenly, Nick springs to his feet, and on the porch, Gatsby holds up a hand.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Gatsby inspects the setting and stands, leaning on a cane, as he glances at the clock on the mantel and then at his timepiece. The clock possesses a sturdy, angular dark wood surround. Gatsby strides, loosens a button on his white coat, and sits, scowling. Nick sits, appearing quite at ease, while Gatsby stiffens and breathes tensely. Nick proceeds to gaze out of the window as a vehicle arrives up the drive, prompting him to rush outside, carrying an umbrella. Ashen-faced, Gatsby sits with a newspaper. The chauffeur places down a rug, and Daisy steps out of the automobile onto it, wearing blue and gold footwear, a frilly purple and light blue dress with frills, and a matching hat. Daisy strolls in and checks her perfectly bobbed blonde hair in a mirror, looks into the chamber full of blossoms, and steps into the room amazed while Nick waits in the corridor, appearing unsure. Nick walks into the chamber to find Daisy admiring the orchids and, puzzled, looks to the chair and the window, noticing that the French windows are ajar. Nick smiles at Daisy, who hands him her hat. He moves to the front door and finds Gatsby outside, drenched through. With a steely-eyed, resolute look, Gatsby strides into the cottage, pauses in the hall to smooth back his hair, and steps into the flower-filled chamber to pause for a moment and gaze at Daisy, who turns abruptly and sees him. They stare at each other across the room, with Daisy's chest rising as she breathes deeply, her eyes appearing glazed, looking entranced. Gatsby steps forward and regards her with a sincere expression as Nick watches from the corridor, wide-eyed. Daisy continues to stare at Gatsby, misty-eyed, and they both nod slightly. Later, the kettle boils, and Nick carries a tray with a shiny silver tea set into the room. As he pours tea, Daisy sits on a couch while Gatsby stands leaning against the mantel where the wooden clock rests. Nick finishes pouring tea through a strainer, and he and Daisy exchange stealthy and nervous glances. Gatsby fortifies himself, turns to Daisy grinning, but inadvertently knocks the clock off the mantel, breaking it. He attempts to push the piece that snapped off back in place but finally relinquishes and sits across the coffee table from Daisy, resting his chin on his hand. Nick stands between Gatsby and Daisy, handing them cups of tea, then sits on the couch next to Daisy as they all appear quite uncomfortable. Nick gazes into space, while Daisy and Gatsby steal the occasional glance at each other. Abruptly, Nick springs to his feet, and on the porch, Gatsby raises a hand."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The scene is surveyed by Gatsby, and he is stood resting on a cane, as the clock on the mantelpiece is looked at by him and then his watch is checked. A robust, angular dark wood surround is had by the clock. The room is paced by Gatsby, a button on his white jacket is undone by him, and a seat is taken as he frowns. Quite relaxed, Nick is seated, while tense breaths are taken by Gatsby as he freezes. The window is approached by Nick to look out as the drive is approached by a car, prompting him to hurry outside while an umbrella is held. With a grey face, a newspaper is held by Gatsby as he sits. A rug is put down by the driver, and the car is exited by Daisy onto it, wearing blue and gold shoes, a flouncy purple and pale blue dress with frills, and a matching hat. The mirror is checked by Daisy as she walks in, her immaculately bobbed blonde hair is admired, and the room full of flowers is looked into by her as she walks amazed into the room while the hall is waited in by Nick, looking unsure. The room is entered by Nick to find Daisy admiring the orchids, and he looks, confused, to the chair and the window, noticing the French windows are ajar. A smile is shown by Nick to Daisy, who gives him her hat. The front door is approached by him, finding Gatsby outside, soaked through. With a steely-eyed, determined look, the cottage is marched into by Gatsby, who stops in the hall to smooth back his hair, and the flower-filled room is walked into by him to stop for a moment and look at Daisy, who sharply turns and sees him. Each other is gazed at across the room by them, with Daisy's chest heaving deeply as breaths are taken by her, her eyes glazed, appearing entranced. Forward steps Gatsby and regards her with an earnest expression as he is watched from the hall, wide-eyed, by Nick. The gaze is continued by Daisy at Gatsby, dewy-eyed, and a slight nod is shared by both. Later, the kettle is boiled, and a tray with a shiny silver tea set is carried into the room by Nick. As tea is poured by him, the couch is sat on by Daisy while the mantelpiece is leaned against by Gatsby where the wooden clock sits. The pouring of tea is finished by Nick through a strainer, and furtive, nervous looks are exchanged by him and Daisy. Determination is steeled by Gatsby, who turns to Daisy smiling but accidentally knocks off the clock from the mantelpiece, breaking it. An attempt is made by him to push the bit that broke off back in place, but giving up finally, he sits across the coffee table from Daisy, resting his chin on his hand. Between Gatsby and Daisy stands Nick, handing them cups of tea, then the couch next to Daisy is sat on by him as they all look rather uncomfortable. Space is stared into by Nick, while occasional glances are stolen by Daisy and Gatsby at each other. Suddenly, to his feet springs Nick, and on the porch, a hand is held up by Gatsby."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Gatsby surveys the scene, resting on a cane, glancing at the clock on the mantelpiece and his watch. The clock has a robust, angular dark wood surround. Gatsby paces, unbuttons his white jacket, and sits, frowning. Nick sits relaxed, as Gatsby freezes, breathing tensely. Nick looks out the window as a car arrives, prompting him to hurry outside with an umbrella. Grey-faced, Gatsby sits with a newspaper. The driver lays a rug, and Daisy steps out in blue and gold shoes, a frilly purple and pale blue dress, and a matching hat. Daisy checks her immaculately bobbed blonde hair in a mirror, enters the flower-filled room amazed, while Nick waits in the hall, unsure. Nick finds Daisy admiring orchids, confused, noticing the ajar French windows. Nick smiles at Daisy, who gives him her hat. He finds Gatsby outside, soaked. With determination, Gatsby enters, smooths back his hair, and stops to gaze at Daisy. They lock eyes, Daisy breathes deeply, appearing glazed. Gatsby steps forward with an earnest expression, as Nick watches wide-eyed. Daisy, dewy-eyed, nods slightly. Later, Nick carries a tray with a shiny silver tea set, pours tea, while Gatsby leans against the mantelpiece. Nick and Daisy exchange nervous looks. Gatsby smiles, accidentally knocks the clock off, breaking it, then gives up and sits across from Daisy. Nick stands between them, handing tea, then sits next to Daisy. They feel uncomfortable, exchanging occasional glances. Suddenly, Nick springs to his feet, and on the porch, Gatsby raises a hand."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Gatsby surveys the scene, resting on a cane, glancing at a robust, angular dark wood clock and his watch. He paces, undoes a button on his white jacket, and sits, frowning. Nick sits relaxed, as Gatsby freezes tense. Nick looks out the window at an approaching car, then hurries outside with an umbrella. Grey-faced, Gatsby sits with a newspaper. The driver places a rug for Daisy, who steps out wearing blue-gold shoes, a purple-blue dress with frills, and a matching hat. Inside, Daisy checks her bobbed blonde hair, gazes at the flower-filled room, and Nick appears unsure. Daisy admires orchids; Nick notices the ajar French windows, smiles at Daisy, and receives her hat. He finds Gatsby outside, soaked, who resolutely enters the cottage, smooths his hair in the hall, and stops to gaze at Daisy. They exchange deep looks across the room, Daisy breathes deeply and entranced, as Gatsby approaches earnestly, with Nick watching wide-eyed. Daisy continues dewy-eyed nodding. Later, Nick brings tea, and Daisy sits while Gatsby leans against the mantelpiece. Nick pours tea; Daisy and Gatsby exchange nervous looks. Gatsby smiles at Daisy, accidentally breaking the clock on the mantelpiece, then sits across from her. Nick distributes tea cups, then sits with Daisy; all appear uncomfortable, stealing occasional glances. Suddenly, Nick stands, and outside, Gatsby holds up a hand."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Gatsby, with a watchful eye, meticulously surveys the entire scene before him. He stands firmly, leaning on a cane for support, as he moves his gaze from the clock perched atop the mantelpiece to his own wristwatch. The clock is seen to have a robust and angular dark wood surround, adding an air of solidity to the room. Gatsby, feeling restless, begins to pace back and forth, undoing a button on his crisp white jacket before he finally sits down, his expression clouded with a deep frown. Meanwhile, Nick, seated nearby, appears to be quite relaxed and at ease. As Gatsby comes to an abrupt halt, his breathing becomes tense, and he seems frozen in place. Nick, sensing the moment, approaches the window to glance out as a car slowly makes its way up the driveway, prompting him to quickly head outside, dutifully holding an umbrella. \n\nInside, Gatsby, looking grey-faced, is seated holding a newspaper. The driver, having stopped the car, places a rug down on the ground, and Daisy gracefully steps out, her feet adorned in elegant blue and gold shoes. She wears a flouncy dress of purple and pale blue, adorned with frills, and a matching hat completes her ensemble. Once inside, Daisy checks her impeccably bobbed blonde hair in a nearby mirror before casting her gaze over the room, electrified by the abundance of flowers. She walks into the room in a state of amazement while Nick remains in the hallway, wearing an expression of uncertainty. As Nick ventures into the room, he finds Daisy admiring the breathtaking orchids, confusion momentarily clouding his face. He glances from the chair to the window, noticing the French windows are ajar. Nick smiles warmly at Daisy, who in turn hands him her hat with a soft gesture. He then makes his way to the front door, only to find Gatsby outside, thoroughly soaked through by the rain.\n\nWith a steely-eyed and determined look upon his face, Gatsby makes his way into the cottage, pausing in the hallway to smooth back his damp hair. He enters the room filled with flowers and comes to a standstill for a moment, taking in Daisy's presence. As she sharply turns to see him, their eyes lock across the vast expanse of the room. Daisy's chest rises and falls with her deep breaths, her eyes conveying a glazed, entranced look. Gatsby steps forward, regarding her with an earnest expression, while Nick watches on from the hallway, his eyes wide with anticipation. Daisy, still gazing at Gatsby, appears dewy-eyed as they both nod ever so slightly toward each other. \n\nIn the moments that follow, the kettle begins to boil, and Nick, ever the gracious host, carries a tray with a gleaming silver tea set into the room. As he pours the tea, Daisy takes her place on the couch while Gatsby remains standing, leaning gracefully against the mantelpiece where the wooden clock still resides. Nick, completing the task of pouring tea through a strainer, catches furtive, nervous glances exchanged between himself and Daisy. Gatsby, bracing himself, turns to Daisy with a smile, but in doing so, he inadvertently knocks the clock off the mantelpiece, breaking it in the process. He attempts to push the dislodged piece back into place but ultimately resigns himself to the futility of the effort and sits down across the coffee table from Daisy, resting his chin thoughtfully on his hand. \n\nNick stands poised between Gatsby and Daisy, handing them cups of tea before taking a seat on the couch next to Daisy. Together, they all sit, looking somewhat uncomfortable, each casting absent glances around the room. Nick stares off into the distance, while Daisy and Gatsby steal occasional, lingering looks at each other. Without warning, Nick springs up to his feet, and out on the porch, Gatsby raises a hand, marking a silent gesture."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Gatsby, with an observant and watchful eye, meticulously surveys the entire scene unfolding before him. He stands firmly rooted to the spot, leaning heavily on a sturdy cane for support, as his gaze shifts with deliberation from the clock perched atop the grand mantelpiece to his own wristwatch. The clock, encased in a robust and angular surround of dark, richly polished wood, brings an air of solidity and gravitas to the room. Feeling restless and fidgety, Gatsby begins to pace steadily back and forth, his mind clearly racing. In doing so, he undoes a button on his crisp, immaculate white jacket before he finally sits down, his expression clouded with a deep and contemplative frown. Meanwhile, Nick, who is seated nearby, appears to be quite relaxed and at ease, as though unaffected by the tension in the room. As Gatsby comes to an abrupt halt, his breathing becomes tense and deliberate, and he seems momentarily frozen in place. Sensing the significance of the moment, Nick approaches the window with a sense of purpose, glancing out just as a car slowly makes its way up the long driveway. This prompts him to quickly head outside, dutifully holding an umbrella in preparation for the weather. \n\nInside the room, Gatsby, looking somewhat grey-faced and anxious, is seated with a newspaper held in his hands. The driver, having brought the car to a stop, respectfully places a rug down on the ground, allowing Daisy to step out gracefully. Her feet are adorned in elegant blue and gold shoes that catch the light. She is wearing an exquisite, flouncy dress of rich purple and pale blue, adorned with delicate frills, and a matching hat that completes her ensemble with flair. Once inside, Daisy takes a moment to check her impeccably bobbed blonde hair in a nearby mirror before casting her gaze over the room, which is electrified by the abundance and vibrancy of flowers. She walks into the room in a state of amazement and wonder while Nick remains in the hallway, wearing an expression of uncertainty and anticipation. As Nick eventually ventures into the room, he finds Daisy admiring the breathtaking display of orchids, a momentary cloud of confusion crossing his face. He glances from the chair to the window, noticing that the French windows are slightly ajar. Nick then smiles warmly at Daisy, who, in turn, hands him her hat with a soft and gentle gesture. He then makes his way to the front door, only to find Gatsby outside, thoroughly soaked through by the relentless rain.\n\nWith a steely-eyed determination and a resolute look upon his face, Gatsby makes his way back into the cottage. He pauses momentarily in the hallway to smooth back his damp hair, reassessing his appearance. Entering the room filled with flowers, he comes to a standstill, taking a moment to fully appreciate Daisy's presence. As she sharply turns to see him, their eyes lock with a profound intensity across the vast expanse of the room. Daisy's chest rises and falls with her deep breaths, her eyes conveying a glazed and entranced look. Gatsby steps forward with purpose, regarding her with an earnest and heartfelt expression, while Nick watches on from the hallway, his eyes wide with anticipation and intrigue. Daisy, still intently gazing at Gatsby, appears dewy-eyed as they both nod ever so slightly toward each other, a silent understanding passing between them. \n\nIn the moments that follow, the kettle begins to whistle, announcing its readiness, and Nick, ever the gracious host, carries a tray with a gleaming silver tea set into the room. As he carefully pours the tea, Daisy takes her place on the couch, settling herself into the soft cushions, while Gatsby remains standing, leaning gracefully against the mantelpiece where the ornate wooden clock still resides. Nick, completing the task of pouring tea through a fine strainer, catches furtive, nervous glances exchanged between himself and Daisy. Gatsby, gathering his courage, turns to Daisy with a charming smile, but in doing so, he inadvertently knocks the clock off the mantelpiece, breaking it in the unfortunate process. He attempts to push the dislodged piece back into place, but ultimately resigns himself to the futility of the effort and sits down across the coffee table from Daisy, resting his chin thoughtfully on his hand, lost in contemplation. \n\nNick stands poised between Gatsby and Daisy, courteously handing them cups of tea before taking a seat on the couch next to Daisy. Together, they all sit in a slightly awkward manner, each casting absent glances around the elegantly decorated room. Nick stares off into the distance, lost in his own thoughts, while Daisy and Gatsby steal occasional, lingering looks at each other, the air between them thick with unspoken words. Without any warning, Nick springs up to his feet with a sense of urgency, and out on the porch, Gatsby raises a hand, marking a silent gesture of significance."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Gatsby stands surveying the scene, leaning slightly on his cane for support, casting a thoughtful gaze first at the clock adorning the mantelpiece and then at his own watch, as if trying to synchronize the passing moments of time. The clock is encased in a robust, angular frame of dark wood that commands attention. Gatsby begins to pace back and forth with a restless energy, pausing momentarily to undo a button on his crisp white jacket before lowering himself into a chair, a frown creasing his forehead as he contemplates something unseen. Meanwhile, Nick sits nearby, his demeanor relaxed and unhurried, in stark contrast to Gatsby's sudden freezing and tense breathing. Nick gets up and wanders over to the window, his curiosity piqued as a car approaches up the drive, prompting him to quickly step outside, grasping an umbrella to shield against the elements. Inside, Gatsby, looking rather grey-faced, occupies himself with a newspaper, trying to maintain a semblance of normalcy. Outside, the driver carefully lays down a rug on the ground, providing a graceful exit for Daisy as she steps out of the car. She is adorned in blue and gold shoes that complement her attire—a flouncy purple and pale blue dress embellished with frills and paired with a matching hat. Daisy makes her entrance, pausing before a mirror to ensure her immaculately bobbed blonde hair remains in place, then casts her gaze over the flower-filled room, walking in with a sense of amazement. Nick stands in the hall, a hint of uncertainty clouding his expression as he observes her entrance. Following Daisy into the room, Nick finds her captivated by the orchids, and, somewhat perplexed, he glances first at an empty chair and then towards the window, noting that the French windows are slightly ajar. As Daisy hands Nick her hat, he greets her with a smile and heads to the front door, discovering Gatsby outside, drenched to the bone. Gatsby, with a steely-eyed determination, marches back into the cottage, pausing in the hall to smooth back his hair before confidently entering the flower-filled room, where he stops to take in Daisy's presence. Daisy turns sharply, drawn by an instinctive awareness of Gatsby's arrival, and they lock eyes across the room. An electric moment hangs between them as Daisy breathes deeply, her chest rising and falling, her eyes glazed with entrancement. Gatsby moves a step closer, his expression one of earnestness, while from the hall, Nick watches, his eyes wide with the unfolding drama. Daisy continues to look at Gatsby, her eyes dewy and filled with unspoken emotions as they both nod slightly in mutual acknowledgment. Later, as the kettle boils, Nick meticulously carries a tray laden with a gleaming silver tea set into the room, assuming the role of host. As he pours tea through a strainer with careful precision, Daisy reclines on a couch while Gatsby stands nearby, leaning against the mantelpiece where the wooden clock rests. Finishing the task, Nick exchanges furtive and nervous glances with Daisy as Gatsby gathers his courage, turning towards her with a smile just as he accidentally knocks the clock from the mantelpiece. The clock falls, breaking upon impact, and Gatsby, flustered, attempts to piece it back together but eventually concedes defeat, retreating to sit across the coffee table from Daisy, chin resting pensively on his hand. Nick positions himself between them, offering cups of tea, before joining Daisy on the couch, the three of them enveloped in a cloud of discomfort. Nick loses himself in thought, staring into space, as Daisy and Gatsby shyly exchange glances. In a burst of movement, Nick suddenly springs to his feet, stepping out onto the porch, where Gatsby raises a hand in a gesture that holds unspecified meaning."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Gatsby stands restlessly, using a cane for support, and checks the time on both the mantelpiece clock and his watch. After pacing and undoing a button on his jacket, he sits with a frown. Meanwhile, Nick, appearing relaxed, looks out the window as a car arrives, prompting him to grab an umbrella and head outside. Gatsby, looking pale, remains inside with a newspaper. Daisy steps out of the car onto a rug laid by the driver, dressed in a vibrant outfit with matching accessories. Upon entering, she checks her hair in a mirror and is amazed by the room filled with flowers, as Nick waits hesitantly in the hall. Daisy admires the orchids while Nick, confused, notices the French windows. Acknowledging Daisy with a smile, he takes her hat and finds Gatsby outside, drenched. With determination, Gatsby enters the house, tidies his hair in the hall, and proceeds to the room where he and Daisy share an intense, entranced gaze across the room. Nick observes quietly from the hall, while Daisy and Gatsby acknowledge each other with a nod. As time passes, Nick serves tea on a silver set, with Daisy seated on the couch and Gatsby leaning against the mantelpiece. Amid pouring tea, Gatsby accidentally breaks the clock, attempting to repair it in vain before sitting opposite Daisy. Nick joins them, handing out tea, and the trio exchanges nervous glances. Nick eventually stands, while on the porch, Gatsby raises a hand."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Gatsby, known for his lavish parties at his Long Island mansion, surveys the scene and stands, resting on a cane acquired after a minor horse-riding accident, as he looks at the antique clock on the mantelpiece and then at his watch, a gift from a war comrade. The clock has a robust, angular dark wood surround, reminiscent of the Art Deco style popular in the 1920s. Gatsby paces, undoes a button on his white jacket tailored by a renowned New York designer, and sits, frowning. Nick, who recently moved to West Egg, sits, looking quite relaxed, while Gatsby freezes and breathes tensely. Nick, always observant of the surroundings, goes to look out of the window as a car comes up the drive, prompting him to hurry outside, holding an umbrella to shield himself from the sudden downpour. Grey-faced, Gatsby sits with a newspaper featuring headlines about the economic boom of the Roaring Twenties. The driver, trained by the prestigious Parker Chauffeur Service, puts down a rug, and Daisy steps out of the car onto it, wearing blue and gold shoes crafted by a Parisian shoemaker, a flouncy purple and pale blue dress with frills, and a matching hat that was all the rage in fashion magazines. Daisy walks in and checks her immaculately bobbed blonde hair, which she styled after the famous actress Louise Brooks, in a mirror, looks into the room full of flowers arranged by a local florist renowned for his creative displays, and walks into the room amazed while Nick waits in the hall, looking unsure. Nick walks into the room to find Daisy admiring the orchids imported from a tropical greenhouse, and, confused, looks to the chair and the window, noticing that the French windows, often left open for ventilation, are ajar. Nick smiles at Daisy, who hands him her hat, made by a milliner in Paris. He goes to the front door and finds Gatsby outside, soaked through by the relentless rain. With a steely-eyed, determined look, Gatsby marches into the cottage, stops in the hall to smooth back his hair, styled in the popular slicked-back fashion of the day, and walks into the flower-filled room to stop for a moment and look at Daisy, who turns sharply and sees him. They gaze at each other across the room with Daisy's chest heaving as she breathes deeply, her eyes appearing glazed, looking entranced. Gatsby steps forward and regards her with an earnest expression as Nick, who has become something of an intermediary between them, watches from the hall, wide-eyed. Daisy continues to gaze at Gatsby, dewy-eyed, and they both nod slightly. Later, the kettle, a polished metal piece typical of the era, boils, and Nick carries a tray with a shiny silver tea set that had been brought from England into the room. As he pours tea, Daisy sits on a couch, an elegant piece by a well-known furniture designer, while Gatsby stands leaning against the mantelpiece where the wooden clock sits. Nick finishes pouring tea through a strainer, a detail reflecting the British influence on American tea-drinking habits, and he and Daisy exchange furtive and nervous looks. Gatsby steels himself, turns to Daisy smiling, but accidentally knocks the clock off the mantelpiece, breaking it, a symbolic moment reflecting the fragility of time and their past. He tries to push the bit that broke off back in place but finally gives up and sits across the coffee table, an exquisite piece from a famous craftsman, from Daisy, resting his chin on his hand. Nick stands between Gatsby and Daisy, handing them cups of tea, then sits on the couch next to Daisy as they all look rather uncomfortable. Nick stares into space, pondering the complex emotions in the room, while Daisy and Gatsby steal the occasional glance at each other. Suddenly, Nick springs to his feet, and on the porch, Gatsby holds up a hand as if to call him back."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Nick goes to look out of the window as a car comes up the drive prompting him to hurry outside holding an umbrella Nick stands between Gatsby and Daisy handing them cups of tea then sits on the couch next to Daisy as they all look rather uncomfortable Gatsby surveys the scene and stands resting on a cane as he looks at the clock on the mantelpiece and then at his watch Nick sits looking quite relaxed while Gatsby freezes and breathes tensely The clock has a robust angular dark wood surround Gatsby paces undoes a button on his white jacket and sits frowning Nick sits looking quite relaxed while Gatsby freezes and breathes tensely Gatsby surveys the scene and stands resting on a cane as he looks at the clock on the mantelpiece and then at his watch Nick walks into the room to find Daisy admiring the orchids and confused looks to the chair and the window noticing that the French windows are ajar Nick goes to look out of the window as a car comes up the drive prompting him to hurry outside holding an umbrella Greyfaced Gatsby sits with a newspaper The driver puts down a rug and Daisy steps out of the car onto it wearing blue and gold shoes a flouncy purple and pale blue dress with frills and a matching hat Suddenly Nick springs to his feet and on the porch Daisy walks in and checks her immaculately bobbed blonde hair in a mirror looks into the room full of flowers and walks into the room amazed while Nick waits in the hall looking unsure Nick smiles at Daisy who hands him her hat Nick walks into the room to find Daisy admiring the orchids and confused looks to the chair and the window noticing that the French windows are ajar Nick smiles at Daisy who hands him her hat Nick stares into space while Daisy and Gatsby steal the occasional glance at each other He goes to the front door and finds Gatsby outside soaked through With a steelyeyed determined look Gatsby marches into the cottage stops in the hall to smooth back his hair and walks into the flowerfilled room to stop for a moment and look at Daisy who turns sharply and sees him Daisy walks in and checks her immaculately bobbed blonde hair in a mirror looks into the room full of flowers and walks into the room amazed while Nick waits in the hall looking unsure They gaze at each other across the room with Daisy's chest heaving as she breathes deeply her eyes appearing glazed looking entranced Gatsby steps forward and regards her with an earnest expression as Nick watches from the hall wideeyed He tries to push the bit that broke off back in place but finally gives up and sits across the coffee table from Daisy resting his chin on his hand Daisy continues to gaze at Gatsby dewyeyed and they both nod slightly Later the kettle boils and Nick carries a tray with a shiny silver tea set into the room As he pours tea Daisy sits on a couch while Gatsby stands leaning against the mantelpiece where the wooden clock sits Nick finishes pouring tea through a strainer and he and Daisy exchange furtive and nervous looks Gatsby paces undoes a button on his white jacket and sits frowning The driver puts down a rug and Daisy steps out of the car onto it wearing blue and gold shoes a flouncy purple and pale blue dress with frills and a matching hat Gatsby steels himself turns to Daisy smiling but accidentally knocks the clock off the mantelpiece breaking it He tries to push the bit that broke off back in place but finally gives up and sits across the coffee table from Daisy resting his chin on his hand Nick stands between Gatsby and Daisy handing them cups of tea then sits on the couch next to Daisy as they all look rather uncomfortable Nick stares into space while Daisy and Gatsby steal the occasional glance at each other Suddenly Nick springs to his feet and on the porch Gatsby holds up a hand"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Gatsby surveys the scene and stands resting on a cane as he looks at the clock on the mantelpiece and then at his watch. The clock has a robust angular dark wood surround. Gatsby paces undoes a button on his white jacket and sits frowning. Nick sits looking quite relaxed while Gatsby freezes and breathes tensely. Nick goes to look out of the window as a car comes up the drive prompting him to hurry outside holding an umbrella. Greyfaced Gatsby sits with a newspaper. The driver puts down a rug and Daisy steps out of the car onto it wearing blue and gold shoes a flouncy purple and pale blue dress with frills and a matching hat. Daisy walks in and checks her immaculately bobbed blonde hair in a mirror looks into the room full of flowers and walks into the room amazed while Nick waits in the hall looking unsure. Nick walks into the room to find Daisy admiring the orchids and confused looks to the chair and the window noticing that the French windows are ajar. Nick smiles at Daisy who hands him her hat. He goes to the front door and finds Gatsby outside soaked through. With a steelyeyed determined look Gatsby marches into the cottage stops in the hall to smooth back his hair and walks into the flowerfilled room to stop for a moment and look at Daisy who turns sharply and sees him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. They gaze at each other across the room with Daisy's chest heaving as she breathes deeply her eyes appearing glazed looking entranced. Gatsby steps forward and regards her with an earnest expression as Nick watches from the hall wideeyed. Daisy continues to gaze at Gatsby dewyeyed and they both nod slightly. Later the kettle boils and Nick carries a tray with a shiny silver tea set into the room. As he pours tea Daisy sits on a couch while Gatsby stands leaning against the mantelpiece where the wooden clock sits. Nick finishes pouring tea through a strainer and he and Daisy exchange furtive and nervous looks. Gatsby steels himself turns to Daisy smiling but accidentally knocks the clock off the mantelpiece breaking it. He tries to push the bit that broke off back in place but finally gives up and sits across the coffee table from Daisy resting his chin on his hand. Nick stands between Gatsby and Daisy handing them cups of tea then sits on the couch next to Daisy as they all look rather uncomfortable. Nick stares into space while Daisy and Gatsby steal the occasional glance at each other. Suddenly Nick springs to his feet and on the porch. Gatsby holds up a hand."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Gatsby surveys the scene and stands resting on a cane as he looks at the clock on the mantelpiece and then at his watch. The clock has a robust angular dark wood surround. Gatsby paces undoes a button on his white jacket and sits frowning. Nick sits looking quite relaxed while Gatsby freezes and breathes tensely. Nick goes to look out of the window as a car comes up the drive prompting him to hurry outside holding an umbrella. Greyfaced Gatsby sits with a newspaper. The driver puts down a rug and Daisy steps out of the car onto it wearing blue and gold shoes a flouncy purple and pale blue dress with frills and a matching hat. Daisy walks in and checks her immaculately bobbed blonde hair in a mirror looks into the room full of flowers and walks into the room amazed while Nick waits in the hall looking unsure. Nick walks into the room to find Daisy admiring the orchids and confused looks to the chair and the window noticing that the French windows are ajar. Nick smiles at Daisy who hands him her hat. He goes to the front door and finds Gatsby outside soaked through. With a steelyeyed determined look Gatsby marches into the cottage stops in the hall to smooth back his hair and walks into the flowerfilled room to stop for a moment and look at Daisy who turns sharply and sees him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. They gaze at each other across the room with Daisy's chest heaving as she breathes deeply her eyes appearing glazed looking entranced. Gatsby steps forward and regards her with an earnest expression as Nick watches from the hall wideeyed. Daisy continues to gaze at Gatsby dewyeyed and they both nod slightly. Later the kettle boils and Nick carries a tray with a shiny silver tea set into the room. As he pours tea Daisy sits on a couch while Gatsby stands leaning against the mantelpiece where the wooden clock sits. Nick finishes pouring tea through a strainer and he and Daisy exchange furtive and nervous looks. Gatsby steels himself turns to Daisy smiling but accidentally knocks the clock off the mantelpiece breaking it. He tries to push the bit that broke off back in place but finally gives up and sits across the coffee table from Daisy resting his chin on his hand. Nick stands between Gatsby and Daisy handing them cups of tea then sits on the couch next to Daisy as they all look rather uncomfortable. Nick stares into space while Daisy and Gatsby steal the occasional glance at each other. Suddenly Nick springs to his feet and on the porch. Gatsby holds up a hand."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Gatsby surveys the scene and stands resting on a cane as he looks at the clock on the mantelpiece and then at his watch. The clock has a robust angular dark wood surround. Gatsby paces undoes a button on his white jacket and sits frowning. Nick sits looking quite relaxed while Gatsby freezes and breathes tensely. Nick goes to look out of the window as a car comes up the drive prompting him to hurry outside holding an umbrella. Greyfaced Gatsby sits with a newspaper. Gatsby steels himself turns to Daisy smiling but accidentally knocks the clock off the mantelpiece breaking it. He tries to push the bit that broke off back in place but finally gives up and sits across the coffee table from Daisy resting his chin on his hand. Nick stands between Gatsby and Daisy handing them cups of tea then sits on the couch next to Daisy as they all look rather uncomfortable. Nick stares into space while Daisy and Gatsby steal the occasional glance at each other. Suddenly Nick springs to his feet and on the porch. Gatsby holds up a hand."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Gatsby surveys the scene and stands resting on a cane as he looks at the clock on the mantelpiece and then at his watch. The clock has a robust angular dark wood surround. Gatsby paces undoes a button on his white jacket and sits frowning. Suddenly Nick springs to his feet and on the porch. Gatsby holds up a hand."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The squirrel surveys the scene and stands, resting on a cane, as it looks at the clock on the mantelpiece and then at its watch. The clock has a robust, angular dark wood surround. The squirrel paces, undoes a button on its white jacket, and sits, frowning. The parrot sits, looking quite relaxed, while the squirrel freezes and breathes tensely. The parrot goes to look out of the window as a car comes up the drive, prompting it to hurry outside, holding an umbrella. Grey-faced, the squirrel sits with a newspaper. The rabbit puts down a rug, and the dolphin steps out of the car onto it, wearing blue and gold shoes, a flouncy purple and pale blue dress with frills, and a matching hat. The dolphin walks in and checks its immaculately bobbed blonde hair in a mirror, looks into the room full of flowers, and walks into the room amazed while the parrot waits in the hall, looking unsure. The parrot walks into the room to find the dolphin admiring the orchids and, confused, looks to the chair and the window, noticing that the French windows are ajar. The parrot smiles at the dolphin, who hands it the hat. It goes to the front door and finds the squirrel outside, soaked through. With a steely-eyed, determined look, the squirrel marches into the cottage, stops in the hall to smooth back its hair, and walks into the flower-filled room to stop for a moment and look at the dolphin, who turns sharply and sees it. They gaze at each other across the room, with the dolphin's chest heaving as it breathes deeply, its eyes appearing glazed, looking entranced. The squirrel steps forward and regards it with an earnest expression as the parrot watches from the hall, wide-eyed. The dolphin continues to gaze at the squirrel, dewy-eyed, and they both nod slightly. Later, the kettle boils, and the parrot carries a tray with a shiny silver tea set into the room. As it pours tea, the dolphin sits on a couch while the squirrel stands leaning against the mantelpiece where the wooden clock sits. The parrot finishes pouring tea through a strainer, and it and the dolphin exchange furtive and nervous looks. The squirrel steels itself, turns to the dolphin smiling, but accidentally knocks the clock off the mantelpiece, breaking it. It tries to push the bit that broke off back in place but finally gives up and sits across the coffee table from the dolphin, resting its chin on its hand. The parrot stands between the squirrel and the dolphin, handing them cups of tea, then sits on the couch next to the dolphin as they all look rather uncomfortable. The parrot stares into space, while the dolphin and the squirrel steal the occasional glance at each other. Suddenly, the parrot springs to its feet, and on the porch, the squirrel holds up a hand."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Gatsby surveys the scene and stands, resting on a crutch, as he looks at the vase on the bookshelf and then at his bracelet. The vase has a sleek, curved light metal surround. Gatsby paces, undoes a button on his beige coat, and sits, frowning. Nick sits, looking quite relaxed, while Gatsby freezes and breathes tensely. Nick goes to look out of the window as a bicycle comes up the path, prompting him to hurry outside, holding a lantern. Grey-faced, Gatsby sits with a magazine. The rider puts down a blanket, and Daisy steps out of the bicycle onto it, wearing red and silver sandals, a frilly green and pale yellow dress with ruffles, and a matching scarf. Daisy walks in and checks her immaculately bobbed brown hair in a picture frame, looks into the room full of statues, and walks into the room amazed while Nick waits in the corridor, looking unsure. Nick walks into the room to find Daisy admiring the daisies and, confused, looks to the couch and the door, noticing that the sliding doors are ajar. Nick smiles at Daisy, who hands him her scarf. He goes to the back door and finds Gatsby outside, drenched. With a steely-eyed, determined look, Gatsby marches into the cabin, stops in the corridor to smooth back his hair, and walks into the statue-filled room to stop for a moment and look at Daisy, who turns sharply and sees him. They gaze at each other across the room, with Daisy's chest heaving as she breathes deeply, her eyes appearing glazed, looking entranced. Gatsby steps forward and regards her with an earnest expression as Nick watches from the corridor, wide-eyed. Daisy continues to gaze at Gatsby, dewy-eyed, and they both nod slightly. Later, the coffee machine whirs, and Nick carries a tray with a shiny silver coffee set into the room. As he pours coffee, Daisy sits on a stool while Gatsby stands leaning against the bookshelf where the metal vase sits. Nick finishes pouring coffee through a dripper, and he and Daisy exchange furtive and nervous looks. Gatsby steels himself, turns to Daisy smiling, but accidentally knocks the vase off the bookshelf, breaking it. He tries to push the piece that broke off back in place but finally gives up and sits across the side table from Daisy, resting his chin on his hand. Nick stands between Gatsby and Daisy, handing them cups of coffee, then sits on the stool next to Daisy as they all look rather uncomfortable. Nick stares into space, while Daisy and Gatsby steal the occasional glance at each other. Suddenly, Nick springs to his feet, and on the porch, Gatsby holds up a flag."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Gatsby inspects the scene and leans, clutching a cane, as he peers at the clock on the mantelpiece and then at his watch. The clock has a robust, angular dark wood surround. Gatsby shuffles, adjusts a button on his white jacket, and reclines, scowling. Nick reclines, looking quite relaxed, while Gatsby stiffens and inhales tensely. Nick moves to peer out of the window as a car approaches the drive, prompting him to rush outside, grasping an umbrella. Grey-faced, Gatsby reclines with a newspaper. The driver places down a rug, and Daisy emerges from the car onto it, wearing blue and gold shoes, a flouncy purple and pale blue dress with frills, and a matching hat. Daisy strolls in and arranges her immaculately bobbed blonde hair in a mirror, glances into the room full of flowers, and strolls into the room astonished while Nick waits in the hall, appearing unsure. Nick strolls into the room to find Daisy admiring the orchids and, puzzled, glances at the chair and the window, noticing that the French windows are ajar. Nick grins at Daisy, who gives him her hat. He proceeds to the front door and discovers Gatsby outside, drenched. With a sharp-eyed, resolute look, Gatsby strides into the cottage, pauses in the hall to pat back his hair, and strolls into the flower-filled room to hesitate for a moment and regard Daisy, who turns abruptly and notices him. They stare at each other across the room, with Daisy's chest moving as she inhales deeply, her eyes appearing glazed, looking mesmerized. Gatsby advances and observes her with a sincere expression as Nick watches from the hall, wide-eyed. Daisy persists in gazing at Gatsby, dewy-eyed, and they both nod faintly. Later, the kettle sings, and Nick balances a tray with a shiny silver tea set into the room. As he pours tea, Daisy reclines on a couch while Gatsby stands leaning against the mantelpiece where the wooden clock rests. Nick concludes pouring tea through a strainer, and he and Daisy exchange fleeting and apprehensive looks. Gatsby fortifies himself, turns to Daisy smiling, but accidentally jostles the clock off the mantelpiece, breaking it. He attempts to nudge the bit that broke off back in place but ultimately resigns and reclines across the coffee table from Daisy, resting his chin on his hand. Nick stands between Gatsby and Daisy, offering them cups of tea, then reclines on the couch next to Daisy as they all look rather uneasy. Nick gazes into space, while Daisy and Gatsby take the occasional peek at each other. Suddenly, Nick leaps to his feet, and on the porch, Gatsby raises a hand."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Raven scrutinizes the cityscape and rises, leaning on a trumpet, as she glances at the sundial on the bookshelf and then at her bracelet. The sundial has a delicate, circular bright metal frame. Raven strides, unzips a pocket on her crimson cloak, and perches, scowling. Ella perches, appearing quite at ease, while Raven stiffens and inhales anxiously. Ella approaches to peer out of the skylight as a bicycle rolls down the lane, prompting her to rush outdoors, wielding a cane. Blue-cheeked, Raven reclines with a magazine. The pilot spreads out a quilt, and Ivy alights from the bicycle onto it, wearing orange and silver sandals, a billowy green and dark orange gown with ribbons, and a matching scarf. Ivy strides in and examines her perfectly braided ebony hair in a portrait, gazes into the chamber full of candles, and steps into the chamber astonished while Ella lingers in the foyer, looking hesitant. Ella strides into the chamber to find Ivy admiring the tulips and, perplexed, glances to the sofa and the mirror, observing that the Italian shutters are ajar. Ella grins at Ivy, who hands her a scarf. She proceeds to the main gate and finds Raven outside, drenched completely. With a fiery-eyed, resolved expression, Raven storms into the villa, halts in the foyer to pat down her tresses, and strides into the candle-filled chamber to pause briefly and gaze at Ivy, who pivots briskly and notices her. They stare at each other across the chamber, with Ivy's shoulders lifting as she exhales deeply, her eyes seeming misty, appearing mesmerized. Raven advances and regards her with a sincere gaze as Ella observes from the foyer, wide-eyed. Ivy continues to stare at Raven, misty-eyed, and they both nod gently. Later, the urn simmers, and Ella carries a platter with a glossy bronze coffee set into the chamber. As she brews coffee, Ivy reclines on a lounge while Raven stands leaning against the bookshelf where the metal sundial rests. Ella completes brewing coffee through a sieve, and she and Ivy swap sly and jittery glances. Raven fortifies herself, turns to Ivy grinning, but inadvertently nudges the sundial off the bookshelf, shattering it. She attempts to push the shard that broke off back in place but eventually relinquishes and settles across the dining table from Ivy, resting her forehead on her palm. Ella stands between Raven and Ivy, handing them mugs of coffee, then reclines on the lounge next to Ivy as they all appear rather uneasy. Ella gapes into the abyss, while Ivy and Raven swipe the occasional peek at each other. Abruptly, Ella leaps to her toes, and on the terrace, Raven raises a palm."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The elephant carefully surveys the scene and crouches, leaning on a branch, as she peers at the clock on the mantelpiece and then at her watch. The clock boasts a sturdy, angular dark wood surround. The elephant shuffles, fastens a clasp on her white jacket, and perches, grinning. Clara perches, appearing quite tense, while the elephant stiffens and sighs happily. Clara rushes to peer out of the window as a bicycle rolls up the drive, prompting her to amble outside, balancing a briefcase. Pale-faced, the elephant lounges with a magazine. The cyclist unrolls a mat, and Bella leaps out of the bicycle onto it, wearing blue and gold sneakers, a flowing purple and pale blue gown with tassels, and a matching scarf. Bella skips in and adjusts her immaculately braided brown hair in a mirror, surveys the room full of statues, and skips into the room delighted while Clara bides in the hall, looking puzzled. Clara skips into the room to find Bella admiring the sculptures and, bewildered, glances to the chair and the window, observing that the French windows are open. Clara grins at Bella, who passes her scarf to her. She trudges to the back door and finds the elephant outside, drenched. With a stern-eyed, focused expression, the elephant marches into the bungalow, pauses in the hall to tidy back her hair, and meanders into the statue-filled room to pause for a moment and peer at Bella, who swivels abruptly and spots her. They stare at each other across the room, with Bella's chest swelling as she inhales deeply, her eyes appearing misty, looking fascinated. The elephant steps forward and regards her with a sincere expression as Clara observes from the hall, wide-eyed. Bella continues to stare at the elephant, starry-eyed, and they both nod slightly. Later, the kettle whistles, and Clara balances a platter with a shiny silver tea service into the room. As she serves tea, Bella lounges on a loveseat while the elephant stands, leaning against the mantelpiece where the wooden clock rests. Clara completes serving tea through a sieve, and she and Bella swap cautious and jittery looks. The elephant braces herself, turns to Bella grinning, but unintentionally nudges the clock off the mantelpiece, fracturing it. She attempts to restore the bit that snapped off back in place but ultimately gives up and lounges across the coffee table from Bella, cradling her chin on her hand. Clara situates herself between the elephant and Bella, passing them cups of tea, then perches on the loveseat next to Bella as they all appear rather awkward. Clara gazes into nothingness, while Bella and the elephant sneak the occasional glance at each other. Suddenly, Clara leaps to her feet, and on the porch, the elephant raises a hand."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Gatsby examines the area and stretches, leaning on a broom, as he glances at the lamp on the bookshelf and then at his compass. The lamp has a sleek, round marble covering. Gatsby wanders, loosens a tie on his blue coat, and kneels, smiling. Nick kneels, looking quite contemplative, while Gatsby pauses and whispers anxiously. Nick goes to peer through the doorway as a bicycle rolls down the path, prompting him to rush inside, holding a kite. Pale-faced, Gatsby kneels with a magazine. The rider spreads out a blanket, and Daisy hops off the bicycle onto it, wearing red and silver slippers, a frilly orange and deep red gown with feathers, and a matching scarf. Daisy skips in and adjusts her perfectly braided red hair in a picture frame, glances into the space full of candles, and skips into the space astonished while Nick lingers in the corridor, looking indecisive. Nick skips into the area to find Daisy admiring the lilies and, bewildered, glances toward the stool and the doorway, noticing that the sliding doors are open. Nick grins at Daisy, who gives him her scarf. He rushes to the side exit and finds Gatsby inside, drenched. With a piercing, determined look, Gatsby strides into the lodge, halts in the foyer to tousle his hair, and skips into the candle-filled area to pause for a second and look at Daisy, who spins slowly and notices him. They stare at each other across the space, with Daisy's heart pounding as she exhales deeply, her eyes appearing misty, looking captivated. Gatsby moves sideways and regards her with an intense expression as Nick observes from the corridor, wide-eyed. Daisy continues to stare at Gatsby, misty-eyed, and they both bow slightly. Later, the oven whistles, and Nick carries a platter with a shiny gold coffee set into the area. As he pours coffee, Daisy perches on a bench while Gatsby stands leaning against the bookshelf where the marble lamp rests. Nick finishes pouring coffee through a filter, and he and Daisy exchange secretive and tense looks. Gatsby braces himself, turns to Daisy grinning, but accidentally nudges the lamp off the bookshelf, shattering it. He tries to pull the part that snapped off back in position but eventually gives up and kneels across the rug from Daisy, resting his chin on his fist. Nick stands between Gatsby and Daisy, handing them mugs of coffee, then kneels on the bench next to Daisy as they all look rather disturbed. Nick gazes into the distance, while Daisy and Gatsby steal the occasional peek at each other. Suddenly, Nick leaps to his feet, and on the balcony, Gatsby waves a hand."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Zelda inspects the landscape and crouches, leaning on a shovel, as she observes the lantern on the bookshelf and then at her calendar. The lantern boasts a delicate, circular light metal frame. Zelda meanders, fastens a lace on her red jacket, and kneels, grinning. Fred reclines, appearing quite tense, while Zelda melts and whispers softly. Fred rushes to peek into the corridor as a bicycle arrives at the pathway, prompting him to dash indoors, clutching a violin. Blushing, Zelda reclines with a pamphlet. The bicyclist spreads a blanket, and Rosie climbs out of the bicycle basket onto it, wearing silver and emerald sandals, an elegant gray and dark silver robe with pleats, and a matching scarf. Rosie skips in and adjusts her intricately braided auburn hair in a painting, peers into the hallway filled with candles, and glides into the hallway amazed while Fred lingers in the porch, watching anxiously. Fred glides into the hallway to find Rosie admiring the sunflowers and, puzzled, gazes to the cushion and the ceiling, noticing that the stained glass panels are ajar. Fred grins at Rosie, who tosses him her scarf. He dashes to the back gate and finds Zelda indoors, shivering. With a fiery, determined look, Zelda strides into the cabin, halts in the porch to comb back her hair, and steps into the candle-lit hallway to pause for a moment and glance at Rosie, who spins gracefully and notices her. They lock eyes across the space, with Rosie's shoulders trembling as she exhales deeply, her pupils appearing misty, looking enchanted. Zelda advances and gazes at her with an intense expression as Fred observes from the porch, wide-eyed. Rosie keeps staring at Zelda, teary-eyed, and they both nod gently. Afterwards, the pan whistles, and Fred carries a platter with a tarnished copper coffee pot into the hallway. As he pours coffee, Rosie reclines on a bench while Zelda leans against the bookshelf where the metal lantern stands. Fred completes pouring coffee through a funnel, and he and Rosie exchange curious and calm glances. Zelda composes herself, turns to Rosie grinning, but accidentally knocks the lantern off the bookshelf, smashing it. She attempts to fix the part that came off but ultimately gives up and kneels across the tablecloth from Rosie, resting her elbow on her knee. Fred stands between Zelda and Rosie, handing them mugs of coffee, then kneels on the bench next to Rosie as they all appear rather tense. Fred glares into silence, while Rosie and Zelda share the occasional look at one another. Abruptly, Fred leaps to his knees, and on the veranda, Zelda waves an arm."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Gatsby surveys the scene, resting on a cane, checking the time nervously. Nick sits relaxed as Gatsby breathes tensely. A car arrives, prompting Nick to hurry outside with an umbrella. Daisy steps out, wearing elegant attire, and enters, checking her hair and admiring the flower-filled room. Nick joins her, smiling as Daisy hands him her hat. He discovers Gatsby soaked outside. Gatsby enters determinedly, smoothing his hair, and exchanges a meaningful gaze with Daisy. They nod slightly at each other. Later, as a kettle boils, Nick brings tea. Gatsby accidentally breaks the mantelpiece clock, tries to fix it, then gives up and sits across from Daisy. They share furtive glances as Nick pours tea, sitting uncomfortably between them. Eventually, Nick stands, while Gatsby raises a hand on the porch."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Gatsby holds up a hand Suddenly Nick springs to his feet and on the porch Nick stares into space while Daisy and Gatsby steal the occasional glance at each other Nick stands between Gatsby and Daisy handing them cups of tea then sits on the couch next to Daisy as they all look rather uncomfortable He tries to push the bit that broke off back in place but finally gives up and sits across the coffee table from Daisy resting his chin on his hand Gatsby steels himself turns to Daisy smiling but accidentally knocks the clock off the mantelpiece breaking it Nick finishes pouring tea through a strainer and he and Daisy exchange furtive and nervous looks As he pours tea Daisy sits on a couch while Gatsby stands leaning against the mantelpiece where the wooden clock sits Later the kettle boils and Nick carries a tray with a shiny silver tea set into the room Daisy continues to gaze at Gatsby dewyeyed and they both nod slightly Gatsby steps forward and regards her with an earnest expression as Nick watches from the hall wideeyed They gaze at each other across the room with Daisy's chest heaving as she breathes deeply her eyes appearing glazed looking entranced With a steelyeyed determined look Gatsby marches into the cottage stops in the hall to smooth back his hair and walks into the flowerfilled room to stop for a moment and look at Daisy who turns sharply and sees him He goes to the front door and finds Gatsby outside soaked through Nick smiles at Daisy who hands him her hat Nick walks into the room to find Daisy admiring the orchids and confused looks to the chair and the window noticing that the French windows are ajar Daisy walks in and checks her immaculately bobbed blonde hair in a mirror looks into the room full of flowers and walks into the room amazed while Nick waits in the hall looking unsure The driver puts down a rug and Daisy steps out of the car onto it wearing blue and gold shoes a flouncy purple and pale blue dress with frills and a matching hat Greyfaced Gatsby sits with a newspaper Nick goes to look out of the window as a car comes up the drive prompting him to hurry outside holding an umbrella Nick sits looking quite relaxed while Gatsby freezes and breathes tensely Gatsby paces undoes a button on his white jacket and sits frowning The clock has a robust angular dark wood surround Gatsby surveys the scene and stands resting on a cane as he looks at the clock on the mantelpiece and then at his watch"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Later the kettle boils and Nick carries a tray with a shiny silver tea set into the room Greyfaced Gatsby sits with a newspaper Gatsby steels himself turns to Daisy smiling but accidentally knocks the clock off the mantelpiece breaking it Gatsby holds up a hand Gatsby steps forward and regards her with an earnest expression as Nick watches from the hall wideeyed He goes to the front door and finds Gatsby outside soaked through Nick finishes pouring tea through a strainer and he and Daisy exchange furtive and nervous looks With a steelyeyed determined look Gatsby marches into the cottage stops in the hall to smooth back his hair and walks into the flowerfilled room to stop for a moment and look at Daisy who turns sharply and sees him Daisy continues to gaze at Gatsby dewyeyed and they both nod slightly As he pours tea Daisy sits on a couch while Gatsby stands leaning against the mantelpiece where the wooden clock sits The clock has a robust angular dark wood surround They gaze at each other across the room with Daisy's chest heaving as she breathes deeply her eyes appearing glazed looking entranced Nick stares into space while Daisy and Gatsby steal the occasional glance at each other The driver puts down a rug and Daisy steps out of the car onto it wearing blue and gold shoes a flouncy purple and pale blue dress with frills and a matching hat Nick smiles at Daisy who hands him her hat Gatsby paces undoes a button on his white jacket and sits frowning Suddenly Nick springs to his feet and on the porch Nick goes to look out of the window as a car comes up the drive prompting him to hurry outside holding an umbrella He tries to push the bit that broke off back in place but finally gives up and sits across the coffee table from Daisy resting his chin on his hand Daisy walks in and checks her immaculately bobbed blonde hair in a mirror looks into the room full of flowers and walks into the room amazed while Nick waits in the hall looking unsure Nick walks into the room to find Daisy admiring the orchids and confused looks to the chair and the window noticing that the French windows are ajar Gatsby surveys the scene and stands resting on a cane as he looks at the clock on the mantelpiece and then at his watch Nick sits looking quite relaxed while Gatsby freezes and breathes tensely Nick stands between Gatsby and Daisy handing them cups of tea then sits on the couch next to Daisy as they all look rather uncomfortable"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "They gaze at each other across the room with Daisy's chest heaving as she breathes deeply her eyes appearing glazed looking entranced Gatsby steps forward and regards her with an earnest expression as Nick watches from the hall wideeyed Daisy continues to gaze at Gatsby dewyeyed and they both nod slightly Later the kettle boils and Nick carries a tray with a shiny silver tea set into the room As he pours tea Daisy sits on a couch while Gatsby stands leaning against the mantelpiece where the wooden clock sits Nick finishes pouring tea through a strainer and he and Daisy exchange furtive and nervous looks Gatsby steels himself turns to Daisy smiling but accidentally knocks the clock off the mantelpiece breaking it He tries to push the bit that broke off back in place but finally gives up and sits across the coffee table from Daisy resting his chin on his hand Nick stands between Gatsby and Daisy handing them cups of tea then sits on the couch next to Daisy as they all look rather uncomfortable Nick stares into space while Daisy and Gatsby steal the occasional glance at each other Suddenly Nick springs to his feet and on the porch Gatsby holds up a hand Gatsby surveys the scene and stands resting on a cane as he looks at the clock on the mantelpiece and then at his watch The clock has a robust angular dark wood surround Gatsby paces undoes a button on his white jacket and sits frowning Nick sits looking quite relaxed while Gatsby freezes and breathes tensely Nick goes to look out of the window as a car comes up the drive prompting him to hurry outside holding an umbrella Greyfaced Gatsby sits with a newspaper The driver puts down a rug and Daisy steps out of the car onto it wearing blue and gold shoes a flouncy purple and pale blue dress with frills and a matching hat Daisy walks in and checks her immaculately bobbed blonde hair in a mirror looks into the room full of flowers and walks into the room amazed while Nick waits in the hall looking unsure Nick walks into the room to find Daisy admiring the orchids and confused looks to the chair and the window noticing that the French windows are ajar Nick smiles at Daisy who hands him her hat He goes to the front door and finds Gatsby outside soaked through With a steelyeyed determined look Gatsby marches into the cottage stops in the hall to smooth back his hair and walks into the flowerfilled room to stop for a moment and look at Daisy who turns sharply and sees him"
        }
      ]
    }
  ]
}