{
  "ground_truth": "He nods to Nick and takes a deep breath as Gatsby sneaks furtively into the kitchen area and peers through the flowers into the room. Watching from the door, Nick takes off his boater and gestures for Gatsby to tidy his hair, which he smooths back with his hand. Finally, appearing confident and relaxed and with the old familiar glint in his eyes, Gatsby steps towards the room where Nick stands beneath a tree in the rain. Drenched, Nick returns and sees Gatsby and Daisy deep in conversation, then he rattles a bowl in the sink to make his presence known, but Daisy and Gatsby don't notice and continue looking into each other's eyes, smiling at each other. Nick gives up, walks in, and takes off his coat. Gatsby glances at the window then returns his unwavering gaze to Daisy, whose dark eyes return his gaze adoringly. Gatsby smiles, gets up, and opens the French windows, revealing a bright blue sky peeping through the diminishing rainclouds as sunlight glimmers on the calm bay. They step out onto the porch, rest against a pillar, and their fingers touch as they look at each other. He points across the bay before Gatsby walks back inside, and they walk up the drive. Daisy looks up in wonder, surrounded by gushing fountains and ornamental palms, they look up at the house. Gatsby looks at Daisy, framed by the fountain, and an orange-squeezing machine is there. Daisy, Gatsby, and Nick swim on his private beach, and Gatsby dives from a diving pontoon out in the water while Nick films Daisy hitting a golf ball. They tumble into the ballroom where Daisy marvels at the monumental organ, and Gatsby takes Daisy and Nick on a tour. He throws shirts from a balcony, and Daisy flops onto the pile of brightly colored shirts on the bed as Nick looks down from the balcony in the opulent bedroom. Noticing the change in Daisy's mood, Gatsby goes down to the bed where she sits, strokes her chin, and she looks up at Nick, who walks away somberly as Gatsby kisses her brow. Nick walks down a spiral staircase and looks at a wall and a desk where pictures and trophies are displayed, including a photograph of a distinguished old man. Gatsby sits on his bed, holding Daisy close to him, and Daisy rests her head in Gatsby's lap and follows his gaze to the window and beyond. Nick walks over, takes a book from a shelf, and opens it, touched, Daisy runs her fingers over them. Gatsby goes to the other side of the room to answer the phone, turning his back to Nick and Daisy. Outside, a strong swelling breeze whips up on the balcony, blowing the French windows open, which Nick closes and listens to Gatsby.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He inclines to Nick and inhales a profound breath as Gatsby creeps stealthily into the culinary area and gazes through the blooms into the chamber. Observing from the entrance, Nick removes his straw hat and motions for Gatsby to neaten his mane, which he smooths back with his palm. Ultimately, appearing assured and at ease and with the old recognizable gleam in his eyes, Gatsby advances towards the chamber where Nick stands beneath a tree in the precipitation. Soaked, Nick returns and perceives Gatsby and Daisy profound in dialogue, then he shakes a basin in the basin to make his presence known, but Daisy and Gatsby don't perceive and persist peering into each other's eyes, grinning at each other. Nick relinquishes, ambles in, and removes his coat. Gatsby glances at the pane then returns his steadfast gaze to Daisy, whose dark eyes return his gaze lovingly. Gatsby grins, rises up, and opens the French windows, revealing a vivid azure sky peeking through the lessening rainclouds as sunlight sparkles on the tranquil bay. They step out onto the veranda, lean against a column, and their digits touch as they look at each other. He gestures across the bay before Gatsby ambles back inside, and they stroll up the drive. Daisy gazes up in amazement, surrounded by gushing fountains and decorative palms, they gaze up at the mansion. Gatsby glances at Daisy, framed by the fountain, and an orange-squeezing machine is there. Daisy, Gatsby, and Nick swim on his private shore, and Gatsby plunges from a diving raft out in the water while Nick records Daisy striking a golf ball. They tumble into the ballroom where Daisy marvels at the monumental organ, and Gatsby guides Daisy and Nick on a tour. He tosses garments from a balcony, and Daisy flops onto the heap of vividly colored garments on the bed as Nick gazes down from the balcony in the luxurious chamber. Noticing the alteration in Daisy's mood, Gatsby descends to the bed where she perches, caresses her chin, and she gazes up at Nick, who ambles away somberly as Gatsby kisses her forehead. Nick descends a spiral staircase and gazes at a wall and a desk where images and trophies are displayed, including a photograph of a distinguished old man. Gatsby sits on his bed, embracing Daisy close to him, and Daisy rests her head in Gatsby's lap and follows his gaze to the pane and beyond. Nick ambles over, takes a tome from a shelf, and opens it, touched, Daisy runs her fingers over them. Gatsby goes to the other side of the chamber to answer the phone, turning his back to Nick and Daisy. Outside, a strong swelling breeze whips up on the balcony, blowing the French windows open, which Nick closes and listens to Gatsby."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He nods to Nick, and a deep breath is taken by him as Gatsby sneaks furtively into the kitchen area and peers through the flowers into the room. Watching from the door, his boater is taken off by Nick, who gestures for Gatsby to tidy his hair, which is smoothed back with his hand. Finally, the room is stepped towards by Gatsby, appearing confident and relaxed with the old familiar glint in his eyes, where beneath a tree in the rain Nick stands. Drenched, the scene of Gatsby and Daisy deep in conversation is returned to by Nick, then a bowl is rattled by him in the sink to make his presence known, but Daisy and Gatsby don't notice and continue looking into each other's eyes, smiling at each other. Nick gives up, walks in, and his coat is taken off by him. Gatsby glances at the window, then his unwavering gaze is returned to Daisy, whose dark eyes return his gaze adoringly. Gatsby smiles, gets up, and the French windows are opened by him, revealing a bright blue sky peeping through the diminishing rainclouds as sunlight glimmers on the calm bay. They step out onto the porch, rest against a pillar, and their fingers are touched as they look at each other. He points across the bay before Gatsby is walked back inside, and up the drive they are walked by him. Daisy looks up in wonder, surrounded by gushing fountains and ornamental palms, and looking up at the house is done by them. Gatsby looks at Daisy, framed by the fountain, and an orange-squeezing machine stands there. Daisy, Gatsby, and Nick swim on his private beach, and from a diving pontoon out in the water, a dive is made by Gatsby, while Daisy is filmed by Nick hitting a golf ball. The ballroom is tumbled into by them, where the monumental organ is marveled at by Daisy, and Daisy and Nick are taken on a tour by Gatsby. Shirts are thrown by him from a balcony, and Daisy flops onto the pile of brightly colored shirts on the bed as down from the balcony, Nick looks in the opulent bedroom. Noticing the change in Daisy's mood, Gatsby goes down to the bed where she sits, strokes her chin, and up at Nick she looks, who walks away somberly as her brow is kissed by Gatsby. Nick walks down a spiral staircase and looks at a wall and a desk where pictures and trophies are displayed, including a photograph of a distinguished old man. Sitting on his bed, Daisy is held close by Gatsby, and her head is rested in Gatsby's lap by Daisy, who follows his gaze to the window and beyond. Nick walks over, takes a book from a shelf, and opens it; touched, her fingers are run over them by Daisy. Gatsby goes to the other side of the room to answer the phone, turning his back to Nick and Daisy. Outside, a strong swelling breeze whips up on the balcony, blowing the French windows open, which are closed by Nick, and listens to Gatsby."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Nick nods to Gatsby, who furtively enters the kitchen and peers through the flowers. Observing from the doorway, Nick removes his boater and signals Gatsby to smooth his hair. Appearing confident, Gatsby joins Nick in the rain. Drenched, Nick sees Gatsby and Daisy engrossed in conversation and tries to make his presence known, but they remain enraptured with each other. Giving up, Nick removes his coat as Gatsby opens the French windows to reveal a bright sky. On the porch, their fingers touch as they gaze at each other. Pointing across the bay, Gatsby heads inside, and they walk up the drive, surrounded by fountains and palms. Gatsby looks at Daisy, and they swim on his private beach while Nick films Daisy golfing. In the ballroom, Daisy admires the organ, and Gatsby tours her and Nick around. He throws shirts from a balcony, and Daisy flops onto the colorful pile as Nick watches from above. Noticing Daisy's mood shift, Gatsby joins her and strokes her chin. Nick walks away somberly but glimpses a wall filled with trophies and a distinguished old man's photo. Gatsby, holding Daisy, gazes out the window. Nick, moved, takes a book, which Daisy touches. Gatsby answers the phone, turning away. A strong breeze blows open the windows, which Nick closes, listening to Gatsby."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He nods to Nick, takes a deep breath, and furtively enters the kitchen, peering into the room. Nick gestures for Gatsby to tidy his hair. Confidently, Gatsby steps toward the room, where Nick stands in the rain. Soaked, Nick sees Gatsby and Daisy deep in conversation, attempts to make noise to alert them, but they are lost in each other's eyes. Nick gives up, removes his coat as Gatsby smiles, opens the French windows to reveal a bright sky. They step onto the porch, fingers touching. Gatsby points across the bay, then they walk up the drive. Daisy is awed by fountains and palms. They swim at Gatsby's private beach; Nick films Daisy’s golf swing. They explore the ballroom, Daisy fascinated by the organ. Gatsby shows shirts from the balcony, Daisy swoons onto them. Noting Daisy's mood change, Gatsby comforts her, and Nick walks away somberly. Nick examines a wall of pictures and trophies, Gatsby and Daisy share a moment by the window. Nick browses a book, moved. Daisy runs her fingers over it. Gatsby answers the phone, turning away, as a breeze blows open the French windows, which Nick closes while listening to Gatsby."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He acknowledges Nick with a nod, taking a deep, steadying breath as he watches Gatsby sneak quietly, almost stealthily, into the adjacent kitchen area. From there, Gatsby peers intently through the flowers into the room beyond. Standing by the doorway, Nick removes his boater hat and, with a subtle gesture, suggests that Gatsby should tidy up his hair. Complying, Gatsby smooths it back with his hand. With a newfound air of confidence and a relaxed demeanor, accompanied by the familiar gleam in his eyes, Gatsby advances towards the room where Nick stands under the cover of a tree amidst the rain. Soaked through by the downpour, Nick returns to find Gatsby and Daisy deeply engrossed in their conversation. In an effort to announce his presence, he rattles a bowl in the sink. However, neither Daisy nor Gatsby takes notice, as they remain captivated by each other's gaze, their smiles locked in a mutual exchange. Eventually, Nick decides to abandon his attempts and enters the room, removing his coat in the process. Gatsby, momentarily distracted, glances outside at the window before redirecting his unwavering gaze back to Daisy, whose dark eyes reflect adoration as they meet his. A smile graces Gatsby's face as he rises to his feet and opens the French windows, unveiling a sky that is a brilliant shade of blue, glimpsed through the retreating rainclouds, with sunlight shimmering over the calm bay. Together, they step out onto the porch, leaning against one of the pillars. Their fingers briefly touch, and they lock eyes once more. Gatsby gestures across the bay before retreating inside, leading them back up the driveway. Daisy gazes upward in awe, surrounded by the grandeur of gushing fountains and decorative palms, as they both look up, admiring the house. As Gatsby's eyes fall upon Daisy, she is beautifully framed by the fountain, and near them stands an orange-squeezing machine. The scene shifts to Daisy, Gatsby, and Nick enjoying the water on his private beach; Gatsby diving gracefully from a distant diving pontoon while Nick captures Daisy's efforts as she swings a golf club. Their playful escapades eventually lead them into the grand ballroom, where Daisy expresses wonderment at the impressive, monumental organ. Gatsby takes the opportunity to guide Daisy and Nick on an informative tour, during which he playfully tosses an array of shirts from a balcony. Daisy, overwhelmed by the display, collapses onto the colorful pile of shirts on the luxurious bed below, as Nick looks on from the balcony within the opulent bedroom. Detecting a shift in Daisy's mood, Gatsby descends to where she sits, gently stroking her chin, and she raises her eyes to Nick, who departs with a somber air while Gatsby tenderly kisses her brow. Nick then proceeds down a spiral staircase, pausing briefly to gaze upon a wall adorned with pictures and a desk filled with trophies, among them a photograph of a dignified elderly gentleman. In parallel, Gatsby sits contemplatively on the bed, holding Daisy close, as she rests her head upon his lap, her eyes following his to the window and the world beyond. Nick approaches, selecting a book from the shelf and opening it, visibly moved as Daisy tenderly runs her fingers over the pages. Meanwhile, Gatsby makes his way to the opposite side of the room to answer a phone call, turning his back to both Nick and Daisy. Outside, a strong breeze swells, stirring up on the balcony and causing the French windows to fling open, which Nick dutifully closes as he listens attentively to Gatsby's conversation."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A nod of acknowledgment is directed towards Nick, who takes a long, deep breath to steady himself while observing Gatsby as he quietly, almost with an air of stealth, makes his way into the adjacent kitchen area. From this vantage point, Gatsby's eyes peer with intense focus through an arrangement of flowers into the room beyond. Positioned by the doorway, Nick removes his distinctive boater hat and, with a subtle yet meaningful gesture, indicates that Gatsby should perhaps consider tidying up his hair. Obeying this suggestion, Gatsby runs his hand through his hair, smoothing it back neatly. Feeling a newfound surge of confidence accompanied by a relaxed demeanor, and with that familiar gleam reappearing in his eyes, Gatsby walks forward into the room where Nick stands, shielded under the protective cover of a tree amidst the ongoing rain. Thoroughly drenched by the unrelenting downpour, Nick returns inside only to discover Gatsby and Daisy deeply engrossed and absorbed in their conversation. In an effort to make his presence known, he deliberately rattles a bowl resting in the sink. Yet, neither Daisy nor Gatsby seems aware, as they remain utterly captivated by each other's gaze, their smiles locked together in a shared, mutual exchange. Eventually, Nick decides to abandon his subtle attempts to gain their attention and proceeds to enter the room, removing his soaked coat as he does so. At this moment, Gatsby, momentarily distracted, glances outside towards the window before promptly redirecting his attentive and unwavering gaze back to Daisy, whose dark eyes vividly reflect adoration as they meet his own. A smile spreads across Gatsby's face as he rises to his full height and opens the French windows, revealing a sky that is a brilliant, dazzling shade of blue, glimpses of which shine through the retreating rainclouds, with sunlight shimmering elegantly over the calm bay. Together, they step out onto the welcoming porch, where they lean against one of the sturdy pillars. Their fingers brush against each other briefly, and once more, they lock eyes with a shared understanding. Gatsby gestures expansively across the bay before leading them back inside, guiding them up the driveway once more. Daisy's gaze ascends in awe, surrounded by the grandeur of gushing fountains and decorative palm trees, as they both look upward, admiring the house in all its splendor. As Gatsby’s eyes fall upon Daisy, she is framed beautifully by the cascading fountain nearby, where they stand close to an orange-squeezing machine. The scene transitions seamlessly to the trio of Daisy, Gatsby, and Nick delighting in the refreshing water on his private beach; Gatsby, with fluid grace, dives from a distant diving pontoon while Nick attentively captures Daisy’s determined efforts as she swings a golf club with enthusiasm. Their playful and joyful escapades eventually lead them into the grand, opulent ballroom, where Daisy is filled with a sense of wonderment at the impressive, monumental organ housed there. Gatsby seizes this opportunity to guide Daisy and Nick on a knowledgeable and informative tour, during which he playfully tosses a dazzling array of shirts from a balcony. Daisy, overwhelmed by the extravagant display, collapses in delight onto the colorful pile of shirts spread luxuriously on the bed below, as Nick observes from the vantage of the balcony within the richly decorated bedroom. Perceiving a subtle shift in Daisy's mood, Gatsby descends gracefully to where she sits, gently stroking her chin, prompting her to raise her eyes toward Nick, who departs with a somber air as Gatsby tenderly kisses her brow. Nick then proceeds down a majestic spiral staircase, pausing briefly to thoughtfully gaze upon a wall adorned with a collection of pictures and a desk that is filled with an array of trophies, among them a photograph of a dignified, elderly gentleman. Meanwhile, Gatsby sits in a contemplative manner on the bed, holding Daisy close to him, as she rests her head gently upon his lap, her eyes following his toward the window and the world that lies beyond it. Nick approaches the nearby bookshelf, selecting a book from its shelves and opening it, visibly moved as Daisy tenderly runs her fingers over the pages with care. Meanwhile, Gatsby moves to the opposite side of the room to answer a phone call, turning his back to both Nick and Daisy. Outside, a strong breeze swells, stirring and rustling the air on the balcony, causing the French windows to fling open with a sudden motion, an action which Nick dutifully rectifies as he listens attentively to Gatsby's ongoing conversation."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He nods to Nick, signaling a silent communication, and takes a deep breath, filling his lungs and steeling himself for what is to come. Meanwhile, Gatsby sneaks furtively into the kitchen area, each step measured and quiet, as he maneuvers his body to peer through the flowers, positioning himself to catch a glimpse into the room. From the door, Nick watches closely, removing his boater in a casual but deliberate motion, and gestures towards Gatsby, suggesting with a wave for him to tidy his hair. Gatsby complies, smoothing back his hair with a swift motion of his hand, restoring it to a neat state. With a transformation of demeanor, he appears confident and relaxed, the old familiar glint in his eyes rekindled. He steps forward toward the room, where Nick stands beneath a tree in the rain, observing the scene unfold. Drenched by the persistent rain, Nick returns to the room and finds Gatsby and Daisy engrossed in conversation, their focus solely on each other. Attempting to make his presence known, Nick rattles a bowl in the sink, creating a clattering noise, but Daisy and Gatsby remain oblivious, lost in each other's gaze, smiling affectionately. Realizing his efforts are futile, Nick gives up, strides into the room, and removes his coat, an act of resignation and acceptance of the scene. As Gatsby glances momentarily at the window, he quickly returns his unwavering gaze to Daisy, whose dark eyes meet his with adoration. Gatsby breaks into a smile, rises from his seat, and strides over to open the French windows. The windows part to reveal a bright blue sky emerging from behind the diminishing rainclouds, as sunlight begins to glimmer on the formerly stormy bay. Together, they step out onto the porch, leaning against a pillar for support, and in a tender moment, their fingers touch lightly, an unspoken connection as they continue to exchange meaningful glances. Gatsby points across the bay, directing Daisy's attention to the sweeping view before he walks back inside, leading the way, and they make their way up the drive. Daisy looks up with a sense of wonder as she finds herself surrounded by gushing fountains and ornamental palms, taking in the grandeur of their surroundings. They both look up at the imposing house that looms before them. Gatsby turns his gaze towards Daisy, who is framed beautifully by the fountain, an orange-squeezing machine nearby, hinting at the blend of luxury and whimsy. The trio, Daisy, Gatsby, and Nick, finds themselves enjoying the sun on Gatsby's private beach, with Gatsby diving gracefully from a diving pontoon into the water, his movements fluid and carefree. In this moment of leisure, Nick films Daisy as she playfully hits a golf ball, capturing her carefree spirit on camera. They tumble into the grand ballroom, and Daisy's attention is immediately captured by the monumental organ, its presence commanding awe. Eager to share the opulence, Gatsby takes Daisy and Nick on an impromptu tour, showcasing the splendor of his home. In a playful display, he throws shirts from a balcony, and Daisy delightfully flops onto the vibrant pile of brightly colored shirts on the bed, luxuriating in the moment, while Nick looks down from the balcony, absorbing the opulence of the bedroom. Noticing a change in Daisy's mood, Gatsby descends to the bed where she sits, tenderly strokes her chin, seeking to comfort and reassure her. Her eyes wander up to Nick, who acknowledges the shift in atmosphere and somberly walks away, allowing them privacy as Gatsby plants a gentle kiss on Daisy's brow. Nick descends a spiral staircase, his footsteps echoing softly, and casts his gaze over a wall and a desk adorned with pictures and trophies, including a photograph of a distinguished old man, each item telling a story. Meanwhile, Gatsby remains seated on his bed, holding Daisy close, her head resting in his lap as they share a moment of quiet intimacy. Her gaze follows his to the window and beyond, where possibilities seem endless. Nick approaches, drawn to a shelf lined with books, selecting one and opening it with reverence, touched by the scene unfolding before him. Daisy, intrigued, runs her fingers over the pages, feeling their texture and history. Meanwhile, Gatsby moves to the other side of the room to answer the phone, turning his back momentarily to both Nick and Daisy, his attention momentarily diverted. Outside, a strong swelling breeze sweeps across the balcony, forceful enough to blow the French windows open, prompting Nick to step forward and close them, sealing the room once more, as he listens keenly to Gatsby's conversation, the day drawing to a close around them."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Gatsby furtively enters the kitchen, peering through flowers into the room as Nick gestures for him to tidy his hair. With renewed confidence, Gatsby steps toward the room, where Nick stands in the rain. Later, Nick returns drenched and notices Gatsby and Daisy deep in conversation, oblivious to his attempts to make his presence known. Giving up, Nick removes his coat, while Gatsby remains focused on Daisy. Gatsby then opens the French windows, revealing a clearing sky and sunlight on the bay. They step onto the porch and touch fingers, exchanging meaningful glances. Gatsby points across the bay before they walk back inside and up the drive, marveling at the surrounding splendor. Later, at the beach, they swim and enjoy various activities, with Nick filming Daisy playing golf. Inside, Daisy admires the monumental organ, and Gatsby takes them on a house tour. He playfully throws shirts from a balcony onto Daisy, who flops onto them. Noticing Daisy’s mood change, Gatsby joins her on the bed, comforting her as she looks to Nick, who walks away somberly. Nick descends the spiral staircase, observing the photos and trophies. Meanwhile, Gatsby sits with Daisy, gazing out the window. Nick picks up a book, touched by the moment, while Daisy runs her fingers over it. As Gatsby turns to answer the phone, a strong breeze blows open the French windows, which Nick closes as he listens to Gatsby."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He nods to Nick, who is known for his perceptive observations, and takes a deep breath as Gatsby, the enigmatic millionaire with a mysterious past, sneaks furtively into the kitchen area and peers through the flowers, which were freshly arranged by a renowned local florist, into the room. Watching from the door, Nick takes off his boater, a fashionable summer hat of the 1920s, and gestures for Gatsby to tidy his hair, which he smooths back with his hand. Finally, appearing confident and relaxed and with the old familiar glint in his eyes suggestive of his undying hope, Gatsby steps towards the room where Nick stands beneath a tree in the rain that has begun to gently fall, typical of the unpredictable East Coast weather. Drenched, Nick returns and sees Gatsby and Daisy, who were once deeply in love before the war parted them, deep in conversation. Then he rattles a bowl in the sink to make his presence known, but Daisy and Gatsby don't notice and continue looking into each other's eyes, smiling at each other as though no time has passed. Nick gives up, walks in, and takes off his coat, feeling the dampness of the rain. Gatsby glances at the window then returns his unwavering gaze to Daisy, whose dark eyes return his gaze adoringly, reflecting the affection that has rekindled between them. Gatsby smiles, gets up, and opens the French windows, revealing a bright blue sky peeping through the diminishing rainclouds as sunlight glimmers on the calm bay, famous for its picturesque views. They step out onto the porch, an architectural feature common in grand estate homes, rest against a pillar, and their fingers touch as they look at each other, sharing a moment of idyllic intimacy. He points across the bay, perhaps to the green light at the end of Daisy's dock that symbolizes hope, before Gatsby walks back inside, and they walk up the drive lined with perfectly manicured hedges. Daisy looks up in wonder, surrounded by gushing fountains and ornamental palms that evoke the grandeur of European estates; they look up at the house, a symbol of Gatsby's extravagant lifestyle and longing for acceptance. Gatsby looks at Daisy, framed by the fountain, and an orange-squeezing machine, a status symbol of modern luxury, is there. Daisy, Gatsby, and Nick swim on his private beach, secluded and pristine, and Gatsby dives from a diving pontoon out in the water while Nick films Daisy hitting a golf ball, an activity she excels at as a celebrated golfer. They tumble into the ballroom where Daisy marvels at the monumental organ, an opulent musical instrument often found in wealthy homes, and Gatsby takes Daisy and Nick on a tour, proudly showcasing his possessions. He throws shirts from a balcony, splashes of color symbolizing his wealth, and Daisy flops onto the pile of brightly colored shirts on the bed as Nick looks down from the balcony in the opulent bedroom filled with fine furnishings. Noticing the change in Daisy's mood, Gatsby goes down to the bed where she sits, strokes her chin, and she looks up at Nick, who walks away somberly as Gatsby kisses her brow, a tender act of devotion. Nick walks down a spiral staircase, expertly crafted and emblematic of the architectural splendor of the home, and looks at a wall and a desk where pictures and trophies are displayed, including a photograph of a distinguished old man, who once served as Gatsby's mentor. Gatsby sits on his bed, holding Daisy close to him, and Daisy rests her head in Gatsby's lap, a gesture of comfort, and follows his gaze to the window and beyond, dreaming of a future together. Nick walks over, takes a book from a shelf, a collection of rare editions that speak to Gatsby's cultured facade, and opens it, touched, Daisy runs her fingers over them, feeling the smooth covers. Gatsby goes to the other side of the room to answer the phone, a call that could be from his connections in the underworld, turning his back to Nick and Daisy. Outside, a strong swelling breeze whips up on the balcony, blowing the French windows open, which Nick closes and listens to Gatsby, aware of the complicated layers of his friend's life."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Gatsby and Nick swim on his private beach and Gatsby dives from a diving pontoon out in the water while Nick films Daisy hitting a golf ball Gatsby smiles gets up and opens the French windows revealing a bright blue sky peeping through the diminishing rainclouds as sunlight glimmers on the calm bay He nods to Nick and takes a deep breath as Gatsby sneaks furtively into the kitchen area and peers through the flowers into the room Watching from the door Nick takes off his boater and gestures for Gatsby to tidy his hair which he smooths back with his hand Finally appearing confident and relaxed and with the old familiar glint in his eyes Gatsby steps towards the room where Nick stands beneath a tree in the rain Drenched Nick returns and sees Gatsby and Daisy deep in conversation then he rattles a bowl in the sink to make his presence known but Daisy and Gatsby do not notice and continue looking into each other's eyes smiling at each other Nick gives up walks in and takes off his coat Nick walks over takes a book from a shelf and opens it Drenched Nick returns and sees Gatsby and Daisy deep in conversation Watching from the door Nick takes off his boater and gestures for Gatsby to tidy his hair which he smooths back with his hand Gatsby glances at the window then returns his unwavering gaze to Daisy whose dark eyes return his gaze adoringly Gatsby smiles gets up and opens the French windows revealing a bright blue sky peeping through the diminishing rainclouds as sunlight glimmers on the calm bay They step out onto the porch rest against a pillar and their fingers touch as they look at each other then he rattles a bowl in the sink to make his presence known but Daisy and Gatsby do not notice and continue looking into each other's eyes smiling at each other He points across the bay before Gatsby walks back inside and they walk up the drive Finally appearing confident and relaxed and with the old familiar glint in his eyes Gatsby steps towards the room where Nick stands beneath a tree in the rain Daisy looks up in wonder surrounded by gushing fountains and ornamental palms they look up at the house Daisy runs her fingers over them Gatsby looks at Daisy framed by the fountain and an orangesqueezing machine is there Daisy Outside a strong swelling breeze whips up on the balcony blowing the French windows open which Nick closes and listens to Gatsby He nods to Nick and takes a deep breath as Gatsby sneaks furtively into the kitchen area and peers through the flowers into the room Gatsby and Nick swim on his private beach and Gatsby dives from a diving pontoon out in the water while Nick films Daisy hitting a golf ball They tumble into the ballroom where Daisy marvels at the monumental organ and Gatsby takes Daisy and Nick on a tour They step out onto the porch rest against a pillar and their fingers touch as they look at each other He throws shirts from a balcony and Daisy flops onto the pile of brightly colored shirts on the bed as Nick looks down from the balcony in the opulent bedroom Noticing the change in Daisy's mood Gatsby goes down to the bed where she sits strokes her chin and she looks up at Nick who walks away somberly as Gatsby kisses her brow Nick walks down a spiral staircase and looks at a wall and a desk where pictures and trophies are displayed including a photograph of a distinguished old man Gatsby goes to the other side of the room to answer the phone turning his back to Nick and Daisy Daisy Gatsby sits on his bed holding Daisy close to him and Daisy rests her head in Gatsby's lap and follows his gaze to the window and beyond Nick walks over takes a book from a shelf and opens it touched Daisy runs her fingers over them Gatsby goes to the other side of the room to answer the phone turning his back to Nick and Daisy Outside a strong swelling breeze whips up on the balcony blowing the French windows open which Nick closes and listens to Gatsby"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He nods to Nick and takes a deep breath as Gatsby sneaks furtively into the kitchen area and peers through the flowers into the room. Watching from the door Nick takes off his boater and gestures for Gatsby to tidy his hair which he smooths back with his hand. Finally appearing confident and relaxed and with the old familiar glint in his eyes Gatsby steps towards the room where Nick stands beneath a tree in the rain. Drenched Nick returns and sees Gatsby and Daisy deep in conversation. then he rattles a bowl in the sink to make his presence known but Daisy and Gatsby do not notice and continue looking into each other's eyes smiling at each other. Nick gives up walks in and takes off his coat. Gatsby glances at the window then returns his unwavering gaze to Daisy whose dark eyes return his gaze adoringly. Gatsby smiles gets up and opens the French windows revealing a bright blue sky peeping through the diminishing rainclouds as sunlight glimmers on the calm bay. They step out onto the porch rest against a pillar and their fingers touch as they look at each other. He points across the bay before Gatsby walks back inside and they walk up the drive. Daisy looks up in wonder surrounded by gushing fountains and ornamental palms. they look up at the house. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Gatsby looks at Daisy framed by the fountain and an orangesqueezing machine is there. Daisy. Gatsby and Nick swim on his private beach and Gatsby dives from a diving pontoon out in the water while Nick films Daisy hitting a golf ball. They tumble into the ballroom where Daisy marvels at the monumental organ and Gatsby takes Daisy and Nick on a tour. He throws shirts from a balcony and Daisy flops onto the pile of brightly colored shirts on the bed as Nick looks down from the balcony in the opulent bedroom. Noticing the change in Daisy's mood Gatsby goes down to the bed where she sits strokes her chin and she looks up at Nick who walks away somberly as Gatsby kisses her brow. Nick walks down a spiral staircase and looks at a wall and a desk where pictures and trophies are displayed including a photograph of a distinguished old man. Gatsby sits on his bed holding Daisy close to him and Daisy rests her head in Gatsby's lap and follows his gaze to the window and beyond. Nick walks over takes a book from a shelf and opens it. touched. Daisy runs her fingers over them. Gatsby goes to the other side of the room to answer the phone turning his back to Nick and Daisy. Outside a strong swelling breeze whips up on the balcony blowing the French windows open which Nick closes and listens to Gatsby."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He nods to Nick and takes a deep breath as Gatsby sneaks furtively into the kitchen area and peers through the flowers into the room. Watching from the door Nick takes off his boater and gestures for Gatsby to tidy his hair which he smooths back with his hand. Finally appearing confident and relaxed and with the old familiar glint in his eyes Gatsby steps towards the room where Nick stands beneath a tree in the rain. Drenched Nick returns and sees Gatsby and Daisy deep in conversation. then he rattles a bowl in the sink to make his presence known but Daisy and Gatsby do not notice and continue looking into each other's eyes smiling at each other. Nick gives up walks in and takes off his coat. Gatsby glances at the window then returns his unwavering gaze to Daisy whose dark eyes return his gaze adoringly. Gatsby smiles gets up and opens the French windows revealing a bright blue sky peeping through the diminishing rainclouds as sunlight glimmers on the calm bay. They step out onto the porch rest against a pillar and their fingers touch as they look at each other. He points across the bay before Gatsby walks back inside and they walk up the drive. Daisy looks up in wonder surrounded by gushing fountains and ornamental palms. they look up at the house. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Gatsby looks at Daisy framed by the fountain and an orangesqueezing machine is there. Daisy. Gatsby and Nick swim on his private beach and Gatsby dives from a diving pontoon out in the water while Nick films Daisy hitting a golf ball. They tumble into the ballroom where Daisy marvels at the monumental organ and Gatsby takes Daisy and Nick on a tour. He throws shirts from a balcony and Daisy flops onto the pile of brightly colored shirts on the bed as Nick looks down from the balcony in the opulent bedroom. Noticing the change in Daisy's mood Gatsby goes down to the bed where she sits strokes her chin and she looks up at Nick who walks away somberly as Gatsby kisses her brow. Nick walks down a spiral staircase and looks at a wall and a desk where pictures and trophies are displayed including a photograph of a distinguished old man. Gatsby sits on his bed holding Daisy close to him and Daisy rests her head in Gatsby's lap and follows his gaze to the window and beyond. Nick walks over takes a book from a shelf and opens it. touched. Daisy runs her fingers over them. Gatsby goes to the other side of the room to answer the phone turning his back to Nick and Daisy. Outside a strong swelling breeze whips up on the balcony blowing the French windows open which Nick closes and listens to Gatsby."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He nods to Nick and takes a deep breath as Gatsby sneaks furtively into the kitchen area and peers through the flowers into the room. Watching from the door Nick takes off his boater and gestures for Gatsby to tidy his hair which he smooths back with his hand. Finally appearing confident and relaxed and with the old familiar glint in his eyes Gatsby steps towards the room where Nick stands beneath a tree in the rain. Drenched Nick returns and sees Gatsby and Daisy deep in conversation. then he rattles a bowl in the sink to make his presence known but Daisy and Gatsby do not notice and continue looking into each other's eyes smiling at each other. Nick gives up walks in and takes off his coat. Nick walks down a spiral staircase and looks at a wall and a desk where pictures and trophies are displayed including a photograph of a distinguished old man. Gatsby sits on his bed holding Daisy close to him and Daisy rests her head in Gatsby's lap and follows his gaze to the window and beyond. Nick walks over takes a book from a shelf and opens it. touched. Daisy runs her fingers over them. Gatsby goes to the other side of the room to answer the phone turning his back to Nick and Daisy. Outside a strong swelling breeze whips up on the balcony blowing the French windows open which Nick closes and listens to Gatsby."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He nods to Nick and takes a deep breath as Gatsby sneaks furtively into the kitchen area and peers through the flowers into the room. Watching from the door Nick takes off his boater and gestures for Gatsby to tidy his hair which he smooths back with his hand. Daisy runs her fingers over them. Gatsby goes to the other side of the room to answer the phone turning his back to Nick and Daisy. Outside a strong swelling breeze whips up on the balcony blowing the French windows open which Nick closes and listens to Gatsby."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dog nods to the statue and takes a deep breath as the squirrel sneaks furtively into the kitchen area and peers through the flowers into the room. Watching from the door, the statue takes off its boater and gestures for the squirrel to tidy its hair, which it smooths back with its hand. Finally, appearing confident and relaxed and with the old familiar glint in its eyes, the squirrel steps towards the room where the statue stands beneath a tree in the rain. Drenched, the statue returns and sees the squirrel and the bird deep in conversation, then it rattles a bowl in the sink to make its presence known, but the bird and the squirrel don't notice and continue looking into each other's eyes, smiling at each other. The statue gives up, walks in, and takes off its coat. The squirrel glances at the window then returns its unwavering gaze to the bird, whose dark eyes return its gaze adoringly. The squirrel smiles, gets up, and opens the French windows, revealing a bright blue sky peeping through the diminishing rainclouds as sunlight glimmers on the calm bay. They step out onto the porch, rest against a pillar, and their fingers touch as they look at each other. The dog points across the bay before the squirrel walks back inside, and they walk up the drive. The bird looks up in wonder, surrounded by gushing fountains and ornamental palms, they look up at the house. The squirrel looks at the bird, framed by the fountain, and an orange-squeezing machine is there. The bird, the squirrel, and the statue swim on its private beach, and the squirrel dives from a diving pontoon out in the water while the statue films the bird hitting a golf ball. They tumble into the ballroom where the bird marvels at the monumental organ, and the squirrel takes the bird and the statue on a tour. It throws shirts from a balcony, and the bird flops onto the pile of brightly colored shirts on the bed as the statue looks down from the balcony in the opulent bedroom. Noticing the change in the bird's mood, the squirrel goes down to the bed where it sits, strokes its chin, and it looks up at the statue, who walks away somberly as the squirrel kisses its brow. The statue walks down a spiral staircase and looks at a wall and a desk where pictures and trophies are displayed, including a photograph of a distinguished old man. The squirrel sits on its bed, holding the bird close to it, and the bird rests its head in the squirrel's lap and follows its gaze to the window and beyond. The statue walks over, takes a book from a shelf, and opens it, touched, the bird runs its fingers over them. The squirrel goes to the other side of the room to answer the phone, turning its back to the statue and the bird. Outside, a strong swelling breeze whips up on the balcony, blowing the French windows open, which the statue closes and listens to the squirrel."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He nods to Nick and takes a deep breath as Gatsby sneaks furtively into the greenhouse area and peers through the paintings into the room. Watching from the door, Nick takes off his top hat and gestures for Gatsby to tidy his hair, which he smooths back with his hand. Finally, appearing confident and relaxed and with the old familiar glint in his eyes, Gatsby steps towards the room where Nick stands beneath a sunshade in the rain. Drenched, Nick returns and sees Gatsby and Daisy deep in conversation, then he rattles a teapot in the sink to make his presence known, but Daisy and Gatsby don't notice and continue looking into each other's eyes, smiling at each other. Nick gives up, walks in, and takes off his scarf. Gatsby glances at the mirror then returns his unwavering gaze to Daisy, whose light eyes return his gaze adoringly. Gatsby smiles, gets up, and opens the barn doors, revealing a bright blue sky peeping through the diminishing rainclouds as sunlight glimmers on the calm lagoon. They step out onto the terrace, rest against a lamppost, and their fingers touch as they look at each other. He points across the field before Gatsby walks back inside, and they walk up the path. Daisy looks up in wonder, surrounded by gushing waterfalls and ornamental willows, they look up at the barn. Gatsby looks at Daisy, framed by the waterfall, and a coffee-grinding machine is there. Daisy, Gatsby, and Nick sail on his private boat, and Gatsby dives from a floating dock out in the water while Nick films Daisy hitting a croquet ball. They tumble into the gallery where Daisy marvels at the monumental easel, and Gatsby takes Daisy and Nick on a tour. He throws scarves from a balcony, and Daisy flops onto the pile of brightly colored scarves on the bed as Nick looks down from the balcony in the lavish bedroom. Noticing the change in Daisy's mood, Gatsby goes down to the bed where she sits, strokes her cheek, and she looks up at Nick, who walks away somberly as Gatsby kisses her hand. Nick walks down a winding staircase and looks at a shelf and a chair where sketches and medals are displayed, including a photograph of a distinguished old woman. Gatsby sits on his bed, holding Daisy close to him, and Daisy rests her head in Gatsby's lap and follows his gaze to the mirror and beyond. Nick walks over, takes a candle from a shelf, and opens it, touched, Daisy runs her fingers over them. Gatsby goes to the other side of the room to answer the doorbell, turning his back to Nick and Daisy. Outside, a strong swelling breeze whips up on the terrace, blowing the barn doors open, which Nick closes and listens to Gatsby."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He winks at Nick and inhales deeply as Gatsby shuffles quietly into the kitchen area and glances through the flowers into the room. Observing from the door, Nick removes his boater and motions for Gatsby to adjust his hair, which he pats down with his hand. Finally, appearing assured and carefree and with the old familiar twinkle in his eyes, Gatsby strolls towards the room where Nick lounges beneath a tree in the rain. Soaked, Nick ambles back and notices Gatsby and Daisy absorbed in conversation, then he taps a bowl in the sink to make his presence noticed, but Daisy and Gatsby ignore and continue gazing into each other's eyes, grinning at each other. Nick concedes, enters, and removes his coat. Gatsby gazes at the window then redirects his steady gaze to Daisy, whose dark eyes reflect his gaze affectionately. Gatsby grins, stands up, and slides open the French windows, revealing a bright blue sky peeking through the dissipating rainclouds as sunlight sparkles on the tranquil bay. They stroll out onto the porch, lean against a pillar, and their fingertips brush as they gaze at each other. He gestures across the bay before Gatsby heads back inside, and they stroll up the drive. Daisy gazes up in wonder, surrounded by cascading fountains and decorative palms, they gaze up at the house. Gatsby observes Daisy, encircled by the fountain, and an orange-squeezing machine is there. Daisy, Gatsby, and Nick drift on his private beach, and Gatsby leaps from a diving pontoon out in the water while Nick captures Daisy swinging a golf club. They whirl into the ballroom where Daisy admires the grand organ, and Gatsby guides Daisy and Nick on a tour. He flings shirts from a balcony, and Daisy collapses onto the heap of brightly colored shirts on the bed as Nick peers down from the balcony in the lavish bedroom. Noticing the shift in Daisy's mood, Gatsby descends to the bed where she sits, brushes her chin, and she glances up at Nick, who retreats somberly as Gatsby plants a kiss on her brow. Nick descends a spiral staircase and glances at a wall and a desk where pictures and trophies are arranged, including a photograph of a distinguished old man. Gatsby perches on his bed, holding Daisy close to him, and Daisy lays her head in Gatsby's lap and tracks his gaze to the window and beyond. Nick saunters over, picks a book from a shelf, and flips through it, affected, Daisy traces her fingers over them. Gatsby moves to the other side of the room to pick up the phone, turning his back to Nick and Daisy. Outside, a strong swelling breeze stirs up on the balcony, blowing the French windows open, which Nick secures and eavesdrops on Gatsby."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The toaster nods to the mailbox and takes a deep breath as the dolphin sneaks furtively into the classroom area and peers through the candles into the cave. Watching from the bookshelf, the mailbox takes off its helmet and gestures for the dolphin to tidy its feathers, which it smooths back with its fin. Finally, appearing confident and relaxed and with the old familiar glint in its eyes, the dolphin steps towards the cave where the mailbox stands beneath a cloud in the drizzle. Drenched, the mailbox returns and sees the dolphin and the penguin deep in conversation, then it rattles a teacup in the drawer to make its presence known, but the penguin and the dolphin don't notice and continue looking into each other's eyes, smiling at each other. The mailbox gives up, walks in, and takes off its glove. The dolphin glances at the mailbox then returns its unwavering gaze to the penguin, whose dark wings return its gaze adoringly. The dolphin smiles, gets up, and opens the barn doors, revealing a bright green forest peeping through the diminishing mist as moonlight glimmers on the calm pond. They step out onto the meadow, rest against a fence, and their wings touch as they look at each other. The toaster points across the pond before the dolphin walks back inside, and they walk up the path. The penguin looks up in wonder, surrounded by gushing waterfalls and ornamental cacti, they look up at the spaceship. The dolphin looks at the penguin, framed by the waterfall, and a clock-making machine is there. The penguin, the dolphin, and the mailbox sail on its private yacht, and the dolphin dives from a diving board out in the water while the mailbox films the penguin tossing a frisbee. They tumble into the observatory where the penguin marvels at the monumental telescope, and the dolphin takes the penguin and the mailbox on a tour. It throws jackets from a rooftop, and the penguin flops onto the pile of brightly colored jackets on the couch as the mailbox looks down from the rooftop in the opulent hallway. Noticing the change in the penguin's mood, the dolphin goes down to the couch where it sits, strokes its beak, and it looks up at the mailbox, who walks away somberly as the dolphin kisses its shell. The mailbox walks down a spiral tunnel and looks at a curtain and a table where maps and instruments are displayed, including a photograph of a distinguished old tree. The dolphin sits on its couch, holding the penguin close to it, and the penguin rests its head in the dolphin's lap and follows its gaze to the curtain and beyond. The mailbox walks over, takes a plant from a stand, and opens it, touched, the penguin runs its wings over them. The dolphin goes to the other side of the cave to answer the trumpet, turning its back to the mailbox and the penguin. Outside, a strong swelling wind whips up on the rooftop, blowing the barn doors open, which the mailbox closes and listens to the dolphin."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The owl blinks at Alex and lets out a long sigh as Maxwell tiptoes gracefully into the dining area and glances through the curtains into the hallway. Observing from the entrance, Alex removes his cap and signals for Maxwell to fix his collar, which he brushes with his finger. Finally, seeming assured and composed and with the new exhilarating sparkle in his eyes, Maxwell strides towards the hallway where Alex stands atop a hill in the mist. Soaked, Alex departs and notices Maxwell and Nina quietly painting, then he bangs a pot on the stove to make his presence felt, but Nina and Maxwell don't react and continue gazing into each other's eyes, laughing with each other. Alex resigns, enters, and places his jacket away. Maxwell shifts his attention to the ceiling then returns his unwavering smile to Nina, whose hazel eyes reciprocate his smile fondly. Maxwell chuckles, rises, and pushes the sliding doors open, revealing a vivid pink sky peeping through the lingering clouds as moonlight dances on the tranquil river. They step out onto the balcony, lean against a rail, and their knees brush as they gaze at each other. He gestures toward the river before Maxwell steps back inside, and they saunter down the path. Nina looks around in awe, surrounded by rustling trees and decorative statues, they glance up at the mansion. Maxwell glances at Nina, framed by the statue, and a grape-crushing device is present. Nina, Maxwell, and Alex glide on his private yacht, and Maxwell jumps from a diving board out on the sea while Alex captures Nina striking a tennis ball. They dance into the gallery where Nina admires the colossal painting, and Maxwell guides Nina and Alex on an exploration. He tosses scarves from a mezzanine, and Nina collapses onto the heap of flamboyantly patterned scarves on the lounge as Alex peers down from the mezzanine in the lavish suite. Sensing the shift in Nina's demeanor, Maxwell descends to the lounge where she reclines, pats her shoulder, and she glances up at Alex, who retreats pensively as Maxwell brushes her cheek. Alex descends a winding staircase and observes a cabinet and a table where artifacts and medals are showcased, including a portrait of a venerable elder. Maxwell lounges on his sofa, holding Nina near him, and Nina lays her head in Maxwell's lap and follows his glance to the garden and beyond. Alex strolls over, retrieves a journal from a shelf, and flips it open, moved, Nina traces her fingers over them. Maxwell crosses to the opposite side of the suite to answer the intercom, turning his back to Alex and Nina. Outside, a brisk swirling gale stirs on the patio, flinging the sliding doors wide, which Alex secures and eavesdrops on Maxwell."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He tilts his head to Nick and inhales slowly as Gatsby tiptoes secretly into the pantry and glances through the curtains into the hall. Observing from the entryway, Nick removes his visor and signals for Gatsby to straighten his collar, which he pats down with his hand. Finally, appearing assured and at ease with the old familiar sparkle in his eyes, Gatsby strides toward the hall where Nick stands under a lamppost in the drizzle. Soaked, Nick returns and notices Gatsby and Daisy immersed in dialogue, then he bangs a spoon on the counter to announce his presence, but Daisy and Gatsby remain oblivious and keep gazing into each other's eyes, grinning at each other. Nick concedes, steps in, and takes off his jacket. Gatsby glances at the mirror then returns his steady gaze to Daisy, whose bright eyes meet his gaze lovingly. Gatsby grins, rises, and slides open the sliding doors, revealing a vivid blue ocean peeking through the fading clouds as sunlight sparkles on the tranquil pond. They step out onto the terrace, lean against a rail, and their hands brush as they gaze at each other. He gestures across the pond before Gatsby strolls back inside, and they wander up the path. Daisy gazes upward in awe, surrounded by cascading waterfalls and decorative cedars, they gaze up at the villa. Gatsby looks at Daisy, framed by the waterfall, and a popcorn machine is there. Daisy, Gatsby, and Nick paddle on his private lake, and Gatsby splashes from a diving raft out in the water while Nick captures Daisy tossing a frisbee. They stumble into the parlor where Daisy admires the colossal piano, and Gatsby leads Daisy and Nick on a walk-through. He tosses hats from a loft, and Daisy collapses onto the heap of vibrantly hued hats on the couch as Nick gazes down from the loft in the luxurious sitting room. Noticing the shift in Daisy's mood, Gatsby descends to the couch where she perches, pets her cheek, and she gazes up at Nick, who retreats solemnly as Gatsby kisses her forehead. Nick descends a winding staircase and gazes at a painting and a cabinet where awards and plaques are displayed, including a portrait of a venerable old man. Gatsby sits on his couch, cradling Daisy close to him, and Daisy lays her head on Gatsby's lap and follows his glance to the mirror and beyond. Nick ambles over, takes a scroll from a drawer, and unrolls it, moved, Daisy traces her fingers over them. Gatsby moves to the other side of the chamber to pick up the handset, turning his back to Nick and Daisy. Outside, a powerful gusty wind stirs on the porch, swinging the sliding doors open, which Nick shuts and listens to Gatsby."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "She shakes hands with Leo and inhales deeply as Merlin creeps quietly into the attic space and gazes through the clouds into the yard. Observing from the hallway, Leo removes his cap and signals for Merlin to adjust his collar, which he straightens with his paw. Finally, appearing assured and at ease with the old familiar spark in his expression, Merlin ambles towards the yard where Leo waits beneath a lamppost in the fog. Soaked, Leo returns and finds Merlin and Clara deep in discussion, then he jingles a spoon in the mug to announce his presence, but Clara and Merlin don't perceive and continue glancing into each other's faces, grinning at one another. Leo concedes, strides in, and removes his jacket. Merlin glances at the picture then refocuses his steady attention on Clara, whose bright eyes meet his gaze lovingly. Merlin chuckles, rises, and unlocks the sliding doors, revealing a dazzling yellow sun emerging through the fading mist as sunlight shimmers on the tranquil pond. They step onto the patio, lean against a bench, and their shoulders brush as they glance at one another. He gestures across the pond before Merlin ambles back inside, and they stroll up the path. Clara gazes in awe, encircled by cascading waterfalls and decorative willows, they glance up at the mansion. Merlin observes Clara, framed by the waterfall, and a lemon-squeezing apparatus is present. Clara, Merlin, and Leo paddle on his secluded pond, and Merlin plunges from a diving board out in the lagoon while Leo captures Clara throwing a baseball. They dance into the gallery where Clara admires the grand piano, and Merlin guides Clara and Leo on a tour. He tosses ties from a loft, and Clara sprawls onto the heap of vibrantly patterned ties on the couch as Leo watches from the loft in the lavish chamber. Sensing the shift in Clara's demeanor, Merlin walks to the couch where she reclines, pats her shoulder, and she gazes up at Leo, who departs thoughtfully as Merlin kisses her cheek. Leo descends a winding staircase and observes a bookshelf and a shelf where portraits and ribbons are exhibited, including an image of a venerable elderly woman. Merlin relaxes on his couch, cradling Clara near to him, and Clara lays her head in Merlin's lap and trails his gaze to the picture and beyond. Leo strolls over, retrieves a novel from a case, and opens it, moved, Clara traces her fingertips over them. Merlin moves to the opposite side of the chamber to respond to the tablet, turning his back to Leo and Clara. Outside, a powerful gusty wind stirs up on the porch, flinging the sliding doors open, which Leo shuts and listens to Merlin."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Gatsby furtively enters the kitchen, peeking through flowers, with Nick signaling him to fix his hair. Gatsby, now appearing confident, joins Daisy for a deep conversation, unnoticed by Nick who tries to make his presence known. Ignoring Nick, Gatsby and Daisy exchange adoring glances. They step onto the porch as sunlight breaks through rainclouds, their fingers touching. Gatsby points across the bay, then returns inside. Daisy marvels at Gatsby's estate, and they explore the grounds, with a swim and filming on the private beach. In the ballroom, Daisy is fascinated by the organ, and Gatsby showers her with colorful shirts from a balcony, causing her to flop onto them. Noticing a shift in Daisy's mood, Gatsby comforts her, as Nick, somber, departs. Nick examines a wall of pictures and trophies before Daisy rests her head on Gatsby's lap. Gatsby answers a phone call, turning away from Nick and Daisy. A strong breeze blows open the French windows, which Nick closes while listening to Gatsby."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Outside a strong swelling breeze whips up on the balcony blowing the French windows open which Nick closes and listens to Gatsby Gatsby goes to the other side of the room to answer the phone turning his back to Nick and Daisy Daisy runs her fingers over them touched Nick walks over takes a book from a shelf and opens it Gatsby sits on his bed holding Daisy close to him and Daisy rests her head in Gatsby's lap and follows his gaze to the window and beyond Nick walks down a spiral staircase and looks at a wall and a desk where pictures and trophies are displayed including a photograph of a distinguished old man Noticing the change in Daisy's mood Gatsby goes down to the bed where she sits strokes her chin and she looks up at Nick who walks away somberly as Gatsby kisses her brow He throws shirts from a balcony and Daisy flops onto the pile of brightly colored shirts on the bed as Nick looks down from the balcony in the opulent bedroom They tumble into the ballroom where Daisy marvels at the monumental organ and Gatsby takes Daisy and Nick on a tour Gatsby and Nick swim on his private beach and Gatsby dives from a diving pontoon out in the water while Nick films Daisy hitting a golf ball Daisy Gatsby looks at Daisy framed by the fountain and an orangesqueezing machine is there they look up at the house Daisy looks up in wonder surrounded by gushing fountains and ornamental palms He points across the bay before Gatsby walks back inside and they walk up the drive They step out onto the porch rest against a pillar and their fingers touch as they look at each other Gatsby smiles gets up and opens the French windows revealing a bright blue sky peeping through the diminishing rainclouds as sunlight glimmers on the calm bay Gatsby glances at the window then returns his unwavering gaze to Daisy whose dark eyes return his gaze adoringly Nick gives up walks in and takes off his coat then he rattles a bowl in the sink to make his presence known but Daisy and Gatsby do not notice and continue looking into each other's eyes smiling at each other Drenched Nick returns and sees Gatsby and Daisy deep in conversation Finally appearing confident and relaxed and with the old familiar glint in his eyes Gatsby steps towards the room where Nick stands beneath a tree in the rain Watching from the door Nick takes off his boater and gestures for Gatsby to tidy his hair which he smooths back with his hand He nods to Nick and takes a deep breath as Gatsby sneaks furtively into the kitchen area and peers through the flowers into the room"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He throws shirts from a balcony and Daisy flops onto the pile of brightly colored shirts on the bed as Nick looks down from the balcony in the opulent bedroom Gatsby looks at Daisy framed by the fountain and an orangesqueezing machine is there He points across the bay before Gatsby walks back inside and they walk up the drive Gatsby sits on his bed holding Daisy close to him and Daisy rests her head in Gatsby's lap and follows his gaze to the window and beyond Nick walks down a spiral staircase and looks at a wall and a desk where pictures and trophies are displayed including a photograph of a distinguished old man Gatsby glances at the window then returns his unwavering gaze to Daisy whose dark eyes return his gaze adoringly Nick gives up walks in and takes off his coat Daisy looks up in wonder surrounded by gushing fountains and ornamental palms They tumble into the ballroom where Daisy marvels at the monumental organ and Gatsby takes Daisy and Nick on a tour touched they look up at the house Noticing the change in Daisy's mood Gatsby goes down to the bed where she sits strokes her chin and she looks up at Nick who walks away somberly as Gatsby kisses her brow Watching from the door Nick takes off his boater and gestures for Gatsby to tidy his hair which he smooths back with his hand Gatsby and Nick swim on his private beach and Gatsby dives from a diving pontoon out in the water while Nick films Daisy hitting a golf ball Daisy runs her fingers over them Daisy Finally appearing confident and relaxed and with the old familiar glint in his eyes Gatsby steps towards the room where Nick stands beneath a tree in the rain Gatsby goes to the other side of the room to answer the phone turning his back to Nick and Daisy then he rattles a bowl in the sink to make his presence known but Daisy and Gatsby do not notice and continue looking into each other's eyes smiling at each other Outside a strong swelling breeze whips up on the balcony blowing the French windows open which Nick closes and listens to Gatsby Gatsby smiles gets up and opens the French windows revealing a bright blue sky peeping through the diminishing rainclouds as sunlight glimmers on the calm bay They step out onto the porch rest against a pillar and their fingers touch as they look at each other He nods to Nick and takes a deep breath as Gatsby sneaks furtively into the kitchen area and peers through the flowers into the room Drenched Nick returns and sees Gatsby and Daisy deep in conversation Nick walks over takes a book from a shelf and opens it"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Daisy Gatsby and Nick swim on his private beach and Gatsby dives from a diving pontoon out in the water while Nick films Daisy hitting a golf ball They tumble into the ballroom where Daisy marvels at the monumental organ and Gatsby takes Daisy and Nick on a tour He throws shirts from a balcony and Daisy flops onto the pile of brightly colored shirts on the bed as Nick looks down from the balcony in the opulent bedroom Noticing the change in Daisy's mood Gatsby goes down to the bed where she sits strokes her chin and she looks up at Nick who walks away somberly as Gatsby kisses her brow Nick walks down a spiral staircase and looks at a wall and a desk where pictures and trophies are displayed including a photograph of a distinguished old man Gatsby sits on his bed holding Daisy close to him and Daisy rests her head in Gatsby's lap and follows his gaze to the window and beyond Nick walks over takes a book from a shelf and opens it touched Daisy runs her fingers over them Gatsby goes to the other side of the room to answer the phone turning his back to Nick and Daisy Outside a strong swelling breeze whips up on the balcony blowing the French windows open which Nick closes and listens to Gatsby He nods to Nick and takes a deep breath as Gatsby sneaks furtively into the kitchen area and peers through the flowers into the room Watching from the door Nick takes off his boater and gestures for Gatsby to tidy his hair which he smooths back with his hand Finally appearing confident and relaxed and with the old familiar glint in his eyes Gatsby steps towards the room where Nick stands beneath a tree in the rain Drenched Nick returns and sees Gatsby and Daisy deep in conversation then he rattles a bowl in the sink to make his presence known but Daisy and Gatsby do not notice and continue looking into each other's eyes smiling at each other Nick gives up walks in and takes off his coat Gatsby glances at the window then returns his unwavering gaze to Daisy whose dark eyes return his gaze adoringly Gatsby smiles gets up and opens the French windows revealing a bright blue sky peeping through the diminishing rainclouds as sunlight glimmers on the calm bay They step out onto the porch rest against a pillar and their fingers touch as they look at each other He points across the bay before Gatsby walks back inside and they walk up the drive Daisy looks up in wonder surrounded by gushing fountains and ornamental palms they look up at the house Gatsby looks at Daisy framed by the fountain and an orangesqueezing machine is there"
        }
      ]
    }
  ]
}