{
  "ground_truth": "As she sits for a portrait wearing formal robes of state, the Queen's attention is drawn by television news coverage of Tony Blair, who is dressed in a lounge suit with no jacket, smiling towards a cheering crowd. Crawford continues his oil painting, and the Queen smiles at him while seated for the portrait half in profile, wearing a white embroidered dress and a black velvet cloak ornamented with the star and shield of St. George's Cross. As she turns her head from the artist's formal pose, her expression barely changes. A lone pipo walks along a long colonnade at Buckingham Palace, with the royal standard flag gently ruffling in the gray skies above. The Queen lies in bed in a darkened room as a door opens behind her, and a woman enters to put a newspaper on a bedside table. The Queen looks at the paper. Later, the Queen sits at a desk with some corgis behind her as Robin enters. A black Jaguar car pulls to a stop in the palace courtyard, where a man in black coattails opens the rear door for Tony and Cherie Blair, who sit inside the car. The Blairs are ushered through a vast ornate hall by a man in a naval uniform, who smirks at Tony as he leads them toward an imposing set of closed doors. Cherie takes a seat by the doors as Tony is ushered into the room. The two men bow their heads to the Queen, standing in the middle of the room, and Tony shakes her hand. Tony waits for the Queen to be seated before sitting down opposite her. Cherie and the equerry are perched on chairs either side of the grand doors, and they both stand when Tony kneels at the Queen's gesture. The Queen extends her right hand to Tony, who takes it and kisses it. The Queen gestures for Tony to stand and picks up a small bell, and the equerry reenters with Cherie following behind him. Cherie curtsies before The Queen, who looks down and smiles at her, then Cherie shakes The Queen's hand. The Queen walks over to Robin and also shakes Cherie's and Tony's hands. Tony and Cherie back out of the room awkwardly while the Queen looks them up and down as they depart. On leaving, Tony and Cherie smile at the staff. A photo shows Diana and Dodi lounging, another shows Diana sitting alone on a diving board, and video footage shows Diana getting onto a small jet plane. Numerous television reporters are gathered in front of a hotel opposite an entrance with a revolving door, while a group of men on motorbikes wait by the back door.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "As she perches for a likeness wearing formal garments of rank, the Monarch's focus is captured by television news broadcast of Tony Blair, who is attired in a lounge attire with no jacket, grinning toward a cheering throng. Crawford persists his oil depiction, and the Monarch grins at him while seated for the likeness half in silhouette, wearing a white adorned gown and a black velvet mantle ornamented with the star and shield of St. George's Cross. As she turns her head from the artist's formal expression, her visage scarcely alters. A solitary figure walks along a long arcade at Buckingham Palace, with the royal standard banner softly ruffling in the gray heavens above. The Monarch reclines in bed in a dim room as a portal opens behind her, and a woman enters to set a newspaper on a bedside stand. The Monarch gazes at the paper. Later, the Monarch perches at a bureau with some corgis behind her as Robin enters. A black Jaguar vehicle pulls to a halt in the palace courtyard, where a man in black coattails opens the rear portal for Tony and Cherie Blair, who sit inside the vehicle. The Blairs are escorted through a vast ornate chamber by a man in a naval attire, who smirks at Tony as he guides them toward an imposing set of closed portals. Cherie takes a seat by the portals as Tony is ushered into the chamber. The two men incline their heads to the Monarch, standing in the center of the chamber, and Tony shakes her hand. Tony waits for the Monarch to be seated before sitting down opposite her. Cherie and the equerry are perched on seats either side of the grand portals, and they both stand when Tony kneels at the Monarch's indication. The Monarch extends her right hand to Tony, who takes it and kisses it. The Monarch signals for Tony to stand and picks up a small chime, and the equerry reenters with Cherie trailing behind him. Cherie curtsies before The Monarch, who looks down and grins at her, then Cherie shakes The Monarch's hand. The Monarch walks over to Robin and also shakes Cherie's and Tony's hands. Tony and Cherie back out of the chamber awkwardly while the Monarch surveys them up and down as they exit. On departing, Tony and Cherie smile at the personnel. A photograph shows Diana and Dodi lounging, another shows Diana sitting alone on a springboard, and video footage shows Diana boarding a small jet airplane. Numerous television correspondents are assembled in front of a hotel opposite an ingress with a revolving entryway, while a cluster of men on motorbikes await by the rear entryway."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "As she is seated for a portrait wearing formal robes of state, television news coverage of Tony Blair, who is dressed in a lounge suit with no jacket, smiling towards a cheering crowd, draws the Queen's attention. The oil painting is continued by Crawford, and the Queen is smiled at by him while she is seated for the portrait half in profile, wearing a white embroidered dress and a black velvet cloak ornamented with the star and shield of St. George's Cross. As the Queen turns her head from the artist's formal pose, her expression is barely changed. Along a long colonnade at Buckingham Palace, a lone piper walks, with the royal standard flag being gently ruffled in the gray skies above. The Queen is lying in bed in a darkened room as a door is opened behind her, and a woman enters to put a newspaper on a bedside table. The paper is looked at by the Queen. Later, at a desk with some corgis behind her, the Queen is seated as Robin enters. A black Jaguar car is pulled to a stop in the palace courtyard, and the rear door is opened by a man in black coattails for Tony and Cherie Blair, who are sitting inside the car. A vast ornate hall is ushered through by the Blairs, led by a man in a naval uniform who smirks at Tony as he leads them toward an imposing set of closed doors. By the doors, a seat is taken by Cherie as Tony is ushered into the room. The Queen, standing in the middle of the room, is bowed to by the two men, and her hand is shaken by Tony. The Queen is waited for by Tony to be seated before he sits down opposite her. Either side of the grand doors, Cherie and the equerry are perched on chairs, and they both stand when the Queen's gesture prompts Tony to kneel. To Tony, the Queen extends her right hand, which is taken and kissed by him. Tony is gestured by the Queen to stand, and a small bell is picked up by her, and the equerry reenters with Cherie following behind him. Cherie curtsies before the Queen, who looks down and smiles at her, then Cherie shakes the Queen's hand. The Queen walks over to Robin and also shakes Cherie's and Tony's hands. The room is backed out of awkwardly by Tony and Cherie while the Queen looks them up and down as they depart. On leaving, the staff is smiled at by Tony and Cherie. A photo shows Diana and Dodi lounging, another shows Diana sitting alone on a diving board, and video footage captures Diana getting onto a small jet plane. Numerous television reporters gather in front of a hotel opposite an entrance with a revolving door, while by the back door, a group of men waits on motorbikes."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "As she sits for a portrait in formal state robes, the Queen's attention shifts to TV news of Tony Blair, in a lounge suit without a jacket, smiling at a cheering crowd. Crawford continues his oil painting as the Queen, half in profile, smiles in a white embroidered dress and black velvet cloak with St. George's Cross. Her expression barely changes as she turns from the artist's pose. A lone piper walks along Buckingham Palace's colonnade, with the royal standard flag fluttering in the gray sky. The Queen lies in bed in a dark room as a woman enters to place a newspaper on the bedside table. Later, the Queen sits at a desk with corgis behind her as Robin enters. A black Jaguar stops in the palace courtyard, and a man in coattails opens the door for Tony and Cherie Blair. They are led through an ornate hall by a man in a naval uniform, who smirks at Tony, toward closed doors. Cherie sits by the doors as Tony enters. The men bow to the Queen, standing in the room, and Tony shakes her hand. Tony waits for the Queen to sit before sitting opposite her. Cherie and the equerry stand when Tony kneels at the Queen's gesture. The Queen extends her hand to Tony, who kisses it. She gestures for him to stand, picks up a bell, and the equerry reenters with Cherie. Cherie curtsies, shakes the Queen's hand, and the Queen shakes hands with Robin, Cherie, and Tony. The Blairs awkwardly back out while the Queen observes them. Tony and Cherie smile at the staff as they leave. A photo shows Diana and Dodi lounging, another shows Diana on a diving board, and video footage shows Diana boarding a small jet. Reporters gather in front of a hotel with a revolving door, while men on motorbikes wait by the back door."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "As she poses for a portrait in formal robes, the Queen watches TV news of Tony Blair in a lounge suit, smiling at a crowd. Crawford paints her in a white dress and black cloak with St. George's Cross. A lone pipo walks at Buckingham Palace under gray skies. In a dark room, the Queen sees a newspaper placed on her bedside table. Later, she sits at a desk with corgis as Robin enters. A black Jaguar arrives at the palace, and a man in coattails opens the door for Tony and Cherie Blair. They are led through a hall by a naval officer who smirks at Tony. Cherie sits by closed doors as Tony enters and bows to the Queen. Tony waits for the Queen to sit before joining her. Cherie and the equerry stand when Tony kneels at the Queen's gesture. Tony kisses her hand, and she signals him to stand. The equerry and Cherie reenter, and Cherie curtsies and shakes the Queen's hand. The Queen shakes hands with Robin, Cherie, and Tony, who awkwardly back out, smiling at the staff. Photos show Diana and Dodi lounging, Diana on a diving board, and video of Diana boarding a jet. Reporters gather at a hotel, and men on motorbikes wait by the back door."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As she gracefully sits for a portrait, adorned in the formal robes of state, the Queen's attention is momentarily captured by the television news coverage. The screen displays Tony Blair, who is casually dressed in a lounge suit without a jacket, smiling broadly at a cheering crowd. Meanwhile, Crawford diligently continues his work on the oil painting, capturing the Queen's likeness. She offers him a gentle smile while seated for the portrait, her pose half in profile. She is elegantly dressed in a white embroidered dress, complemented by a black velvet cloak adorned with the star and shield of St. George's Cross. As she subtly turns her head away from the artist's formal pose, her expression remains almost unchanged, maintaining her regal composure. \n\nOutside, a lone pipo makes its way along the extensive colonnade at Buckingham Palace, with the royal standard flag gently fluttering in the gray skies above. In a darkened room, the Queen lies in bed as a door quietly opens behind her, and a woman enters to place a newspaper on the bedside table. The Queen glances at the paper with interest. Later, she is seated at a desk, with some of her beloved corgis resting behind her, as Robin enters the room. \n\nA sleek black Jaguar car comes to a halt in the palace courtyard, where a man dressed in black coattails opens the rear door for Tony and Cherie Blair, who are seated inside. The Blairs are then guided through a vast, ornate hall by a man in a naval uniform, who smirks subtly at Tony as he leads them toward an imposing set of closed doors. Cherie takes a seat by the doors as Tony is ushered into the room. The two men respectfully bow their heads to the Queen, who stands regally in the center of the room, and Tony proceeds to shake her hand. He waits patiently for the Queen to be seated before taking his place opposite her. \n\nCherie and the equerry are perched on chairs on either side of the grand doors, and they both rise when Tony kneels at the Queen's gesture. The Queen extends her right hand to Tony, who takes it with reverence and kisses it. She then gestures for Tony to stand and picks up a small bell, signaling the equerry to reenter with Cherie following closely behind him. Cherie curtsies respectfully before the Queen, who looks down with a warm smile, and then Cherie shakes the Queen's hand. The Queen moves over to Robin and also shakes hands with both Cherie and Tony. As Tony and Cherie awkwardly back out of the room, the Queen observes them with a discerning gaze as they depart. Upon leaving, Tony and Cherie offer friendly smiles to the staff. \n\nA photograph captures Diana and Dodi lounging together, while another shows Diana sitting alone on a diving board. Video footage reveals Diana boarding a small jet plane. Meanwhile, numerous television reporters have gathered in front of a hotel, positioned opposite an entrance with a revolving door, while a group of men on motorbikes waits by the back door, ready for any developments."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As she gracefully settles herself to have a portrait created, adorned in the splendid formal robes of state, the Queen's attention is momentarily captured by the television news coverage playing quietly in the background. The screen prominently displays Tony Blair, who is casually dressed in a lounge suit, notably without a jacket, smiling broadly at a cheering crowd that surrounds him. Meanwhile, Crawford diligently continues his meticulous work on the oil painting, skillfully capturing the Queen's likeness with each brush stroke. She offers him a gentle and warm smile while seated for the portrait, her pose elegantly poised half in profile. She is elegantly dressed in a beautifully embroidered white dress, complemented by a striking black velvet cloak that is adorned with the star and shield of the esteemed St. George's Cross. As she subtly turns her head slightly away from the artist's formal pose, her expression remains almost unchanged, maintaining her regal composure with ease.\n\nOutside the palace, a lone pipo makes its slow and steady way along the extensive colonnade at Buckingham Palace, with the royal standard flag gently fluttering in the gray skies above. In a darkened room, the Queen lies comfortably in bed as a door quietly opens behind her, and a woman enters the room to carefully place a newspaper on the nearby bedside table. The Queen glances at the paper with keen interest. Later on, she is seated at a desk, with some of her beloved corgis resting behind her, as Robin quietly enters the room.\n\nA sleek black Jaguar car comes to a graceful halt in the expansive palace courtyard, where a man dressed smartly in black coattails steps forward to open the rear door for Tony and Cherie Blair, who are seated inside the luxurious vehicle. The Blairs are then guided through a vast and ornate hall by a man in a distinguished naval uniform, who smirks subtly at Tony as he leads them toward an imposing set of closed doors. Cherie takes a seat by the doors as Tony is ushered into the room. The two men respectfully bow their heads in deference to the Queen, who stands regally in the center of the room, and Tony proceeds to shake her hand with respect. He waits patiently for the Queen to be seated before taking his place opposite her.\n\nCherie and the equerry are perched on chairs on either side of the grand doors, and they both rise when Tony kneels at the Queen's subtle gesture. The Queen extends her right hand to Tony, who takes it with reverence and kisses it. She then gestures for Tony to stand and picks up a small bell, signaling the equerry to reenter the room with Cherie following closely behind him. Cherie curtsies respectfully before the Queen, who looks down with a warm and gracious smile, and then Cherie proceeds to shake the Queen's hand. The Queen moves over to Robin and also shakes hands with both Cherie and Tony. As Tony and Cherie awkwardly back out of the room, the Queen observes them with a discerning gaze as they make their departure. Upon leaving, Tony and Cherie offer friendly and appreciative smiles to the staff around them.\n\nA photograph captures Diana and Dodi lounging together in a moment of relaxation, while another image shows Diana sitting alone on a diving board in contemplation. Video footage reveals Diana boarding a small jet plane with poise and grace. Meanwhile, numerous television reporters have gathered in front of a bustling hotel, positioned strategically opposite an entrance with a revolving door, while a group of men on motorbikes waits vigilantly by the back door, ready for any developments that may unfold."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As she settles into her seat for a portrait session, the Queen, adorned in her formal robes of state, finds her attention momentarily captured by the television news coverage. On the screen, Tony Blair appears, casually dressed in a lounge suit without a jacket, smiling broadly at a cheering crowd. Meanwhile, Crawford diligently continues his work on the oil painting, capturing the Queen's likeness as she sits half in profile, wearing a white embroidered dress complemented by a black velvet cloak adorned with the star and shield of St. George's Cross. As she subtly shifts her head away from the artist's formal pose, her expression remains largely unchanged. Outside, a lone pipo makes its way along the long colonnade at Buckingham Palace, with the royal standard flag gently fluttering against the backdrop of gray skies. Later, the Queen is seen lying in bed in a dimly lit room when a door quietly opens behind her, allowing a woman to enter and place a newspaper on the bedside table. The Queen glances at the paper, taking in its contents. Subsequently, she is seated at a desk, with her corgis lounging behind her, as Robin enters the room. In the palace courtyard, a sleek black Jaguar car comes to a halt, and a man in black coattails steps forward to open the rear door for Tony and Cherie Blair, who are seated inside. The Blairs are then guided through a vast, ornate hall by a man in a naval uniform, who casts a smirk at Tony while leading them toward an imposing set of closed doors. Cherie takes a seat by the doors as Tony is ushered into the room. Inside, the two men bow their heads to the Queen, who stands regally in the center of the room, and Tony proceeds to shake her hand. He waits respectfully for the Queen to be seated before taking his place opposite her. Meanwhile, Cherie and the equerry are perched on chairs flanking the grand doors, and they both rise when Tony kneels at the Queen's gesture. The Queen extends her right hand to Tony, who takes it and places a respectful kiss upon it. She then gestures for Tony to stand and picks up a small bell, prompting the equerry to reenter with Cherie following closely behind. Cherie performs a curtsy before the Queen, who looks down with a smile, and then Cherie shakes the Queen's hand. The Queen moves over to Robin and proceeds to shake hands with both Cherie and Tony. As Tony and Cherie awkwardly back out of the room, the Queen observes them with a discerning gaze. Upon their departure, Tony and Cherie offer smiles to the staff. Meanwhile, a photo captures Diana and Dodi lounging together, another shows Diana sitting alone on a diving board, and video footage depicts Diana boarding a small jet plane. Outside a hotel, numerous television reporters gather in front of an entrance with a revolving door, while a group of men on motorbikes waits by the back door."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As the Queen sits for a portrait in her formal robes, her attention shifts to a television broadcast of Tony Blair, casually dressed and smiling at a cheering crowd. While Crawford continues his oil painting, the Queen maintains a composed expression, wearing a white embroidered dress and a black velvet cloak adorned with the star and shield of St. George's Cross. Meanwhile, a lone pipo walks along Buckingham Palace's colonnade under gray skies, with the royal standard flag fluttering above. In a darkened room, the Queen lies in bed as a woman enters to place a newspaper on her bedside table, which she glances at. Later, seated at her desk with corgis nearby, the Queen is joined by Robin. A black Jaguar arrives in the palace courtyard, and a man in black coattails opens the door for Tony and Cherie Blair. They are escorted through an ornate hall by a naval officer who smirks at Tony, leading them to a grand set of doors. Cherie waits by the doors as Tony enters the room, where he and another man bow to the Queen before Tony shakes her hand. After the Queen is seated, Tony follows suit. Cherie and the equerry stand when Tony kneels at the Queen's gesture, and she extends her hand for him to kiss. The Queen signals Tony to stand, rings a small bell, and the equerry returns with Cherie. Cherie curtsies and shakes the Queen's hand, who then greets Robin, Cherie, and Tony. The Blairs awkwardly back out of the room, smiling at the staff as they leave. Photographs show Diana and Dodi lounging, Diana alone on a diving board, and video footage captures Diana boarding a small jet. Outside a hotel, numerous reporters gather near the entrance, while men on motorbikes wait by the back door."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "As she sits for a portrait wearing formal robes of state, an attire rich in tradition and symbolism, the Queen's attention is drawn by television news coverage of Tony Blair, the former Prime Minister of the United Kingdom known for his leadership during the late 1990s and early 2000s, who is dressed in a lounge suit with no jacket, a style often chosen for its blend of formality and comfort, smiling towards a cheering crowd. Crawford, a renowned portrait artist famous for capturing notable figures, continues his oil painting, and the Queen smiles at him while seated for the portrait half in profile, wearing a white embroidered dress and a black velvet cloak ornamented with the star and shield of St. George's Cross, a symbol of England used in various royal decorations. As she turns her head from the artist's formal pose, her expression barely changes, maintaining the regal composure expected of a monarch. A lone pipo, a royal servant responsible for discreet assistance, walks along a long colonnade at Buckingham Palace, a historic residence in London serving as the administrative headquarters of the monarch, with the royal standard flag, indicating the sovereign is present, gently ruffling in the gray skies above. The Queen lies in bed in a darkened room as a door opens behind her, and a woman enters to put a newspaper, likely the latest edition containing important national and international developments, on a bedside table. The Queen looks at the paper, her face calm and steady. Later, the Queen sits at a desk with some corgis, her favored breed known for their loyalty and intelligence, behind her as Robin enters. A black Jaguar car, a luxury vehicle often associated with British elegance, pulls to a stop in the palace courtyard, where a man in black coattails, a traditional formal attire for ceremonial occasions, opens the rear door for Tony and Cherie Blair, who sit inside the car. The Blairs are ushered through a vast ornate hall, reflecting the grandeur of British royal architecture, by a man in a naval uniform, an officer in the Royal Navy responsible for ceremonial duties, who smirks at Tony as he leads them toward an imposing set of closed doors. Cherie takes a seat by the doors as Tony is ushered into the room. The two men bow their heads to the Queen, standing in the middle of the room, a gesture of respect and deference. Tony shakes her hand, a formal greeting marking the beginning of their meeting. Tony waits for the Queen to be seated before sitting down opposite her, observing the proper protocol. Cherie and the equerry, an officer of the royal household attending the Queen, are perched on chairs either side of the grand doors, and they both stand when Tony kneels at the Queen's gesture, a sign of respect and submission. The Queen extends her right hand to Tony, who takes it and kisses it, a traditional gesture of homage. The Queen gestures for Tony to stand and picks up a small bell, summoning assistance, and the equerry reenters with Cherie following behind him. Cherie curtsies before The Queen, who looks down and smiles at her, then Cherie shakes The Queen's hand. The Queen walks over to Robin and also shakes Cherie's and Tony's hands. Tony and Cherie back out of the room awkwardly while the Queen looks them up and down as they depart, a customary royal departure to show respect. On leaving, Tony and Cherie smile at the staff, acknowledging their service. A photo shows Diana and Dodi lounging, capturing a moment of leisure before their tragic accident in 1997, another shows Diana sitting alone on a diving board, a poignant image reflecting her introspection, and video footage shows Diana getting onto a small jet plane, marking her travels often followed by the press. Numerous television reporters are gathered in front of a hotel opposite an entrance with a revolving door, a hubbub of media activity chasing headlines, while a group of men on motorbikes, likely paparazzi, wait by the back door, poised to capture exclusive shots."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "As she sits for a portrait wearing formal robes of state the Queen's attention is drawn by television news coverage of Tony Blair who is dressed in a lounge suit with no jacket smiling towards a cheering crowd  Crawford continues his oil painting and the Queen smiles at him while seated for the portrait half in profile wearing a white embroidered dress and a black velvet cloak ornamented with the star and shield of St George's Cross  As she turns her head from the artist's formal pose her expression barely changes  Cherie takes a seat by the doors as Tony is ushered into the room  The two men bow their heads to the Queen standing in the middle of the room and Tony shakes her hand  Tony waits for the Queen to be seated before sitting down opposite her  Cherie and the equerry are perched on chairs either side of the grand doors and they both stand when Tony kneels at the Queen's gesture  The Queen extends her right hand to Tony who takes it and kisses it  The Queen gestures for Tony to stand and picks up a small bell and the equerry reenters with Cherie following behind him  Cherie curtsies before The Queen who looks down and smiles at her  then Cherie shakes The Queen's hand  The Queen walks over to Robin and also shakes Cherie's and Tony's hands  Tony and Cherie back out of the room awkwardly while the Queen looks them up and down as they depart  On leaving Tony and Cherie smile at the staff  A photo shows Diana and Dodi lounging  A lone pipo walks along a long colonnade at Buckingham Palace with the royal standard flag gently ruffling in the gray skies above  The Queen lies in bed in a darkened room as a door opens behind her and a woman enters to put a newspaper on a bedside table  The Queen looks at the paper  Later the Queen sits at a desk with some corgis behind her as Robin enters  A black Jaguar car pulls to a stop in the palace courtyard where a man in black coattails opens the rear door for Tony and Cherie  Blair who sit inside the car  The Blairs are ushered through a vast ornate hall by a man in a naval uniform who smirks at Tony as he leads them toward an imposing set of closed doors  Cherie takes a seat by the doors as Tony is ushered into the room  The two men bow their heads to the Queen standing in the middle of the room and Tony shakes her hand  Tony waits for the Queen to be seated before sitting down opposite her  Cherie and the equerry are perched on chairs either side of the grand doors and they both stand when Tony kneels at the Queen's gesture  The Queen extends her right hand to Tony who takes it and kisses it  The Queen gestures for Tony to stand and picks up a small bell and the equerry reenters with Cherie following behind him  Cherie curtsies before The Queen who looks down and smiles at her  then Cherie shakes The Queen's hand  The Queen walks over to Robin and also shakes Cherie's and Tony's hands  Tony and Cherie back out of the room awkwardly while the Queen looks them up and down as they depart  On leaving Tony and Cherie smile at the staff  A photo shows Diana and Dodi lounging  another shows Diana sitting alone on a diving board and video footage shows Diana getting onto a small jet plane  Numerous television reporters are gathered in front of a hotel opposite an entrance with a revolving door while a group of men on motorbikes wait by the back door"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "As she sits for a portrait wearing formal robes of state the Queen's attention is drawn by television news coverage of Tony Blair who is dressed in a lounge suit with no jacket smiling towards a cheering crowd. Crawford continues his oil painting and the Queen smiles at him while seated for the portrait half in profile wearing a white embroidered dress and a black velvet cloak ornamented with the star and shield of St George's Cross. As she turns her head from the artist's formal pose her expression barely changes. A lone pipo walks along a long colonnade at Buckingham Palace with the royal standard flag gently ruffling in the gray skies above. The Queen lies in bed in a darkened room as a door opens behind her and a woman enters to put a newspaper on a bedside table. The Queen looks at the paper. Later the Queen sits at a desk with some corgis behind her as Robin enters. A black Jaguar car pulls to a stop in the palace courtyard where a man in black coattails opens the rear door for Tony and Cherie. Blair who sit inside the car. The Blairs are ushered through a vast ornate hall by a man in a naval uniform who smirks at Tony as he leads them toward an imposing set of closed doors. Cherie takes a seat by the doors as Tony is ushered into the room. The two men bow their heads to the Queen standing in the middle of the room and Tony shakes her hand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Tony waits for the Queen to be seated before sitting down opposite her. Cherie and the equerry are perched on chairs either side of the grand doors and they both stand when Tony kneels at the Queen's gesture. The Queen extends her right hand to Tony who takes it and kisses it. The Queen gestures for Tony to stand and picks up a small bell and the equerry reenters with Cherie following behind him. Cherie curtsies before The Queen who looks down and smiles at her. then Cherie shakes The Queen's hand. The Queen walks over to Robin and also shakes Cherie's and Tony's hands. Tony and Cherie back out of the room awkwardly while the Queen looks them up and down as they depart. On leaving Tony and Cherie smile at the staff. A photo shows Diana and Dodi lounging. another shows Diana sitting alone on a diving board and video footage shows Diana getting onto a small jet plane. Numerous television reporters are gathered in front of a hotel opposite an entrance with a revolving door while a group of men on motorbikes wait by the back door."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "As she sits for a portrait wearing formal robes of state the Queen's attention is drawn by television news coverage of Tony Blair who is dressed in a lounge suit with no jacket smiling towards a cheering crowd. Crawford continues his oil painting and the Queen smiles at him while seated for the portrait half in profile wearing a white embroidered dress and a black velvet cloak ornamented with the star and shield of St George's Cross. As she turns her head from the artist's formal pose her expression barely changes. A lone pipo walks along a long colonnade at Buckingham Palace with the royal standard flag gently ruffling in the gray skies above. The Queen lies in bed in a darkened room as a door opens behind her and a woman enters to put a newspaper on a bedside table. The Queen looks at the paper. Later the Queen sits at a desk with some corgis behind her as Robin enters. A black Jaguar car pulls to a stop in the palace courtyard where a man in black coattails opens the rear door for Tony and Cherie. Blair who sit inside the car. The Blairs are ushered through a vast ornate hall by a man in a naval uniform who smirks at Tony as he leads them toward an imposing set of closed doors. Cherie takes a seat by the doors as Tony is ushered into the room. The two men bow their heads to the Queen standing in the middle of the room and Tony shakes her hand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Tony waits for the Queen to be seated before sitting down opposite her. Cherie and the equerry are perched on chairs either side of the grand doors and they both stand when Tony kneels at the Queen's gesture. The Queen extends her right hand to Tony who takes it and kisses it. The Queen gestures for Tony to stand and picks up a small bell and the equerry reenters with Cherie following behind him. Cherie curtsies before The Queen who looks down and smiles at her. then Cherie shakes The Queen's hand. The Queen walks over to Robin and also shakes Cherie's and Tony's hands. Tony and Cherie back out of the room awkwardly while the Queen looks them up and down as they depart. On leaving Tony and Cherie smile at the staff. A photo shows Diana and Dodi lounging. another shows Diana sitting alone on a diving board and video footage shows Diana getting onto a small jet plane. Numerous television reporters are gathered in front of a hotel opposite an entrance with a revolving door while a group of men on motorbikes wait by the back door."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "As she sits for a portrait wearing formal robes of state the Queen's attention is drawn by television news coverage of Tony Blair who is dressed in a lounge suit with no jacket smiling towards a cheering crowd. Crawford continues his oil painting and the Queen smiles at him while seated for the portrait half in profile wearing a white embroidered dress and a black velvet cloak ornamented with the star and shield of St George's Cross. As she turns her head from the artist's formal pose her expression barely changes. A lone pipo walks along a long colonnade at Buckingham Palace with the royal standard flag gently ruffling in the gray skies above. The Queen lies in bed in a darkened room as a door opens behind her and a woman enters to put a newspaper on a bedside table. The Queen looks at the paper. The Queen walks over to Robin and also shakes Cherie's and Tony's hands. Tony and Cherie back out of the room awkwardly while the Queen looks them up and down as they depart. On leaving Tony and Cherie smile at the staff. A photo shows Diana and Dodi lounging. another shows Diana sitting alone on a diving board and video footage shows Diana getting onto a small jet plane. Numerous television reporters are gathered in front of a hotel opposite an entrance with a revolving door while a group of men on motorbikes wait by the back door."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "As she sits for a portrait wearing formal robes of state the Queen's attention is drawn by television news coverage of Tony Blair who is dressed in a lounge suit with no jacket smiling towards a cheering crowd. Crawford continues his oil painting and the Queen smiles at him while seated for the portrait half in profile wearing a white embroidered dress and a black velvet cloak ornamented with the star and shield of St George's Cross. As she turns her head from the artist's formal pose her expression barely changes. another shows Diana sitting alone on a diving board and video footage shows Diana getting onto a small jet plane. Numerous television reporters are gathered in front of a hotel opposite an entrance with a revolving door while a group of men on motorbikes wait by the back door."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "As a penguin sits for a portrait wearing formal robes of state, the King’s attention is drawn by television news coverage of a meerkat, who is dressed in a lounge suit with no jacket, smiling towards a cheering crowd. A parrot continues its oil painting, and the penguin smiles at it while seated for the portrait half in profile, wearing a white embroidered dress and a black velvet cloak ornamented with the star and shield of St. George's Cross. As the penguin turns its head from the artist's formal pose, its expression barely changes. A lone pipo walks along a long colonnade at Buckingham Palace, with the royal standard flag gently ruffling in the gray skies above. The penguin lies in bed in a darkened room as a door opens behind it, and a squirrel enters to put a newspaper on a bedside table. The penguin looks at the paper. Later, the penguin sits at a desk with some corgis behind it as a cat enters. A black Jaguar car pulls to a stop in the palace courtyard, where a dolphin in black coattails opens the rear door for a rabbit and a kangaroo, who sit inside the car. The kangaroo and rabbit are ushered through a vast ornate hall by a giraffe in a naval uniform, who smirks at the meerkat as it leads them toward an imposing set of closed doors. The kangaroo takes a seat by the doors as the meerkat is ushered into the room. The two zebras bow their heads to the penguin, standing in the middle of the room, and the meerkat shakes its hand. The meerkat waits for the penguin to be seated before sitting down opposite it. The kangaroo and the equerry are perched on chairs either side of the grand doors, and they both stand when the meerkat kneels at the penguin's gesture. The penguin extends its right hand to the meerkat, who takes it and kisses it. The penguin gestures for the meerkat to stand and picks up a small bell, and the equerry reenters with the kangaroo following behind it. The kangaroo curtsies before the penguin, who looks down and smiles at it, then the kangaroo shakes the penguin's hand. The penguin walks over to the cat and also shakes the kangaroo's and meerkat's hands. The meerkat and kangaroo back out of the room awkwardly while the penguin looks them up and down as they depart. On leaving, the meerkat and kangaroo smile at the staff. A photo shows a lion and a tortoise lounging, another shows a lion sitting alone on a diving board, and video footage shows a lion getting onto a small jet plane. Numerous television reporters are gathered in front of a hotel opposite an entrance with a revolving door, while a group of pandas on motorbikes wait by the back door."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "As she sits for a portrait wearing ceremonial raincoats of state, the Queen's attention is drawn by radio news coverage of Tony Blair, who is dressed in a tracksuit with no sweater, smiling towards a cheering congregation. Crawford continues his watercolor painting, and the Queen smiles at him while seated for the portrait half in profile, wearing a crimson silk gown and a navy wool shawl ornamented with the moon and crescent of St. Michael's Cross. As she turns her head from the artist's formal pose, her expression barely changes. A lone sparrow flutters along a narrow boardwalk at Buckingham Palace, with the royal standard kite gently ruffling in the gray skies above. The Queen lies in bed in a dimly lit room as a window opens behind her, and a woman enters to put a magazine on a bedside chair. The Queen looks at the magazine. Later, the Queen sits at a table with some terriers behind her as Robin enters. A silver Bentley car pulls to a stop in the palace garden, where a man in black overalls opens the rear door for Tony and Cherie Blair, who sit inside the car. The Blairs are ushered through a vast ornate atrium by a man in a pilot's uniform, who smirks at Tony as he leads them toward an imposing set of open windows. Cherie takes a seat by the windows as Tony is ushered into the room. The two men bow their heads to the Queen, standing in the middle of the room, and Tony shakes her foot. Tony waits for the Queen to be seated before sitting down opposite her. Cherie and the equerry are perched on benches either side of the grand windows, and they both stand when Tony kneels at the Queen's gesture. The Queen extends her right hand to Tony, who takes it and kisses it. The Queen gestures for Tony to stand and picks up a small drum, and the equerry reenters with Cherie following behind him. Cherie curtsies before The Queen, who looks down and smiles at her, then Cherie shakes The Queen's hat. The Queen walks over to Robin and also shakes Cherie's and Tony's hats. Tony and Cherie back out of the room awkwardly while the Queen looks them up and down as they depart. On leaving, Tony and Cherie smile at the gardeners. A photo shows Diana and Dodi picnicking, another shows Diana sitting alone on a tree branch, and video footage shows Diana getting onto a small sailboat. Numerous radio commentators are gathered in front of a mansion opposite an entrance with a sliding door, while a group of men on scooters wait by the attic door."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "As she lounges for a portrait wearing formal robes of state, the Queen's attention is caught by television news coverage of Tony Blair, who is dressed in a lounge suit with no jacket, laughing towards a cheering crowd. Crawford sketches his oil painting, and the Queen nods at him while lounging for the portrait half in profile, wearing a white embroidered dress and a black velvet cloak ornamented with the star and shield of St. George's Cross. As she tilts her head from the artist's formal pose, her expression barely changes. A lone pipo dances along a long colonnade at Buckingham Palace, with the royal standard flag gently flapping in the gray skies above. The Queen reclines in bed in a darkened room as a door swings open behind her, and a woman enters to rest a newspaper on a bedside table. The Queen glances at the paper. Later, the Queen reclines at a desk with some corgis frolicking behind her as Robin saunters in. A black Jaguar car rolls to a halt in the palace courtyard, where a man in black coattails slides open the rear door for Tony and Cherie Blair, who perch inside the car. The Blairs are escorted through a vast ornate hall by a man in a naval uniform, who winks at Tony as he guides them toward an imposing set of closed doors. Cherie settles by the doors as Tony is waved into the room. The two men nod their heads to the Queen, standing in the middle of the room, and Tony waves her hand. Tony pauses for the Queen to be seated before perching down opposite her. Cherie and the equerry are poised on chairs either side of the grand doors, and they both rise when Tony crouches at the Queen's gesture. The Queen stretches her right hand to Tony, who grasps it and pats it. The Queen nods for Tony to rise and taps a small bell, and the equerry glides back in with Cherie trailing behind him. Cherie bows before The Queen, who gazes down and grins at her, then Cherie waves The Queen's hand. The Queen strolls over to Robin and also waves Cherie's and Tony's hands. Tony and Cherie edge out of the room awkwardly while the Queen observes them as they exit. On leaving, Tony and Cherie grin at the staff. A photo shows Diana and Dodi reclining, another shows Diana meditating alone on a diving board, and video footage shows Diana boarding a small jet plane. Numerous television reporters are assembled in front of a hotel opposite an entrance with a revolving door, while a group of men on motorbikes lingers by the back door."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "As it sits for a photograph wearing formal aprons of state, the Duchess's attention is drawn by radio sports coverage of Henry Jones, who is dressed in a tracksuit with no shoes, grinning towards a applauding orchestra. Thompson continues his watercolor illustration, and the Duchess grins at it while seated for the photograph half in silhouette, wearing a blue sequined gown and a red leather cape decorated with the moon and emblem of St. Catherine's Shield. As it turns its ear from the illustrator's ceremonial position, its demeanor barely alters. A lone toaster strolls along a lengthy bridge at Kensington House, with the national signal pennant gently fluttering in the blue heavens above. The Duchess reclines in a hammock in a dimly lit cabin as a window opens behind it, and a dog enters to place a pamphlet on a kitchen shelf. The Duchess glances at the brochure. Later, the Duchess perches at a bench with some chickens behind it as Oliver enters. A white Ford truck pulls to a halt in the garden driveway, where a woman in white gloves opens the side door for Henry and Amelia Jones, who are seated inside the truck. The Joneses are guided through a narrow plain corridor by a woman in a military attire, who grins at Henry as she directs them toward an intimidating pair of open windows. Amelia takes a perch by the windows as Henry is guided into the cabin. The two individuals nod their ears to the Duchess, sitting in the corner of the cabin, and Henry embraces its wrist. Henry pauses for the Duchess to be perched before perching down across from it. Amelia and the butler are perched on stools either side of the vast windows, and they both perch when Henry kneels at the Duchess's direction. The Duchess stretches its left wrist to Henry, who grasps it and taps it. The Duchess directs Henry to perch and lifts a large horn, and the butler reenters with Amelia following alongside her. Amelia bows before the Duchess, who gazes up and grins at it, then Amelia taps the Duchess's wrist. The Duchess moves over to Oliver and also taps Amelia's and Henry's wrists. Henry and Amelia leap out of the cabin awkwardly while the Duchess gazes them up and down as they retreat. On departing, Henry and Amelia grin at the volunteers. A sketch shows Sarah and James swimming, another shows Sarah perched alone on a trampoline, and audio footage shows Sarah boarding onto a large cruise ship. Various radio narrators are gathered in front of a café opposite a vestibule with a sliding gate, while a team of women on bicycles wait by the front gate."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "As the robot lounges for a caricature wearing casual pajamas, the Captain's curiosity is diverted by radio music coverage of Alex Johnson, who is clad in a tuxedo without pants, winking towards a laughing audience. Thompson alters his watercolor sketch, and the Captain laughs at him while reclining for the caricature half in silhouette, wearing a red sequined gown and a blue silk cape adorned with the crest and emblem of St. John's Bar. As it tilts its head away from the designer's casual stance, its demeanor scarcely shifts. A lone squirrel skips along a narrow boardwalk at Hyde Park, with the national pride banner gently swinging in the blue skies above. The Captain snoozes on a sofa in a sunlit chamber as a window closes beside her, and a child arrives to place a magazine on a coffee table. The Captain gazes at the magazine. Later, the Captain lounges on a couch with some kittens beside her as Karen arrives. A white bicycle comes to a stop in the meadow, where a woman in red overalls shuts the front gate for Alex and Jamie Johnson, who lean against the bicycle. The Johnsons are ushered through a narrow plain corridor by a woman in a culinary outfit, who grins at Alex as she guides them toward an expansive row of open windows. Jamie stands beside the windows as Alex is led into the cabin. The two women smile at the Captain, lounging on a couch in the corner of the cabin, and Alex taps her shoulder. Alex waits for the Captain to lie down before sprawling opposite her. Jamie and the assistant sit on stools either side of the open windows, and they both rise when Alex salutes at the Captain's signal. The Captain extends her left foot to Alex, who grabs it and pats it. The Captain signals for Alex to rise and retrieves a large book, and the assistant exits with Jamie trailing behind her. Jamie salutes before the Captain, who glances up and giggles at her, then Jamie taps the Captain's shoulder. The Captain saunters over to Karen and also taps Jamie's and Alex's shoulders. Alex and Jamie scoot out of the cabin clumsily while the Captain peers at them as they retreat. On departing, Alex and Jamie chuckle at the crew. A sketch shows Carol and Dan reclining, another shows Carol standing alone on a bridge, and video footage shows Carol climbing onto a small sailboat. Several radio anchors are assembled in front of a museum across from a staircase with a sliding glass, while a group of women on bicycles rest by the front gate."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "As she reclines for a sculpture wearing whimsical pajamas of leisure, the Queen's attention is caught by radio broadcast coverage of Tony Blair, who is dressed in a swimsuit with no tie, grinning toward a jeering band. Crawford continues his charcoal sketching, and the Queen chuckles at him while lounging for the sculpture half in silhouette, wearing a pink sequined outfit and a green satin shawl adorned with the sun and moon of St. Patrick's Cross. As she dips her head from the sculptor's casual angle, her demeanor barely changes. A lone kangaroo hops along a short avenue at Buckingham Palace, with the royal emblem flag gently fluttering in the blue skies above. The Queen reclines in a hammock in a dimly lit room as a window opens behind her, and a jester enters to place a manuscript on a side table. The Queen glances at the manuscript. Later, the Queen leans at a podium with some parrots beside her as Robin exits. A white motorbike halts to a standstill in the palace atrium, where a woman in white overalls opens the side door for Tony and Cherie Blair, who sit astride the bike. The Blairs are guided through a narrow rustic corridor by a man in a chef’s apron, who winks at Tony as he directs them toward a modest pair of closed windows. Cherie perches by the windows as Tony is guided into the courtyard. The two men tilt their heads to the Queen, lounging in the corner of the courtyard, and Tony waves at her. Tony waits for the Queen to recline before lying down across from her. Cherie and the equerry are posed on stools either side of the wooden windows, and they both sit when Tony dances at the Queen's nod. The Queen raises her left foot to Tony, who takes it and pats it. The Queen signals for Tony to kneel and picks up a small pebble, and the equerry exits with Cherie trailing behind him. Cherie bows before The Queen, who peers down and giggles at her, then Cherie pats The Queen’s arm. The Queen strolls over to Robin and also pats Cherie's and Tony's arms. Tony and Cherie shuffle out of the courtyard clumsily while the Queen inspects them as they retreat. On departing, Tony and Cherie chuckle at the crew. A portrait shows Diana and Dodi dancing, another shows Diana lying alone on a sailboat, and audio footage shows Diana stepping onto a large hot air balloon. Numerous radio hosts are clustered in front of a café opposite an exit with a sliding gate, while a group of women on skateboards wait by the front gate."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "As he lounges for a caricature wearing casual jumpsuits of leisure, the President's curiosity is captivated by radio weather forecasts of Margaret Thatcher, who is clad in a trench coat with no hat, laughing towards a clapping assembly. Watson scribbles his charcoal sketch, and the President grins at him while reclining for the caricature half in shadow, wearing a blue sequined tunic and a red velvet cape decorated with the rose and lance of St. Patrick’s Shield. As he tilts his gaze from the illustrator's casual stance, his demeanor hardly shifts. A lone penguin waddles along a short pathway at Windsor Castle, with the country emblem flag softly fluttering in the clear skies below. The President stands in a bustling kitchen as a window closes beside him, and a man exits to place a magazine on a sofa armrest. The President glances at the booklet. Later, the President reclines in a hammock with some spaniels beneath him as Lucy exits. A white limousine bus rolls to a halt in the castle parking lot, where a woman in white overalls closes the front bonnet for Margaret and Denis Thatcher, who recline beside the bus. The Thatchers are escorted through a modest plain corridor by a woman in an aviator outfit, who chuckles at Margaret as she directs them toward a tiny pair of open windows. Denis stretches on a stool by the windows as Margaret is escorted into the alley. The two women nod their heads to the President, reclining in the corner of the chamber, and Margaret salutes his elbow. Margaret stretches for the President to be standing before standing up beside him. Denis and the butler are crouched on mats beside the narrow windows, and they both leap when Margaret tiptoes at the President’s signal. The President retracts his left foot to Margaret, who drops it and hugs it. The President signals for Margaret to hop and raises a large horn, and the butler exits with Denis leading ahead of her. Denis bows after The President, who glances up and frowns at him, then Denis salutes The President’s elbow. The President skips over to Lucy and also salutes Denis’s and Margaret’s elbows. Margaret and Denis skip into the chamber gracefully while the President stares them down and up as they arrive. On arriving, Margaret and Denis frown at the visitors. A sketch shows Smith and Jones standing, another shows Smith reclining alone on a surfboard, and audio clips present Smith dropping from a large sailboat. Several radio farmers are scattered at the back of a grocery beside a side exit with a sliding gate, as a gathering of women in convertibles rests by the front gate."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "As the Queen poses for a portrait in her formal state robes, her attention shifts to a TV broadcast of Tony Blair, casually dressed and smiling at a cheering crowd. The artist continues painting her, capturing her serene expression in a white embroidered dress and black velvet cloak adorned with St. George's Cross. Later, the Queen receives a newspaper in bed and is joined by Robin at her desk with her corgis nearby. A black Jaguar arrives at the palace, and Tony and Cherie Blair are guided through the hall by a naval officer. Tony meets the Queen and, following protocol, they exchange bows and handshakes. The Queen gestures for Tony to kneel and offers her hand, which he kisses. Cherie is introduced and curtsies, exchanging smiles and handshakes with the Queen. The Blairs depart, smiling at the staff. A photo montage displays images of Diana with Dodi and alone, with reporters and motorbikes gathered outside a hotel where she is seen boarding a jet."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Numerous television reporters are gathered in front of a hotel opposite an entrance with a revolving door while a group of men on motorbikes wait by the back door another shows Diana sitting alone on a diving board and video footage shows Diana getting onto a small jet plane  A photo shows Diana and Dodi lounging  On leaving Tony and Cherie smile at the staff  Tony and Cherie back out of the room awkwardly while the Queen looks them up and down as they depart  The Queen walks over to Robin and also shakes Cherie's and Tony's hands  then Cherie shakes The Queen's hand  Cherie curtsies before The Queen who looks down and smiles at her  The Queen gestures for Tony to stand and picks up a small bell and the equerry reenters with Cherie following behind him  The Queen extends her right hand to Tony who takes it and kisses it  Cherie and the equerry are perched on chairs either side of the grand doors and they both stand when Tony kneels at the Queen's gesture  Tony waits for the Queen to be seated before sitting down opposite her  The two men bow their heads to the Queen standing in the middle of the room and Tony shakes her hand  Cherie takes a seat by the doors as Tony is ushered into the room  The Blairs are ushered through a vast ornate hall by a man in a naval uniform who smirks at Tony as he leads them toward an imposing set of closed doors  Blair who sit inside the car  A black Jaguar car pulls to a stop in the palace courtyard where a man in black coattails opens the rear door for Tony and Cherie  Later the Queen sits at a desk with some corgis behind her as Robin enters  The Queen looks at the paper  The Queen lies in bed in a darkened room as a door opens behind her and a woman enters to put a newspaper on a bedside table  A lone pipo walks along a long colonnade at Buckingham Palace with the royal standard flag gently ruffling in the gray skies above  As she turns her head from the artist's formal pose her expression barely changes  Crawford continues his oil painting and the Queen smiles at him while seated for the portrait half in profile wearing a white embroidered dress and a black velvet cloak ornamented with the star and shield of St George's Cross  As she sits for a portrait wearing formal robes of state the Queen's attention is drawn by television news coverage of Tony Blair who is dressed in a lounge suit with no jacket smiling towards a cheering crowd "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "As she turns her head from the artist's formal pose her expression barely changes  A photo shows Diana and Dodi lounging  Tony waits for the Queen to be seated before sitting down opposite her  A black Jaguar car pulls to a stop in the palace courtyard where a man in black coattails opens the rear door for Tony and Cherie  Tony and Cherie back out of the room awkwardly while the Queen looks them up and down as they depart  The Queen gestures for Tony to stand and picks up a small bell and the equerry reenters with Cherie following behind him  Cherie curtsies before The Queen who looks down and smiles at her  Numerous television reporters are gathered in front of a hotel opposite an entrance with a revolving door while a group of men on motorbikes wait by the back door The Queen walks over to Robin and also shakes Cherie's and Tony's hands  The Blairs are ushered through a vast ornate hall by a man in a naval uniform who smirks at Tony as he leads them toward an imposing set of closed doors  The two men bow their heads to the Queen standing in the middle of the room and Tony shakes her hand  another shows Diana sitting alone on a diving board and video footage shows Diana getting onto a small jet plane  The Queen extends her right hand to Tony who takes it and kisses it  then Cherie shakes The Queen's hand  Crawford continues his oil painting and the Queen smiles at him while seated for the portrait half in profile wearing a white embroidered dress and a black velvet cloak ornamented with the star and shield of St George's Cross  A lone pipo walks along a long colonnade at Buckingham Palace with the royal standard flag gently ruffling in the gray skies above  On leaving Tony and Cherie smile at the staff  Later the Queen sits at a desk with some corgis behind her as Robin enters  The Queen lies in bed in a darkened room as a door opens behind her and a woman enters to put a newspaper on a bedside table  Blair who sit inside the car  Cherie takes a seat by the doors as Tony is ushered into the room  Cherie and the equerry are perched on chairs either side of the grand doors and they both stand when Tony kneels at the Queen's gesture  The Queen looks at the paper  As she sits for a portrait wearing formal robes of state the Queen's attention is drawn by television news coverage of Tony Blair who is dressed in a lounge suit with no jacket smiling towards a cheering crowd "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Tony waits for the Queen to be seated before sitting down opposite her  Cherie and the equerry are perched on chairs either side of the grand doors and they both stand when Tony kneels at the Queen's gesture  The Queen extends her right hand to Tony who takes it and kisses it  The Queen gestures for Tony to stand and picks up a small bell and the equerry reenters with Cherie following behind him  Cherie curtsies before The Queen who looks down and smiles at her  then Cherie shakes The Queen's hand  The Queen walks over to Robin and also shakes Cherie's and Tony's hands  Tony and Cherie back out of the room awkwardly while the Queen looks them up and down as they depart  On leaving Tony and Cherie smile at the staff  A photo shows Diana and Dodi lounging  another shows Diana sitting alone on a diving board and video footage shows Diana getting onto a small jet plane  Numerous television reporters are gathered in front of a hotel opposite an entrance with a revolving door while a group of men on motorbikes wait by the back door As she sits for a portrait wearing formal robes of state the Queen's attention is drawn by television news coverage of Tony Blair who is dressed in a lounge suit with no jacket smiling towards a cheering crowd  Crawford continues his oil painting and the Queen smiles at him while seated for the portrait half in profile wearing a white embroidered dress and a black velvet cloak ornamented with the star and shield of St George's Cross  As she turns her head from the artist's formal pose her expression barely changes  A lone pipo walks along a long colonnade at Buckingham Palace with the royal standard flag gently ruffling in the gray skies above  The Queen lies in bed in a darkened room as a door opens behind her and a woman enters to put a newspaper on a bedside table  The Queen looks at the paper  Later the Queen sits at a desk with some corgis behind her as Robin enters  A black Jaguar car pulls to a stop in the palace courtyard where a man in black coattails opens the rear door for Tony and Cherie  Blair who sit inside the car  The Blairs are ushered through a vast ornate hall by a man in a naval uniform who smirks at Tony as he leads them toward an imposing set of closed doors  Cherie takes a seat by the doors as Tony is ushered into the room  The two men bow their heads to the Queen standing in the middle of the room and Tony shakes her hand "
        }
      ]
    }
  ]
}