{
  "ground_truth": "The others stare ahead, dazed and incapable of movement, as one man wipes tears from his eyes. Another man approaches the front of Buckingham Palace and places a bouquet of flowers at the gate, and more people arrive with bouquets of flowers to place at the railings. Tony and Alistair watch Earl Spencer read a statement on TV when a woman enters. A smiling Alistair puts down the phone, and the woman hands Tony another phone. Tony's hand covers the receiver as he waits a moment, then raises the phone to speak. As a servant arranges cutlery on a table, Robin enters the dining room. The Queen strides down a corridor with stags' heads mounted on the walls, and two maids stand aside to let her pass. In the study, the Queen picks up a phone from a desk and sits behind the desk. Cherie enters the room behind Tony, and Prince Phillip enters the study wearing a kilt. Tony sits on a sofa while Cherie stands close by; he puts the phone down, and Cherie moves around and catches his attention. The Queen and the Queen Mother, dressed in black, walk to a nearby car while the Royal Family staff watch the broadcast, and Robin stares impassively at Tony's image on the TV. Charles, accompanied by Stephen and various men, walks through a vast lobby with high ceilings and huge windows, then strides down a corridor and suddenly stops outside a room, pausing for a moment before entering. Charles slowly enters the room, and a glass door shuts behind him. He stands before a casket, waits a moment, then walks around to the head of the casket. Seen from outside the room, Charles's view is obscured by the frame of the glass door, and a priest can be glimpsed speaking while Charles has his hand over his mouth, looking in grief at the casket. Later, Tony sits in the backseat of a car driving down a motorway at daytime, hands the phone to his female assistant, then glances out the window. Charles descends from a plane down some stairs, shakes hands with Lord Airlie on the runway, and walks over to meet various uniformed men standing nearby. A line of soldiers carries a casket above their heads, and Charles approaches Tony; they both look at the soldiers with the casket. Nelson Mandela appears on TV while the Queen fiddles with her pearl necklace, and Phillip picks his fingernails while the Queen scratches her wrist. At nighttime, two Range Rovers pull into the courtyard at Balmoral, and the Queen looks at the vehicles from an upstairs window. She watches as two men exit from the lead vehicle, then turns away from the window.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The others gaze forward, bewildered and unable of motion, as one man dabs tears from his eyes. Another man advances to the front of Buckingham Palace and sets a bunch of blossoms at the gate, and more people arrive with bunches of blossoms to lay at the railings. Tony and Alistair observe Earl Spencer read a declaration on TV when a woman enters. A grinning Alistair sets down the telephone, and the woman hands Tony another telephone. Tony's hand conceals the receiver as he pauses a moment, then raises the telephone to speak. As a servant organizes silverware on a table, Robin enters the dining room. The Queen strides down a hallway with stags' heads mounted on the walls, and two maids stand aside to let her pass. In the study, the Queen picks up a telephone from a desk and sits behind the desk. Cherie enters the room behind Tony, and Prince Phillip enters the study wearing a kilt. Tony sits on a sofa while Cherie stands close by; he sets the telephone down, and Cherie moves around and captures his attention. The Queen and the Queen Mother, attired in black, walk to a nearby car while the Royal Family staff watch the transmission, and Robin stares impassively at Tony's image on the TV. Charles, accompanied by Stephen and various men, walks through a vast lobby with high ceilings and immense windows, then strides down a hallway and suddenly halts outside a room, pausing for a moment before entering. Charles slowly enters the room, and a glass door closes behind him. He stands before a coffin, waits a moment, then walks around to the head of the coffin. Seen from outside the room, Charles's view is obscured by the frame of the glass door, and a priest can be glimpsed speaking while Charles has his hand over his mouth, looking in sorrow at the coffin. Later, Tony sits in the backseat of a car driving down a highway at daytime, hands the telephone to his female assistant, then glances out the window. Charles descends from an aircraft down some stairs, shakes hands with Lord Airlie on the runway, and walks over to meet various uniformed men standing nearby. A line of troops carries a coffin above their heads, and Charles approaches Tony; they both look at the troops with the coffin. Nelson Mandela appears on TV while the Queen fiddles with her pearl necklace, and Phillip picks his fingernails while the Queen scratches her wrist. At nighttime, two Range Rovers pull into the courtyard at Balmoral, and the Queen gazes at the vehicles from an upstairs window. She observes as two men exit from the lead vehicle, then turns away from the window."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The others are stared at by those who are dazed and incapable of movement, as tears are wiped from the eyes of one man. The front of Buckingham Palace is approached by another man who places a bouquet of flowers at the gate, and bouquets of flowers are placed by more people who arrive at the railings. Earl Spencer is watched by Tony and Alistair as he reads a statement on TV when a woman enters. The phone is put down by a smiling Alistair, and another phone is handed to Tony by the woman. The receiver is covered by Tony’s hand as he waits a moment, then the phone is raised by him to speak. Robin arranges cutlery on a table when the dining room is entered by a servant. A corridor is stridden down by the Queen with stags' heads mounted on the walls, and she is let pass by two maids who stand aside. In the study, a phone is picked up by the Queen from a desk, and she sits behind the desk. Tony is entered by Cherie behind him, and Prince Phillip, wearing a kilt, enters the study. A sofa is sat on by Tony while Cherie stands close by; the phone is put down by him, and his attention is caught by Cherie as she moves around. The Queen and the Queen Mother, dressed in black, are walked by themselves to a nearby car while the broadcast is watched by the Royal Family staff, and Tony's image on the TV is stared at impassively by Robin. Charles, accompanied by Stephen and various men, is walked through by himself in a vast lobby with high ceilings and huge windows, then a corridor is stridden down by him, and he suddenly stops outside a room, pausing for a moment before he enters. The room is slowly entered by Charles, and behind him, the glass door shuts. Before a casket, he stands, waits a moment, then the head of the casket is walked around to by him. From outside the room, Charles's view is obscured by the frame of the glass door, and glimpses of a priest speaking are had while Charles’s hand is over his mouth, looking in grief at the casket. Later, the backseat of a car driving down a motorway at daytime is sat in by Tony, the phone is handed to his female assistant by him, then the window is glanced out of by him. A plane is descended from by Charles down some stairs, Lord Airlie is shaken hands with by him on the runway, and various uniformed men standing nearby are walked over to meet by him. A casket is carried above their heads by a line of soldiers, and Tony is approached by Charles; the soldiers with the casket are looked at by them both. Nelson Mandela is appeared on by TV while the Queen fiddles with her pearl necklace, and Phillip picks his fingernails while her wrist is scratched by the Queen. At nighttime, the courtyard at Balmoral is pulled into by two Range Rovers, and the vehicles are looked at by the Queen from an upstairs window. She watches as the lead vehicle is exited by two men, then the window is turned away from by her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The others stare ahead, dazed and unable to move, as one man wipes tears. Another man places a bouquet at Buckingham Palace's gate, and more people arrive with flowers. Tony and Alistair watch Earl Spencer on TV when a woman enters. Smiling, Alistair puts down the phone, and the woman hands Tony another. Tony pauses, then speaks into it. A servant arranges cutlery as Robin enters the dining room. The Queen walks down a corridor with mounted stags' heads, and two maids step aside. In the study, the Queen picks up a phone and sits at the desk. Cherie enters behind Tony, and Prince Phillip arrives in a kilt. Tony sits while Cherie stands nearby; he puts down the phone, and Cherie grabs his attention. The Queen and Queen Mother, in black, head to a car as Royal Family staff watch the broadcast, with Robin staring at Tony's TV image. Charles, with Stephen and others, walks through a vast lobby, pauses outside a room, then enters. Inside, Charles stands before a casket, pauses, and walks around it. Seen from outside, Charles is obscured by a glass door frame, with a priest speaking as Charles, hand over mouth, grieves. Later, Tony, in a car, hands a phone to his assistant and glances out. Charles exits a plane, shakes hands with Lord Airlie, and meets uniformed men. Soldiers carry a casket, and Charles joins Tony in watching them. Nelson Mandela appears on TV as the Queen adjusts her necklace, Phillip picks nails, and the Queen scratches her wrist. At night, two Range Rovers arrive at Balmoral, and the Queen watches men exit the lead vehicle from an upstairs window before turning away."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The others stare dazed, unable to move, as a man wipes tears. Another places flowers at Buckingham Palace's gate, joined by more with bouquets. Tony and Alistair watch Earl Spencer on TV when a woman gives Tony another phone. Alistair smiles, and Tony covers the receiver, then speaks. As a servant sets the table, Robin enters, and the Queen walks past maids in a corridor. In the study, the Queen sits and takes a call. Cherie enters behind Tony, and Prince Phillip, in a kilt, follows. Tony, on a sofa, puts down the phone as Cherie catches his attention. The Queen and Queen Mother walk to a car in black, watched by staff as Robin stares at Tony on TV. Charles, with Stephen, walks through a vast lobby and pauses before entering a room with a casket. He's seen through a glass door, hand over mouth in grief, while a priest speaks. Later, Tony in a car hands the phone to his assistant and looks out. Charles descends from a plane, shakes hands with Lord Airlie, and meets uniformed men. A soldier line carries a casket above, and Charles approaches Tony, both watching the soldiers. Nelson Mandela is on TV; the Queen adjusts her necklace as Phillip picks his nails. At night, Range Rovers arrive at Balmoral, watched by the Queen from a window. She sees two men exit, then turns away."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The myriad of onlookers stand motionless and silent, their gazes fixed forward, appearing dazed and utterly incapable of motion. Among them, one man tenderly wipes tears from the corners of his eyes. As if in a solemn procession, another man walks purposefully to the front of the iconic Buckingham Palace, gently placing a bouquet of vibrant flowers at the ornate gate. Gradually, more people arrive, each holding their own bouquets of colorful flowers, and they too place them reverently at the railings. Meanwhile, Tony and Alistair find themselves watching Earl Spencer deliver a poignant statement on the television, when suddenly a woman enters the room. Alistair, maintaining a warm and welcoming smile, sets down the phone with care, while the woman steps forward to hand Tony another phone. Tony momentarily covers the receiver with his hand, taking a brief pause, and then he lifts the phone to his ear to speak. At this time, as a servant meticulously arranges silver cutlery on a grand dining table, Robin makes his entrance into the dining room. The regal Queen confidently strides down a stately corridor, adorned with mounted stags' heads on the walls, as two respectful maids step aside to allow her to pass unobstructed. Within the quiet study, the Queen reaches for a telephone resting on a desk, and she takes a seat behind it. As Cherie makes her entrance into the room behind Tony, Prince Phillip enters the study wearing a traditional kilt, accentuating his dignified presence. Tony finds a seat on a nearby sofa while Cherie remains standing close by; he gently places the phone down, prompting Cherie to move around and capture his full attention. Dressed in solemn black attire, the Queen and the Queen Mother walk toward a nearby car while members of the Royal Family’s staff intently observe the ongoing broadcast. Robin, meanwhile, watches without expression, fixated on Tony's image displayed on the television screen. In another setting, Charles, accompanied by Stephen along with several other men, traverses an expansive lobby characterized by its high ceilings and vast windows. He then strides confidently down a corridor but suddenly stops just outside a room, pausing briefly before making his entrance. Charles slowly enters the room, and the glass door gently closes behind him. Standing solemnly before a casket, he waits for a moment longer before moving around to the head of the casket. Observed from outside the room, the view of Charles is partially obscured by the frame of the glass door, while a priest can be seen speaking softly, and Charles, with his hand covering his mouth, gazes in profound grief at the casket before him. Later, Tony is seated in the backseat of a car that is smoothly driving down a busy motorway during daylight hours; he hands the phone to his female assistant, then turns his gaze to look thoughtfully out of the window. Descending gracefully from an aircraft, Charles comes down the stairs, extending a handshake to Lord Airlie on the waiting runway, then he moves on to greet various uniformed men standing nearby in formal attention. A line of solemn soldiers carries a casket high above their heads, and as Charles approaches Tony, they both fix their eyes on the soldiers with the casket, silently taking in the scene. The image of Nelson Mandela appears on the television screen while the Queen softly fiddles with her delicate pearl necklace, and Phillip absentmindedly picks his fingernails while the Queen scratches her wrist, seemingly lost in thought. As night envelops the scene, two sleek Range Rovers make their way into the courtyard at Balmoral, the Queen watching intently from an upstairs window. Observing as two men exit from the foremost vehicle, she eventually turns away from the window, carrying the images with her."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The diverse crowd of onlookers stands completely motionless and enveloped in silence, their gazes directed unwaveringly forward, appearing dazed and utterly incapable of any motion whatsoever. In the midst of these gathered individuals, there is one man who tenderly wipes away tears from the corners of his eyes. As if part of a solemn and dignified procession, another man walks with determined purposefulness to the very front of the iconic and grand Buckingham Palace. He gently places a bouquet of vibrant flowers at the palace's ornate gate, taking care to show respect and reverence. Gradually, more individuals arrive, each carrying their own bouquets of colorful flowers, adding a rich tapestry of colors as they, too, place them with reverence at the railings. Meanwhile, Tony and Alistair find themselves intently watching Earl Spencer deliver a poignant and heartfelt statement on the television. In that moment, a woman enters the room suddenly. Alistair, while maintaining a warm and welcoming smile, sets the phone down with deliberate care, as the woman steps forward to hand Tony another phone. Tony briefly covers the receiver with his hand, taking a brief pause to collect himself, and then he lifts the phone to his ear, prepared to speak. At this time, in another part of the grand residence, a servant meticulously arranges silver cutlery on a grand dining table, paying attention to every detail, when Robin makes his entrance into the dining room, adding to the scene. The regal Queen confidently strides down a stately corridor adorned with mounted stags' heads on the walls, exuding an air of authority and grace, as two respectful maids step aside, allowing her to pass unobstructed. Within the quiet and serene study, the Queen reaches for a telephone resting on a desk, and she takes a seat behind it with composed elegance. As Cherie makes her entrance into the room behind Tony, Prince Phillip enters the study wearing a traditional kilt, which accentuates his dignified presence. Tony finds a seat on a nearby sofa, while Cherie remains standing close by, watching attentively; he gently places the phone down, which prompts Cherie to move around and capture his full attention. Dressed in solemn black attire, the Queen and the Queen Mother walk toward a nearby car, while members of the Royal Family’s staff intently observe the ongoing broadcast, each one absorbed in the significance of the moment. Robin, meanwhile, watches without expression, fixated on Tony's image that is displayed on the television screen. In yet another setting, Charles, accompanied by Stephen along with several other men, traverses an expansive lobby characterized by its high ceilings and vast, expansive windows. He then strides confidently down a lengthy corridor but suddenly comes to a stop just outside a room, where he pauses briefly, gathering his composure before making his entrance. Charles slowly enters the room, and the glass door gently closes behind him, sealing the solemn environment. Standing with profound solemnity before a casket, he waits for a moment longer, reflecting deeply, before moving around to the head of the casket. Observed from the vantage point outside the room, the view of Charles is partially obscured by the frame of the glass door, while a priest can be seen speaking softly, and Charles, with his hand covering his mouth, gazes with profound grief at the casket before him. Later on, Tony is seated in the backseat of a car that is smoothly driving down a busy motorway during the daylight hours; he hands the phone to his female assistant, then turns his gaze to look thoughtfully out of the window, absorbed in his thoughts. Descending gracefully from an aircraft, Charles comes down the stairs, extending a handshake to Lord Airlie on the waiting runway, then he moves on to greet various uniformed men who stand nearby in formal attention, adding to the air of formality. A line of solemn soldiers carries a casket high above their heads, and as Charles approaches Tony, they both fix their eyes on the soldiers bearing the casket, silently taking in the poignant scene before them. The image of Nelson Mandela appears on the television screen, adding another layer of gravitas, while the Queen softly fiddles with her delicate pearl necklace, and Phillip absentmindedly picks his fingernails while the Queen scratches her wrist, both seemingly lost in deep thought. As the scene becomes enveloped in the stillness of night, two sleek Range Rovers make their way into the expansive courtyard at Balmoral, with the Queen watching intently from an upstairs window. Observing as two men exit from the foremost vehicle, she eventually turns away from the window, carrying the lingering images with her as she departs."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The others stand frozen and dazed, their eyes fixed ahead and bodies incapable of movement, while one man, visibly emotional, reaches up to his face to wipe away tears with his hand. Another man moves forward, approaching the impressive front of Buckingham Palace with deliberate steps. Upon reaching the gate, he gently places a bouquet of flowers at its base. As time passes, more people steadily arrive, each carrying their own vibrant bouquets, which they carefully position against the railings to create a growing floral tribute. Meanwhile, Tony and Alistair are seated together, their eyes glued to the television screen, intently watching as Earl Spencer reads a solemn statement. The atmosphere is interrupted when a woman quietly enters the room. Alistair, unable to suppress a smile, gently sets down the phone he had been holding. The woman promptly hands Tony another phone. Tony's hand moves to cover the receiver, taking a brief pause to gather his thoughts before he raises the phone to his ear and begins speaking. In another part of the household, a servant methodically arranges cutlery on a dining table, ensuring everything is in perfect order, when Robin enters the room. In a different part of the establishment, the Queen strides purposefully down a long corridor, the walls adorned with stags' heads that silently observe her. As she progresses, two maids respectfully step aside, allowing her to pass without interruption. Once in the study, the Queen approaches a desk with purpose, lifts the phone from its surface, and sits down calmly behind the desk. Meanwhile, Cherie enters the room, joining Tony, and Prince Phillip makes his entrance into the study, his attire distinctive with a kilt. Tony, who is seated on a comfortable sofa, places his phone down beside him while Cherie stands nearby, poised and attentive. She then moves around, capturing Tony's attention. Within another scene, the Queen and the Queen Mother, both solemnly dressed in black, walk towards a waiting car. Observing the broadcast, the Royal Family staff stand silently, while Robin gazes impassively at Tony's image displayed on the television screen. In a different location, Charles, with Stephen and an ensemble of various men by his side, walks through an expansive lobby characterized by its high ceilings and large windows, offering a grand and open atmosphere. Charles then advances down a corridor with confident strides but comes to an abrupt stop outside a room. He stands briefly, contemplating, before slowly entering the room; as he does, the glass door closes gently behind him. Inside, he positions himself in front of a casket, taking a moment to gather his emotions, then moves thoughtfully around to the head of the casket. From an outside perspective, Charles is partially obscured by the frame of the glass door, while a priest can be faintly seen speaking, his presence a solemn backdrop. Charles, visibly affected, places a hand over his mouth, his gaze filled with grief as he looks upon the casket. Later, Tony is seen seated in the backseat of a car traversing a motorway during daylight. He hands the phone over to his female assistant, then turns his head to glance thoughtfully out the window. Meanwhile, Charles disembarks from a plane, descending the stairs with ease, and upon reaching the runway, extends his hand to greet Lord Airlie, engaging in a cordial handshake. He then makes his way over to a group of various uniformed men, greeting them with measured courtesy. Nearby, a line of soldiers carries a casket above their heads with dignified precision. As Charles approaches Tony, they both momentarily fix their gaze on the solemn procession of soldiers bearing the casket. On television, Nelson Mandela appears, delivering his message, while in a quieter setting, the Queen absentmindedly fiddles with her pearl necklace, and Phillip, appearing relaxed, picks at his fingernails. The Queen gives a small scratch to her wrist in a moment of idle distraction. As night falls, two Range Rovers glide into the courtyard at Balmoral, their arrival marked by the hum of engines. The Queen, observing from an upstairs window, watches intently as two men step out from the lead vehicle. After a moment of observation, she turns away from the window, leaving the scene behind."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The others stare ahead, dazed and incapable of movement, as one man wipes tears from his eyes, while another places a bouquet at Buckingham Palace's gate, joined by more people doing the same at the railings. Tony and Alistair watch Earl Spencer read a statement on TV. Alistair smiles as he puts down the phone when a woman arrives and hands Tony another phone. Tony pauses with the phone before speaking. Meanwhile, as a servant arranges table settings, Robin enters the dining room just as the Queen strides down a corridor with mounted stags' heads, with maids stepping aside for her. In the study, the Queen sits behind a desk after picking up a phone. Cherie enters behind Tony, who sits on a sofa and puts down the phone, catching Cherie's attention. Dressed in black, the Queen and the Queen Mother walk to a car as Royal Family staff watch a broadcast, and Robin observes Tony's TV image. Charles, with Stephen and others, walks through a vast lobby, down a corridor, and pauses outside a room before entering to stand by a casket. Viewed from outside through a glass door, Charles, hand over mouth, listens to a priest with visible grief. Later, Tony rides in a car on the motorway, hands his phone to an assistant, and glances out the window. Charles descends from a plane, shakes hands with Lord Airlie, and meets uniformed men. Soldiers carry a casket, and Charles and Tony observe them. On TV, Nelson Mandela appears as the Queen fiddles with her necklace and Phillip scratches his wrist. At night, the Queen watches from an upstairs window as two Range Rovers arrive at Balmoral, then turns away."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The others stare ahead, dazed and incapable of movement, as one man wipes tears from his eyes. Many gathered were mourning the recent tragedy, which deeply affected the nation. Another man approaches the front of Buckingham Palace, the official London residence of the British monarch, and places a bouquet of flowers at the gate, and more people arrive with bouquets of flowers to place at the railings, a tradition that began as a sign of public mourning. Tony and Alistair watch Earl Spencer, brother of the deceased Princess Diana, read a statement on TV when a woman enters the room with a somber expression. A smiling Alistair puts down the phone, having just spoken to a political leader, and the woman hands Tony another phone. Tony's hand covers the receiver as he waits a moment, then raises the phone to speak with a sense of urgency. As a servant, a long-standing member of the Royal Household, arranges cutlery on a table, Robin enters the dining room. The Queen strides down a corridor adorned with stags' heads, a nod to the royal family's Scottish heritage, and two maids stand aside to let her pass, showing respect and protocol. In the study, the Queen picks up a phone, the direct line to the Prime Minister, from a desk and sits behind the desk, preparing for an important call. Cherie, Tony Blair's wife, enters the room behind Tony, and Prince Philip, known for his traditional Scottish attire, enters the study wearing a kilt. Tony sits on a sofa while Cherie stands close by, offering silent support; he puts the phone down, and Cherie moves around and catches his attention, sensing Tony's need for reassurance. The Queen and the Queen Mother, dressed in black, walk to a nearby car while the Royal Family staff, deeply conscious of protocol during this difficult time, watch the broadcast, and Robin stares impassively at Tony's image on the TV, reflecting the nation's mixed emotions toward the political leadership. Charles, Prince of Wales, accompanied by Stephen Lamport, his private secretary, and various men who are aides, walks through a vast lobby with high ceilings and huge windows, then strides down a corridor and suddenly stops outside a room, pausing for a moment before entering, gathering his composure. Charles slowly enters the room, and a glass door shuts behind him, muting the outside world. He stands before a casket, waits a moment, then walks around to the head of the casket, paying his respects to his beloved ex-wife. Seen from outside the room, Charles's view is obscured by the frame of the glass door, and a priest can be glimpsed speaking a few words of comfort while Charles has his hand over his mouth, looking in grief at the casket. Later, Tony sits in the backseat of a car driving down a motorway at daytime, a part of his busy schedule, hands the phone to his female assistant, then glances out the window, reflecting on the tumultuous events. Charles descends from a plane, having returned from a solemn journey, down some stairs, shakes hands with Lord Airlie, the Lord Chamberlain, on the runway, and walks over to meet various uniformed men standing nearby, representing military presence. A line of soldiers carries a casket above their heads, symbolizing respect and honor, and Charles approaches Tony; they both look at the soldiers with the casket, united in shared loss. Nelson Mandela appears on TV, offering condolences from South Africa, while the Queen fiddles with her pearl necklace, a habitual gesture, and Philip picks his fingernails while the Queen scratches her wrist, both displaying subtle signs of stress. At nighttime, two Range Rovers pull into the courtyard at Balmoral, the Scottish estate where the royal family seeks refuge, and the Queen looks at the vehicles from an upstairs window. She watches as two men exit from the lead vehicle, then turns away from the window, contemplating the decisions ahead."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Cherie enters the room behind Tony and Prince Phillip enters the study wearing a kilt he puts the phone down and Cherie moves around and catches his attention The others stare ahead dazed and incapable of movement as one man wipes tears from his eyes In the study the Queen picks up a phone from a desk and sits behind the desk The others stare ahead dazed and incapable of movement as one man wipes tears from his eyes Another man approaches the front of Buckingham Palace and places a bouquet of flowers at the gate and more people arrive with bouquets of flowers to place at the railings Tony and Alistair watch Earl Spencer read a statement on TV when a woman enters A line of soldiers carries a casket above their heads and Charles approaches Tony Tony's hand covers the receiver as he waits a moment then raises the phone to speak A smiling Alistair puts down the phone and the woman hands Tony another phone Tony's hand covers the receiver as he waits a moment then raises the phone to speak As a servant arranges cutlery on a table Robin enters the dining room The Queen and the Queen Mother dressed in black walk to a nearby car while the Royal Family staff watch the broadcast and Robin stares impassively at Tony's image on the TV The Queen strides down a corridor with stags' heads mounted on the walls and two maids stand aside to let her pass Another man approaches the front of Buckingham Palace and places a bouquet of flowers at the gate and more people arrive with bouquets of flowers to place at the railings In the study the Queen picks up a phone from a desk and sits behind the desk Cherie enters the room behind Tony and Prince Phillip enters the study wearing a kilt Tony sits on a sofa while Cherie stands close by he puts the phone down and Cherie moves around and catches his attention At nighttime two Range Rovers pull into the courtyard at Balmoral and the Queen looks at the vehicles from an upstairs window The Queen and the Queen Mother dressed in black walk to a nearby car while the Royal Family staff watch the broadcast and Robin stares impassively at Tony's image on the TV Charles accompanied by Stephen and various men walks through a vast lobby with high ceilings and huge windows then strides down a corridor and suddenly stops outside a room pausing for a moment before entering A smiling Alistair puts down the phone and the woman hands Tony another phone Charles slowly enters the room and a glass door shuts behind him He stands before a casket waits a moment then walks around to the head of the casket Seen from outside the room Charles's view is obscured by the frame of the glass door and a priest can be glimpsed speaking while Charles has his hand over his mouth looking in grief at the casket Later Tony sits in the backseat of a car driving down a motorway at daytime hands the phone to his female assistant then glances out the window they both look at the soldiers with the casket Charles descends from a plane down some stairs shakes hands with Lord Airlie on the runway and walks over to meet various uniformed men standing nearby Nelson Mandela appears on TV while the Queen fiddles with her pearl necklace and Phillip picks his fingernails while the Queen scratches her wrist A line of soldiers carries a casket above their heads and Charles approaches Tony they both look at the soldiers with the casket Nelson Mandela appears on TV while the Queen fiddles with her pearl necklace and Phillip picks his fingernails while the Queen scratches her wrist At nighttime two Range Rovers pull into the courtyard at Balmoral and the Queen looks at the vehicles from an upstairs window She watches as two men exit from the lead vehicle then turns away from the window"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The others stare ahead dazed and incapable of movement as one man wipes tears from his eyes. Another man approaches the front of Buckingham Palace and places a bouquet of flowers at the gate and more people arrive with bouquets of flowers to place at the railings. Tony and Alistair watch Earl Spencer read a statement on TV when a woman enters. A smiling Alistair puts down the phone and the woman hands Tony another phone. Tony's hand covers the receiver as he waits a moment then raises the phone to speak. As a servant arranges cutlery on a table Robin enters the dining room. The Queen strides down a corridor with stags' heads mounted on the walls and two maids stand aside to let her pass. In the study the Queen picks up a phone from a desk and sits behind the desk. Cherie enters the room behind Tony and Prince Phillip enters the study wearing a kilt. Tony sits on a sofa while Cherie stands close by. he puts the phone down and Cherie moves around and catches his attention. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. The Queen and the Queen Mother dressed in black walk to a nearby car while the Royal Family staff watch the broadcast and Robin stares impassively at Tony's image on the TV. Charles accompanied by Stephen and various men walks through a vast lobby with high ceilings and huge windows then strides down a corridor and suddenly stops outside a room pausing for a moment before entering. Charles slowly enters the room and a glass door shuts behind him. He stands before a casket waits a moment then walks around to the head of the casket. Seen from outside the room Charles's view is obscured by the frame of the glass door and a priest can be glimpsed speaking while Charles has his hand over his mouth looking in grief at the casket. Later Tony sits in the backseat of a car driving down a motorway at daytime hands the phone to his female assistant then glances out the window. Charles descends from a plane down some stairs shakes hands with Lord Airlie on the runway and walks over to meet various uniformed men standing nearby. A line of soldiers carries a casket above their heads and Charles approaches Tony. they both look at the soldiers with the casket. Nelson Mandela appears on TV while the Queen fiddles with her pearl necklace and Phillip picks his fingernails while the Queen scratches her wrist. At nighttime two Range Rovers pull into the courtyard at Balmoral and the Queen looks at the vehicles from an upstairs window. She watches as two men exit from the lead vehicle then turns away from the window."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The others stare ahead dazed and incapable of movement as one man wipes tears from his eyes. Another man approaches the front of Buckingham Palace and places a bouquet of flowers at the gate and more people arrive with bouquets of flowers to place at the railings. Tony and Alistair watch Earl Spencer read a statement on TV when a woman enters. A smiling Alistair puts down the phone and the woman hands Tony another phone. Tony's hand covers the receiver as he waits a moment then raises the phone to speak. As a servant arranges cutlery on a table Robin enters the dining room. The Queen strides down a corridor with stags' heads mounted on the walls and two maids stand aside to let her pass. In the study the Queen picks up a phone from a desk and sits behind the desk. Cherie enters the room behind Tony and Prince Phillip enters the study wearing a kilt. Tony sits on a sofa while Cherie stands close by. he puts the phone down and Cherie moves around and catches his attention. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. The Queen and the Queen Mother dressed in black walk to a nearby car while the Royal Family staff watch the broadcast and Robin stares impassively at Tony's image on the TV. Charles accompanied by Stephen and various men walks through a vast lobby with high ceilings and huge windows then strides down a corridor and suddenly stops outside a room pausing for a moment before entering. Charles slowly enters the room and a glass door shuts behind him. He stands before a casket waits a moment then walks around to the head of the casket. Seen from outside the room Charles's view is obscured by the frame of the glass door and a priest can be glimpsed speaking while Charles has his hand over his mouth looking in grief at the casket. Later Tony sits in the backseat of a car driving down a motorway at daytime hands the phone to his female assistant then glances out the window. Charles descends from a plane down some stairs shakes hands with Lord Airlie on the runway and walks over to meet various uniformed men standing nearby. A line of soldiers carries a casket above their heads and Charles approaches Tony. they both look at the soldiers with the casket. Nelson Mandela appears on TV while the Queen fiddles with her pearl necklace and Phillip picks his fingernails while the Queen scratches her wrist. At nighttime two Range Rovers pull into the courtyard at Balmoral and the Queen looks at the vehicles from an upstairs window. She watches as two men exit from the lead vehicle then turns away from the window."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The others stare ahead dazed and incapable of movement as one man wipes tears from his eyes. Another man approaches the front of Buckingham Palace and places a bouquet of flowers at the gate and more people arrive with bouquets of flowers to place at the railings. Tony and Alistair watch Earl Spencer read a statement on TV when a woman enters. A smiling Alistair puts down the phone and the woman hands Tony another phone. Tony's hand covers the receiver as he waits a moment then raises the phone to speak. As a servant arranges cutlery on a table Robin enters the dining room. Charles descends from a plane down some stairs shakes hands with Lord Airlie on the runway and walks over to meet various uniformed men standing nearby. A line of soldiers carries a casket above their heads and Charles approaches Tony. they both look at the soldiers with the casket. Nelson Mandela appears on TV while the Queen fiddles with her pearl necklace and Phillip picks his fingernails while the Queen scratches her wrist. At nighttime two Range Rovers pull into the courtyard at Balmoral and the Queen looks at the vehicles from an upstairs window. She watches as two men exit from the lead vehicle then turns away from the window."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The others stare ahead dazed and incapable of movement as one man wipes tears from his eyes. Another man approaches the front of Buckingham Palace and places a bouquet of flowers at the gate and more people arrive with bouquets of flowers to place at the railings. Nelson Mandela appears on TV while the Queen fiddles with her pearl necklace and Phillip picks his fingernails while the Queen scratches her wrist. At nighttime two Range Rovers pull into the courtyard at Balmoral and the Queen looks at the vehicles from an upstairs window. She watches as two men exit from the lead vehicle then turns away from the window."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The horses stare ahead, dazed and incapable of movement, as a puppy wipes tears from his eyes. A giraffe approaches the front of Buckingham Palace and places a bouquet of flowers at the gate, and more kangaroos arrive with bouquets of flowers to place at the railings. A turtle and an elephant watch a dolphin read a statement on TV when a rabbit enters. A smiling elephant puts down the phone, and the rabbit hands the turtle another phone. The turtle's hand covers the receiver as it waits a moment, then raises the phone to speak. As a bear arranges cutlery on a table, a parrot enters the dining room. The lion strides down a corridor with stags' heads mounted on the walls, and two penguins stand aside to let it pass. In the study, the lion picks up a phone from a desk and sits behind the desk. A cat enters the room behind the turtle, and a fox enters the study wearing a kilt. The turtle sits on a sofa while the cat stands close by; it puts the phone down, and the cat moves around and catches its attention. The lion and the tiger, dressed in black, walk to a nearby car while the giraffe staff watches the broadcast, and the parrot stares impassively at the turtle's image on the TV. A monkey, accompanied by a zebra and various tigers, walks through a vast lobby with high ceilings and huge windows, then strides down a corridor and suddenly stops outside a room, pausing for a moment before entering. The monkey slowly enters the room, and a glass door shuts behind it. It stands before a casket, waits a moment, then walks around to the head of the casket. Seen from outside the room, the monkey's view is obscured by the frame of the glass door, and a panda can be glimpsed speaking while the monkey has its hand over its mouth, looking in grief at the casket. Later, the turtle sits in the backseat of a car driving down a motorway at daytime, hands the phone to its female assistant, then glances out the window. The monkey descends from a plane down some stairs, shakes hands with a goat on the runway, and walks over to meet various uniformed otters standing nearby. A line of elephants carries a casket above their heads, and the monkey approaches the turtle; they both look at the elephants with the casket. Albert Einstein appears on TV while the lion fiddles with its pearl necklace, and the fox picks its fingernails while the lion scratches its wrist. At nighttime, two unicorns pull into the courtyard at Balmoral, and the lion looks at the vehicles from an upstairs window. It watches as two llamas exit from the lead vehicle, then turns away from the window."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The others stare ahead, dazed and incapable of movement, as one man wipes tears from his eyes. Another man approaches the front of Sydney Opera House and places a basket of fruit at the fence, and more people arrive with baskets of fruit to place at the barriers. Tony and Alistair watch Earl Spencer read a statement on a radio when a woman enters. A smiling Alistair puts down the tablet, and the woman hands Tony another tablet. Tony's hand covers the screen as he waits a moment, then raises the tablet to speak. As a servant arranges napkins on a counter, Robin enters the living room. The Queen strides down a corridor with butterfly paintings mounted on the walls, and two maids stand aside to let her pass. In the study, the Queen picks up a book from a shelf and sits behind the desk. Cherie enters the room behind Tony, and Prince Phillip enters the study wearing a tracksuit. Tony sits on a bench while Cherie stands close by; he puts the tablet down, and Cherie moves around and catches his attention. The Queen and the Queen Mother, dressed in blue, walk to a nearby van while the Royal Family staff watch the announcement, and Robin stares impassively at Tony's image on the radio. Charles, accompanied by Stephen and various men, walks through an expansive atrium with chandeliers and large curtains, then strides down a hallway and suddenly stops outside a closet, pausing for a moment before entering. Charles slowly enters the closet, and a wooden door shuts behind him. He stands before a portrait, waits a moment, then walks around to the side of the portrait. Seen from outside the closet, Charles's view is obscured by the frame of the wooden door, and an artist can be glimpsed painting while Charles has his hand over his mouth, looking in grief at the portrait. Later, Tony sits in the backseat of a truck driving down a country lane at daytime, hands the tablet to his female assistant, then glances out the sunroof. Charles descends from a helicopter down some stairs, shakes hands with Lord Airlie on the tarmac, and walks over to meet various uniformed men standing nearby. A line of officers carries a banner above their heads, and Charles approaches Tony; they both look at the officers with the banner. Nelson Mandela appears on a billboard while the Queen fiddles with her scarf, and Phillip picks his shoelaces while the Queen scratches her ankle. At nighttime, two sedans pull into the courtyard at Windsor, and the Queen looks at the vehicles from an upstairs window. She watches as two women exit from the lead vehicle, then turns away from the window."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The others glance downward, puzzled and lost in thought, as one man brushes dust from his eyes. Another man strolls toward the front of Buckingham Palace and draws a map of flowers at the gate, and more people wander with bouquets of flowers to draw at the railings. Tony and Alistair hear Earl Spencer sing a statement on TV when a woman dances in. A laughing Alistair lifts up the phone, and the woman offers Tony another phone. Tony's hand taps the receiver as he pauses a moment, then lowers the phone to listen. As a servant throws cutlery on a table, Robin slides into the dining room. The Queen glides down a corridor with stags' heads sketched on the walls, and two maids kneel aside to let her pass. In the study, the Queen nudges a phone from a desk and leans behind the desk. Cherie wanders into the room behind Tony, and Prince Phillip exits the study wearing a kilt. Tony leaps onto a sofa while Cherie spins close by; he lifts the phone up, and Cherie shuffles around and loses his attention. The Queen and the Queen Mother, dressed in black, sprint to a nearby car while the Royal Family staff list the broadcast, and Robin blinks briefly at Tony's image on the TV. Charles, accompanied by Stephen and various men, glances through a vast lobby with high ceilings and huge windows, then skips down a corridor and suddenly leaps outside a room, pondering for a moment before dancing in. Charles quickly dances into the room, and a glass door opens behind him. He sits before a casket, pauses a moment, then skips around to the head of the casket. Seen from outside the room, Charles's view is highlighted by the frame of the glass door, and a priest can be glimpsed humming while Charles has his hand above his mouth, looking joyfully at the casket. Later, Tony stands in the backseat of a car floating down a motorway at daytime, lifts the phone from his female assistant, then peers out the window. Charles rises from a plane up some stairs, hugs Lord Airlie on the runway, and skips over to meet various uniformed men standing nearby. A line of soldiers lowers a casket below their heads, and Charles turns away from Tony; they both glance at the soldiers with the casket. Nelson Mandela sings on TV while the Queen shakes her pearl necklace, and Phillip twirls his fingernails while the Queen pats her wrist. At nighttime, two Range Rovers hover into the courtyard at Balmoral, and the Queen waves at the vehicles from an upstairs window. She chuckles as two men run from the lead vehicle, then dances away from the window."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The giraffes gaze ahead, dazed and incapable of movement, as one toaster wipes tears from its eyes. Another toaster approaches the front of Eiffel Tower and places a bouquet of apples at the door, and more elephants arrive with bouquets of apples to place at the fences. Jiminy and Theodore watch Duke Ellington read a poem on radio when a cat enters. A smiling Theodore puts down the notebook, and the cat hands Jiminy another notebook. Jiminy's foot covers the microphone as he waits a moment, then raises the notebook to speak. As a chef arranges paperclips on a shelf, Max enters the ballroom. The Duchess strides down an avenue with giraffes' heads mounted on the trees, and two musicians stand aside to let her pass. In the library, the Duchess picks up a notebook from a stool and sits behind the stool. Greta enters the room behind Jiminy, and Duke Winston enters the library wearing a cape. Jiminy sits on a chair while Greta stands close by; he puts the notebook down, and Greta moves around and catches his attention. The Duchess and the Duchess Mother, dressed in green, walk to a nearby bike while the Jazz Band staff watch the circus, and Max stares impassively at Jiminy's image on the radio. Alan, accompanied by Martin and various zebras, walks through a vast garden with low hedges and tiny fountains, then strides down an avenue and suddenly stops outside a tent, pausing for a moment before entering. Alan slowly enters the tent, and a rope curtain shuts behind him. He stands before a drum, waits a moment, then walks around to the head of the drum. Seen from outside the tent, Alan's view is obscured by the frame of the rope curtain, and a teacher can be glimpsed speaking while Alan has his foot over his chin, looking in grief at the drum. Later, Jiminy sits in the backseat of a plane flying down a racetrack at sunset, hands the notebook to his robot assistant, then glances out the window. Alan descends from a blimp down some ropes, shakes hands with Miss Universe on the dock, and walks over to meet various armored zebras standing nearby. A line of gardeners carries a drum above their heads, and Alan approaches Jiminy; they both look at the gardeners with the drum. Cleopatra appears on radio while the Duchess fiddles with her feather earrings, and Winston picks his eyebrows while the Duchess scratches her elbow. At dawn, two Hot Air Balloons pull into the stadium at Cardiff, and the Duchess looks at the machines from an attic window. She watches as two squirrels exit from the lead machine, then turns away from the window."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The travelers gaze upwards, intrigued and exhilarated, as one child laughs heartily from his heart. A third child dances toward the back of Notre Dame Cathedral and tosses a frisbee over the fence, and several birds flock with frisbees to toss toward the hedge. Martin and Oliver observe Lady Spencer deliver a song on the radio when a boy rushes in. A chuckling Oliver picks up the remote control, and the boy passes Martin an apple. Martin's head rests on the cushion as he stretches a moment, then drops the apple to munch. As a painter scatters paintbrushes on a canvas, Ellen skips into the workshop. The King shuffles up a staircase with squirrels' tails hanging from the ceiling, and three cows step aside to let him pass. In the office, the King types on a laptop from a shelf and kneels beside the shelf. Linda dances into the kitchen behind Martin, and Lord Phillip strides into the garden sporting a bow tie. Martin sprawls on a hammock while Linda kneels nearby; he closes the book, and Linda spins around and waves at him. The King and the Royal Chef, dressed in white, drive toward a distant helicopter while the Royal Guard members listen to the podcast, and Ellen waves enthusiastically at Martin’s voice from the radio. William, accompanied by Martha and assorted women, skips through a tiny hallway with low ceilings and tiny doors, then trudges up a staircase and suddenly trips outside a closet, hesitating briefly before entering. William cautiously tiptoes into the closet, and a wooden latch swings behind him. He sits beside a piano, pauses briefly, then crawls under to the strings of the piano. Seen from inside the closet, William’s perspective is distorted by the glare of the wooden latch, and a musician can be spotted singing while William pats his face, beaming in joy at the piano. Tomorrow, Martin reclines in the front seat of a van cruising down a dirt road at twilight, passes the apple to his male advisor, then peers into the dashboard. William climbs from a helicopter up some ladders, waves at Lady Airlie on the tarmac, and skips away to meet various costumed women standing nearby. A parade of dancers twirls a boombox over their heads, and William nods at Martin; they both marvel at the dancers with the boombox. Oprah Winfrey features on the radio while the King twirls his wedding ring, and Phillip snaps his fingers while the King rubs his ankle. At dawn, a pair of bicycles coast into the garage at Kensington, and the King peers at the bikes from a basement door. He listens as a pair of women leap from the second bicycle, then steps away from the door."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The others gaze forward, bewildered and unable to sing, as one man brushes sand from his ear. Another man strides to the front of the Eiffel Tower and balances a basket of vegetables at the fence, and more individuals gather with baskets of vegetables to balance on the railings. Tony and Alistair observe Earl Spencer painting a portrait on TV when a woman skips in. A grinning Alistair lifts up the umbrella, and the woman tosses Tony another umbrella. Tony's forehead touches the handle as he pauses a moment, then swings the umbrella to dance. As a messenger scatters confetti on a rug, Robin glides into the ballroom. The Queen sprints down a corridor with lion heads mounted on the shelves, and two painters step aside to watch her leap. In the library, the Queen lifts a lamp from a shelf and crouches behind the shelf. Cherie waltzes into the room behind Tony, and Prince Phillip trots into the library wearing a robe. Tony lounges on a beanbag while Cherie sways nearby; he tosses the lamp down, and Cherie spins around and claps for his attention. The Queen and the Queen Mother, dressed in yellow, march to a nearby train while the Royal Family chefs watch the parade, and Robin gazes dreamily at Tony’s reflection on the TV. Charles, shadowed by Stephen and numerous women, drifts through an expansive gallery with low ceilings and tiny skylights, then skips down a corridor and abruptly halts outside a hall, pausing for a moment before twirling inside. Charles gently twirls into the room, and a wooden door slides closed behind him. He kneels before a plant, waits a moment, then pirouettes around to the root of the plant. Seen from outside the room, Charles's sight is obscured by the frame of the wooden door, and a dancer can be glimpsed singing while Charles has his hand over his nose, looking in admiration at the plant. Later, Tony reclines in the backseat of a boat floating down a canal in the afternoon, flips the umbrella to his male assistant, then peeks out the porthole. Charles floats down from a cloud onto some cushions, taps feet with Lord Airlie on the meadow, and skips over to greet various singing children standing nearby. A line of acrobats balances a plant above their legs, and Charles tiptoes to Tony; they both grin at the acrobats with the plant. Nelson Mandela appears on TV while the Queen twists her silver bracelet, and Phillip taps his toes while the Queen taps her elbow. At nightfall, two bicycles glide into the garden at Windsor, and the Queen peers at the bikes from a basement window. She watches as two women climb from the lead bike, then hops away from the window."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The cats gaze upward, enchanted and enthusiastic for flight, as one monkey polishes shoes on his hands. Another parrot drifts to the top of Eiffel Tower and throws a pile of bricks at the river, and fewer birds depart with baskets of fruit to throw at the fences. Marvin and Claudia hear Baron Monroe sing a lullaby on the radio when a bear whistles. A dancing Claudia tosses away the umbrella, and the bear passes Marvin a book. Marvin's foot kicks the chair as he thinks a while, then bends the book to listen. As a farmer stacks plates on a shelf, Alex rushes into the ballroom. The Duchess trots along a pathway with lions’ heads attached to the floors, and four barbers sit down to let her pass. In the library, the Duchess grabs a book from a shelf and stands on the shelf. Lorraine rushes past the chair, and King George exits the library wearing a toga. Marvin jumps on a mattress while Lorraine spins nearby; he tosses the book away, and Lorraine skips along and loses his patience. The Duchess and the Duchess's brother, dressed in purple, wander to a distant truck while the Imperial Army assistants ignore the forecast, and Alex smiles joyfully at Marvin’s shadow on the radio. Henry, followed by Gregory and several cats, sails through a narrow hallway with low ceilings and tiny doors, then glides along a pathway and suddenly dances outside a box, pausing for a century before sailing. Henry swiftly sails the venue, and a wooden curtain opens in front of him. He dances beside a mirror, sings a while, then flies beside the toe of the mirror. Observed from inside the venue, Henry’s mirror is hidden by the leg of the wooden curtain, and a painter might be spotted dancing while Henry places his foot behind his ear, dancing in delight at the mirror. Earlier, Marvin hides in the trunk of a bus speeding through an alley at nighttime, drops the book to his artistic rival, then yawns out the door. Henry floats from a helicopter onto a rooftop, waves at Lady Moore on the sidewalk, and dances over to greet different painted cats lurking nearby. A cluster of musicians juggles a mirror over their feet, and Henry scans Marvin; they both jump at the musicians with the mirror. Alexander the Great sings on the radio while the Duchess taps her diamond earring, and George bites his toenails while the Duchess pats her forehead. At dawn, two motorbikes zoom into the garage at Windsor, and the Duchess stares at the engines from an underground basement. She catches a glimpse as two robots fly away from the trailing spaceship, then spins toward the basement."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The group stands in front of Buckingham Palace, placing bouquets at the gate in a daze. Tony and Alistair watch Earl Spencer's TV statement. Alistair hangs up, and Tony takes another call. In the dining room, Robin joins as a servant arranges cutlery. The Queen strides past maids, picks up a phone in her study, while Cherie and Prince Phillip join Tony. The Queen, in black with the Queen Mother, heads to a car watched by staff. Charles, with Stephen, enters a grand lobby, pauses outside a room, then enters to see a casket. A priest speaks as Charles stands by the casket, visibly grieving. Later, Tony in a car hands his assistant the phone and looks out the window. Charles arrives on the tarmac, greets Lord Airlie, and watches soldiers carry a casket, joining Tony. On TV, Mandela speaks while the Queen and Phillip fidget. At night, Range Rovers arrive at Balmoral; the Queen observes from a window, watches two men exit, then turns away."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She watches as two men exit from the lead vehicle then turns away from the window At nighttime two Range Rovers pull into the courtyard at Balmoral and the Queen looks at the vehicles from an upstairs window Nelson Mandela appears on TV while the Queen fiddles with her pearl necklace and Phillip picks his fingernails while the Queen scratches her wrist they both look at the soldiers with the casket A line of soldiers carries a casket above their heads and Charles approaches Tony Charles descends from a plane down some stairs shakes hands with Lord Airlie on the runway and walks over to meet various uniformed men standing nearby Later Tony sits in the backseat of a car driving down a motorway at daytime hands the phone to his female assistant then glances out the window Seen from outside the room Charles's view is obscured by the frame of the glass door and a priest can be glimpsed speaking while Charles has his hand over his mouth looking in grief at the casket He stands before a casket waits a moment then walks around to the head of the casket Charles slowly enters the room and a glass door shuts behind him Charles accompanied by Stephen and various men walks through a vast lobby with high ceilings and huge windows then strides down a corridor and suddenly stops outside a room pausing for a moment before entering The Queen and the Queen Mother dressed in black walk to a nearby car while the Royal Family staff watch the broadcast and Robin stares impassively at Tony's image on the TV he puts the phone down and Cherie moves around and catches his attention Tony sits on a sofa while Cherie stands close by Cherie enters the room behind Tony and Prince Phillip enters the study wearing a kilt In the study the Queen picks up a phone from a desk and sits behind the desk The Queen strides down a corridor with stags' heads mounted on the walls and two maids stand aside to let her pass As a servant arranges cutlery on a table Robin enters the dining room Tony's hand covers the receiver as he waits a moment then raises the phone to speak A smiling Alistair puts down the phone and the woman hands Tony another phone Tony and Alistair watch Earl Spencer read a statement on TV when a woman enters Another man approaches the front of Buckingham Palace and places a bouquet of flowers at the gate and more people arrive with bouquets of flowers to place at the railings The others stare ahead dazed and incapable of movement as one man wipes tears from his eyes"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Later Tony sits in the backseat of a car driving down a motorway at daytime hands the phone to his female assistant then glances out the window Seen from outside the room Charles's view is obscured by the frame of the glass door and a priest can be glimpsed speaking while Charles has his hand over his mouth looking in grief at the casket Tony and Alistair watch Earl Spencer read a statement on TV when a woman enters He stands before a casket waits a moment then walks around to the head of the casket As a servant arranges cutlery on a table Robin enters the dining room Charles slowly enters the room and a glass door shuts behind him Charles descends from a plane down some stairs shakes hands with Lord Airlie on the runway and walks over to meet various uniformed men standing nearby Charles accompanied by Stephen and various men walks through a vast lobby with high ceilings and huge windows then strides down a corridor and suddenly stops outside a room pausing for a moment before entering She watches as two men exit from the lead vehicle then turns away from the window The Queen strides down a corridor with stags' heads mounted on the walls and two maids stand aside to let her pass Tony sits on a sofa while Cherie stands close by Another man approaches the front of Buckingham Palace and places a bouquet of flowers at the gate and more people arrive with bouquets of flowers to place at the railings they both look at the soldiers with the casket The Queen and the Queen Mother dressed in black walk to a nearby car while the Royal Family staff watch the broadcast and Robin stares impassively at Tony's image on the TV he puts the phone down and Cherie moves around and catches his attention At nighttime two Range Rovers pull into the courtyard at Balmoral and the Queen looks at the vehicles from an upstairs window Tony's hand covers the receiver as he waits a moment then raises the phone to speak A line of soldiers carries a casket above their heads and Charles approaches Tony In the study the Queen picks up a phone from a desk and sits behind the desk Cherie enters the room behind Tony and Prince Phillip enters the study wearing a kilt The others stare ahead dazed and incapable of movement as one man wipes tears from his eyes A smiling Alistair puts down the phone and the woman hands Tony another phone Nelson Mandela appears on TV while the Queen fiddles with her pearl necklace and Phillip picks his fingernails while the Queen scratches her wrist"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Charles accompanied by Stephen and various men walks through a vast lobby with high ceilings and huge windows then strides down a corridor and suddenly stops outside a room pausing for a moment before entering Charles slowly enters the room and a glass door shuts behind him He stands before a casket waits a moment then walks around to the head of the casket Seen from outside the room Charles's view is obscured by the frame of the glass door and a priest can be glimpsed speaking while Charles has his hand over his mouth looking in grief at the casket Later Tony sits in the backseat of a car driving down a motorway at daytime hands the phone to his female assistant then glances out the window Charles descends from a plane down some stairs shakes hands with Lord Airlie on the runway and walks over to meet various uniformed men standing nearby A line of soldiers carries a casket above their heads and Charles approaches Tony they both look at the soldiers with the casket Nelson Mandela appears on TV while the Queen fiddles with her pearl necklace and Phillip picks his fingernails while the Queen scratches her wrist At nighttime two Range Rovers pull into the courtyard at Balmoral and the Queen looks at the vehicles from an upstairs window She watches as two men exit from the lead vehicle then turns away from the window The others stare ahead dazed and incapable of movement as one man wipes tears from his eyes Another man approaches the front of Buckingham Palace and places a bouquet of flowers at the gate and more people arrive with bouquets of flowers to place at the railings Tony and Alistair watch Earl Spencer read a statement on TV when a woman enters A smiling Alistair puts down the phone and the woman hands Tony another phone Tony's hand covers the receiver as he waits a moment then raises the phone to speak As a servant arranges cutlery on a table Robin enters the dining room The Queen strides down a corridor with stags' heads mounted on the walls and two maids stand aside to let her pass In the study the Queen picks up a phone from a desk and sits behind the desk Cherie enters the room behind Tony and Prince Phillip enters the study wearing a kilt Tony sits on a sofa while Cherie stands close by he puts the phone down and Cherie moves around and catches his attention The Queen and the Queen Mother dressed in black walk to a nearby car while the Royal Family staff watch the broadcast and Robin stares impassively at Tony's image on the TV"
        }
      ]
    }
  ]
}