{
  "ground_truth": "She looks up at the sky, where the moon shines above. Forrest lies in a hammock on his boat, then stands at the helm and slowly glides by the docks. Noticing something, he bends down for a clearer view as Lt. Dan sits in his wheelchair on the deck. Forrest looks at Lt. Dan and smiles, surprised, while the boat glides and crushes a dock, which they both look at. Forrest's shrimping boat is alone on the gulf waters, and Forrest looks up to see Lt. Dan sitting in the rigging. Later, Forrest empties the net, while an all-black gospel choir sings and claps their hands. Lt. Dan sits at the back of the church, taking swigs from a liquor bottle. A catch of junk is dumped onto the deck as Lt. Dan lowers himself from the rigging. The wind starts to blow strong, water sprays on deck during a hurricane, and Lt. Dan shouts and shakes his fist from the rigging as wind and rain pelt him. Forrest slides back and forth as he tries to steer the boat. An anchorman on TV stands in front of a ruined pier and boats, while Forrest's boat comes down the river. Lt. Dan and Forrest empty their net, and a huge catch of shrimp falls onto the deck. They continue to open catch after catch, culminating in a huge haul, making both Forrest and Lt. Dan smile. A man sitting on a bench listens to Forrest recount this story as an elderly woman sits beside him. The man laughs and walks away, and the woman looks at both the magazine and Forrest with surprise. Forrest and Lt. Dan are seen working on the boat, and despite Forrest's mild surprise, Lt. Dan smiles and looks away before pulling himself out of his chair, jumping into the water. The television shows an assassination attempt on President Gerald Ford as Forrest and Lt. Dan have dinner on the deck. Forrest opens the door to find a doctor standing next to Mrs. Gump in bed, and the doctor looks down at Forrest's legs before leaving and closing the door. Forrest takes off his hat and steps over to her. Back with the elderly woman, she and Forrest sit as she cries, wiping her eyes with a hankie. A bus stops, and Forrest looks at her. Forrest rides a lawn tractor over the football field lawn, takes out a letter, and opens it while the choir and members sing. New furniture is taken inside, and a new cross is placed on the steeple.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She gazes up at the heavens, where the moon gleams above. Forrest reclines in a hammock on his vessel, then rises at the helm and leisurely drifts by the piers. Observing something, he stoops down for a clearer sight as Lt. Dan rests in his wheelchair on the deck. Forrest glances at Lt. Dan and grins, astonished, while the boat drifts and smashes a dock, which they both observe. Forrest's shrimping vessel is solitary on the gulf waters, and Forrest looks up to see Lt. Dan seated in the rigging. Later, Forrest unloads the net, while an all-black gospel choir sings and claps their palms. Lt. Dan sits at the rear of the chapel, taking gulps from a liquor bottle. A haul of debris is dumped onto the deck as Lt. Dan descends from the rigging. The breeze begins to blow strong, water splashes on deck during a hurricane, and Lt. Dan yells and shakes his fist from the rigging as wind and rain strike him. Forrest slides back and forth as he attempts to navigate the vessel. An anchorman on TV stands in front of a devastated dock and vessels, while Forrest's boat comes down the river. Lt. Dan and Forrest unload their net, and a huge haul of shrimp tumbles onto the deck. They persist to open catch after catch, culminating in a massive load, making both Forrest and Lt. Dan grin. A gentleman seated on a bench listens to Forrest narrate this tale as an elderly lady sits beside him. The man chuckles and departs, and the woman gazes at both the periodical and Forrest with astonishment. Forrest and Lt. Dan are observed laboring on the boat, and despite Forrest's mild amazement, Lt. Dan grins and gazes away before pulling himself out of his chair, diving into the water. The television shows an assassination attempt on President Gerald Ford as Forrest and Lt. Dan dine on the deck. Forrest opens the entryway to find a physician standing next to Mrs. Gump in the bed, and the physician gazes down at Forrest's legs before departing and shutting the door. Forrest removes his cap and steps over to her. Back with the elderly lady, she and Forrest sit as she weeps, wiping her eyes with a hankie. A coach halts, and Forrest gazes at her. Forrest rides a lawnmower over the football field lawn, takes out a missive, and opens it while the choir and members sing. New furnishings are taken inside, and a new cross is placed on the steeple."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The sky is looked up at by her, where the moon is shone upon by it. Forrest is lain in a hammock on his boat, then he stands at the helm, and the docks are slowly glided past by him. Something is noticed by him, so he bends down for a clearer view as Lt. Dan sits in his wheelchair on the deck. Lt. Dan is looked at by Forrest who smiles, surprised, while the docks are glided past and crushed by the boat, which are both looked at by them. Forrest's shrimping boat is alone on the gulf waters, and Lt. Dan is seen by Forrest sitting in the rigging. Later, the net is emptied by Forrest, while an all-black gospel choir is heard singing and clapping their hands. At the back of the church, Lt. Dan takes swigs from a liquor bottle. Junk is dumped onto the deck when Lt. Dan lowers himself from the rigging. The wind is started to blow strong, water is sprayed on deck during a hurricane, and Lt. Dan shouts and shakes his fist from the rigging as wind and rain pelt him. Back and forth, Forrest slides as the boat is tried to be steered by him. An anchorman on TV is shown standing in front of a ruined pier and boats, while the river is sailed down by Forrest's boat. The net is emptied by Lt. Dan and Forrest, and a huge catch of shrimp is seen falling onto the deck. Catch after catch is continued to be opened by them, culminating in a huge haul, making both Forrest and Lt. Dan smile. A man is listened to by a man sitting on a bench as Forrest recounts this story, with an elderly woman sitting beside him. Laughter is heard as he walks away, and surprise is shown on the woman's face as she looks at both the magazine and Forrest. Forrest and Lt. Dan are shown working on the boat, and despite mild surprise shown by Forrest, Lt. Dan smiles and looks away before he pulls himself out of his chair and jumps into the water. The television shows an assassination attempt on President Gerald Ford as dinner is had on the deck by Forrest and Lt. Dan. The door is opened by Forrest to find a doctor standing next to Mrs. Gump in bed, and Forrest’s legs are looked at by the doctor before he leaves and closes the door. The hat is taken off by Forrest, and he steps over to her. Back with the elderly woman, she and Forrest sit as tears are cried by her, wiping her eyes with a hankie. A bus is stopped, and she is looked at by Forrest. A lawn tractor is ridden by Forrest over the football field lawn, a letter is taken out and opened by him while the choir and members sing. Inside, new furniture is taken, and a new cross is placed on the steeple."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She gazes at the sky with the moon shining above. Forrest lies in a hammock on his boat, then stands at the helm, gliding by docks. He bends for a clearer view of Lt. Dan in his wheelchair on the deck. Surprised, Forrest smiles at Lt. Dan as the boat crushes a dock. Forrest's boat sails alone on the gulf waters, and he sees Lt. Dan in the rigging. Later, Forrest empties the net while a gospel choir sings and claps. Lt. Dan sits at the back of the church, drinking from a liquor bottle. A catch of junk lands on deck as Lt. Dan descends from the rigging. The wind blows fiercely during a hurricane; Lt. Dan shouts and shakes his fist as wind and rain hit him. Forrest slides while steering. On TV, an anchorman stands by a ruined pier as Forrest's boat sails down the river. Lt. Dan and Forrest empty their net, revealing a huge shrimp catch, making them smile. A man listening to Forrest's story on a bench laughs and leaves; a woman beside him looks at Forrest with surprise. Forrest and Lt. Dan continue working, and despite Forrest's mild surprise, Lt. Dan smiles, jumps into the water. On TV, there's news of an assassination attempt on President Ford while Forrest and Lt. Dan dine on deck. Forrest opens a door to find a doctor by Mrs. Gump in bed. The doctor looks at Forrest's legs, then leaves. Forrest removes his hat and approaches her. Back with the elderly woman, she cries and wipes her eyes. A bus stops, and Forrest looks at her. Forrest rides a lawn tractor on the field, reads a letter as the choir sings. New furniture is moved inside, and a new cross is placed on the steeple."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "She gazes at the sky, where the moon gleams. Forrest lies in a hammock on his boat, stands at the helm, and drifts by the docks. Seeing something, he bends for a better view as Lt. Dan sits in his wheelchair on the deck. Forrest smiles at Lt. Dan, shocked, while the boat crashes into a dock, which they both observe. Forrest's shrimping boat floats alone on the gulf, and Lt. Dan sits in the rigging. Later, Forrest empties the net as a gospel choir sings and claps. Lt. Dan takes swigs from a liquor bottle at the back of a church. Junk is dumped on the deck as Lt. Dan lowers himself. The wind blows fiercely, water sprays during a hurricane, and Lt. Dan shouts and shakes his fist from the rigging as rain and wind hit him. Forrest slides as he steers. A TV anchor stands by a ruined pier while Forrest's boat comes down the river. They empty their net, and a massive shrimp catch falls onto the deck. They continue to catch shrimp, making both smile. A man on a bench listens to Forrest's story as an elderly woman sits beside him. The man laughs and leaves, and the woman looks surprised at the magazine and Forrest. Forrest and Lt. Dan work on the boat, and despite Forrest's surprise, Lt. Dan smiles, pulls himself up, and jumps into the water. The TV shows an assassination attempt on President Ford as they dine on deck. Forrest finds a doctor by Mrs. Gump's bed, who looks at Forrest's legs and leaves. Forrest approaches her. The elderly woman sits with Forrest, crying into a hankie. A bus stops, and Forrest looks at her. Forrest rides a lawn tractor on the football field, opens a letter, and the choir sings. New furniture is moved inside, and a new cross is placed on the steeple."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "She raises her gaze to the sky above, where the bright moon casts its gentle light. Below, Forrest lies leisurely in a hammock on his boat, and then he gets up to take his place at the helm, allowing the boat to glide slowly past the docks. Spotting something of interest, he bends down for a clearer view, noticing Lt. Dan seated in his wheelchair on the deck. As Forrest glances at Lt. Dan, a surprised smile crosses his face, while their boat gracefully glides onward, colliding with a dock, drawing their mutual attention. Out on the expansive gulf waters, Forrest’s shrimping boat stands alone, prompting him to look up to see Lt. Dan perched high in the rigging. Later on, Forrest empties a net as an all-black gospel choir joyfully sings and claps their hands in celebration. Meanwhile, Lt. Dan positions himself at the back of the church, taking swigs from a liquor bottle. A tangled catch of junk is unceremoniously dumped onto the deck as Lt. Dan skillfully lowers himself from the rigging. The wind begins to blow with increasing intensity, and water sprays across the deck during a fierce hurricane. As Lt. Dan shakes his fist and shouts from the rigging, the wind and rain mercilessly pelt him. Forrest struggles to maintain balance, sliding back and forth as he attempts to steer the boat through the storm. On television, an anchorman delivers the news, standing in front of a ruined pier and damaged boats, while Forrest’s boat emerges, moving down the river. Together, Lt. Dan and Forrest empty their net, and a massive catch of shrimp spills onto the deck, their effort rewarded. They persist, opening catch after catch, ultimately gathering an impressive haul that brings broad smiles to both Forrest's and Lt. Dan's faces. Meanwhile, a man seated on a bench listens intently to Forrest recount this vibrant story, with an elderly woman seated beside him. Amused, the man laughs and eventually walks away, while the woman looks at both the magazine and Forrest with an expression of surprise. Forrest and Lt. Dan are later seen diligently working on the boat, and despite Forrest’s mild surprise, Lt. Dan smiles, looks away, and without hesitation, pulls himself from his chair to leap into the water. On television, there’s coverage of an assassination attempt on President Gerald Ford, as Forrest and Lt. Dan enjoy dinner on the deck. When Forrest opens the door, he finds a doctor standing by the bedside of Mrs. Gump, who looks down at Forrest's legs before departing, leaving and closing the door behind. Solemnly, Forrest removes his hat and steps over to her side. Back with the elderly woman, both she and Forrest remain seated as she wipes tears from her eyes with a hankie. A bus comes to a stop, prompting Forrest to look at her. He rides a lawn tractor over the lush, green football field lawn, taking out a letter and opening it while the choir and its members sing joyously. New furniture is carefully carried inside, and a new cross is placed prominently on the steeple, symbolizing renewal and hope."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "She gently lifts her gaze towards the expansive sky above, where the radiant, luminous moon generously casts its gentle, soothing light upon everything below. Meanwhile, down below, Forrest lies relaxed and leisurely in a comfortable hammock on his boat, and then decides to get up to take his designated place at the helm, allowing the boat to glide at a slow and steady pace past the docks. Spotting something that piques his interest, he bends down for a clearer and closer view, noticing Lt. Dan seated in his wheelchair on the deck. As Forrest glances at Lt. Dan, a smile of surprise spreads across his face, while their boat continues its graceful glide onward, eventually colliding with a dock, abruptly drawing both of their mutual attention. Out on the wide, expansive gulf waters, Forrest’s shrimping boat stands solitary and alone, prompting him to look up to see Lt. Dan perched high up in the rigging. Later on, Forrest empties a net as an all-black gospel choir joyfully sings and claps their hands in euphoric celebration. Meanwhile, Lt. Dan positions himself quietly at the back of the church, taking swigs from a liquor bottle with increasing fervor. A tangled, chaotic catch of junk is unceremoniously dumped onto the deck as Lt. Dan skillfully and adeptly lowers himself from the rigging. The wind begins to blow with ever-increasing intensity, and water sprays wildly across the deck during a fierce and unrelenting hurricane. As Lt. Dan shakes his fist defiantly and shouts from the rigging, the wind and rain mercilessly pelt him with force. Forrest struggles mightily to maintain his balance, sliding back and forth as he determinedly attempts to steer the boat through the formidable storm. On television, an anchorman stands in front of a ruined pier and damaged boats, delivering the news, while Forrest’s boat emerges, moving steadily down the river. Together, both Lt. Dan and Forrest empty their net, and a massive, bountiful catch of shrimp spills generously onto the deck, rewarding their effort. They persistently continue, opening catch after catch, ultimately gathering an impressive haul that brings broad, genuine smiles to both Forrest's and Lt. Dan's faces. Meanwhile, a man seated on a bench listens intently to Forrest as he recounts this vibrant story, with an elderly woman seated beside him. Amused, the man laughs heartily and eventually walks away, while the woman looks both at the magazine and at Forrest with an expression filled with surprise. Forrest and Lt. Dan are later seen working diligently on the boat, and despite Forrest’s mild surprise, Lt. Dan smiles warmly, looks away, and without a moment's hesitation, pulls himself from his chair to leap gracefully into the water. On television, there’s live coverage of an assassination attempt on President Gerald Ford, as Forrest and Lt. Dan enjoy dinner together on the deck. When Forrest opens the door, he finds a solemn doctor standing by the bedside of Mrs. Gump, who then looks down at Forrest's legs before departing, leaving and closing the door gently behind him. Solemnly, Forrest removes his hat and steps over to her side. Back with the elderly woman, both she and Forrest remain seated as she wipes tears from her eyes with a hankie. A bus comes to a complete stop, prompting Forrest to look thoughtfully at her. He then rides a lawn tractor over the lush, green football field lawn, taking out a letter and opening it while the choir and its members sing joyously. New furniture is carefully and thoughtfully carried inside, and a new cross is placed prominently on the steeple, symbolizing both renewal and hope."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She lifts her gaze toward the sky, taking in the sight of the moon as it casts its gentle glow from above. In a tranquil moment aboard his boat, Forrest reclines in a hammock, allowing himself a moment of rest before rising to his feet and assuming a position at the helm. With deliberate movements, he navigates the boat slowly past the docks, observing his surroundings with intent. As he catches sight of something intriguing, he leans forward, bending down to gain a clearer view, while nearby, Lt. Dan remains seated in his wheelchair on the deck. Forrest turns his attention toward Lt. Dan, a smile spreading across his face as he registers a sense of surprise. Meanwhile, the boat continues its smooth glide, inadvertently colliding with a dock, a sight that draws both their gazes. Out on the expansive gulf waters, Forrest's shrimping boat stands alone, and he gazes upward to discover Lt. Dan perched in the rigging. In time, Forrest goes about the task of emptying the net, a process accompanied by the resonant voices and rhythmic hand claps of an all-black gospel choir. At the rear of the church, Lt. Dan occupies a spot, intermittently raising a liquor bottle to his lips. As the net releases its contents, a jumble of junk spills out onto the deck, at the same time as Lt. Dan descends from his position in the rigging. A fierce wind picks up, signaling the onset of a hurricane, and as water sprays across the deck, Lt. Dan energetically calls out and shakes his fist from his high perch in the rigging, defiantly challenging the pelting wind and rain. Forrest, amid the chaos, slides back and forth with the boat's motion as he attempts to maintain control at the helm. On television, an anchorman stands amidst the aftermath of destruction, the ruined pier and boats serving as his backdrop, just as Forrest's vessel makes its way down the river. Together, Lt. Dan and Forrest work in unison, emptying their net and watching as an abundance of shrimp cascades onto the deck. Their efforts yield continuous success as they open catch after catch, each contributing to an impressive haul that brings broad smiles to their faces. As Forrest recounts this tale, a man sharing the bench listens with interest, while an elderly woman also sits beside him. The man, amused, rises with a laugh and departs, leaving the woman to glance with surprise between the magazine in her hand and Forrest. In another scene, Forrest and Lt. Dan are hard at work on the boat; despite a flicker of surprise from Forrest, Lt. Dan grins and looks away, eventually hoisting himself from his wheelchair and leaping into the water with a sense of freedom. On television, news broadcasts the attempted assassination of President Gerald Ford, while aboard the deck, Forrest and Lt. Dan share a meal. Transitioning to another moment, Forrest opens a door to reveal a doctor standing beside Mrs. Gump, who is resting in bed. The doctor briefly surveys Forrest's legs before taking his leave, closing the door softly behind him. Forrest, affected by the moment, removes his hat and steps closer to her. Returning to the scene with the elderly woman, she and Forrest sit together, her emotions overwhelming her as she dabs her eyes with a hankie. A bus arrives, coming to a stop as Forrest regards her. The scene shifts to Forrest maneuvering a lawn tractor over the expanse of a football field, where he pauses to retrieve and unfold a letter, all while a choir and congregation lend their voices in song. New furnishings find placement inside, and a freshly installed cross adorns the steeple, marking a new chapter."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "She gazes at the moonlit sky while Forrest relaxes in a hammock before taking the helm of his boat, gliding past the docks. Spotting Lt. Dan on deck in his wheelchair, Forrest smiles in surprise as they inadvertently collide with a dock. Alone on the gulf waters, Forrest observes Lt. Dan perched in the rigging. Later, while Forrest empties the net to the accompaniment of an all-black gospel choir's singing and clapping, Lt. Dan, drinking from a liquor bottle, sits at the back of a church. Amidst a storm, Lt. Dan shouts defiantly from the rigging, urging Forrest to maintain the boat's course as wind and rain batter them. Overcoming the storm's aftermath, they navigate downriver and, with smiles, haul in a massive catch of shrimp. Forrest shares this tale with a man on a bench, who leaves laughing, while an elderly woman beside him looks on in surprise. On the boat, Lt. Dan, smiling despite Forrest's mild surprise, stands from his wheelchair and leaps into the water. Meanwhile, a TV reports a failed assassination attempt on President Gerald Ford as they dine. Forrest later visits his ailing mother with a doctor at her bedside, removing his hat and stepping close to her. Back with the elderly woman, Forrest comforts her as she weeps, wiping her eyes. A bus stops, and Forrest watches her. Riding a lawn tractor across a football field, Forrest reads a letter as the choir sings. New furniture arrives, and a cross is placed atop the steeple."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She looks up at the sky, where the moon shines above, casting a gentle glow reminiscent of the celestial beauty that guided ancient mariners. Forrest lies in a hammock on his boat, a shrimping vessel he named Jenny after his childhood friend, then stands at the helm and slowly glides by the docks of Bayou La Batre, a small fishing community known for its seafood. Noticing something, he bends down for a clearer view as Lt. Dan, a Vietnam War veteran who lost his legs in battle, sits in his wheelchair on the deck. Forrest looks at Lt. Dan and smiles, surprised, while the boat glides and inadvertently crushes a dock, which they both look at, knowing they'll have to make amends. Forrest's shrimping boat is alone on the expansive gulf waters, and Forrest looks up to see Lt. Dan sitting in the rigging, a place where the sails are managed but now serves as his lookout point. Later, Forrest empties the net, while an all-black gospel choir, reminiscent of those traditionally singing in Southern Baptist churches, sings and claps their hands. Lt. Dan sits at the back of the church, taking swigs from a liquor bottle, a sign of his ongoing struggle with the challenges post-war life brings. A catch of junk is dumped onto the deck as Lt. Dan lowers himself from the rigging, his agility showing despite his previous despair. The wind starts to blow strong, characteristic of the infamous hurricane season along the Gulf Coast, and water sprays on deck during a hurricane, as Lt. Dan shouts defiantly and shakes his fist from the rigging as wind and rain pelt him, a cathartic moment of release. Forrest slides back and forth as he tries to steer the boat through the storm, determined to survive. An anchorman on TV stands in front of a ruined pier and boats, reporting on the catastrophic aftermath of the hurricane, while Forrest's boat comes down the river, remarkably undamaged. Lt. Dan and Forrest empty their net, and a huge catch of shrimp, a fortune in the seafood industry, falls onto the deck. They continue to open catch after catch, culminating in a huge haul, making both Forrest and Lt. Dan smile, their shrimping business a success against the odds. A man sitting on a bench listens to Forrest recount this story in a park in Savannah, Georgia, as an elderly woman sits beside him. The man laughs and walks away, and the woman looks at both the magazine, a local publication showcasing success stories, and Forrest with surprise. Forrest and Lt. Dan are seen working on the boat, and despite Forrest's mild surprise at Lt. Dan's newfound joy, Lt. Dan smiles and looks away before pulling himself out of his chair, his strength and transformation evident, jumping into the water. The television shows an assassination attempt on President Gerald Ford in 1975, a moment of national shock, as Forrest and Lt. Dan have dinner on the deck, reflecting on how far they've come. Forrest opens the door to find a doctor standing next to Mrs. Gump in bed, her illness keeping her there, and the doctor looks down at Forrest's legs, perhaps recalling his own previous medical issues, before leaving and closing the door. Forrest takes off his hat and steps over to her, offering comfort. Back with the elderly woman, she and Forrest sit as she cries, deeply moved by his story, wiping her eyes with a hankie. A bus stops, a symbol of ongoing journeys and change, and Forrest looks at her. Forrest rides a lawn tractor over the football field lawn at the University of Alabama, where he once famously ran, takes out a letter, and opens it while the choir and members sing, filling the air with hope. New furniture is taken inside, signaling a fresh start, and a new cross is placed on the steeple, symbolizing renewed faith and strength."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "She looks up at the sky where the moon shines above. Forrest lies in a hammock on his boat then stands at the helm and slowly glides by the docks. Noticing something he bends down for a clearer view. as Lt Dan sits in his wheelchair on the deck. Forrest looks at Lt Dan and smiles surprised while the boat glides and crushes a dock which they both look at. Forrest's shrimping boat is alone on the gulf waters and Forrest looks up to see Lt Dan sitting in the rigging. Later Forrest empties the net while an allblack gospel choir sings and claps their hands. Lt Dan sits at the back of the church taking swigs from a liquor bottle. A catch of junk is dumped onto the deck as Lt Dan lowers himself from the rigging. The wind starts to blow. strong water sprays on deck during a hurricane and Lt Dan shouts and shakes his fist from the rigging as wind and rain pelt him. Forrest slides back and forth as he tries to steer the boat. An anchorman on TV stands in front of a ruined pier and boats while Forrest's boat comes down the river. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Lt Dan and Forrest empty their net and a huge catch of shrimp falls onto the deck. They continue to open catch after catch culminating in a huge haul making both Forrest and Lt Dan smile. A man sitting on a bench listens to Forrest recount this story as an elderly woman sits beside him. The man laughs and walks away and the woman looks at both the magazine and Forrest with surprise. Forrest and Lt Dan are seen working on the boat and despite Forrest's mild surprise Lt Dan smiles and looks away before pulling himself out of his chair jumping into the water. The television shows an assassination attempt on President Gerald Ford. as Forrest and Lt Dan have dinner on the deck Forrest opens the door to find a doctor standing next to Mrs Gump in bed and the doctor looks down at Forrest's legs before leaving and closing the door. Forrest takes off his hat and steps over to her. Back with the elderly woman she and Forrest sit as she cries wiping her eyes with a hankie. A bus stops and Forrest looks at her. Forrest rides a lawn tractor over the football field. lawn takes out a letter and opens it while the choir and members sing. New furniture is taken inside and a new cross is placed on the steeple."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "She looks up at the sky where the moon shines above. Forrest lies in a hammock on his boat then stands at the helm and slowly glides by the docks. Noticing something he bends down for a clearer view. as Lt Dan sits in his wheelchair on the deck. Forrest looks at Lt Dan and smiles surprised while the boat glides and crushes a dock which they both look at. Forrest's shrimping boat is alone on the gulf waters and Forrest looks up to see Lt Dan sitting in the rigging. Later Forrest empties the net while an allblack gospel choir sings and claps their hands. Lt Dan sits at the back of the church taking swigs from a liquor bottle. A catch of junk is dumped onto the deck as Lt Dan lowers himself from the rigging. The wind starts to blow. strong water sprays on deck during a hurricane and Lt Dan shouts and shakes his fist from the rigging as wind and rain pelt him. Forrest slides back and forth as he tries to steer the boat. An anchorman on TV stands in front of a ruined pier and boats while Forrest's boat comes down the river. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Lt Dan and Forrest empty their net and a huge catch of shrimp falls onto the deck. They continue to open catch after catch culminating in a huge haul making both Forrest and Lt Dan smile. A man sitting on a bench listens to Forrest recount this story as an elderly woman sits beside him. The man laughs and walks away and the woman looks at both the magazine and Forrest with surprise. Forrest and Lt Dan are seen working on the boat and despite Forrest's mild surprise Lt Dan smiles and looks away before pulling himself out of his chair jumping into the water. The television shows an assassination attempt on President Gerald Ford. as Forrest and Lt Dan have dinner on the deck Forrest opens the door to find a doctor standing next to Mrs Gump in bed and the doctor looks down at Forrest's legs before leaving and closing the door. Forrest takes off his hat and steps over to her. Back with the elderly woman she and Forrest sit as she cries wiping her eyes with a hankie. A bus stops and Forrest looks at her. Forrest rides a lawn tractor over the football field. lawn takes out a letter and opens it while the choir and members sing. New furniture is taken inside and a new cross is placed on the steeple."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "She looks up at the sky where the moon shines above. Forrest lies in a hammock on his boat then stands at the helm and slowly glides by the docks. Noticing something he bends down for a clearer view. as Lt Dan sits in his wheelchair on the deck. Forrest looks at Lt Dan and smiles surprised while the boat glides and crushes a dock which they both look at. Forrest's shrimping boat is alone on the gulf waters and Forrest looks up to see Lt Dan sitting in the rigging. Later Forrest empties the net while an allblack gospel choir sings and claps their hands. Forrest takes off his hat and steps over to her. Back with the elderly woman she and Forrest sit as she cries wiping her eyes with a hankie. A bus stops and Forrest looks at her. Forrest rides a lawn tractor over the football field. lawn takes out a letter and opens it while the choir and members sing. New furniture is taken inside and a new cross is placed on the steeple."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "She looks up at the sky where the moon shines above. Forrest lies in a hammock on his boat then stands at the helm and slowly glides by the docks. Noticing something he bends down for a clearer view. Forrest rides a lawn tractor over the football field. lawn takes out a letter and opens it while the choir and members sing. New furniture is taken inside and a new cross is placed on the steeple."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "She gazes at the ocean, where the sun dazzles below. Oliver reclines in a hammock on his plane, then leaps to the cockpit and swiftly floats past the mountains. Spotting something, he crouches for a sharper look as Mr. Green perches in his skateboard on the wing. Oliver glances at Mr. Green and giggles, astonished, while the plane drifts and splinters a mountain, which they both gaze at. Oliver's fishing plane is alone on the desert sands, and Oliver peers up to see Mr. Green dangling from the parachute. Later, Oliver pours out the bucket, while a polka-dotted jazz band dances and stomps their feet. Mr. Green stands at the entrance of the library, sipping from a milk carton. A heap of leaves is tipped onto the wing as Mr. Green climbs down from the parachute. The breeze begins to whirl furious, dust scatters on wing during a blizzard, and Mr. Green whistles and waves his umbrella from the parachute as snow and ice whip him. Oliver rolls up and down as he attempts to navigate the plane. A weatherman on radio sits behind a broken bridge and trains, while Oliver's plane flies up the mountain. Mr. Green and Oliver dump their bucket, and a giant pile of apples rolls onto the wing. They proceed to uncover load after load, culminating in an enormous bounty, making both Oliver and Mr. Green grin. A dog sitting on a bench overhears Oliver narrate this tale as a young girl sits beside him. The dog barks and trots away, and the girl glances at both the newspaper and Oliver with astonishment. Oliver and Mr. Green are spotted jogging on the aircraft, and despite Oliver's slight disbelief, Mr. Green beams and looks aside before leaping from his cart, diving into the sand. The radio broadcasts a rescue mission for Prime Minister Margaret Thatcher as Oliver and Mr. Green feast in the pilot's seat. Oliver closes the window to spot a teacher resting next to Mrs. Bell on a couch, and the teacher glances up at Oliver's arms before departing and opening the window. Oliver removes his helmet and tiptoes toward her. Back with the young girl, she and Oliver relax as she sobs, dabbing her cheeks with a napkin. A train slows down, and Oliver watches her. Oliver drives a scooter across the golf course sand, takes out a photograph, and examines it while the band and dancers perform. Old paintings are carried outside, and an old clock is placed on the tower."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Forrest lies in a hammock on his boat, then steers it by the docks, spotting Lt. Dan in his wheelchair. As the boat crushes a dock, Forrest and Lt. Dan exchange surprised smiles. Later, Forrest empties the net to a gospel choir's song, while Lt. Dan drinks at the back of the church. During a hurricane, Lt. Dan challenges the storm from the rigging, while Forrest struggles to steer. On TV, an anchorman reports on ruined piers, as Forrest's boat returns. They catch heaps of shrimp, making both smile. Forrest recounts his story to a man on a bench; an elderly woman listens in surprise. Despite Forrest's surprise, Lt. Dan smiles, swims, and later joins Forrest for dinner amid news of President Ford's assassination attempt. Forrest finds a doctor with Mrs. Gump, who looks at his legs before leaving. Back with the elderly woman, she cries as Forrest looks on. Forrest rides a lawn tractor, reads a letter, and observes new furniture and a cross being placed on a church steeple."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "New furniture is taken inside and a new cross is placed on the steeple lawn takes out a letter and opens it while the choir and members sing Forrest rides a lawn tractor over the football field A bus stops and Forrest looks at her Back with the elderly woman she and Forrest sit as she cries wiping her eyes with a hankie Forrest takes off his hat and steps over to her as Forrest and Lt Dan have dinner on the deck Forrest opens the door to find a doctor standing next to Mrs Gump in bed and the doctor looks down at Forrest's legs before leaving and closing the door The television shows an assassination attempt on President Gerald Ford Forrest and Lt Dan are seen working on the boat and despite Forrest's mild surprise Lt Dan smiles and looks away before pulling himself out of his chair jumping into the water The man laughs and walks away and the woman looks at both the magazine and Forrest with surprise A man sitting on a bench listens to Forrest recount this story as an elderly woman sits beside him They continue to open catch after catch culminating in a huge haul making both Forrest and Lt Dan smile Lt Dan and Forrest empty their net and a huge catch of shrimp falls onto the deck An anchorman on TV stands in front of a ruined pier and boats while Forrest's boat comes down the river Forrest slides back and forth as he tries to steer the boat strong water sprays on deck during a hurricane and Lt Dan shouts and shakes his fist from the rigging as wind and rain pelt him The wind starts to blow A catch of junk is dumped onto the deck as Lt Dan lowers himself from the rigging Lt Dan sits at the back of the church taking swigs from a liquor bottle Later Forrest empties the net while an allblack gospel choir sings and claps their hands Forrest's shrimping boat is alone on the gulf waters and Forrest looks up to see Lt Dan sitting in the rigging Forrest looks at Lt Dan and smiles surprised while the boat glides and crushes a dock which they both look at as Lt Dan sits in his wheelchair on the deck Noticing something he bends down for a clearer view Forrest lies in a hammock on his boat then stands at the helm and slowly glides by the docks She looks up at the sky where the moon shines above"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Forrest lies in a hammock on his boat then stands at the helm and slowly glides by the docks She looks up at the sky where the moon shines above as Lt Dan sits in his wheelchair on the deck Noticing something he bends down for a clearer view Forrest's shrimping boat is alone on the gulf waters and Forrest looks up to see Lt Dan sitting in the rigging Forrest looks at Lt Dan and smiles surprised while the boat glides and crushes a dock which they both look at Lt Dan sits at the back of the church taking swigs from a liquor bottle Later Forrest empties the net while an allblack gospel choir sings and claps their hands The wind starts to blow A catch of junk is dumped onto the deck as Lt Dan lowers himself from the rigging Forrest slides back and forth as he tries to steer the boat strong water sprays on deck during a hurricane and Lt Dan shouts and shakes his fist from the rigging as wind and rain pelt him Lt Dan and Forrest empty their net and a huge catch of shrimp falls onto the deck An anchorman on TV stands in front of a ruined pier and boats while Forrest's boat comes down the river A man sitting on a bench listens to Forrest recount this story as an elderly woman sits beside him They continue to open catch after catch culminating in a huge haul making both Forrest and Lt Dan smile Forrest and Lt Dan are seen working on the boat and despite Forrest's mild surprise Lt Dan smiles and looks away before pulling himself out of his chair jumping into the water The man laughs and walks away and the woman looks at both the magazine and Forrest with surprise as Forrest and Lt Dan have dinner on the deck Forrest opens the door to find a doctor standing next to Mrs Gump in bed and the doctor looks down at Forrest's legs before leaving and closing the door The television shows an assassination attempt on President Gerald Ford Back with the elderly woman she and Forrest sit as she cries wiping her eyes with a hankie Forrest takes off his hat and steps over to her Forrest rides a lawn tractor over the football field A bus stops and Forrest looks at her New furniture is taken inside and a new cross is placed on the steeple lawn takes out a letter and opens it while the choir and members sing"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Lt Dan and Forrest empty their net and a huge catch of shrimp falls onto the deck They continue to open catch after catch culminating in a huge haul making both Forrest and Lt Dan smile A man sitting on a bench listens to Forrest recount this story as an elderly woman sits beside him The man laughs and walks away and the woman looks at both the magazine and Forrest with surprise Forrest and Lt Dan are seen working on the boat and despite Forrest's mild surprise Lt Dan smiles and looks away before pulling himself out of his chair jumping into the water The television shows an assassination attempt on President Gerald Ford as Forrest and Lt Dan have dinner on the deck Forrest opens the door to find a doctor standing next to Mrs Gump in bed and the doctor looks down at Forrest's legs before leaving and closing the door Forrest takes off his hat and steps over to her Back with the elderly woman she and Forrest sit as she cries wiping her eyes with a hankie A bus stops and Forrest looks at her Forrest rides a lawn tractor over the football field lawn takes out a letter and opens it while the choir and members sing New furniture is taken inside and a new cross is placed on the steeple She looks up at the sky where the moon shines above Forrest lies in a hammock on his boat then stands at the helm and slowly glides by the docks Noticing something he bends down for a clearer view as Lt Dan sits in his wheelchair on the deck Forrest looks at Lt Dan and smiles surprised while the boat glides and crushes a dock which they both look at Forrest's shrimping boat is alone on the gulf waters and Forrest looks up to see Lt Dan sitting in the rigging Later Forrest empties the net while an allblack gospel choir sings and claps their hands Lt Dan sits at the back of the church taking swigs from a liquor bottle A catch of junk is dumped onto the deck as Lt Dan lowers himself from the rigging The wind starts to blow strong water sprays on deck during a hurricane and Lt Dan shouts and shakes his fist from the rigging as wind and rain pelt him Forrest slides back and forth as he tries to steer the boat An anchorman on TV stands in front of a ruined pier and boats while Forrest's boat comes down the river"
        }
      ]
    }
  ]
}