{
  "ground_truth": "The Queen gives the corgis food, and the corgis look up at her before running through the clearing. Video footage shows crowds of people lining up in a queue, and a sign is seen. All around, the ground is covered in floral tributes. Later, Charles talks with Steven, and Tony looks at Cherie before leaving her with her paperwork. Elsewhere, the Queen sits at a desk writing in a book, but she suddenly stops writing. The next day, three Land Rovers drive away from Balmoral. On Wednesday, Robin stares out of a window, with a blond woman sitting behind him, and a man sticks his hand up as Tony stares back at them. The Queen signs the letter, and Robin looks from Prince Philip to the Queen. The Queen walks over to a desk, sits down, picks up a phone, and glances at the sun. The Queen puts Tony on the speaker and glances at Prince Philip, then arranges pens and a magnifying glass on the desk. Tony casts his eyes skyward, stands up, and looks out of the window, still gazing out before picking up the phone on his desk. Tony puts down the phone, pauses, then leaves his office, stroking his chin thoughtfully and stops beside a female secretary who sits behind a desk. At Balmoral, the Queen exits a Land Rover and enters a building. The Land Rover drives through the hilly and woody countryside with the Queen in the driving seat, continuing along a long, bumpy, and barren road parallel to a river. The road runs down to the river's edge, and the Queen plows into the waters. As she heads across the ford, rocks and potholes on the riverbed jolt the car, and the Land Rover comes to a sudden, violent halt in the middle of the river. The Queen steps out of the car, into the mountain waters, and inspects the underneath of the vehicle, continuing to examine other parts of the Land Rover. The Queen holds a mobile phone and dials a number. Back at Balmoral, Thomas sits at a desk, and the Queen hangs up the phone, then removes the headscarf she is wearing. She gazes at the serene countryside surroundings, shuts her eyes for a moment, looks down, frowns, then looks up. The vast landscape dwarfs the figure of the Queen, who sits on the riverbank by the vehicle. The Queen remains seated, her back turned away, and her body gently rocks as she starts to sob. After a few moments, she turns to her left and sees a stag on the opposite side of the river, which stands still.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The Monarch provides the corgis sustenance, and the corgis gaze up at her before sprinting through the glade. Video recording displays throngs of individuals forming a line, and a placard is observed. All around, the terrain is blanketed in floral offerings. Later, Charles converses with Steven, and Tony glances at Cherie before departing from her with her documentation. Elsewhere, the Monarch is seated at a bureau composing in a tome, but she abruptly ceases composing. The following day, three Land Rovers depart from Balmoral. On Wednesday, Robin gazes out of a pane, with a fair-haired lady seated behind him, and a gentleman raises his hand as Tony gazes back at them. The Monarch endorses the missive, and Robin glances from Prince Philip to the Monarch. The Monarch strides over to a bureau, sits down, picks up a receiver, and glances at the sun. The Monarch places Tony on the speaker and glances at Prince Philip, then organizes writing implements and a magnifier on the bureau. Tony lifts his eyes skyward, stands up, and peers out of the pane, still gazing out before picking up the receiver on his bureau. Tony sets down the receiver, hesitates, then exits his workspace, caressing his chin pensively and halts beside a female assistant who is seated behind a bureau. At Balmoral, the Monarch departs a Land Rover and enters a structure. The Land Rover travels through the hilly and wooded landscape with the Monarch in the driver’s seat, continuing along a lengthy, rugged, and desolate path parallel to a stream. The path runs down to the stream’s brink, and the Monarch plunges into the waters. As she maneuvers across the ford, stones and cavities on the riverbed jolt the vehicle, and the Land Rover comes to an abrupt, fierce stop in the center of the stream. The Monarch steps out of the vehicle, into the mountain waters, and inspects the undercarriage of the conveyance, continuing to examine other sections of the Land Rover. The Monarch holds a cellular phone and dials a numeral. Back at Balmoral, Thomas is seated at a bureau, and the Monarch hangs up the receiver, then removes the headscarf she is wearing. She gazes at the tranquil countryside surroundings, closes her eyes for a moment, looks down, scowls, then looks up. The vast landscape dwarfs the figure of the Monarch, who is seated on the riverbank by the conveyance. The Monarch remains seated, her back turned away, and her body gently rocks as she begins to weep. After a few moments, she turns to her left and sees a stag on the opposing side of the stream, which stands still."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Food is given to the corgis by the Queen, and she is looked up to by the corgis before they run through the clearing. Crowds of people are shown lining up in a queue by video footage, and someone sees a sign. Floral tributes cover the ground all around. Later, Steven talks with Charles, and Cherie is looked at by Tony before he leaves her with her paperwork. Elsewhere, a desk is sat at by the Queen as she writes in a book, but writing is suddenly stopped by her. The next day, Balmoral is driven away from by three Land Rovers. On Wednesday, Robin is stared at by a blond woman sitting behind him, and his hand is stuck up by a man as Tony stares back at them. The letter is signed by the Queen, and Prince Philip and the Queen are looked at by Robin. A desk is walked over to by the Queen, and a phone is picked up by her after she sits down, and the sun is glanced at. Tony is put on speaker by the Queen, and she arranges pens and a magnifying glass on the desk while glancing at Prince Philip. Tony casts his eyes skyward, stands up, and looks out of the window, still gazing out before he picks up the phone on his desk. The phone is put down by Tony, he pauses, and then his office is left by him, as he thoughtfully strokes his chin and stops beside a female secretary who sits behind a desk. At Balmoral, a Land Rover is exited by the Queen, and a building is entered by her. The hilly and woody countryside is driven through by the Land Rover with the Queen in the driving seat, continuing along a long, bumpy, and barren road parallel to a river. The road runs down to the river's edge, and the waters are plowed into by the Queen. As she heads across the ford, the car is jolted by rocks and potholes on the riverbed, and a sudden, violent halt is made by the Land Rover in the middle of the river. The car is stepped out of by the Queen, into the mountain waters, and the underneath of the vehicle is inspected by her, as she continues to examine other parts of the Land Rover. A mobile phone is held by the Queen, and a number is dialed by her. Back at Balmoral, a desk is sat at by Thomas, and the phone is hung up by the Queen, then the headscarf she is wearing is removed. The serene countryside surroundings are gazed at by her, her eyes are shut for a moment, she looks down, frowns, then looks up. The figure of the Queen, who sits on the riverbank by the vehicle, is dwarfed by the vast landscape. The Queen remains seated, her back turned away, and her body is gently rocked as sobbing is started by her. After a few moments, she turns to her left and sees a stag on the opposite side of the river, which stands still."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The Queen feeds the corgis, who look up at her before running through the clearing. Crowds line up, and a sign is visible amid floral tributes. Later, Charles talks to Steven, and Tony leaves Cherie with her paperwork. Elsewhere, the Queen stops writing at her desk. The next day, three Land Rovers leave Balmoral. Robin stares out a window at a blond woman as a man raises his hand, and Tony observes them. The Queen signs a letter; Robin looks from Prince Philip to her. She sits at a desk, picks up a phone, glances at the sun, puts Tony on speaker, and arranges items on the desk. Tony gazes outside before using the phone, then leaves his office, pausing by a secretary. At Balmoral, the Queen exits a Land Rover and enters a building. Driving through hilly woods, she navigates a barren road by a river, plunges into the ford, and the car halts abruptly. The Queen steps into the river to inspect the vehicle. She uses her mobile phone, and back at Balmoral, Thomas sits at a desk as she hangs up and removes her headscarf. The Queen reflects on the landscape, closes her eyes, frowns, and gazes at the vast scene. She sits by the riverbank, sobbing quietly, then turns to see a stag standing across the river."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The Queen feeds the corgis, who look up before running through the clearing. Footage shows crowds queuing with floral tributes visible. Later, Charles talks to Steven, and Tony leaves Cherie with paperwork. The Queen writes at a desk, then stops. Three Land Rovers leave Balmoral the next day. Wednesday, Robin stares out a window, a blonde woman behind him, as a man raises his hand and Tony stares back. The Queen signs a letter, Robin looks from Prince Philip to her. She sits at a desk, phones Tony, and arranges pens and a magnifying glass. Tony gazes out the window, then uses his phone. He pauses, leaves his office, and stops by a female secretary. At Balmoral, the Queen exits a Land Rover, drives through the countryside, and plows into a river. The Land Rover halts in the water, and she inspects it. The Queen uses her mobile, hangs up, and removes her headscarf. She gazes at the landscape, shuts her eyes, frowns, then sits by the riverbank. The Queen sobs gently, turns, and sees a stag across the river."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The Queen graciously offers food to the corgis, who then look up at her expectantly before eagerly racing through the open clearing. Video footage reveals large crowds of people patiently lining up in an orderly queue, and a prominent sign is visible in the background. All around, the ground is beautifully covered in an impressive array of floral tributes, a sight to behold. Later on, Charles engages in conversation with Steven, while Tony glances at Cherie before ultimately leaving her with her extensive paperwork. In a different setting, the Queen is seated at a desk, diligently writing in a book, but she suddenly halts her writing unexpectedly. The following day, three Land Rovers are seen driving away from Balmoral. On Wednesday, Robin is observed staring thoughtfully out of a window, with a blond woman quietly sitting behind him, and a man raises his hand as Tony stares back at them intently. The Queen proceeds to sign the letter, and Robin shifts his gaze from Prince Philip to the Queen with a discerning look. The Queen walks with purpose over to a desk, where she sits down, picks up a telephone, and casts a glance at the shining sun. The Queen places Tony on the speakerphone and then shares a glance with Prince Philip, before methodically arranging pens and a magnifying glass on the desk's surface. Tony directs his eyes skyward, stands up, and continues to look out of the window for a brief moment before reaching to pick up the telephone on his desk. Tony then gently places the phone back down, pauses with a thoughtful expression, and leaves his office, while thoughtfully stroking his chin, and stops momentarily beside a female secretary who is seated behind a desk. At Balmoral, the Queen gracefully exits a Land Rover and enters a nearby building. The Land Rover makes its way through the hilly and wooded countryside with the Queen confidently at the wheel. It continues along a long, bumpy, and barren road that runs parallel to a river. The road descends to the very edge of the river, where the Queen drives the vehicle into the water. As the Queen navigates across the ford, the rocks and numerous potholes on the riverbed cause the car to jolt sharply, and the Land Rover abruptly comes to a sudden, violent halt in the middle of the river. The Queen steps out of the vehicle into the cold mountain waters and begins to inspect the underside of the car, inspecting other parts of the Land Rover as well. The Queen then takes out a mobile phone and dials a number. Back at Balmoral, Thomas is seen sitting at a desk, and the Queen hangs up the phone, then removes the headscarf she has been wearing. She gazes contemplatively at the calm and serene countryside surroundings, allowing herself a moment of reflection. She closes her eyes briefly, looks down with a frown, then lifts her gaze back up. The enormous landscape appears to dwarf the figure of the Queen, who is now sitting alone on the riverbank by the vehicle. The Queen remains seated, her back gently turned away, and her body begins to rock gently as she starts to quietly sob. After a few moments of solitude, she turns to her left and catches sight of a majestic stag standing silently on the opposite side of the river."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The benevolent Queen, with a sense of poise and graciousness, offers a sumptuous spread of food to her beloved corgis. The eager corgis respond by looking up at her with hopeful, expectant eyes, before they joyfully burst into action, racing with excitement through the open clearing. The video footage captures a remarkable scene of large crowds of people who are patiently assembling in an orderly queue. In the background, a prominent sign can be easily seen, standing out against the backdrop. All around the area, the ground is transformed into a beautiful canvas adorned with an impressive array of vibrant and colorful floral tributes, creating a breathtaking sight to behold. \n\nLater on in the narrative, Charles is seen engaging in a thoughtful conversation with Steven. Nearby, Tony is observed as he thoughtfully glances at Cherie before ultimately deciding to leave her alone to manage her extensive pile of paperwork. In a different setting, the Queen is seated at a grand desk, diligently focused on writing in a book. However, she suddenly halts her writing unexpectedly, momentarily lost in thought. The following day, a trio of Land Rovers is seen making their departure from Balmoral. On Wednesday, Robin is noticed staring thoughtfully out of a window. Behind him, there sits a blond woman in quiet contemplation, and a man near them raises his hand as Tony stares back at them intently, his eyes fixed. The Queen proceeds to sign the important letter, and Robin shifts his discerning gaze from Prince Philip to the Queen, examining her with a contemplative look.\n\nWith purpose and determination, the Queen walks over to a desk, where she confidently sits down. She picks up a telephone, glancing out at the shining sun that is streaming in through the window. She places Tony on the speakerphone and shares a meaningful glance with Prince Philip. Methodically, she arranges the pens and a magnifying glass on the desk's surface, ensuring everything is in its rightful place. Tony directs his eyes towards the sky, stands up with intention, and continues to look out of the window for a brief moment before he reaches to pick up the telephone resting on his desk. He then gently places the phone back down, pausing with a thoughtful expression on his face, and leaves his office while thoughtfully stroking his chin. He stops momentarily beside a female secretary, who is seated behind her desk.\n\nMeanwhile, back at Balmoral, the Queen gracefully exits a Land Rover and makes her way into a nearby building. The Land Rover, with the Queen confidently at the wheel, makes its journey through the hilly and densely wooded countryside. It continues along a long, bumpy, and barren road that runs in parallel with a flowing river. The road descends steeply to the very edge of the river, where the Queen drives the vehicle directly into the water. As she navigates across the ford, the rocks and numerous potholes scattered across the riverbed cause the car to jolt sharply. The Land Rover abruptly comes to a sudden, violent halt in the middle of the river. The Queen steps out of the vehicle and into the cold, rushing mountain waters. Carefully, she begins to inspect the underside of the car, checking other vital parts of the Land Rover as well. Then, she takes out a mobile phone and dials a number for assistance.\n\nBack at Balmoral, Thomas is seen seated at a desk, busy with paperwork. The Queen, having finished her call, hangs up the phone and removes the headscarf she has been wearing. She takes a moment to gaze contemplatively at the calm and serene countryside surroundings, allowing herself a brief moment of reflection. She closes her eyes briefly, then looks down with a frown before lifting her gaze back up to the expansive view. The enormous landscape surrounding her appears to dwarf the figure of the Queen, who sits alone on the riverbank by her vehicle. The Queen remains seated, her back turned away gently, and her body begins to rock gently as she starts to quietly sob, the weight of her solitude sinking in. After a few moments of quiet solitude, she turns her head to the left and is met with the sight of a majestic stag standing silently across the river, its presence both a comfort and a wonder."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The Queen, with gentle care, places food before the corgis, watching as the eager dogs momentarily look up at her with anticipation and gratitude before they eagerly bound away, disappearing through the clearing. Video footage then captures the scene as crowds of people, filled with anticipation and solemn respect, stretch out in an orderly queue while a prominent sign comes into view, surrounded by a carpet of floral tributes that cover the ground in a vibrant, heartfelt display. Later, the scene shifts as Charles engages in a conversation with Steven, while Tony, casting a glance towards Cherie, leaves her to focus on her paperwork. Elsewhere, in a moment of solitude, the Queen sits at a desk, thoughtfully writing in a book, but her pen halts mid-sentence as she suddenly stops, caught in a moment of contemplation or distraction. The next day unfolds as three Land Rovers, engines roaring to life, depart from Balmoral, marking the start of a new journey. On Wednesday, Robin's gaze is fixed on the world outside his window, the scenery reflecting in his eyes, while behind him, a blond woman sits in quiet contemplation. A man, without warning, raises his hand, capturing Tony's attention as Tony locks eyes with them, taking in the scene. The Queen, with a deliberate motion, signs a letter, her eyes flickering from Prince Philip to the task at hand, exchanging silent messages. She walks purposefully over to a desk, gracefully lowers herself into a chair, and reaches for the phone, a fleeting glance at the sun outside hinting at her thoughts. She places Tony on the speaker, her eyes meeting Prince Philip’s briefly, and she busily arranges pens and a magnifying glass on the desk, each action methodical and precise. Tony, lost in thought, glances upwards to the sky, pushes himself away from his chair to stand, and turns his attention towards the window, allowing the daylight to fill his senses before he finally reaches for the phone on his desk. With resolve, Tony sets the phone down, takes a reflective pause, and exits his office, his hand subtly caressing his chin in thought, before stopping beside a female secretary who diligently works at her desk. Back at Balmoral, the Queen steps out of a Land Rover, her presence dignified, as she makes her way into a building. The Land Rover is seen traversing the hilly, wooded countryside, the Queen confidently in control as she maneuvers the vehicle along a long, bumpy, and barren road running parallel to a river. The road narrows down to meet the river's edge where the Queen, undeterred, drives the Land Rover into the waters. As she fords the river, the car is jostled by rocks and potholes hidden beneath the flowing water, and it comes to a sudden, unexpected stop in the river’s midst. The Queen, unflinching in her resolve, steps out into the mountain waters, inspecting the underside of the vehicle with careful scrutiny before moving on to examine other parts of the Land Rover. With determination, she retrieves her mobile phone and dials a number, seeking assistance. Meanwhile, back at Balmoral, Thomas is seen occupied at a desk as the Queen ends the call and removes the headscarf she had been wearing, allowing herself a moment to absorb the tranquil countryside that surrounds her. She momentarily shuts her eyes, absorbing the peaceful silence, looks down with a frown of introspection, then raises her gaze once more. The vast, sprawling landscape emphasizes her solitary figure as she sits by the riverbank beside the vehicle, her back turned, her body gently rocking with the onset of quiet sobs. After the passage of a few moments, she turns her head to the left, her eyes meeting the sight of a majestic stag standing still on the opposite side of the river, both creatures part of the still and silent tableau."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The Queen feeds the corgis, who look up at her before running through the clearing. Video footage captures crowds queuing by a sign amidst floral tributes. Later, Charles converses with Steven, and Tony leaves Cherie with her paperwork after a glance. Elsewhere, the Queen writes at a desk but pauses abruptly. The next day, three Land Rovers depart Balmoral. On Wednesday, Robin looks out a window with a blond woman behind him, while a man raises his hand as Tony observes them. The Queen signs a letter, with Robin glancing between Prince Philip and her. She sits down at a desk, picks up the phone, and briefly looks at the sun. Placing Tony on speaker, she arranges pens and a magnifying glass, while Tony stands, gazes out the window, picks up his phone, and then leaves his office thoughtfully, stopping by a secretary's desk. At Balmoral, the Queen exits a Land Rover and enters a building. Later, she drives through the scenic countryside, navigates a river's edge, and the Land Rover halts violently in the water. She steps out to inspect the vehicle and dials a number on her mobile phone. Back at Balmoral, Thomas sits at a desk while the Queen ends the call, removes her headscarf, and reflects on the serene surroundings, momentarily closing her eyes before looking down and then up. The vast landscape dwarfs her as she sits by the riverbank, her body gently rocking as she sobs. After a moment, she turns and notices a stag standing still across the river."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The Queen, who has owned and loved corgis since the 1930s, gives the corgis food, and the corgis look up at her before running through the clearing at Balmoral, the royal family's Scottish estate. Video footage shows crowds of people lining up in a queue outside Buckingham Palace, Britain's most iconic royal residence, and a sign is seen that commemorates the late Princess Diana. All around, the ground is covered in floral tributes left by mourners paying their respects. Later, Charles, then the Prince of Wales, talks with Steven, and Tony Blair, the British Prime Minister at the time, looks at Cherie, his wife, before leaving her with her paperwork. Elsewhere, the Queen sits at a desk writing in a condolence book, but she suddenly stops writing, perhaps overwhelmed by grief. The next day, three Land Rovers drive away from Balmoral, the vehicles commonly used by the royal family for rugged terrain. On Wednesday, Robin, a member of the Queen's staff, stares out of a window, with a blond woman sitting behind him, as a man raises his hand and Tony stares back at them during a meeting. The Queen signs the letter, and Robin looks from Prince Philip, the Duke of Edinburgh, to the Queen. The Queen walks over to a desk, sits down, picks up a phone, and glances at the sun as it sets over the castle grounds. The Queen puts Tony on the speaker and glances at Prince Philip, arranging pens and a magnifying glass, a habit she has when organizing her workspace, on the desk. Tony, feeling the weight of the national mourning, casts his eyes skyward, stands up, and looks out of the window, still gazing out before picking up the phone on his desk to make an important call. Tony puts down the phone, pauses, then leaves his Prime Ministerial office at 10 Downing Street, stroking his chin thoughtfully and stops beside a female secretary who sits behind a desk. At Balmoral, the Queen exits a Land Rover and enters a building that serves as a private retreat for the royal family. The Land Rover drives through the hilly and woody countryside of the Scottish Highlands with the Queen in the driving seat, continuing along a long, bumpy, and barren road parallel to a river. The road runs down to the river's edge, and the Queen plows into the waters, demonstrating her famous driving skills. As she heads across the ford, rocks and potholes on the riverbed jolt the car, and the Land Rover comes to a sudden, violent halt in the middle of the river. The Queen steps out of the car, into the cold mountain waters, and inspects the underneath of the vehicle, continuing to examine other parts of the Land Rover, a model known for its durability. The Queen holds a mobile phone and dials a number to call for assistance. Back at Balmoral, Thomas, another staff member, sits at a desk, and the Queen hangs up the phone, then removes the headscarf she is wearing, a practical accessory she often favors. She gazes at the serene countryside surroundings, shuts her eyes for a moment, looks down, frowns, then looks up, contemplating the beauty and solitude of the landscape. The vast landscape dwarfs the figure of the Queen, who sits on the riverbank by the vehicle. The Queen, deeply moved, remains seated, her back turned away, and her body gently rocks as she starts to sob, experiencing a rare moment of vulnerability. After a few moments, she turns to her left and sees a stag on the opposite side of the river, which stands still, a symbol often associated with grace and majesty in Scottish folklore."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The Queen walks over to a desk sits down picks up a phone and glances at the sun Tony casts his eyes skyward stands up and looks out of the window still gazing out before picking up the phone on his desk The Queen gives the corgis food and the corgis look up at her before running through the clearing The Queen signs the letter and Robin looks from Prince Philip to the Queen The Queen gives the corgis food and the corgis look up at her before running through the clearing Video footage shows crowds of people lining up in a queue and a sign is seen All around the ground is covered in floral tributes Back at Balmoral Thomas sits at a desk and the Queen hangs up the phone then removes the headscarf she is wearing Elsewhere the Queen sits at a desk writing in a book but she suddenly stops writing Later Charles talks with Steven and Tony looks at Cherie before leaving her with her paperwork Elsewhere the Queen sits at a desk writing in a book but she suddenly stops writing The next day three Land Rovers drive away from Balmoral Tony puts down the phone pauses then leaves his office stroking his chin thoughtfully and stops beside a female secretary who sits behind a desk On Wednesday Robin stares out of a window with a blond woman sitting behind him and a man sticks his hand up as Tony stares back at them Video footage shows crowds of people lining up in a queue and a sign is seen The Queen signs the letter and Robin looks from Prince Philip to the Queen The Queen walks over to a desk sits down picks up a phone and glances at the sun The Queen puts Tony on the speaker and glances at Prince Philip then arranges pens and a magnifying glass on the desk Tony casts his eyes skyward stands up and looks out of the window still gazing out before picking up the phone on his desk The Queen remains seated her back turned away and her body gently rocks as she starts to sob Tony puts down the phone pauses then leaves his office stroking his chin thoughtfully and stops beside a female secretary who sits behind a desk At Balmoral the Queen exits a Land Rover and enters a building Later Charles talks with Steven and Tony looks at Cherie before leaving her with her paperwork The Land Rover drives through the hilly and woody countryside with the Queen in the driving seat continuing along a long bumpy and barren road parallel to a river The road runs down to the river's edge and the Queen plows into the waters As she heads across the ford rocks and potholes on the riverbed jolt the car and the Land Rover comes to a sudden violent halt in the middle of the river The Queen steps out of the car into the mountain waters and inspects the underneath of the vehicle continuing to examine other parts of the Land Rover She gazes at the serene countryside surroundings shuts her eyes for a moment looks down frowns then looks up The Queen holds a mobile phone and dials a number The vast landscape dwarfs the figure of the Queen who sits on the riverbank by the vehicle Back at Balmoral Thomas sits at a desk and the Queen hangs up the phone then removes the headscarf she is wearing She gazes at the serene countryside surroundings shuts her eyes for a moment looks down frowns then looks up The vast landscape dwarfs the figure of the Queen who sits on the riverbank by the vehicle The Queen remains seated her back turned away and her body gently rocks as she starts to sob After a few moments she turns to her left and sees a stag on the opposite side of the river which stands still"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The Queen gives the corgis food and the corgis look up at her before running through the clearing. Video footage shows crowds of people lining up in a queue and a sign is seen. All around the ground is covered in floral tributes. Later Charles talks with Steven and Tony looks at Cherie before leaving her with her paperwork. Elsewhere the Queen sits at a desk writing in a book but she suddenly stops writing. The next day three Land Rovers drive away from Balmoral. On Wednesday Robin stares out of a window with a blond woman sitting behind him and a man sticks his hand up as Tony stares back at them. The Queen signs the letter and Robin looks from Prince Philip to the Queen. The Queen walks over to a desk sits down picks up a phone and glances at the sun. The Queen puts Tony on the speaker and glances at Prince Philip then arranges pens and a magnifying glass on the desk. Tony casts his eyes skyward stands up and looks out of the window still gazing out before picking up the phone on his desk. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Tony puts down the phone pauses then leaves his office stroking his chin thoughtfully and stops beside a female secretary who sits behind a desk. At Balmoral the Queen exits a Land Rover and enters a building. The Land Rover drives through the hilly and woody countryside with the Queen in the driving seat continuing along a long bumpy and barren road parallel to a river. The road runs down to the river's edge and the Queen plows into the waters. As she heads across the ford rocks and potholes on the riverbed jolt the car and the Land Rover comes to a sudden violent halt in the middle of the river. The Queen steps out of the car into the mountain waters and inspects the underneath of the vehicle continuing to examine other parts of the Land Rover. The Queen holds a mobile phone and dials a number. Back at Balmoral Thomas sits at a desk and the Queen hangs up the phone then removes the headscarf she is wearing. She gazes at the serene countryside surroundings shuts her eyes for a moment looks down frowns then looks up. The vast landscape dwarfs the figure of the Queen who sits on the riverbank by the vehicle. The Queen remains seated her back turned away and her body gently rocks as she starts to sob. After a few moments she turns to her left and sees a stag on the opposite side of the river which stands still."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The Queen gives the corgis food and the corgis look up at her before running through the clearing. Video footage shows crowds of people lining up in a queue and a sign is seen. All around the ground is covered in floral tributes. Later Charles talks with Steven and Tony looks at Cherie before leaving her with her paperwork. Elsewhere the Queen sits at a desk writing in a book but she suddenly stops writing. The next day three Land Rovers drive away from Balmoral. On Wednesday Robin stares out of a window with a blond woman sitting behind him and a man sticks his hand up as Tony stares back at them. The Queen signs the letter and Robin looks from Prince Philip to the Queen. The Queen walks over to a desk sits down picks up a phone and glances at the sun. The Queen puts Tony on the speaker and glances at Prince Philip then arranges pens and a magnifying glass on the desk. Tony casts his eyes skyward stands up and looks out of the window still gazing out before picking up the phone on his desk. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Tony puts down the phone pauses then leaves his office stroking his chin thoughtfully and stops beside a female secretary who sits behind a desk. At Balmoral the Queen exits a Land Rover and enters a building. The Land Rover drives through the hilly and woody countryside with the Queen in the driving seat continuing along a long bumpy and barren road parallel to a river. The road runs down to the river's edge and the Queen plows into the waters. As she heads across the ford rocks and potholes on the riverbed jolt the car and the Land Rover comes to a sudden violent halt in the middle of the river. The Queen steps out of the car into the mountain waters and inspects the underneath of the vehicle continuing to examine other parts of the Land Rover. The Queen holds a mobile phone and dials a number. Back at Balmoral Thomas sits at a desk and the Queen hangs up the phone then removes the headscarf she is wearing. She gazes at the serene countryside surroundings shuts her eyes for a moment looks down frowns then looks up. The vast landscape dwarfs the figure of the Queen who sits on the riverbank by the vehicle. The Queen remains seated her back turned away and her body gently rocks as she starts to sob. After a few moments she turns to her left and sees a stag on the opposite side of the river which stands still."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The Queen gives the corgis food and the corgis look up at her before running through the clearing. Video footage shows crowds of people lining up in a queue and a sign is seen. All around the ground is covered in floral tributes. Later Charles talks with Steven and Tony looks at Cherie before leaving her with her paperwork. Elsewhere the Queen sits at a desk writing in a book but she suddenly stops writing. The next day three Land Rovers drive away from Balmoral. The Queen holds a mobile phone and dials a number. Back at Balmoral Thomas sits at a desk and the Queen hangs up the phone then removes the headscarf she is wearing. She gazes at the serene countryside surroundings shuts her eyes for a moment looks down frowns then looks up. The vast landscape dwarfs the figure of the Queen who sits on the riverbank by the vehicle. The Queen remains seated her back turned away and her body gently rocks as she starts to sob. After a few moments she turns to her left and sees a stag on the opposite side of the river which stands still."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The Queen gives the corgis food and the corgis look up at her before running through the clearing. Video footage shows crowds of people lining up in a queue and a sign is seen. The vast landscape dwarfs the figure of the Queen who sits on the riverbank by the vehicle. The Queen remains seated her back turned away and her body gently rocks as she starts to sob. After a few moments she turns to her left and sees a stag on the opposite side of the river which stands still."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The gardener gives the corgis food, and the corgis look up at the gardener before running through the clearing. Video footage shows crowds of people lining up in a queue, and a sign is seen. All around, the ground is covered in floral tributes. Later, a plumber talks with Steven, and a musician looks at Cherie before leaving her with her paperwork. Elsewhere, the dolphin sits at a desk writing in a book, but it suddenly stops writing. The next day, three Land Rovers drive away from Balmoral. On Wednesday, a squirrel stares out of a window, with a blond woman sitting behind him, and a man sticks his hand up as the musician stares back at them. The gardener signs the letter, and the squirrel looks from Prince Philip to the gardener. The gardener walks over to a desk, sits down, picks up a phone, and glances at the sun. The gardener puts the musician on the speaker and glances at Prince Philip, then arranges pens and a magnifying glass on the desk. The musician casts his eyes skyward, stands up, and looks out of the window, still gazing out before picking up the phone on his desk. The musician puts down the phone, pauses, then leaves his office, stroking his chin thoughtfully and stops beside a female secretary who sits behind a desk. At Balmoral, the gardener exits a Land Rover and enters a building. The Land Rover drives through the hilly and woody countryside with the gardener in the driving seat, continuing along a long, bumpy, and barren road parallel to a river. The road runs down to the river's edge, and the gardener plows into the waters. As the gardener heads across the ford, rocks and potholes on the riverbed jolt the car, and the Land Rover comes to a sudden, violent halt in the middle of the river. The gardener steps out of the car, into the mountain waters, and inspects the underneath of the vehicle, continuing to examine other parts of the Land Rover. The gardener holds a mobile phone and dials a number. Back at Balmoral, Thomas sits at a desk, and the gardener hangs up the phone, then removes the hat they are wearing. The gardener gazes at the serene countryside surroundings, shuts their eyes for a moment, looks down, frowns, then looks up. The vast landscape dwarfs the figure of the gardener, who sits on the riverbank by the vehicle. The gardener remains seated, their back turned away, and their body gently rocks as they start to sob. After a few moments, they turn to their left and see a stag on the opposite side of the river, which stands still."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The Queen gives the dachshunds water, and the dachshunds look up at her before running through the garden. Video footage shows crowds of people lining up in a line, and a banner is seen. All around, the ground is covered in autumn leaves. Later, Charles talks with Steven, and Tony looks at Cherie before leaving her with her laptop. Elsewhere, the Queen sits at a table writing in a diary, but she suddenly stops writing. The next day, three SUVs drive away from Sandringham. On Wednesday, Robin stares out of a porthole, with a brunette woman sitting behind him, and a man sticks his hand up as Tony stares back at them. The Queen signs the document, and Robin looks from Prince Philip to the Queen. The Queen walks over to a table, sits down, picks up a tablet, and glances at the moon. The Queen puts Tony on the speaker and glances at Prince Philip, then arranges pencils and a paperweight on the table. Tony casts his eyes skyward, stands up, and looks out of the porthole, still gazing out before picking up the tablet on his table. Tony puts down the tablet, pauses, then leaves his workspace, stroking his chin thoughtfully and stops beside a female colleague who sits behind a table. At Sandringham, the Queen exits an SUV and enters a hall. The SUV drives through the sandy and barren desert with the Queen in the driving seat, continuing along a long, winding, and dusty road parallel to a canyon. The road runs down to the canyon's edge, and the Queen plows into the crevasse. As she heads across the bridge, boulders and cracks on the ground jolt the vehicle, and the SUV comes to a sudden, violent halt in the middle of the crevasse. The Queen steps out of the vehicle, into the rugged terrain, and inspects the underneath of the jeep, continuing to examine other parts of the SUV. The Queen holds a tablet and dials a number. Back at Sandringham, Thomas sits at a table, and the Queen hangs up the tablet, then removes the sunhat she is wearing. She gazes at the serene desert surroundings, shuts her eyes for a moment, looks down, frowns, then looks up. The vast landscape dwarfs the figure of the Queen, who sits on the canyon edge by the vehicle. The Queen remains seated, her back turned away, and her body gently rocks as she starts to sob. After a few moments, she turns to her left and sees a camel on the opposite side of the canyon, which stands still."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The Queen whispers to the corgis, and the corgis stretch before skipping through the clearing. Video footage depicts crowds of people dancing in a circle, and a sign is ignored. All around, the ground sparkles with floral tributes. Later, Charles whispers with Steven, and Tony nods at Cherie before tossing her with her paperwork. Elsewhere, the Queen leans at a desk singing in a book, but she suddenly hums softly. The next day, three Land Rovers float away from Balmoral. On Wednesday, Robin peers out of a window, with a blond woman humming behind him, and a man waves his hand as Tony listens back at them. The Queen sketches the letter, and Robin beams from Prince Philip to the Queen. The Queen dances over to a desk, kneels down, tosses a phone, and smirks at the sun. The Queen lifts Tony on the speaker and winks at Prince Philip, then juggles pens and a magnifying glass on the desk. Tony rolls his eyes, sits up, and yawns out of the window, still whistling out before scribbling on the phone on his desk. Tony hurls down the phone, hesitates, then skips his office, tapping his chin thoughtfully and twirls beside a female secretary who giggles behind a desk. At Balmoral, the Queen leaps out of a Land Rover and pirouettes into a building. The Land Rover drifts through the hilly and woody countryside with the Queen in the passenger seat, floating along a long, bumpy, and barren road parallel to a river. The road stretches down to the river's edge, and the Queen plunges into the waters. As she glides across the ford, rocks and potholes on the riverbed sway the car, and the Land Rover drifts to a gentle, graceful halt in the middle of the river. The Queen skips out of the car, into the mountain waters, and circles the underneath of the vehicle, continuing to admire other parts of the Land Rover. The Queen plays a mobile phone and strums a number. Back at Balmoral, Thomas lounges at a desk, and the Queen drops the phone, then tosses the headscarf she is wearing. She sings at the serene countryside surroundings, opens her eyes for a moment, looks down, giggles, then looks up. The vast landscape envelops the figure of the Queen, who sits on the riverbank by the vehicle. The Queen remains seated, her back turned away, and her body gently sways as she starts to hum. After a few moments, she twirls to her left and sees a stag on the opposite side of the river, which hops still."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The submarine hands the flamingos hats, and the flamingos look up at it before sprinting through the orchard. Documentary footage shows flocks of pigeons gathering in a circle, and a banner is spotted. All around, the ceiling is covered in chocolate sculptures. Later, Michael debates with Lisa, and Rachel glances at Martin before abandoning him with his briefcase. Elsewhere, the submarine reclines at a chair doodling on a napkin, but it unexpectedly ceases doodling. The following afternoon, three bicycles zoom away from Hogwarts. On Tuesday, Georgia gawks out of a mirror, with a redheaded elephant perched in front of her, and an octopus raises its fin as Rachel peers back at them. The submarine seals the envelope, and Georgia glances from Captain Hook to the submarine. The submarine strides over to a cabinet, plops down, grabs a wrench, and peeks at the moon. The submarine places Rachel on the microphone and peeks at Captain Hook, then organizes spoons and a telescope on the cabinet. Rachel shifts her gaze upward, rises, and peers out of the chimney, still lingering before grasping the microphone on her cabinet. Rachel sets down the microphone, hesitates, then departs her classroom, patting her temple pensively and halts beside a male cashier who reclines in front of a cabinet. At Hogwarts, the submarine disembarks a bicycle and penetrates a cave. The bicycle glides through the sandy and swampy wasteland with the submarine in the captain's seat, persisting along a brief, narrow, and lush path adjacent to a stream. The path meanders up to the stream's brink, and the submarine crashes into the grass. As it heads through the meadow, roots and brambles on the ground jolt the vehicle, and the bicycle comes to a sudden, serene pause in the center of the stream. The submarine leaps out of the vehicle, into the desert sands, and probes the underside of the bicycle, continuing to scrutinize other sections of the bicycle. The submarine holds a radio and taps a button. Back at Hogwarts, Samuel lounges at a cabinet, and the submarine disconnects the radio, then discards the scarf it is wearing. It ponders at the bustling urban scenery, closes its mouths for a moment, glances up, grimaces, then glances down. The dense skyscrapers overshadow the visage of the submarine, which lounges on the shoreline by the vehicle. The submarine remains reclining, its face turned away, and its body gently sways as it begins to laugh. After a few moments, it turns to its right and spots a dolphin on the opposite side of the stream, which floats tranquil."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The gardener tosses the sparrows seeds, and the sparrows gaze up at him before hopping through the meadow. Video footage shows flocks of sheep gathering in a pen, and a banner is spotted. All around, the area is scattered with paper lanterns. Later, George whispers with Michael, and Lily glances at Sophie before abandoning her with her laptop. Elsewhere, the gardener leans at a chair sketching on a napkin, but he suddenly pauses sketching. The next day, three bicycles pedal away from the castle. On Wednesday, Jamie peers out of a door, with a red-haired woman knitting behind him, and a child waves his hand as Lily peers back at them. The gardener seals the envelope, and Jamie turns from Prince Albert to the gardener. The gardener saunters over to a chair, reclines, lifts a camera, and peers at the horizon. The gardener places Lily on the speaker and peers at Prince Albert, then arranges brushes and a pocket watch on the desk. Lily rolls her eyes, stretches, and looks out of the doorway, still contemplating before grabbing the notebook on her table. Lily sets down the notebook, hesitates, then exits her workspace, patting her chin thoughtfully and halts beside a male assistant who reclines behind a table. At the castle, the gardener descends a bicycle and enters a gazebo. The bicycle winds through the grassy and leafy landscape with the gardener in the driving seat, meandering along a narrow, brisk, and empty path beside a stream. The path winds down to the stream's edge, and the gardener skates into the waters. As he navigates across the crossing, stones and puddles on the riverbank jar the bike, and the bicycle comes to a sudden, abrupt stop in the heart of the stream. The gardener leaps out of the bike, into the chilly waters, and scrutinizes the underneath of the machine, persisting to inspect other segments of the bicycle. The gardener clutches a walkie-talkie and presses a button. Back at the castle, David reclines at a table, and the gardener sets down the walkie-talkie, then removes the cap he is wearing. He surveys the tranquil garden surroundings, closes his eyes for a beat, glances down, scowls, then lifts his gaze. The expansive garden dwarfs the figure of the gardener, who reclines on the riverbank beside the bike. The gardener remains seated, his back turned away, and his body gently sways as he starts to hum. After some moments, he pivots to his right and spots a doe on the opposite bank of the stream, which remains motionless."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The Queen gifts the zebras toys, and the zebras gaze at her before leaping through the orchard. Video footage displays flocks of birds circling in formation, and a banner is noticed. All around, the air is filled with musical notes. Later, Charles chats with Steven, and Tony glances at Cherie before guiding her with her knitting. Elsewhere, the Queen reclines on a sofa sketching in a journal, but she suddenly starts sketching. The next day, three motorcycles zoom away from Balmoral. On Wednesday, Robin glances at a painting, with a brunette woman reclining beside him, and a man raises his glass as Tony nods back at them. The Queen doodles in the notebook, and Robin glances from Prince Philip to the Queen. The Queen strolls over to a table, reclines, grabs a remote, and peers at the clouds. The Queen places Tony on the television and peers at Prince Philip, then arranges papers and a compass on the table. Tony lifts his hands upward, sits down, and peers into the mirror, still gazing in before grabbing the remote on his table. Tony sets down the remote, hesitates, then exits his studio, tapping his nose pensively and halts beside a female assistant who leans against a counter. At Balmoral, the Queen departs a motorcycle and enters a cottage. The motorcycle speeds through the grassy and open countryside with the Queen at the controls, continuing along a long, winding, and verdant path parallel to a stream. The path winds down to the stream's edge, and the Queen plunges into the waters. As she navigates across the crossing, pebbles and roots on the riverbank lurch the bicycle, and the motorcycle grinds to an abrupt, staggering stop in the middle of the stream. The Queen disembarks from the bicycle, into the forest waters, and examines the tires of the vehicle, continuing to scrutinize other parts of the motorcycle. The Queen holds a tablet and taps a code. Back at Balmoral, Thomas reclines on a bench, and the Queen ends the call, then removes the hat she is wearing. She scans the tranquil urban surroundings, closes her eyes for a moment, glances up, smiles, then looks forward. The endless horizon towers over the figure of the Queen, who reclines on the riverbank by the motorcycle. The Queen remains reclining, her back facing away, and her body gently sways as she begins to laugh. After a few moments, she turns to her right and notices a kite on the adjacent side of the stream, which floats still."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The Pirate throws the parrots treats, and the parrots gaze down at him before soaring over the meadow. Clip captures groups of balloons floating in a line, and a banner is visible. All around, the sky is filled with paper lanterns. Later, Hector discusses with Monica, and Gerald winks at Felicity before tossing him with her backpack. Nearby, the Pirate reclines on a bench doodling on a napkin, but he abruptly starts doodling again. The following morning, three bicycles zoom away from the castle. On Sunday, Jasmine gazes into a mirror, with a red cat lounging beneath her, and a bird flaps its wings as Gerald glances forward at them. The Pirate stamps the document, and Jasmine peers from King Louis to the Pirate. The Pirate strides towards a table, settles down, grabs a trumpet, and squints at the clouds. The Pirate puts Gerald on the radio and squints at King Louis, then rearranges marbles and a telescope on the table. Gerald rolls his eyes sideways, hops up, and gazes into the mirror, still staring outward before grabbing the trumpet on his table. Gerald places down the trumpet, hesitates, then exits his chamber, rubbing his elbow absent-mindedly and pauses beside a male intern who props up a bench. At the castle, the Pirate dismounts a bicycle and traverses a bridge. The bicycle zips across the windy and oceanic landscape with the Pirate in the saddle, continuing along a short, winding, and lush path parallel to a stream. The path continues up to the stream's brink, and the Pirate sails into the waters. As he cruises across the ford, pebbles and waves in the riverbed rock the bike, and the bicycle halts to a sudden, chaotic stop atop the stream. The Pirate bounds off the bike, into the cavern waters, and inspects the surface of the contraption, continuing to examine other parts of the bicycle. The Pirate grips a tablet and presses a button. Back at the castle, Vincent lounges on a couch, and the Pirate shuts off the tablet, then removes the helmet he is donning. He marvels at the majestic mountain vista, closes his mouth for an instant, shifts up, nods, then shifts down. The enormous panorama minimizes the silhouette of the Pirate, who reclines on the shoreline by the contraption. The Pirate remains reclining, his face turned away, and his fingers lightly sway as he begins to laugh. After several moments, he turns to his right and notices a gull on the opposite side of the stream, which remains stationary."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The Queen feeds the corgis, who then dash through the clearing. Video footage reveals crowds surrounded by floral tributes. Charles talks to Steven, and Tony leaves Cherie with paperwork. The Queen, sitting at a desk, suddenly stops writing. The next day, three Land Rovers depart Balmoral. On Wednesday, Robin stares out a window beside a blond woman, while Tony notices a man raising his hand. The Queen signs a letter, interacting with Robin and Prince Philip. She takes a call from Tony, arranging items on her desk. Tony gazes out his window before leaving his office, contemplating beside a secretary. At Balmoral, the Queen exits a Land Rover, drives through the countryside, and ventures into a river, where rocks halt the vehicle. She steps out, inspects the car, and uses a mobile phone. After returning to Balmoral, the Queen removes her headscarf, takes in the serene scenery, and begins to sob. She notices a stag across the river, standing still."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "After a few moments she turns to her left and sees a stag on the opposite side of the river which stands still The Queen remains seated her back turned away and her body gently rocks as she starts to sob The vast landscape dwarfs the figure of the Queen who sits on the riverbank by the vehicle She gazes at the serene countryside surroundings shuts her eyes for a moment looks down frowns then looks up Back at Balmoral Thomas sits at a desk and the Queen hangs up the phone then removes the headscarf she is wearing The Queen holds a mobile phone and dials a number The Queen steps out of the car into the mountain waters and inspects the underneath of the vehicle continuing to examine other parts of the Land Rover As she heads across the ford rocks and potholes on the riverbed jolt the car and the Land Rover comes to a sudden violent halt in the middle of the river The road runs down to the river's edge and the Queen plows into the waters The Land Rover drives through the hilly and woody countryside with the Queen in the driving seat continuing along a long bumpy and barren road parallel to a river At Balmoral the Queen exits a Land Rover and enters a building Tony puts down the phone pauses then leaves his office stroking his chin thoughtfully and stops beside a female secretary who sits behind a desk Tony casts his eyes skyward stands up and looks out of the window still gazing out before picking up the phone on his desk The Queen puts Tony on the speaker and glances at Prince Philip then arranges pens and a magnifying glass on the desk The Queen walks over to a desk sits down picks up a phone and glances at the sun The Queen signs the letter and Robin looks from Prince Philip to the Queen On Wednesday Robin stares out of a window with a blond woman sitting behind him and a man sticks his hand up as Tony stares back at them The next day three Land Rovers drive away from Balmoral Elsewhere the Queen sits at a desk writing in a book but she suddenly stops writing Later Charles talks with Steven and Tony looks at Cherie before leaving her with her paperwork All around the ground is covered in floral tributes Video footage shows crowds of people lining up in a queue and a sign is seen The Queen gives the corgis food and the corgis look up at her before running through the clearing"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The Queen steps out of the car into the mountain waters and inspects the underneath of the vehicle continuing to examine other parts of the Land Rover As she heads across the ford rocks and potholes on the riverbed jolt the car and the Land Rover comes to a sudden violent halt in the middle of the river All around the ground is covered in floral tributes The road runs down to the river's edge and the Queen plows into the waters The next day three Land Rovers drive away from Balmoral The Land Rover drives through the hilly and woody countryside with the Queen in the driving seat continuing along a long bumpy and barren road parallel to a river The Queen holds a mobile phone and dials a number At Balmoral the Queen exits a Land Rover and enters a building After a few moments she turns to her left and sees a stag on the opposite side of the river which stands still On Wednesday Robin stares out of a window with a blond woman sitting behind him and a man sticks his hand up as Tony stares back at them The Queen puts Tony on the speaker and glances at Prince Philip then arranges pens and a magnifying glass on the desk Video footage shows crowds of people lining up in a queue and a sign is seen She gazes at the serene countryside surroundings shuts her eyes for a moment looks down frowns then looks up Tony puts down the phone pauses then leaves his office stroking his chin thoughtfully and stops beside a female secretary who sits behind a desk Tony casts his eyes skyward stands up and looks out of the window still gazing out before picking up the phone on his desk The Queen remains seated her back turned away and her body gently rocks as she starts to sob Elsewhere the Queen sits at a desk writing in a book but she suddenly stops writing Back at Balmoral Thomas sits at a desk and the Queen hangs up the phone then removes the headscarf she is wearing The Queen signs the letter and Robin looks from Prince Philip to the Queen The Queen walks over to a desk sits down picks up a phone and glances at the sun The Queen gives the corgis food and the corgis look up at her before running through the clearing Later Charles talks with Steven and Tony looks at Cherie before leaving her with her paperwork The vast landscape dwarfs the figure of the Queen who sits on the riverbank by the vehicle"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "At Balmoral the Queen exits a Land Rover and enters a building The Land Rover drives through the hilly and woody countryside with the Queen in the driving seat continuing along a long bumpy and barren road parallel to a river The road runs down to the river's edge and the Queen plows into the waters As she heads across the ford rocks and potholes on the riverbed jolt the car and the Land Rover comes to a sudden violent halt in the middle of the river The Queen steps out of the car into the mountain waters and inspects the underneath of the vehicle continuing to examine other parts of the Land Rover The Queen holds a mobile phone and dials a number Back at Balmoral Thomas sits at a desk and the Queen hangs up the phone then removes the headscarf she is wearing She gazes at the serene countryside surroundings shuts her eyes for a moment looks down frowns then looks up The vast landscape dwarfs the figure of the Queen who sits on the riverbank by the vehicle The Queen remains seated her back turned away and her body gently rocks as she starts to sob After a few moments she turns to her left and sees a stag on the opposite side of the river which stands still The Queen gives the corgis food and the corgis look up at her before running through the clearing Video footage shows crowds of people lining up in a queue and a sign is seen All around the ground is covered in floral tributes Later Charles talks with Steven and Tony looks at Cherie before leaving her with her paperwork Elsewhere the Queen sits at a desk writing in a book but she suddenly stops writing The next day three Land Rovers drive away from Balmoral On Wednesday Robin stares out of a window with a blond woman sitting behind him and a man sticks his hand up as Tony stares back at them The Queen signs the letter and Robin looks from Prince Philip to the Queen The Queen walks over to a desk sits down picks up a phone and glances at the sun The Queen puts Tony on the speaker and glances at Prince Philip then arranges pens and a magnifying glass on the desk Tony casts his eyes skyward stands up and looks out of the window still gazing out before picking up the phone on his desk Tony puts down the phone pauses then leaves his office stroking his chin thoughtfully and stops beside a female secretary who sits behind a desk"
        }
      ]
    }
  ]
}