{
  "ground_truth": "The guy runs out, and his towel falls to the ground. Abby covers her eyes. Inside, D'Artagnan cozies up to the guy. Abby's mouth hangs open in a big, toothy grin, her eyes twinkle, and she is transfixed. The guy points to the door and reopens it. Abby dances for joy. On set, the makeup girl goes. Abby roughly forces an earpiece into Mike's ear. Outside, the chicks pull him in. Mike licks the red Jell-O off one of the girl's fingers and gives an approving nod. Abby takes deep breaths as Mike comes in with the bikini babes, who then head off. She walks off. Abby wakes up from her naked weather-girl nightmare. Abby and Joy are in the tea-break area of the office, looking at the ratings. Mike walks in, following Abby to her office. Sitting at her desk, Abby gives Mike a challenging look, picks up a card and the phone, and dials. Mike grabs a phone to listen on but hangs Abby up. Mike flops into a chair, puts the phone on hold, glances aside, and nods while looking at the timer on Abby's phone display. Abby looks thoughtful. At the hospital, handsome, clean-cut Colin keeps holding. In a cafe, in a boutique, they look at dresses with a saleswoman. Abby holds a dress against herself. On the way home, sitting in Abby's living room, Mike reaches down the side of the chair and picks up some knitting, frowns, and quickly dumps it back on the floor. Abby comes downstairs, looking extremely sexy in black stilettos and a figure-hugging, low-cut black dress that stops at her knees, with her long, blonde hair hanging loose in flowing curls. She smirks, strokes his chest, and he slaps her bum. Mike crouches behind the couch, smiles, and gives Abby the thumbs-up. Abby does a little victory dance, punching the air. At the baseball game, the pitcher pitches, and the batter hits. As Abby and Colin walk to their seats, Mike talks to Abby on an earpiece and sits nearby. She munches popcorn with an exaggerated shrug. The batter sprints around the field, and the fans stand up excitedly. Colin tries to get the attention of a food vendor. A girl grins at Mike and lifts the hot dog to her lips, but shocked, she spills her drink in Colin's lap. A cameraman films Abby as she rubs the stain, her head bent over Colin's crotch, and her hair swishes back and forth, making it look like she's doing something quite different. She looks up and sees herself in a heart-shaped video screen above the scoreboard, the Kiss Cam. Abby and Colin walk home.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The man dashes out, and his towel drops to the ground. Abby shields her eyes. Inside, D'Artagnan snuggles up to the man. Abby's mouth hangs open in a big, toothy smile, her eyes gleam, and she is mesmerized. The man gestures to the door and reopens it. Abby dances for happiness. On set, the makeup woman departs. Abby roughly forces an earpiece into Mike's ear. Outside, the women pull him in. Mike licks the red Jell-O off one of the woman's fingers and gives an approving nod. Abby takes deep breaths as Mike enters with the bikini girls, who then head off. She walks off. Abby wakes up from her naked weather-woman nightmare. Abby and Joy are in the tea-break zone of the office, looking at the ratings. Mike strolls in, following Abby to her office. Sitting at her desk, Abby gives Mike a challenging look, picks up a card and the phone, and dials. Mike grabs a phone to listen on but hangs Abby up. Mike collapses into a chair, puts the phone on hold, glances aside, and nods while looking at the timer on Abby's phone display. Abby looks pensive. At the hospital, handsome, clean-cut Colin keeps holding. In a cafe, in a boutique, they look at gowns with a saleswoman. Abby holds a gown against herself. On the way home, sitting in Abby's living room, Mike reaches down the side of the chair and picks up some knitting, frowns, and quickly dumps it back on the floor. Abby comes downstairs, looking extremely alluring in black stilettos and a figure-hugging, low-cut black dress that stops at her knees, with her long, blonde hair hanging loose in flowing curls. She smirks, strokes his chest, and he slaps her bottom. Mike crouches behind the couch, smiles, and gives Abby the thumbs-up. Abby does a little victory dance, punching the air. At the baseball game, the pitcher throws, and the batter hits. As Abby and Colin stroll to their seats, Mike talks to Abby on an earpiece and sits nearby. She munches popcorn with an exaggerated shrug. The batter dashes around the field, and the fans stand up excitedly. Colin tries to capture the attention of a food vendor. A woman grins at Mike and lifts the hot dog to her lips, but shocked, she spills her beverage in Colin's lap. A cameraman records Abby as she rubs the stain, her head bent over Colin's crotch, and her hair swishes back and forth, making it look like she's doing something quite different. She looks up and sees herself in a heart-shaped video screen above the scoreboard, the Kiss Cam. Abby and Colin walk home."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The towel is run out with by the guy, and the ground is fallen to by it. Her eyes are covered by Abby. Inside, the guy is cozied up to by D'Artagnan. Abby's mouth is hung open in a big, toothy grin, her eyes twinkle, and she is transfixed. To the door, the guy points, and it is reopened by him. For joy, a dance is done by Abby. On set, the makeup girl goes. An earpiece is roughly forced into Mike's ear by Abby. Outside, he is pulled in by the chicks. The red Jell-O is licked off one of the girl's fingers by Mike, and an approving nod is given by him. Deep breaths are taken by Abby as the bikini babes are brought in by Mike, who then head off. Off she walks. From her naked weather-girl nightmare, Abby wakes up. In the tea-break area of the office, the ratings are looked at by Abby and Joy. Into the office, Mike walks, and Abby is followed by him. Sitting at her desk, a challenging look is given to Mike by Abby, a card and the phone are picked up by her, and dialing occurs. A phone is grabbed by Mike to listen on, but Abby is hung up by him. Into a chair, Mike flops, the phone is put on hold by him, a glance is given aside by him, and the timer on Abby's phone display is looked at with a nod. Thoughtful looks are given by Abby. At the hospital, Colin keeps holding, being handsome and clean-cut. In a cafe, in a boutique, dresses are looked at with a saleswoman by them. A dress is held against herself by Abby. On the way home, sitting in Abby's living room, the side of the chair is reached down by Mike, some knitting is picked up by him, a frown is given, and it is quickly dumped back on the floor by him. Downstairs, Abby comes, looking extremely sexy in black stilettos and a figure-hugging, low-cut black dress that stops at her knees, with her long, blonde hair hanging loose in flowing curls. A smirk is given by her, his chest is stroked, and her bum is slapped by him. Behind the couch, Mike crouches, a smile is given, and the thumbs-up is given to Abby by him. A little victory dance is done by Abby, and the air is punched. At the baseball game, the pitcher is pitched by the pitcher, and the batter is hit by the batter. As their seats are walked to by Abby and Colin, Mike talks to Abby on an earpiece and is sat nearby by him. With an exaggerated shrug, popcorn is munched by her. Around the field, the batter is sprinted, and the fans stand up excitedly. The attention of a food vendor is tried to be gotten by Colin. A grin is given to Mike by a girl, and the hot dog is lifted to her lips, but shocked, her drink is spilled in Colin's lap. Abby is filmed by a cameraman as the stain is rubbed by her, her head bent over Colin's crotch, and her hair swishes back and forth, making it look like something quite different is being done by her. Herself is looked up at and seen in a heart-shaped video screen by her above the scoreboard, the Kiss Cam. Home is walked to by Abby and Colin."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The guy runs out, and his towel drops. Abby covers her eyes. Inside, D'Artagnan snuggles with the guy. Abby grins widely, transfixed. The guy points to the door and reopens it, making Abby dance with joy. The makeup girl leaves while Abby inserts an earpiece into Mike's ear. Outside, the girls pull him in, and Mike licks red Jell-O off one girl's finger and nods approvingly. Abby takes deep breaths as bikini babes leave with Mike. She wakes from her nightmare about a naked weather-girl. In the office break area, Abby and Joy check ratings. Mike enters, following Abby to her office. At her desk, Abby gives Mike a challenging look, picks up a card, and dials. Mike listens in but disconnects her call. Sitting down, Mike places the phone on hold and nods while eyeing the timer on Abby's phone. Abby appears thoughtful. At the hospital, Colin waits. In a cafe and boutique, they shop for dresses. Abby tries one on. At home, Mike picks up knitting from a chair but discards it. Abby comes down in sexy black stilettos and a fitted, low-cut dress, her blonde curls flowing. She smirks, strokes his chest, and he playfully slaps her. Mike crouches, smiles, and gives her a thumbs-up. Abby does a victory dance. At a baseball game, Abby and Colin head to their seats, and Mike talks to Abby via earpiece. She eats popcorn with a shrug. The batter runs, and excited fans stand up. Colin tries to catch a food vendor. A girl grins at Mike but spills her drink on Colin's lap. A cameraman films Abby rubbing the stain from Colin's pants, making it look suggestive. She sees herself on the Kiss Cam and blushes. Abby and Colin walk home."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The guy runs out, losing his towel, making Abby cover her eyes. D'Artagnan cozies up to him. Abby grins, transfixed, as he points to the door. Abby dances joyfully. On set, Abby forces an earpiece into Mike's ear. Outside, chicks pull Mike in; he licks red Jell-O off a girl's finger and nods. Abby breathes deeply as Mike enters with bikini babes. She leaves and wakes from her nightmare. In the tea-break area, Abby and Joy check ratings. Mike follows Abby to her office, where she gives him a challenging look, picks up a card and phone, and dials. Mike listens, then hangs her up, glancing at the timer on her phone. Abby is thoughtful. At the hospital, Colin waits. In a boutique, Abby holds a dress. At home, Mike finds knitting, frowns, and drops it. Abby appears, sexy in a black dress and stilettos. She smirks, strokes his chest, and he slaps her bum. Mike crouches, smiles, and gives a thumbs-up. Abby dances victoriously. At a baseball game, Mike talks to Abby via earpiece. She munches popcorn as fans cheer. Colin seeks a vendor, but a girl spills her drink on him. A cameraman films Abby rubbing the stain on Colin, making it appear inappropriate. She sees herself on the Kiss Cam. Abby and Colin walk home."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The guy suddenly bursts out of the room, and in his haste, his towel drops unceremoniously to the ground, causing quite the scene. Abby instinctively shields her eyes with her hand to avert her gaze. Meanwhile, inside the room, D'Artagnan cozies up closely to the guy, forming a rather amusing picture. Abby's mouth gapes wide open in a big, toothy grin of surprise, her eyes sparkling with delight, and she stands completely spellbound by the spectacle. The guy gestures towards the door, indicating for it to be opened again, and Abby, filled with joy, starts dancing gleefully. On set, the dedicated makeup girl makes her exit. Abby decisively and not-so-gently fits an earpiece into Mike's ear outside, where he is pulled into the fray by the eager chicks. Mike, with a playful expression, licks the red Jell-O from one of the girl's fingers and gives a nod of approval. Inside, Abby takes deep, calming breaths as Mike enters with the bikini-clad babes, who eventually head off on their own way. She departs from the scene. \n\nAbby then awakens from her disconcerting nightmare featuring a naked weather-girl scenario. She and Joy find themselves in the office's tea-break area, attentively examining the latest ratings. Mike walks in, trailing Abby as she heads towards her office. Once there, seated at her desk, Abby fixes Mike with a challenging look, picking up a card and reaching for the phone to dial a number. Mike quickly grabs a phone to listen in but abruptly hangs up Abby's call. He flops dramatically into a chair, placing the phone on hold, glancing sideways, and nodding while his eyes are fixed on the timer displayed on Abby's phone. Abby assumes a thoughtful expression as if contemplating her next move. Meanwhile, at the hospital, the handsome and clean-cut Colin resolutely remains on hold. \n\nIn a quaint cafe, and later in a chic boutique, they peruse dresses with a saleswoman assisting them. Abby holds a dress against herself, contemplating its fit and look. On the way back home, now situated within the cozy confines of Abby's living room, Mike reaches down the side of the chair, discovering some knitting, which he picks up with a frown before swiftly discarding it back onto the floor. Abby descends the staircase, looking incredibly sexy in black stilettos paired with a figure-hugging, low-cut black dress that elegantly stops at her knees, her long, blonde hair hanging loose in flowing curls. She smirks slyly, gently stroking Mike's chest, prompting him to playfully slap her bum. Mike crouches contentedly behind the couch, beaming with a smile, and gives Abby a confident thumbs-up. In response, Abby performs a little victory dance, triumphantly punching the air. \n\nAt the lively baseball game, the pitcher winds up and pitches the ball, and the batter hits it skillfully. As Abby and Colin make their way to their seats, Mike communicates with Abby through an earpiece while sitting nearby. She munches on popcorn with an exaggerated shrug. As the batter sprints around the field, the excited fans leap to their feet with enthusiasm. Colin attempts to catch the attention of a food vendor. A girl flashes a grin at Mike and raises a hot dog to her lips, but in her surprise, she accidentally spills her drink onto Colin's lap. A cameraman captures the moment as Abby, attempting to clean the stain, bends her head over Colin's crotch, her hair swishing back and forth, creating an impression of something quite different. She looks up and spots herself on a heart-shaped video screen above the scoreboard, caught on the notorious Kiss Cam. Abby and Colin make their way home after the eventful day."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The guy unexpectedly and suddenly bursts out of the room with quite an urgency, and, in his haste, his towel slips and falls unceremoniously to the ground, creating quite the commotion. Abby, almost without thinking, instinctively raises her hand to shield her eyes, diverting her gaze to avoid the scene. Meanwhile, back inside the room, D'Artagnan nestles cozily up to the guy, forming a rather amusing and comical picture for anyone watching. Abby's mouth opens wide into a big, toothy grin, filled with surprise, her eyes bright and sparkling with delight, as she stands utterly spellbound by the spectacle unfolding before her. The guy then gestures towards the door, signaling for it to be opened again, and Abby, overwhelmed with joy, begins dancing gleefully. On set, the dedicated and hardworking makeup girl makes her exit. Abby, with decisiveness and a lack of gentleness, fits an earpiece snugly into Mike's ear outside, where he is eagerly pulled into the fray by the enthusiastic chicks. Mike, with a playful expression on his face, licks the red Jell-O from one of the girl’s fingers and gives a nod of approval, showing that he is pleased. Inside, Abby takes deep, calming breaths as Mike enters with the bikini-clad babes, who eventually go off on their own way. She then departs from the scene. \n\nAbby then awakens abruptly from her disconcerting nightmare featuring a naked weather-girl scenario. She and Joy find themselves situated in the office's tea-break area, where they attentively examine the latest ratings. Mike enters the room, trailing behind Abby as she makes her way towards her office. Once she is there, seated at her desk, Abby fixes Mike with a challenging look, picking up a card and reaching for the telephone to dial a number. Mike quickly grabs a phone to eavesdrop on the conversation but abruptly hangs up Abby's call. He theatrically flops into a chair, placing the phone on hold, glancing sideways, and nodding while his eyes remain fixed on the timer displayed on Abby's phone. Abby assumes a thoughtful expression, as if she is deeply contemplating her next move. Meanwhile, at the hospital, the handsome and clean-cut Colin resolutely remains on hold. \n\nIn a quaint, cozy café, and later in a chic, fashionable boutique, they browse and peruse dresses with the assistance of a helpful saleswoman. Abby holds a dress against herself, contemplating its fit and look, assessing how it might suit her. On their way back home, now situated within the snug and cozy confines of Abby's inviting living room, Mike reaches down the side of the chair, discovering some knitting, which he picks up with a frown, before quickly discarding it back onto the floor. Abby descends the staircase, looking incredibly sexy and stunning in black stilettos paired with a figure-hugging, low-cut black dress that elegantly stops at her knees, her long, blonde hair hanging loose in flowing curls. She smirks slyly, gently stroking Mike's chest, which prompts him to playfully slap her bum. Mike crouches contentedly behind the couch, beaming with a bright smile, and gives Abby a confident thumbs-up. In response to his gesture, Abby performs a little victory dance, triumphantly punching the air with enthusiasm.\n\nAt the lively and spirited baseball game, the pitcher winds up and pitches the baseball, and the batter hits it skillfully. As Abby and Colin make their way to their seats, Mike communicates with Abby through a discreet earpiece while seated nearby. She munches on popcorn, accompanied by an exaggerated shrug. As the batter sprints quickly around the field, the excited and enthusiastic fans leap to their feet with loud cheers. Colin makes an attempt to catch the attention of a nearby food vendor. A girl flashes a grin at Mike and raises a hot dog to her lips, but in her surprise, she inadvertently spills her drink onto Colin's lap. A cameraman captures the amusing moment as Abby, in an attempt to clean the stain, bends her head low over Colin's crotch, her hair swishing back and forth, inadvertently creating an impression of something rather different. She looks up and catches sight of herself on a large, heart-shaped video screen above the scoreboard, captured by the notorious Kiss Cam. Abby and Colin eventually make their way home after the eventful and unforgettable day."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The guy quickly rushes out, and as he does, his towel inadvertently slips from his body and falls to the ground, leaving him momentarily exposed. In response, Abby instinctively covers her eyes, shielding her gaze from the unexpected sight. Meanwhile, inside, D'Artagnan comes over and snugly settles beside the guy, creating a cozy scene. Abby's reaction is one of pure amusement and fixation; her mouth opens wide into a large, toothy grin, her eyes sparkle with delight, and she remains captivated by the unfolding events. The guy then gestures towards the door, indicating his intention to re-enter, and pushes it open once more. In excitement, Abby breaks into a joyful dance, expressing her exuberance through animated movements. Back on the set, the makeup girl makes her exit. As part of the next scene, Abby forcefully and somewhat carelessly inserts an earpiece into Mike's ear. Outside, a group of girls eagerly pulls him into their circle. During this interaction, Mike playfully licks some red Jell-O off one of the girl's fingers and acknowledges her with a nod of approval. Abby, taking deep breaths, watches as Mike enters alongside the bikini-clad women, who soon depart. With determination, she walks off, only to later awaken from a vivid nightmare about a weather-girl being unclothed. Transitioning to the office's tea-break area, Abby and Joy are intently examining the ratings. Mike enters the scene, trailing Abby as they head to her office. Seated at her desk, Abby fixes Mike with a challenging stare, picks up a card, reaches for the phone, and begins dialing a number. Observing her actions, Mike picks up another phone to eavesdrop, though he ultimately hangs up on Abby. Mike then lets himself fall into a chair, places the phone on hold, shifts his gaze to the side, and nods in acknowledgment as he keeps track of the timer displayed prominently on Abby's phone. Abby takes a moment to reflect, her expression thoughtful. Meanwhile, at the hospital, the handsome and impeccably groomed Colin patiently waits on hold. Later, inside a cafe and subsequently in a boutique, they examine dresses alongside a saleswoman. Abby holds a dress up against herself, contemplating her look. On the journey home, as they find themselves in Abby's living room, Mike reaches down the side of a chair, retrieves some knitting, regards it with a frown, and quickly deposits it back onto the floor. Abby then descends the stairs, looking impeccably attractive in black stilettos, complemented by a snug, low-cut black dress that elegantly stops at her knees, her long, blonde hair freely cascading in loose curls. With an air of confidence, she smirks, lightly strokes Mike's chest, and he playfully slaps her on the bum. Mike, now crouching behind the couch, offers a smile and gives Abby a thumbs-up to show his approval. Responding to the encouragement, Abby performs a quick victory dance, energetically punching the air in triumph. At the baseball game, events unfold as the pitcher delivers the pitch and the batter successfully hits the ball. As Abby and Colin make their way towards their seats, Mike converses with Abby through an earpiece, while he himself takes a seat nearby. Abby indulges in some popcorn, exaggeratedly shrugging her shoulders as she enjoys the snack. In the unfolding excitement, the batter sprints around the field, prompting the fans to rise to their feet in a wave of exhilaration. Colin makes an attempt to capture the attention of a passing food vendor. Meanwhile, a girl catches Mike's eye with a grin and lifts a hot dog to her lips, but in an unexpected twist, she spills her drink onto Colin's lap, resulting in a humorous mishap. A cameraman captures footage of Abby as she diligently tries to clean the stain, her head bowed over Colin's lap, her hair swishing back and forth, inadvertently creating a suggestive scene. As this unfolds, she looks up, only to catch sight of herself being broadcast on a heart-shaped video screen above the scoreboard, framed by the Kiss Cam. Following the game, Abby and Colin make their way home, walking side by side."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The guy rushes out, losing his towel, while Abby covers her eyes. D'Artagnan snuggles up to him, leaving Abby grinning and captivated. The guy reopens the door, prompting Abby to dance with joy. On set, Abby hurriedly fits an earpiece into Mike's ear as he interacts with some girls, cleaning Jell-O off one's finger with approval. Abby steadies her nerves as Mike enters with the bikini-clad women who soon depart, and Abby exits. She jolts awake from a nightmare about a naked weather girl. Later, Abby and Joy review ratings in the break area; Mike follows Abby to her office. Settling at her desk, Abby challenges Mike, picks up a card and phone, and dials, but Mike listens in furtively before hanging up her call. He relaxes into a chair, puts the phone on hold, and watches the timer, while Abby ponders. Meanwhile, Colin waits at the hospital. Abby and others browse dresses at a boutique, with Abby trying one against herself. Later, at home, Mike discards some knitting, looking displeased. Abby descends the stairs, radiating confidence in a seductive black outfit, teasing Mike with a playful gesture. He responds with encouragement and Abby celebrates with a small victory dance. At a baseball game, as Abby and Colin take their seats, Mike communicates through an earpiece and sits nearby. Abby nonchalantly eats popcorn as the game unfolds. Colin attempts to catch a vendor's attention, but a girl inadvertently spills her drink on him, capturing the moment on camera. Embarrassed, Abby tends to the stain, inadvertently finding herself on the Kiss Cam. Abby and Colin later walk home together."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The guy, sprinting like an athlete during a track meet, runs out, and his towel falls to the ground, landing with the soft thud characteristic of cotton fabric. Abby covers her eyes, reacting as one might during an unexpected scene in a romantic comedy. Inside the quaint living room decorated with vintage posters, D'Artagnan, an affectionate Persian cat known for his luxurious fur, cozies up to the guy. Abby's mouth hangs open in a big, toothy grin, her eyes twinkle with the kind of delight seen in a child at a magic show, and she is transfixed. The guy gestures emphatically to the door, which he reopens with the flair of an actor on stage. Abby dances for joy, reminiscent of a ballerina in an unscripted performance. On set at the bustling TV studio, the makeup girl, punctual as always, goes. Abby roughly forces an earpiece into Mike's ear, demonstrating the urgency of a live broadcast situation. Outside, the chicks, members of a flash mob rehearsing nearby, pull him in. Mike licks the red Jell-O off one of the girl's fingers, reminiscent of a playful scene at a summer picnic, and gives an approving nod. Abby takes deep breaths as Mike comes in with the bikini babes, who then head off to their next gig at the beach festival. She walks off, pondering the day's whirlwind events. Abby wakes up from her naked weather-girl nightmare, a reflection of her anxieties about public speaking. Abby and Joy, colleagues at the bustling news network, are in the tea-break area of the office, looking at the ratings that determine their show's success. Mike walks in, following Abby to her office, their footsteps echoing in the hallway. Sitting at her desk, Abby gives Mike a challenging look, picks up a card and the phone, and dials the number with the confidence of a seasoned producer. Mike grabs a phone to listen in but hangs Abby up, ending the call with the casual nonchalance of a prankster. Mike flops into a chair, puts the phone on hold, glances aside, and nods while looking at the timer on Abby's phone display, indicative of their tightly scheduled broadcast. Abby looks thoughtful, considering the implications of the latest ratings. At the hospital, handsome, clean-cut Colin, with the demeanor of a leading man in a medical drama, keeps holding. In a cafe, in a boutique, they look at dresses with a saleswoman who exudes the charm and expertise of a seasoned fashion consultant. Abby holds a dress against herself, envisioning a glamorous evening. On the way home, sitting in Abby's cozy living room adorned with travel souvenirs, Mike reaches down the side of the chair and picks up some knitting, a hobby Abby took up as a stress reliever, frowns, and quickly dumps it back on the floor. Abby comes downstairs, looking extremely sexy in black stilettos and a figure-hugging, low-cut black dress that stops at her knees, with her long, blonde hair hanging loose in flowing curls styled by a high-end salon. She smirks, strokes his chest with the casual confidence of a femme fatale, and he slaps her bum playfully, reminiscent of a classic romantic comedy dynamic. Mike crouches behind the couch, smiles like a mischievous friend scheming a surprise, and gives Abby the thumbs-up. Abby does a little victory dance, punching the air as if she's won an award. At the baseball game, the pitcher, with the precision of a seasoned athlete, pitches, and the batter hits, sending the ball soaring. As Abby and Colin walk to their seats, Mike talks to Abby on an earpiece, offering advice like a behind-the-scenes coach, and sits nearby. She munches popcorn with an exaggerated shrug, enjoying the carefree atmosphere of a summer ballgame. The batter sprints around the field, and the fans, in a wave of excitement, stand up excitedly. Colin tries to get the attention of a food vendor selling hot dogs and pretzels. A girl grins at Mike and lifts the hot dog to her lips, but shocked as if caught in a sitcom gag, she spills her drink in Colin's lap. A cameraman, capturing every moment for the stadium's live feed, films Abby as she rubs the stain, her head bent over Colin's crotch, and her hair swishes back and forth, making it look like she's doing something quite different, a scene that might be misinterpreted on the stadium's big screen. She looks up and sees herself in a heart-shaped video screen above the scoreboard, the Kiss Cam, a feature popular in sports venues. Abby and Colin walk home, reflecting on the day's humorous mishaps."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The guy runs out and his towel falls to the ground. Abby covers her eyes. Inside D'Artagnan cozies up to the guy. Abby's mouth hangs open in a big toothy grin. her eyes twinkle and she is transfixed. The guy points to the door and reopens it. Abby dances for joy. On set the makeup girl goes. Abby roughly forces an earpiece into Mike's ear. Outside the chicks pull him in. Mike licks the red JellO off one of the girl's fingers and gives an approving nod. Abby takes deep breaths as Mike comes in with the bikini babes who then head off. She walks off. Abby wakes up from her naked weathergirl nightmare. Abby and Joy are in the teabreak area of the office looking at the ratings. Mike walks in following Abby to her office. Sitting at her desk Abby gives Mike a challenging look picks up a card and the phone and dials. Mike grabs a phone to listen on but hangs Abby up. Mike flops into a chair puts the phone on hold glances aside and nods while looking at the timer on Abby's phone display. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Abby looks thoughtful. At the hospital handsome cleancut Colin keeps holding. In a cafe in a boutique they look at dresses with a saleswoman. Abby holds a dress against herself. On the way home sitting in Abby's living room Mike reaches down the side of the chair and picks up some knitting frowns and quickly dumps it back on the floor. Abby comes downstairs looking extremely sexy in black stilettos and a figurehugging lowcut black dress that stops at her knees with her long blonde hair hanging loose in flowing curls. She smirks strokes his chest and he slaps her bum. Mike crouches behind the couch smiles and gives Abby the thumbsup. Abby does a little victory dance punching the air. At the baseball game the pitcher pitches and the batter hits. As Abby and Colin walk to their seats Mike talks to Abby on an earpiece and sits nearby. She munches popcorn with an exaggerated shrug. The batter sprints around the field and the fans stand up excitedly. Colin tries to get the attention of a food vendor. A girl grins at Mike and lifts the hot dog to her lips but shocked she spills her drink in Colin's lap. A cameraman films Abby as she rubs the stain her head bent over Colin's crotch and her hair swishes back and forth making it look like she is. doing something quite different. She looks up and sees herself in a heartshaped video screen above the scoreboard. the Kiss Cam. Abby and Colin walk home."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The guy runs out and his towel falls to the ground. Abby covers her eyes. Inside D'Artagnan cozies up to the guy. Abby's mouth hangs open in a big toothy grin. her eyes twinkle and she is transfixed. The guy points to the door and reopens it. Abby dances for joy. On set the makeup girl goes. Abby roughly forces an earpiece into Mike's ear. Outside the chicks pull him in. Mike licks the red JellO off one of the girl's fingers and gives an approving nod. Abby takes deep breaths as Mike comes in with the bikini babes who then head off. She walks off. Abby wakes up from her naked weathergirl nightmare. Abby and Joy are in the teabreak area of the office looking at the ratings. Mike walks in following Abby to her office. Sitting at her desk Abby gives Mike a challenging look picks up a card and the phone and dials. Mike grabs a phone to listen on but hangs Abby up. Mike flops into a chair puts the phone on hold glances aside and nods while looking at the timer on Abby's phone display. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Abby looks thoughtful. At the hospital handsome cleancut Colin keeps holding. In a cafe in a boutique they look at dresses with a saleswoman. Abby holds a dress against herself. On the way home sitting in Abby's living room Mike reaches down the side of the chair and picks up some knitting frowns and quickly dumps it back on the floor. Abby comes downstairs looking extremely sexy in black stilettos and a figurehugging lowcut black dress that stops at her knees with her long blonde hair hanging loose in flowing curls. She smirks strokes his chest and he slaps her bum. Mike crouches behind the couch smiles and gives Abby the thumbsup. Abby does a little victory dance punching the air. At the baseball game the pitcher pitches and the batter hits. As Abby and Colin walk to their seats Mike talks to Abby on an earpiece and sits nearby. She munches popcorn with an exaggerated shrug. The batter sprints around the field and the fans stand up excitedly. Colin tries to get the attention of a food vendor. A girl grins at Mike and lifts the hot dog to her lips but shocked she spills her drink in Colin's lap. A cameraman films Abby as she rubs the stain her head bent over Colin's crotch and her hair swishes back and forth making it look like she is. doing something quite different. She looks up and sees herself in a heartshaped video screen above the scoreboard. the Kiss Cam. Abby and Colin walk home."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The guy runs out and his towel falls to the ground. Abby covers her eyes. Inside D'Artagnan cozies up to the guy. Abby's mouth hangs open in a big toothy grin. her eyes twinkle and she is transfixed. The guy points to the door and reopens it. Abby dances for joy. On set the makeup girl goes. Abby roughly forces an earpiece into Mike's ear. Outside the chicks pull him in. As Abby and Colin walk to their seats Mike talks to Abby on an earpiece and sits nearby. She munches popcorn with an exaggerated shrug. The batter sprints around the field and the fans stand up excitedly. Colin tries to get the attention of a food vendor. A girl grins at Mike and lifts the hot dog to her lips but shocked she spills her drink in Colin's lap. A cameraman films Abby as she rubs the stain her head bent over Colin's crotch and her hair swishes back and forth making it look like she is. doing something quite different. She looks up and sees herself in a heartshaped video screen above the scoreboard. the Kiss Cam. Abby and Colin walk home."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The guy runs out and his towel falls to the ground. Abby covers her eyes. Inside D'Artagnan cozies up to the guy. Abby's mouth hangs open in a big toothy grin. doing something quite different. She looks up and sees herself in a heartshaped video screen above the scoreboard. the Kiss Cam. Abby and Colin walk home."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The penguin flutters out, and its hat tumbles to the sand. Oliver shields his nose. Outside, Porthos snuggles up to the penguin. Oliver's arm dangles open in a big, toothy grin, his ears flicker, and he is mesmerized. The penguin gestures to the curtain and reopens it. Oliver hops for joy. In the studio, the costume clown leaves. Oliver clumsily shoves a walkie-talkie into Hannah's shoe. Indoors, the parrots drag her in. Hannah nibbles the blue pudding off one of the clown's toes and gives a disapproving wink. Oliver takes deep coughs as Hannah strolls in with the swimsuit pirates, who then wander away. He skips away. Oliver drifts awake from his flying magician-cat nightmare. Oliver and Joy are in the coffee-huddle zone of the workshop, staring at the charts. Hannah drifts in, trailing Oliver to his cubicle. Lounging at his station, Oliver gives Hannah a daring wink, grabs a book and the laptop, and types. Hannah snatches a tablet to eavesdrop with but disconnects Oliver. Hannah flops onto a sofa, places the tablet on pause, glances down, and grins while watching the clock on Oliver’s tablet screen. Oliver looks dreamy. At the bookstore, charming, tousle-haired Ethan keeps drumming. In a tearoom, at a gallery, they admire ties with a customer. Oliver holds a scarf against himself. On the way to the park, sitting in Oliver's lounge, Hannah reaches beneath the cushion and retrieves some crochet, scowls, and hastily chucks it back on the carpet. Oliver comes upstairs, looking remarkably elegant in yellow moccasins and a shapely, strapless yellow gown that halts at his ankles, with his short, curly locks tied tight in shimmering braids. He giggles, pats her elbow, and she taps his knee. Hannah crouches beside the armchair, beams, and gives Oliver the peace sign. Oliver performs a tiny success jig, clapping the sky. At the soccer match, the defender kicks, and the goalie catches. As Oliver and Ethan wander to their benches, Hannah whispers to Oliver through a radio and lounges nearby. He crunches nachos with an exaggerated nod. The defender jogs across the pitch, and the crowd leaps up joyfully. Ethan attempts to gain the focus of a souvenir merchant. A boy smirks at Hannah and raises the pretzel to his fingers, but startled, he tips his soda in Ethan’s lap. A journalist records Oliver as he dabs the spill, his gaze hovering over Ethan’s knee, and his socks flit back and forth, making it seem like he’s doing something rather unexpected. He glances up and spots himself in a heart-shaped display above the scoreboard, the Dance Cam. Oliver and Ethan stroll home."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The guy's towel falls as he runs out, prompting Abby to cover her eyes, but she's soon transfixed by D'Artagnan's antics. The guy reopens the door, and Abby joyously dances. Back on set, Abby forcefully puts an earpiece into Mike's ear. Mike enjoys red Jell-O with the bikini babes before Abby leaves. She wakes from a nightmare and later checks ratings with Joy. Mike interrupts her office call, leaving Abby thoughtful. At the hospital, Colin waits. Abby shops for dresses and flaunts a sexy black dress at home, teasing Mike, who gives her a thumbs-up. At a baseball game, Mike communicates with Abby via earpiece. A mishap leads to Abby appearing on the Kiss Cam, seemingly doing something embarrassing. Abby and Colin head home afterward."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Abby and Colin walk home the Kiss Cam She looks up and sees herself in a heartshaped video screen above the scoreboard doing something quite different A cameraman films Abby as she rubs the stain her head bent over Colin's crotch and her hair swishes back and forth making it look like she is A girl grins at Mike and lifts the hot dog to her lips but shocked she spills her drink in Colin's lap Colin tries to get the attention of a food vendor The batter sprints around the field and the fans stand up excitedly She munches popcorn with an exaggerated shrug As Abby and Colin walk to their seats Mike talks to Abby on an earpiece and sits nearby At the baseball game the pitcher pitches and the batter hits Abby does a little victory dance punching the air Mike crouches behind the couch smiles and gives Abby the thumbsup She smirks strokes his chest and he slaps her bum Abby comes downstairs looking extremely sexy in black stilettos and a figurehugging lowcut black dress that stops at her knees with her long blonde hair hanging loose in flowing curls On the way home sitting in Abby's living room Mike reaches down the side of the chair and picks up some knitting frowns and quickly dumps it back on the floor Abby holds a dress against herself In a cafe in a boutique they look at dresses with a saleswoman At the hospital handsome cleancut Colin keeps holding Abby looks thoughtful Mike flops into a chair puts the phone on hold glances aside and nods while looking at the timer on Abby's phone display Mike grabs a phone to listen on but hangs Abby up Sitting at her desk Abby gives Mike a challenging look picks up a card and the phone and dials Mike walks in following Abby to her office Abby and Joy are in the teabreak area of the office looking at the ratings Abby wakes up from her naked weathergirl nightmare She walks off Abby takes deep breaths as Mike comes in with the bikini babes who then head off Mike licks the red JellO off one of the girl's fingers and gives an approving nod Outside the chicks pull him in Abby roughly forces an earpiece into Mike's ear On set the makeup girl goes Abby dances for joy The guy points to the door and reopens it her eyes twinkle and she is transfixed Abby's mouth hangs open in a big toothy grin Inside D'Artagnan cozies up to the guy Abby covers her eyes The guy runs out and his towel falls to the ground"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Abby covers her eyes The guy runs out and his towel falls to the ground Abby's mouth hangs open in a big toothy grin Inside D'Artagnan cozies up to the guy The guy points to the door and reopens it her eyes twinkle and she is transfixed On set the makeup girl goes Abby dances for joy Outside the chicks pull him in Abby roughly forces an earpiece into Mike's ear Abby takes deep breaths as Mike comes in with the bikini babes who then head off Mike licks the red JellO off one of the girl's fingers and gives an approving nod Abby wakes up from her naked weathergirl nightmare She walks off Mike walks in following Abby to her office Abby and Joy are in the teabreak area of the office looking at the ratings Mike grabs a phone to listen on but hangs Abby up Sitting at her desk Abby gives Mike a challenging look picks up a card and the phone and dials Abby looks thoughtful Mike flops into a chair puts the phone on hold glances aside and nods while looking at the timer on Abby's phone display In a cafe in a boutique they look at dresses with a saleswoman At the hospital handsome cleancut Colin keeps holding On the way home sitting in Abby's living room Mike reaches down the side of the chair and picks up some knitting frowns and quickly dumps it back on the floor Abby holds a dress against herself She smirks strokes his chest and he slaps her bum Abby comes downstairs looking extremely sexy in black stilettos and a figurehugging lowcut black dress that stops at her knees with her long blonde hair hanging loose in flowing curls Abby does a little victory dance punching the air Mike crouches behind the couch smiles and gives Abby the thumbsup As Abby and Colin walk to their seats Mike talks to Abby on an earpiece and sits nearby At the baseball game the pitcher pitches and the batter hits The batter sprints around the field and the fans stand up excitedly She munches popcorn with an exaggerated shrug A girl grins at Mike and lifts the hot dog to her lips but shocked she spills her drink in Colin's lap Colin tries to get the attention of a food vendor doing something quite different A cameraman films Abby as she rubs the stain her head bent over Colin's crotch and her hair swishes back and forth making it look like she is the Kiss Cam She looks up and sees herself in a heartshaped video screen above the scoreboard Abby and Colin walk home"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "At the hospital handsome cleancut Colin keeps holding In a cafe in a boutique they look at dresses with a saleswoman Abby holds a dress against herself On the way home sitting in Abby's living room Mike reaches down the side of the chair and picks up some knitting frowns and quickly dumps it back on the floor Abby comes downstairs looking extremely sexy in black stilettos and a figurehugging lowcut black dress that stops at her knees with her long blonde hair hanging loose in flowing curls She smirks strokes his chest and he slaps her bum Mike crouches behind the couch smiles and gives Abby the thumbsup Abby does a little victory dance punching the air At the baseball game the pitcher pitches and the batter hits As Abby and Colin walk to their seats Mike talks to Abby on an earpiece and sits nearby She munches popcorn with an exaggerated shrug The batter sprints around the field and the fans stand up excitedly Colin tries to get the attention of a food vendor A girl grins at Mike and lifts the hot dog to her lips but shocked she spills her drink in Colin's lap A cameraman films Abby as she rubs the stain her head bent over Colin's crotch and her hair swishes back and forth making it look like she is doing something quite different She looks up and sees herself in a heartshaped video screen above the scoreboard the Kiss Cam Abby and Colin walk home The guy runs out and his towel falls to the ground Abby covers her eyes Inside D'Artagnan cozies up to the guy Abby's mouth hangs open in a big toothy grin her eyes twinkle and she is transfixed The guy points to the door and reopens it Abby dances for joy On set the makeup girl goes Abby roughly forces an earpiece into Mike's ear Outside the chicks pull him in Mike licks the red JellO off one of the girl's fingers and gives an approving nod Abby takes deep breaths as Mike comes in with the bikini babes who then head off She walks off Abby wakes up from her naked weathergirl nightmare Abby and Joy are in the teabreak area of the office looking at the ratings Mike walks in following Abby to her office Sitting at her desk Abby gives Mike a challenging look picks up a card and the phone and dials Mike grabs a phone to listen on but hangs Abby up Mike flops into a chair puts the phone on hold glances aside and nods while looking at the timer on Abby's phone display Abby looks thoughtful"
        }
      ]
    }
  ]
}