{
  "ground_truth": "Mike is hiding in the bushes as she turns to go, and Colin grabs her arm, pulls her close, and gives her a lingering kiss while Mike stares, open-mouthed. Colin smiles at Abby, and they go to their apartments, which are opposite each other. Abby waves a giant foam hand that she picked up at the game as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug, then runs joyfully to her apartment as Mike walks off. On the show, he is wearing a gorilla suit, and a video screen behind Larry and Georgia shows monkeys having sex while Abby and Joy watch a monitor. Mike’s nephew, Joe, is present, and the gorilla suit is mentioned. Abby jumps up and down, grinning, as she steps out of her apartment. On the doormat is a gift bag, which Abby picks up and looks around, frowning. She takes an envelope out of the gift bag and goes back inside, opening the card and taking a box from the gift bag. Inside the box is a pair of remote-controlled, vibrating briefs. Abby stands in front of the mirror, applies lipstick, perches on the arm of a chair, sips a glass of white wine, and glances at the vibrating briefs, considering for a moment. She reaches under her white dress, pulls down her briefs, and as she does so, D'Artagnan the cat trots past and climbs onto a chair. Abby picks up the black, lacy vibrating briefs and puts them on, pulls up the briefs, and straightens out her dress while D'Artagnan the cat stares at her. She picks up the small, cylindrical remote control unit, puts her briefs and the box for the vibrating briefs behind a cushion, stuffs the remote control in her handbag, and opens the door. Mike and Stuart are there, and she smiles bitterly. In Stuart's car, executives are gathered in a restaurant, and Mike puts his arms around the bikini babes as they sit around a table with the executives. Abby kicks Mike, knocking over her bag and causing the remote control to fall out. A kid finds the remote control unit for the vibrating briefs on the floor and picks it up, switching it on and causing Abby to squirm. Abby and Mike look under the table as the boy shakes it, making Abby stiffen. Abby squirms, crosses her legs, and points at her feet. Mike sees the boy with the remote and she glares at him while he winks. Mike grabs the remote from the boy, and Abby grabs it back. They lean on a railing, glance at the rest of the group, and Mike's gaze is fixed on Abby and Colin as they go. Stuart comes over, and a country road lined with lush, green trees, dappled with sunlight, is seen.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Mike is concealing in the shrubs as she turns to leave, and Colin seizes her arm, draws her close, and bestows her a prolonged kiss while Mike gawks, agape. Colin grins at Abby, and they proceed to their residences, which are across from one another. Abby waves a huge foam hand that she picked up at the game as Colin goes into his dwelling. Abby races along the path to Mike and gives him a hug, then scampers joyfully to her apartment as Mike walks off. On the broadcast, he is wearing a gorilla suit, and a video screen behind Larry and Georgia displays monkeys copulating while Abby and Joy observe a monitor. Mike’s nephew, Joe, is present, and the gorilla suit is mentioned. Abby jumps up and down, beaming, as she exits her apartment. On the doormat is a gift bag, which Abby picks up and looks around, frowning. She takes an envelope out of the gift bag and goes back inside, opening the card and taking a box from the gift bag. Inside the box is a pair of remote-controlled, vibrating briefs. Abby stands in front of the mirror, applies lipstick, perches on the arm of a chair, sips a glass of white wine, and glances at the vibrating briefs, contemplating briefly. She reaches under her white dress, pulls down her briefs, and as she does so, D'Artagnan the cat trots past and climbs onto a chair. Abby picks up the black, lacy vibrating briefs and puts them on, pulls up the briefs, and straightens out her dress while D'Artagnan the cat gazes at her. She picks up the small, cylindrical remote control unit, puts her briefs and the box for the vibrating briefs behind a cushion, stuffs the remote control in her handbag, and opens the door. Mike and Stuart are there, and she smiles bitterly. In Stuart's car, executives are assembled in a restaurant, and Mike puts his arms around the bikini babes as they sit around a table with the executives. Abby kicks Mike, knocking over her bag and causing the remote control to fall out. A youngster finds the remote control unit for the vibrating briefs on the floor and picks it up, switching it on and causing Abby to squirm. Abby and Mike look under the table as the boy shakes it, making Abby stiffen. Abby squirms, crosses her legs, and points at her feet. Mike sees the boy with the remote and she glares at him while he winks. Mike snatches the remote from the boy, and Abby grabs it back. They lean on a railing, glance at the rest of the group, and Mike's gaze is fixed on Abby and Colin as they leave. Stuart comes over, and a rural road lined with lush, green trees, dappled with sunlight, is seen."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Mike is hidden in the bushes as she is turned to go, and her arm is grabbed by Colin, who pulls her close and gives her a lingering kiss while Mike is stared at, open-mouthed. Abby is smiled at by Colin, and their apartments, which are opposite each other, are gone to by them. A giant foam hand, picked up at the game by Abby, is waved as his apartment is gone into by Colin. Mike is run along the path to by Abby and hugged by her, then she runs joyfully to her apartment as off is walked by Mike. On the show, a gorilla suit is worn by him, and monkeys having sex are shown on a video screen behind Larry and Georgia while a monitor is watched by Abby and Joy. Mike's nephew, Joe, is present, and the gorilla suit is mentioned. Up and down, Abby jumps, grinning, as out of her apartment she steps. On the doormat, a gift bag is picked up by Abby as she looks around, frowning. An envelope is taken out of the gift bag by her, and she goes back inside, opens the card, and takes a box from the gift bag. Inside the box are a pair of remote-controlled, vibrating briefs. In front of the mirror, Abby stands, lipstick is applied by her, and she perches on the arm of a chair, sipping a glass of white wine, glancing at the vibrating briefs, and considering for a moment. Under her white dress, she reaches, her briefs are pulled down by her, and as she does so, D'Artagnan the cat trots past and climbs onto a chair. The black, lacy vibrating briefs are picked up by Abby and put on, the briefs are pulled up by her, and her dress is straightened out while at her, D'Artagnan the cat stares. The small, cylindrical remote control unit is picked up by her, her briefs and the box for the vibrating briefs are put behind a cushion, the remote control is stuffed in her handbag, and the door is opened by her. Stuart and Mike are there, and bitterly she smiles. In Stuart's car, a restaurant is gathered in by executives, and around a table with the executives, Mike puts his arms around the bikini babes. Mike is kicked by Abby, knocking over her bag and causing the remote control to fall out. The remote control unit for the vibrating briefs is found on the floor by a kid and picked up, switched on, causing Abby to squirm. Under the table, Abby and Mike look as it is shaken by the boy, making Abby stiffen. Abby squirms, her legs are crossed, and at her feet, she points. The boy with the remote is seen by Mike, and at him, she glares while he winks. The remote is grabbed from the boy by Mike, and it is grabbed back by Abby. On a railing, they lean, glancing at the rest of the group, and Abby and Colin are gone to by Mike's gaze as they go. Stuart comes over, and a country road lined with lush, green trees, dappled with sunlight, is shown."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Mike hides in the bushes as Colin pulls Abby close for a lingering kiss, leaving Mike open-mouthed. Colin smiles at Abby, and they head to their opposite apartments. Abby waves a giant foam hand from the game as Colin enters his apartment. She joyfully hugs Mike and runs to her apartment while Mike walks away. On the show, Mike wears a gorilla suit, and a screen behind Larry and Georgia displays monkeys mating as Abby and Joy watch. Mike’s nephew, Joe, is present, and the gorilla suit is mentioned. Abby grins, jumping as she exits her apartment. She finds a gift bag on the doormat, frowns, and takes an envelope from it, returning inside. She opens the card and finds a pair of remote-controlled, vibrating briefs in the box. Abby applies lipstick, sips white wine, and considers the briefs. She removes her own briefs, and D'Artagnan the cat trots by. Abby puts on the vibrating briefs, straightens her dress, and hides the box and briefs behind a cushion. She stuffs the remote in her handbag and opens the door to Mike and Stuart, smiling bitterly. In Stuart's car, executives gather at a restaurant, and Mike embraces bikini babes at the table. Abby kicks Mike, spilling her bag and revealing the remote. A kid finds it, switches it on, and Abby squirms. She and Mike look under the table as the boy shakes it, making her stiffen. Abby squirms, crosses her legs, and points at her feet. Mike sees the boy with the remote, and she glares as he winks. Mike grabs the remote, and Abby takes it back. They lean on a railing, glancing at the group, while Mike watches Abby and Colin leave. Stuart arrives, and a country road lined with lush, sun-dappled trees is seen."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Mike hides in bushes watching Colin grab Abby's arm and kiss her deeply; Mike gapes. Colin smiles; he and Abby enter their opposite apartments; Abby waves giant foam hand. Abby runs, hugs Mike, and goes home; Mike leaves. On a show, Mike wears a gorilla suit; monkeys mating appear behind Larry and Georgia; Abby and Joy watch, and Mike's nephew Joe is there; suit mentioned. Abby excitedly exits apartment, finds gift bag on doormat, looks around puzzled, retrieves envelope and box containing remote-controlled vibrating briefs. Abby applies lipstick, sips white wine, considers briefs, removes her own under white dress as D'Artagnan the cat passes by, then wears new lacy briefs while cat watches. Abby hides original briefs and box, puts remote in handbag, opens door to Mike and Stuart, smiling bitterly. In Stuart's car at a restaurant, Mike wraps arms around bikini-clad women; Abby kicks him, remote falls out. A boy picks it up, activating briefs, causing Abby discomfort. Abby gestures frantically; Mike notices boy with remote, winks at Abby, retrieves device; Abby snatches it back. They lean on railing, observing group; Mike watches Abby and Colin leave. Stuart approaches; scene shifts to a sunny country road bordered by lush trees."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Mike is carefully concealed within the dense foliage of the bushes as she turns to leave. At that moment, Colin seizes her arm, pulling her close to him, and plants a lingering kiss on her lips while Mike watches in disbelief, his mouth agape. Colin then flashes a charming smile at Abby, and together they make their way to their respective apartments, which happen to be situated directly across from one another. As Colin enters his apartment, Abby waves a giant foam hand, a souvenir she picked up at the game, in a playful gesture. She then joyfully runs along the path to where Mike is standing, giving him a warm hug before she dashes happily to her own apartment, while Mike slowly walks away. \n\nOn the television show, Mike is humorously dressed in a gorilla suit, and a video screen positioned behind Larry and Georgia displays a rather comical scene of monkeys engaging in intimate activities, all while Abby and Joy watch the monitor with amusement. Mike’s nephew, Joe, is also present, and the gorilla suit is humorously referenced. Abby, filled with excitement, jumps up and down, grinning widely as she steps out of her apartment. On her doormat, she discovers a gift bag, which she picks up, looking around with a puzzled expression. She retrieves an envelope from the gift bag and heads back inside, where she opens the card and takes out a box from the gift bag. Inside the box, she finds a pair of remote-controlled, vibrating briefs. \n\nStanding in front of the mirror, Abby applies a fresh coat of lipstick, perches on the arm of a chair, sips a glass of chilled white wine, and glances thoughtfully at the vibrating briefs. After a moment of consideration, she reaches under her white dress, pulls down her current briefs, and as she does so, D'Artagnan the cat trots past her and climbs onto a nearby chair. Abby picks up the black, lacy vibrating briefs, puts them on, pulls them up, and smooths out her dress while D'Artagnan the cat watches her intently. She then picks up the small, cylindrical remote control unit, discreetly hides her regular briefs and the box for the vibrating briefs behind a cushion, stuffs the remote control into her handbag, and opens the door. \n\nThere, she is greeted by Mike and Stuart, and she offers them a somewhat bitter smile. In Stuart's car, a group of executives is gathered in a restaurant, and Mike, with a confident air, puts his arms around the bikini-clad women as they sit around a table with the executives. Abby, feeling a mix of emotions, kicks Mike, inadvertently knocking over her bag and causing the remote control to fall out. A curious child finds the remote control unit for the vibrating briefs on the floor, picks it up, and mischievously switches it on, causing Abby to squirm uncomfortably. Abby and Mike both look under the table as the boy shakes it, making Abby stiffen in response. She squirms, crosses her legs, and points at her feet in an attempt to communicate her predicament. Mike notices the boy with the remote and she glares at him while he winks playfully. Mike quickly grabs the remote from the boy, and Abby snatches it back. They lean on a railing, casting glances at the rest of the group, while Mike's gaze remains fixed on Abby and Colin as they depart. Stuart then approaches, and a picturesque country road lined with lush, green trees, dappled with sunlight, comes into view."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Mike finds himself ingeniously and carefully concealed within the thick, abundant foliage of the dense bushes as she gradually turns to make her way out. At that precise moment, Colin decisively seizes her arm, pulling her toward him with a firm grasp, and audaciously plants a lingering kiss on her lips. Meanwhile, Mike witnesses this unfolding scene in utter disbelief, his mouth hanging open in shock. Afterward, Colin flashes a charming and confident smile at Abby, and together they casually make their way to their individual apartments, which are conveniently situated directly across from one another. As Colin steps into his apartment, Abby waves a giant foam hand, a memorable souvenir she picked up at the game, in an enthusiastic and playful gesture. She then joyfully dashes along the path to where Mike is standing, giving him a warm, friendly hug before she merrily runs to her own apartment, while Mike slowly and thoughtfully walks away.\n\nOn the engaging television show, Mike is humorously dressed in an extravagant gorilla suit, and a large video screen positioned behind Larry and Georgia displays a rather comical and entertaining scene of monkeys engaging in unexpectedly intimate activities. All the while, Abby and Joy watch the monitor with genuine amusement. Mike's young nephew, Joe, also happens to be present, and the gorilla suit is humorously referenced, adding to the lighthearted atmosphere. Abby, filled with immense excitement, jumps up and down energetically, grinning widely as she steps eagerly out of her apartment. On her doormat, she discovers a gift bag, which she curiously picks up, looking around with a puzzled expression on her face. She retrieves an envelope from the gift bag and heads back inside, where she proceeds to open the card and takes out a box from the gift bag. Inside the box, she finds a pair of intriguing remote-controlled, vibrating briefs.\n\nStanding poised in front of the mirror, Abby applies a fresh, vivid coat of lipstick, then perches gracefully on the arm of a chair, sips a glass of chilled white wine, and glances thoughtfully at the vibrating briefs. After a contemplative moment, she reaches under her pristine white dress, pulls down her current set of briefs, and as she does so, D'Artagnan the cat trots past her and climbs onto a nearby chair. Abby picks up the black, lacy vibrating briefs, puts them on snugly, pulls them up, and smooths out her dress while D'Artagnan the cat watches her intently with curious eyes. She then picks up the small, cylindrical remote control unit, discreetly hides her regular briefs and the box for the vibrating briefs behind a cushion, stuffs the remote control into her handbag, and opens the door.\n\nThere, she is greeted by Mike and Stuart, and she offers them a somewhat bitter, yet polite smile. In Stuart's car, a group of executives is gathered in a bustling restaurant, and Mike, with a confident and relaxed air, casually puts his arms around the bikini-clad women as they sit around a table with the executives. Abby, feeling a complex mix of emotions, kicks Mike, inadvertently knocking over her bag and causing the remote control to fall out onto the floor. A curious child soon discovers the remote control unit for the vibrating briefs, picks it up eagerly, and mischievously switches it on, causing Abby to squirm uncomfortably in her seat. Abby and Mike both glance under the table as the boy shakes the remote control, making Abby stiffen in response. She squirms, crosses her legs tightly, and points at her feet in an attempt to communicate her predicament. Mike then notices the boy with the remote control and she glares at him while he winks playfully in response. Mike quickly retrieves the remote from the boy, and Abby promptly snatches it back into her possession. They both lean on a railing, casting furtive glances at the rest of the group, while Mike's gaze remains intently fixed on Abby and Colin as they eventually depart. Stuart then approaches, and a picturesque country road lined with lush, green trees, dappled with soft sunlight, unfolds into the view."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Mike is concealed within the dense foliage of the bushes, his eyes intently following the scene as she begins to turn away. At that precise moment, Colin reaches out, firmly grasping her arm, and with a gentle yet assertive pull, draws her closer to him. Their faces near, he leans in and plants a lingering kiss on her lips, a moment that stretches in time while Mike, hidden, watches in disbelief, his mouth agape. As the kiss concludes, Colin's face breaks into a smile directed at Abby, and together, they make their way toward their respective apartments, which stand directly opposite each other. Abby, filled with playful energy, waves a giant foam hand she acquired at the game, a gesture of farewell as Colin disappears into his apartment. With a burst of enthusiasm, Abby dashes along the path, her feet barely touching the ground, until she reaches Mike, enveloping him in a warm embrace. Her joy is palpable as she then bounds back to her apartment, her movements light and carefree, while Mike turns and walks away. Meanwhile, on the show, Mike is clad in a gorilla suit, a humorous sight that contrasts with the video screen behind Larry and Georgia, which displays monkeys engaged in mating rituals. Abby and Joy are seated, their eyes fixed on a monitor, taking in the spectacle. Present in the room is Mike's nephew, Joe, who takes note of the gorilla suit, a detail that adds to the comedic atmosphere. Abby, unable to contain her excitement, jumps up and down, her face alight with a grin, as she steps out of her apartment. Her eyes fall upon a gift bag placed on the doormat, prompting her to pick it up and cast a curious glance around, her brow furrowed in thought. She retrieves an envelope from the gift bag and retreats back inside, where she opens the card and extracts a box from the bag. Inside the box, she discovers a pair of remote-controlled, vibrating briefs, a find that elicits a mix of surprise and intrigue. Standing before the mirror, Abby carefully applies a layer of lipstick, then perches herself on the arm of a chair, savoring a sip of white wine. Her gaze drifts to the vibrating briefs, and she pauses, contemplating her next move. With a decisive motion, she reaches beneath her white dress, sliding her current briefs down her legs, just as D'Artagnan the cat saunters by, leaping onto a chair. Abby picks up the black, lacy vibrating briefs, slipping them on and adjusting them to fit snugly before smoothing out her dress, all under the watchful eyes of D'Artagnan. She then picks up the small, cylindrical remote control unit, discreetly tucks her original briefs and the box for the vibrating briefs behind a cushion, and places the remote control into her handbag. With a deep breath, she opens the door to find Mike and Stuart standing there, greeting them with a smile tinged with bitterness. In Stuart's car, the scene shifts to a restaurant where executives are gathered, and Mike, ever the charmer, wraps his arms around the bikini-clad women seated at the table with the executives. Abby, in a moment of frustration, kicks Mike, inadvertently knocking over her bag and causing the remote control to tumble out. A child, noticing the fallen remote control unit for the vibrating briefs, picks it up and, with a mischievous curiosity, switches it on, triggering a reaction in Abby that makes her squirm in her seat. Both Abby and Mike peer under the table, their attention drawn to the boy who is now shaking the remote, intensifying Abby's discomfort and causing her to stiffen. Abby squirms, crossing her legs tightly, and points at her feet in a silent plea for help. Mike's eyes follow her gesture, landing on the boy with the remote, and she shoots him a glare while he responds with a cheeky wink. In a swift motion, Mike snatches the remote from the boy's grasp, but Abby quickly reclaims it, their hands brushing in the exchange. They find themselves leaning on a railing, casting furtive glances at the rest of the group, while Mike's gaze remains fixed on Abby and Colin as they depart. Stuart approaches, and the scene transitions to a serene country road, flanked by lush, green trees that are gently dappled with sunlight, creating a picturesque and tranquil setting."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Mike hides in the bushes as Colin gives Abby a lingering kiss, leaving Mike staring in shock. Colin and Abby then head to their opposite apartments, with Abby waving a giant foam hand from the game. Abby joyfully hugs Mike before running to her apartment, while Mike walks away. On the show, Mike, in a gorilla suit, is seen with a video of monkeys playing behind Larry and Georgia, as Abby and Joy watch. Mike’s nephew, Joe, is present, and the gorilla suit is mentioned. Abby excitedly exits her apartment, finds a gift bag on her doormat, and retrieves an envelope and a box containing remote-controlled, vibrating briefs. She applies lipstick, sips wine, and considers the briefs before putting them on, while her cat, D'Artagnan, watches. Abby hides the briefs and remote control, then greets Mike and Stuart at the door with a bitter smile. In Stuart's car, they join executives at a restaurant, where Mike mingles with bikini-clad women. Abby accidentally kicks her bag, causing the remote to fall out, which a kid picks up and activates, making Abby squirm. She and Mike look under the table as the boy shakes it, and Abby points at her feet. Mike retrieves the remote from the boy, and Abby takes it back. They lean on a railing, observing the group, as Mike focuses on Abby and Colin leaving. Stuart approaches, and a scenic country road lined with sun-dappled trees is shown."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Mike is hiding in the bushes as she, Abby, who is known for her quick decision-making, turns to go, and Colin grabs her arm, pulls her close, and gives her a lingering kiss while Mike stares, open-mouthed, in disbelief. Colin, a charismatic and confident individual, smiles at Abby, and they go to their apartments, which are opposite each other in a modern urban complex. Abby waves a giant foam hand that she picked up at the baseball game, an event she had been looking forward to all week, as Colin goes into his apartment. Abby runs along the path to Mike, her childhood friend, and gives him a hug, then runs joyfully to her apartment as Mike walks off, feeling a mix of emotions. On the reality show being filmed, Mike is wearing a gorilla suit, a comedic costume chosen for its unexpected humor, and a video screen behind Larry and Georgia, the show's hosts known for their edgy commentary, shows monkeys having sex while Abby and Joy, her spirited roommate, watch a monitor. Mike’s nephew, Joe, who idolizes his uncle despite his antics, is present, and the gorilla suit is mentioned as a running gag. Abby jumps up and down, grinning, as she steps out of her apartment, eagerly anticipating the day. On the doormat is a gift bag, which Abby picks up, looking around, slightly suspicious. She takes an envelope out of the gift bag and goes back inside, opening the card and taking a box from the gift bag. Inside the box is a pair of remote-controlled, vibrating briefs, a novelty item frequently featured on the show for comic relief. Abby stands in front of the mirror, applies lipstick with a steady hand, perches on the arm of a chair, sips a glass of white wine from the renowned Napa Valley, and glances at the vibrating briefs, considering for a moment the hilarity that might ensue. She reaches under her white dress, pulls down her briefs, and as she does so, D'Artagnan the cat, named after the famous musketeer, trots past and climbs onto a chair. Abby picks up the black, lacy vibrating briefs and puts them on, pulls up the briefs, and straightens out her dress while D'Artagnan the cat stares at her with a knowing look. She picks up the small, cylindrical remote control unit, puts her briefs and the box for the vibrating briefs behind a cushion, subtly concealing them, stuffs the remote control in her handbag, and opens the door. Mike and Stuart, her longtime colleagues, are there, and she smiles bitterly, anticipating an awkward encounter. In Stuart's car, executives are gathered in a high-end restaurant frequented by celebrities, and Mike puts his arms around the bikini babes, who are hired models for the show, as they sit around a table with the executives to discuss upcoming projects. Abby kicks Mike, knocking over her bag and causing the remote control to fall out, a scenario that she hoped to avoid. A kid, mischievous and curious, finds the remote control unit for the vibrating briefs on the floor and picks it up, switching it on and causing Abby to squirm in her seat. Abby and Mike look under the table as the boy shakes it, making Abby stiffen in surprise. Abby squirms, crosses her legs, and points at her feet in an effort to hint discreetly at the situation. Mike sees the boy with the remote and she glares at him while he winks, suggesting a shared secret. Mike grabs the remote from the boy, and Abby grabs it back, frustrated by the unfolding chaos. They lean on a railing, which overlooks the bustling city street below, glance at the rest of the group, and Mike's gaze is fixed on Abby and Colin as they go, intrigued by the developing dynamics. Stuart comes over, and a country road lined with lush, green trees, dappled with sunlight and known for its scenic beauty, is seen in a brief transition shot."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Mike is hiding in the bushes as she turns to go and Colin grabs her arm pulls her close and gives her a lingering kiss while Mike stares openmouthed  Colin smiles at Abby and they go to their apartments which are opposite each other  Abby waves a giant foam hand that she picked up at the game  She takes an envelope out of the gift bag and goes back inside opening the card and taking a box from the gift bag  Inside the box is a pair of remotecontrolled vibrating briefs  Abby stands in front of the mirror applies lipstick perches on the arm of a chair sips a glass of white wine and glances at the vibrating briefs considering for a moment  She reaches under her white dress pulls down her briefs and as she does so D'Artagnan the cat trots past and climbs onto a chair  Abby picks up the black lacy vibrating briefs and puts them on pulls up the briefs and straightens out her dress while D'Artagnan the cat stares at her  She picks up the small cylindrical remote control unit puts her briefs and the box for the vibrating briefs behind a cushion stuffs the remote control in her handbag and opens the door  Mike and Stuart are there and she smiles bitterly  In Stuart's car executives are gathered in a restaurant and Mike puts his arms around the bikini babes as they sit around a table with the executives  Abby kicks Mike knocking over her bag and causing the remote control to fall out  A kid finds the remote control unit for the vibrating briefs on the floor and picks it up switching it on and causing Abby to squirm  Abby and Mike look under the table as the boy shakes it making Abby stiffen  Abby squirms crosses her legs and points at her feet  Mike sees the boy with the remote and she glares at him while he winks  as Colin goes into his apartment  Abby runs along the path to Mike and gives him a hug then runs joyfully to her apartment as Mike walks off  On the show he is wearing a gorilla suit and a video screen behind Larry and Georgia shows monkeys having sex  while Abby and Joy watch a monitor  Mike’s nephew Joe is present and the gorilla suit is mentioned  Abby jumps up and down grinning as she steps out of her apartment  On the doormat is a gift bag which Abby picks up and looks around frowning  She takes an envelope out of the gift bag and goes back inside opening the card and taking a box from the gift bag  Inside the box is a pair of remotecontrolled vibrating briefs  Abby stands in front of the mirror applies lipstick perches on the arm of a chair sips a glass of white wine and glances at the vibrating briefs considering for a moment  She reaches under her white dress pulls down her briefs and as she does so D'Artagnan the cat trots past and climbs onto a chair  Abby picks up the black lacy vibrating briefs and puts them on pulls up the briefs and straightens out her dress while D'Artagnan the cat stares at her  She picks up the small cylindrical remote control unit puts her briefs and the box for the vibrating briefs behind a cushion stuffs the remote control in her handbag and opens the door  Mike and Stuart are there and she smiles bitterly  In Stuart's car executives are gathered in a restaurant and Mike puts his arms around the bikini babes as they sit around a table with the executives  Abby kicks Mike knocking over her bag and causing the remote control to fall out  A kid finds the remote control unit for the vibrating briefs on the floor and picks it up switching it on and causing Abby to squirm  Abby and Mike look under the table as the boy shakes it making Abby stiffen  Abby squirms crosses her legs and points at her feet  Mike sees the boy with the remote and she glares at him while he winks  Mike grabs the remote from the boy and Abby grabs it back  They lean on a railing glance at the rest of the group and Mike's gaze is fixed on Abby and Colin as they go  Stuart comes over and a country road lined with lush green trees dappled with sunlight is seen"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Mike is hiding in the bushes as she turns to go and Colin grabs her arm pulls her close and gives her a lingering kiss while Mike stares openmouthed. Colin smiles at Abby and they go to their apartments which are opposite each other. Abby waves a giant foam hand that she picked up at the game. as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug then runs joyfully to her apartment as Mike walks off. On the show he is wearing a gorilla suit and a video screen behind Larry and Georgia shows monkeys having sex. while Abby and Joy watch a monitor. Mike’s nephew Joe is present and the gorilla suit is mentioned. Abby jumps up and down grinning as she steps out of her apartment. On the doormat is a gift bag which Abby picks up and looks around frowning. She takes an envelope out of the gift bag and goes back inside opening the card and taking a box from the gift bag. Inside the box is a pair of remotecontrolled vibrating briefs. Abby stands in front of the mirror applies lipstick perches on the arm of a chair sips a glass of white wine and glances at the vibrating briefs considering for a moment. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. She reaches under her white dress pulls down her briefs and as she does so D'Artagnan the cat trots past and climbs onto a chair. Abby picks up the black lacy vibrating briefs and puts them on pulls up the briefs and straightens out her dress while D'Artagnan the cat stares at her. She picks up the small cylindrical remote control unit puts her briefs and the box for the vibrating briefs behind a cushion stuffs the remote control in her handbag and opens the door. Mike and Stuart are there and she smiles bitterly. In Stuart's car executives are gathered in a restaurant and Mike puts his arms around the bikini babes as they sit around a table with the executives. Abby kicks Mike knocking over her bag and causing the remote control to fall out. A kid finds the remote control unit for the vibrating briefs on the floor and picks it up switching it on and causing Abby to squirm. Abby and Mike look under the table as the boy shakes it making Abby stiffen. Abby squirms crosses her legs and points at her feet. Mike sees the boy with the remote and she glares at him while he winks. Mike grabs the remote from the boy and Abby grabs it back. They lean on a railing glance at the rest of the group and Mike's gaze is fixed on Abby and Colin as they go. Stuart comes over and a country road lined with lush green trees dappled with sunlight is seen."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Mike is hiding in the bushes as she turns to go and Colin grabs her arm pulls her close and gives her a lingering kiss while Mike stares openmouthed. Colin smiles at Abby and they go to their apartments which are opposite each other. Abby waves a giant foam hand that she picked up at the game. as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug then runs joyfully to her apartment as Mike walks off. On the show he is wearing a gorilla suit and a video screen behind Larry and Georgia shows monkeys having sex. while Abby and Joy watch a monitor. Mike’s nephew Joe is present and the gorilla suit is mentioned. Abby jumps up and down grinning as she steps out of her apartment. On the doormat is a gift bag which Abby picks up and looks around frowning. She takes an envelope out of the gift bag and goes back inside opening the card and taking a box from the gift bag. Inside the box is a pair of remotecontrolled vibrating briefs. Abby stands in front of the mirror applies lipstick perches on the arm of a chair sips a glass of white wine and glances at the vibrating briefs considering for a moment. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. She reaches under her white dress pulls down her briefs and as she does so D'Artagnan the cat trots past and climbs onto a chair. Abby picks up the black lacy vibrating briefs and puts them on pulls up the briefs and straightens out her dress while D'Artagnan the cat stares at her. She picks up the small cylindrical remote control unit puts her briefs and the box for the vibrating briefs behind a cushion stuffs the remote control in her handbag and opens the door. Mike and Stuart are there and she smiles bitterly. In Stuart's car executives are gathered in a restaurant and Mike puts his arms around the bikini babes as they sit around a table with the executives. Abby kicks Mike knocking over her bag and causing the remote control to fall out. A kid finds the remote control unit for the vibrating briefs on the floor and picks it up switching it on and causing Abby to squirm. Abby and Mike look under the table as the boy shakes it making Abby stiffen. Abby squirms crosses her legs and points at her feet. Mike sees the boy with the remote and she glares at him while he winks. Mike grabs the remote from the boy and Abby grabs it back. They lean on a railing glance at the rest of the group and Mike's gaze is fixed on Abby and Colin as they go. Stuart comes over and a country road lined with lush green trees dappled with sunlight is seen."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Mike is hiding in the bushes as she turns to go and Colin grabs her arm pulls her close and gives her a lingering kiss while Mike stares openmouthed. Colin smiles at Abby and they go to their apartments which are opposite each other. Abby waves a giant foam hand that she picked up at the game. as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug then runs joyfully to her apartment as Mike walks off. On the show he is wearing a gorilla suit and a video screen behind Larry and Georgia shows monkeys having sex. while Abby and Joy watch a monitor. Abby and Mike look under the table as the boy shakes it making Abby stiffen. Abby squirms crosses her legs and points at her feet. Mike sees the boy with the remote and she glares at him while he winks. Mike grabs the remote from the boy and Abby grabs it back. They lean on a railing glance at the rest of the group and Mike's gaze is fixed on Abby and Colin as they go. Stuart comes over and a country road lined with lush green trees dappled with sunlight is seen."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Mike is hiding in the bushes as she turns to go and Colin grabs her arm pulls her close and gives her a lingering kiss while Mike stares openmouthed. Colin smiles at Abby and they go to their apartments which are opposite each other. Abby waves a giant foam hand that she picked up at the game. Mike grabs the remote from the boy and Abby grabs it back. They lean on a railing glance at the rest of the group and Mike's gaze is fixed on Abby and Colin as they go. Stuart comes over and a country road lined with lush green trees dappled with sunlight is seen."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Jessica is hiding in the bushes as he turns to go, and Rufus grabs his arm, pulls him close, and gives him a lingering kiss while Jessica stares, open-mouthed. Rufus smiles at Brian, and they go to their apartments, which are opposite each other. Brian waves a giant foam hand that he picked up at the game as Rufus goes into his apartment. Brian runs along the path to Jessica and gives her a hug, then runs joyfully to his apartment as Jessica walks off. On the show, she is wearing a gorilla suit, and a video screen behind Emma and Jack shows monkeys having sex while Brian and Chloe watch a monitor. Jessica’s nephew, Sam, is present, and the gorilla suit is mentioned. Brian jumps up and down, grinning, as he steps out of his apartment. On the doormat is a gift bag, which Brian picks up and looks around, frowning. He takes an envelope out of the gift bag and goes back inside, opening the card and taking a box from the gift bag. Inside the box is a pair of remote-controlled, vibrating briefs. Brian stands in front of the mirror, applies lipstick, perches on the arm of a chair, sips a glass of white wine, and glances at the vibrating briefs, considering for a moment. He reaches under his white dress, pulls down his briefs, and as he does so, Toulouse the parrot trots past and climbs onto a chair. Brian picks up the black, lacy vibrating briefs and puts them on, pulls up the briefs, and straightens out his dress while Toulouse the parrot stares at him. He picks up the small, cylindrical remote control unit, puts his briefs and the box for the vibrating briefs behind a cushion, stuffs the remote control in his handbag, and opens the door. Jessica and Marcus are there, and he smiles bitterly. In Marcus's car, executives are gathered in a restaurant, and Jessica puts her arms around the bikini babes as they sit around a table with the executives. Brian kicks Jessica, knocking over his bag and causing the remote control to fall out. A kid finds the remote control unit for the vibrating briefs on the floor and picks it up, switching it on and causing Brian to squirm. Brian and Jessica look under the table as the boy shakes it, making Brian stiffen. Brian squirms, crosses his legs, and points at his feet. Jessica sees the boy with the remote and he glares at her while she winks. Jessica grabs the remote from the boy, and Brian grabs it back. They lean on a railing, glance at the rest of the group, and Jessica's gaze is fixed on Brian and Rufus as they go. Marcus comes over, and a country road lined with lush, green trees, dappled with sunlight, is seen."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Mike is hiding behind the curtains as she turns to go, and Colin grabs her sleeve, pulls her close, and gives her a lingering kiss while Mike stares, open-mouthed. Colin smiles at Abby, and they go to their offices, which are opposite each other. Abby waves a giant inflatable banana that she picked up at the concert as Colin goes into his office. Abby runs along the aisle to Mike and gives him a hug, then runs joyfully to her office as Mike walks off. On the show, he is wearing a clown costume, and a digital billboard behind Larry and Georgia shows penguins dancing while Abby and Joy watch a screen. Mike’s nephew, Joe, is present, and the clown costume is mentioned. Abby jumps up and down, grinning, as she steps out of her office. On the mat is a lunchbox, which Abby picks up and looks around, frowning. She takes a postcard out of the lunchbox and goes back inside, opening the card and taking a jar from the lunchbox. Inside the jar is a pair of remote-controlled, vibrating socks. Abby stands in front of the mirror, applies nail polish, perches on the back of a sofa, sips a cup of coffee, and glances at the vibrating socks, considering for a moment. She reaches under her red coat, pulls down her socks, and as she does so, Max the parrot flutters past and lands on a lamp. Abby picks up the purple, striped vibrating socks and puts them on, pulls up the socks, and straightens out her coat while Max the parrot gawks at her. She picks up the small, rectangular remote control unit, puts her socks and the jar for the vibrating socks behind a cushion, stuffs the remote control in her tote, and opens the door. Mike and Stuart are there, and she smiles bitterly. In Stuart's van, executives are gathered in a café, and Mike puts his arms around the roller derby players as they sit around a booth with the executives. Abby kicks Mike, knocking over her purse and causing the remote control to fall out. A kid finds the remote control unit for the vibrating socks on the floor and picks it up, switching it on and causing Abby to squirm. Abby and Mike look under the bench as the boy shakes it, making Abby stiffen. Abby squirms, crosses her legs, and points at her feet. Mike sees the boy with the remote and she glares at him while he winks. Mike grabs the remote from the boy, and Abby grabs it back. They lean on a fence, glance at the rest of the group, and Mike's gaze is fixed on Abby and Colin as they go. Stuart comes over, and a suburban street lined with colorful, blooming flowers, dappled with sunlight, is seen."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Mike is crouching in the bushes as she spins to go, and Colin taps her shoulder, nudges her gently, and gives her a quick nod while Mike gawks, slack-jawed. Colin winks at Abby, and they retreat to their apartments, which are opposite each other. Abby waves a giant foam hand that she snagged at the game as Colin rushes into his apartment. Abby jogs along the path to Mike and pats him on the back, then skips playfully to her apartment as Mike strolls off. On the show, he is sporting a gorilla suit, and a video screen behind Larry and Georgia displays monkeys playing while Abby and Joy watch a monitor. Mike’s nephew, Joe, is observing, and the gorilla suit is noted. Abby claps, beaming, as she hops out of her apartment. On the doormat is a gift bag, which Abby snatches up and looks around, puzzled. She pulls an envelope from the gift bag and steps back inside, tearing open the card and lifting a box from the gift bag. Inside the box is a pair of remote-controlled, pulsating sneakers. Abby stands in front of the mirror, combs her hair, perches on the edge of a chair, sips a cup of herbal tea, and glances at the pulsating sneakers, pondering for a moment. She reaches under her white dress, slips off her sneakers, and as she does so, D'Artagnan the cat scampers past and leaps onto a chair. Abby picks up the black, lacy pulsating sneakers and tries them on, ties the sneakers, and smooths out her dress while D'Artagnan the cat observes her. She picks up the small, cylindrical remote control unit, tucks her sneakers and the box for the pulsating sneakers behind a cushion, drops the remote control in her handbag, and opens the door. Mike and Stuart are there, and she smirks wryly. In Stuart's car, executives are assembled in a restaurant, and Mike wraps his arms around the bikini babes as they gather around a table with the executives. Abby nudges Mike, jolting her bag and causing the remote control to tumble out. A kid finds the remote control unit for the pulsating sneakers on the floor and snatches it up, flicking it on and causing Abby to jiggle. Abby and Mike peer under the table as the boy shakes it, making Abby tense. Abby squirms, folds her arms, and gestures at her shoes. Mike spots the boy with the remote and she narrows her eyes at him while he grins. Mike snatches the remote from the boy, and Abby seizes it back. They lean on a railing, survey the rest of the group, and Mike's gaze is fixed on Abby and Colin as they leave. Stuart arrives, and a country road lined with lush, green trees, bathed in sunlight, is shown."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The vacuum is hiding in the curtains as she turns to go, and the candle grabs her handle, pulls her close, and gives her a lingering kiss while the vacuum stares, open-mouthed. The candle smiles at the lampshade, and they go to their bookshelves, which are opposite each other. The lampshade waves a giant foam noodle that she picked up at the concert as the candle goes into his bookshelf. The lampshade runs along the highway to the vacuum and gives him a hug, then runs joyfully to her bookshelf as the vacuum walks off. On the painting, he is wearing a dragon costume, and a chalkboard behind the tree and the river shows parrots having brunch while the lampshade and the guitar watch a notepad. The vacuum's uncle, Ted, is present, and the dragon costume is mentioned. The lampshade jumps up and down, grinning, as she steps out of her bookshelf. On the coaster is a treasure chest, which the lampshade picks up and looks around, frowning. She takes a letter out of the treasure chest and goes back inside, opening the postcard and taking a jar from the treasure chest. Inside the jar is a pair of remote-controlled, vibrating earmuffs. The lampshade stands in front of the window, applies lipstick, perches on the arm of a sofa, sips a glass of orange juice, and glances at the vibrating earmuffs, considering for a moment. She reaches under her blue scarf, pulls down her earmuffs, and as she does so, Napoleon the antelope trots past and climbs onto a sofa. The lampshade picks up the red, lacy vibrating earmuffs and puts them on, pulls up the earmuffs, and straightens out her scarf while Napoleon the antelope stares at her. She picks up the small, cylindrical remote control unit, puts her earmuffs and the jar for the vibrating earmuffs behind a pillow, stuffs the remote control in her backpack, and opens the gate. The vacuum and the harmonica are there, and she smiles bitterly. In the harmonica's truck, scientists are gathered in a library, and the vacuum puts his arms around the bubble wands as they sit around a stage with the scientists. The lampshade kicks the vacuum, knocking over her backpack and causing the remote control to fall out. A giraffe finds the remote control unit for the vibrating earmuffs on the rug and picks it up, switching it on and causing the lampshade to squirm. The lampshade and the vacuum look under the chair as the giraffe shakes it, making the lampshade stiffen. The lampshade squirms, crosses her legs, and points at her toes. The vacuum sees the giraffe with the remote and she glares at him while he winks. The vacuum grabs the remote from the giraffe, and the lampshade grabs it back. They lean on a fence, glance at the rest of the animals, and the vacuum's gaze is fixed on the lampshade and the candle as they go. The harmonica comes over, and a stadium road lined with lush, green paintings, dappled with moonlight, is seen."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Jerry is lounging in the hammock as she decides to leave, and Raymond nudges her shoulder, draws her near, and gives her a fleeting embrace while Jerry observes, slack-jawed. Raymond chuckles at Emily, and they wander to their condos, which are adjacent to each other. Emily brandishes a giant foam finger that she found at the concert as Raymond heads into his condo. Emily dances along the trail to Jerry and gives him a high five, then skips blissfully to her condo as Jerry strolls off. On the documentary, he is donning a panda costume, and a display panel behind Greg and Samantha features birds singing while Emily and April gaze at a screen. Jerry’s cousin, Alex, is present, and the panda costume is addressed. Emily hops excitedly, smiling, as she exits her condo. On the welcome mat is a surprise package, which Emily snatches up and peers around, furrowing her brow. She retrieves a letter out of the surprise package and heads back inside, unfolding the note and extracting a case from the surprise package. Inside the case is a set of motorized, massaging socks. Emily stands in front of the window, applies eyeliner, balances on the edge of a bench, sips a mug of herbal tea, and glances at the massaging socks, contemplating briefly. She reaches under her blue blouse, pulls off her socks, and as she does so, Porthos the rabbit hops past and jumps onto a bench. Emily picks up the red, silk massaging socks and slips them on, pulls up the socks, and smooths out her blouse while Porthos the rabbit gawks at her. She grabs the tiny, rectangular control device, hides her socks and the case for the massaging socks behind a pillow, stuffs the control device in her purse, and steps outside. Jerry and Thomas are there, and she grins sardonically. In Thomas's van, directors are gathered in a cafe, and Jerry wraps his arms around the cheerleaders as they share a booth with the directors. Emily nudges Jerry, toppling her purse and making the control device tumble out. A teenager discovers the control device for the massaging socks on the ground and picks it up, activating it and causing Emily to wriggle. Emily and Jerry peer under the booth as the teen bounces it, making Emily tense. Emily wriggles, crosses her ankles, and gestures at her socks. Jerry spots the teen with the control device and she frowns at him while he smirks. Jerry snatches the control device from the teen, and Emily retrieves it. They lean against a post, glance at the rest of the contingent, and Jerry's gaze is locked on Emily and Raymond as they leave. Thomas arrives, and a seaside path lined with vibrant, blooming flowers, kissed by sunlight, is visible."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Mike is sneaking behind the hedges as she pivots to leave, and Colin taps her shoulder, draws her near, and offers her a fleeting wink while Mike gapes, wide-eyed. Colin chuckles at Abby, and they return to their cottages, which face one another. Abby waves a massive inflatable dolphin that she snagged at the carnival as Colin ducks into his cottage. Abby skips along the trail to Mike and gives him a high-five, then skips merrily to her cottage as Mike wanders away. On the broadcast, he is wearing a dinosaur costume, and a digital billboard behind Larry and Georgia displays birds singing while Abby and Joy peer at a display. Mike’s nephew, Joe, is present, and the dinosaur costume is discussed. Abby bounces on her feet, beaming, as she walks out of her cottage. On the porch mat is a paper sack, which Abby lifts and peers around, puzzled. She pulls a postcard from the paper sack and heads back inside, unsealing the note and retrieving a box from the paper sack. Nestled inside the box is a pair of wireless, buzzing earmuffs. Abby stands before the window, dabs on blush, settles on the edge of a sofa, sips a cup of chamomile tea, and gazes at the buzzing earmuffs, pondering for a moment. She reaches under her red skirt, peels off her earmuffs, and as she does so, D'Artagnan the ferret scurries past and leaps onto a sofa. Abby picks up the white, silky buzzing earmuffs and tries them on, adjusts the earmuffs, and smooths out her skirt while D'Artagnan the ferret observes her. She picks up the slim, rectangular control device, tucks her earmuffs and the box for the buzzing earmuffs behind a pillow, stuffs the control device into her backpack, and opens the window. Mike and Stuart are there, and she smirks sourly. In Stuart's vehicle, artists are gathered in a theater, and Mike extends his arms around the roller-skating girls as they lounge around a counter with the artists. Abby nudges Mike, tipping over her backpack and dislodging the control device. A toddler discovers the control device for the buzzing earmuffs on the ground and picks it up, activating it and causing Abby to jitter. Abby and Mike peer beneath the counter as the toddler rocks it, making Abby tense. Abby jitters, tucks her knees, and gestures at her hands. Mike spots the toddler with the remote device and she scolds him while he smirks. Mike snatches the remote from the toddler, and Abby snatches it back. They lean against a fence, glance at the rest of the party, and Mike's gaze lingers on Abby and Colin as they depart. Stuart approaches, and a rustic path bordered by towering, verdant oaks, sprinkled with sunbeams, appears."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Sam is sneaking in the cellar as he decides to stay, and Roger snatches his ear, yanks him sideways, and shares a brief whisper while Sam gapes, wide-eyed. Roger grins at Kelly, and they stroll to their tents, which are beside one another. Kelly waves an oversized balloon animal that she acquired at the festival as Roger steps into his tent. Kelly jogs down the trail to Sam and offers him a high-five, then dashes eagerly to her tent as Sam saunters away. On the broadcast, he is sporting a dinosaur costume, and a digital billboard beside Linda and Tom displays penguins dancing while Kelly and Hope glance at a laptop. Sam’s cousin, Max, is around, and the dinosaur costume is discussed. Kelly hops enthusiastically, beaming, as she emerges from her tent. On the welcome mat is a gift box, which Kelly retrieves and scans the area, puzzled. She pulls a letter out of the gift box and retreats inside, scanning the message and extracting a ring from the gift box. Within the box is an assortment of multicolored, light-up socks. Kelly stands in front of the wardrobe, applies mascara, perches on the backrest of a sofa, savors a cup of herbal tea, and eyes the light-up socks, pondering briefly. She reaches beneath her blue skirt, slips off her socks, and as she does so, Leonardo the rabbit skips past and hops onto a couch. Kelly picks up the red, striped light-up socks and wears them, pulls up the socks, and adjusts her skirt while Leonardo the rabbit observes her. She picks up the tiny, rectangular control device, hides her socks and the packaging for the light-up socks behind a pillow, tucks the control device in her backpack, and opens the window. Sam and Chris are there, and she smirks slyly. In Chris's truck, managers are assembled in a bistro, and Sam wraps his arms around the cheerleaders as they gather around a booth with the managers. Kelly taps Sam, tipping over her backpack and letting the control device to tumble out. A teenager finds the control device for the light-up socks on the ground and snatches it up, activating it and causing Kelly to jiggle. Kelly and Sam peer under the booth as the lad rattles it, prompting Kelly to tense. Kelly squirms, crosses her arms, and points at her lap. Sam spies the lad with the control device and she scowls at him while he grins. Sam seizes the control from the lad, and Kelly snatches it back. They lean on a bench, glance at the crowd, and Sam's attention is locked on Kelly and Roger as they wander. Chris walks over, and a sea path lined with wild, golden grass, kissed by breeze, is viewed."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Mike hides in the bushes, watching as Colin kisses Abby. They part ways, returning to their opposite apartments. Abby, with a foam hand from a game, joyfully hugs Mike before heading home. Later, dressed in a gorilla suit on a show, Mike is with his nephew Joe, while Abby and Joy watch. Abby finds a gift bag on her doormat containing remote-controlled vibrating briefs. Curious, she tries them on and conceals the remote in her handbag. When Mike and Stuart arrive, she greets them. At a restaurant, Abby accidentally drops the remote, and a child switches it on, causing her discomfort. Mike notices, retrieves the remote from the child, and Abby takes it back. They exchange glances, leaning on a railing as a country road with sunlit trees is visible."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Stuart comes over and a country road lined with lush green trees dappled with sunlight is seen They lean on a railing glance at the rest of the group and Mike's gaze is fixed on Abby and Colin as they go  Mike grabs the remote from the boy and Abby grabs it back  Mike sees the boy with the remote and she glares at him while he winks  Abby squirms crosses her legs and points at her feet  Abby and Mike look under the table as the boy shakes it making Abby stiffen  A kid finds the remote control unit for the vibrating briefs on the floor and picks it up switching it on and causing Abby to squirm  Abby kicks Mike knocking over her bag and causing the remote control to fall out  In Stuart's car executives are gathered in a restaurant and Mike puts his arms around the bikini babes as they sit around a table with the executives  Mike and Stuart are there and she smiles bitterly  She picks up the small cylindrical remote control unit puts her briefs and the box for the vibrating briefs behind a cushion stuffs the remote control in her handbag and opens the door  Abby picks up the black lacy vibrating briefs and puts them on pulls up the briefs and straightens out her dress while D'Artagnan the cat stares at her  She reaches under her white dress pulls down her briefs and as she does so D'Artagnan the cat trots past and climbs onto a chair  Abby stands in front of the mirror applies lipstick perches on the arm of a chair sips a glass of white wine and glances at the vibrating briefs considering for a moment  Inside the box is a pair of remotecontrolled vibrating briefs  She takes an envelope out of the gift bag and goes back inside opening the card and taking a box from the gift bag  On the doormat is a gift bag which Abby picks up and looks around frowning  Abby jumps up and down grinning as she steps out of her apartment  Mike’s nephew Joe is present and the gorilla suit is mentioned  while Abby and Joy watch a monitor  On the show he is wearing a gorilla suit and a video screen behind Larry and Georgia shows monkeys having sex  Abby runs along the path to Mike and gives him a hug then runs joyfully to her apartment as Mike walks off  as Colin goes into his apartment  Abby waves a giant foam hand that she picked up at the game  Colin smiles at Abby and they go to their apartments which are opposite each other  Mike is hiding in the bushes as she turns to go and Colin grabs her arm pulls her close and gives her a lingering kiss while Mike stares openmouthed "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Mike and Stuart are there and she smiles bitterly  Stuart comes over and a country road lined with lush green trees dappled with sunlight is seen Abby and Mike look under the table as the boy shakes it making Abby stiffen  In Stuart's car executives are gathered in a restaurant and Mike puts his arms around the bikini babes as they sit around a table with the executives  A kid finds the remote control unit for the vibrating briefs on the floor and picks it up switching it on and causing Abby to squirm  Inside the box is a pair of remotecontrolled vibrating briefs  She picks up the small cylindrical remote control unit puts her briefs and the box for the vibrating briefs behind a cushion stuffs the remote control in her handbag and opens the door  Colin smiles at Abby and they go to their apartments which are opposite each other  Mike’s nephew Joe is present and the gorilla suit is mentioned  Mike is hiding in the bushes as she turns to go and Colin grabs her arm pulls her close and gives her a lingering kiss while Mike stares openmouthed  Abby squirms crosses her legs and points at her feet  On the doormat is a gift bag which Abby picks up and looks around frowning  Abby picks up the black lacy vibrating briefs and puts them on pulls up the briefs and straightens out her dress while D'Artagnan the cat stares at her  They lean on a railing glance at the rest of the group and Mike's gaze is fixed on Abby and Colin as they go  On the show he is wearing a gorilla suit and a video screen behind Larry and Georgia shows monkeys having sex  Abby kicks Mike knocking over her bag and causing the remote control to fall out  Abby stands in front of the mirror applies lipstick perches on the arm of a chair sips a glass of white wine and glances at the vibrating briefs considering for a moment  Abby waves a giant foam hand that she picked up at the game  as Colin goes into his apartment  Mike grabs the remote from the boy and Abby grabs it back  while Abby and Joy watch a monitor  Abby runs along the path to Mike and gives him a hug then runs joyfully to her apartment as Mike walks off  Abby jumps up and down grinning as she steps out of her apartment  She takes an envelope out of the gift bag and goes back inside opening the card and taking a box from the gift bag  She reaches under her white dress pulls down her briefs and as she does so D'Artagnan the cat trots past and climbs onto a chair  Mike sees the boy with the remote and she glares at him while he winks "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She reaches under her white dress pulls down her briefs and as she does so D'Artagnan the cat trots past and climbs onto a chair  Abby picks up the black lacy vibrating briefs and puts them on pulls up the briefs and straightens out her dress while D'Artagnan the cat stares at her  She picks up the small cylindrical remote control unit puts her briefs and the box for the vibrating briefs behind a cushion stuffs the remote control in her handbag and opens the door  Mike and Stuart are there and she smiles bitterly  In Stuart's car executives are gathered in a restaurant and Mike puts his arms around the bikini babes as they sit around a table with the executives  Abby kicks Mike knocking over her bag and causing the remote control to fall out  A kid finds the remote control unit for the vibrating briefs on the floor and picks it up switching it on and causing Abby to squirm  Abby and Mike look under the table as the boy shakes it making Abby stiffen  Abby squirms crosses her legs and points at her feet  Mike sees the boy with the remote and she glares at him while he winks  Mike grabs the remote from the boy and Abby grabs it back  They lean on a railing glance at the rest of the group and Mike's gaze is fixed on Abby and Colin as they go  Stuart comes over and a country road lined with lush green trees dappled with sunlight is seen Mike is hiding in the bushes as she turns to go and Colin grabs her arm pulls her close and gives her a lingering kiss while Mike stares openmouthed  Colin smiles at Abby and they go to their apartments which are opposite each other  Abby waves a giant foam hand that she picked up at the game  as Colin goes into his apartment  Abby runs along the path to Mike and gives him a hug then runs joyfully to her apartment as Mike walks off  On the show he is wearing a gorilla suit and a video screen behind Larry and Georgia shows monkeys having sex  while Abby and Joy watch a monitor  Mike’s nephew Joe is present and the gorilla suit is mentioned  Abby jumps up and down grinning as she steps out of her apartment  On the doormat is a gift bag which Abby picks up and looks around frowning  She takes an envelope out of the gift bag and goes back inside opening the card and taking a box from the gift bag  Inside the box is a pair of remotecontrolled vibrating briefs  Abby stands in front of the mirror applies lipstick perches on the arm of a chair sips a glass of white wine and glances at the vibrating briefs considering for a moment "
        }
      ]
    }
  ]
}