{
  "ground_truth": "A shower with steamy glass doors obscures the view of a couple having sex. As the woman gets out, her partner follows. A title appears with an arrow pointing at the woman's face. The man then opens the door and finds an adolescent girl with a massive golden-brown curl sleeping face-down in bed. In a t-shirt and boxers, he lumbers over to the bed and lightly touches her arm. As she lies unresponsive, he barrages her with lazy slaps, and she reaches a hand out. He kisses her cheek. Later, he lies close to a little blonde girl and kisses her cheek, then carries her down the hall. The older girl makes bacon and scrambled eggs as her father brings in big, colorful balloons. He sneaks some bacon, drinks OJ from the plastic jug, and eats a cupcake. His youngest sets off a confetti shooter. In another room, the wife and mother sits at a window with a towel over her hair and smokes a cigarette with a latex-gloved hand. Meanwhile, her family hangs streamers, sets out presents, and puts candles shaped like the number 38 on a cake. Putting the cigarette out, she uncovers her hair, removes the glove, pops gum in her mouth, pats her face and hands with a wipe, and sprays herself with perfume. She then leans into the kitchen, and the youngest shoots confetti. She blows out her birthday candles. Later, the girls sit on a couch a few yards from the kitchen island where their parents relax. Sayid stabs his older companion. Their father takes a cup of berries to the sink and faces his wife, running water over the cupcake. Now in the room, the younger daughter plays a larger keyboard, while her sister throws clothes at a closet. Wearing biking gear, he kisses her goodbye then sneaks over to the kitchen sink, extracting the cupcake from a soggy bed of scrambled eggs, and unwraps the tainted treat. He glances toward the open front door, then takes a bite. A lanky man leads the woman and a plump brunette up an outdoor flight of stairs at a brisk jog, with the brunette lagging behind. A goateed man bicycles with the father, and a car darts out and nearly hits them. His wife does crunches as the plump woman bounces on a stability ball. Barb's features pinch up, and he affects a lonely, pitiful gaze in a coffeehouse where Pete gives an earnest nod. In an SUV, he sings to his wife. Her sister grabs at the tablet. In a shopping district, as Debbie approaches Jodi, Pete smiles at stunning Desi, who works on a ladder, while Jodi nods behind her large, round glasses.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A drizzle with steamy glass portals obscures the vista of a pair having intercourse. As the woman gets out, her partner follows. A caption appears with an arrow pointing at the woman's visage. The man then opens the door and finds a juvenile girl with a massive golden-brown ringlet sleeping face-down in bed. In a t-shirt and boxers, he lumbers over to the bed and lightly touches her arm. As she lies unresponsive, he barrages her with lazy swats, and she reaches a hand out. He kisses her cheek. Later, he lies close to a little blonde girl and kisses her cheek, then carries her down the corridor. The older girl makes bacon and scrambled eggs as her father brings in big, colorful balloons. He sneaks some bacon, drinks OJ from the plastic jug, and eats a cupcake. His youngest sets off a confetti shooter. In another chamber, the spouse and mother sits at a window with a towel over her hair and smokes a cigarette with a latex-gloved hand. Meanwhile, her family hangs streamers, sets out gifts, and puts candles shaped like the number 38 on a cake. Putting the cigarette out, she uncovers her hair, removes the glove, pops gum in her mouth, pats her face and hands with a wipe, and sprays herself with fragrance. She then leans into the kitchen, and the youngest shoots confetti. She blows out her birthday candles. Later, the girls sit on a couch a few yards from the kitchen island where their parents relax. Sayid stabs his older companion. Their father takes a cup of berries to the sink and faces his wife, running water over the cupcake. Now in the chamber, the younger daughter plays a larger keyboard, while her sister throws garments at a closet. Wearing biking attire, he kisses her goodbye then sneaks over to the kitchen sink, extracting the cupcake from a soggy nest of scrambled eggs, and unwraps the tainted treat. He glances toward the open front door, then takes a bite. A lanky man leads the woman and a plump brunette up an outdoor flight of stairs at a brisk jog, with the brunette lagging behind. A goateed man bicycles with the father, and a car darts out and nearly hits them. His wife does crunches as the plump woman bounces on a stability ball. Barb's features pinch up, and he affects a lonely, pitiful gaze in a coffeehouse where Pete gives an earnest nod. In an SUV, he sings to his wife. Her sister grabs at the tablet. In a shopping district, as Debbie approaches Jodi, Pete smiles at stunning Desi, who works on a ladder, while Jodi nods behind her large, round spectacles."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A shower with steamy glass doors is used to obscure the view of a couple having sex. As the woman gets out, her partner is followed by her. A title with an arrow pointing at the woman's face appears. The door is then opened by the man, and he finds an adolescent girl with a massive golden-brown curl sleeping face-down in bed. The bed is lumbered over to by him in a t-shirt and boxers, and her arm is lightly touched by him. As she lies unresponsive, lazy slaps barrage her, and a hand is reached out by her. Her cheek is kissed by him. Later, a little blonde girl is lied close to by him, and her cheek is kissed by him, then she is carried down the hall by him. Bacon and scrambled eggs are made by the older girl as big, colorful balloons are brought in by her father. Some bacon is sneaked by him, OJ is drunk from the plastic jug by him, and a cupcake is eaten by him. A confetti shooter is set off by his youngest. In another room, a window is sat at by the wife and mother with a towel over her hair, and a cigarette is smoked by her with a latex-gloved hand. Meanwhile, streamers are hung by her family, presents are set out, and candles shaped like the number 38 are put on a cake. The cigarette is put out by her, her hair is uncovered, the glove is removed, gum is popped in her mouth, her face and hands are patted with a wipe, and she sprays herself with perfume. She then leans into the kitchen, and confetti is shot by the youngest. Her birthday candles are blown out by her. Later, the girls sit on a couch a few yards from the kitchen island, where their parents relax. Sayid stabs his older companion. A cup of berries is taken by their father to the sink, and he faces his wife, running water over the cupcake. Now in the room, a larger keyboard is played by the younger daughter, while clothes are thrown at a closet by her sister. Wearing biking gear, she is kissed goodbye by him, then the kitchen sink is sneaked over to, and the cupcake is extracted from a soggy bed of scrambled eggs, after which the tainted treat is unwrapped by him. Toward the open front door, a glance is cast by him, then a bite is taken. The woman and a plump brunette are led by a lanky man up an outdoor flight of stairs at a brisk jog, lagging behind is the brunette. A goateed man bicycles with the father, and a car darts out and nearly hits them. Crunches are done by his wife as the plump woman bounces on a stability ball. Barb's features pinch up, and a lonely, pitiful gaze is affected by him in a coffeehouse where Pete gives an earnest nod. In an SUV, a song is sung to his wife by him. The tablet is grabbed at by her sister. In a shopping district, as Debbie approaches Jodi, stunning Desi is smiled at by Pete, who works on a ladder, while a nod is given by Jodi behind her large, round glasses."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Steam covers a shower's glass doors, hiding a couple having sex. The woman exits, followed by her partner. A title points to her face. The man opens a door to find a teenage girl with golden-brown curls asleep face-down. In a t-shirt and boxers, he approaches and gently touches her arm. When she doesn't respond, he lightly slaps her until she reaches out. He kisses her cheek. Later, he cuddles a blonde girl, kisses her cheek, and carries her down the hall. The older girl cooks bacon and scrambled eggs as their dad brings in balloons. He sneaks bacon, drinks orange juice from the jug, and eats a cupcake. His youngest sets off a confetti shooter. The wife sits by a window smoking with a latex-gloved hand while her family decorates with streamers, sets presents, and places \"38\" candles on a cake. She finishes her cigarette, uncovers her hair, removes the glove, chews gum, freshens up, and sprays perfume. Peeking into the kitchen, her youngest sets off confetti. She blows out her birthday candles. The daughters sit on a couch near their relaxing parents. Sayid stabs his older companion. Their dad rinses berries at the sink, looking at his wife as he wets a cupcake. The younger daughter plays a keyboard while her sister throws clothes into a closet. Wearing biking gear, he kisses his wife goodbye, sneaks to the kitchen, retrieves the cupcake from scrambled eggs, and eats it. He looks at the open door before biting it. A lanky man leads the woman and a brunette up stairs, with the brunette trailing. A goateed man bikes with the father, barely avoiding a car. His wife does crunches while the brunette bounces on a stability ball. Barb wears a pinched expression, and he looks lonely in a coffeehouse where Pete nods. In an SUV, he sings to his wife. Her sister grabs a tablet. In a shopping area, as Debbie nears Jodi, Pete smiles at Desi on a ladder, while Jodi nods behind her glasses."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A steamy shower obscures a couple having sex. The woman exits, followed by her partner. A title points to her face. The man finds a teen girl with golden-brown curls asleep in bed. Wearing a t-shirt and boxers, he touches her arm, then kisses her cheek. He later kisses a little blonde girl, carrying her down the hall. The older girl cooks bacon and eggs as their father brings balloons, sneaks bacon, drinks OJ, and eats a cupcake. The youngest sets off confetti. Nearby, the mother smokes by a window, then joins the family celebration. She blows out her 38th birthday candles. The girls sit on a couch while their parents relax. Sayid stabs his companion. Their father rinses a cupcake at the sink, then kisses his wife goodbye, sneaks back, and eats the cupcake. A lanky man leads the woman and a brunette up outdoor stairs. A goateed man bikes with the father as a car nearly hits them. His wife does crunches with the brunette on a stability ball. Barb's features pinch up, and Pete nods as he affects a lonely gaze in a coffeehouse. He sings to his wife in an SUV. In a shopping district, as Debbie approaches Jodi, Pete smiles at Desi on a ladder."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A shower with steamy, fogged-up glass doors partially obscures and blurs the view of a couple engaging in an intimate encounter. As the woman steps out of the shower, her partner follows closely behind her. Suddenly, a title appears with a conspicuous arrow pointing directly at the woman's face. Shortly thereafter, the man opens the door and discovers an adolescent girl with a massive, golden-brown curl sleeping soundly, face-down in the bed. Clad in a casual t-shirt and boxers, he lumbers over to the bed and reaches out to lightly touch her arm. As she remains unresponsive, he playfully barrages her with lazy slaps until she reaches a hand out. He gently kisses her cheek. Later, he is seen lying close to a little blonde girl, kissing her cheek, before tenderly carrying her down the hallway. Meanwhile, the older girl is busy in the kitchen, making bacon and scrambled eggs, as her father enters with a collection of big, colorful balloons. He mischievously sneaks a piece of bacon, drinks orange juice straight from the plastic jug, and helps himself to a cupcake. His youngest child sets off a playful confetti shooter. In a different room, the wife and mother sits by a window, a towel wrapped over her hair, smoking a cigarette with a latex-gloved hand. Meanwhile, her family busily adorns the room with streamers, sets out presents, and places candles shaped like the number 38 on a birthday cake. After putting out the cigarette, she uncovers her hair, removes the glove, pops gum into her mouth, pats her face and hands with a cleaning wipe, and sprays herself with perfume. She then leans into the kitchen where the youngest eagerly shoots more confetti. She blows out her birthday candles with a smile. Later, the girls sit comfortably on a couch a few yards away from the kitchen island where their parents are relaxing. Sayid unexpectedly stabs his older companion. Their father casually takes a cup of berries over to the sink and turns to face his wife, letting water run over the cupcake. In another transition, the younger daughter plays a larger keyboard, while her sister throws clothes into a closet. Now wearing biking gear, he kisses her goodbye, then sneaks over to the kitchen sink, extracting the cupcake from a soggy bed of scrambled eggs, and unwraps the now-tainted treat. He casts a glance toward the open front door before taking a bite. Elsewhere, a lanky man briskly leads the woman and a plump brunette up an outdoor flight of stairs, with the brunette lagging behind. A goateed man bicycles alongside the father, and a car suddenly darts out, narrowly missing them. His wife is seen doing crunches while the plump woman energetically bounces on a stability ball. Barb's features pinch up with tension, and he affects a lonely, pitiful gaze while in a coffeehouse, where Pete offers him an earnest nod. In an SUV, he sings to his wife, while her sister playfully grabs at the tablet. In a vibrant shopping district, as Debbie approaches Jodi, Pete smiles at the stunning Desi, who is busy working on a ladder, while Jodi gives a nod from behind her large, round glasses."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A shower with its steamy, fogged-up glass doors partially obscures and blurs the view, allowing only a misty glimpse of a couple as they engage in an intimate, private encounter behind the cloudy glass. As the woman gracefully steps out of the shower, droplets glistening on her skin, her partner follows closely behind her, maintaining the intimate connection. Suddenly, a striking title appears on the screen, accompanied by a conspicuous arrow drawing attention directly to the woman's face. Shortly thereafter, the man opens the door and discovers an adolescent girl with a massive, golden-brown curl, sleeping soundly and lying face-down on the bed. Clad in a casual t-shirt and boxers, he lumbers over to the bed and reaches out to lightly touch her arm in an attempt to rouse her. Unresponsive at first, she eventually reaches out a hand after he playfully barrages her with a series of lazy, gentle slaps. He then leans down and gently kisses her cheek. Later on, he is seen lying in close proximity to a little blonde girl, affectionately kissing her cheek before tenderly scooping her up to carry her down the hallway. Meanwhile, the older girl is busily occupied in the kitchen, skillfully preparing bacon and scrambled eggs, as her father enters with a delightful collection of big, colorful balloons in tow. He mischievously sneaks a piece of bacon, drinks some orange juice straight from the plastic jug, and helps himself to a tempting cupcake. His youngest child, full of playful energy, sets off a confetti shooter with glee. In a different room, the wife and mother sits by a window, a towel elegantly wrapped over her hair, as she smokes a cigarette while wearing a latex-gloved hand. Meanwhile, her family busily adorns the room with vibrant streamers, sets out carefully selected presents, and places candles shaped like the number 38 on a beautifully decorated birthday cake. After putting out her cigarette, she uncovers her hair, removes the glove, pops a piece of gum into her mouth, and pats her face and hands with a refreshing cleaning wipe, before spraying herself with a favorite perfume. She then leans into the kitchen where the youngest eagerly shoots more festive confetti. Smiling, she proceeds to blow out her birthday candles with genuine joy. Later, the girls sit comfortably on a couch, just a few yards away from the kitchen island where their parents are taking a moment to relax. In an unexpected turn of events, Sayid suddenly and unexpectedly stabs his older companion. Their father casually takes a cup of berries over to the sink and turns to face his wife, letting the water run over a cupcake. In another transition, we see the younger daughter immersed in playing a larger keyboard, while her sister busily throws clothes into a closet. Now adorned in biking gear, he kisses her goodbye, then slyly sneaks over to the kitchen sink, carefully extracting the cupcake from its soggy resting place amid a bed of scrambled eggs, before unwrapping the now-tainted treat. He casts a glance toward the open front door before taking a bold bite. Elsewhere, a lanky man briskly leads the woman and a plump brunette up an outdoor flight of stairs, with the brunette struggling slightly to keep up. A goateed man bicycles alongside the father, just as a car suddenly darts out, narrowly missing them, adding a touch of drama to their ride. Meanwhile, his wife is seen diligently doing crunches, as the plump woman energetically bounces on a stability ball, while Barb's features pinch up with tension. He assumes a lonely, pitiful gaze while sitting in a coffeehouse, where Pete, a friend, offers him an earnest nod of understanding. In an SUV, he sings to his wife, his voice filling the vehicle, while her sister playfully grabs at the tablet. In a vibrant shopping district, as Debbie approaches Jodi, Pete smiles at the stunning Desi, who is busily working on a ladder, while Jodi gives a knowing nod from behind her large, round glasses."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Steam envelops the glass doors of the shower, obscuring the view of a couple engaged in an intimate moment. As the shower concludes, the woman steps out, dripping with water, and her partner follows closely behind. An overlay appears, with an arrow directing attention to the woman's face. Transitioning to a bedroom scene, the man opens the door to reveal an adolescent girl, characterized by her massive golden-brown curls, peacefully sleeping face-down in her bed. Dressed casually in a t-shirt and boxers, he approaches her with a lumbering gait and gingerly extends a hand to touch her arm. Despite her unresponsiveness, he persists by delivering a series of lazy slaps until she groggily reaches out a hand. In a tender gesture, he bends down to plant a kiss on her cheek. As the day progresses, he is seen lying beside a little blonde girl, affectionately kissing her cheek before lifting her in his arms and carrying her down the hallway. In the kitchen, the older girl busies herself by making bacon and scrambled eggs as her father enters, carrying a bunch of big, colorful balloons. With a mischievous streak, he sneaks a piece of bacon, gulps orange juice straight from the plastic jug, and devours a cupcake. Meanwhile, his youngest daughter playfully sets off a confetti shooter. In a different room, the wife and mother sits by the window, her hair wrapped in a towel, leisurely smoking a cigarette with a hand gloved in latex. As her family prepares for the celebration, hanging streamers, arranging presents, and placing candles shaped like the number 38 on a cake, she extinguishes her cigarette, revealing her hair as she removes the glove. She freshens up by popping gum into her mouth, using a wipe to pat her face and hands, and spritzing herself with perfume. Leaning into the kitchen, she is greeted by a burst of confetti from the youngest. She approaches the cake with the candles lit and blows them out, marking the culmination of her birthday celebration. Subsequently, the girls sit comfortably on a couch a few yards away from the kitchen island where their parents unwind. The older daughter's fantasy plays out as Sayid appears to stab his older companion. Their father momentarily turns his attention to a cup of berries, carrying it to the sink while sharing a knowing glance with his wife, as water flows over the remnants of the cupcake. The scene shifts, showing the younger daughter playing a large keyboard, while her sister haphazardly throws clothes toward the closet. Wearing cycling gear, the father bends down to kiss her goodbye, then quietly sneaks back to the kitchen sink. There, he extracts the once-tainted cupcake from a soggy scramble of eggs, carefully peeling away the wrapper before glancing toward the open front door and taking a bold bite. Outside, a tall man leads the woman and a plump brunette up an outdoor staircase, their pace brisk, yet the brunette struggles to keep up. Elsewhere, a man with a goatee cycles alongside the father, narrowly evading a car that unexpectedly darts out. Meanwhile, his wife engages in crunches, while nearby, the plump woman bounces energetically on a stability ball. At a coffeehouse, Barb's expression constricts into a pinched look, as he adopts a lonely, pitiful gaze, receiving an earnest nod from Pete. Together in an SUV, he and his wife share a moment through song, while her sister reaches out in an attempt to grab a tablet. In a lively shopping district, as Debbie approaches Jodi, Pete's attention is captivated by the stunning Desi, who is busily working on a ladder, while Jodi offers a supportive nod from behind her large, round glasses."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A couple showers behind steamy glass doors, obscured from view, and as the woman exits, her partner follows. A title with an arrow highlights the woman's face. The man then finds an adolescent girl with massive golden-brown curls sleeping face-down in bed. Dressed in a t-shirt and boxers, he approaches, lightly touches her arm, then playfully slaps her awake. After she reaches out, he kisses her cheek. Later, he also kisses a little blonde girl before carrying her down the hall. Meanwhile, the older girl prepares bacon and scrambled eggs as their father brings in colorful balloons. He sneaks bacon, drinks orange juice straight from the jug, and indulges in a cupcake. His youngest sets off a confetti shooter. In another room, the wife sits by a window, smoking a cigarette with a gloved hand. Her family decorates with streamers and sets up gifts, including a cake with candles shaped like the number 38. She puts out the cigarette, removes the glove, refreshes herself, and sprays on perfume before joining her family. As she leans into the kitchen, confetti pops again, and she blows out her birthday candles.\n\nLater, the girls relax on a couch near the kitchen while their parents unwind at the island. Their father rinses a cup of berries at the sink before interacting with his wife. The younger daughter plays on a larger keyboard as her sister organizes clothes. Dressed in biking gear, he kisses her goodbye, sneaks to the kitchen, retrieves a cupcake from soggy eggs, and takes a bite as he glances at the open front door. A lanky man leads the woman and a plump brunette up outdoor stairs with the brunette lagging behind, while a goateed man cycles with the father until a car nearly hits them. The wife does crunches next to the plump woman bouncing on a stability ball. With pinched features, Barb projects a lonely, pitiful gaze in a coffeehouse where Pete gives an earnest nod. In an SUV, he sings to his wife, and her sister grabs at a tablet. In a shopping district, Pete smiles at stunning Desi, who works on a ladder, while Jodi nods behind her large glasses as Debbie approaches."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A shower with steamy glass doors, reminiscent of high-end spa installations designed to offer privacy and comfort, obscures the view of a couple having sex. As the woman gets out, her partner follows, moving with an intimate familiarity that suggests a long-term relationship. A title appears with an arrow pointing at the woman's face, playfully identifying her as the star of this familial scene. The man then opens the door and finds an adolescent girl with a massive golden-brown curl sleeping face-down in bed, her hair reminiscent of classical portraits that capture the innocence of youth. In a t-shirt and boxers, he lumbers over to the bed and lightly touches her arm, the gesture one of paternal affection. As she lies unresponsive, he barrages her with lazy slaps, a familiar morning routine in many households, and she reaches a hand out, acknowledging the start of the day. He kisses her cheek with the tenderness of a father. Later, he lies close to a little blonde girl and kisses her cheek, then carries her down the hall, her small size making her easy to lift and cradle. The older girl makes bacon and scrambled eggs in the kitchen, a ritual breakfast in many families, as her father brings in big, colorful balloons often used for birthday celebrations. He sneaks some bacon in the typical manner of a dad sampling breakfast, drinks orange juice directly from the plastic jug, a casual breach of etiquette common in homes, and eats a cupcake. His youngest sets off a confetti shooter, a small party popper designed to add joy to celebrations. In another room, the wife and mother sits at a window with a towel over her hair and smokes a cigarette with a latex-gloved hand, perhaps attempting to keep the smell from lingering. Meanwhile, her family hangs streamers, sets out presents, and puts candles shaped like the number 38 on a cake, marking her 38th birthday. Putting the cigarette out, she uncovers her hair, removes the glove, pops gum in her mouth to mask the smoke scent, pats her face and hands with a wipe for refreshment, and sprays herself with perfume, a routine for feeling rejuvenated. She then leans into the kitchen, and the youngest shoots confetti, adding to the festive atmosphere. She blows out her birthday candles with the joy of making a wish. Later, the girls sit on a couch a few yards from the kitchen island where their parents relax in the comfort of their home environment. Sayid stabs his older companion, a scene from a movie playing in the background. Their father takes a cup of berries to the sink and faces his wife, running water over the cupcake, a peculiar action perhaps done absentmindedly. Now in the room, the younger daughter plays a larger keyboard, an instrument for musical exploration, while her sister throws clothes at a closet in the hurried fashion of teenage tidying. Wearing biking gear designed for performance and safety, he kisses her goodbye then sneaks over to the kitchen sink, extracting the cupcake from a soggy bed of scrambled eggs, and unwraps the tainted treat, unbothered by its condition. He glances toward the open front door, checking for onlookers, then takes a bite. A lanky man, a fitness enthusiast, leads the woman and a plump brunette up an outdoor flight of stairs at a brisk jog, with the brunette lagging behind, showing the diversity of fitness levels. A goateed man bicycles with the father, sharing a camaraderie typical among weekend athletes, and a car darts out and nearly hits them, a reminder of the dangers cyclists face. His wife does crunches as the plump woman bounces on a stability ball, both engaged in their own exercise routines. Barb's features pinch up, and he affects a lonely, pitiful gaze in a coffeehouse where Pete gives an earnest nod, indicating a conversation of emotional depth. In an SUV, he sings to his wife, a gesture of affection and shared history. Her sister grabs at the tablet, a common device for entertainment or distraction. In a shopping district, bustling with activity and commerce, as Debbie approaches Jodi, Pete smiles at stunning Desi, who works on a ladder, her presence enhancing the lively scene, while Jodi nods behind her large, round glasses, observing the friendliness around her."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "A shower with steamy glass doors obscures the view of a couple having sex. As the woman gets out her partner follows. A title appears with an arrow pointing at the woman's face. The man then opens the door and finds an adolescent girl with a massive goldenbrown curl sleeping facedown in bed. In a tshirt and boxers he lumbers over to the bed and lightly touches her arm. As she lies unresponsive he barrages her with lazy slaps and she reaches a hand out. He kisses her cheek. Later he lies close to a little blonde girl and kisses her cheek then carries her down the hall. The older girl makes bacon and scrambled eggs as her father brings in big colorful balloons. He sneaks some bacon drinks OJ from the plastic jug and eats a cupcake. His youngest sets off a confetti shooter. In another room the wife and mother sits at a window with a towel over her hair and smokes a cigarette with a latexgloved hand. Meanwhile her family hangs streamers sets out presents and puts candles shaped like the number 38 on a cake. Putting the cigarette out she uncovers her hair removes the glove pops gum in her mouth pats her face and hands with a wipe and sprays herself with perfume. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. She then leans into the kitchen and the youngest shoots confetti. She blows out her birthday candles. Later the girls sit on a couch a few yards from the kitchen island where their parents relax. Sayid stabs his older companion. Their father takes a cup of berries to the sink and faces his wife running water over the cupcake. Now in the room the younger daughter plays a larger keyboard while her sister throws clothes at a closet. Wearing biking gear he kisses her goodbye then sneaks over to the kitchen sink extracting the cupcake from a soggy bed of scrambled eggs and unwraps the tainted treat. He glances toward the open front door then takes a bite. A lanky man leads the woman and a plump brunette up an outdoor flight of stairs at a brisk jog with the brunette lagging behind. A goateed man bicycles with the father and a car darts out and nearly hits them. His wife does crunches as the plump woman bounces on a stability ball. Barb's features pinch up and he affects a lonely pitiful gaze in a coffeehouse where Pete gives an earnest nod. In an SUV he sings to his wife. Her sister grabs at the tablet. In a shopping district as Debbie approaches Jodi Pete smiles at stunning Desi who works on a ladder while Jodi nods behind her large round glasses."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "A shower with steamy glass doors obscures the view of a couple having sex. As the woman gets out her partner follows. A title appears with an arrow pointing at the woman's face. The man then opens the door and finds an adolescent girl with a massive goldenbrown curl sleeping facedown in bed. In a tshirt and boxers he lumbers over to the bed and lightly touches her arm. As she lies unresponsive he barrages her with lazy slaps and she reaches a hand out. He kisses her cheek. Later he lies close to a little blonde girl and kisses her cheek then carries her down the hall. The older girl makes bacon and scrambled eggs as her father brings in big colorful balloons. He sneaks some bacon drinks OJ from the plastic jug and eats a cupcake. His youngest sets off a confetti shooter. In another room the wife and mother sits at a window with a towel over her hair and smokes a cigarette with a latexgloved hand. Meanwhile her family hangs streamers sets out presents and puts candles shaped like the number 38 on a cake. Putting the cigarette out she uncovers her hair removes the glove pops gum in her mouth pats her face and hands with a wipe and sprays herself with perfume. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. She then leans into the kitchen and the youngest shoots confetti. She blows out her birthday candles. Later the girls sit on a couch a few yards from the kitchen island where their parents relax. Sayid stabs his older companion. Their father takes a cup of berries to the sink and faces his wife running water over the cupcake. Now in the room the younger daughter plays a larger keyboard while her sister throws clothes at a closet. Wearing biking gear he kisses her goodbye then sneaks over to the kitchen sink extracting the cupcake from a soggy bed of scrambled eggs and unwraps the tainted treat. He glances toward the open front door then takes a bite. A lanky man leads the woman and a plump brunette up an outdoor flight of stairs at a brisk jog with the brunette lagging behind. A goateed man bicycles with the father and a car darts out and nearly hits them. His wife does crunches as the plump woman bounces on a stability ball. Barb's features pinch up and he affects a lonely pitiful gaze in a coffeehouse where Pete gives an earnest nod. In an SUV he sings to his wife. Her sister grabs at the tablet. In a shopping district as Debbie approaches Jodi Pete smiles at stunning Desi who works on a ladder while Jodi nods behind her large round glasses."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "A shower with steamy glass doors obscures the view of a couple having sex. As the woman gets out her partner follows. A title appears with an arrow pointing at the woman's face. The man then opens the door and finds an adolescent girl with a massive goldenbrown curl sleeping facedown in bed. In a tshirt and boxers he lumbers over to the bed and lightly touches her arm. As she lies unresponsive he barrages her with lazy slaps and she reaches a hand out. He kisses her cheek. He glances toward the open front door then takes a bite. A lanky man leads the woman and a plump brunette up an outdoor flight of stairs at a brisk jog with the brunette lagging behind. A goateed man bicycles with the father and a car darts out and nearly hits them. His wife does crunches as the plump woman bounces on a stability ball. Barb's features pinch up and he affects a lonely pitiful gaze in a coffeehouse where Pete gives an earnest nod. In an SUV he sings to his wife. Her sister grabs at the tablet. In a shopping district as Debbie approaches Jodi Pete smiles at stunning Desi who works on a ladder while Jodi nods behind her large round glasses."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "A shower with steamy glass doors obscures the view of a couple having sex. As the woman gets out her partner follows. A title appears with an arrow pointing at the woman's face. In an SUV he sings to his wife. Her sister grabs at the tablet. In a shopping district as Debbie approaches Jodi Pete smiles at stunning Desi who works on a ladder while Jodi nods behind her large round glasses."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "A wardrobe with foggy wooden panels conceals the vision of a trio juggling oranges. As the cat leaps in, its companion bounds behind. A cartoon materializes with a comet aiming at the cat's nose. The parrot then flings open the drawer and discovers a giant ant with a tiny silver-blue antennae lounging feet-up in a hammock. In a hoodie and slippers, it waddles toward the hammock and gently kicks the ant's toe. As it snoozes unflinching, the parrot pelts it with soft pillows, and it wiggles a leg out. The parrot pecks its antenna. Later, it dozes beside a small gray mouse and pecks its antenna, then rolls it down the corridor. The giant ant creates toast and fried potatoes as its brother carries in small, gray pebbles. It nabs a toast slice, sips milk from the metal cup, and munches on a carrot. Its eldest triggers a bubble blower. In another chamber, the dragon and cousin peep through a screen with a hat over its nose and inhales a banana with a velvet-gloved claw. Meanwhile, its gang hangs curtains, places glasses, and sets flowers shaped like the letter Z on a pie. Snuffing the banana out, it uncovers its nose, removes the claw, pops candy in its beak, rubs its nose and claws with a cloth, and spritzes itself with cologne. It then peers into the den, and the eldest pops bubbles. It eats its birthday flowers. Later, the ants recline on a bench a few meters from the pantry corner where their cousins snooze. Alex flings his younger partner. Their brother brings a pot of noodles to the faucet and turns to his dragon, pouring air over the carrot. Now in the chamber, the tinier ant plays a grand organ, while its partner flings dishes at a drawer. Wearing hiking boots, it pecks its farewell then shuffles over to the pantry faucet, retrieving the carrot from a damp nest of fried potatoes, and unwraps the spoiled snack. It spies toward the ajar back gate, then takes a chomp. A stout elephant guides the dragon and a skinny zebra down an indoor flight of slides at a lazy stroll, with the zebra trailing ahead. A bearded snake skis with the brother, and a truck shoots by and almost licks them. Its dragon performs shrugs as the skinny elephant jigs on an exercise mat. Tim’s ears stretch wide, and it mimics a cheerful, cheerful smile in a bakery where Sam gives a somber shake. In a boat, it whispers to its dragon. Its partner snatches at the frisbee. In a leisure park, as Charlie strides toward Max, Sam sneers at drab Kelly, who dances on a trampoline, while Max shakes over her tiny, square monocle."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The video opens with a steamy shower scene obscuring a couple, followed by a man approaching a sleeping adolescent girl with golden curls. He gently wakes her before turning to his youngest daughter, showing affection before heading to the kitchen. The family prepares for the mother's 38th birthday, setting up decorations and a cake. Meanwhile, the mother smokes, then readies herself to join the celebration. The daughters relax on the couch as the father playfully retrieves a cupcake from the sink, eating it sneakily before leaving. The scene shifts to various activities: the father biking with a friend and narrowly avoiding a car, the mother exercising with a friend, and the father sharing a moment with Pete in a coffeehouse. The family then shares moments in an SUV and shopping district, highlighting interactions with friends and acquaintances."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "In a shopping district as Debbie approaches Jodi Pete smiles at stunning Desi who works on a ladder while Jodi nods behind her large round glasses Her sister grabs at the tablet In an SUV he sings to his wife Barb's features pinch up and he affects a lonely pitiful gaze in a coffeehouse where Pete gives an earnest nod His wife does crunches as the plump woman bounces on a stability ball A goateed man bicycles with the father and a car darts out and nearly hits them A lanky man leads the woman and a plump brunette up an outdoor flight of stairs at a brisk jog with the brunette lagging behind He glances toward the open front door then takes a bite Wearing biking gear he kisses her goodbye then sneaks over to the kitchen sink extracting the cupcake from a soggy bed of scrambled eggs and unwraps the tainted treat Now in the room the younger daughter plays a larger keyboard while her sister throws clothes at a closet Their father takes a cup of berries to the sink and faces his wife running water over the cupcake Sayid stabs his older companion Later the girls sit on a couch a few yards from the kitchen island where their parents relax She blows out her birthday candles She then leans into the kitchen and the youngest shoots confetti Putting the cigarette out she uncovers her hair removes the glove pops gum in her mouth pats her face and hands with a wipe and sprays herself with perfume Meanwhile her family hangs streamers sets out presents and puts candles shaped like the number 38 on a cake In another room the wife and mother sits at a window with a towel over her hair and smokes a cigarette with a latexgloved hand His youngest sets off a confetti shooter He sneaks some bacon drinks OJ from the plastic jug and eats a cupcake The older girl makes bacon and scrambled eggs as her father brings in big colorful balloons Later he lies close to a little blonde girl and kisses her cheek then carries her down the hall He kisses her cheek As she lies unresponsive he barrages her with lazy slaps and she reaches a hand out In a tshirt and boxers he lumbers over to the bed and lightly touches her arm The man then opens the door and finds an adolescent girl with a massive goldenbrown curl sleeping facedown in bed A title appears with an arrow pointing at the woman's face As the woman gets out her partner follows A shower with steamy glass doors obscures the view of a couple having sex"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "As the woman gets out her partner follows A shower with steamy glass doors obscures the view of a couple having sex The man then opens the door and finds an adolescent girl with a massive goldenbrown curl sleeping facedown in bed A title appears with an arrow pointing at the woman's face As she lies unresponsive he barrages her with lazy slaps and she reaches a hand out In a tshirt and boxers he lumbers over to the bed and lightly touches her arm Later he lies close to a little blonde girl and kisses her cheek then carries her down the hall He kisses her cheek He sneaks some bacon drinks OJ from the plastic jug and eats a cupcake The older girl makes bacon and scrambled eggs as her father brings in big colorful balloons In another room the wife and mother sits at a window with a towel over her hair and smokes a cigarette with a latexgloved hand His youngest sets off a confetti shooter Putting the cigarette out she uncovers her hair removes the glove pops gum in her mouth pats her face and hands with a wipe and sprays herself with perfume Meanwhile her family hangs streamers sets out presents and puts candles shaped like the number 38 on a cake She blows out her birthday candles She then leans into the kitchen and the youngest shoots confetti Sayid stabs his older companion Later the girls sit on a couch a few yards from the kitchen island where their parents relax Now in the room the younger daughter plays a larger keyboard while her sister throws clothes at a closet Their father takes a cup of berries to the sink and faces his wife running water over the cupcake He glances toward the open front door then takes a bite Wearing biking gear he kisses her goodbye then sneaks over to the kitchen sink extracting the cupcake from a soggy bed of scrambled eggs and unwraps the tainted treat A goateed man bicycles with the father and a car darts out and nearly hits them A lanky man leads the woman and a plump brunette up an outdoor flight of stairs at a brisk jog with the brunette lagging behind Barb's features pinch up and he affects a lonely pitiful gaze in a coffeehouse where Pete gives an earnest nod His wife does crunches as the plump woman bounces on a stability ball Her sister grabs at the tablet In an SUV he sings to his wife In a shopping district as Debbie approaches Jodi Pete smiles at stunning Desi who works on a ladder while Jodi nods behind her large round glasses"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She blows out her birthday candles Later the girls sit on a couch a few yards from the kitchen island where their parents relax Sayid stabs his older companion Their father takes a cup of berries to the sink and faces his wife running water over the cupcake Now in the room the younger daughter plays a larger keyboard while her sister throws clothes at a closet Wearing biking gear he kisses her goodbye then sneaks over to the kitchen sink extracting the cupcake from a soggy bed of scrambled eggs and unwraps the tainted treat He glances toward the open front door then takes a bite A lanky man leads the woman and a plump brunette up an outdoor flight of stairs at a brisk jog with the brunette lagging behind A goateed man bicycles with the father and a car darts out and nearly hits them His wife does crunches as the plump woman bounces on a stability ball Barb's features pinch up and he affects a lonely pitiful gaze in a coffeehouse where Pete gives an earnest nod In an SUV he sings to his wife Her sister grabs at the tablet In a shopping district as Debbie approaches Jodi Pete smiles at stunning Desi who works on a ladder while Jodi nods behind her large round glasses A shower with steamy glass doors obscures the view of a couple having sex As the woman gets out her partner follows A title appears with an arrow pointing at the woman's face The man then opens the door and finds an adolescent girl with a massive goldenbrown curl sleeping facedown in bed In a tshirt and boxers he lumbers over to the bed and lightly touches her arm As she lies unresponsive he barrages her with lazy slaps and she reaches a hand out He kisses her cheek Later he lies close to a little blonde girl and kisses her cheek then carries her down the hall The older girl makes bacon and scrambled eggs as her father brings in big colorful balloons He sneaks some bacon drinks OJ from the plastic jug and eats a cupcake His youngest sets off a confetti shooter In another room the wife and mother sits at a window with a towel over her hair and smokes a cigarette with a latexgloved hand Meanwhile her family hangs streamers sets out presents and puts candles shaped like the number 38 on a cake Putting the cigarette out she uncovers her hair removes the glove pops gum in her mouth pats her face and hands with a wipe and sprays herself with perfume She then leans into the kitchen and the youngest shoots confetti"
        }
      ]
    }
  ]
}