{
  "ground_truth": "Sadie lies at the foot of the bed and turns around as Charlotte touches her with slobbery fingers. Sadie hops out of bed and storms off down the hall, and Charlotte sits up to face her dad. Charlotte then jumps off the bed and scurries away, leaving a wide gap between her parents, while Debbie glances at Pete, yanks the bedspread toward her, and faces the TV as they both stare forward. Charlotte sits at her desk writing a note in red marker and hangs it on Sadie's door. Meanwhile, Pete wears headphones at his desk, while Sadie watches something on her tablet. Debbie now lies with Charlotte in her bed and leans over to kiss Charlotte on the lips. In the morning, Pete awakens on the couch in an awkward position, props himself up, and grips his shoulder. Pete then sips coffee at the island with his back to the table as his family eats breakfast, glancing back before eyeing his mug. He drives the kids to school, sloppily eats an egg sandwich, and sings, while Sadie eyes her father and looks away as Charlotte's eyes widen. At school, Charlotte puts on headphones as Pete walks her to class; they pass a gray-haired pregnant woman, and Pete stops to kiss his daughter on the head before starting to leave. A fat woman approaches with Joseph, who stands a dozen feet away and pokes her several times. In a coffee shop, Debbie sits with Jodi, grabs her phone, and Jodi narrows her eyes. In a school office, Debbie nods as Jill glares, Debbie shrugs, and Pete nods slowly. They exit the school with mischievous grins, each glancing at the other, avoiding eye contact, and enter the parking lot where Debbie heads to her silver SUV and Pete strolls to his blue Sedan, pulling keys from his pocket and briefly glancing toward her. They enter separate vehicles simultaneously. Later, at home, Pete and Charlotte sit at the table as Debbie serves chicken and looks at Pete, while Sadie storms away. Debbie then sits down, resting her head on her hand. In her room, Sadie does homework on her bed, as Charlotte's door slides open across their shared bathroom, and Charlotte emerges with an armful of things. She places Sadie's computer, phone, and tablet on Sadie's bed, and leaves as Sadie grabs her phone, smiles, and looks toward her younger sister as the door slides shut. Downstairs, Debbie sits on the couch while Pete paces, moves close, and they embrace. Finally, a main character, Jack, lies on the ground dying as a plane flies overhead.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sadie reclines at the base of the cot and rotates around as Charlotte touches her with slobbery digits. Sadie leaps out of bed and marches off down the corridor, and Charlotte sits up to face her father. Charlotte then jumps off the bed and scampers away, leaving a broad chasm between her parents, while Debbie gazes at Pete, yanks the duvet toward her, and faces the TV as they both stare forward. Charlotte sits at her desk composing a message in crimson marker and hangs it on Sadie's portal. Meanwhile, Pete wears headphones at his desk, while Sadie observes something on her tablet. Debbie now reclines with Charlotte in her bed and leans over to kiss Charlotte on the lips. In the morning, Pete awakens on the couch in an awkward position, props himself up, and grips his shoulder. Pete then sips coffee at the island with his back to the table as his family eats breakfast, glancing back before eyeing his mug. He drives the offspring to school, sloppily eats an egg sandwich, and sings, while Sadie eyes her father and looks away as Charlotte's eyes widen. At school, Charlotte dons headphones as Pete escorts her to class; they pass a gray-haired expectant woman, and Pete stops to kiss his daughter on the head before commencing to leave. A corpulent woman approaches with Joseph, who stands a dozen feet away and pokes her several times. In a coffee shop, Debbie sits with Jodi, seizes her phone, and Jodi narrows her eyes. In a school office, Debbie nods as Jill glares, Debbie shrugs, and Pete nods slowly. They exit the school with mischievous grins, each glancing at the other, avoiding eye contact, and enter the parking area where Debbie heads to her silver SUV and Pete strolls to his blue Sedan, pulling keys from his pocket and briefly glancing toward her. They enter separate vehicles simultaneously. Later, at home, Pete and Charlotte sit at the table as Debbie serves poultry and looks at Pete, while Sadie marches away. Debbie then sits down, resting her head on her hand. In her room, Sadie does homework on her bed, as Charlotte's door slides open across their shared lavatory, and Charlotte emerges with an armful of items. She places Sadie's computer, phone, and tablet on Sadie's bed, and leaves as Sadie seizes her phone, smiles, and looks toward her junior sister as the door slides shut. Downstairs, Debbie sits on the couch while Pete paces, moves close, and they embrace. Finally, a main character, Jack, lies on the ground dying as an aircraft flies overhead."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Sadie is lied at the foot of the bed by slobby fingers, and she is turned around by Charlotte's touch. The bed is hopped out of by Sadie, and the hall is stormed off down by her, while her dad is faced by Charlotte as she sits up. The bed is then jumped off by Charlotte, and a wide gap is left between her parents as she scurries away, while Pete is glanced at by Debbie, who yanks the bedspread toward herself and faces the TV as forward is stared by both of them. A note is written in red marker by Charlotte at her desk and is hung by her on Sadie's door. Meanwhile, headphones are worn by Pete at his desk, while something is watched by Sadie on her tablet. Charlotte is now lied with by Debbie, who leans over to kiss her on the lips. In the morning, the couch in an awkward position is awakened on by Pete, he props himself up, and his shoulder is gripped. Coffee is sipped by Pete at the island with his back to the table as his family eats breakfast, he glances back before his mug is eyed. The kids are driven to school by him, an egg sandwich is sloppily eaten, and singing occurs, while her father is eyed by Sadie and she looks away as Charlotte's eyes widen. At school, headphones are put on by Charlotte as she is walked to class by Pete; a gray-haired pregnant woman is passed by them, and his daughter is kissed by Pete on the head before leaving is started by him. A fat woman, with Joseph, who stands a dozen feet away and pokes her several times, approaches. In a coffee shop, her phone is grabbed by Debbie as she sits with Jodi, and Jodi narrows her eyes. In a school office, Jill glares as nods are made by Debbie, Debbie shrugs, and Pete makes a slow nod. Mischievous grins are worn by them as they exit the school, each glancing at the other, avoiding eye contact, and the parking lot is entered where a silver SUV is headed toward by Debbie and a blue Sedan is strolled to by Pete, keys are pulled from his pocket and a glance is briefly made toward her. Separate vehicles are entered by them simultaneously. Later, at home, the table is sat at by Pete and Charlotte as chicken is served by Debbie and Pete is looked at by her, while away is stormed off by Sadie. Debbie then sits down, and her head is rested on her hand. In her room, homework is done by Sadie on her bed, as Charlotte's door slides open across their shared bathroom, and an armful of things is emerged with by Charlotte. Sadie's computer, phone, and tablet are placed on her bed by her, and her phone is grabbed by Sadie, a smile is made, and toward her younger sister is looked as the door is slid shut. Downstairs, the couch is sat on by Debbie while pacing is done by Pete, he moves close, and an embrace is made. Finally, Jack, the main character, is lied on the ground dying by him as a plane is flown overhead."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Sadie lies at the foot of the bed but turns when Charlotte touches her with slobbery fingers. Sadie jumps off and leaves, while Charlotte sits up and then scurries away, leaving a gap between her parents. Debbie glances at Pete, pulls the bedspread, and faces the TV. Charlotte writes a note in red marker and hangs it on Sadie's door. Pete wears headphones at his desk as Sadie watches something on her tablet. Debbie lies with Charlotte in her bed, kissing her. In the morning, Pete wakes on the couch, props himself up, and grips his shoulder. He drinks coffee as his family eats breakfast, then drives the kids to school, eating an egg sandwich and singing. Sadie eyes her father as Charlotte's eyes widen. At school, Charlotte dons headphones as Pete walks her to class. They pass a gray-haired pregnant woman, and Pete kisses Charlotte's head. A woman approaches with Joseph, who pokes her. In a coffee shop, Debbie sits with Jodi and grabs her phone as Jodi narrows her eyes. In a school office, Debbie nods while Jill glares, she shrugs, and Pete nods slowly. They leave the school with mischievous grins, avoiding eye contact. Debbie heads to her silver SUV, and Pete strolls to his blue Sedan. They enter separate vehicles simultaneously. At home, Pete and Charlotte are at the table as Debbie serves chicken, while Sadie storms away. Debbie sits, resting her head. Sadie does homework as Charlotte slides open the bathroom door and brings Sadie's things, placing them on her bed. Sadie grabs her phone, smiles, and looks at Charlotte. Downstairs, Debbie and Pete embrace. Finally, Jack lies dying as a plane flies overhead."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Sadie lies at the bed's foot but turns away when Charlotte touches her. Sadie leaves, while Charlotte faces her dad, then scurries away. Debbie faces the TV after pulling the bedspread. Charlotte writes a note in red marker for Sadie. Pete, wearing headphones, is at his desk, while Sadie uses her tablet. Debbie kisses Charlotte goodnight. In the morning, Pete wakes on the couch and has coffee at the island, observing his family having breakfast before taking the kids to school. He eats and sings while driving, with Sadie looking away and Charlotte surprised. At school, Charlotte wears headphones, and Pete kisses her head before leaving. A woman with Joseph approaches. At a coffee shop, Debbie and Jodi exchange looks. At the school office, Debbie and Pete exchange nods and leave, heading to separate cars. At home, they sit as Debbie serves chicken; Sadie storms off. Sadie does homework as Charlotte returns her electronics, prompting Sadie to smile. Downstairs, Debbie and Pete embrace. Finally, Jack lies dying as a plane flies overhead."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Sadie is comfortably situated at the foot of the bed, and she turns around quickly as Charlotte reaches over and touches her with small, slobbery fingers. In reaction, Sadie immediately hops out of the bed with purpose and storms off down the hallway. Meanwhile, Charlotte sits up and turns to face her father. Without hesitation, Charlotte jumps down from the bed and quickly scurries away, creating a wide and empty space between her parents. Meanwhile, Debbie, who is seated nearby, glances at Pete, tugs the bedspread towards herself, and focuses on the television as they both stare blankly forward. Later, Charlotte is settled at her desk, carefully writing a note in bold red marker and then making the decision to hang it on Sadie's door. At the same time, Pete is at his own desk, wearing headphones, while Sadie is engrossed in watching something on her tablet. In a tender moment, Debbie finds herself lying with Charlotte in her bed and leans over to give Charlotte a kiss on the lips.\n\nThe next morning arrives, and we find Pete waking up on the couch in an uncomfortable position. He props himself up, feeling the strain, and grips his shoulder. He then finds himself sipping coffee at the kitchen island, with his back turned to the table as his family sits down to eat breakfast. He takes a glance behind him before turning his attention back to his mug. Eventually, he drives the kids to school, messily eating an egg sandwich in the process, and begins to sing. Sadie looks at her father and then averts her gaze as Charlotte's eyes widen with surprise. Once at school, Charlotte puts on her headphones as Pete walks her to her classroom. They happen to pass by a pregnant woman with gray hair, and Pete takes a moment to stop and kiss his daughter on the head before beginning to leave. A larger woman approaches the scene alongside Joseph, who stands a dozen feet away, repeatedly poking her.\n\nIn a different setting, Debbie is in a coffee shop sitting with her friend Jodi. She reaches out to grab her phone as Jodi narrows her eyes suspiciously. Inside the school office, Debbie nods in agreement while Jill glares at her. Debbie, in response, casually shrugs, and Pete slowly nods in understanding. They exit the school, sporting mischievous grins, each slyly glancing at the other yet avoiding direct eye contact. As they move toward the parking lot, Debbie heads towards her silver SUV and Pete strolls to his blue Sedan, pulling out his keys from his pocket, giving a brief glance in her direction. They each enter their respective vehicles at the same time. Later that day, at home, Pete and Charlotte sit together at the table as Debbie serves them chicken and glances over at Pete, all the while Sadie storms away in frustration. Debbie then takes her seat, resting her head on her hand in contemplation.\n\nIn Sadie's room, she is diligently doing her homework on the bed when Charlotte's door slides open across their shared bathroom. Charlotte emerges, her arms full of various things, and she places Sadie's computer, phone, and tablet on the bed before leaving. Sadie, upon noticing, grabs her phone, smiles warmly, and looks toward her younger sister as the door smoothly slides shut. Downstairs, Debbie is seated on the couch while Pete paces restlessly. He moves closer, and they embrace in a heartfelt moment. In the final scene, a central character named Jack is shown lying on the ground, succumbing to his wounds as a plane flies overhead in the vast sky."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Sadie finds herself comfortably situated right at the foot of the bed, and she quickly spins around when Charlotte, with her small, slobbery fingers, reaches over and touches her. In response, Sadie immediately hops out of the bed with purposeful determination and storms right off, making her way down the hallway. Meanwhile, Charlotte, sitting up, turns and directs her attention to face her father. Without any hesitation, Charlotte jumps down from the bed and quickly scurries away, creating a wide and empty space between her parents. Meanwhile, Debbie, who is seated nearby, glances over at Pete, tugs on the bedspread towards herself, and focuses on the television, as they both stare blankly forward. Later on, Charlotte is seated at her desk, carefully writing a note in bold red marker, and then makes the decision to hang it on Sadie's door. At the same time, Pete is at his own desk, wearing headphones, while Sadie is deeply engrossed in watching something on her tablet. In a tender moment, Debbie finds herself lying there with Charlotte in her bed, leaning over to give Charlotte a gentle kiss on the lips.\n\nAs the next morning arrives, we find Pete waking up on the couch, in what seems to be a very uncomfortable position. He props himself up, feeling the strain, and grips his shoulder to ease the discomfort. He then makes his way to the kitchen and finds himself sipping coffee at the kitchen island, his back turned to the table as his family sits down to eat breakfast. He takes a moment to glance over his shoulder before turning his attention back to focus on his mug. Eventually, he drives the kids to school while messily eating an egg sandwich in the process, and begins to sing. Sadie looks at her father and then quickly averts her gaze, while Charlotte's eyes widen with a hint of surprise. Once they arrive at school, Charlotte puts on her headphones as Pete accompanies her to her classroom. As they walk, they happen to pass by a pregnant woman with gray hair, and Pete pauses for a moment to stop and kiss his daughter on the head before starting to leave. A larger woman approaches the scene alongside Joseph, who stands a dozen feet away, repeatedly poking her.\n\nIn a different setting altogether, Debbie is found in a cozy coffee shop, sitting with her friend Jodi. She reaches out to grab her phone as Jodi narrows her eyes with suspicion. Inside the school office, Debbie nods in agreement while Jill glares at her. Debbie, in response, casually shrugs, and Pete slowly nods in understanding. They exit the school, sporting mischievous grins on their faces, each slyly glancing at the other yet deliberately avoiding direct eye contact. As they move toward the parking lot, Debbie makes her way towards her silver SUV and Pete strolls leisurely to his blue Sedan, pulling out his keys from his pocket, and gives a brief glance in her direction. They each enter their respective vehicles at the same time. Later that day, back at home, Pete and Charlotte sit together at the table as Debbie serves them chicken and glances over at Pete, all the while Sadie storms away in visible frustration. Debbie then takes her seat, resting her head on her hand in quiet contemplation.\n\nIn Sadie's room, she is diligently doing her homework on the bed when Charlotte's door slides open across their shared bathroom. Charlotte emerges with her arms full of various items, placing Sadie's computer, phone, and tablet on the bed before turning to leave. Sadie, upon noticing this act, grabs her phone, smiles warmly, and looks toward her younger sister as the door smoothly slides shut. Downstairs, Debbie is seated on the couch while Pete paces restlessly back and forth. He moves closer to her, and they embrace in a heartfelt and tender moment. In the final scene, a central character named Jack is shown lying on the ground, succumbing to his wounds, as a plane flies overhead across the vast and open sky."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Sadie is initially lying at the foot of the bed when she feels Charlotte's slobbery fingers touch her, causing her to turn around quickly in response to the contact. Feeling uncomfortable, Sadie hops out of the bed in one swift motion, her feet hitting the floor with a soft thump, and storms off down the hallway, each step heavy with her displeasure. Observing Sadie's departure, Charlotte sits up straight to face her dad, exchanging a moment of silent communication. Suddenly filled with energy, Charlotte bounces off the bed, landing lightly on the floor before scurrying away quickly, leaving behind a wide gap on the bed between her parents. Debbie and Pete, lying there, take in the scene as Debbie glances at Pete before yanking the bedspread toward her, and then both of them shift their attention to the TV, their eyes forward in unison as they watch. Meanwhile, Charlotte makes her way to her desk where she carefully picks up a red marker to write a note. She then walks to Sadie's door and, with determined intent, hangs the note prominently. In another room, Pete sits at his desk, engrossed with his headphones on, while across the house, Sadie is absorbed in something on her tablet. Debbie, in the meantime, has relocated to Charlotte’s bed, where she lies beside her daughter and tenderly leans over to place a gentle kiss on Charlotte's lips. The following morning unfolds with Pete waking up on the couch, his body in an awkward position, prompting him to slowly prop himself up with a groan while clutching his shoulder to alleviate the discomfort. He proceeds to sip his coffee while standing at the kitchen island, his back turned to the table where his family is having breakfast. Occasionally, he glances over his shoulder toward them before returning his focus to the mug in his hand. Later, Pete is driving the kids to school, balancing a hasty bite of an egg sandwich between verses of a song he sings aloud. During this, Sadie glances at her father with a mixture of emotions, quickly looking away as she notices Charlotte's eyes widen in response to the scene. At school, Charlotte puts on her headphones as Pete accompanies her to her classroom, and together, they walk past a gray-haired pregnant woman. Pete takes a moment to stop and softly kiss Charlotte on the head as a tender gesture of farewell before he continues on his way. Nearby, a large woman approaches with Joseph, who maintains a distance of about a dozen feet, playfully poking her several times. In a coffee shop, Debbie sits across from Jodi, reaching out to grab her phone, an action that prompts Jodi to narrow her eyes with a hint of suspicion. Meanwhile, in a school office, Debbie and Pete are attending a meeting where Debbie nods in response to something as Jill glares at her, followed by Debbie giving a nonchalant shrug, and Pete offering a slow nod of understanding. As they exit the school with mischievous grins, they exchange brief glances without making direct eye contact, conveying a shared, unspoken amusement. Once outside in the parking lot, Debbie heads toward her silver SUV, while Pete strolls casually to his blue sedan, pulling his keys from his pocket and casting a fleeting glance in Debbie’s direction. They both open the doors to their respective vehicles and settle into the driver’s seats at the same time. Later in the day, at home, Pete and Charlotte sit at the table, ready to eat, as Debbie brings over a serving of chicken, which she places on the table and then looks at Pete, her gaze carrying unspoken words. Sadie, meanwhile, decides to storm away from the scene, expressing her discontent. Debbie then joins them, sitting down slowly and resting her head on her hand, conveying her exhaustion or contemplation. In the private space of her room, Sadie is focused on her homework, sprawled across her bed, when the sliding door to Charlotte's room across their shared bathroom quietly opens. Charlotte emerges, her arms full of Sadie's things, including her computer, phone, and tablet. She approaches Sadie's bed, carefully placing each item down before turning to leave. As she does, Sadie reaches for her phone, a smile of gratitude spreading across her face as she looks toward her younger sister, acknowledging the thoughtful gesture as the door slides shut behind Charlotte. Downstairs, Debbie finds a moment of respite sitting on the couch, while Pete paces the room, eventually moving close to her, offering comfort. They share an embrace, their arms wrapping around each other, conveying reassurance and solidarity. Finally, the narrative shifts dramatically as a main character, Jack, lies on the ground, life slipping away, while above him, a plane flies overhead, marking the somber climax of the story."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Sadie lies at the foot of the bed, turning away as Charlotte tries to touch her with slobbery fingers. Sadie leaves the bed in a huff, moving down the hall while Charlotte sits up to face her dad. Charlotte then hops off the bed, creating space between her parents, and elsewhere, Debbie tugs the bedspread and focuses on the TV as she and Pete stare forward. Charlotte writes a note in red marker and hangs it on Sadie's door. Meanwhile, Pete is at his desk with headphones on, and Sadie is absorbed in her tablet. Debbie lies in Charlotte's bed, giving her a kiss goodnight. The next morning, Pete wakes up awkwardly on the couch, stretches, and grabs his shoulder before joining his family for breakfast, sipping coffee at the kitchen island and glancing back at them. He drives the kids to school, eating an egg sandwich and singing, while Sadie looks at him and glances away as Charlotte’s eyes widen. At school, Charlotte wears headphones while Pete walks her to class, stopping to kiss her head before leaving. A pregnant woman passes by, and Pete notices a nearby boy, Joseph, poking her. In a coffee shop, Debbie talks with Jodi, who reacts skeptically as Debbie checks her phone. In the school office, Debbie and Pete share mischievous grins after an encounter with Jill, exiting the school and heading to their separate vehicles with brief glances at one another. Later, at home, they gather at the table where Debbie serves chicken and gives Pete a look while Sadie leaves in a huff. Debbie sits wearily at the table. In her room, Sadie does her homework as Charlotte comes through their shared bathroom, placing electronic devices on Sadie's bed before leaving. Sadie smiles at her sister, feeling touched. Downstairs, Debbie sits on the couch, and Pete approaches, leading to an embrace. In a dramatic ending, Jack lies dying on the ground as a plane flies overhead."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Sadie, the family’s affectionate golden retriever known for her playful spirit, lies at the foot of the bed and turns around as Charlotte touches her with slobbery fingers. Sadie hops out of bed and storms off down the hall lined with family photos and children’s artwork, and Charlotte sits up to face her dad. Charlotte, still in her pajamas decorated with cartoon characters, then jumps off the bed and scurries away, leaving a wide gap between her parents, while Debbie glances at Pete, yanks the bedspread toward her, and faces the TV as they both stare forward, perhaps lost in the latest episode of their favorite drama series. Charlotte sits at her desk, a cluttered space filled with crayons and stuffed animals, writing a note in red marker and hangs it on Sadie’s door, which is decorated with colorful stickers. Meanwhile, Pete, an avid music lover, wears headphones at his desk, while Sadie watches something on her tablet, likely an animated show popular with kids her age. Debbie now lies with Charlotte in her bed and leans over to kiss Charlotte on the lips, a nightly ritual to say goodnight. In the morning, Pete awakens on the couch in an awkward position, having likely fallen asleep while watching TV, props himself up, and grips his shoulder to ease the stiffness. Pete then sips coffee at the island with his back to the table as his family eats breakfast, glancing back before eyeing his mug, a gift from Charlotte’s last birthday. He drives the kids to school in their family van, sloppily eats an egg sandwich purchased from their local deli, and sings along to the radio, while Sadie eyes her father and looks away as Charlotte’s eyes widen, amused by his off-key singing. At school, Charlotte puts on headphones as Pete walks her to class; they pass a gray-haired pregnant woman known for her work as a beloved art teacher, and Pete stops to kiss his daughter on the head before starting to leave. A fat woman who is a familiar face at the school gates approaches with Joseph, her mischievous son, who stands a dozen feet away and pokes her several times, seeking attention. In a bustling coffee shop, Debbie sits with Jodi, her longtime friend and confidante, grabs her phone, and Jodi narrows her eyes, curious about the sudden message. In a school office filled with bustling staff, Debbie nods as Jill, the strict but fair school principal, glares, Debbie shrugs, and Pete nods slowly, the meeting ending on a somewhat ambiguous note. They exit the school with mischievous grins, each glancing at the other, avoiding eye contact, and enter the parking lot where Debbie heads to her silver SUV, recently cleaned and shiny, and Pete strolls to his blue Sedan, known for its reliability, pulling keys from his pocket and briefly glancing toward her. They enter separate vehicles simultaneously. Later, at home, Pete and Charlotte sit at the table as Debbie serves chicken with her signature herb seasoning and looks at Pete, while Sadie storms away in frustration. Debbie then sits down, resting her head on her hand, perhaps feeling the weight of the day. In her room, Sadie does homework on her bed, as Charlotte’s door slides open across their shared bathroom, a space frequently argued over, and Charlotte emerges with an armful of things. She places Sadie’s computer, phone, and tablet on Sadie’s bed as a peace offering, and leaves as Sadie grabs her phone, smiles, and looks toward her younger sister as the door slides shut. Downstairs, Debbie sits on the couch while Pete paces, moves close, and they embrace, sharing a moment of quiet support and understanding. Finally, a main character, Jack, whose story intertwines with theirs in unexpected ways, lies on the ground dying as a plane flies overhead, a poignant reminder of life’s fragility and the unknown destinations his journey might have taken."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Sadie lies at the foot of the bed and turns around as Charlotte touches her with slobbery fingers. Sadie hops out of bed and storms off down the hall and Charlotte sits up to face her dad. Charlotte then jumps off the bed and scurries away leaving a wide gap between her parents while Debbie glances at Pete yanks the bedspread toward her and faces the TV as they both stare forward. Charlotte sits at her desk writing a note in red marker and hangs it on Sadie's door. Meanwhile Pete wears headphones at his desk while Sadie watches something on her tablet. Debbie now lies with Charlotte in her bed and leans over to kiss Charlotte on the lips. In the morning Pete awakens on the couch in an awkward position props himself up and grips his shoulder. Pete then sips coffee at the island with his back to the table as his family eats breakfast glancing back before eyeing his mug. He drives the kids to school sloppily eats an egg sandwich and sings while Sadie eyes her father and looks away as Charlotte's eyes widen. At school Charlotte puts on headphones as Pete walks her to class. they pass a grayhaired pregnant woman and Pete stops to kiss his daughter on the head before starting to leave. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. A fat woman approaches with Joseph who stands a dozen feet away and pokes her several times. In a coffee shop Debbie sits with Jodi grabs her phone and Jodi narrows her eyes. In a school office Debbie nods as Jill glares. Debbie shrugs and Pete nods slowly. They exit the school with mischievous grins each glancing at the other avoiding eye contact and enter the parking lot where Debbie heads to her silver SUV and Pete strolls to his blue Sedan pulling keys from his pocket and briefly glancing toward her. They enter separate vehicles simultaneously. Later at home Pete and Charlotte sit at the table as Debbie serves chicken and looks at Pete while Sadie storms away. Debbie then sits down resting her head on her hand. In her room Sadie does homework on her bed as Charlotte's door slides open across their shared bathroom and Charlotte emerges with an armful of things. She places Sadie's computer phone and tablet on Sadie's bed and leaves as Sadie grabs her phone smiles and looks toward her younger sister as the door slides shut. Downstairs Debbie sits on the couch while Pete paces moves close and they embrace. Finally a main character Jack lies on the ground dying as a plane flies overhead."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Sadie lies at the foot of the bed and turns around as Charlotte touches her with slobbery fingers. Sadie hops out of bed and storms off down the hall and Charlotte sits up to face her dad. Charlotte then jumps off the bed and scurries away leaving a wide gap between her parents while Debbie glances at Pete yanks the bedspread toward her and faces the TV as they both stare forward. Charlotte sits at her desk writing a note in red marker and hangs it on Sadie's door. Meanwhile Pete wears headphones at his desk while Sadie watches something on her tablet. Debbie now lies with Charlotte in her bed and leans over to kiss Charlotte on the lips. In the morning Pete awakens on the couch in an awkward position props himself up and grips his shoulder. Pete then sips coffee at the island with his back to the table as his family eats breakfast glancing back before eyeing his mug. He drives the kids to school sloppily eats an egg sandwich and sings while Sadie eyes her father and looks away as Charlotte's eyes widen. At school Charlotte puts on headphones as Pete walks her to class. they pass a grayhaired pregnant woman and Pete stops to kiss his daughter on the head before starting to leave. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. A fat woman approaches with Joseph who stands a dozen feet away and pokes her several times. In a coffee shop Debbie sits with Jodi grabs her phone and Jodi narrows her eyes. In a school office Debbie nods as Jill glares. Debbie shrugs and Pete nods slowly. They exit the school with mischievous grins each glancing at the other avoiding eye contact and enter the parking lot where Debbie heads to her silver SUV and Pete strolls to his blue Sedan pulling keys from his pocket and briefly glancing toward her. They enter separate vehicles simultaneously. Later at home Pete and Charlotte sit at the table as Debbie serves chicken and looks at Pete while Sadie storms away. Debbie then sits down resting her head on her hand. In her room Sadie does homework on her bed as Charlotte's door slides open across their shared bathroom and Charlotte emerges with an armful of things. She places Sadie's computer phone and tablet on Sadie's bed and leaves as Sadie grabs her phone smiles and looks toward her younger sister as the door slides shut. Downstairs Debbie sits on the couch while Pete paces moves close and they embrace. Finally a main character Jack lies on the ground dying as a plane flies overhead."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Sadie lies at the foot of the bed and turns around as Charlotte touches her with slobbery fingers. Sadie hops out of bed and storms off down the hall and Charlotte sits up to face her dad. Charlotte then jumps off the bed and scurries away leaving a wide gap between her parents while Debbie glances at Pete yanks the bedspread toward her and faces the TV as they both stare forward. Charlotte sits at her desk writing a note in red marker and hangs it on Sadie's door. Meanwhile Pete wears headphones at his desk while Sadie watches something on her tablet. Debbie now lies with Charlotte in her bed and leans over to kiss Charlotte on the lips. Later at home Pete and Charlotte sit at the table as Debbie serves chicken and looks at Pete while Sadie storms away. Debbie then sits down resting her head on her hand. In her room Sadie does homework on her bed as Charlotte's door slides open across their shared bathroom and Charlotte emerges with an armful of things. She places Sadie's computer phone and tablet on Sadie's bed and leaves as Sadie grabs her phone smiles and looks toward her younger sister as the door slides shut. Downstairs Debbie sits on the couch while Pete paces moves close and they embrace. Finally a main character Jack lies on the ground dying as a plane flies overhead."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Sadie lies at the foot of the bed and turns around as Charlotte touches her with slobbery fingers. Sadie hops out of bed and storms off down the hall and Charlotte sits up to face her dad. She places Sadie's computer phone and tablet on Sadie's bed and leaves as Sadie grabs her phone smiles and looks toward her younger sister as the door slides shut. Downstairs Debbie sits on the couch while Pete paces moves close and they embrace. Finally a main character Jack lies on the ground dying as a plane flies overhead."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Milo tumbles at the base of the stairs and spins around as Oliver waves at him with fluffy gloves. Milo skips out of the room and glides down the hallway, and Oliver stands up to face his uncle. Oliver then leaps off the staircase and dashes away, leaving a narrow trail between his friends, while Fiona peeks at Tom, tugs the curtain toward her, and faces the window as they both gaze outward. Oliver stands at his bench sketching a picture in blue crayon and tapes it on Milo's locker. Meanwhile, Tom wears sunglasses at his counter, while Milo listens to something on his radio. Fiona now tumbles with Oliver in his crib and bends over to tickle Oliver on the toes. In the evening, Tom dozes on the porch in a twisted position, props himself up, and rubs his knee. Tom then drinks tea at the deck with his front to the chair as his neighbors eat dinner, glancing back before sniffing his cup. He rides the pets to the vet, sloppily juggles a banana split, and dances, while Milo eyes his uncle and looks away as Oliver's ears twitch. At the zoo, Oliver puts on mittens as Tom carries him to exhibit; they pass a bald-headed tiny child, and Tom pauses to tickle his nephew on the nose before deciding to linger. A short sailor approaches with Becky, who stands a dozen inches away and nudges him several times. In a bakery, Fiona stands with Lamar, snatches his book, and Lamar narrows his nostrils. In a post office, Fiona nods as Lisa giggles, Fiona shrugs, and Tom nods quickly. They exit the building with gleeful grimaces, each glaring at the other, avoiding eye contact, and enter the hallway where Fiona skips to her red motorcycle and Tom strolls to his yellow scooter, pulling tickets from his wallet and briefly peering toward her. They mount separate vehicles simultaneously. Earlier, at school, Tom and Oliver stand at the bench as Fiona dishes salad and glares at Tom, while Milo glides away. Fiona then stands up, resting her foot on her elbow. In his office, Milo studies maps on his chair, as Oliver's window creaks open across their shared closet, and Oliver appears with a boxful of gadgets. He places Milo's textbook, pencil, and notebook on Milo's chair, and vanishes as Milo picks up his pencil, chuckles, and glances toward his older brother as the window slides shut. Upstairs, Fiona stands on the shelf while Tom kneels, shifts far, and they greet. Eventually, a main character, Tim, crouches on the floor giggling as a balloon floats overhead."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Sadie lies at the foot of the bed, turning away as Charlotte touches her with slobbery fingers. Sadie storms off, leaving Charlotte to face her dad before she also leaves, creating a gap between her parents. Debbie pulls the bedspread toward her, facing the TV with Pete. Charlotte writes a note to Sadie and hangs it on her door. Pete works with headphones at his desk, while Sadie watches her tablet. Debbie lies with Charlotte in bed, kissing her goodnight. In the morning, Pete wakes awkwardly on the couch, then drinks coffee as the family eats breakfast. He drives the kids to school, eating and singing as Sadie looks away. Charlotte wears headphones as Pete walks her to class, pausing to kiss her head. At a coffee shop, Debbie meets Jodi, while later, at school, Debbie and Pete exchange sly smiles before heading to their vehicles. At home, they eat dinner as Sadie storms away. In her room, Sadie finds Charlotte returning her devices, smiles, and looks at her sister. Downstairs, Debbie and Pete embrace. Lastly, Jack lies dying on the ground as a plane flies overhead."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Finally a main character Jack lies on the ground dying as a plane flies overhead Downstairs Debbie sits on the couch while Pete paces moves close and they embrace She places Sadie's computer phone and tablet on Sadie's bed and leaves as Sadie grabs her phone smiles and looks toward her younger sister as the door slides shut In her room Sadie does homework on her bed as Charlotte's door slides open across their shared bathroom and Charlotte emerges with an armful of things Debbie then sits down resting her head on her hand Later at home Pete and Charlotte sit at the table as Debbie serves chicken and looks at Pete while Sadie storms away They enter separate vehicles simultaneously They exit the school with mischievous grins each glancing at the other avoiding eye contact and enter the parking lot where Debbie heads to her silver SUV and Pete strolls to his blue Sedan pulling keys from his pocket and briefly glancing toward her Debbie shrugs and Pete nods slowly In a school office Debbie nods as Jill glares In a coffee shop Debbie sits with Jodi grabs her phone and Jodi narrows her eyes A fat woman approaches with Joseph who stands a dozen feet away and pokes her several times they pass a grayhaired pregnant woman and Pete stops to kiss his daughter on the head before starting to leave At school Charlotte puts on headphones as Pete walks her to class He drives the kids to school sloppily eats an egg sandwich and sings while Sadie eyes her father and looks away as Charlotte's eyes widen Pete then sips coffee at the island with his back to the table as his family eats breakfast glancing back before eyeing his mug In the morning Pete awakens on the couch in an awkward position props himself up and grips his shoulder Debbie now lies with Charlotte in her bed and leans over to kiss Charlotte on the lips Meanwhile Pete wears headphones at his desk while Sadie watches something on her tablet Charlotte sits at her desk writing a note in red marker and hangs it on Sadie's door Charlotte then jumps off the bed and scurries away leaving a wide gap between her parents while Debbie glances at Pete yanks the bedspread toward her and faces the TV as they both stare forward Sadie hops out of bed and storms off down the hall and Charlotte sits up to face her dad Sadie lies at the foot of the bed and turns around as Charlotte touches her with slobbery fingers"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Sadie hops out of bed and storms off down the hall and Charlotte sits up to face her dad Sadie lies at the foot of the bed and turns around as Charlotte touches her with slobbery fingers Charlotte sits at her desk writing a note in red marker and hangs it on Sadie's door Charlotte then jumps off the bed and scurries away leaving a wide gap between her parents while Debbie glances at Pete yanks the bedspread toward her and faces the TV as they both stare forward Debbie now lies with Charlotte in her bed and leans over to kiss Charlotte on the lips Meanwhile Pete wears headphones at his desk while Sadie watches something on her tablet Pete then sips coffee at the island with his back to the table as his family eats breakfast glancing back before eyeing his mug In the morning Pete awakens on the couch in an awkward position props himself up and grips his shoulder At school Charlotte puts on headphones as Pete walks her to class He drives the kids to school sloppily eats an egg sandwich and sings while Sadie eyes her father and looks away as Charlotte's eyes widen A fat woman approaches with Joseph who stands a dozen feet away and pokes her several times they pass a grayhaired pregnant woman and Pete stops to kiss his daughter on the head before starting to leave In a school office Debbie nods as Jill glares In a coffee shop Debbie sits with Jodi grabs her phone and Jodi narrows her eyes They exit the school with mischievous grins each glancing at the other avoiding eye contact and enter the parking lot where Debbie heads to her silver SUV and Pete strolls to his blue Sedan pulling keys from his pocket and briefly glancing toward her Debbie shrugs and Pete nods slowly Later at home Pete and Charlotte sit at the table as Debbie serves chicken and looks at Pete while Sadie storms away They enter separate vehicles simultaneously In her room Sadie does homework on her bed as Charlotte's door slides open across their shared bathroom and Charlotte emerges with an armful of things Debbie then sits down resting her head on her hand Downstairs Debbie sits on the couch while Pete paces moves close and they embrace She places Sadie's computer phone and tablet on Sadie's bed and leaves as Sadie grabs her phone smiles and looks toward her younger sister as the door slides shut Finally a main character Jack lies on the ground dying as a plane flies overhead"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "In a coffee shop Debbie sits with Jodi grabs her phone and Jodi narrows her eyes In a school office Debbie nods as Jill glares Debbie shrugs and Pete nods slowly They exit the school with mischievous grins each glancing at the other avoiding eye contact and enter the parking lot where Debbie heads to her silver SUV and Pete strolls to his blue Sedan pulling keys from his pocket and briefly glancing toward her They enter separate vehicles simultaneously Later at home Pete and Charlotte sit at the table as Debbie serves chicken and looks at Pete while Sadie storms away Debbie then sits down resting her head on her hand In her room Sadie does homework on her bed as Charlotte's door slides open across their shared bathroom and Charlotte emerges with an armful of things She places Sadie's computer phone and tablet on Sadie's bed and leaves as Sadie grabs her phone smiles and looks toward her younger sister as the door slides shut Downstairs Debbie sits on the couch while Pete paces moves close and they embrace Finally a main character Jack lies on the ground dying as a plane flies overhead Sadie lies at the foot of the bed and turns around as Charlotte touches her with slobbery fingers Sadie hops out of bed and storms off down the hall and Charlotte sits up to face her dad Charlotte then jumps off the bed and scurries away leaving a wide gap between her parents while Debbie glances at Pete yanks the bedspread toward her and faces the TV as they both stare forward Charlotte sits at her desk writing a note in red marker and hangs it on Sadie's door Meanwhile Pete wears headphones at his desk while Sadie watches something on her tablet Debbie now lies with Charlotte in her bed and leans over to kiss Charlotte on the lips In the morning Pete awakens on the couch in an awkward position props himself up and grips his shoulder Pete then sips coffee at the island with his back to the table as his family eats breakfast glancing back before eyeing his mug He drives the kids to school sloppily eats an egg sandwich and sings while Sadie eyes her father and looks away as Charlotte's eyes widen At school Charlotte puts on headphones as Pete walks her to class they pass a grayhaired pregnant woman and Pete stops to kiss his daughter on the head before starting to leave A fat woman approaches with Joseph who stands a dozen feet away and pokes her several times"
        }
      ]
    }
  ]
}