{
  "ground_truth": "He speeds through an intersection, continuing onto a busy street as Pete cuts off a car that narrowly avoids him. An SUV pulls up beside him. Back in the kitchen, Oliver cleans up outside, and Sadie approaches with Joseph. Debbie smiles, and Joseph avoids her gaze. Sadie leaves, and Joseph follows. Pete speeds down the middle of a street, slowing down traffic, and holds out his middle finger, waving a guy past. A car turns right in front of him, and the SUV accelerates ahead. Oliver sits with the girls, glances back at Sadie, and flashes a smile before running off. Sadie grabs her sister. Pete rides through a red light and makes a left between oncoming cars, taking a left onto a quiet side street as he soars down a winding hilly road. Pete coasts around a corner and stands upright, then accelerates past a group of serious cyclists. Debbie drives with Larry in her SUV. Pete makes a left at an empty intersection and rides past a white picket fence. A car door swings open, and a husky man looks down at him, then punches Pete in the face. The man easily absorbs Pete's stomach punch, then knocks Pete over with one. Debbie drives by, gets out, and runs to Pete as the man gets in his SUV. Pete writhes in glass, sees the dealer license plate, and puts his head down as Debbie arrives. The man pulls away. Now, in a hospital hallway, Debbie shakes her head as she sits with Larry. A nurse approaches and steps away, giving an incredulous look. She hugs him, and he gives her back a fatherly pat as she clings to him. They part, and he takes the bill. As he shuffles off, Debbie watches him go with a little smile. On the island, the hero Jack lies dying with Vincent the dog at his side. Oliver watches with the girls and Joseph. Holding Charlotte close, Oliver lifts his chin. Now, in the hospital hallway, a window shows Pete on a bed sporting a bruised, swollen eye. Debbie walks in with a sympathetic smile. He waves, and she perches beside him on the edge of the bed. Her injured husband regards her gravely, and Debbie smiles at him, stands, and starts to help him up. He winces, then swings one leg over the bed, and as she tries to help him again, Pete sits up and kisses her. They share a tender, lingering smooch. Now at a music club, a young singer with moppy dark brown hair strums a guitar at the mic. Debbie brings Pete a bottle of beer, setting her own drink down as she faces the stage and takes his hand. Pete shrugs and gives a delighted smile.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sure, here is the transformed text with synonyms for non-stop words:\n\nHe races through an intersection, proceeding onto a bustling avenue as Pete cuts off an automobile that narrowly dodges him. An SUV draws up beside him. Back in the kitchen, Oliver tidies up outside, and Sadie approaches with Joseph. Debbie grins, and Joseph evades her gaze. Sadie departs, and Joseph follows. Pete races down the center of a boulevard, slowing down traffic, and extends his middle finger, signaling a guy past. An automobile turns right in front of him, and the SUV speeds forward. Oliver sits with the girls, peers back at Sadie, and flashes a grin before running off. Sadie grabs her sister. Pete rides through a red signal and takes a left between oncoming automobiles, taking a left onto a tranquil side lane as he glides down a winding hilly road. Pete coasts around a corner and stands upright, then speeds past a group of serious bikers. Debbie drives with Larry in her SUV. Pete takes a left at a vacant intersection and rides past a white picket barrier. An automobile door swings open, and a burly man looks down at him, then punches Pete in the face. The man easily absorbs Pete's stomach punch, then knocks Pete over with one. Debbie drives by, gets out, and runs to Pete as the man gets in his SUV. Pete squirms in glass, sees the dealer license plate, and lowers his head as Debbie arrives. The man pulls away. Now, in a hospital corridor, Debbie shakes her head as she sits with Larry. A nurse approaches and steps away, giving an incredulous glance. She hugs him, and he pats her back with a fatherly gesture as she clings to him. They part, and he takes the bill. As he shuffles off, Debbie watches him go with a slight smile. On the island, the hero Jack lies dying with Vincent the canine at his side. Oliver observes with the girls and Joseph. Holding Charlotte close, Oliver lifts his chin. Now, in the hospital corridor, a window displays Pete on a bed sporting a bruised, swollen eye. Debbie enters with a compassionate grin. He waves, and she perches beside him on the edge of the bed. Her injured husband regards her solemnly, and Debbie smiles at him, stands, and begins to help him up. He winces, then swings one leg over the bed, and as she attempts to assist him again, Pete sits up and kisses her. They share a tender, lingering kiss. Now at a music club, a young vocalist with moppy dark brown hair strums a guitar at the mic. Debbie brings Pete a bottle of beer, placing her own drink down as she faces the stage and takes his hand. Pete shrugs and gives a delighted grin."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He speeds through an intersection, continuing onto a busy street as a car that narrowly avoids him is cut off by Pete. He is pulled up beside by an SUV. Back in the kitchen, the outside is cleaned up by Oliver, and Joseph is approached by Sadie. She is smiled at by Debbie, and her gaze is avoided by Joseph. Sadie leaves, followed by Joseph. The middle of a street is sped down by Pete, traffic is slowed down, and a middle finger is held out, waving a guy past. Right in front of him, a car turns, and ahead accelerates the SUV. The girls are sat with by Oliver, and Sadie is glanced back at by him, and a smile is flashed before he runs off. Sadie grabs her sister. A red light is ridden through by Pete, and between oncoming cars, a left is made by him, taking a left onto a quiet side street as a winding hilly road is soared down by him. Around a corner, Pete coasts and is stood upright by himself, then past a group of serious cyclists, acceleration occurs. Debbie drives with Larry in her SUV. At an empty intersection, a left is made by Pete, and a white picket fence is ridden past. Open swings a car door, and a husky man looks down at him, then Pete is punched in the face by him. Pete's stomach punch is easily absorbed by the man, then he knocks Pete over with one. Debbie drives by, gets out, and to Pete runs as the SUV is gotten into by the man. Glass is writhed in by Pete, the dealer license plate is seen, and as Debbie arrives, his head is put down. The man pulls away. Now, in a hospital hallway, her head is shaken by Debbie as Larry sits with her. A nurse approaches and an incredulous look is given as she steps away. He is hugged by her, and her back is given a fatherly pat by him as he is clung to by her. They part, and the bill is taken by him. As he shuffles off, by Debbie, he is watched go with a little smile. On the island, dying lies the hero Jack with Vincent the dog at his side. Oliver watches with the girls and Joseph. Holding Charlotte close, his chin is lifted by Oliver. Now, in the hospital hallway, Pete is shown on a bed sporting a bruised, swollen eye by a window. In walks Debbie with a sympathetic smile. He waves, and beside him on the edge of the bed she perches. Her injured husband regards her gravely, and at him, Debbie smiles, stands, and up starts to help him. He winces, then one leg is swung over the bed, and as she tries to help him again, he sits up and kisses her. A tender, lingering smooch is shared by them. Now, at a music club, a young singer with moppy dark brown hair strums a guitar at the mic. Debbie brings Pete a bottle of beer, her own drink is set down as the stage is faced, and his hand is taken. A delighted smile is given by Pete, and he shrugs."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He speeds through an intersection onto a busy street where Pete cuts off a car that nearly hits him. An SUV pulls up beside him. Back in the kitchen, Oliver cleans outside, while Sadie approaches with Joseph. Debbie smiles, and Joseph avoids her gaze before following Sadie. Pete speeds down the street, slowing traffic, and waves a guy past with his middle finger. A car turns in front of him as the SUV accelerates. Oliver sits with the girls, smiles at Sadie, and runs off. Sadie grabs her sister. Pete runs a red light, takes a left through oncoming cars onto a quiet side street, and then races down a winding hill. He coasts around a corner, accelerates past cyclists, and makes a left at an empty intersection, passing a white picket fence. A car door suddenly opens, and a husky man punches Pete in the face. The man absorbs Pete's punch, then knocks him over. Debbie drives by, gets out to help Pete writhing in glass, noting the dealer license plate as the man leaves. In a hospital hallway, Debbie sits with Larry, receiving an incredulous look from a nurse. She hugs Larry, who gives her a fatherly pat and leaves with the bill. Debbie watches him go with a small smile. On the island, hero Jack lies dying with Vincent the dog. Oliver watches with the girls and Joseph, lifting Charlotte close. In the hospital, a window shows Pete with a bruised eye. Debbie enters with a sympathetic smile, perching beside him. Her injured husband regards her gravely. Debbie helps him up, he winces, then swings over the bed and kisses her. They share a tender smooch. At a music club, a young singer strums a guitar. Debbie brings Pete a beer, setting her drink down as she faces the stage and takes his hand. Pete shrugs with a delighted smile."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Pete speeds through an intersection, narrowly missing a car, while an SUV pulls up beside him. In the kitchen, Oliver cleans, Sadie approaches with Joseph, and Debbie smiles as Joseph avoids her gaze. Sadie leaves and Joseph follows. Pete rides down the street, slowing traffic and flipping off a driver. An SUV accelerates past him, while a car turns right in front. Oliver sits with the girls, smiles at Sadie, and runs off as she grabs her sister. Pete runs a red light, turning onto a quiet street, zooming down a hilly road past cyclists. Debbie drives with Larry in her SUV. Pete rides past a white picket fence, a car door opens, and a man punches Pete. The man absorbs Pete's punch, knocks him over, then drives away. Debbie finds Pete in glass; she notices the dealer license plate. In a hospital, Debbie sits with Larry, hugs him, and he leaves with the bill. Jack lies dying on an island as Oliver watches with the girls. In the hospital, Pete lies with a bruised eye. Debbie smiles at him, helps him up, and they share a kiss. At a music club, a singer performs. Debbie brings Pete a beer, faces the stage, and they hold hands. Pete smiles."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He rapidly speeds through an intersection, seamlessly continuing onto a bustling street, as Pete audaciously cuts off a car that narrowly manages to evade him with quick reflexes. An SUV confidently pulls up beside him, cruising alongside. Meanwhile, back in the kitchen, Oliver diligently cleans up the area outside, and Sadie approaches, accompanied by Joseph. Debbie offers a warm smile, and Joseph, somewhat awkwardly, avoids meeting her gaze. Sadie exits, with Joseph trailing in her footsteps. Pete recklessly speeds down the center of a street, causing the surrounding traffic to slow down, and boldly holds out his middle finger, waving a guy to pass him by. A car abruptly turns right directly in front of him, while the SUV swiftly accelerates ahead. Oliver sits congenially with the girls, then glances back at Sadie with a fond smile, before energetically running off. In her motion, Sadie grabs hold of her sister. Undaunted, Pete rides through a red light, taking a left turn between oncoming cars before gracefully veering onto a quiet, secluded side street, soaring down a winding hilly road with confidence. Pete adeptly coasts around a corner, stands upright momentarily, and then accelerates past a group of serious, focused cyclists. Meanwhile, Debbie is driving with Larry in her SUV. Pete makes a sharp left at an empty intersection and rides past a picturesque white picket fence. Suddenly, a car door swings open, and a husky man looks down at him with an intimidating presence, then unexpectedly punches Pete squarely in the face. The man easily absorbs Pete's defensive stomach punch without flinching, then knocks Pete over with a powerful punch of his own. Debbie drives by, immediately gets out of her vehicle, and rushes to Pete’s side as the man nonchalantly gets back into his SUV. Pete writhes painfully in broken glass, noticing the dealer license plate, and lowers his head just as Debbie arrives at the scene. Eventually, the man pulls away, leaving the area. Now, in a hospital hallway, Debbie shakes her head solemnly while sitting with Larry. A nurse approaches with a sense of urgency but then steps away, giving an incredulous look as she retreats. She offers him a hug, and he reciprocates with a gentle, fatherly pat on her back as she clings to him for comfort. They part ways, and he accepts the bill, shuffling off down the hallway, while Debbie watches him go with a mild, bittersweet smile. On the island, the heroic Jack is lying on the ground, slowly dying, with Vincent, the loyal dog, steadfastly at his side. Oliver observes the scene with the girls and Joseph, holding Charlotte close, as he lifts his chin resolutely. Now, again in the hospital hallway, a window reveals Pete lying on a bed, sporting a bruised and swollen eye from the earlier encounter. Debbie walks in, offering him a sympathetic smile. He waves at her, and she gently perches beside him on the edge of the bed. Her injured husband regards her with a serious expression, and Debbie smiles reassuringly at him, stands, and begins to help him up. He winces slightly from the pain, then swings one leg over the bed. As she attempts to help him once more, Pete sits up and affectionately kisses her, and they share a tender, lingering smooch. Now, at a vibrant music club, a young singer with moppy dark brown hair passionately strums a guitar at the microphone. Debbie brings Pete a refreshing bottle of beer, setting her own drink down as she turns to face the lively stage and takes his hand. Pete nonchalantly shrugs, then gives a delighted, contented smile."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He accelerates rapidly, maneuvering swiftly through an intersection, seamlessly flowing onto a bustling and lively street. In a bold and audacious move, Pete cuts off another car, which manages to narrowly evade a potential collision through quick reflexes and sharp reactions. Beside him, an SUV, exuding confidence, pulls up and cruises alongside. Meanwhile, back in the kitchen, Oliver is diligently and meticulously cleaning up the area outside when Sadie, accompanied by Joseph, approaches. Debbie offers them a warm and welcoming smile, but Joseph, somewhat awkwardly, avoids making eye contact with her. Sadie exits with Joseph trailing closely behind her footsteps. Pete, driving recklessly and with little regard for the surrounding traffic, speeds down the center of a busy street, causing the other vehicles to slow down as he boldly holds up his middle finger, signaling a guy to pass him by. A car suddenly makes a sharp right turn directly in front of him, while the SUV swiftly accelerates ahead, picking up speed. Oliver congenially sits with the girls, sharing a warm moment, then casts a fond and affectionate smile back at Sadie before energetically dashing off. In her motion, Sadie reaches out to gently grab hold of her sister. Undeterred, Pete rides through a red light, daringly taking a left turn between oncoming cars, before gracefully veering onto a quiet and secluded side street, zooming down a winding and hilly road with unwavering confidence. Pete adeptly coasts around a corner, stands upright momentarily, and then accelerates past a group of serious and focused cyclists. Meanwhile, Debbie is seen driving with Larry in her SUV. Pete executes a sharp left turn at an otherwise empty intersection and rides past a picturesque white picket fence. Suddenly, a car door abruptly swings open, and a husky man with an intimidating presence looks down at him, unexpectedly delivering a swift punch that strikes Pete squarely in the face. The man easily absorbs Pete's defensive punch to his stomach without so much as flinching, then lands a powerful punch of his own that knocks Pete over. Debbie, driving by, immediately jumps out of her vehicle and rushes to Pete’s side, as the man nonchalantly gets back into his SUV. Pete writhes in pain on broken glass, noticing the dealer license plate on the SUV, and lowers his head just as Debbie arrives at the scene. Eventually, the man pulls away, leaving the area. Now, in the hospital hallway, Debbie sits solemnly with Larry, shaking her head with a sense of resignation. A nurse approaches with urgency but then steps away, giving an incredulous look as she retreats. She offers him a comforting hug, and he reciprocates with a gentle, fatherly pat on her back as she clings to him for solace. They part ways, and he accepts the bill, shuffling slowly down the hallway while Debbie watches him go with a mild yet bittersweet smile on her face. On the island, the heroic Jack lies on the ground, slowly dying, with Vincent, the loyal and steadfast dog, by his side. Oliver observes the poignant scene with the girls and Joseph, holding Charlotte close as he lifts his chin resolutely. Now, back in the hospital hallway, a window reveals Pete lying on a bed, his eye bruised and swollen from the earlier encounter. Debbie walks in, offering him a sympathetic and understanding smile. He waves at her, and she gently perches beside him on the edge of the bed. Her injured husband regards her with a serious expression, but Debbie smiles reassuringly at him, stands up, and begins to help him up. He winces slightly from the pain but then swings one leg over the bed. As she tries to assist him once more, Pete sits up and affectionately kisses her, and they share a tender and lingering smooch. Now, at a vibrant and lively music club, a young singer with moppy dark brown hair passionately strums a guitar at the microphone. Debbie brings Pete a refreshing bottle of beer, setting her own drink down as she turns to face the lively stage and takes his hand. Pete shrugs nonchalantly, then gives a delighted and contented smile."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He speeds through an intersection, hurtling forward with determination, seamlessly transitioning onto a busy street where, with precise timing and some risk, Pete cuts off a car that narrowly manages to avoid colliding with him. An SUV maneuvers into position beside him, maintaining speed. Back in the kitchen, Oliver diligently tidies up outside, ensuring everything is in order, when Sadie approaches, bringing Joseph along. As they enter the space, Debbie greets them with a warm smile, but Joseph, feeling a bit sheepish or perhaps shy, makes a conscious effort to avoid meeting her gaze. Sadie then departs from the kitchen, prompting Joseph to trail after her. Meanwhile, Pete navigates the middle of a street with audacious speed, deliberately slowing down the surrounding traffic, and with a bold gesture, he extends his middle finger as he waves a guy past him. In a sudden maneuver, a car turns right directly in front of him, while simultaneously, the SUV beside him surges ahead with increased velocity. Oliver sits among the girls, casting a glance back towards Sadie and, with a playful charm, flashes her a smile before springing up and darting off. Sadie, responding to the moment, reaches out to grab her sister. As Pete approaches a red light, he disregards it entirely, riding through it with bold confidence and making a calculated left turn amidst oncoming cars. He navigates onto a serene, quiet side street, transitioning seamlessly as he speeds along a winding, hilly road. Coasting around a corner, Pete stands upright on his bike, then accelerates past a group of serious cyclists with an air of defiance. Elsewhere, Debbie drives with Larry in her SUV, navigating the roads. Pete, with practiced ease, executes a left turn at an empty intersection and continues his journey past a charming white picket fence. In a sudden and startling moment, a car door swings open in front of him, revealing a husky man who looks down at him with intent before abruptly punching Pete in the face. Attempting to retaliate, Pete throws a punch to the man's stomach, but the man absorbs it with ease and counters with his own punch, knocking Pete over. As Pete lies amidst scattered glass, writhing in discomfort, he catches sight of the dealer license plate, triggering a moment of recognition before he lowers his head as Debbie arrives on the scene. The man gets back into his SUV and drives off, leaving the chaos behind. Now in a hospital hallway, Debbie shakes her head wearily as she sits alongside Larry. A nurse approaches them but then steps away, casting an incredulous look at the scene. She embraces Larry, holding him tightly, and he responds with a fatherly pat on her back, offering comfort. They part ways, and he takes the bill, shuffling off as Debbie watches with a faint smile playing on her lips. On an island, the hero Jack lies on the ground, with death approaching, while Vincent the dog loyally stays by his side. Observing the somber moment, Oliver stands with the girls and Joseph, protectively holding Charlotte close and lifting his chin in resolve. Meanwhile, back in the hospital hallway, a window offers a view of Pete lying on a bed, his eye bruised and swollen. Debbie enters the room with a sympathetic smile, acknowledging him with a wave as she perches gently beside him on the edge of the bed. Her injured husband looks at her gravely, prompting her to return his gaze with a reassuring smile. She stands, initiating the act of helping him up. As Pete winces, he gingerly swings one leg over the bed, and when she attempts to assist him once more, he sits up determinedly and, in a moment of affection, leans in to kiss her. Their lips meet, and they share a tender, lingering smooch that speaks volumes. Transitioning to a music club, a young singer with moppy dark brown hair strums a guitar at the mic, capturing the attention of the room. Debbie arrives with a bottle of beer for Pete, carefully setting her own drink down as she faces the stage. She reaches for Pete's hand, and with a slight shrug, he gives her a delighted smile, basking in the moment."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He speeds through an intersection onto a busy street, cutting off a car that narrowly avoids him as an SUV pulls up beside. Meanwhile, in the kitchen, Oliver cleans up as Sadie approaches with Joseph. Debbie smiles, but Joseph avoids her gaze before following Sadie out. Pete disrupts traffic by riding down the middle of the street, flipping off a driver while weaving through right-turning cars, as the SUV speeds ahead. Oliver briefly joins Sadie and the girls, sharing a smile before running off, as Sadie gathers her sister. Pete runs a red light, maneuvers through oncoming cars onto a quiet side street, and accelerates down a winding hilly road. He passes a group of serious cyclists with ease. Debbie drives her SUV with Larry. Pete turns at an empty intersection, rides past a picket fence, and confronts a man who punches him when Pete's defense fails. Debbie drives by, rushes to him as the man leaves in his SUV, and finds Pete writhing in glass, noting the dealer license plate. At the hospital, Debbie shakes her head while sitting with Larry. A nurse approaches, then steps away with a look of incredulity. Debbie hugs Larry before he shuffles off with the bill, leaving her with a smile. On the island, Jack lies dying with Vincent the dog, watched by Oliver, the girls, and Joseph. Oliver holds Charlotte and lifts his chin. Back at the hospital, Pete lies on a bed with a swollen eye. Debbie enters with a sympathetic smile, sits by him, and helps him up. He winces, swings his leg over, and kisses her, sharing a tender moment. Later, at a music club, a young singer plays guitar on stage as Debbie brings Pete a beer. They face the stage, holding hands, and Pete gives a delighted smile."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He speeds through an intersection in downtown Los Angeles, known for its dense traffic, continuing onto a busy street as Pete cuts off a car that narrowly avoids him. An SUV, one of those large vehicles that have become increasingly popular for families, pulls up beside him. Back in the kitchen of their suburban home, Oliver cleans up outside on the patio, and Sadie approaches with Joseph. Debbie smiles warmly, and Joseph, a shy teenager, avoids her gaze. Sadie leaves, and Joseph, her younger brother, follows. Pete speeds down the middle of a street notorious for its rush hour congestion, slowing down traffic, and holds out his middle finger, waving a guy past. A car turns right in front of him, and the SUV accelerates ahead, taking advantage of a gap in the traffic. Oliver sits with the girls, glances back at Sadie with a knowing look, and flashes a smile before running off. Sadie grabs her sister tightly, offering comfort. Pete rides through a red light and makes a left between oncoming cars, taking a left onto a quiet side street lined with cherry blossom trees as he soars down a winding hilly road. Pete coasts around a corner, where street art adorns the walls, and stands upright, then accelerates past a group of serious cyclists clad in bright jerseys. Debbie drives with Larry, her long-time friend, in her SUV. Pete makes a left at an empty intersection bordered by quaint cafes and rides past a white picket fence, symbolizing the quintessential suburban dream. A car door swings open unexpectedly, and a husky man with a scowl looks down at him, then punches Pete in the face, an act of road rage. The man easily absorbs Pete's stomach punch, then knocks Pete over with one swift blow. Debbie drives by, gets out in a hurry, and runs to Pete as the man gets in his SUV, driving off with a sense of triumph. Pete writhes in glass, sees the dealer license plate indicating a recently purchased vehicle, and puts his head down as Debbie arrives. The man pulls away, tires screeching. Now, in a hospital hallway bustling with activity, Debbie shakes her head as she sits with Larry. A nurse approaches and steps away, giving an incredulous look at the chart. She hugs him, and he gives her back a fatherly pat of reassurance as she clings to him. They part, and he takes the bill, a reminder of the medical expenses yet to come. As he shuffles off, Debbie watches him go with a little smile, thankful for his support. On the island, a reference to a famous scene from the television show \"Lost,\" the hero Jack lies dying with Vincent the dog at his side. Oliver watches with the girls and Joseph, their eyes wide at the dramatic scene. Holding Charlotte close, Oliver lifts his chin in a gesture of pride. Now, in the hospital hallway, a window shows Pete on a bed sporting a bruised, swollen eye, a testament to his earlier altercation. Debbie walks in with a sympathetic smile. He waves weakly, and she perches beside him on the edge of the bed. Her injured husband regards her gravely, reflecting on the day's events, and Debbie smiles at him, stands, and starts to help him up. He winces from the pain, then swings one leg over the bed, and as she tries to help him again, Pete sits up and kisses her. They share a tender, lingering smooch, a moment of solace amidst the chaos. Now at a music club known for discovering new talent, a young singer with moppy dark brown hair strums a guitar at the mic, captivating the audience with his soulful voice. Debbie brings Pete a bottle of craft beer, setting her own drink down as she faces the stage and takes his hand. Pete shrugs with a nonchalance that hides his delight and gives a delighted smile, feeling the warmth of the music and the moment."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He speeds through an intersection continuing onto a busy street as Pete cuts off a car that narrowly avoids him. An SUV pulls up beside him. Back in the kitchen Oliver cleans up outside and Sadie approaches with Joseph. Debbie smiles and Joseph avoids her gaze. Sadie leaves and Joseph follows. Pete speeds down the middle of a street slowing down traffic and holds out his middle finger waving a guy past. A car turns right in front of him and the SUV accelerates ahead. Oliver sits with the girls glances back at Sadie and flashes a smile before running off. Sadie grabs her sister. Pete rides through a red light and makes a left between oncoming cars taking a left onto a quiet side street as he soars down a winding hilly road. Pete coasts around a corner and stands upright then accelerates past a group of serious cyclists. Debbie drives with Larry in her SUV. Pete makes a left at an empty intersection and rides past a white picket fence. A car door swings open and a husky man looks down at him then punches Pete in the face. The man easily absorbs Pete's stomach punch then knocks Pete over with one. Debbie drives by gets out and runs to Pete as the man gets in his SUV. Pete writhes in glass sees the dealer license plate and puts his head down as Debbie arrives. The man pulls away. Now in a hospital hallway. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Debbie shakes her head as she sits with Larry. A nurse approaches and steps away giving an incredulous look. She hugs him and he gives her back a fatherly pat as she clings to him. They part and he takes the bill. As he shuffles off Debbie watches him go with a little smile. On the island the hero Jack lies dying with Vincent the dog at his side. Oliver watches with the girls and Joseph. Holding Charlotte close. Oliver lifts his chin. Now in the hospital hallway. a window shows Pete on a bed sporting a bruised swollen eye. Debbie walks in with a sympathetic smile. He waves and she perches beside him on the edge of the bed. Her injured husband regards her gravely and Debbie smiles at him stands and starts to help him up. He winces then swings one leg over the bed and as she tries to help him again Pete sits up and kisses her. They share a tender lingering smooch. Now at a music club a young singer with moppy dark brown hair strums a guitar at the mic. Debbie brings Pete a bottle of beer. setting her own drink down as she faces the stage and takes his hand. Pete shrugs and gives a delighted smile."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He speeds through an intersection continuing onto a busy street as Pete cuts off a car that narrowly avoids him. An SUV pulls up beside him. Back in the kitchen Oliver cleans up outside and Sadie approaches with Joseph. Debbie smiles and Joseph avoids her gaze. Sadie leaves and Joseph follows. Pete speeds down the middle of a street slowing down traffic and holds out his middle finger waving a guy past. A car turns right in front of him and the SUV accelerates ahead. Oliver sits with the girls glances back at Sadie and flashes a smile before running off. Sadie grabs her sister. Pete rides through a red light and makes a left between oncoming cars taking a left onto a quiet side street as he soars down a winding hilly road. Pete coasts around a corner and stands upright then accelerates past a group of serious cyclists. Debbie drives with Larry in her SUV. Pete makes a left at an empty intersection and rides past a white picket fence. A car door swings open and a husky man looks down at him then punches Pete in the face. The man easily absorbs Pete's stomach punch then knocks Pete over with one. Debbie drives by gets out and runs to Pete as the man gets in his SUV. Pete writhes in glass sees the dealer license plate and puts his head down as Debbie arrives. The man pulls away. Now in a hospital hallway. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Debbie shakes her head as she sits with Larry. A nurse approaches and steps away giving an incredulous look. She hugs him and he gives her back a fatherly pat as she clings to him. They part and he takes the bill. As he shuffles off Debbie watches him go with a little smile. On the island the hero Jack lies dying with Vincent the dog at his side. Oliver watches with the girls and Joseph. Holding Charlotte close. Oliver lifts his chin. Now in the hospital hallway. a window shows Pete on a bed sporting a bruised swollen eye. Debbie walks in with a sympathetic smile. He waves and she perches beside him on the edge of the bed. Her injured husband regards her gravely and Debbie smiles at him stands and starts to help him up. He winces then swings one leg over the bed and as she tries to help him again Pete sits up and kisses her. They share a tender lingering smooch. Now at a music club a young singer with moppy dark brown hair strums a guitar at the mic. Debbie brings Pete a bottle of beer. setting her own drink down as she faces the stage and takes his hand. Pete shrugs and gives a delighted smile."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He speeds through an intersection continuing onto a busy street as Pete cuts off a car that narrowly avoids him. An SUV pulls up beside him. Back in the kitchen Oliver cleans up outside and Sadie approaches with Joseph. Debbie smiles and Joseph avoids her gaze. Sadie leaves and Joseph follows. Pete speeds down the middle of a street slowing down traffic and holds out his middle finger waving a guy past. A car turns right in front of him and the SUV accelerates ahead. Oliver sits with the girls glances back at Sadie and flashes a smile before running off. Sadie grabs her sister. Pete rides through a red light and makes a left between oncoming cars taking a left onto a quiet side street as he soars down a winding hilly road. a window shows Pete on a bed sporting a bruised swollen eye. Debbie walks in with a sympathetic smile. He waves and she perches beside him on the edge of the bed. Her injured husband regards her gravely and Debbie smiles at him stands and starts to help him up. He winces then swings one leg over the bed and as she tries to help him again Pete sits up and kisses her. They share a tender lingering smooch. Now at a music club a young singer with moppy dark brown hair strums a guitar at the mic. Debbie brings Pete a bottle of beer. setting her own drink down as she faces the stage and takes his hand. Pete shrugs and gives a delighted smile."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He speeds through an intersection continuing onto a busy street as Pete cuts off a car that narrowly avoids him. An SUV pulls up beside him. Back in the kitchen Oliver cleans up outside and Sadie approaches with Joseph. Debbie smiles and Joseph avoids her gaze. Now at a music club a young singer with moppy dark brown hair strums a guitar at the mic. Debbie brings Pete a bottle of beer. setting her own drink down as she faces the stage and takes his hand. Pete shrugs and gives a delighted smile."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The pigeon glides through a meadow, continuing onto a crowded avenue as Ralph knocks over a scooter that narrowly dodges it. A tractor rolls up beside it. Back in the lounge, Marcus tidies up outdoors, and Tabitha meanders with Lucas. Claire grins, and Lucas dodges her stare. Tabitha departs, and Lucas trails behind. Ralph glides down the center of a boulevard, slowing down joggers, and lifts his paw, shooing a raccoon past. A bicycle swerves left in front of it, and the tractor speeds ahead. Marcus lounges with the ladies, peeks back at Tabitha, and beams a grin before darting away. Tabitha seizes her cousin. Ralph glides through a yellow light and takes a right between speeding trolleys, taking a right onto a peaceful alleyway as he flutters down a winding forest path. Ralph drifts around a bend and kneels upright, then zooms past a crowd of focused joggers. Claire cruises with Simon in her tractor. Ralph takes a right at an open meadow and pedals past a rusty lamp post. A mailbox swings open, and a stout otter gazes up at it, then slaps Ralph in the wing. The otter effortlessly absorbs Ralph's tail tap, then topples Ralph over with a tap. Claire drives by, hops out, and sprints to Ralph as the otter hops in his tractor. Ralph wriggles in feathers, notices the builder badge, and lowers his beak as Claire arrives. The otter cruises away. Now, in a library foyer, Claire shakes her head as she lounges with Simon. A tourist approaches and steps back, giving a startled glance. She embraces him, and he gives her back a brotherly squeeze as she clutches him. They part, and he snatches the brochure. As he shuffles off, Claire observes him leave with a little grin. On the farm, the warrior Leo lies napping with Max the cat at his flank. Marcus observes with the ladies and Lucas. Holding Eleanor close, Marcus raises his snout. Now, in the library foyer, a curtain reveals Ralph on a cot flaunting a bandaged, swollen paw. Claire strides in with an empathetic grin. He signals, and she perches next to him on the edge of the cot. Her wounded brother regards her solemnly, and Claire grins at him, rises, and starts to assist him up. He grimaces, then swings one paw over the cot, and as she attempts to assist him again, Ralph sits up and pecks her. They share a soft, lingering peck. Now at a theater club, a young dancer with curly golden mane hums a melody at the mic. Claire offers Ralph a flask of cider, setting her own glass down as she faces the stage and grips his paw. Ralph shrugs and gives an overjoyed grin."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Pete speeds through busy streets, recklessly cutting off cars and waving past a driver, causing chaos. Meanwhile, Oliver cleans up with Sadie and Joseph, while Debbie smiles at Joseph who avoids her gaze. Pete's dangerous ride continues through red lights and winding roads until a man punches him after being hit by a car door. Debbie arrives as the man leaves in his SUV. At the hospital, Debbie and Larry receive news about Pete, sharing a supportive hug before she visits Pete, who is bruised and recovering. They share a tender moment as Pete kisses Debbie. Later, at a music club, Debbie and Pete enjoy a performance together, holding hands as they watch a young singer perform."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Pete shrugs and gives a delighted smile setting her own drink down as she faces the stage and takes his hand Debbie brings Pete a bottle of beer Now at a music club a young singer with moppy dark brown hair strums a guitar at the mic They share a tender lingering smooch He winces then swings one leg over the bed and as she tries to help him again Pete sits up and kisses her Her injured husband regards her gravely and Debbie smiles at him stands and starts to help him up He waves and she perches beside him on the edge of the bed Debbie walks in with a sympathetic smile a window shows Pete on a bed sporting a bruised swollen eye Now in the hospital hallway Oliver lifts his chin Holding Charlotte close Oliver watches with the girls and Joseph On the island the hero Jack lies dying with Vincent the dog at his side As he shuffles off Debbie watches him go with a little smile They part and he takes the bill She hugs him and he gives her back a fatherly pat as she clings to him A nurse approaches and steps away giving an incredulous look Debbie shakes her head as she sits with Larry Now in a hospital hallway The man pulls away Pete writhes in glass sees the dealer license plate and puts his head down as Debbie arrives Debbie drives by gets out and runs to Pete as the man gets in his SUV The man easily absorbs Pete's stomach punch then knocks Pete over with one A car door swings open and a husky man looks down at him then punches Pete in the face Pete makes a left at an empty intersection and rides past a white picket fence Debbie drives with Larry in her SUV Pete coasts around a corner and stands upright then accelerates past a group of serious cyclists Pete rides through a red light and makes a left between oncoming cars taking a left onto a quiet side street as he soars down a winding hilly road Sadie grabs her sister Oliver sits with the girls glances back at Sadie and flashes a smile before running off A car turns right in front of him and the SUV accelerates ahead Pete speeds down the middle of a street slowing down traffic and holds out his middle finger waving a guy past Sadie leaves and Joseph follows Debbie smiles and Joseph avoids her gaze Back in the kitchen Oliver cleans up outside and Sadie approaches with Joseph An SUV pulls up beside him He speeds through an intersection continuing onto a busy street as Pete cuts off a car that narrowly avoids him"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "An SUV pulls up beside him He speeds through an intersection continuing onto a busy street as Pete cuts off a car that narrowly avoids him Debbie smiles and Joseph avoids her gaze Back in the kitchen Oliver cleans up outside and Sadie approaches with Joseph Pete speeds down the middle of a street slowing down traffic and holds out his middle finger waving a guy past Sadie leaves and Joseph follows Oliver sits with the girls glances back at Sadie and flashes a smile before running off A car turns right in front of him and the SUV accelerates ahead Pete rides through a red light and makes a left between oncoming cars taking a left onto a quiet side street as he soars down a winding hilly road Sadie grabs her sister Debbie drives with Larry in her SUV Pete coasts around a corner and stands upright then accelerates past a group of serious cyclists A car door swings open and a husky man looks down at him then punches Pete in the face Pete makes a left at an empty intersection and rides past a white picket fence Debbie drives by gets out and runs to Pete as the man gets in his SUV The man easily absorbs Pete's stomach punch then knocks Pete over with one The man pulls away Pete writhes in glass sees the dealer license plate and puts his head down as Debbie arrives Debbie shakes her head as she sits with Larry Now in a hospital hallway She hugs him and he gives her back a fatherly pat as she clings to him A nurse approaches and steps away giving an incredulous look As he shuffles off Debbie watches him go with a little smile They part and he takes the bill Oliver watches with the girls and Joseph On the island the hero Jack lies dying with Vincent the dog at his side Oliver lifts his chin Holding Charlotte close a window shows Pete on a bed sporting a bruised swollen eye Now in the hospital hallway He waves and she perches beside him on the edge of the bed Debbie walks in with a sympathetic smile He winces then swings one leg over the bed and as she tries to help him again Pete sits up and kisses her Her injured husband regards her gravely and Debbie smiles at him stands and starts to help him up Now at a music club a young singer with moppy dark brown hair strums a guitar at the mic They share a tender lingering smooch setting her own drink down as she faces the stage and takes his hand Debbie brings Pete a bottle of beer Pete shrugs and gives a delighted smile"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "A nurse approaches and steps away giving an incredulous look She hugs him and he gives her back a fatherly pat as she clings to him They part and he takes the bill As he shuffles off Debbie watches him go with a little smile On the island the hero Jack lies dying with Vincent the dog at his side Oliver watches with the girls and Joseph Holding Charlotte close Oliver lifts his chin Now in the hospital hallway a window shows Pete on a bed sporting a bruised swollen eye Debbie walks in with a sympathetic smile He waves and she perches beside him on the edge of the bed Her injured husband regards her gravely and Debbie smiles at him stands and starts to help him up He winces then swings one leg over the bed and as she tries to help him again Pete sits up and kisses her They share a tender lingering smooch Now at a music club a young singer with moppy dark brown hair strums a guitar at the mic Debbie brings Pete a bottle of beer setting her own drink down as she faces the stage and takes his hand Pete shrugs and gives a delighted smile He speeds through an intersection continuing onto a busy street as Pete cuts off a car that narrowly avoids him An SUV pulls up beside him Back in the kitchen Oliver cleans up outside and Sadie approaches with Joseph Debbie smiles and Joseph avoids her gaze Sadie leaves and Joseph follows Pete speeds down the middle of a street slowing down traffic and holds out his middle finger waving a guy past A car turns right in front of him and the SUV accelerates ahead Oliver sits with the girls glances back at Sadie and flashes a smile before running off Sadie grabs her sister Pete rides through a red light and makes a left between oncoming cars taking a left onto a quiet side street as he soars down a winding hilly road Pete coasts around a corner and stands upright then accelerates past a group of serious cyclists Debbie drives with Larry in her SUV Pete makes a left at an empty intersection and rides past a white picket fence A car door swings open and a husky man looks down at him then punches Pete in the face The man easily absorbs Pete's stomach punch then knocks Pete over with one Debbie drives by gets out and runs to Pete as the man gets in his SUV Pete writhes in glass sees the dealer license plate and puts his head down as Debbie arrives The man pulls away Now in a hospital hallway Debbie shakes her head as she sits with Larry"
        }
      ]
    }
  ]
}