{
  "ground_truth": "At the Hilton, Ryan sits in the low-lit bar, savoring a cool drink, as he watches a young woman who is staring at her cellphone with a set of car keys in her other hand. She looks at her key fob and is incredulous. They sit, comparing loyalty cards, and she stares at the card. Alex's eyes sparkle as she studies the concierge key and smiles thoughtfully. Ryan smiles, and they head to a room. Alex is an attractive woman with long, straight auburn hair. Ryan tries a swipe card at a door, but it doesn't open, so he uses another card to open the door, and they go in. Alex, in her 30s, with a curvaceous figure, walks across the room, naked apart from a tie around her waist, and lies on the bed, where the sheets are unruffled. Ryan is laying on cushions on the floor. Alex and Ryan sit facing each other and open their laptop computers, type an entry, and close their computers. Ryan stands by as Alex opens her hotel room door, she turns to him, they kiss, and they smile. She goes inside, closes the door, and he hangs a sign on the handle. Ryan swims in the hotel swimming pool, gets his shoes shined, and hires a car, as Hertz employees swipe his loyalty card through card-reading machines. In a gents outfit, Ryan looks at ties, then takes out his cellphone and looks at the display. Circular fields in various stages of production stretch to the horizon, with the fields being green, brown, and muddy yellow. There are grid pattern city streets, and Ryan arrives in Omaha. In his apartment block, Ryan pulls his case along a hall, lets himself into his small, sparsely furnished apartment, puts his keys on a worktop, pulls back a brown plastic concertina screen, and lays his case on the bed. A young woman comes in holding a large envelope and knocks on the worktop. Ryan takes out a large photo of a hugging couple stuck on a board, she smiles at him fondly and goes, and Ryan looks at the photo of the smiling couple. In a modern office building, the boss, Craig Gregory, has a meeting with Ryan and his colleagues. Prim, ponytailed Natalie stands by a screen, and a guy appears on the screen. Ryan frowns, worried, and goes to see Craig. Ryan smiles bitterly as she sits facing him. Chastised, Natalie sits back and looks down. Later, Craig goes to see Ryan in his office, where Ryan is standing, staring at a map of the U.S. Ryan turns to Craig and raises his eyebrows. Craig curls a piece of paper, holds up a finger, and shakes his head while Ryan screws up the piece of paper and throws it in the bin.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "At the Hilton, Ryan perches in the dimly-lit tavern, enjoying a cool beverage, as he observes a young lady who is gazing at her cellphone with a set of auto keys in her other hand. She glances at her key fob and is skeptical. They sit, comparing loyalty cards, and she gazes at the card. Alex's eyes twinkle as she examines the concierge key and grins pensively. Ryan grins, and they proceed to a chamber. Alex is an appealing lady with long, straight auburn hair. Ryan attempts a swipe card at a portal, but it doesn't unlock, so he uses another card to unlock the portal, and they enter. Alex, in her 30s, with a voluptuous form, walks across the chamber, naked apart from a tie around her waist, and reclines on the bed, where the sheets are unruffled. Ryan is reclining on cushions on the floor. Alex and Ryan sit facing each other and open their laptop computers, type an entry, and close their computers. Ryan stands by as Alex opens her hotel chamber door, she turns to him, they kiss, and they grin. She goes inside, closes the door, and he hangs a placard on the handle. Ryan swims in the hotel swimming basin, gets his footwear polished, and rents a car, as Hertz employees swipe his loyalty card through card-reading machines. In a men's outfit, Ryan glances at ties, then takes out his cellphone and examines the display. Circular fields in various stages of production extend to the horizon, with the fields being green, brown, and muddy yellow. There are grid pattern city thoroughfares, and Ryan arrives in Omaha. In his apartment block, Ryan pulls his case along a corridor, lets himself into his small, sparsely furnished apartment, places his keys on a countertop, pulls back a brown plastic concertina screen, and lays his case on the bed. A young lady comes in holding a large envelope and taps on the countertop. Ryan takes out a large photograph of a hugging duo stuck on a board, she smiles at him fondly and goes, and Ryan examines the photograph of the smiling duo. In a modern office building, the superior, Craig Gregory, has a meeting with Ryan and his associates. Prim, ponytailed Natalie stands by a screen, and a guy appears on the screen. Ryan frowns, troubled, and goes to see Craig. Ryan smiles bitterly as she sits facing him. Chastised, Natalie sits back and looks down. Later, Craig goes to see Ryan in his office, where Ryan is standing, gazing at a map of the U.S. Ryan turns to Craig and raises his eyebrows. Craig curls a sheet of paper, holds up a digit, and shakes his head while Ryan crumples the sheet of paper and throws it in the bin."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "At the Hilton, a cool drink is savored by Ryan as the low-lit bar is sat in by him, and a young woman is watched by him, who is staring at her cellphone with a set of car keys in her other hand. Her key fob is looked at by her, and disbelief is felt by her. They sit, comparing loyalty cards, and the card is stared at by her. Alex's eyes sparkle as she studies the concierge key and smiles thoughtfully. Ryan smiles, and they head to a room. An attractive woman with long, straight auburn hair is Alex. A swipe card is tried at a door by Ryan, but it doesn't open, so another card is used by him to open the door, and they go in. With a curvaceous figure, Alex, in her 30s, walks across the room, naked apart from a tie around her waist, and lies on the bed, where the sheets remain unruffled. On cushions on the floor, Ryan is laying. Facing each other, Alex and Ryan open their laptop computers, type an entry, and close their computers. Ryan stands by as her hotel room door is opened by Alex; she turns to him, they kiss, and smiles are exchanged by them. She goes inside, the door is closed by her, and a sign is hung on the handle by him. The hotel swimming pool is swum in by Ryan, his shoes are shined, and a car is hired by him, as his loyalty card is swiped by Hertz employees through card-reading machines. In a gents outfit, ties are looked at by Ryan, then he takes out his cellphone and looks at the display. Circular fields, in various stages of production, stretch to the horizon, and the fields are green, brown, and muddy yellow. There are grid pattern city streets, and Ryan arrives in Omaha. In his apartment block, his case is pulled along a hall by Ryan, who lets himself into his small, sparsely furnished apartment, puts his keys on a worktop, pulls back a brown plastic concertina screen, and lays his case on the bed. Holding a large envelope, a young woman comes in and knocks on the worktop. Ryan takes out a large photo of a hugging couple stuck on a board; she smiles at him fondly and goes, and the photo of the smiling couple is looked at by Ryan. In a modern office building, Ryan and his colleagues are met by the boss, Craig Gregory. Prim, ponytailed Natalie stands by a screen, and a guy appears on the screen. Ryan frowns, feeling worried, and he goes to see Craig. Ryan smiles bitterly as she sits facing him. Chastised, Natalie sits back and looks down. Later, Ryan is seen by Craig in his office, where Ryan is standing, staring at a map of the U.S. Ryan turns to Craig and raises his eyebrows. A piece of paper is curled by Craig, a finger is held up by him, and his head is shaken while the piece of paper is screwed up by Ryan and thrown in the bin."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "At the Hilton, Ryan savors a drink in the dim bar, observing a young woman with car keys and a cellphone. They compare loyalty cards; Alex studies the concierge key and smiles. Alex, an attractive woman with long auburn hair, and Ryan head to a room. He uses a swipe card and opens the door. Alex, in her 30s, with a curvy figure, lies on the bed wearing only a tie. Ryan reclines on floor cushions. They sit, face each other, type on laptops, then close them. At her hotel room door, Alex and Ryan kiss before she enters and he hangs a sign on the handle. Ryan swims, gets his shoes shined, and hires a car as Hertz employees swipe his loyalty card. In a men's shop, he looks at ties and checks his cellphone. Circular fields in green, brown, and yellow stretch to the horizon. Ryan arrives in Omaha, enters his sparse apartment, and places his keys on the worktop. A young woman delivers a large envelope. Ryan views a photo of a smiling couple. In a modern office, boss Craig Gregory meets with Ryan and colleagues. Natalie, prim with a ponytail, stands by a screen. Ryan frowns, worried, and talks to Craig. Natalie, chastised, sits back. Later, Craig visits Ryan, who stares at a U.S. map. Ryan raises his eyebrows at Craig, who shakes his head as Ryan crumples a piece of paper and tosses it into the bin."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "At the Hilton, Ryan enjoys a drink in a dim bar, watching a woman with her cellphone and car keys. They compare loyalty cards, and Alex smiles at a concierge key. Ryan struggles with a swipe card before they enter a room. Alex, an attractive woman in her 30s, lies on the bed with just a tie. They work on laptops, then kiss as she enters her room. Ryan swims, shines shoes, and rents a car using his loyalty card, visits a clothing store, and checks his phone. Fields and city streets stretch to Omaha. In his apartment, Ryan unpacks, greeted by a young woman with an envelope. She smiles at a photo of a couple. At work, boss Craig Gregory meets Ryan and colleagues. Natalie stands by a screen, and Ryan is concerned. He later meets with Craig, who gestures disapproval as Ryan discards a paper."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "At the elegantly designed Hilton, Ryan finds himself comfortably seated in the dimly lit ambiance of the bar. Here, he leisurely enjoys sipping on a refreshingly cool drink while his eyes are drawn to a young woman nearby. She is deeply absorbed in staring at her cellphone, clutching a set of car keys in her other hand. Her gaze shifts to her key fob, and an expression of disbelief crosses her face. They remain seated, engaging in a casual comparison of their respective loyalty cards, as she intently examines the card in her hand. Alex's eyes twinkle with interest and amusement as she carefully studies the concierge key, and a thoughtful smile plays across her lips. Ryan shares in her amusement, smiling back, and together they make their way to a room. Alex, a strikingly attractive woman in her 30s with long, straight auburn hair and a captivating figure, gracefully walks across the room. She is unclothed except for a tie draped around her waist, and she reclines on the bed where the sheets remain smooth and unwrinkled. Meanwhile, Ryan is relaxed, lying comfortably on cushions on the floor. The two of them sit facing each other, each opening their laptop computers and typing an entry before closing their devices. \n\nRyan remains standing by as Alex opens the door to her hotel room. She turns to him, and they share a tender kiss, exchanging smiles before she steps inside and closes the door behind her. He hangs a sign discreetly on the door handle as he leaves. Ryan takes a leisurely swim in the hotel's inviting swimming pool, gets his shoes professionally shined, and proceeds to hire a car. Hertz employees efficiently swipe his loyalty card through the card-reading machines in a seamless transaction. \n\nIn a refined gentlemen’s outfit store, Ryan browses through an array of ties, taking a moment to pull out his cellphone and inspect the display. The landscape stretches out before him in a breathtaking view of circular fields at various stages of production, creating a mosaic of green, brown, and muddy yellow hues reaching toward the horizon. The city streets, laid out in a precise grid pattern, guide Ryan as he eventually arrives in Omaha. Within his apartment block, Ryan navigates the hallway, pulling his luggage along with him. He lets himself into his modest and sparsely furnished apartment, where he places his keys on the worktop, draws back a brown plastic concertina screen, and sets his case on the bed. A young woman soon enters, holding a large envelope, and she gives a gentle knock on the worktop. Ryan retrieves a sizable photo of a couple hugging, mounted on a board. She smiles at him warmly and departs, leaving Ryan to gaze thoughtfully at the image of the smiling couple. \n\nIn the sleek setting of a modern office building, the boss, Craig Gregory, conducts a meeting with Ryan and his colleagues. Nearby, Natalie, who is primly dressed and sporting a ponytail, stands by a screen as a man’s image appears on it. Ryan's face shows concern as he frowns, troubled, and subsequently seeks out Craig. With a wry smile, Ryan looks on as she sits in front of him, visibly chastised, Natalie retreats into her seat and lowers her gaze. Later on, Craig makes his way to Ryan’s office, where Ryan is absorbed in scrutinizing a map of the U.S. With a meaningful glance, Ryan turns to Craig, raising his eyebrows in inquiry. Craig, curling a piece of paper in his hand, lifts a finger and shakes his head in disapproval. In response, Ryan crumples the paper and discards it into the trash bin with a decisive motion."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "At the elegantly designed and stylish Hilton hotel, Ryan finds himself comfortably seated within the dimly lit and cozy ambiance of the sophisticated bar. Here, he leisurely indulges in the pleasure of sipping on a refreshingly cool drink, all the while his eyes are irresistibly drawn to a young woman situated nearby. She appears deeply absorbed and engrossed in staring at her cellphone, while at the same time clutching a set of car keys in her other hand. Her gaze eventually shifts to her key fob, and an expression of disbelief momentarily crosses her face. They both remain seated, casually engaging in a lighthearted comparison of their respective loyalty cards. She intently examines the card in her hand, and Alex’s eyes twinkle with a mix of interest and amusement as she carefully studies the concierge key. A thoughtful smile dances across her lips. Ryan shares in her amusement, smiling back warmly, and together they proceed to make their way to a room. Alex, an undeniably strikingly attractive woman in her 30s, possessing long, straight auburn hair and a captivating figure, gracefully walks across the room. She is unclothed except for a tie that is elegantly draped around her waist, and she reclines on the bed where the sheets remain perfectly smooth and unwrinkled. Meanwhile, Ryan is relaxed and at ease, lying comfortably on cushions situated on the floor. The two of them sit facing each other, each one opening their respective laptop computers and typing an entry before closing their devices with a decisive snap.\n\nRyan remains standing by attentively as Alex opens the door to her hotel room. She turns to him, and they share a tender, heartfelt kiss, exchanging warm smiles before she steps inside and closes the door softly behind her. He hangs a discreet sign on the door handle as he leaves, ensuring privacy. Ryan then takes a leisurely swim in the hotel's inviting and refreshing swimming pool, gets his shoes professionally shined to a gleaming finish, and proceeds to hire a car. The Hertz employees efficiently swipe his loyalty card through the card-reading machines, completing the transaction with seamless precision.\n\nIn a refined gentlemen’s outfit store, Ryan browses thoughtfully through an extensive array of ties, taking a moment to pull out his cellphone and inspect the display carefully. The landscape stretches out before him in a breathtakingly picturesque view of circular fields at various stages of production, creating a mosaic of lush green, earthy brown, and muddy yellow hues that reach toward the distant horizon. The city streets, laid out in a precise and orderly grid pattern, guide Ryan as he eventually arrives in Omaha. Within his apartment block, Ryan navigates the hallway with ease, pulling his luggage along beside him. He lets himself into his modest and sparsely furnished apartment, where he places his keys on the worktop, draws back a brown plastic concertina screen, and sets his case gently on the bed. A young woman soon enters, holding a large envelope, and she gives a gentle knock on the worktop. Ryan retrieves a sizable photo of a couple hugging, mounted thoughtfully on a board. She smiles at him warmly and departs, leaving Ryan to gaze contemplatively at the image of the smiling couple.\n\nIn the sleek and modern setting of a cutting-edge office building, the boss, Craig Gregory, conducts an important meeting with Ryan and his colleagues. Nearby, Natalie, who is primly dressed and sporting a neatly arranged ponytail, stands by a screen as a man’s image appears on it. Ryan's face shows a deep concern as he frowns, visibly troubled, and subsequently takes the initiative to seek out Craig. With a wry smile, Ryan looks on as she sits in front of him, visibly chastised; Natalie retreats into her seat and lowers her gaze in submission. Later on, Craig makes his way purposefully to Ryan’s office, where Ryan is absorbed in meticulously scrutinizing a detailed map of the U.S. With a meaningful glance, Ryan turns to Craig, raising his eyebrows in silent inquiry. Craig, curling a piece of paper in his hand, lifts a finger and shakes his head in disapproval. In response, Ryan crumples the paper decisively and discards it into the trash bin with a definitive motion."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "At the dimly lit bar of the Hilton, Ryan sits back in his chair, savoring each sip of his cool drink with a relaxed demeanor, his eyes casually drifting to a young woman seated nearby. She intently stares at the screen of her cellphone, balancing a set of car keys in her other hand with a firm grip. Her gaze shifts to the key fob, and a flicker of incredulity crosses her features as she processes what she sees. As they both remain seated, they engage in the subtle activity of comparing their loyalty cards, with the woman fixating on the card in her hand, studying it intently. Alex's eyes light up with a sparkle as she takes in the details of a concierge key, and a thoughtful smile gently graces her lips. Ryan responds with a smile of his own, and together, they rise from their seats and make their way toward a room. Alex, whose attractiveness is accentuated by her long, straight auburn hair, follows Ryan as he produces a swipe card and attempts to open the door. When the door refuses to budge, he smoothly retrieves another card, successfully gains entry, and they proceed inside. Alex, now wearing nothing but a tie draped around her waist, moves with confidence across the room, her curvaceous figure accentuated as she gracefully settles herself onto the bed, where the sheets remain untouched and pristine. Ryan chooses a spot on the floor, making himself comfortable on a pile of cushions. In a moment of shared focus, Alex and Ryan position themselves opposite each other, opening their respective laptop computers, typing an entry with determined fingers, and then decisively closing their computers. Ryan stands by attentively as Alex approaches her hotel room door; she pauses, turning back to him to share a lingering kiss, their smiles reflecting mutual affection. As she retreats into her room and closes the door behind her, Ryan discreetly hangs a sign on the door handle. Later, Ryan immerses himself in the refreshing waters of the hotel swimming pool, enjoys the attention of having his shoes shined to a polished gleam, and proceeds to hire a car with the assistance of Hertz employees who efficiently swipe his loyalty card through their card-reading machines. In a men's outfitting store, Ryan peruses an array of ties, carefully considering each choice, before pulling out his cellphone to glance at the display. Meanwhile, the landscape unfolds with circular fields in various stages of production stretching endlessly toward the horizon, displaying a patchwork of green, brown, and muddy yellow hues. The structured grid of city streets leads Ryan to his arrival in Omaha, where, within the confines of his apartment block, he wheels his suitcase along the hall, unlocks the door to his modest, sparsely furnished apartment, and places his keys on the worktop. He then draws back a brown plastic concertina screen, setting his suitcase on the bed with a sense of routine. A young woman enters, carrying a large envelope, and taps it lightly on the worktop to get his attention. Ryan retrieves a large photo of a couple embracing, mounted on a board, while she smiles at him with fondness before taking her leave. Ryan's eyes linger on the photo of the smiling couple, contemplating the image with a quiet reflection. In the bustling environment of a modern office building, the boss, Craig Gregory, conducts a meeting with Ryan and his colleagues, as prim and ponytailed Natalie stands next to a screen, which displays the image of a guy who suddenly appears. Concern etches itself onto Ryan's face as he frowns, a sense of worry prompting him to seek out Craig. Ryan's expression twists into a bitter smile as he takes a seat opposite Craig, who sits facing him. Feeling chastised, Natalie reclines in her seat, her gaze dropping in introspection. Later, Craig visits Ryan in his office, where Ryan stands, absorbed in contemplation of a U.S. map. As Ryan turns to Craig, he raises his eyebrows inquisitively. In response, Craig curls a piece of paper in one hand, lifting a finger in a gesture of denial, shaking his head subtly. Resigned, Ryan crumples the paper with a swift motion and disposes of it in the bin, marking the end of their interaction."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "At the Hilton, Ryan sits in the low-lit bar, enjoying a drink while observing a young woman engrossed in her cellphone, holding car keys. They exchange loyalty cards, and she is surprised by the concierge key. After sharing smiles, they proceed to a room together. Despite a failed attempt with one swipe card, Ryan successfully opens the door with another, and they enter. Alex, an attractive woman in her 30s with auburn hair, undresses except for a tie and reclines on the bed. Meanwhile, Ryan lays on the floor cushions. They sit facing each other, briefly use their laptops, then close them. As Ryan stands by, Alex opens her hotel room door, and they share a kiss and a smile before she goes inside. Ryan leaves a sign on her door handle, then enjoys various hotel amenities: swimming, shoe shining, and renting a car with his loyalty card. At a gents outfitters, he examines ties and checks his cellphone. The landscape transitions to grid pattern city streets as Ryan arrives in Omaha. He enters his sparsely furnished apartment, puts down his keys, and unpacks. A young woman delivers a large envelope; inside is a photo of a smiling couple. She leaves with a fond smile, and Ryan reflects on the photo. At a modern office, Ryan meets with boss Craig Gregory and colleagues, including Natalie. Natalie stands by a screen as a guy appears onscreen, prompting Ryan to frown and meet privately with Craig. Later, Craig visits Ryan, who is contemplating a U.S. map. In a silent exchange, Craig gestures no to Ryan’s unspoken question, leading Ryan to throw a crumpled paper into the bin."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "At the Hilton, a renowned hotel chain known for its luxury and hospitality, Ryan sits in the low-lit bar, savoring a cool drink, as he watches a young woman who is staring at her cellphone with a set of car keys in her other hand. She looks at her key fob, a modern convenience for keyless car entry, and is incredulous. They sit, comparing loyalty cards, like the ones offered by many hotel chains for frequent travelers, and she stares at the card. Alex's eyes sparkle as she studies the concierge key, a symbol of exclusive access to premium hotel services, and smiles thoughtfully. Ryan smiles, and they head to a room. Alex is an attractive woman with long, straight auburn hair, reminiscent of the rich color often associated with autumn leaves. Ryan tries a swipe card at a door, a common electronic security measure in upscale hotels, but it doesn't open, so he uses another card to open the door, and they go in. Alex, in her 30s, with a curvaceous figure, walks across the room, naked apart from a tie around her waist, and lies on the bed, where the sheets are unruffled as if freshly made by diligent housekeeping staff. Ryan is laying on cushions on the floor. Alex and Ryan sit facing each other and open their laptop computers, type an entry, and close their computers, possibly reviewing work-related information or personal projects. Ryan stands by as Alex opens her hotel room door, she turns to him, they kiss, a gesture of departure, and they smile. She goes inside, closes the door, and he hangs a sign on the handle, signaling 'Do Not Disturb.' Ryan swims in the hotel swimming pool, a standard amenity for guest relaxation, gets his shoes shined, a service often provided in high-end hotels, and hires a car from Hertz, a leading car rental company, as employees swipe his loyalty card through card-reading machines to earn points. In a gents outfit, Ryan looks at ties, then takes out his cellphone and looks at the display, possibly checking for messages or updates. Circular fields in various stages of production, typical of Nebraska's agricultural landscape, stretch to the horizon, with the fields being green, brown, and muddy yellow. There are grid pattern city streets, indicative of urban planning in American cities, and Ryan arrives in Omaha, a city known for its rich pioneer history and as a hub for finance and insurance. In his apartment block, Ryan pulls his case along a hall, lets himself into his small, sparsely furnished apartment, puts his keys on a worktop, pulls back a brown plastic concertina screen, and lays his case on the bed. A young woman comes in holding a large envelope and knocks on the worktop. Ryan takes out a large photo of a hugging couple stuck on a board, she smiles at him fondly and goes, and Ryan looks at the photo of the smiling couple, possibly reflecting on personal relationships. In a modern office building, the boss, Craig Gregory, has a meeting with Ryan and his colleagues. Prim, ponytailed Natalie stands by a screen, and a guy appears on the screen, perhaps joining via a video call, a common practice in corporate settings. Ryan frowns, worried, and goes to see Craig. Ryan smiles bitterly as she sits facing him. Chastised, Natalie sits back and looks down, indicative of a reprimand from the boss. Later, Craig goes to see Ryan in his office, where Ryan is standing, staring at a map of the U.S., likely contemplating travel or business strategy. Ryan turns to Craig and raises his eyebrows, seeking clarification or direction. Craig curls a piece of paper, holds up a finger, and shakes his head while Ryan screws up the piece of paper and throws it in the bin, a sign of disagreement or discarded plans."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "She looks at her key fob and is incredulous At the Hilton Ryan sits in the lowlit bar savoring a cool drink as he watches a young woman who is staring at her cellphone with a set of car keys in her other hand Ryan is laying on cushions on the floor She looks at her key fob and is incredulous Ryan takes out a large photo of a hugging couple stuck on a board They sit comparing loyalty cards and she stares at the card Alex's eyes sparkle as she studies the concierge key and smiles thoughtfully Ryan smiles and they head to a room Alex is an attractive woman with long straight auburn hair Ryan tries a swipe card at a door but it does not open so he uses another card to open the door and they go in Later Craig goes to see Ryan in his office where Ryan is standing staring at a map of the US Alex in her 30s with a curvaceous figure walks across the room naked apart from a tie around her waist and lies on the bed where the sheets are unruffled Ryan is laying on cushions on the floor Alex and Ryan sit facing each other and open their laptop computers type an entry and close their computers Ryan frowns worried and goes to see Craig Ryan stands by as Alex opens her hotel room door In his apartment block Ryan pulls his case along a hall she turns to him they kiss and they smile Alex's eyes sparkle as she studies the concierge key and smiles thoughtfully Ryan swims in the hotel swimming pool gets his shoes shined and hires a car as Hertz employees swipe his loyalty card through cardreading machines At the Hilton Ryan sits in the lowlit bar savoring a cool drink as he watches a young woman who is staring at her cellphone with a set of car keys in her other hand She goes inside closes the door and he hangs a sign on the handle Ryan swims in the hotel swimming pool gets his shoes shined and hires a car as Hertz employees swipe his loyalty card through cardreading machines In a gents outfit Ryan looks at ties then takes out his cellphone and looks at the display Circular fields in various stages of production stretch to the horizon with the fields being green brown and muddy yellow There are grid pattern city streets and Ryan arrives in Omaha In his apartment block Ryan pulls his case along a hall let us himself into his small sparsely furnished apartment puts his keys on a worktop pulls back a brown plastic concertina screen and lays his case on the bed A young woman comes in holding a large envelope and knocks on the worktop Ryan takes out a large photo of a hugging couple stuck on a board Ryan turns to Craig and raises his eyebrows They sit comparing loyalty cards and she stares at the card she smiles at him fondly and goes and Ryan looks at the photo of the smiling couple In a modern office building the boss Craig Gregory has a meeting with Ryan and his colleagues Prim ponytailed Natalie stands by a screen and a guy appears on the screen Ryan frowns worried and goes to see Craig Ryan smiles bitterly as she sits facing him Chastised Natalie sits back and looks down Later Craig goes to see Ryan in his office where Ryan is standing staring at a map of the US Ryan turns to Craig and raises his eyebrows let us himself into his small sparsely furnished apartment puts his keys on a worktop pulls back a brown plastic concertina screen and lays his case on the bed Ryan smiles and they head to a room Prim ponytailed Natalie stands by a screen and a guy appears on the screen Craig curls a piece of paper holds up a finger and shakes his head while Ryan screws up the piece of paper and throws it in the bin Alex in her 30s with a curvaceous figure walks across the room naked apart from a tie around her waist and lies on the bed where the sheets are unruffled"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "At the Hilton Ryan sits in the lowlit bar savoring a cool drink as he watches a young woman who is staring at her cellphone with a set of car keys in her other hand. She looks at her key fob and is incredulous. They sit comparing loyalty cards and she stares at the card. Alex's eyes sparkle as she studies the concierge key and smiles thoughtfully. Ryan smiles and they head to a room. Alex is an attractive woman with long straight auburn hair. Ryan tries a swipe card at a door but it does not open so he uses another card to open the door and they go in. Alex in her 30s with a curvaceous figure walks across the room naked apart from a tie around her waist and lies on the bed where the sheets are unruffled. Ryan is laying on cushions on the floor. Alex and Ryan sit facing each other and open their laptop computers type an entry and close their computers. Ryan stands by as Alex opens her hotel room door. she turns to him they kiss and they smile. She goes inside closes the door and he hangs a sign on the handle. Ryan swims in the hotel swimming pool gets his shoes shined and hires a car as Hertz employees swipe his loyalty card through cardreading machines. In a gents outfit Ryan looks at ties then takes out his cellphone and looks at the display. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Circular fields in various stages of production stretch to the horizon with the fields being green brown and muddy yellow. There are grid pattern city streets and Ryan arrives in Omaha. In his apartment block Ryan pulls his case along a hall. let us himself into his small sparsely furnished apartment puts his keys on a worktop pulls back a brown plastic concertina screen and lays his case on the bed. A young woman comes in holding a large envelope and knocks on the worktop. Ryan takes out a large photo of a hugging couple stuck on a board. she smiles at him fondly and goes and Ryan looks at the photo of the smiling couple. In a modern office building the boss Craig Gregory has a meeting with Ryan and his colleagues. Prim ponytailed Natalie stands by a screen and a guy appears on the screen. Ryan frowns worried and goes to see Craig. Ryan smiles bitterly as she sits facing him. Chastised Natalie sits back and looks down. Later Craig goes to see Ryan in his office where Ryan is standing staring at a map of the US. Ryan turns to Craig and raises his eyebrows. Craig curls a piece of paper holds up a finger and shakes his head while Ryan screws up the piece of paper and throws it in the bin."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "At the Hilton Ryan sits in the lowlit bar savoring a cool drink as he watches a young woman who is staring at her cellphone with a set of car keys in her other hand. She looks at her key fob and is incredulous. They sit comparing loyalty cards and she stares at the card. Alex's eyes sparkle as she studies the concierge key and smiles thoughtfully. Ryan smiles and they head to a room. Alex is an attractive woman with long straight auburn hair. Ryan tries a swipe card at a door but it does not open so he uses another card to open the door and they go in. Alex in her 30s with a curvaceous figure walks across the room naked apart from a tie around her waist and lies on the bed where the sheets are unruffled. Ryan is laying on cushions on the floor. Alex and Ryan sit facing each other and open their laptop computers type an entry and close their computers. Ryan stands by as Alex opens her hotel room door. she turns to him they kiss and they smile. She goes inside closes the door and he hangs a sign on the handle. Ryan swims in the hotel swimming pool gets his shoes shined and hires a car as Hertz employees swipe his loyalty card through cardreading machines. In a gents outfit Ryan looks at ties then takes out his cellphone and looks at the display. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Circular fields in various stages of production stretch to the horizon with the fields being green brown and muddy yellow. There are grid pattern city streets and Ryan arrives in Omaha. In his apartment block Ryan pulls his case along a hall. let us himself into his small sparsely furnished apartment puts his keys on a worktop pulls back a brown plastic concertina screen and lays his case on the bed. A young woman comes in holding a large envelope and knocks on the worktop. Ryan takes out a large photo of a hugging couple stuck on a board. she smiles at him fondly and goes and Ryan looks at the photo of the smiling couple. In a modern office building the boss Craig Gregory has a meeting with Ryan and his colleagues. Prim ponytailed Natalie stands by a screen and a guy appears on the screen. Ryan frowns worried and goes to see Craig. Ryan smiles bitterly as she sits facing him. Chastised Natalie sits back and looks down. Later Craig goes to see Ryan in his office where Ryan is standing staring at a map of the US. Ryan turns to Craig and raises his eyebrows. Craig curls a piece of paper holds up a finger and shakes his head while Ryan screws up the piece of paper and throws it in the bin."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "At the Hilton Ryan sits in the lowlit bar savoring a cool drink as he watches a young woman who is staring at her cellphone with a set of car keys in her other hand. She looks at her key fob and is incredulous. They sit comparing loyalty cards and she stares at the card. Alex's eyes sparkle as she studies the concierge key and smiles thoughtfully. Ryan smiles and they head to a room. Alex is an attractive woman with long straight auburn hair. Ryan tries a swipe card at a door but it does not open so he uses another card to open the door and they go in. Alex in her 30s with a curvaceous figure walks across the room naked apart from a tie around her waist and lies on the bed where the sheets are unruffled. Prim ponytailed Natalie stands by a screen and a guy appears on the screen. Ryan frowns worried and goes to see Craig. Ryan smiles bitterly as she sits facing him. Chastised Natalie sits back and looks down. Later Craig goes to see Ryan in his office where Ryan is standing staring at a map of the US. Ryan turns to Craig and raises his eyebrows. Craig curls a piece of paper holds up a finger and shakes his head while Ryan screws up the piece of paper and throws it in the bin."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "At the Hilton Ryan sits in the lowlit bar savoring a cool drink as he watches a young woman who is staring at her cellphone with a set of car keys in her other hand. She looks at her key fob and is incredulous. They sit comparing loyalty cards and she stares at the card. Later Craig goes to see Ryan in his office where Ryan is standing staring at a map of the US. Ryan turns to Craig and raises his eyebrows. Craig curls a piece of paper holds up a finger and shakes his head while Ryan screws up the piece of paper and throws it in the bin."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "At the Hilton, the dog sits in the low-lit bar, savoring a cool drink, as it watches a young bird who is staring at her cellphone with a set of car keys in her other hand. The bird looks at her key fob and is incredulous. They sit, comparing loyalty cards, and the bird stares at the card. The tree's eyes sparkle as it studies the concierge key and smiles thoughtfully. The dog smiles, and they head to a room. The tree is an attractive woman with long, straight auburn hair. The dog tries a swipe card at a door, but it doesn't open, so it uses another card to open the door, and they go in. The tree, in its 30s, with a curvaceous figure, walks across the room, naked apart from a tie around its waist, and lies on the bed, where the sheets are unruffled. The dog is laying on cushions on the floor. The tree and the dog sit facing each other and open their laptop computers, type an entry, and close their computers. The dog stands by as the tree opens her hotel room door, it turns to him, they kiss, and they smile. It goes inside, closes the door, and he hangs a sign on the handle. The dog swims in the hotel swimming pool, gets his shoes shined, and hires a car, as monkeys swipe his loyalty card through card-reading machines. In a gents outfit, the dog looks at ties, then takes out its cellphone and looks at the display. Circular fields in various stages of production stretch to the horizon, with the fields being green, brown, and muddy yellow. There are grid pattern city streets, and the dog arrives in Omaha. In its apartment block, the dog pulls its case along a hall, lets itself into its small, sparsely furnished apartment, puts its keys on a worktop, pulls back a brown plastic concertina screen, and lays its case on the bed. A young monkey comes in holding a large envelope and knocks on the worktop. The dog takes out a large photo of a hugging couple stuck on a board, the monkey smiles at him fondly and goes, and the dog looks at the photo of the smiling couple. In a modern office building, the dolphin, Craig Gregory, has a meeting with the dog and its colleagues. Prim, ponytailed Natalie stands by a screen, and a kangaroo appears on the screen. The dog frowns, worried, and goes to see Craig. The dog smiles bitterly as it sits facing him. Chastised, Natalie sits back and looks down. Later, the dolphin goes to see the dog in its office, where the dog is standing, staring at a map of the U.S. The dog turns to the dolphin and raises its eyebrows. The dolphin curls a piece of paper, holds up a finger, and shakes its head while the dog screws up the piece of paper and throws it in the bin."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "At the Marriott, Ryan sits in the dimly lit lounge, savoring a fizzy beverage, as he watches a young woman who is staring at her tablet with a set of headphones in her other hand. She looks at her watch and is incredulous. They sit, comparing membership cards, and she stares at the card. Alex's eyes sparkle as she studies the doorman's badge and smiles thoughtfully. Ryan smiles, and they head to a suite. Alex is an attractive woman with long, straight blonde hair. Ryan tries a key card at a cupboard, but it doesn't open, so he uses another card to open the cupboard, and they go in. Alex, in her 30s, with a lean figure, walks across the suite, naked apart from a scarf around her waist, and lies on the couch, where the cushions are unruffled. Ryan is laying on pillows on the carpet. Alex and Ryan sit facing each other and open their tablets, type an entry, and close their tablets. Ryan stands by as Alex opens her suite door, she turns to him, they kiss, and they smile. She goes inside, closes the door, and he hangs a tag on the handle. Ryan swims in the hotel hot tub, gets his glasses cleaned, and hires a bike, as rental employees swipe his membership card through card-reading machines. In a department store, Ryan looks at hats, then takes out his smartwatch and looks at the display. Elliptical gardens in various stages of growth stretch to the horizon, with the gardens being green, sandy, and rusty orange. There are maze-like village paths, and Ryan arrives in Lincoln. In his condo complex, Ryan pulls his backpack along a corridor, lets himself into his tiny, sparsely decorated condo, puts his headphones on a countertop, pulls back a gray fabric divider, and lays his backpack on the couch. A young woman comes in holding a small parcel and knocks on the countertop. Ryan takes out a small painting of a dancing couple stuck on a canvas, she smiles at him fondly and goes, and Ryan looks at the painting of the smiling couple. In a modern office tower, the boss, Craig Gregory, has a meeting with Ryan and his teammates. Prim, ponytailed Natalie stands by a projector, and a guy appears on the projector. Ryan frowns, worried, and goes to see Craig. Ryan smiles bitterly as she sits facing him. Chastised, Natalie sits back and looks down. Later, Craig goes to see Ryan in his workspace, where Ryan is standing, staring at a map of Europe. Ryan turns to Craig and raises his eyebrows. Craig curls a piece of fabric, holds up a finger, and shakes his head while Ryan screws up the piece of fabric and throws it in the bin."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "At the Hilton, Ryan lounges in the low-lit bar, humming to a cool drink, as he observes a young woman who is doodling on her cellphone with a set of car keys in her other hand. She glances at her key fob and is bemused. They remain, discussing loyalty cards, and she glances at the card. Alex's eyes gleam as she sketches the concierge key and chuckles thoughtfully. Ryan laughs, and they wander to a room. Alex is an attractive woman with long, straight auburn hair. Ryan tosses a swipe card at a door, but it doesn't open, so he waves another card to open the door, and they enter. Alex, in her 30s, with a curvaceous figure, dances across the room, clothed apart from a tie around her waist, and jumps on the bed, where the sheets are pristine. Ryan is reclining on cushions on the floor. Alex and Ryan stand facing each other and unfold their laptop computers, draw an entry, and snap their computers shut. Ryan kneels by as Alex locks her hotel room door, she turns to him, they embrace, and they grin. She steps inside, locks the door, and he dangles a sign on the handle. Ryan floats in the hotel swimming pool, polishes his shoes, and buys a car, as Hertz employees trace his loyalty card through card-reading machines. In a gents outfit, Ryan admires ties, then reaches for his cellphone and listens to the display. Circular fields in various stages of production scatter to the horizon, with the fields being green, brown, and muddy yellow. There are winding city streets, and Ryan lands in Omaha. In his apartment block, Ryan pushes his case along a hall, enters himself into his small, sparsely furnished apartment, drops his keys on a worktop, slides back a brown plastic concertina screen, and places his case on the bed. A young woman bursts in holding a large envelope and taps on the worktop. Ryan takes out a large photo of a hugging couple mounted on a board, she nods at him fondly and exits, and Ryan studies the photo of the smiling couple. In a modern office building, the boss, Craig Gregory, has a discussion with Ryan and his colleagues. Prim, ponytailed Natalie stands by a screen, and a guy materializes on the screen. Ryan squints, anxious, and marches to see Craig. Ryan chuckles bitterly as she lounges facing him. Chastised, Natalie sinks back and gazes down. Later, Craig strides to see Ryan in his office, where Ryan is sitting, scrutinizing a map of the U.S. Ryan rotates to Craig and tilts his eyebrows. Craig rolls a piece of paper, extends a finger, and nods while Ryan crumples the piece of paper and drops it in the bin."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "At the Diner, a sock sits in the neon-lit kitchen, savoring a steaming pie, as it watches a young dog who is staring at a camera with a bouquet of flowers in its other paw. It looks at its leash and is incredulous. They sit, comparing seashells, and it stares at the shell. A bucket's eyes sparkle as it studies the gardener's rake and smiles thoughtfully. The sock smiles, and they head to a tent. The bucket is an attractive cat with long, curly purple fur. The sock tries a feather duster at a gate, but it doesn't open, so it uses another feather duster to open the gate, and they go in. The bucket, in its 50s, with a slender trunk, walks across the tent, naked apart from a ribbon around its waist, and lies on the rug, where the leaves are unscattered. The sock is laying on balloons on the roof. The bucket and the sock sit facing each other and open their game consoles, type an entry, and close their consoles. The sock stands by as the bucket opens its tent flap, it turns to it, they bark, and they smile. It goes inside, closes the flap, and it hangs a ribbon on the latch. The sock floats in the garden pond, gets its sandals polished, and hires a kite, as Sparky employees swipe its stone slate through slate-reading machines. In a ladies outfit, the sock looks at belts, then takes out its pen and looks at the doodle. Spinning fields in various stages of rotation stretch to the horizon, with the fields being purple, orange, and dusty blue. There are grid pattern dirt roads, and the sock arrives in Atlantis. In its castle tower, the sock pulls its trunk along a meadow, lets itself into its spacious, ornately decorated castle, puts its flowers on a countertop, pulls back a black velvet curtain, and lays its trunk on the hammock. An old cat comes in holding a small bucket and taps on the countertop. The sock takes out a tiny photo of a dancing giraffe stuck on a cloud, it mopes at it pleasantly and goes, and the sock looks at the photo of the laughing giraffe. In an ancient tree house, the partner, Jessica Fields, has a meeting with the sock and its critters. Relaxed, braided Charlie stands by a slate, and a rabbit appears on the slate. The sock frowns, amused, and goes to see Jessica. The sock grins thoughtfully as it sits facing it. Comforted, Charlie sits back and looks up. Later, Jessica goes to see the sock in its tree house, where the sock is standing, staring at a globe of Saturn. The sock turns to Jessica and raises its paws. Jessica curls a piece of string, holds up a spoon, and bounces its head while the sock flattens the piece of string and throws it in the stream."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "At the Ritz, Sheila lounges in the dim bar, enjoying a warm beverage, as she observes an elderly man who is squinting at his watch with a dog leash in his other hand. He examines his watch and is puzzled. They linger, comparing business cards, and he glances at the card. Jamie's eyes twinkle as he inspects the visitor pass and chuckles quietly. Sheila chuckles, and they stroll to a suite. Jamie is a dashing gentleman with short, curly black hair. Sheila tests a key fob at a gate, but it doesn't unlock, so she employs another fob to unlock the gate, and they step in. Jamie, in his 40s, with a lean figure, saunters across the room, clothed except for a scarf draped around his neck, and sprawls on the couch, where the cushions are untouched. Sheila is reclining on pillows on the floor. Jamie and Sheila sit gazing at each other and open their tablet devices, jot an entry, and shut their devices. Sheila stands by as Jamie closes his office suite door, he turns to her, they embrace, and they laugh. He steps inside, shuts the door, and she hangs a tag on the knob. Sheila dives in the hotel bathtub, has her jacket ironed, and rents a bike, as Avis staff tap her business card through card-reading devices. In a shoe store, Sheila glances at shoes, then pulls out her tablet and checks the calendar. Rectangular fields in various stages of cultivation stretch to the skyline, with the fields being yellow, gray, and rusty red. There are zigzag pattern village paths, and Sheila lands in Denver. In her condo, Sheila drags her backpack along a corridor, lets herself into her compact, lavishly decorated condo, places her wallet on a counter, slides open a navy silk curtain, and places her backpack on the sofa. An elderly man enters holding a tiny packet and taps on the counter. Sheila takes out a small sketch of a dancing duo affixed to a frame, he laughs at her warmly and departs, and Sheila gazes at the sketch of the laughing duo. In a vintage library building, the director, John Parker, holds a conference with Sheila and her teammates. Elegant, long-haired Miranda stands beside a projector, and a woman appears on the projector. Sheila grimaces, anxious, and proceeds to see John. Sheila grins wryly as he sits opposite her. Rebuked, Miranda leans forward and peers up. Later, John visits Sheila in her suite, where Sheila is seated, gazing at a map of Canada. Sheila faces John and narrows her eyes. John folds a scrap of paper, lifts a thumb, and nods his head while Sheila crumples the scrap of paper and tosses it in the trash."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "At the Hilton, Ryan perches in the dimly lit arcade, munching a hot sandwich, as he observes a young woman who is juggling her television remote with a set of spatulas in her other hand. She examines her oven mitt and is skeptical. They idle, swapping recipe books, and she scrutinizes the pages. Alex's eyes twinkle as she inspects the doorman's clipboard and grins pensively. Ryan grins, and they wander to a compartment. Alex is an attractive woman with long, curly chestnut locks. Ryan attempts a fingerprint scanner at a curtain, but it doesn't part, so he uses another scanner to part the curtain, and they step inside. Alex, in her 30s, with a statuesque build, strides across the compartment, clad only in a scarf around her neck, and reclines on the hammock, where the cushions are untouched. Ryan reclines on pillows on the carpet. Alex and Ryan sit facing each other and unfold their paperback books, jot a note, and fold their books. Ryan stands by as Alex slides open her compartment window, she turns to him, they embrace, and they grin. She retreats inside, closes the window, and he places a sticker on the frame. Ryan jogs in the hotel gym, gets his jacket pressed, and rents a bicycle, as Hertz employees slide his loyalty booklet through booklet-reading devices. In a boutique, Ryan examines shirts, then pulls out his camera and examines the lens. Circular ponds in various states of reflection spread to the horizon, with the ponds being azure, slate, and pale orange. There are winding country roads, and Ryan arrives in Omaha. In his condominium, Ryan drags his crate along a corridor, lets himself into his cozy, lavishly decorated suite, places his spatulas on a countertop, slides back a red velvet drape, and places his crate on the hammock. A young woman enters holding a massive binder and taps on the worktop. Ryan extracts an enormous painting of a dancing duo framed on a canvas, she beams at him warmly and exits, and Ryan gazes at the painting of the cheerful duo. In a sleek corporate building, the leader, Craig Gregory, holds a gathering with Ryan and his teammates. Neat, bun-haired Natalie stands by a monitor, and a figure materializes on the screen. Ryan grimaces, concerned, and proceeds to meet Craig. Ryan chuckles wryly as she perches across from him. Admonished, Natalie slumps back and averts her gaze. Later, Craig approaches Ryan in his cubicle, where Ryan is standing, examining a blueprint of the U.S. Ryan rotates to Craig and arches his eyebrows. Craig crumples a sheet of foil, raises a pencil, and nods his head while Ryan unfolds the sheet of foil and tucks it in the drawer."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "At the Marriott, Oliver lounges in the dim cafe, enjoying a warm pastry, as he observes an elderly gentleman who is glaring at his tablet with a set of paintbrushes in his other hand. He gazes at his brush holder and is bewildered. They relax, contrasting souvenir spoons, and he examines the spoon. Jamie's eyes twinkle as he inspects the janitor's mop and grins absently. Oliver grins, and they proceed to a gallery. Jamie is an elegant man with short, curly blonde hair. Oliver attempts a pinch of salt at a sculpture, but it doesn’t move, so he uses another tool to adjust the sculpture, and they step in. Jamie, in his 60s, with a slender physique, strolls across the gallery, dressed in a scarf around his neck, and sits on the carpet, where the pattern is immaculate. Oliver is reclining on pillows on the ground. Jamie and Oliver sit opposing each other and open their sketch pads, draw a line, and close their sketch pads. Oliver stands by as Jamie opens his office door, he turns to her, they wave, and they chuckle. He goes outside, closes the door, and she places a cap on the hook. Oliver dives in the hotel fountain, gets his glasses polished, and rents a bicycle, as Avis technicians scan his souvenir spoon through spoon-scanning devices. In a ladies' boutique, Oliver examines scarves, then pulls out his tablet and checks the screen. Rectangular forests in various phases of maintenance extend to the horizon, with the forests being white, gray, and dusty blue. There are circular pattern village pathways, and Oliver arrives in Tulsa. In his condominium complex, Oliver drags his backpack along a corridor, lets himself into his large, elaborately decorated condominium, places his brushes on a countertop, pulls back a white velvet curtain, and sets his backpack on the rug. An elderly gentleman enters holding a small package and taps on the countertop. Oliver extracts a tiny drawing of a dancing crowd mounted on a canvas, he beams at him warmly and leaves, and Oliver gazes at the drawing of the gleeful crowd. In a classic art museum, the curator, Thomas Maxwell, has a discussion with Oliver and his team. Elegant, bun-haired Lindsay stands by a painting, and a woman appears on the painting. Oliver grimaces, anxious, and goes to meet Thomas. Oliver grins ruefully as he stands next to him. Critiqued, Lindsay shifts back and averts her gaze. Later, Thomas visits Oliver in his studio, where Oliver is positioned, contemplating a photograph of Italy. Oliver turns to Thomas and lifts his glasses. Thomas folds a flyer, points upward, and wags his finger while Oliver crumples the flyer and tosses it in the bucket."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Ryan relaxes at a bar in the Hilton, observing Alex, a woman studying her key fob and loyalty card. They bond over loyalty cards, then head to a room together. Alex, in her 30s, undresses and lies on the bed. Ryan joins her, and they work on laptops before sharing a kiss as she enters her hotel room. Ryan enjoys hotel amenities like the pool and shoe shining, hires a car, and travels to Omaha. There, he enters his sparse apartment, greeted by a woman who hands him a photo of a smiling couple. Ryan attends a meeting at a modern office with his boss, Craig Gregory, and a colleague, Natalie. Concerned, Ryan talks to Craig, who silently disapproves, leading Ryan to discard a crumpled piece of paper."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Craig curls a piece of paper holds up a finger and shakes his head while Ryan screws up the piece of paper and throws it in the bin Ryan turns to Craig and raises his eyebrows Later Craig goes to see Ryan in his office where Ryan is standing staring at a map of the US Chastised Natalie sits back and looks down Ryan smiles bitterly as she sits facing him Ryan frowns worried and goes to see Craig Prim ponytailed Natalie stands by a screen and a guy appears on the screen In a modern office building the boss Craig Gregory has a meeting with Ryan and his colleagues she smiles at him fondly and goes and Ryan looks at the photo of the smiling couple Ryan takes out a large photo of a hugging couple stuck on a board A young woman comes in holding a large envelope and knocks on the worktop let us himself into his small sparsely furnished apartment puts his keys on a worktop pulls back a brown plastic concertina screen and lays his case on the bed In his apartment block Ryan pulls his case along a hall There are grid pattern city streets and Ryan arrives in Omaha Circular fields in various stages of production stretch to the horizon with the fields being green brown and muddy yellow In a gents outfit Ryan looks at ties then takes out his cellphone and looks at the display Ryan swims in the hotel swimming pool gets his shoes shined and hires a car as Hertz employees swipe his loyalty card through cardreading machines She goes inside closes the door and he hangs a sign on the handle she turns to him they kiss and they smile Ryan stands by as Alex opens her hotel room door Alex and Ryan sit facing each other and open their laptop computers type an entry and close their computers Ryan is laying on cushions on the floor Alex in her 30s with a curvaceous figure walks across the room naked apart from a tie around her waist and lies on the bed where the sheets are unruffled Ryan tries a swipe card at a door but it does not open so he uses another card to open the door and they go in Alex is an attractive woman with long straight auburn hair Ryan smiles and they head to a room Alex's eyes sparkle as she studies the concierge key and smiles thoughtfully They sit comparing loyalty cards and she stares at the card She looks at her key fob and is incredulous At the Hilton Ryan sits in the lowlit bar savoring a cool drink as he watches a young woman who is staring at her cellphone with a set of car keys in her other hand"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "A young woman comes in holding a large envelope and knocks on the worktop In a gents outfit Ryan looks at ties then takes out his cellphone and looks at the display Ryan stands by as Alex opens her hotel room door Chastised Natalie sits back and looks down In a modern office building the boss Craig Gregory has a meeting with Ryan and his colleagues Ryan tries a swipe card at a door but it does not open so he uses another card to open the door and they go in Alex is an attractive woman with long straight auburn hair She goes inside closes the door and he hangs a sign on the handle she turns to him they kiss and they smile Circular fields in various stages of production stretch to the horizon with the fields being green brown and muddy yellow Alex and Ryan sit facing each other and open their laptop computers type an entry and close their computers Ryan smiles bitterly as she sits facing him Craig curls a piece of paper holds up a finger and shakes his head while Ryan screws up the piece of paper and throws it in the bin she smiles at him fondly and goes and Ryan looks at the photo of the smiling couple There are grid pattern city streets and Ryan arrives in Omaha Later Craig goes to see Ryan in his office where Ryan is standing staring at a map of the US She looks at her key fob and is incredulous Ryan swims in the hotel swimming pool gets his shoes shined and hires a car as Hertz employees swipe his loyalty card through cardreading machines let us himself into his small sparsely furnished apartment puts his keys on a worktop pulls back a brown plastic concertina screen and lays his case on the bed They sit comparing loyalty cards and she stares at the card In his apartment block Ryan pulls his case along a hall Ryan turns to Craig and raises his eyebrows Ryan smiles and they head to a room Ryan frowns worried and goes to see Craig Alex in her 30s with a curvaceous figure walks across the room naked apart from a tie around her waist and lies on the bed where the sheets are unruffled Ryan is laying on cushions on the floor Prim ponytailed Natalie stands by a screen and a guy appears on the screen At the Hilton Ryan sits in the lowlit bar savoring a cool drink as he watches a young woman who is staring at her cellphone with a set of car keys in her other hand Alex's eyes sparkle as she studies the concierge key and smiles thoughtfully Ryan takes out a large photo of a hugging couple stuck on a board"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Circular fields in various stages of production stretch to the horizon with the fields being green brown and muddy yellow There are grid pattern city streets and Ryan arrives in Omaha In his apartment block Ryan pulls his case along a hall let us himself into his small sparsely furnished apartment puts his keys on a worktop pulls back a brown plastic concertina screen and lays his case on the bed A young woman comes in holding a large envelope and knocks on the worktop Ryan takes out a large photo of a hugging couple stuck on a board she smiles at him fondly and goes and Ryan looks at the photo of the smiling couple In a modern office building the boss Craig Gregory has a meeting with Ryan and his colleagues Prim ponytailed Natalie stands by a screen and a guy appears on the screen Ryan frowns worried and goes to see Craig Ryan smiles bitterly as she sits facing him Chastised Natalie sits back and looks down Later Craig goes to see Ryan in his office where Ryan is standing staring at a map of the US Ryan turns to Craig and raises his eyebrows Craig curls a piece of paper holds up a finger and shakes his head while Ryan screws up the piece of paper and throws it in the bin At the Hilton Ryan sits in the lowlit bar savoring a cool drink as he watches a young woman who is staring at her cellphone with a set of car keys in her other hand She looks at her key fob and is incredulous They sit comparing loyalty cards and she stares at the card Alex's eyes sparkle as she studies the concierge key and smiles thoughtfully Ryan smiles and they head to a room Alex is an attractive woman with long straight auburn hair Ryan tries a swipe card at a door but it does not open so he uses another card to open the door and they go in Alex in her 30s with a curvaceous figure walks across the room naked apart from a tie around her waist and lies on the bed where the sheets are unruffled Ryan is laying on cushions on the floor Alex and Ryan sit facing each other and open their laptop computers type an entry and close their computers Ryan stands by as Alex opens her hotel room door she turns to him they kiss and they smile She goes inside closes the door and he hangs a sign on the handle Ryan swims in the hotel swimming pool gets his shoes shined and hires a car as Hertz employees swipe his loyalty card through cardreading machines In a gents outfit Ryan looks at ties then takes out his cellphone and looks at the display"
        }
      ]
    }
  ]
}