{
  "ground_truth": "Forrest runs across a cobble-stone bridge with the Rocky Mountains in the distance, and split rail fences line the road as he runs through some meadowland. Meanwhile, three men in the barber shop watch the news on television, and Jenny fills customer's coffee cups. Forrest continues running as a young man runs up to him and jogs behind him, as Forrest runs up a slope on a high mountain road with a group of people jogging behind him. The large group follows Forrest across the desert road, through a small town, where a man runs up and talks to him, while a hippie stops to ponder a profound thought. A truck with a bumper sticker drives into an intersection and collides with a car. Forrest runs, followed by his group, as another man runs up to him. Forrest wipes his face on a towel and hands it back to the man, who looks at the T-shirt. Forrest runs with a group that follows behind him until he stops, and the group stops behind him. Forrest stands and looks as the group waits expectantly, then he turns and looks, walks toward the group, which parts for him as he walks down the middle of the road. A television shows President Reagan and his staff reacting to gunshots in front of a limo, while Forrest sits eating a sandwich, watching the news of the assassination attempt. Forrest takes a letter out of his pocket, which an elderly woman looks at, then hastily grabs his suitcase and letter as he stands. A truck honks its horn as Forrest runs across the street past the truck, and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door. Forrest looks around and hands Jenny the box of chocolates. Jenny picks up a scrapbook and turns the pages as there is a knock at the door, Lynn Marie enters as she opens it, and Jenny grabs a young boy. The little boy runs into another room and picks up the TV remote control as Forrest continues to stare at Forrest Jr., then looks frightened and starts to back away. Jenny turns and looks at Forrest Jr. in the other room as Forrest breathes deep, looks at Jenny, then at Forrest Jr., walks into the room, and sits down next to Forrest Jr. Jenny walks out of the house, and Forrest walks over to greet her. She wears a white dress and walks up to Forrest, adjusting his necktie. Lt. Dan walks across the lawn using a cane, accompanied by a woman, as Jenny walks over to Forrest and Lt. Dan.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Forrest jogs across a cobblestone span with the Rocky Peaks in the distance, and split rail barriers line the path as he jogs through some pastureland. Meanwhile, three men in the barber shop observe the news on television, and Jenny refills patron's coffee mugs. Forrest persists in jogging as a young man dashes up to him and trots behind him, as Forrest jogs up a hillside on a high mountain route with a crowd of individuals jogging behind him. The large crowd trails Forrest across the desert track, through a small village, where a man dashes up and converses with him, while a hippie halts to contemplate a profound idea. A lorry with a bumper sticker drives into a junction and crashes with a vehicle. Forrest jogs, followed by his crowd, as another man dashes up to him. Forrest wipes his visage on a towel and hands it back to the man, who gazes at the T-shirt. Forrest jogs with a crowd that trails behind him until he halts, and the crowd halts behind him. Forrest stands and gazes as the crowd anticipates expectantly, then he turns and glances, strolls toward the crowd, which separates for him as he strolls down the center of the track. A television displays President Reagan and his aides reacting to gunshots in front of a limousine, while Forrest sits consuming a sandwich, observing the news of the assassination attempt. Forrest retrieves a note out of his pocket, which an aged woman gazes at, then hastily grabs his suitcase and note as he stands. A lorry honks its horn as Forrest jogs across the street past the lorry, and the aged woman yells from the bus stop bench as Jenny opens and then shuts the entryway. Forrest glances around and hands Jenny the package of sweetmeats. Jenny picks up a scrapbook and turns the pages as there is a rap at the entryway, Lynn Marie enters as she opens it, and Jenny grabs a young boy. The small boy dashes into another chamber and picks up the TV remote control as Forrest persists in staring at Forrest Jr., then glances terrified and begins to back away. Jenny turns and glances at Forrest Jr. in the other chamber as Forrest breathes deeply, glances at Jenny, then at Forrest Jr., strolls into the chamber, and sits down next to Forrest Jr. Jenny strolls out of the dwelling, and Forrest strolls over to greet her. She wears a white outfit and strolls up to Forrest, adjusting his necktie. Lt. Dan strolls across the lawn using a cane, accompanied by a woman, as Jenny strolls over to Forrest and Lt. Dan."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Forrest is seen running across a cobble-stone bridge with the Rocky Mountains in the distance, and the road is lined by split rail fences as he passes through some meadowland. Meanwhile, the news on television is watched by three men in the barber shop, and customer's coffee cups are filled by Jenny. A young man, who then jogs behind him, runs up to Forrest as he continues running, as a slope on a high mountain road is approached by Forrest with a group of people jogging behind him. Forrest is followed by the large group across the desert road, through a small town, where he is approached and talked to by a man, while a profound thought is pondered by a hippie who stops. A bumper sticker is displayed by a truck driving into an intersection, and it collides with a car. The group is followed by another man who runs up to Forrest, as Forrest wipes his face on a towel and returns it to the man, who then looks at the T-shirt. He is followed by a group running behind him until he stops, and stopping behind him is the group. Forrest is standing and looking as the group waits expectantly, then he turns and looks, and the group parts for him as he walks down the middle of the road. President Reagan and his staff reacting to gunshots in front of a limo are shown on a television, while a sandwich is eaten by Forrest, who watches the news of the assassination attempt. A letter is taken out of his pocket by Forrest, which is looked at by an elderly woman, and then he hastily grabs his suitcase and letter as he stands. Its horn is honked by a truck as the street is run across by Forrest past the truck, and the elderly woman is heard shouting from the bus stop bench as the door is opened and then shut by Jenny. Around him, Forrest looks and hands the box of chocolates to Jenny. A scrapbook is picked up by Jenny, and the pages are turned as a knock is heard at the door; Lynn Marie enters as she opens it, and a young boy is grabbed by Jenny. The TV remote control is picked up by the little boy who runs into another room as Forrest continues to stare at Forrest Jr., then he looks frightened and starts to back away. In the other room, Forrest Jr. is looked at by Jenny as Forrest breathes deep, looks at Jenny, then at Forrest Jr., and he walks into the room to sit down next to Forrest Jr. The house is exited by Jenny, and she is greeted by Forrest as he walks over. A white dress is worn by her as she walks up to Forrest, adjusting his necktie. Lt. Dan is seen walking across the lawn using a cane, accompanied by a woman, as Jenny walks over to Forrest and Lt. Dan."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Forrest runs across a cobblestone bridge with the Rocky Mountains in the distance, passing split rail fences and meadowland. In a barber shop, three men watch the news while Jenny serves coffee. A young man joins Forrest as he runs up a mountain road, followed by a group. They cross a desert road and a small town, where a man talks to Forrest and a hippie ponders. A truck with a bumper sticker collides with a car at an intersection. Forrest wipes his face on a towel, hands it to a man, and continues running with the group until they stop. Forrest stands, looks at the group, then walks through them. On TV, President Reagan reacts to gunshots, while Forrest eats a sandwich and watches the news. He takes a letter from his pocket, then grabs his suitcase and letter as a truck honks. An elderly woman shouts from a bus stop as Jenny opens and shuts a door. Forrest hands Jenny a box of chocolates. Jenny picks up a scrapbook, and Lynn Marie enters as Jenny grabs a young boy. The boy runs to another room, picks up the TV remote, and Forrest stares at Forrest Jr., then backs away. Jenny looks at Forrest Jr. as Forrest breathes deeply, looks at Jenny, then Forrest Jr., and sits next to him. Jenny leaves the house, and Forrest greets her. She adjusts his necktie, wearing a white dress. Lt. Dan, using a cane and accompanied by a woman, joins Jenny, Forrest, and Lt. Dan on the lawn."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Forrest runs across a cobblestone bridge with the Rocky Mountains in the distance, passing split rail fences and meadowland. In a barbershop, three men watch TV news while Jenny serves coffee. A young man joins Forrest as he runs up a mountain road, followed by a group. They cross a desert road and a small town, where a man talks to Forrest, and a hippie ponders. A truck with a bumper sticker collides with a car. Forrest wipes his face on a towel, hands it to a man, and stops, with the group halting behind him. He walks through the group, which parts for him. On TV, President Reagan reacts to gunshots, while Forrest eats a sandwich and watches the news. Forrest reads a letter, then grabs his suitcase and letter as a truck honks. An elderly woman shouts as Jenny opens and shuts a door. Forrest gives Jenny chocolates. Jenny picks up a scrapbook, and Lynn Marie enters as Jenny grabs a young boy. The boy runs and picks up the TV remote as Forrest stares at Forrest Jr., then backs away. Jenny looks at Forrest Jr. as Forrest breathes deeply, looks at Jenny, then Forrest Jr., and sits next to him. Jenny leaves, and Forrest greets her. She adjusts his necktie. Lt. Dan, with a cane and a woman, joins them as Jenny approaches Forrest and Lt. Dan."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Forrest, with determination in his stride, runs energetically across a picturesque cobble-stone bridge, with the majestic Rocky Mountains standing proudly in the distance. As he continues his run, split rail fences line the road, creating a rustic charm as he makes his way through the expansive meadowland. Meanwhile, in a nearby barber shop, three men are intently watching the news on television, while Jenny diligently fills the coffee cups of customers, ensuring they are well-served. Forrest, undeterred, keeps running as a young man approaches him, joining in and jogging behind him. Together, they ascend a slope on a high mountain road, with a growing group of people following Forrest's lead, jogging behind him in unison. This large group of followers trails Forrest as he crosses a desert road and passes through a quaint small town. Here, a man runs up to engage him in conversation, while a hippie pauses, lost in a moment of profound contemplation. \n\nA truck, adorned with a bumper sticker, drives into an intersection and unexpectedly collides with a car, creating a sudden commotion. Forrest, undistracted, continues his run, with his loyal group trailing behind him. Another man joins the run, catching up to Forrest. At one point, Forrest wipes his face with a towel and hands it back to the man, who then looks at the T-shirt with interest. Forrest runs with the group faithfully following until he comes to a stop, prompting the group to halt as well. Standing still, Forrest gazes around as the group waits with anticipation. He then turns, looks thoughtfully, and walks toward the group, which respectfully parts to allow him to walk down the middle of the road.\n\nOn a television screen, President Reagan and his staff are shown reacting to gunshots in front of a limo, while Forrest sits calmly, eating a sandwich and watching the news coverage of the assassination attempt. Forrest then takes a letter out of his pocket, which an elderly woman nearby looks at with curiosity. Suddenly, he hastily grabs his suitcase and the letter as he stands up. A truck honks its horn loudly as Forrest runs across the street, narrowly passing in front of the truck, while the elderly woman shouts from her seat on the bus stop bench. Meanwhile, Jenny opens and then shuts a door. Forrest, looking around, hands Jenny a box of chocolates. Jenny picks up a scrapbook and begins to turn the pages when there is a knock at the door. Lynn Marie enters as Jenny opens it, and Jenny quickly grabs a young boy. The little boy runs into another room, eagerly picking up the TV remote control. Forrest continues to stare at Forrest Jr., then suddenly looks frightened and starts to back away. Jenny turns her attention to Forrest Jr. in the other room, while Forrest takes a deep breath, looks at Jenny, then at Forrest Jr., and walks into the room to sit down next to him. Jenny exits the house, and Forrest walks over to greet her warmly. She is wearing a beautiful white dress and approaches Forrest, gently adjusting his necktie. Lt. Dan, using a cane for support, walks across the lawn accompanied by a woman, as Jenny makes her way over to join Forrest and Lt. Dan."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a sense of determination evident in every step he takes, Forrest runs energetically across a beautiful and picturesque cobblestone bridge, with the majestic and awe-inspiring Rocky Mountains standing proudly in the distance. As he continues his enthusiastic run, split rail fences line the road, adding a touch of rustic charm to the scene as he makes his way through the expansive and breathtaking meadowland. Meanwhile, in a nearby barber shop, three men are intently watching the news on television, while Jenny diligently fills the steaming coffee cups of customers, ensuring they are well-served and satisfied. Forrest, undeterred and unwavering, keeps running as a young man approaches, joining in alongside him and jogging just behind him. Together, they ascend a slope on a high mountain road, with a growing group of people, inspired by Forrest's example, following his lead, jogging behind him in unison. This increasingly large group of enthusiastic followers trails Forrest as he crosses a desert road and passes through a quaint and charming small town. Here, a man runs up to engage him in conversation, while a hippie momentarily pauses, lost in a profound moment of deep and contemplative thought.\n\nA truck, conspicuously adorned with an eye-catching bumper sticker, drives into an intersection and unexpectedly collides with a car, creating a sudden and chaotic commotion. Yet, Forrest remains undistracted and continues his run, with his loyal group of followers trailing steadily behind him. Another man decides to join the run, catching up to Forrest with determination. At one point during the run, Forrest wipes his face with a towel and hands it back to the man, who then looks at the T-shirt with curious interest. Forrest continues his run with the faithful group following him until he comes to a complete stop, prompting the group to halt as well. Standing still, Forrest gazes around thoughtfully as the group waits with anticipation. He then turns, looks thoughtfully once more, and walks toward the group, which respectfully parts to allow him to walk down the middle of the road.\n\nOn a television screen, President Reagan and his staff are shown reacting to the shocking sound of gunshots in front of a limo, while Forrest sits calmly, eating a sandwich and watching the news coverage of the assassination attempt unfold. Forrest then takes a letter out of his pocket, which an elderly woman nearby looks at with curiosity. Suddenly, he hastily grabs his suitcase and the letter as he stands up. A truck honks its horn loudly as Forrest runs across the street, narrowly passing in front of the truck, while the elderly woman shouts from her seat on the bus stop bench. Meanwhile, Jenny opens and then shuts a door with care. Forrest, looking around thoughtfully, hands Jenny a box of chocolates with a warm smile. Jenny picks up a scrapbook and begins to turn the pages when there is a gentle knock at the door. Lynn Marie enters as Jenny opens it, and Jenny quickly grabs a young boy. The little boy runs into another room, eagerly picking up the TV remote control with excitement. Forrest continues to stare at Forrest Jr., then suddenly looks frightened and starts to back away slowly. Jenny turns her attention to Forrest Jr. in the other room, while Forrest takes a deep breath, looks at Jenny, then at Forrest Jr., and walks into the room to sit down next to him. Jenny exits the house with grace, and Forrest walks over to greet her warmly. She is wearing a beautiful, elegant white dress and approaches Forrest, gently adjusting his necktie with care. Lt. Dan, using a cane for support as he walks, crosses the lawn accompanied by a woman, as Jenny makes her way over to join Forrest and Lt. Dan."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Forrest begins his journey by sprinting across a cobble-stone bridge, with the majestic Rocky Mountains looming in the distance, while split rail fences neatly line the road as he makes his way through the expansive meadowland. Simultaneously, inside a barber shop, three men are intently watching the news on television, and Jenny is busy refilling the coffee cups of her customers. As Forrest continues his run, a young man approaches him, matching his pace and jogging behind him as Forrest ascends a slope on a high mountain road, now accompanied by a growing group of people jogging in his wake. This large group trails Forrest as he traverses a desert road and passes through a small town, where a man runs up to engage him in conversation, while a hippie pauses to reflect on a profound thought. Meanwhile, a truck adorned with a bumper sticker enters an intersection and collides with a car. Forrest, still running with his group in tow, is joined by another man who runs up to him. Forrest then wipes his face with a towel and hands it back to the man, who examines the T-shirt. Forrest continues running with the group following closely behind until he comes to a halt, prompting the group to stop as well. Standing still, Forrest surveys the scene as the group waits expectantly, then he turns around and walks toward them, causing the group to part and make way for him as he strides down the middle of the road. On television, President Reagan and his staff are shown reacting to gunshots in front of a limo, while Forrest sits, eating a sandwich and watching the news of the assassination attempt unfold. Forrest retrieves a letter from his pocket, which an elderly woman glances at, before he quickly gathers his suitcase and letter as he rises to his feet. A truck blares its horn as Forrest dashes across the street, narrowly avoiding the truck, while the elderly woman shouts from her seat on the bus stop bench as Jenny opens and then closes the door. Forrest surveys his surroundings and hands Jenny a box of chocolates. Jenny picks up a scrapbook and begins flipping through its pages when there is a knock at the door; Lynn Marie enters as Jenny opens it, and Jenny then grabs a young boy. The little boy scurries into another room and picks up the TV remote control as Forrest continues to gaze at Forrest Jr., then appears frightened and begins to back away. Jenny turns her attention to Forrest Jr. in the other room as Forrest takes a deep breath, looks at Jenny, then at Forrest Jr., and walks into the room to sit down next to him. Jenny exits the house, and Forrest approaches to greet her. She is dressed in a white dress and walks up to Forrest, adjusting his necktie. Lt. Dan makes his way across the lawn using a cane, accompanied by a woman, as Jenny approaches Forrest and Lt. Dan."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Forrest runs across a cobblestone bridge with the Rocky Mountains in the distance, passing split rail fences and meadowland. Meanwhile, in a barbershop, three men watch the news on television as Jenny serves coffee. Forrest continues running, joined by a young man and a growing group of joggers, traversing a high mountain road and a desert road through a small town. A man approaches Forrest to talk, while a hippie pauses in thought. A truck with a bumper sticker collides with a car at an intersection. Forrest wipes his face on a towel, hands it to a man who examines a T-shirt, and continues running with his followers until he stops, prompting the group to halt as well. As they wait expectantly, Forrest walks through the parted group down the road. On television, President Reagan and his staff react to gunshots, while Forrest eats a sandwich and watches the news of the assassination attempt. He retrieves a letter from his pocket, which an elderly woman examines, then quickly gathers his suitcase and letter as he stands. A truck honks as Forrest crosses the street, and the elderly woman shouts from a bus stop bench as Jenny opens and shuts a door. Forrest hands Jenny a box of chocolates. Jenny picks up a scrapbook, turning pages as Lynn Marie enters after a knock at the door, and Jenny grabs a young boy. The boy runs into another room, picks up the TV remote, and Forrest, staring at Forrest Jr., looks frightened and backs away. Jenny turns to look at Forrest Jr. as Forrest, breathing deeply, looks at Jenny, then at Forrest Jr., and sits next to him. Jenny exits the house, and Forrest greets her as she approaches in a white dress, adjusting his necktie. Lt. Dan, using a cane and accompanied by a woman, walks across the lawn to join Jenny, Forrest, and Lt. Dan."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Forrest runs across a cobble-stone bridge, reminiscent of early American architecture, with the majestic Rocky Mountains, which span over 3,000 miles and are known for their breathtaking vistas, in the distance, and split rail fences, commonly used to mark rural property boundaries, line the road as he runs through some idyllic meadowland. Meanwhile, three men in the barber shop, a social hub in many small towns, watch the news on television, a key medium for information during the late 20th century, and Jenny, working at a bustling diner, fills customer's coffee cups. Forrest continues running as a young man, inspired by Forrest's unyielding spirit, runs up to him and jogs behind him, as Forrest runs up a slope on a high mountain road with a group of people, captivated by his determination and purpose, jogging behind him. The large group follows Forrest across the vast desert road, through a small town, where a man runs up and talks to him, while a hippie, embodying the counterculture of the 1960s, stops to ponder a profound thought. A truck with a politically themed bumper sticker drives into an intersection and collides with a car. Forrest runs, followed by his devoted group, as another man runs up to him. Forrest wipes his face on a towel and hands it back to the man, who looks at the T-shirt, which now bears a smiley face imprint, a symbol of 1970s pop culture. Forrest runs with a group that follows behind him until he stops, and the group stops behind him. Forrest stands and looks as the group waits expectantly, then he turns and looks, walks toward the group, which parts for him as he walks down the middle of the road, reminiscent of a leader guiding his followers. A television shows President Reagan and his staff reacting to gunshots in front of a limo, recalling the attempted assassination on March 30, 1981, while Forrest sits eating a sandwich, a quintessentially American meal, watching the news of the assassination attempt. Forrest takes a letter out of his pocket, which an elderly woman looks at, then hastily grabs his suitcase and letter as he stands. A truck honks its horn as Forrest runs across the street past the truck, and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door. Forrest looks around and hands Jenny the box of chocolates, famously used as a metaphor for life's unpredictable nature. Jenny picks up a scrapbook, filled with memories and mementos, and turns the pages as there is a knock at the door, Lynn Marie enters as she opens it, and Jenny grabs a young boy, her son Forrest Jr. The little boy runs into another room and picks up the TV remote control, symbolizing the growing influence of technology, as Forrest continues to stare at Forrest Jr., then looks frightened and starts to back away. Jenny turns and looks at Forrest Jr. in the other room as Forrest breathes deep, looks at Jenny, then at Forrest Jr., walks into the room, and sits down next to Forrest Jr., building a connection with his son. Jenny walks out of the house, and Forrest walks over to greet her. She wears a white dress, traditionally symbolizing purity and new beginnings, and walks up to Forrest, adjusting his necktie. Lt. Dan, who Forrest met during the Vietnam War, walks across the lawn using a cane, a testament to his previous battle injuries, accompanied by a woman, as Jenny walks over to Forrest and Lt. Dan."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Forrest runs across a cobblestone bridge with the Rocky Mountains in the distance and split rail fences line the road as he runs through some meadowland. Meanwhile three men in the barber shop watch the news on television and Jenny fills customer's coffee cups. Forrest continues running as a young man runs up to him and jogs behind him. as Forrest runs up a slope on a high mountain road with a group of people jogging behind him. The large group follows Forrest across the desert road through a small town where a man runs up and talks to him while a hippie stops to ponder a profound thought. A truck with a bumper sticker drives into an intersection and collides with a car. Forrest runs followed by his group as another man runs up to him. Forrest wipes his face on a towel and hands it back to the man who looks at the Tshirt. Forrest runs with a group that follows behind him until he stops and the group stops behind him. Forrest stands and looks as the group waits expectantly. then he turns and looks walks toward the group which parts for him as he walks down the middle of the road. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. A television shows President Reagan and his staff reacting to gunshots in front of a limo while Forrest sits eating a sandwich watching the news of the assassination attempt. Forrest takes a letter out of his pocket which an elderly woman looks at then hastily grabs his suitcase and letter as he stands. A truck honks its horn as Forrest runs across the street past the truck and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door. Forrest looks around and hands Jenny the box of chocolates. Jenny picks up a scrapbook and turns the pages as there is a knock at the door. Lynn Marie enters as she opens it and Jenny grabs a young boy. The little boy runs into another room and picks up the TV remote control as Forrest continues to stare at Forrest Jr then looks frightened and starts to back away. Jenny turns and looks at Forrest Jr in the other room as Forrest breathes deep looks at Jenny then at Forrest Jr walks into the room and sits down next to Forrest Jr. Jenny walks out of the house and Forrest walks over to greet her. She wears a white dress and walks up to Forrest adjusting his necktie. Lt Dan walks across the lawn using a cane accompanied by a woman as Jenny walks over to Forrest and Lt Dan."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Forrest runs across a cobblestone bridge with the Rocky Mountains in the distance and split rail fences line the road as he runs through some meadowland. Meanwhile three men in the barber shop watch the news on television and Jenny fills customer's coffee cups. Forrest continues running as a young man runs up to him and jogs behind him. as Forrest runs up a slope on a high mountain road with a group of people jogging behind him. The large group follows Forrest across the desert road through a small town where a man runs up and talks to him while a hippie stops to ponder a profound thought. A truck with a bumper sticker drives into an intersection and collides with a car. Forrest runs followed by his group as another man runs up to him. Forrest wipes his face on a towel and hands it back to the man who looks at the Tshirt. Forrest runs with a group that follows behind him until he stops and the group stops behind him. Forrest stands and looks as the group waits expectantly. then he turns and looks walks toward the group which parts for him as he walks down the middle of the road. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. A television shows President Reagan and his staff reacting to gunshots in front of a limo while Forrest sits eating a sandwich watching the news of the assassination attempt. Forrest takes a letter out of his pocket which an elderly woman looks at then hastily grabs his suitcase and letter as he stands. A truck honks its horn as Forrest runs across the street past the truck and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door. Forrest looks around and hands Jenny the box of chocolates. Jenny picks up a scrapbook and turns the pages as there is a knock at the door. Lynn Marie enters as she opens it and Jenny grabs a young boy. The little boy runs into another room and picks up the TV remote control as Forrest continues to stare at Forrest Jr then looks frightened and starts to back away. Jenny turns and looks at Forrest Jr in the other room as Forrest breathes deep looks at Jenny then at Forrest Jr walks into the room and sits down next to Forrest Jr. Jenny walks out of the house and Forrest walks over to greet her. She wears a white dress and walks up to Forrest adjusting his necktie. Lt Dan walks across the lawn using a cane accompanied by a woman as Jenny walks over to Forrest and Lt Dan."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Forrest runs across a cobblestone bridge with the Rocky Mountains in the distance and split rail fences line the road as he runs through some meadowland. Meanwhile three men in the barber shop watch the news on television and Jenny fills customer's coffee cups. Forrest continues running as a young man runs up to him and jogs behind him. as Forrest runs up a slope on a high mountain road with a group of people jogging behind him. The large group follows Forrest across the desert road through a small town where a man runs up and talks to him while a hippie stops to ponder a profound thought. A truck with a bumper sticker drives into an intersection and collides with a car. The little boy runs into another room and picks up the TV remote control as Forrest continues to stare at Forrest Jr then looks frightened and starts to back away. Jenny turns and looks at Forrest Jr in the other room as Forrest breathes deep looks at Jenny then at Forrest Jr walks into the room and sits down next to Forrest Jr. Jenny walks out of the house and Forrest walks over to greet her. She wears a white dress and walks up to Forrest adjusting his necktie. Lt Dan walks across the lawn using a cane accompanied by a woman as Jenny walks over to Forrest and Lt Dan."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Forrest runs across a cobblestone bridge with the Rocky Mountains in the distance and split rail fences line the road as he runs through some meadowland. Meanwhile three men in the barber shop watch the news on television and Jenny fills customer's coffee cups. Forrest continues running as a young man runs up to him and jogs behind him. She wears a white dress and walks up to Forrest adjusting his necktie. Lt Dan walks across the lawn using a cane accompanied by a woman as Jenny walks over to Forrest and Lt Dan."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Henry swims across a sand-covered pond with the Appalachian Hills in the distance, and stonewall barricades border the path as he swims through some farmland. Meanwhile, three women in the butcher shop listen to music on the radio, and Lucy spoons customer's soup bowls. Henry continues swimming as a young woman swims up to him and paddles beside him, as Henry swims up a hill on a low valley path with a gang of cats paddling beside him. The tiny gang tags along with Henry across the forest path, through a large village, where a woman swims up and whispers to him, while a sailor pauses to contemplate a silly idea. A bicycle with a wind chime cruises into a roundabout and bumps into a skateboard. Henry swims, shadowed by his gang, as another woman swims up to him. Henry dries his hair on a curtain and throws it back to the woman, who peers at the magazine. Henry swims with a gang that trails behind him until he halts, and the gang halts behind him. Henry sits and observes as the gang waits silently, then he circles and observes, trots toward the gang, which divides for him as he trots down the center of the path. A radio displays Mayor Johnson and his advisors responding to laughter in front of a tractor, while Henry lounges chewing a taco, hearing the story of the pie-eating contest. Henry pulls a map out of his satchel, which an ancient man studies, then quickly snatches his backpack and map as he rises. A motorcycle revs its engine as Henry swims alongside the highway past the motorcycle, and the ancient man yells from the park bench as Lucy opens and then closes the window. Henry glances around and passes Lucy the basket of apples. Lucy scoops up a photograph album and flips the pictures as there is a ring at the bell, Leon enters as he pushes it, and Lucy tugs on an old cat. The small cat dashes into another closet and grabs the laptop keyboard as Henry continues to gaze at Henry Jr., then looks startled and begins to edge closer. Lucy spins and observes Henry Jr. in the next closet as Henry inhales slowly, glances at Lucy, then at Henry Jr., strolls into the closet, and kneels down beside Henry Jr. Lucy strolls out of the office, and Henry strolls over to wave at her. She wears a red scarf and strolls up to Henry, adjusting her hat. Mr. Frank strolls across the roof using a walker, escorted by a dancer, as Lucy strolls over to Henry and Mr. Frank."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Forrest runs across a cobblestone bridge with the Rocky Mountains in the distance, passing split rail fences and meadowland. Meanwhile, three men in a barbershop watch the news, and Jenny serves coffee. Forrest is joined by a group of joggers, passing through desert roads and towns. A truck with a bumper sticker crashes into a car. Forrest, followed by the group, wipes his face and gives a towel to a man with a T-shirt. The group stops as Forrest pauses and looks around. On TV, President Reagan and staff react to gunshots, while Forrest eats a sandwich and watches news of the attempted assassination. Forrest reads a letter, then hurries, grabbing his suitcase as a truck honks. The elderly woman at the bus stop shouts as Jenny opens and closes a door. Forrest gives Jenny chocolates, and she opens a scrapbook as Lynn Marie arrives. Jenny grabs a young boy who runs to another room, and Forrest nervously watches Forrest Jr. Jenny leaves, and Forrest greets her in a white dress, adjusting his necktie. Lt. Dan, with a cane and a woman, joins them, and Jenny walks over to Forrest and Lt. Dan."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Lt Dan walks across the lawn using a cane accompanied by a woman as Jenny walks over to Forrest and Lt Dan She wears a white dress and walks up to Forrest adjusting his necktie  Jenny walks out of the house and Forrest walks over to greet her  Jenny turns and looks at Forrest Jr in the other room as Forrest breathes deep looks at Jenny then at Forrest Jr walks into the room and sits down next to Forrest Jr  The little boy runs into another room and picks up the TV remote control as Forrest continues to stare at Forrest Jr then looks frightened and starts to back away  Lynn Marie enters as she opens it and Jenny grabs a young boy  Jenny picks up a scrapbook and turns the pages as there is a knock at the door  Forrest looks around and hands Jenny the box of chocolates  A truck honks its horn as Forrest runs across the street past the truck and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door  Forrest takes a letter out of his pocket which an elderly woman looks at then hastily grabs his suitcase and letter as he stands  A television shows President Reagan and his staff reacting to gunshots in front of a limo while Forrest sits eating a sandwich watching the news of the assassination attempt  then he turns and looks walks toward the group which parts for him as he walks down the middle of the road  Forrest stands and looks as the group waits expectantly  Forrest runs with a group that follows behind him until he stops and the group stops behind him  Forrest wipes his face on a towel and hands it back to the man who looks at the Tshirt  Forrest runs followed by his group as another man runs up to him  A truck with a bumper sticker drives into an intersection and collides with a car  The large group follows Forrest across the desert road through a small town where a man runs up and talks to him while a hippie stops to ponder a profound thought  as Forrest runs up a slope on a high mountain road with a group of people jogging behind him  Forrest continues running as a young man runs up to him and jogs behind him  Meanwhile three men in the barber shop watch the news on television and Jenny fills customer's coffee cups  Forrest runs across a cobblestone bridge with the Rocky Mountains in the distance and split rail fences line the road as he runs through some meadowland "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Meanwhile three men in the barber shop watch the news on television and Jenny fills customer's coffee cups Forrest runs across a cobblestone bridge with the Rocky Mountains in the distance and split rail fences line the road as he runs through some meadowland as Forrest runs up a slope on a high mountain road with a group of people jogging behind him Forrest continues running as a young man runs up to him and jogs behind him A truck with a bumper sticker drives into an intersection and collides with a car The large group follows Forrest across the desert road through a small town where a man runs up and talks to him while a hippie stops to ponder a profound thought Forrest wipes his face on a towel and hands it back to the man who looks at the Tshirt Forrest runs followed by his group as another man runs up to him Forrest stands and looks as the group waits expectantly Forrest runs with a group that follows behind him until he stops and the group stops behind him A television shows President Reagan and his staff reacting to gunshots in front of a limo while Forrest sits eating a sandwich watching the news of the assassination attempt then he turns and looks walks toward the group which parts for him as he walks down the middle of the road A truck honks its horn as Forrest runs across the street past the truck and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door Forrest takes a letter out of his pocket which an elderly woman looks at then hastily grabs his suitcase and letter as he stands Jenny picks up a scrapbook and turns the pages as there is a knock at the door Forrest looks around and hands Jenny the box of chocolates The little boy runs into another room and picks up the TV remote control as Forrest continues to stare at Forrest Jr then looks frightened and starts to back away Lynn Marie enters as she opens it and Jenny grabs a young boy Jenny walks out of the house and Forrest walks over to greet her Jenny turns and looks at Forrest Jr in the other room as Forrest breathes deep looks at Jenny then at Forrest Jr walks into the room and sits down next to Forrest Jr Lt Dan walks across the lawn using a cane accompanied by a woman as Jenny walks over to Forrest and Lt Dan She wears a white dress and walks up to Forrest adjusting his necktie"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "A television shows President Reagan and his staff reacting to gunshots in front of a limo while Forrest sits eating a sandwich watching the news of the assassination attempt  Forrest takes a letter out of his pocket which an elderly woman looks at then hastily grabs his suitcase and letter as he stands  A truck honks its horn as Forrest runs across the street past the truck and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door  Forrest looks around and hands Jenny the box of chocolates  Jenny picks up a scrapbook and turns the pages as there is a knock at the door  Lynn Marie enters as she opens it and Jenny grabs a young boy  The little boy runs into another room and picks up the TV remote control as Forrest continues to stare at Forrest Jr then looks frightened and starts to back away  Jenny turns and looks at Forrest Jr in the other room as Forrest breathes deep looks at Jenny then at Forrest Jr walks into the room and sits down next to Forrest Jr  Jenny walks out of the house and Forrest walks over to greet her  She wears a white dress and walks up to Forrest adjusting his necktie  Lt Dan walks across the lawn using a cane accompanied by a woman as Jenny walks over to Forrest and Lt Dan Forrest runs across a cobblestone bridge with the Rocky Mountains in the distance and split rail fences line the road as he runs through some meadowland  Meanwhile three men in the barber shop watch the news on television and Jenny fills customer's coffee cups  Forrest continues running as a young man runs up to him and jogs behind him  as Forrest runs up a slope on a high mountain road with a group of people jogging behind him  The large group follows Forrest across the desert road through a small town where a man runs up and talks to him while a hippie stops to ponder a profound thought  A truck with a bumper sticker drives into an intersection and collides with a car  Forrest runs followed by his group as another man runs up to him  Forrest wipes his face on a towel and hands it back to the man who looks at the Tshirt  Forrest runs with a group that follows behind him until he stops and the group stops behind him  Forrest stands and looks as the group waits expectantly  then he turns and looks walks toward the group which parts for him as he walks down the middle of the road "
        }
      ]
    }
  ]
}