{
  "ground_truth": "At home, he takes pristine white T-shirts off a shelf and lays them in his suitcase with the rest of his clothes, then he packs his tie pouch, straightens up, and sees the cardboard cut-out. He picks up the photo and holds it over his case length-wise and cross-wise. Wearing a sharp charcoal gray suit, Ryan walks through the airport, dragging the case, with Julie and Jim's smiling faces poking out of the top. Ryan stops and stares; outside, Natalie is embracing a big beefy guy. Ryan slides his swipe card through the slot on the self-service check-in machine, then collects his boarding pass and steps away with his case in tow. He wearily raises his eyebrows as he watches Natalie come in, and she stoops slightly as she drags a large unwieldy suitcase, with a large black bag slung over her shoulder and a coat over. Ryan looks at her and sighs, while she looks blank. At a luggage store, Ryan wheels a wheelie case back and forth, and Natalie kneels on the floor transferring her belongings from her hefty suitcase to the neater, smaller wheelie case. Ryan grabs a travel pillow and bins it, then bins a full-size pillow. At security, Ryan sees a group of businessmen and collects his things on the other side of the X-ray machine, while Natalie is being scanned and takes off a bracelet. On the plane, she and Ryan sit side-by-side with the aisle between them, and Natalie types on her laptop. Ryan looks across at her, she stares at him, then with a dismissive glance, she gets back to work, and Ryan smiles wryly. In St. Louis, as they walk through the terminal building, Ryan gets a call from Alex, and a smile spreads across Ryan's face. Ryan walks through an open-plan office with Natalie, who's clutching a pile of strategy packets, as office workers stare at them heading to a private office. Natalie silently seethes while an older balding man holds up a photo of two young girls. Sitting opposite him, Ryan glances down, with Natalie beside him, incredulous. Bob sits back resigned, shaking his head, as Natalie studies Ryan, and craggy-faced Bob stares at Ryan thoughtfully and glances down at the photos of his girls. Ryan nods to Natalie, who picks up one of the strategy packets and hands it to Bob, who looks at the packet and takes it. At the Hilton, Natalie follows Ryan into the lobby, as a woman stares at him while he walks past the queue and up to the desk, handing her a leaflet, which she snatches. In the dining room, Ryan sits with three plates of food, and Natalie sits, poking at her plate of food with her fork. Ryan throws out his hand and smiles.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "At dwelling, he retrieves immaculate alabaster T-shirts from a shelf and arranges them in his suitcase with the remainder of his garments, then he packs his neckwear pouch, tidies up, and notices the cardboard cut-out. He lifts the photograph and holds it over his case length-wise and cross-wise. Clad in a crisp charcoal gray ensemble, Ryan strides through the airport, tugging the case, with Julie and Jim's beaming countenances peeking out of the top. Ryan halts and gazes; outside, Natalie is hugging a large burly fellow. Ryan slides his swipe pass through the slot on the self-service check-in apparatus, then gathers his boarding pass and steps aside with his case in tow. He tiredly raises his eyebrows as he observes Natalie enter, and she bends slightly as she pulls a sizable unwieldy suitcase, with a substantial black bag slung over her shoulder and a coat draped over. Ryan regards her and exhales, while she appears expressionless. At a baggage shop, Ryan rolls a wheeled case back and forth, and Natalie crouches on the floor transferring her possessions from her bulky suitcase to the tidier, smaller wheeled case. Ryan seizes a travel pillow and discards it, then discards a full-size pillow. At security, Ryan spots a group of businessmen and retrieves his items on the other side of the X-ray apparatus, while Natalie is being screened and removes a bracelet. On the aircraft, she and Ryan sit side-by-side with the aisle between them, and Natalie types on her laptop. Ryan glances across at her, she gazes at him, then with a dismissive look, she resumes her work, and Ryan smiles sardonically. In St. Louis, as they traverse the terminal facility, Ryan receives a call from Alex, and a grin spreads across Ryan's visage. Ryan strolls through an open-plan office with Natalie, who's clutching a stack of strategy brochures, as office staff gaze at them heading to a private office. Natalie silently fumes while an aged balding man holds up a photograph of two young girls. Sitting opposite him, Ryan glances downward, with Natalie beside him, incredulous. Bob leans back resignedly, shaking his head, as Natalie examines Ryan, and craggy-faced Bob gazes at Ryan pensively and glances downward at the photographs of his girls. Ryan nods to Natalie, who picks up one of the strategy brochures and hands it to Bob, who looks at the brochure and accepts it. At the Hilton, Natalie trails Ryan into the lobby, as a woman gazes at him while he walks past the queue and up to the counter, handing her a pamphlet, which she grabs. In the dining area, Ryan sits with three plates of nourishment, and Natalie sits, prodding at her plate of food with her fork. Ryan extends his hand and smiles."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "At home, pristine white T-shirts are taken off a shelf by him and laid in his suitcase with the rest of his clothes, then his tie pouch is packed, everything straightened up by him, and the cardboard cut-out is seen. The photo is picked up by him and held over his case length-wise and cross-wise. Wearing a sharp charcoal gray suit, the airport is walked through by Ryan, the case being dragged, with Julie and Jim's smiling faces poking out of the top. Ryan stops and stares; outside, she embraces a big beefy guy. Ryan's swipe card is slid through the slot on the self-service check-in machine by him, then he collects his boarding pass and steps away with his case in tow. His eyebrows are wearily raised by him as Natalie is watched coming in, and she stoops slightly as a large unwieldy suitcase is dragged by her, with a large black bag slung over her shoulder and a coat over. She is looked at by Ryan, and he sighs, while her look is blank. At a luggage store, a wheelie case is wheeled back and forth by Ryan, and Natalie kneels on the floor transferring her belongings from her hefty suitcase to the neater, smaller wheelie case. A travel pillow is grabbed by Ryan and binned, then a full-size pillow is also binned. At security, a group of businessmen is seen by Ryan and his things are collected by him on the other side of the X-ray machine, while she takes off a bracelet, being scanned. On the plane, they sit side-by-side with the aisle between them, and her laptop is typed on by Natalie. Ryan looks across at her, she stares at him, then with a dismissive glance, her work is resumed, and a wry smile appears on Ryan's face. In St. Louis, as the terminal building is walked through by them, a call from Alex is received by Ryan, and a smile spreads across Ryan's face. An open-plan office is walked through by Ryan with Natalie, who's clutching a pile of strategy packets, as office workers stare at them heading to a private office. Natalie silently seethes while a photo of two young girls is held up by an older balding man. Sitting opposite him, Ryan glances down, with Natalie beside him, incredulous. Bob sits back resigned, shaking his head, as Ryan is studied by Natalie, and Ryan is thoughtfully stared at by craggy-faced Bob, who glances down at the photos of his girls. A nod is given by Ryan to Natalie, who picks up one of the strategy packets and hands it to Bob, who looks at the packet and takes it. At the Hilton, Ryan is followed by Natalie into the lobby, as he is stared at by a woman while he walks past the queue and up to the desk, handing her a leaflet, which she snatches. In the dining room, three plates of food are sat with by Ryan, and her plate of food is poked at by Natalie with her fork. His hand is thrown out by Ryan and a smile is given."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "At home, he neatly packs white T-shirts and a tie pouch into his suitcase, notices a cardboard cut-out, and holds a photo above his case. In a sharp charcoal suit, Ryan walks through the airport with Julie and Jim's smiling faces poking from his suitcase as he watches Natalie embrace a big guy. He collects his boarding pass and spots Natalie struggling with a large suitcase and bag. At a luggage store, Ryan wheels a case while Natalie transfers belongings to a smaller case. Ryan discards travel pillows. At security, Ryan joins businessmen post-X-ray as Natalie is scanned, removing a bracelet. On the plane, sitting across the aisle, Natalie types on her laptop, ignoring Ryan, who smiles wryly. In St. Louis, Ryan receives a call from Alex, smiling. He walks with Natalie in an office with strategy packets while workers watch them. Bob, an older man, shows a photo of two girls, and Ryan glances down, with Natalie looking incredulous. Bob shakes his head, and Natalie hands him a packet. At the Hilton, Natalie follows Ryan, who hands a leaflet to a woman. In the dining room, Ryan smiles as they eat together."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "At home, he packs his white T-shirts and tie pouch in his suitcase, then notices a cardboard cut-out photo. Wearing a gray suit, Ryan moves through the airport with Julie and Jim's photos peeking out. He pauses, sees Natalie hugging a man, swipes his card, gets his boarding pass, and watches Natalie drag a large suitcase. Ryan sighs as she enters, seemingly blank. At a luggage store, Ryan rolls a case while Natalie transfers her things into a smaller case. Ryan discards a travel pillow and full-size pillow. At security, Ryan passes businessmen and gathers his belongings, while Natalie removes a bracelet. On the plane, separated by an aisle, Natalie works on her laptop, and Ryan smiles wryly at her dismissive glance. In St. Louis, Ryan receives a call from Alex, brightening his mood. Entering an office with Natalie, holding strategy packets, workers stare as they head to meet Bob. Natalie is silent and angry, while Bob shows a photo of his daughters. Ryan nods, and Natalie hands a packet to Bob. At the Hilton, Ryan and Natalie enter the lobby; a woman eyes him as he skips the queue to the desk. In the dining room, Ryan has three plates of food, and Natalie pokes at hers as Ryan gestures and smiles."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In the comfort of his home, he carefully takes a collection of pristine white T-shirts off a shelf, laying them meticulously into his suitcase alongside the rest of his neatly folded clothes. After carefully packing his tie pouch, he takes a moment to straighten up and notices the cardboard cut-out. He tenderly picks up the photo, holding it thoughtfully over his open suitcase both length-wise and cross-wise, as if considering its placement. Ryan, impeccably dressed in a sharp charcoal gray suit, confidently strides through the bustling airport, dragging his suitcase behind him. From the top of the suitcase, the cheerful faces of Julie and Jim peek out, giving him company on his journey. Just then, Ryan halts and gazes outside; he spots Natalie in an embrace with a large, beefy gentleman. He proceeds to slide his swipe card through the slot of the self-service check-in machine with practiced ease, retrieves his boarding pass, and steps away, his suitcase rolling behind him obediently. With a tired expression, he raises his eyebrows as he observes Natalie entering; she stoops slightly under the weight of a large, unwieldy suitcase, a substantial black bag slung over her shoulder and an extra coat hanging over it. Ryan casts a glance her way and releases a sigh, while she returns his look with a blank expression. \n\nInside a luggage store, Ryan is seen intently wheeling a sleek wheelie case back and forth, testing its maneuverability. Meanwhile, Natalie is kneeling on the floor, diligently transferring her belongings from her cumbersome suitcase into the more compact and organized wheelie case. Ryan decides to grab a travel pillow and, deciding it's unnecessary, tosses it aside into a bin, followed by a full-size pillow. At the security checkpoint, Ryan catches sight of a group of businessmen and proceeds to collect his items on the other side of the X-ray machine, while Natalie undergoes a scan and removes a bracelet. Once aboard the plane, Natalie and Ryan find themselves sitting side-by-side with the aisle separating them. Natalie focuses intently on her laptop, typing away. Ryan glances across at her, catching her eye, and she returns his gaze momentarily before casting a dismissive glance and returning to her work, prompting Ryan to smile wryly. Upon arrival in St. Louis, as they move through the terminal building, Ryan receives a call from Alex, which instantly brings a smile to his face. \n\nRyan walks through an expansive, open-plan office alongside Natalie, who is clutching a stack of strategy packets tightly. The office workers cast curious glances at them as they make their way to a private office. In the office, Natalie silently simmers with anger while an older, balding man holds up a cherished photo of two young girls. Sitting opposite the man, Ryan looks down momentarily, with Natalie beside him, her expression incredulous. Bob leans back in his chair, resigned, shaking his head slightly, as Natalie studies Ryan with intense scrutiny, and the craggy-faced Bob regards Ryan with a thoughtful stare before glancing down at the photos of his daughters. Ryan nods to Natalie, prompting her to pick up one of the strategy packets and hand it over to Bob, who examines the packet briefly before accepting it. Later, at the Hilton, Natalie follows Ryan into the grand lobby. A woman in the queue can't help but stare at him as he confidently strides past, making his way up to the desk and handing over a leaflet, which the woman behind the desk snatches from him. In the dining room, Ryan sits comfortably with three plates piled with an assortment of food, while Natalie pokes disinterestedly at her plate of food with her fork. Ryan gesticulates animatedly and offers a charming smile."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In the familiar comfort and tranquility of his own home, he meticulously retrieves a collection of pristine white T-shirts from a neatly arranged shelf. He gently lays them one by one into his suitcase, arranging them with great care alongside the rest of his carefully folded clothing items. After taking the time to pack his tie pouch diligently, he pauses briefly to straighten up. His eyes fall upon a cardboard cut-out photo, which he tenderly picks up, studying it intently as he holds it thoughtfully over his open suitcase, checking both length-wise and cross-wise, as if contemplating the perfect placement for it. Ryan, dressed impeccably in a crisp charcoal gray suit that speaks to his sharp sense of style, strides confidently through the bustling airport corridors, pulling his suitcase along behind him. From the top of his suitcase, the cheerful, smiling faces of Julie and Jim peek out, their presence offering him company on his journey. At that moment, Ryan stops in his tracks and shifts his gaze outside; he notices Natalie warmly embracing a large, beefy gentleman. He proceeds to slide his swipe card smoothly through the slot of the self-service check-in machine, handling the process with practiced ease. After retrieving his boarding pass, he steps away, his suitcase obediently rolling behind him. With a weary expression, he raises his eyebrows as he notices Natalie making her way toward him; she stoops slightly under the weight of a large, unwieldy suitcase, with a substantial black bag slung over her shoulder and an extra coat draped over it. Ryan casts a glance in her direction and lets out a soft sigh as she meets his gaze with a blank expression.\n\nInside a luggage store, Ryan is seen with intense focus as he wheels a sleek, modern wheelie case back and forth, testing its maneuverability and ease of use. Meanwhile, Natalie is crouched down on the floor, carefully transferring her belongings from her cumbersome suitcase into the more compact and organized wheelie case. Ryan briefly considers picking up a travel pillow, but upon reflection, decides it's unnecessary and carelessly tosses it aside into a nearby bin, followed by a full-size pillow. At the security checkpoint, Ryan's attention is caught by a group of businessmen, and he promptly proceeds to collect his items on the other side of the X-ray machine, while Natalie undergoes a thorough scan and removes a bracelet. Once aboard the plane, Natalie and Ryan find themselves seated side-by-side, separated only by the narrow aisle. Natalie is deeply engrossed in her work, focusing intently on her laptop, typing away with determination. Ryan glances across at her, and when their eyes meet momentarily, she briefly returns his gaze before casting a dismissive glance and immersing herself back into her work, prompting Ryan to respond with a wry smile. Upon their arrival in St. Louis, as they navigate through the terminal building, Ryan receives a call from Alex, which instantly lights up his face with a broad smile.\n\nRyan walks briskly through an expansive, open-plan office, closely accompanied by Natalie, who clutches a hefty stack of strategy packets tightly against her chest. As they make their way to a private office, the office workers can't help but cast curious glances in their direction. Once inside the office, Natalie simmers silently with palpable anger while an older, balding man holds up a cherished photo of two young girls. Seated across from the man, Ryan glances downward momentarily, with Natalie beside him, her face etched with incredulity. Bob leans back in his chair, a look of resignation in his posture, shaking his head slightly as Natalie scrutinizes Ryan with intense focus. The craggy-faced Bob regards Ryan with a thoughtful stare before glancing down at the photos of his daughters. Ryan nods to Natalie, signaling her to pick up one of the strategy packets and hand it over to Bob, who briefly examines the packet before accepting it. Later on, at the Hilton, Natalie trails behind Ryan as they enter the grand, opulent lobby. A woman standing in the queue can't help but stare at him as he strides past with confidence, making his way up to the front desk and handing over a leaflet, which is promptly snatched from his hand by the woman behind the desk. In the dining room, Ryan sits comfortably surrounded by three plates piled high with a variety of food, while Natalie listlessly pokes at her plate with her fork. Ryan gesticulates animatedly, offering a charming smile that complements his lively conversation."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "At home, he carefully reaches for pristine white T-shirts from the neatly stacked shelf, and one by one, he lays them meticulously in his open suitcase, ensuring they sit comfortably with the rest of his clothes. He then picks up his tie pouch, placing it strategically within the suitcase, before standing upright and catching sight of a cardboard cut-out. With curiosity, he picks up the photo, holding it first length-wise and then cross-wise over his suitcase, contemplating its placement. Clad in a sharp charcoal gray suit, Ryan strides with purpose through the bustling airport, pulling the case behind him, with Julie and Jim's smiling faces peeking prominently from the top. Momentarily, Ryan halts in his tracks, his gaze fixated through the glass as he witnesses Natalie in a warm embrace with a big beefy guy. Collecting his thoughts, Ryan methodically slides his swipe card through the slot of the self-service check-in machine, retrieves his boarding pass from the tray, and continues onward, his case trailing silently behind him. As Natalie appears, Ryan's eyebrows lift wearily in acknowledgment, noting her somewhat cumbersome maneuvering of a large suitcase, with a hefty black bag slung over her shoulder and a coat draped on top. With a sigh, Ryan offers her a glance, which is met with a vacant look from Natalie. Within the confines of a luggage store, Ryan repetitively wheels a new, compact wheelie case back and forth, assessing its functionality, while Natalie, knees on the floor, diligently transfers her belongings from her cumbersome suitcase to this more streamlined option. In the midst of decisions, Ryan casually discards a travel pillow before also deciding to part with a full-size pillow. As they navigate airport security, Ryan acknowledges a cluster of businessmen and then focuses on reclaiming his possessions from the conveyor belt on the other side of the X-ray machine. Meanwhile, Natalie endures a brief scan, obligingly removing a bracelet as part of the process. Onboard the aircraft, Ryan and Natalie find their seats adjacent but divided by an aisle, with Natalie immediately engrossed in typing away on her laptop. Ryan, glancing across, finds himself under her stare momentarily before she dismisses him with her eyes and returns to her task, prompting a subtle wry smile on Ryan’s lips. In St. Louis, as they traverse the terminal building, Ryan’s phone rings with an incoming call from Alex, and an unmistakable grin stretches across Ryan's face. Moving through the open-plan office with Natalie by his side, clutching a hefty pile of strategy packets, they attract the attention of office workers, silently observing as they proceed towards a private office. Inside, Natalie seethes internally with irritation as an older, balding man presents a photograph of two young girls. Positioned opposite her, Ryan casts a downward glance, with Natalie expressing disbelief at the unfolding scene. Bob sinks back into his chair with a resigned shake of his head, watching as Natalie studies Ryan, while craggy-faced Bob alternates his thoughtful gaze between Ryan and the photograph of his daughters. Ryan gives Natalie a knowing nod, prompting her to retrieve one of the strategy packets and offer it to Bob, who accepts it contemplatively. Arriving at the Hilton, Natalie trails behind Ryan into a bustling lobby, where a woman’s eyes follow Ryan as he bypasses the queue to approach the reception desk, casually handing over a leaflet, which the receptionist swiftly grabs. In the dining room, Ryan seats himself before three plates of food, relishing his meal, as Natalie sits across, absentmindedly prodding at her plate with a fork. Ryan extends his hand outward, his face brightening with a smile, attempting to diffuse the tension with his infectious warmth."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "At home, he efficiently packs his suitcase with clothes and a tie pouch before pausing to inspect a cardboard cut-out photo of Julie and Jim, placing it carefully over his belongings. Dressed sharply in a charcoal gray suit, Ryan navigates the airport with his suitcase, halting briefly to notice Natalie embracing someone outside. After obtaining his boarding pass at a self-service kiosk, he moves on, observing Natalie as she enters with a large suitcase and a heavy shoulder bag. Ryan looks at her with a sigh, while she gives him a blank stare.\n\nIn a luggage store, Ryan wheels a new suitcase as Natalie transfers her items from a larger suitcase into a neater, smaller case. He throws away a travel pillow and a full-size pillow. At security, he collects his belongings as Natalie gets scanned and removes a bracelet. On the plane, they sit across the aisle from each other, with Natalie typing on her laptop. Ryan glances at her, and after meeting his gaze briefly, she dismissively returns to work, prompting a wry smile from him.\n\nIn St. Louis, they traverse the terminal together, and Ryan receives a call from Alex that brings a smile to his face. Walking through an office with Natalie, who carries strategy packets, they attract attention heading to a private office. There, an older man named Bob shows them a photo of two young girls. Ryan shares a glance with Natalie, who hands Bob a strategy packet, which he accepts while contemplating his daughters' photo.\n\nAt the Hilton, Natalie follows Ryan into the lobby where they bypass a queue, and he hands a leaflet to a woman at the desk. In the dining room, Ryan sits with multiple plates of food, gesturing and smiling, while Natalie pokes at her plate with her fork."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "At home, he takes pristine white T-shirts off a shelf, carefully preserving their crisp condition, and lays them in his suitcase with the rest of his clothes, then he packs his tie pouch, which contains a collection of silk ties for his business meetings, straightens up, and sees the cardboard cut-out. He picks up the photo, a reminder of happier times, and holds it over his case length-wise and cross-wise. Wearing a sharp charcoal gray suit, an emblem of professionalism, Ryan walks through the bustling airport, dragging the case, with Julie and Jim's smiling faces poking out of the top. Ryan stops and stares; outside, Natalie, his long-time partner, is embracing a big beefy guy, who appears to be an old friend. Ryan slides his swipe card through the slot on the self-service check-in machine, a fixture of most modern airports, then collects his boarding pass and steps away with his case in tow. He wearily raises his eyebrows as he watches Natalie come in, and she stoops slightly as she drags a large unwieldy suitcase that has accompanied her on many journeys, with a large black bag slung over her shoulder and a coat over. Ryan looks at her and sighs, while she looks blank, perhaps lost in her thoughts. At a luggage store, Ryan wheels a wheelie case back and forth, carefully testing its maneuverability, and Natalie kneels on the floor transferring her belongings from her hefty suitcase to the neater, smaller wheelie case. Ryan grabs a travel pillow, an item he's found indispensable on previous flights, and bins it, then bins a full-size pillow he realizes he won't need. At security, Ryan sees a group of businessmen, frequent travelers with their sleek carry-ons, and collects his things on the other side of the X-ray machine, while Natalie is being scanned and takes off a bracelet, likely to avoid setting off the detector. On the plane, she and Ryan sit side-by-side with the aisle between them, and Natalie types on her laptop, working on a presentation for the upcoming conference. Ryan looks across at her, she stares at him, then with a dismissive glance, she gets back to work, and Ryan smiles wryly, recognizing her determination. In St. Louis, a city known for its iconic Gateway Arch, as they walk through the terminal building, Ryan gets a call from Alex, a close friend who's been a great support, and a smile spreads across Ryan's face. Ryan walks through an open-plan office with Natalie, who's clutching a pile of strategy packets, vital for the meeting, as office workers stare at them heading to a private office. Natalie silently seethes while an older balding man holds up a photo of two young girls, his daughters, reminding them of the work-life balance they discuss. Sitting opposite him, Ryan glances down, with Natalie beside him, incredulous at the turn of events. Bob sits back resigned, shaking his head, as Natalie studies Ryan, and craggy-faced Bob, reflecting on decades of corporate experience, stares at Ryan thoughtfully and glances down at the photos of his girls. Ryan nods to Natalie, who picks up one of the strategy packets and hands it to Bob, who looks at the packet, which holds key insights for their business venture, and takes it. At the Hilton, one of the premier hotels in the city, Natalie follows Ryan into the lobby, as a woman, part of the hotel staff, stares at him while he walks past the queue and up to the desk, handing her a leaflet containing information on their stay, which she snatches. In the dining room, Ryan sits with three plates of food, sampling the diverse options available, and Natalie sits, poking at her plate of food with her fork, lost in thought. Ryan throws out his hand and smiles, inviting her to share in the meal and moment."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "At home he takes pristine white Tshirts off a shelf and lays them in his suitcase with the rest of his clothes. then he packs his tie pouch straightens up and sees the cardboard cutout. He picks up the photo and holds it over his case lengthwise and crosswise. Wearing a sharp charcoal gray suit Ryan walks through the airport dragging the case with Julie and Jim's smiling faces poking out of the top. Ryan stops and stares outside. Natalie is embracing a big beefy guy. Ryan slides his swipe card through the slot on the selfservice checkin machine then collects his boarding pass and steps away with his case in tow. He wearily raises his eyebrows as he watches Natalie come in and she stoops slightly as she drags a large unwieldy suitcase with a large black bag slung over her shoulder and a coat over. Ryan looks at her and sighs while she looks blank. At a luggage store Ryan wheels a wheelie case back and forth and Natalie kneels on the floor transferring her belongings from her hefty suitcase to the neater smaller wheelie case. Ryan grabs a travel pillow and bins it. then bins a fullsize pillow. At security Ryan sees a group of businessmen and collects his things on the other side of the Xray machine while Natalie is being scanned and takes off a bracelet. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the plane she and Ryan sit sidebyside with the aisle between them and Natalie types on her laptop. Ryan looks across at her. she stares at him then with a dismissive glance. she gets back to work and Ryan smiles wryly. In St Louis as they walk through the terminal building Ryan gets a call from Alex and a smile spreads across Ryan's face. Ryan walks through an openplan office with Natalie who is clutching a pile of strategy packets as office workers stare at them heading to a private office. Natalie silently seethes while an older balding man holds up a photo of two young girls. Sitting opposite him. Ryan glances down with Natalie beside him incredulous. Bob sits back resigned shaking his head as Natalie studies Ryan and craggyfaced Bob stares at Ryan thoughtfully and glances down at the photos of his girls. Ryan nods to Natalie who picks up one of the strategy packets and hands it to Bob who looks at the packet and takes it. At the Hilton Natalie follows Ryan into the lobby as a woman stares at him while he walks past the queue and up to the desk handing her a leaflet which she snatches. In the dining room Ryan sits with three plates of food and Natalie sits poking at her plate of food with her fork. Ryan throws out his hand and smiles."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "At home he takes pristine white Tshirts off a shelf and lays them in his suitcase with the rest of his clothes. then he packs his tie pouch straightens up and sees the cardboard cutout. He picks up the photo and holds it over his case lengthwise and crosswise. Wearing a sharp charcoal gray suit Ryan walks through the airport dragging the case with Julie and Jim's smiling faces poking out of the top. Ryan stops and stares outside. Natalie is embracing a big beefy guy. Ryan slides his swipe card through the slot on the selfservice checkin machine then collects his boarding pass and steps away with his case in tow. He wearily raises his eyebrows as he watches Natalie come in and she stoops slightly as she drags a large unwieldy suitcase with a large black bag slung over her shoulder and a coat over. Ryan looks at her and sighs while she looks blank. At a luggage store Ryan wheels a wheelie case back and forth and Natalie kneels on the floor transferring her belongings from her hefty suitcase to the neater smaller wheelie case. Ryan grabs a travel pillow and bins it. then bins a fullsize pillow. At security Ryan sees a group of businessmen and collects his things on the other side of the Xray machine while Natalie is being scanned and takes off a bracelet. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On the plane she and Ryan sit sidebyside with the aisle between them and Natalie types on her laptop. Ryan looks across at her. she stares at him then with a dismissive glance. she gets back to work and Ryan smiles wryly. In St Louis as they walk through the terminal building Ryan gets a call from Alex and a smile spreads across Ryan's face. Ryan walks through an openplan office with Natalie who is clutching a pile of strategy packets as office workers stare at them heading to a private office. Natalie silently seethes while an older balding man holds up a photo of two young girls. Sitting opposite him. Ryan glances down with Natalie beside him incredulous. Bob sits back resigned shaking his head as Natalie studies Ryan and craggyfaced Bob stares at Ryan thoughtfully and glances down at the photos of his girls. Ryan nods to Natalie who picks up one of the strategy packets and hands it to Bob who looks at the packet and takes it. At the Hilton Natalie follows Ryan into the lobby as a woman stares at him while he walks past the queue and up to the desk handing her a leaflet which she snatches. In the dining room Ryan sits with three plates of food and Natalie sits poking at her plate of food with her fork. Ryan throws out his hand and smiles."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "At home he takes pristine white Tshirts off a shelf and lays them in his suitcase with the rest of his clothes. then he packs his tie pouch straightens up and sees the cardboard cutout. He picks up the photo and holds it over his case lengthwise and crosswise. Wearing a sharp charcoal gray suit Ryan walks through the airport dragging the case with Julie and Jim's smiling faces poking out of the top. Ryan stops and stares outside. Natalie is embracing a big beefy guy. Ryan slides his swipe card through the slot on the selfservice checkin machine then collects his boarding pass and steps away with his case in tow. Sitting opposite him. Ryan glances down with Natalie beside him incredulous. Bob sits back resigned shaking his head as Natalie studies Ryan and craggyfaced Bob stares at Ryan thoughtfully and glances down at the photos of his girls. Ryan nods to Natalie who picks up one of the strategy packets and hands it to Bob who looks at the packet and takes it. At the Hilton Natalie follows Ryan into the lobby as a woman stares at him while he walks past the queue and up to the desk handing her a leaflet which she snatches. In the dining room Ryan sits with three plates of food and Natalie sits poking at her plate of food with her fork. Ryan throws out his hand and smiles."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "At home he takes pristine white Tshirts off a shelf and lays them in his suitcase with the rest of his clothes. then he packs his tie pouch straightens up and sees the cardboard cutout. He picks up the photo and holds it over his case lengthwise and crosswise. At the Hilton Natalie follows Ryan into the lobby as a woman stares at him while he walks past the queue and up to the desk handing her a leaflet which she snatches. In the dining room Ryan sits with three plates of food and Natalie sits poking at her plate of food with her fork. Ryan throws out his hand and smiles."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "In the forest, the cat pulls colorful kites out of a drawer and tosses them into its backpack with the rest of its books, then it stuffs its glove bag, straightens its goggles, and sees the metal statue. The cat picks up the map and dangles it over its bag length-wise and cross-wise. Wearing a shiny emerald green cape, Max skips through the harbor, dragging the bag, with Lily and Sam's frowning faces peeking out of the top. Max halts and gawks; nearby, Charlie is tickling a tiny fluffy kitten. Max flips his magic card through the notch on the vending ticket machine, then gathers his lottery ticket and hops away with his bag in tow. He lazily flicks his eyelashes as he watches Charlie stroll in, and she crouches slightly as she heaves a tiny cumbersome trunk, with a tiny red hat perched over her helmet and a scarf over. Max glances at her and groans, while she looks vacant. At a candy shop, Max rolls a shopping cart back and forth, and Charlie squats on the ground shifting her gadgets from her bulky trunk to the sleeker, tinier shopping cart. Max snatches a water bottle and hides it, then hides a massive bottle. At customs, Max spots a flock of hikers and gathers his treasures on the opposite side of the conveyor belt, while Charlie is being weighed and removes a hat. On the train, she and Max sit side-by-side with the wall separating them, and Charlie taps on her typewriter. Max peers over at her, she glares at him, then with a contemptuous look, she returns to typing, and Max grins slyly. In Miami, as they skip through the station hallway, Max receives a message from Jordan, and a grin spreads across Max's muzzle. Max skips through a crowded bazaar with Charlie, who's clutching a bundle of recipe leaflets, as merchants gawk at them heading to a hidden inn. Charlie silently frowns while an older bearded wizard holds up a portrait of two young dragons. Sitting opposite him, Max glances downward, with Charlie beside him, bewildered. Harry reclines back exhausted, shaking his shoulders, as Charlie scrutinizes Max, and grizzled Harry gapes at Max pensively and peers down at the portraits of his dragons. Max gestures to Charlie, who lifts one of the recipe leaflets and passes it to Harry, who inspects the leaflet and receives it. At the Marriott, Charlie tails Max into the foyer, as a girl gawks at him while he skips past the throng and up to the counter, handing her a brochure, which she grabs. In the banquet hall, Max lounges with three bowls of ice cream, and Charlie sits, prodding at her bowl of ice cream with her spoon. Max flings out his paw and beams."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Ryan packs his suitcase meticulously at home, including a photo cut-out of smiling faces, before heading to the airport in a sharp suit. On his journey, Ryan sees Natalie with a large suitcase and watches her struggle to transfer her belongings into a smaller case at a store. They both proceed through airport security, with Natalie losing a bracelet during scanning. On the plane, they sit across the aisle from each other, with Natalie engrossed in her laptop work and Ryan offering a wry smile. In St. Louis, Ryan's mood lifts after receiving a call from Alex. They enter an office where Natalie, clutching strategy packets, is frustrated with the situation as Ryan interacts with Bob over family photos. Ryan cues Natalie to hand a strategy packet to Bob. At the Hilton, Ryan confidently bypasses the queue while Natalie follows, eventually dining with him as he gestures amicably."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Ryan throws out his hand and smiles In the dining room Ryan sits with three plates of food and Natalie sits poking at her plate of food with her fork At the Hilton Natalie follows Ryan into the lobby as a woman stares at him while he walks past the queue and up to the desk handing her a leaflet which she snatches Ryan nods to Natalie who picks up one of the strategy packets and hands it to Bob who looks at the packet and takes it Bob sits back resigned shaking his head as Natalie studies Ryan and craggyfaced Bob stares at Ryan thoughtfully and glances down at the photos of his girls Ryan glances down with Natalie beside him incredulous Sitting opposite him Natalie silently seethes while an older balding man holds up a photo of two young girls Ryan walks through an openplan office with Natalie who is clutching a pile of strategy packets as office workers stare at them heading to a private office In St Louis as they walk through the terminal building Ryan gets a call from Alex and a smile spreads across Ryan's face she gets back to work and Ryan smiles wryly she stares at him then with a dismissive glance Ryan looks across at her On the plane she and Ryan sit sidebyside with the aisle between them and Natalie types on her laptop At security Ryan sees a group of businessmen and collects his things on the other side of the Xray machine while Natalie is being scanned and takes off a bracelet then bins a fullsize pillow Ryan grabs a travel pillow and bins it At a luggage store Ryan wheels a wheelie case back and forth and Natalie kneels on the floor transferring her belongings from her hefty suitcase to the neater smaller wheelie case Ryan looks at her and sighs while she looks blank He wearily raises his eyebrows as he watches Natalie come in and she stoops slightly as she drags a large unwieldy suitcase with a large black bag slung over her shoulder and a coat over Ryan slides his swipe card through the slot on the selfservice checkin machine then collects his boarding pass and steps away with his case in tow Natalie is embracing a big beefy guy Ryan stops and stares outside Wearing a sharp charcoal gray suit Ryan walks through the airport dragging the case with Julie and Jim's smiling faces poking out of the top He picks up the photo and holds it over his case lengthwise and crosswise then he packs his tie pouch straightens up and sees the cardboard cutout At home he takes pristine white Tshirts off a shelf and lays them in his suitcase with the rest of his clothes"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "then he packs his tie pouch straightens up and sees the cardboard cutout At home he takes pristine white Tshirts off a shelf and lays them in his suitcase with the rest of his clothes Wearing a sharp charcoal gray suit Ryan walks through the airport dragging the case with Julie and Jim's smiling faces poking out of the top He picks up the photo and holds it over his case lengthwise and crosswise Natalie is embracing a big beefy guy Ryan stops and stares outside He wearily raises his eyebrows as he watches Natalie come in and she stoops slightly as she drags a large unwieldy suitcase with a large black bag slung over her shoulder and a coat over Ryan slides his swipe card through the slot on the selfservice checkin machine then collects his boarding pass and steps away with his case in tow At a luggage store Ryan wheels a wheelie case back and forth and Natalie kneels on the floor transferring her belongings from her hefty suitcase to the neater smaller wheelie case Ryan looks at her and sighs while she looks blank then bins a fullsize pillow Ryan grabs a travel pillow and bins it On the plane she and Ryan sit sidebyside with the aisle between them and Natalie types on her laptop At security Ryan sees a group of businessmen and collects his things on the other side of the Xray machine while Natalie is being scanned and takes off a bracelet she stares at him then with a dismissive glance Ryan looks across at her In St Louis as they walk through the terminal building Ryan gets a call from Alex and a smile spreads across Ryan's face she gets back to work and Ryan smiles wryly Natalie silently seethes while an older balding man holds up a photo of two young girls Ryan walks through an openplan office with Natalie who is clutching a pile of strategy packets as office workers stare at them heading to a private office Ryan glances down with Natalie beside him incredulous Sitting opposite him Ryan nods to Natalie who picks up one of the strategy packets and hands it to Bob who looks at the packet and takes it Bob sits back resigned shaking his head as Natalie studies Ryan and craggyfaced Bob stares at Ryan thoughtfully and glances down at the photos of his girls In the dining room Ryan sits with three plates of food and Natalie sits poking at her plate of food with her fork At the Hilton Natalie follows Ryan into the lobby as a woman stares at him while he walks past the queue and up to the desk handing her a leaflet which she snatches Ryan throws out his hand and smiles"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Ryan looks across at her she stares at him then with a dismissive glance she gets back to work and Ryan smiles wryly In St Louis as they walk through the terminal building Ryan gets a call from Alex and a smile spreads across Ryan's face Ryan walks through an openplan office with Natalie who is clutching a pile of strategy packets as office workers stare at them heading to a private office Natalie silently seethes while an older balding man holds up a photo of two young girls Sitting opposite him Ryan glances down with Natalie beside him incredulous Bob sits back resigned shaking his head as Natalie studies Ryan and craggyfaced Bob stares at Ryan thoughtfully and glances down at the photos of his girls Ryan nods to Natalie who picks up one of the strategy packets and hands it to Bob who looks at the packet and takes it At the Hilton Natalie follows Ryan into the lobby as a woman stares at him while he walks past the queue and up to the desk handing her a leaflet which she snatches In the dining room Ryan sits with three plates of food and Natalie sits poking at her plate of food with her fork Ryan throws out his hand and smiles At home he takes pristine white Tshirts off a shelf and lays them in his suitcase with the rest of his clothes then he packs his tie pouch straightens up and sees the cardboard cutout He picks up the photo and holds it over his case lengthwise and crosswise Wearing a sharp charcoal gray suit Ryan walks through the airport dragging the case with Julie and Jim's smiling faces poking out of the top Ryan stops and stares outside Natalie is embracing a big beefy guy Ryan slides his swipe card through the slot on the selfservice checkin machine then collects his boarding pass and steps away with his case in tow He wearily raises his eyebrows as he watches Natalie come in and she stoops slightly as she drags a large unwieldy suitcase with a large black bag slung over her shoulder and a coat over Ryan looks at her and sighs while she looks blank At a luggage store Ryan wheels a wheelie case back and forth and Natalie kneels on the floor transferring her belongings from her hefty suitcase to the neater smaller wheelie case Ryan grabs a travel pillow and bins it then bins a fullsize pillow At security Ryan sees a group of businessmen and collects his things on the other side of the Xray machine while Natalie is being scanned and takes off a bracelet On the plane she and Ryan sit sidebyside with the aisle between them and Natalie types on her laptop"
        }
      ]
    }
  ]
}