{
  "ground_truth": "Natalie's taken aback as Ryan grins when they arrive at the hotel. Natalie's face crumples, and she starts to sob. Ryan frowns awkwardly and holds out his hands as she falls into his arms. Ryan then sees Alex and gives her a little embarrassed wave. She comes over, and Natalie shoots Ryan a look before frowning. Natalie raises a drink to her lips as Alex smiles broadly. Natalie looks down thoughtfully, and Ryan gives an I-told-you-so look as Natalie appears uncertain. They walk through the lobby and go to the registration desk for the Alpha-tech party. Ryan and Alex casually pick up name badges and neck bands, and, looking a bit shifty, Natalie does the same and follows them around a corner. The threesome clip their name badges to their neck bands and hang them around their necks. Alex reads Natalie's name badge. At the party in the hotel ballroom, Natalie, Alex, and Ryan are at the bar getting drinks. They turn around and survey the scene where people stand at small white tables with shiny balloons floating on ribbons above them. Ryan, Natalie, and Alex go stand around a table, and Natalie has a gulp from her drink. She nods and smiles, looks at Alex, and then walks onto the dance floor. Alex grabs Ryan, and they dance together while Natalie wanders about on her own, moving to the music. A young guy with a stubbly chin bops about and notices Natalie. He leans to her, and she smiles, then looks at her name badge. A DJ on the stage is a big black guy, and Ryan and Alex have their picture taken in front of a backdrop of a giant wave. They squat, hold out their arms, and pretend they're surfing. Natalie and Dave pose for pictures, and a bit drunk, she drapes herself all over him. Dave holds Natalie up as they leave the photo area. On the dance floor, Alex and Ryan face each other and shout while everyone points in the air and jumps around. Later, Ryan and Alex are at the table where he hands her a key card, and they both smile. Natalie sings karaoke on a yacht in the harbor as a few drunken party guests, including Dave, are there. Alex and Ryan sit on a platform at the back of the yacht, and he dangles his feet in the clear, blue water. They gaze at each other, then share a lingering kiss. The power fails, and all the lights in the yacht go out. Ryan and Alex look back toward the city lights, some distance away. Everyone gets a ride back to land in a small pontoon boat. They jog up onto the sandy beach, and a courtesy bus delivers the group to the hotel. They run into the entrance barefoot, and Ryan wakes up in bed.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Natalie's surprised as Ryan beams when they reach at the inn. Natalie's visage crumples, and she begins to weep. Ryan scowls clumsily and extends out his arms as she collapses into his embrace. Ryan then notices Alex and offers her a little sheepish salute. She approaches, and Natalie shoots Ryan a glance before scowling. Natalie lifts a beverage to her lips as Alex beams widely. Natalie gazes down pensively, and Ryan gives an I-told-you-so expression as Natalie seems uncertain. They stroll through the foyer and go to the registration counter for the Alpha-tech gathering. Ryan and Alex nonchalantly pick up identification tags and lanyards, and, looking a bit secretive, Natalie does the same and follows them around a bend. The trio attach their identification tags to their lanyards and drape them around their throats. Alex reads Natalie's identification tag. At the gathering in the hotel ballroom, Natalie, Alex, and Ryan are at the bar acquiring beverages. They rotate around and examine the scene where individuals stand at small white tables with shiny balloons floating on ribbons above them. Ryan, Natalie, and Alex go stand around a table, and Natalie takes a gulp from her beverage. She nods and beams, glances at Alex, and then strides onto the dance floor. Alex clutches Ryan, and they dance together while Natalie roams about on her own, swaying to the music. A young chap with a bristly chin bops about and notices Natalie. He leans toward her, and she beams, then glances at her identification tag. A DJ on the platform is a big black guy, and Ryan and Alex have their picture taken in front of a backdrop of a giant wave. They crouch, extend out their arms, and act like they're surfing. Natalie and Dave pose for pictures, and a bit inebriated, she drapes herself all over him. Dave supports Natalie as they leave the photo zone. On the dance floor, Alex and Ryan face each other and shout while everyone gestures in the air and hops around. Later, Ryan and Alex are at the table where he hands her a key card, and they both beam. Natalie sings karaoke on a yacht in the harbor as a few inebriated gathering guests, including Dave, are there. Alex and Ryan sit on a platform at the back of the yacht, and he dangles his feet in the clear, blue water. They stare at each other, then share a prolonged kiss. The power fails, and all the lights in the yacht go out. Ryan and Alex glance back toward the city lights, some distance away. Everyone gets a ride back to land in a small pontoon boat. They jog up onto the sandy shore, and a courtesy bus delivers the group to the hotel. They run into the entrance barefoot, and Ryan wakes up in bed."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Natalie is taken aback as a grin is flashed by Ryan when the hotel is arrived at by them. Natalie's face is crumpled, and sobbing is started by her. Awkwardly frowning, Ryan's hands are held out as she falls into his arms. Alex is then seen by Ryan, and a little embarrassed wave is given to her by him. She comes over, and a look is shot at Ryan by Natalie before a frown is shown. A drink is raised to her lips by Natalie as Alex broadly smiles. Thoughtfully, down is looked by Natalie, and an I-told-you-so look is given by Ryan as Natalie appears uncertain. Through the lobby, they walk and the registration desk for the Alpha-tech party is gone to by them. Name badges and neck bands are casually picked up by Ryan and Alex, and, looking a bit shifty, the same is done by Natalie who also follows them around a corner. Name badges are clipped to their neck bands and hung around their necks by the threesome. Natalie's name badge is read by Alex. At the party in the hotel ballroom, drinks are gotten by Natalie, Alex, and Ryan at the bar. Around, they turn and the scene is surveyed by them where small white tables with shiny balloons floating on ribbons above are stood around by people. Around a table is gone by Ryan, Natalie, and Alex to stand, and a gulp from her drink is taken by Natalie. She nods and smiles, looks at Alex, then the dance floor is walked onto by her. Ryan is grabbed by Alex, and together they dance while on her own, moving to the music, Natalie wanders about. A young guy with a stubbly chin bops and notices Natalie. He leans toward her, and a smile is given by her, then the name badge is looked at by her. On the stage, a big black guy is the DJ, and Ryan and Alex have their picture taken in front of a backdrop of a giant wave. They squat, arms are held out, and they pretend surfing is done by them. Pose for pictures are done by Natalie and Dave, and a bit drunk, she is draped all over him. Natalie is held up by Dave as the photo area is left by them. On the dance floor, each other is faced by Alex and Ryan, and shouting is done by them while in the air, pointing is done by everyone, and jumping around occurs. Later, at the table is Ryan and Alex where a key card is handed to her by him, and smiles are exchanged by them. Karaoke is sung by Natalie on a yacht in the harbor as a few drunken party guests, including Dave, are there. On a platform at the back of the yacht sit Alex and Ryan, and dangling is done by him with his feet in the clear, blue water. Gaze at each other is done by them, then a lingering kiss is shared. The power fails, and all the lights on the yacht go out. Back toward the city lights, some distance away, Ryan and Alex look. A ride back to land in a small pontoon boat is gotten by everyone. Up onto the sandy beach, they jog, and the group is delivered to the hotel by a courtesy bus. Barefoot, the entrance is run into by them, and Ryan is woken up in bed."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Natalie is surprised as Ryan grins upon arriving at the hotel. Her face crumples, and she starts sobbing. Ryan awkwardly offers comfort, and they spot Alex, who joins them. Natalie gives Ryan a look before frowning. She sips her drink while Alex smiles broadly. Ryan smirks as Natalie appears unsure. They head to the lobby's registration desk for the Alpha-tech party. Ryan and Alex casually grab name badges and lanyards while a hesitant Natalie follows. They attach badges to their lanyards. At the hotel ballroom party, the trio gets drinks at the bar and surveys the scene, where guests stand at white tables with shiny balloons. They join a table, and Natalie, drinking, smiles and nods, then heads to the dance floor. Alex grabs Ryan, and they dance while Natalie moves solo to the music. A young guy with stubble notices Natalie, who smiles and glances at her name badge. A DJ plays music, and Ryan and Alex pose in front of a wave backdrop, pretending to surf. Natalie and Dave take photos, and she, a bit tipsy, leans on him. Dave supports her as they leave the photo area. On the dance floor, Alex and Ryan shout and jump with the crowd. Later, Ryan gives Alex a key card, and they smile. Natalie sings karaoke on a harbor yacht with tipsy guests, including Dave. Alex and Ryan sit at the yacht's back platform, feet in the water, share a kiss, and the power suddenly fails, plunging the yacht into darkness. They look toward the distant city lights. Everyone returns to land on a small pontoon boat, jogs up the beach, and takes a courtesy bus back to the hotel. They run in barefoot, and Ryan wakes up in bed."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Natalie is shocked as Ryan grins at the hotel. She starts to cry, and he awkwardly consoles her. Ryan spots Alex, waves, and Natalie frowns. Natalie takes a drink as Alex smiles, and Ryan appears smug as Natalie looks unsure. They head to the registration desk for the Alpha-tech party. The three pick up name badges, clip them on, and proceed. At the hotel ballroom, they get drinks and observe the scene. Natalie drinks, smiles, and then dances alone. A young guy notices and talks to her. A big DJ plays, and Ryan and Alex pose for silly photos. Natalie and Dave take pictures, and a bit tipsy, she leans on him. On the dance floor, Alex and Ryan shout with the crowd. Later, Ryan hands Alex a key card, and they smile. Natalie sings karaoke on a yacht with drunken guests, including Dave. Alex and Ryan share a kiss, and after a power outage, everyone returns to land by pontoon boat. They reach the hotel barefoot, and Ryan wakes up in bed."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Natalie is taken completely aback as she notices Ryan grinning broadly when they finally arrive at the bustling hotel. Her face crumples in a wave of emotion, and she begins to sob uncontrollably. Ryan, feeling awkward and unsure of how to react, frowns slightly and holds out his hands in an attempt to console her, as she collapses into his arms. At that moment, Ryan sees Alex nearby and gives her a somewhat embarrassed little wave. She quickly comes over to join them, and Natalie shoots Ryan a piercing look before frowning deeply. Natalie, trying to steady herself, raises a drink to her lips, while Alex beams with a broad, cheerful smile. Natalie looks down thoughtfully, appearing uncertain, while Ryan gives her a look that seems to say, \"I told you so.\" They proceed to walk through the busy lobby and make their way to the registration desk for the much-anticipated Alpha-tech party. Ryan and Alex effortlessly pick up their name badges and neck bands in a casual manner, while Natalie, looking a bit shifty, does the same and goes on to follow them around a corner. The three friends clip their name badges to their neck bands and hang them around their necks. Alex takes a moment to read Natalie's name badge. At the lively party held in the hotel's grand ballroom, Natalie, Alex, and Ryan are seen at the bustling bar, getting drinks. They turn around and take a moment to survey the scene, where guests stand at glossy white tables adorned with shiny balloons floating on ribbons above them. Ryan, Natalie, and Alex make their way to stand around one of the tables, and Natalie takes a hearty gulp from her drink. She nods and smiles, glances at Alex, and then decides to walk onto the dance floor. Alex eagerly grabs Ryan, and they start dancing together, while Natalie wanders about on her own, moving to the rhythm of the music. A young man with a stubbly chin is bopping about and happens to notice Natalie. He leans toward her, and she smiles warmly at him, then she glances down at her name badge. On the stage, a DJ, a big black guy, spins tunes, and Ryan and Alex have their picture taken in front of a backdrop featuring a giant wave. They squat down, hold out their arms, and pretend they are surfing on the wave. Meanwhile, Natalie and Dave pose for pictures, and feeling a bit drunk, she drapes herself all over him. Dave helps hold Natalie up as they leave the bustling photo area. On the crowded dance floor, Alex and Ryan face each other, shouting joyfully, while everyone around them points in the air and jumps energetically. Later on, Ryan and Alex find themselves at the table where he hands her a key card, and they exchange smiles of shared understanding. Meanwhile, Natalie finds herself singing karaoke on a yacht in the harbor, accompanied by a few drunken party guests, including Dave. Alex and Ryan are seated on a platform at the back of the yacht, and he dangles his feet in the clear, blue water. They gaze deeply into each other's eyes and share a lingering, romantic kiss. Suddenly, the power fails, and all the lights on the yacht go out, plunging the scene into darkness. Ryan and Alex look back toward the twinkling city lights, which are now some distance away. Everyone gets a ride back to land in a small pontoon boat, and they jog up onto the sandy beach. A courtesy bus then delivers the group back to the hotel, and they run into the entrance, happily barefoot. Eventually, Ryan wakes up in his bed."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Natalie is utterly taken by surprise as she observes Ryan grinning from ear to ear when they eventually arrive at the busy and bustling hotel. Her expression crumples under a wave of overwhelming emotion, and she starts to sob uncontrollably. Ryan, feeling awkward and somewhat unsure of how to respond appropriately, frowns slightly and extends his hands in an attempt to offer consolation, as she collapses into his embrace. At that precise moment, Ryan catches sight of Alex nearby and gives her a somewhat embarrassed, little wave of acknowledgment. She quickly comes over to join them, and Natalie shoots Ryan a piercing and intense look before she frowns deeply. Trying to regain her composure and steady herself, Natalie raises a drink to her lips, while Alex beams with a broad and cheerful smile. Natalie looks downward thoughtfully, appearing quite uncertain, while Ryan gives her a look that seems to say, \"I told you so.\" They proceed to walk through the lively lobby, making their way purposefully to the registration desk for the much-anticipated Alpha-tech party. Ryan and Alex effortlessly collect their name badges and neck bands in a laid-back manner, while Natalie, looking a tad shifty, does the same and then follows them around a corner. The trio of friends clips their name badges to their neck bands and hangs them around their necks. Alex takes a moment to read the name badge worn by Natalie. At the vibrant party held in the grand ballroom of the hotel, Natalie, Alex, and Ryan find themselves at the bustling bar, getting drinks for themselves. They turn around and pause to survey the lively scene, where guests stand at glossy white tables that are adorned with shiny balloons floating gracefully on ribbons above them. Ryan, Natalie, and Alex make their way to stand around one of the tables, and Natalie takes a hearty gulp from her drink. She nods and smiles, glancing at Alex, and then decides to make her way onto the dance floor. Alex eagerly grabs Ryan, and together they start dancing, while Natalie wanders around on her own, moving naturally to the rhythm of the music. A young man with a stubbly chin is bopping around and happens to notice Natalie. He leans toward her, and she offers him a warm and friendly smile, then she glances down at her name badge. On the stage, a DJ, a big black guy, is spinning tunes, and Ryan and Alex have their picture taken in front of a backdrop that features a giant wave. They squat down, hold out their arms playfully, and pretend they are surfing on the wave. Meanwhile, Natalie and Dave pose for pictures, and feeling a bit tipsy, she drapes herself playfully all over him. Dave helps hold Natalie up as they leave the buzzing photo area. On the crowded dance floor, Alex and Ryan face each other, shouting joyfully, while everyone surrounding them points in the air and jumps energetically. Later on, Ryan and Alex find themselves back at the table where he hands her a key card, and they exchange smiles of mutual understanding and shared delight. Meanwhile, Natalie finds herself performing karaoke on a yacht in the harbor, joined by a few drunken party guests, including Dave. Alex and Ryan are seated comfortably on a platform at the back of the yacht, and he leisurely dangles his feet in the clear, blue water. They gaze deeply into each other's eyes and share a lingering and romantic kiss. Suddenly, the power unexpectedly fails, and all the lights on the yacht go out, plunging the scene into darkness. Ryan and Alex look back toward the twinkling city lights, which are now some distance away. Everyone gets a ride back to land in a small pontoon boat, and they jog up onto the sandy beach with joyful excitement. A courtesy bus then delivers the group back to the hotel, and they run into the entrance, their feet happily bare. Eventually, Ryan wakes up in his own bed."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As Natalie and Ryan arrive at the hotel, Natalie's demeanor shifts suddenly as she takes in Ryan's grinning face, her own expression crumpling as emotions overwhelm her, leading her to sob softly. Ryan, feeling awkward in this unexpected situation, furrows his brows and extends his arms in an attempting to comfort her, into which Natalie readily falls, seeking solace. At that moment, Ryan catches sight of Alex, and with a sense of mild embarrassment, he manages a small wave in her direction. Alex approaches them, causing a silent exchange between Natalie and Ryan, as Natalie directs a pointed look at Ryan before her features settle into a frown. In an attempt to mask her discomfort, Natalie brings a drink to her lips while Alex beams with a broad smile. Natalie then looks down, lost in thought, while Ryan offers her a knowing glance that silently communicates an \"I-told-you-so\" sentiment, her uncertainty still lingering. Together, the trio traverses the expanse of the hotel lobby to find the registration desk for the Alpha-tech party. With an air of nonchalance, Ryan and Alex retrieve their name badges along with the accompanying neck bands, actions mirrored by a slightly hesitant and shifty Natalie, who promptly follows their lead around a corner. They proceed to attach their name badges to the neck bands, securely placing them around their necks, a moment during which Alex takes a moment to read Natalie's badge. As they enter the vibrant hotel ballroom where the party is in full swing, Natalie, Alex, and Ryan gather at the bar, procuring drinks before turning back to assess the lively scene, eyes scanning the clusters of people mingling around small white tables adorned with shiny balloons bobbing gently on their ribbon strings. The three friends move to stand around one of the tables, where Natalie takes a hearty gulp from her drink, nods in acknowledgment, and smiles, her gaze drifting to Alex before she feels the pull of the dance floor beckoning her. As she steps onto the dance floor, Alex intuitively grabs Ryan, and they join in the rhythm together, dancing as Natalie ventures further into the crowd, letting the music guide her steps. Amidst the energy of the dance floor, a young guy with a stubbly chin catches sight of Natalie, his movements in sync with the beat as he leans toward her, drawing a smile from Natalie, who then casts a brief glance at her name badge. Nearby on stage, a DJ, a large black man, commands the music, while elsewhere, Ryan and Alex pose playfully in front of a backdrop depicting a giant wave, crouching down, arms extended as though surfing the imaginary tide. In another corner, Natalie and Dave strike a pose for the camera, and, slightly inebriated, she leans onto him with abandon, prompting Dave to support her as they exit the photo area. Back on the dance floor, Alex and Ryan face each other, shouting above the music, while the crowd around them points skyward and jumps energetically. Later on, back at the table, Ryan hands Alex a key card, a gesture that ignites shared smiles between them. Meanwhile, aboard a yacht in the harbor, Natalie takes the stage for karaoke, surrounded by a few intoxicated party guests, including Dave. As the night deepens, Alex and Ryan find a quiet moment on a platform at the yacht's rear, where Ryan dangles his feet in the cool, clear blue water below. Their eyes meet, and they share a lingering, tender kiss. Suddenly, the yacht is plunged into darkness as the power fails, extinguishing all the lights aboard. From the back of the yacht, Ryan and Alex turn their gaze toward the distant city lights, a flickering beacon against the night. Eventually, everyone is ferried back to land aboard a small pontoon boat, which speeds across the water, delivering them to the sandy shores. They leap from the boat, jogging up the beach, where a courtesy bus awaits, ready to shuttle the group back to the hotel. Upon arrival, they dash through the entrance, carefree and barefoot, before the scene fades with Ryan awakening in bed."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Natalie is taken aback when she and Ryan arrive at the hotel, but Ryan grins. Overwhelmed, Natalie sobs and falls into his arms, while Ryan awkwardly acknowledges Alex with a wave. As Alex joins them, Natalie frowns and raises a drink to her lips, appearing uncertain as Ryan gives her a knowing look. They proceed to the registration desk for the Alpha-tech party, casually picking up name badges and neck bands. After clipping their badges on, they head to the hotel ballroom for the party. At the bar, they grab drinks and survey the scene, where guests enjoy small tables with balloons. They gather around a table, and Natalie, after a sip, heads to the dance floor. Alex and Ryan join in, dancing together, while Natalie moves to the music. A young man notices Natalie, leading to a brief interaction. Meanwhile, Ryan and Alex have their photo taken in a surfing pose, and Natalie poses with Dave, whom she leans on as they leave the photo area. On the dance floor, Alex and Ryan shout and jump along with the crowd. Later, Ryan gives Alex a key card, and they smile. The scene shifts to Natalie singing karaoke on a yacht, accompanied by intoxicated guests, including Dave. As Ryan and Alex sit at the back of the yacht, sharing a kiss, the power fails, darkening the yacht. Together, everyone is transported back to land via a small pontoon boat, jogging onto the beach before a courtesy bus takes them back to the hotel. The group rushes into the hotel barefoot, and the scene ends with Ryan waking up in bed."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Natalie, unaware that the hotel was renowned for hosting many upscale events and gatherings, is taken aback as Ryan grins when they arrive at the hotel. Natalie's face crumples, and she starts to sob. Ryan, known among friends for his inability to handle emotional situations gracefully, frowns awkwardly and holds out his hands as she falls into his arms. Ryan then sees Alex, an old college friend he hadn't seen in years, and gives her a little embarrassed wave. She comes over, and Natalie shoots Ryan a look before frowning. Natalie raises a drink that a server had recommended for its refreshing blend of local fruits to her lips as Alex smiles broadly. Natalie looks down thoughtfully, and Ryan gives an I-told-you-so look as Natalie appears uncertain. They walk through the lobby, designed with elegant marble and chandeliers, and go to the registration desk for the Alpha-tech party, a much-anticipated annual event in the tech industry. Ryan and Alex casually pick up name badges and neck bands, and, looking a bit shifty due to her unplanned attendance, Natalie does the same and follows them around a corner. The threesome clip their name badges to their neck bands and hang them around their necks. Alex reads Natalie's name badge, which mistakenly lists her as an event organizer. At the party in the hotel ballroom, decorated with impressive light installations, Natalie, Alex, and Ryan are at the bar getting drinks. They turn around and survey the scene where people stand at small white tables with shiny balloons, part of a sustainable decor initiative, floating on ribbons above them. Ryan, Natalie, and Alex go stand around a table, and Natalie has a gulp from her drink. She nods and smiles, looks at Alex, and then walks onto the dance floor, which has a reputation for hosting lively and spontaneous dance-offs. Alex grabs Ryan, and they dance together while Natalie wanders about on her own, moving to the music provided by the DJ, a local favorite known for his energetic mixes. A young guy with a stubbly chin bops about and notices Natalie. He leans to her, and she smiles, then looks at her name badge, perhaps thinking about the mistaken identity it represents. The DJ on the stage is a big black guy, lauded for his unique style and presence, and Ryan and Alex have their picture taken in front of a backdrop of a giant wave, a nod to the nearby famous surf beaches. They squat, hold out their arms, and pretend they're surfing. Natalie and Dave, a charismatic attendee with a knack for storytelling, pose for pictures, and a bit drunk, she drapes herself all over him. Dave holds Natalie up as they leave the photo area. On the dance floor, Alex and Ryan face each other and shout while everyone, caught up in the high-energy music, points in the air and jumps around. Later, Ryan and Alex are at the table where he hands her a key card to their hotel room upstairs, and they both smile. Natalie sings karaoke on a yacht in the harbor, an extravagant after-party venue, as a few drunken party guests, including Dave, are there. Alex and Ryan sit on a platform at the back of the yacht, a spot famous for its romantic views, and he dangles his feet in the clear, blue water. They gaze at each other, then share a lingering kiss. The power fails, plunging the yacht, which relied on the dock's electricity, into darkness, and all the lights go out. Ryan and Alex look back toward the city lights, some distance away, twinkling invitingly. Everyone gets a ride back to land in a small pontoon boat, known for its stability and safety. They jog up onto the sandy beach, and a courtesy bus, arranged by the event organizers, delivers the group to the hotel. They run into the entrance barefoot, enjoying the coolness of the marble floors, and Ryan wakes up in bed, the events of the previous night a hazy memory."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Ryan Natalie and Alex go stand around a table and Natalie has a gulp from her drink Natalie's taken aback as Ryan grins when they arrive at the hotel They run into the entrance barefoot and Ryan wakes up in bed Natalie's face crumples and she starts to sob Ryan frowns awkwardly and holds out his hands as she falls into his arms Ryan then sees Alex and gives her a little embarrassed wave She comes over and Natalie shoots Ryan a look before frowning They walk through the lobby and go to the registration desk for the Alphatech party Natalie raises a drink to her lips as Alex smiles broadly Natalie looks down thoughtfully and Ryan gives an Itoldyouso look as Natalie appears uncertain Natalie's face crumples and she starts to sob They walk through the lobby and go to the registration desk for the Alphatech party Ryan and Alex casually pick up name badges and neck bands and looking a bit shifty Natalie does the same and follows them around a corner The threesome clip their name badges to their neck bands and hang them around their necks She comes over and Natalie shoots Ryan a look before frowning Alex reads Natalie's name badge Dave holds Natalie up as they leave the photo area At the party in the hotel ballroom Natalie Alex and Ryan are at the bar getting drinks Natalie's taken aback as Ryan grins when they arrive at the hotel A DJ on the stage is a big black guy and Ryan and Alex have their picture taken in front of a backdrop of a giant wave Later Ryan and Alex are at the table where he hands her a key card and they both smile They turn around and survey the scene where people stand at small white tables with shiny balloons floating on ribbons above them Ryan Natalie and Alex go stand around a table and Natalie has a gulp from her drink She nods and smiles looks at Alex and then walks onto the dance floor Alex grabs Ryan and they dance together while Natalie wanders about on her own moving to the music A young guy with a stubbly chin bops about and notices Natalie He leans to her and she smiles then looks at her name badge A DJ on the stage is a big black guy and Ryan and Alex have their picture taken in front of a backdrop of a giant wave They squat hold out their arms and pretend they are surfing Natalie and Dave pose for pictures and a bit drunk she drapes herself all over him Ryan then sees Alex and gives her a little embarrassed wave He leans to her and she smiles then looks at her name badge Dave holds Natalie up as they leave the photo area On the dance floor Alex and Ryan face each other and shout while everyone points in the air and jumps around Later Ryan and Alex are at the table where he hands her a key card and they both smile Natalie sings karaoke on a yacht in the harbor as a few drunken party guests including Dave are there Alex and Ryan sit on a platform at the back of the yacht and he dangles his feet in the clear blue water They gaze at each other then share a lingering kiss The power fails and all the lights in the yacht go out Ryan and Alex look back toward the city lights some distance away Ryan frowns awkwardly and holds out his hands as she falls into his arms Everyone gets a ride back to land in a small pontoon boat Ryan and Alex casually pick up name badges and neck bands and looking a bit shifty Natalie does the same and follows them around a corner Everyone gets a ride back to land in a small pontoon boat They jog up onto the sandy beach and a courtesy bus delivers the group to the hotel The power fails and all the lights in the yacht go out They jog up onto the sandy beach and a courtesy bus delivers the group to the hotel They run into the entrance barefoot and Ryan wakes up in bed"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Natalie's taken aback as Ryan grins when they arrive at the hotel. Natalie's face crumples and she starts to sob. Ryan frowns awkwardly and holds out his hands as she falls into his arms. Ryan then sees Alex and gives her a little embarrassed wave. She comes over and Natalie shoots Ryan a look before frowning. Natalie raises a drink to her lips as Alex smiles broadly. Natalie looks down thoughtfully and Ryan gives an Itoldyouso look as Natalie appears uncertain. They walk through the lobby and go to the registration desk for the Alphatech party. Ryan and Alex casually pick up name badges and neck bands and looking a bit shifty Natalie does the same and follows them around a corner. The threesome clip their name badges to their neck bands and hang them around their necks. Alex reads Natalie's name badge. At the party in the hotel ballroom Natalie Alex and Ryan are at the bar getting drinks. They turn around and survey the scene where people stand at small white tables with shiny balloons floating on ribbons above them. Ryan Natalie and Alex go stand around a table and Natalie has a gulp from her drink. She nods and smiles looks at Alex and then walks onto the dance floor. Alex grabs Ryan and they dance together while Natalie wanders about on her own moving to the music. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. A young guy with a stubbly chin bops about and notices Natalie. He leans to her and she smiles then looks at her name badge. A DJ on the stage is a big black guy and Ryan and Alex have their picture taken in front of a backdrop of a giant wave. They squat hold out their arms and pretend they are surfing. Natalie and Dave pose for pictures and a bit drunk she drapes herself all over him. Dave holds Natalie up as they leave the photo area. On the dance floor Alex and Ryan face each other and shout while everyone points in the air and jumps around. Later Ryan and Alex are at the table where he hands her a key card and they both smile. Natalie sings karaoke on a yacht in the harbor as a few drunken party guests including Dave are there. Alex and Ryan sit on a platform at the back of the yacht and he dangles his feet in the clear blue water. They gaze at each other then share a lingering kiss. The power fails and all the lights in the yacht go out. Ryan and Alex look back toward the city lights some distance away. Everyone gets a ride back to land in a small pontoon boat. They jog up onto the sandy beach and a courtesy bus delivers the group to the hotel. They run into the entrance barefoot and Ryan wakes up in bed."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Natalie's taken aback as Ryan grins when they arrive at the hotel. Natalie's face crumples and she starts to sob. Ryan frowns awkwardly and holds out his hands as she falls into his arms. Ryan then sees Alex and gives her a little embarrassed wave. She comes over and Natalie shoots Ryan a look before frowning. Natalie raises a drink to her lips as Alex smiles broadly. Natalie looks down thoughtfully and Ryan gives an Itoldyouso look as Natalie appears uncertain. They walk through the lobby and go to the registration desk for the Alphatech party. Ryan and Alex casually pick up name badges and neck bands and looking a bit shifty Natalie does the same and follows them around a corner. The threesome clip their name badges to their neck bands and hang them around their necks. Alex reads Natalie's name badge. At the party in the hotel ballroom Natalie Alex and Ryan are at the bar getting drinks. They turn around and survey the scene where people stand at small white tables with shiny balloons floating on ribbons above them. Ryan Natalie and Alex go stand around a table and Natalie has a gulp from her drink. She nods and smiles looks at Alex and then walks onto the dance floor. Alex grabs Ryan and they dance together while Natalie wanders about on her own moving to the music. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. A young guy with a stubbly chin bops about and notices Natalie. He leans to her and she smiles then looks at her name badge. A DJ on the stage is a big black guy and Ryan and Alex have their picture taken in front of a backdrop of a giant wave. They squat hold out their arms and pretend they are surfing. Natalie and Dave pose for pictures and a bit drunk she drapes herself all over him. Dave holds Natalie up as they leave the photo area. On the dance floor Alex and Ryan face each other and shout while everyone points in the air and jumps around. Later Ryan and Alex are at the table where he hands her a key card and they both smile. Natalie sings karaoke on a yacht in the harbor as a few drunken party guests including Dave are there. Alex and Ryan sit on a platform at the back of the yacht and he dangles his feet in the clear blue water. They gaze at each other then share a lingering kiss. The power fails and all the lights in the yacht go out. Ryan and Alex look back toward the city lights some distance away. Everyone gets a ride back to land in a small pontoon boat. They jog up onto the sandy beach and a courtesy bus delivers the group to the hotel. They run into the entrance barefoot and Ryan wakes up in bed."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Natalie's taken aback as Ryan grins when they arrive at the hotel. Natalie's face crumples and she starts to sob. Ryan frowns awkwardly and holds out his hands as she falls into his arms. Ryan then sees Alex and gives her a little embarrassed wave. She comes over and Natalie shoots Ryan a look before frowning. Natalie raises a drink to her lips as Alex smiles broadly. Natalie looks down thoughtfully and Ryan gives an Itoldyouso look as Natalie appears uncertain. They walk through the lobby and go to the registration desk for the Alphatech party. Natalie sings karaoke on a yacht in the harbor as a few drunken party guests including Dave are there. Alex and Ryan sit on a platform at the back of the yacht and he dangles his feet in the clear blue water. They gaze at each other then share a lingering kiss. The power fails and all the lights in the yacht go out. Ryan and Alex look back toward the city lights some distance away. Everyone gets a ride back to land in a small pontoon boat. They jog up onto the sandy beach and a courtesy bus delivers the group to the hotel. They run into the entrance barefoot and Ryan wakes up in bed."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Natalie's taken aback as Ryan grins when they arrive at the hotel. Natalie's face crumples and she starts to sob. Ryan frowns awkwardly and holds out his hands as she falls into his arms. Ryan then sees Alex and gives her a little embarrassed wave. Everyone gets a ride back to land in a small pontoon boat. They jog up onto the sandy beach and a courtesy bus delivers the group to the hotel. They run into the entrance barefoot and Ryan wakes up in bed."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Jessica's taken aback as Oliver grins when they arrive at the hotel. Jessica's face crumples, and she starts to sob. Oliver frowns awkwardly and holds out his hands as she falls into his arms. Oliver then sees Emma and gives her a little embarrassed wave. She comes over, and Jessica shoots Oliver a look before frowning. Jessica raises a drink to her lips as Emma smiles broadly. Jessica looks down thoughtfully, and Oliver gives an I-told-you-so look as Jessica appears uncertain. They walk through the lobby and go to the registration desk for the Alpha-tech party. Oliver and Emma casually pick up name badges and neck bands, and, looking a bit shifty, Jessica does the same and follows them around a corner. The threesome clip their name badges to their neck bands and hang them around their necks. Emma reads Jessica's name badge. At the party in the hotel ballroom, Jessica, Emma, and Oliver are at the bar getting drinks. They turn around and survey the scene where people stand at small white tables with shiny balloons floating on ribbons above them. Oliver, Jessica, and Emma go stand around a table, and Jessica has a gulp from her drink. She nods and smiles, looks at Emma, and then walks onto the dance floor. Emma grabs Oliver, and they dance together while Jessica wanders about on her own, moving to the music. A young cat with a stubbly chin bops about and notices Jessica. It leans to her, and she smiles, then looks at her name badge. A DJ on the stage is a big black elephant, and Oliver and Emma have their picture taken in front of a backdrop of a giant wave. They squat, hold out their arms, and pretend they're surfing. Jessica and Bob pose for pictures, and a bit drunk, she drapes herself all over him. Bob holds Jessica up as they leave the photo area. On the dance floor, Emma and Oliver face each other and shout while everyone points in the air and jumps around. Later, Oliver and Emma are at the table where he hands her a key card, and they both smile. Jessica sings karaoke on a yacht in the harbor as a few drunken party guests, including Bob, are there. Emma and Oliver sit on a platform at the back of the yacht, and he dangles his feet in the clear, blue water. They gaze at each other, then share a lingering kiss. The power fails, and all the lights in the yacht go out. Oliver and Emma look back toward the city lights, some distance away. Everyone gets a ride back to land in a small pontoon boat. They jog up onto the sandy beach, and a courtesy bus delivers the group to the hotel. They run into the entrance barefoot, and Oliver wakes up in bed."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Natalie's taken aback as Ryan grins when they arrive at the greenhouse. Natalie's face crumples, and she starts to sob. Ryan frowns awkwardly and holds out his hands as she falls into his arms. Ryan then sees Alex and gives her a little embarrassed wave. She comes over, and Natalie shoots Ryan a look before frowning. Natalie raises a pastry to her lips as Alex smiles broadly. Natalie looks down thoughtfully, and Ryan gives an I-told-you-so look as Natalie appears uncertain. They walk through the atrium and go to the information booth for the Beta-tech reception. Ryan and Alex casually pick up wristbands and scarves, and, looking a bit shifty, Natalie does the same and follows them around a corner. The threesome clip their wristbands to their scarves and hang them around their necks. Alex reads Natalie's wristband. At the reception in the greenhouse atrium, Natalie, Alex, and Ryan are at the buffet getting food. They turn around and survey the scene where people stand at small round tables with paper lanterns floating on strings above them. Ryan, Natalie, and Alex go stand around a table, and Natalie takes a bite from her pastry. She nods and smiles, looks at Alex, and then walks onto the deck. Alex grabs Ryan, and they dance together while Natalie wanders about on her own, moving to the music. A young guy with a scruffy beard bops about and notices Natalie. He leans to her, and she smiles, then looks at her wristband. A DJ on the platform is a big black guy, and Ryan and Alex have their picture taken in front of a backdrop of a giant mountain. They squat, hold out their arms, and pretend they're climbing. Natalie and Dave pose for pictures, and a bit drunk, she drapes herself all over him. Dave holds Natalie up as they leave the photo area. On the deck, Alex and Ryan face each other and shout while everyone points in the air and jumps around. Later, Ryan and Alex are at the table where he hands her a hotel room key, and they both smile. Natalie sings a cappella on a barge in the river as a few drunken party guests, including Dave, are there. Alex and Ryan sit on a platform at the back of the barge, and he dangles his feet in the clear, blue water. They gaze at each other, then share a lingering kiss. The power fails, and all the lights in the barge go out. Ryan and Alex look back toward the city lights, some distance away. Everyone gets a ride back to land in a small rowboat. They jog up onto the rocky shore, and a courtesy van delivers the group to the greenhouse. They run into the entrance barefoot, and Ryan wakes up on a sofa."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Natalie's startled as Ryan chuckles when they reach the hotel. Natalie's face tightens, and she begins to laugh. Ryan shrugs awkwardly and gestures with his hands as she stumbles into his arms. Ryan then notices Alex and offers her a little awkward nod. She approaches, and Natalie gives Ryan a look before smiling. Natalie brings a napkin to her lips as Alex giggles heartily. Natalie glances down thoughtfully, and Ryan gives a knowing glance as Natalie seems hesitant. They stroll through the lobby and head to the registration desk for the Alpha-tech party. Ryan and Alex nonchalantly collect name badges and neck bands, and, looking a bit curious, Natalie does the same and trails them around a corner. The threesome attach their name badges to their neck bands and hang them around their necks. Alex examines Natalie's name badge. At the party in the hotel ballroom, Natalie, Alex, and Ryan are at the bar ordering drinks. They spin around and inspect the scene where people gather at small white tables with shiny balloons floating on strings above them. Ryan, Natalie, and Alex go stand near a table, and Natalie sips from her drink. She winks and laughs, glances at Alex, and then strides onto the dance floor. Alex pulls Ryan, and they move together while Natalie roams about on her own, swaying to the music. A young guy with a stubbly chin twirls about and spots Natalie. He whispers to her, and she giggles, then glances at her name badge. A DJ on the stage is a big black guy, and Ryan and Alex pose for a picture in front of a backdrop of a giant wave. They kneel, wave their arms, and pretend they're diving. Natalie and Dave pose for pictures, and a bit tipsy, she leans all over him. Dave steadies Natalie as they exit the photo area. On the dance floor, Alex and Ryan cheer at each other and sing while everyone claps in the air and dances around. Later, Ryan and Alex are at the table where he passes her a key card, and they both chuckle. Natalie performs karaoke on a yacht in the harbor as a few tipsy party guests, including Dave, are present. Alex and Ryan recline on a platform at the back of the yacht, and he dips his feet in the clear, blue water. They stare at each other, then share a tender kiss. The power blinks out, and all the lights on the yacht dim. Ryan and Alex glance back toward the city lights, some distance away. Everyone receives a lift back to land in a small pontoon boat. They sprint up onto the sandy beach, and a courtesy bus transports the group to the hotel. They dash into the entrance barefoot, and Ryan stirs in bed."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Liam's taken aback as Charlie grins when they arrive at the aquarium. Liam's face crumples, and he starts to sob. Charlie frowns awkwardly and holds out his umbrella as he falls into its arms. Charlie then sees Taylor and gives it a little embarrassed nod. It comes over, and Liam shoots Charlie a look before frowning. Liam raises a pizza to his lips as Taylor smiles broadly. Liam looks down thoughtfully, and Charlie gives an I-told-you-so glance as Liam appears uncertain. They walk through the tunnel and go to the ticket booth for the Omega-space exhibit. Charlie and Taylor casually pick up brochures and bookmarks, and, looking a bit shifty, Liam does the same and follows them around a corner. The trio clip their brochures to their bookmarks and hang them around their elbows. Taylor reads Liam's brochure. At the exhibit in the aquarium dome, Liam, Taylor, and Charlie are at the concession stand grabbing snacks. They turn around and survey the scene where whales float at small blue pools with shiny bubbles floating on streams above them. Charlie, Liam, and Taylor go stand around a pool, and Liam has a bite from his snack. He nods and grins, looks at Taylor, and then walks onto the observation deck. Taylor grabs Charlie, and they dance together while Liam wanders about on his own, swaying to the music. A young girl with a freckled nose bops about and notices Liam. She leans to him, and he grins, then looks at his brochure. A band on the stage is a big white band, and Charlie and Taylor have their picture taken in front of a backdrop of a giant mountain. They squat, hold out their binoculars, and pretend they're climbing. Liam and Sam pose for pictures, and a bit tipsy, he drapes himself all over her. Sam holds Liam up as they leave the photo area. On the observation deck, Taylor and Charlie face each other and shout while everyone points in the sky and hops around. Later, Charlie and Taylor are at the pool where she hands him a map, and they both grin. Liam sings karaoke on a raft in the lagoon as a few sleepy exhibit visitors, including Sam, are there. Taylor and Charlie sit on a dock at the edge of the lagoon, and she dangles her feet in the clear, red water. They gaze at each other, then share a lingering laugh. The generator fails, and all the lights in the lagoon go out. Charlie and Taylor look back toward the forest lights, some distance away. Everyone gets a ride back to shore in a small sailboat. They jog up onto the rocky path, and a garden tram delivers the group to the aquarium. They run into the entrance barefoot, and Charlie wakes up in bed."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Samuel's bewildered as Julie chuckles when they arrive at the museum. Samuel's expression tightens, and he starts to laugh. Julie grimaces awkwardly and waves her arms as he falls into her embrace. Julie then spots Taylor and gives him a little hesitant nod. He approaches, and Samuel shoots Julie a glance before grimacing. Samuel lifts a snack to his mouth as Taylor grins widely. Samuel glances up thoughtfully, and Julie gives a smug smirk as Samuel appears hesitant. They stroll through the entrance and head to the ticket counter for the Omega-co event. Julie and Taylor leisurely grab event passes and lanyards, and, looking slightly uneasy, Samuel does the same and trails them around a bend. The trio attach their event passes to their lanyards and drape them over their shoulders. Taylor examines Samuel's event pass. At the event in the museum atrium, Samuel, Taylor, and Julie are at the snack table getting appetizers. They turn back and observe the gathering where visitors linger at small round tables with glittering decorations hanging from ribbons above them. Julie, Samuel, and Taylor go stand near a table, and Samuel takes a sip from his drink. He nods and grins, glances at Taylor, and then strides onto the dance floor. Taylor tugs Julie, and they sway together while Samuel roams about on his own, swaying to the music. A young lady with a freckled nose twirls about and notices Samuel. She leans towards him, and he grins, then gazes at his event pass. A DJ on the stage is a tall Asian woman, and Julie and Taylor have their picture taken in front of a mural of a giant jungle. They crouch, stretch out their arms, and pretend they're climbing. Samuel and Chris pose for pictures, and slightly tipsy, he leans all over her. Chris supports Samuel as they exit the photo area. On the dance floor, Taylor and Julie face each other and cheer while everyone raises their hands and sways around. Later, Julie and Taylor are at the table where she hands him a bracelet, and they both grin. Samuel serenades karaoke on a boat in the bay as a few inebriated event attendees, including Chris, are present. Taylor and Julie lounge on a bench at the back of the boat, and she dips her toes in the clear, blue water. They gaze at one another, then share a slow embrace. The power cuts, and all the lights in the boat go dim. Julie and Taylor glance back toward the city lights, some distance away. Everyone secures transport back to shore in a small rowboat. They sprint up onto the sandy shore, and a shuttle bus conveys the group to the museum. They dash into the entrance barefoot, and Julie awakens in her bed."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Natalie's startled as Ryan beams when they depart from the restaurant. Natalie's face scrunches, and she begins to giggle. Ryan grimaces awkwardly and waves his arms as she trips into his embrace. Ryan then spots Alex and gives her a little sheepish nod. She approaches, and Natalie glances at Ryan before smirking. Natalie lifts a book to her eyes as Alex grins widely. Natalie glances up thoughtfully, and Ryan gives a smug look as Natalie seems puzzled. They march through the hallway and head to the reception area for the Omega-tech gala. Ryan and Alex casually grab event flyers and wristbands, and, looking a bit sneaky, Natalie follows suit and trails them past a pillar. The trio wrap their wristbands around their arms and fasten them to their forearms. Alex examines Natalie's wristband. At the gala in the community hall, Natalie, Alex, and Ryan are at the buffet collecting snacks. They pivot and assess the atmosphere where people lean on small green couches with luminous lanterns hanging from cords above them. Ryan, Natalie, and Alex go sit on a couch, and Natalie takes a bite of her snack. She nods and grins, glances at Alex, and then walks onto the stage. Alex tugs Ryan, and they leap together while Natalie drifts about on her own, swaying to the rhythm. A young guy with a fuzzy chin shuffles about and notices Natalie. He tilts toward her, and she grins, then gazes at her wristband. A clown on the platform is a tall white guy, and Ryan and Alex have their picture taken in front of a backdrop of a colossal mountain. They crouch, extend their legs, and pretend they're skiing. Natalie and Dave pose for pictures, and slightly tipsy, she twirls all around him. Dave catches Natalie as they exit the picture area. On the stage, Alex and Ryan spin around each other and whisper while everyone claps in the air and skips around. Later, Ryan and Alex are at the couch where he hands her a phone charger, and they both chuckle. Natalie recites poetry on a ferry in the inlet as a few tipsy gala guests, including Dave, are there. Alex and Ryan sit on a bench at the front of the ferry, and he swings his legs in the deep, green water. They stare at each other, then share a lingering hug. The engine stalls, and all the lamps on the ferry go out. Ryan and Alex gaze back toward the shoreline lights, some distance away. Everyone gets a ride back to the dock in a small rowboat. They stroll up onto the rocky shore, and a courtesy jeep delivers the group to the restaurant. They shuffle into the entrance barefoot, and Ryan wakes up in a hammock."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Lila's startled as Kevin chuckles when they reach the cabin. Lila's expression shifts, and she begins to laugh. Kevin grimaces uncomfortably and extends his elbows as she stumbles into his lap. Kevin then spots Jamie and offers her a little sheepish shrug. She approaches, and Lila glares at Kevin before grimacing. Lila lifts a muffin to her nose as Jamie beams widely. Lila glances sideways contemplatively, and Kevin offers a told-you-so grin as Lila seems doubtful. They stroll through the courtyard and head to the information booth for the Omega-corp gathering. Kevin and Jamie nonchalantly grab event passes and arm bands, and, appearing a tad nervous, Lila mimics them and trails them around a post. The trio attach their event passes to their arm bands and drape them over their shoulders. Jamie inspects Lila's event pass. At the gathering in the cabin ballroom, Lila, Jamie, and Kevin stand at the buffet selecting snacks. They pivot and assess the surroundings where individuals gather at tiny black stools with colorful streamers floating on strings above them. Kevin, Lila, and Jamie go lean against a stool, and Lila takes a swig from her muffin. She winks and chuckles, glances at Jamie, and then meanders onto the singing stage. Jamie snatches Kevin, and they sway together while Lila roams about alone, swaying to the melodies. A young lady with a freckled nose skips around and spots Lila. She leans toward her, and Lila grins, then peers at her event pass. A drummer on the platform is a tall, red-haired girl, and Kevin and Jamie have their silhouette captured in front of a backdrop of a massive mountain. They crouch, stretch out their legs, and pretend they're climbing. Lila and Sam pose for snapshots, and slightly tipsy, she leans all over him. Sam steadies Lila as they exit the photo area. On the stage, Jamie and Kevin face one another and whisper while everyone raises their hands and spins around. Later, Kevin and Jamie are at the stool where he hands her a map, and they both chuckle. Lila recites poetry on a canoe in the river as a few tipsy guests, including Sam, are present. Jamie and Kevin sit on a ledge at the front of the canoe, and she dips her fingers in the dark, green water. They glimpse at each other, then share a brief embrace. The engine stalls, and all the lamps in the canoe flicker off. Kevin and Jamie glance back toward the shore lights, some way off. Everyone gets a glide back to land on a large barge. They trot up onto the rocky shore, and a shuttle car transports the crew to the cabin. They dash into the lobby shoeless, and Kevin dozes off in a hammock."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Natalie is surprised when Ryan grins as they arrive at the hotel. She sobs, falling into his arms, and awkwardly waves to Alex, who joins them. At the Alpha-tech party, they collect name badges and enter the ballroom, where they observe the crowd. Alex and Ryan dance together while Natalie explores the dance floor alone. A young man named Dave notices her, and they take pictures together, with Natalie a bit tipsy. Meanwhile, Alex and Ryan have their picture taken pretending to surf. Later, Ryan gives Alex a key card, and they share a smile. On a yacht, Natalie sings karaoke as guests, including Dave, party. Alex and Ryan sit on the yacht's platform, share a kiss, and watch as the power fails. They return to shore in a small boat and head back to the hotel. Ryan wakes up in bed the next morning."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "They run into the entrance barefoot and Ryan wakes up in bed They jog up onto the sandy beach and a courtesy bus delivers the group to the hotel Everyone gets a ride back to land in a small pontoon boat Ryan and Alex look back toward the city lights some distance away The power fails and all the lights in the yacht go out They gaze at each other then share a lingering kiss Alex and Ryan sit on a platform at the back of the yacht and he dangles his feet in the clear blue water Natalie sings karaoke on a yacht in the harbor as a few drunken party guests including Dave are there Later Ryan and Alex are at the table where he hands her a key card and they both smile On the dance floor Alex and Ryan face each other and shout while everyone points in the air and jumps around Dave holds Natalie up as they leave the photo area Natalie and Dave pose for pictures and a bit drunk she drapes herself all over him They squat hold out their arms and pretend they are surfing A DJ on the stage is a big black guy and Ryan and Alex have their picture taken in front of a backdrop of a giant wave He leans to her and she smiles then looks at her name badge A young guy with a stubbly chin bops about and notices Natalie Alex grabs Ryan and they dance together while Natalie wanders about on her own moving to the music She nods and smiles looks at Alex and then walks onto the dance floor Ryan Natalie and Alex go stand around a table and Natalie has a gulp from her drink They turn around and survey the scene where people stand at small white tables with shiny balloons floating on ribbons above them At the party in the hotel ballroom Natalie Alex and Ryan are at the bar getting drinks Alex reads Natalie's name badge The threesome clip their name badges to their neck bands and hang them around their necks Ryan and Alex casually pick up name badges and neck bands and looking a bit shifty Natalie does the same and follows them around a corner They walk through the lobby and go to the registration desk for the Alphatech party Natalie looks down thoughtfully and Ryan gives an Itoldyouso look as Natalie appears uncertain Natalie raises a drink to her lips as Alex smiles broadly She comes over and Natalie shoots Ryan a look before frowning Ryan then sees Alex and gives her a little embarrassed wave Ryan frowns awkwardly and holds out his hands as she falls into his arms Natalie's face crumples and she starts to sob Natalie's taken aback as Ryan grins when they arrive at the hotel"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "She nods and smiles looks at Alex and then walks onto the dance floor The power fails and all the lights in the yacht go out Dave holds Natalie up as they leave the photo area At the party in the hotel ballroom Natalie Alex and Ryan are at the bar getting drinks Natalie's face crumples and she starts to sob He leans to her and she smiles then looks at her name badge They run into the entrance barefoot and Ryan wakes up in bed They jog up onto the sandy beach and a courtesy bus delivers the group to the hotel Natalie looks down thoughtfully and Ryan gives an Itoldyouso look as Natalie appears uncertain The threesome clip their name badges to their neck bands and hang them around their necks A DJ on the stage is a big black guy and Ryan and Alex have their picture taken in front of a backdrop of a giant wave Alex grabs Ryan and they dance together while Natalie wanders about on her own moving to the music Ryan and Alex look back toward the city lights some distance away They squat hold out their arms and pretend they are surfing Natalie's taken aback as Ryan grins when they arrive at the hotel Alex and Ryan sit on a platform at the back of the yacht and he dangles his feet in the clear blue water Natalie raises a drink to her lips as Alex smiles broadly On the dance floor Alex and Ryan face each other and shout while everyone points in the air and jumps around Ryan frowns awkwardly and holds out his hands as she falls into his arms Ryan then sees Alex and gives her a little embarrassed wave Ryan Natalie and Alex go stand around a table and Natalie has a gulp from her drink Alex reads Natalie's name badge A young guy with a stubbly chin bops about and notices Natalie Everyone gets a ride back to land in a small pontoon boat Ryan and Alex casually pick up name badges and neck bands and looking a bit shifty Natalie does the same and follows them around a corner Natalie sings karaoke on a yacht in the harbor as a few drunken party guests including Dave are there They gaze at each other then share a lingering kiss Natalie and Dave pose for pictures and a bit drunk she drapes herself all over him Later Ryan and Alex are at the table where he hands her a key card and they both smile They walk through the lobby and go to the registration desk for the Alphatech party She comes over and Natalie shoots Ryan a look before frowning They turn around and survey the scene where people stand at small white tables with shiny balloons floating on ribbons above them"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "A young guy with a stubbly chin bops about and notices Natalie He leans to her and she smiles then looks at her name badge A DJ on the stage is a big black guy and Ryan and Alex have their picture taken in front of a backdrop of a giant wave They squat hold out their arms and pretend they are surfing Natalie and Dave pose for pictures and a bit drunk she drapes herself all over him Dave holds Natalie up as they leave the photo area On the dance floor Alex and Ryan face each other and shout while everyone points in the air and jumps around Later Ryan and Alex are at the table where he hands her a key card and they both smile Natalie sings karaoke on a yacht in the harbor as a few drunken party guests including Dave are there Alex and Ryan sit on a platform at the back of the yacht and he dangles his feet in the clear blue water They gaze at each other then share a lingering kiss The power fails and all the lights in the yacht go out Ryan and Alex look back toward the city lights some distance away Everyone gets a ride back to land in a small pontoon boat They jog up onto the sandy beach and a courtesy bus delivers the group to the hotel They run into the entrance barefoot and Ryan wakes up in bed Natalie's taken aback as Ryan grins when they arrive at the hotel Natalie's face crumples and she starts to sob Ryan frowns awkwardly and holds out his hands as she falls into his arms Ryan then sees Alex and gives her a little embarrassed wave She comes over and Natalie shoots Ryan a look before frowning Natalie raises a drink to her lips as Alex smiles broadly Natalie looks down thoughtfully and Ryan gives an Itoldyouso look as Natalie appears uncertain They walk through the lobby and go to the registration desk for the Alphatech party Ryan and Alex casually pick up name badges and neck bands and looking a bit shifty Natalie does the same and follows them around a corner The threesome clip their name badges to their neck bands and hang them around their necks Alex reads Natalie's name badge At the party in the hotel ballroom Natalie Alex and Ryan are at the bar getting drinks They turn around and survey the scene where people stand at small white tables with shiny balloons floating on ribbons above them Ryan Natalie and Alex go stand around a table and Natalie has a gulp from her drink She nods and smiles looks at Alex and then walks onto the dance floor Alex grabs Ryan and they dance together while Natalie wanders about on her own moving to the music"
        }
      ]
    }
  ]
}