{
  "ground_truth": "Alex is already dressed, and he looks at her, bleary-eyed, as she leans down and kisses him, causing him to beam before Alex goes. Ryan and Natalie have breakfast at the hotel's outdoor cafe, sitting at one of many tables under a blue umbrella while she stares at him. They walk along a pier where Natalie has the photo of Julie and Jim. Natalie holds up the photo, which blows into the water. Ryan kneels on the edge of the wooden pier and reaches for it but falls in the water. In his hotel room, wearing a white towel and robe, Ryan dries the cut-out with a hair dryer. Ryan drags his case through the airport, with Julie and Jim poking out of the top, looking a little wrinkled and worn. In Detroit, the airport is shrouded in a snow storm as Ryan and Natalie drive along an icy road, glancing at each other awkwardly. Ryan parks in an office car park, and he and Natalie get out as she holds an arm full of strategy packets. A security guard leads them through a busy, open-plan office into a smaller office where Craig is on a computer screen via a video feed. Ryan looks at the screen and frowns while she smiles nervously and prepares the packets. A thickset bald man appears on a computer screen in front of Natalie. Ryan sits with her, and they look up to realize Mr. Samuels is in the next office on the other side of an opaque glass screen. In distress, Mr. Samuels' chest heaves as he picks up the packet, looks down, and starts to sob. Ryan frowns and looks between Natalie and Mr. Samuels on the screen, as the heavyset man shakes with grief. Natalie's eyes rove, she licks her lips, and Craig watches on his screen. Mr. Samuels looks down, startled, gets up, walks out, and Ryan and Natalie watch him wipe his hand across his face as he walks past the office therein. Natalie looks unsettled, nods slightly, looks down at a list of 40 names, flitting her eyes nervously, with number one being Mr. Samuels, and she crosses it out. In the snowy car park, Ryan talks to Craig on his cell phone while Natalie leans on the car. Ryan frowns as he listens, hangs up, and turns to Natalie. Later, in the north terminal of Detroit airport, Ryan and Natalie stand silhouetted against a large window with the nose of a jet looming outside. Standing on a moving walkway, Ryan looks at the wedding invitation with Natalie behind him, her smile fading. Natalie walks ahead, and Ryan stares thoughtfully at the wedding invitation and the RSVP slip before stopping, turning around, and heading back the way he came.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Alex is already attired, and he gazes at her, bleary-eyed, as she inclines down and pecks him, causing him to grin before Alex departs. Ryan and Natalie have morning meal at the hotel's alfresco cafe, seated at one of numerous tables beneath a cerulean parasol while she peers at him. They stroll along a quay where Natalie has the picture of Julie and Jim. Natalie raises the picture, which drifts into the water. Ryan crouches on the rim of the timber quay and stretches for it but tumbles into the water. In his hotel room, wearing a white towel and robe, Ryan dries the cut-out with a blow dryer. Ryan hauls his suitcase through the airport, with Julie and Jim protruding from the top, appearing a bit creased and worn. In Detroit, the airport is cloaked in a snow tempest as Ryan and Natalie traverse an icy route, glancing at each other awkwardly. Ryan parks in an office car park, and he and Natalie disembark as she holds an armful of tactics packets. A security guard escorts them through a bustling, open-plan office into a smaller office where Craig is on a computer monitor via a video transmission. Ryan gazes at the monitor and scowls while she smiles apprehensively and prepares the packets. A stout bald man emerges on a computer monitor in front of Natalie. Ryan sits with her, and they glance up to realize Mr. Samuels is in the adjacent office on the opposite side of an opaque glass screen. In anguish, Mr. Samuels' chest heaves as he picks up the packet, looks down, and begins to weep. Ryan frowns and looks between Natalie and Mr. Samuels on the monitor, as the hefty man trembles with sorrow. Natalie's eyes wander, she moistens her lips, and Craig observes on his monitor. Mr. Samuels looks down, startled, rises, departs, and Ryan and Natalie watch him swipe his hand across his visage as he walks past the office therein. Natalie looks unsettled, nods slightly, looks down at a list of 40 names, darting her eyes nervously, with number one being Mr. Samuels, and she crosses it out. In the snowy parking lot, Ryan talks to Craig on his cell while Natalie leans on the car. Ryan frowns as he listens, hangs up, and turns to Natalie. Later, in the northern terminal of Detroit airport, Ryan and Natalie stand silhouetted against a vast window with the nose of a jet looming outside. Standing on a moving walkway, Ryan gazes at the wedding invitation with Natalie behind him, her smile diminishing. Natalie walks ahead, and Ryan stares pensively at the wedding invitation and the RSVP slip before halting, turning around, and heading back the way he came."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Alex is already dressed, and her bleary-eyed look is given to him as he is leaned down and kissed by her, causing a beam to spread across his face before Alex is gone. Breakfast is had by Ryan and Natalie at the hotel's outdoor cafe, where they are seated at one of many tables under a blue umbrella while he is stared at by her. A walk is taken along a pier where the photo of Julie and Jim is possessed by Natalie. The photo is held up by Natalie, but it blows into the water. The edge of the wooden pier is kneeled on by Ryan as he reaches for it but falls into the water. In his hotel room, clad in a white towel and robe, the cut-out is dried by Ryan with a hair dryer. His case is dragged through the airport by Ryan, with Julie and Jim poking out of the top, looking a little wrinkled and worn. In Detroit, a snowstorm shrouds the airport as an icy road is driven along by Ryan and Natalie, with awkward glances exchanged. A park in an office car park is performed by Ryan, and he and Natalie get out as an arm full of strategy packets is held by her. They are led by a security guard through a busy, open-plan office into a smaller office where a computer screen shows Craig via a video feed. The screen is looked at by Ryan, who frowns while a nervous smile and packet preparation are offered by her. A thickset bald man is displayed on a computer screen in front of Natalie. Her side is taken by Ryan, and they look up to see Mr. Samuels in the next office on the other side of an opaque glass screen. In distress, a heaving chest is had by Mr. Samuels as the packet is picked up by him, and he looks down and starts to sob. Between Natalie and Mr. Samuels on the screen, Ryan frowns and looks as the heavyset man shakes with grief. Natalie’s eyes rove, lips are licked by her, and Craig’s screen shows his watching. Startled, Mr. Samuels looks down, gets up, and walks out, with a hand being wiped across his face as he walks past the office watched by Ryan and Natalie. An unsettled look is had by Natalie, a slight nod is given, and a downward glance at a list of 40 names is made, with an eye flit nervously, Mr. Samuels being number one, and it is crossed out by her. In the snowy car park, Craig is talked to on his cell phone by Ryan while the car is leaned on by Natalie. A frown is worn by Ryan as he listens, hanging up and turning to Natalie. Later, in the north terminal of Detroit airport, a silhouette is formed by Ryan and Natalie against a large window with the nose of a jet looming outside. A moving walkway is stood upon by Ryan as he looks at the wedding invitation with Natalie behind him, her smile fading. The way ahead is taken by Natalie as the wedding invitation and the RSVP slip are stared at thoughtfully by Ryan before a stop, a turn around, and a return path are headed back the way he came by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Alex, already dressed, looks at her bleary-eyed as she kisses him, making him beam before leaving. Ryan and Natalie have breakfast at the hotel's outdoor cafe under a blue umbrella. They walk along a pier where Natalie holds a photo of Julie and Jim, which blows into the water. Ryan falls in trying to retrieve it. Back in his hotel room, Ryan dries the cut-out with a hair dryer while wearing a towel and robe. At the airport, Ryan drags his case with Julie and Jim poking out, looking wrinkled. In snowy Detroit, Ryan and Natalie drive on an icy road, glancing awkwardly at each other. At an office, a security guard leads them to a smaller office where Craig appears on a computer screen. Mr. Samuels, in distress, appears on a screen, sobs as he looks at the packet, and exits, wiping his face. Natalie nervously crosses out Mr. Samuels' name from a list of 40. In the car park, Ryan talks to Craig on his phone, frowns as he listens, hangs up, and turns to Natalie. At the Detroit airport's north terminal, Ryan and Natalie stand silhouetted against a window with a jet outside. Ryan, on the moving walkway, looks at a wedding invitation as Natalie's smile fades and she walks ahead. He stops, turns around, and heads back."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Already dressed, Alex beams when kissed by her and then leaves. Ryan and Natalie breakfast at the hotel's outdoor cafe under a blue umbrella. On a pier, a photo of Julie and Jim blows into the water; Ryan falls in trying to retrieve it. In his hotel room, wearing a towel and robe, he dries it with a hair dryer. At the airport, the cut-out pokes out of his case, wrinkled. In snow-covered Detroit, they drive awkwardly on icy roads. Ryan parks, and they enter an office with strategy packets. A security guard leads them to a smaller office where Craig appears on a computer screen. Ryan frowns; Natalie smiles nervously. A bald man appears onscreen, realizing Mr. Samuels is nearby. Mr. Samuels sobs, holding the packet. Ryan observes Natalie and Samuels, who wipes his face and exits. Natalie, appearing unsettled, crosses Mr. Samuels off a list of 40 names. In the snowy car park, Ryan talks to Craig on his phone, frowns, and hangs up. At Detroit airport’s north terminal, they stand silhouetted with a jet outside. Ryan views the wedding invitation, his expression thoughtful. Natalie walks ahead; he stops, turns, and returns."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Alex is already fully dressed in his attire, and he gazes at her with tired, bleary eyes as she leans down affectionately to kiss him. This tender gesture causes him to beam with happiness before Alex departs. Meanwhile, Ryan and Natalie enjoy breakfast together at the outdoor café of the hotel, sitting comfortably at one of the many tables positioned under a large blue umbrella, while she intently stares at him across the table. After their meal, they take a leisurely stroll along a pier, where Natalie holds onto a cherished photograph of Julie and Jim. As Natalie holds the photo up, it unexpectedly slips from her grasp and is swiftly carried by the wind into the water. Ryan quickly kneels at the edge of the wooden pier, reaching out in an attempt to retrieve it, but he loses his balance and tumbles into the water. Back in the comfort of his hotel room, now clad in a white towel and a soft robe, Ryan uses a hair dryer to dry the cut-out. Later, Ryan drags his luggage through the busy airport, with the photo of Julie and Jim noticeably protruding from the top, appearing a bit wrinkled and worn from the ordeal. \n\nIn Detroit, the airport is enveloped in a swirling snowstorm as Ryan and Natalie drive cautiously along the icy road, exchanging awkward glances with one another. Upon arrival, Ryan parks in the office car park, and both he and Natalie exit as she carefully balances an armful of strategy packets. A security guard escorts them through a bustling, open-plan office, leading them into a smaller, more intimate office space where Craig appears on a computer screen via a video feed. Ryan peers at the screen, frowning slightly, while Natalie stands beside him, smiling nervously as she prepares the packets meticulously. Suddenly, a thickset, bald man materializes on a computer screen in front of Natalie. Ryan sits beside her, and together they glance up, realizing that Mr. Samuels is seated in the adjacent office, separated only by an opaque glass screen. In evident distress, Mr. Samuels' chest heaves as he picks up the packet, looks down at the contents, and begins to sob uncontrollably. Ryan, frowning, glances between Natalie and the image of Mr. Samuels on the screen, as the heavyset man visibly shakes with grief. Natalie's eyes dart around, she nervously licks her lips, while Craig observes the scene unfold on his screen. Eventually, Mr. Samuels, looking startled, rises from his seat, exits the room, and as Ryan and Natalie watch him pass by their office, he wipes his hand across his face. Natalie appears unsettled, nodding slightly, she looks down at a list of 40 names, with Mr. Samuels' name at the top, and she crosses it out nervously.\n\nIn the snowy car park, Ryan engages in a conversation with Craig on his cell phone while Natalie leans against the car, observing. Ryan frowns as he listens intently to the conversation, then hangs up and turns his attention to Natalie. Later, in the bustling north terminal of Detroit airport, Ryan and Natalie stand side by side, silhouetted against a massive window, with the nose of a jet prominently looming outside. As they stand on a moving walkway, Ryan examines the wedding invitation in his hands, with Natalie standing slightly behind him, her initial smile slowly fading. Natalie eventually walks ahead, leaving Ryan to stare thoughtfully at the wedding invitation and the accompanying RSVP slip. After a moment of contemplation, he stops in his tracks, turns around decisively, and begins to head back in the direction from which he initially came."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Alex, who is now completely dressed in his outfit, looks over at her with tired and slightly unfocused eyes as she bends down with affection to plant a gentle kiss on him. This sweet and tender gesture causes a smile of genuine happiness to spread across Alex's face before he leaves. Meanwhile, Ryan and Natalie find themselves enjoying a relaxed breakfast together at the outdoor café of their hotel, comfortably seated at one of the numerous tables situated under a spacious blue umbrella. Natalie gazes intently at Ryan from across their table. After they finish their meal, they embark on a leisurely stroll that takes them along a picturesque pier. During this walk, Natalie holds on to a cherished photograph of Julie and Jim, which suddenly slips from her fingers and is quickly whisked away by a gust of wind into the water below. Ryan, reacting swiftly, drops to his knees at the pier's edge and reaches out in a bid to retrieve it, but he loses his balance and plunges into the water. Returning to the coziness of his hotel room, Ryan, now dressed in a white towel and a soft, comfortable robe, uses a hair dryer to dry the photograph. Later, as Ryan makes his way through the crowded airport, dragging his luggage behind him, the photograph of Julie and Jim protrudes noticeably from the top, looking a bit crinkled and worn from what it endured.\n\nIn Detroit, the airport is engulfed in a swirling snowstorm, as Ryan and Natalie drive cautiously along the slippery, icy roads, exchanging awkward glances with one another. When they reach their destination, Ryan parks in the office car park, and both he and Natalie exit the vehicle, with Natalie carefully balancing an armful of strategy packets in her arms. A security guard escorts them through the bustling, open-plan office space, guiding them into a more private, smaller office area where Craig appears on a computer screen through a video feed. Ryan peers at Craig’s image on the screen, furrowing his brow slightly, while Natalie stands beside him, smiling nervously as she prepares and organizes the packets with meticulous care. Suddenly, a thickset, bald man materializes on another computer screen directly in front of Natalie. Ryan takes a seat beside her, and together they look up to realize that Mr. Samuels is actually seated in the adjacent office, separated from them by only an opaque glass screen. In a state of evident distress, Mr. Samuels’ chest heaves as he picks up the packet, looks down at the contents, and begins to sob uncontrollably. Ryan, still frowning, glances back and forth between Natalie and the image of Mr. Samuels on the screen, as the heavyset man visibly shakes with grief. Natalie's eyes flit about; she nervously licks her lips, while Craig watches the unfolding scene on his screen. Eventually, Mr. Samuels, looking startled and disoriented, rises from his seat and leaves the room. As Ryan and Natalie observe him passing by their office, he wipes his hand across his face. Natalie, appearing visibly unsettled, nods slightly and looks down at a list of 40 names, crossing out Mr. Samuels’ name, which is at the very top, with trembling hands.\n\nIn the snow-covered car park, Ryan is engaged in a conversation with Craig on his cell phone, while Natalie leans against the car, watching intently. Ryan frowns as he listens carefully to what is being said, then ends the call and directs his attention to Natalie. Later on, amid the hustle and bustle of the crowded north terminal at Detroit airport, Ryan and Natalie stand side by side, silhouetted against the backdrop of a massive window, with the nose of a large jet looming prominently outside. As they both move along a moving walkway, Ryan holds a wedding invitation in his hands, examining it thoughtfully, while Natalie stands a little behind him, with her initial smile slowly fading. Eventually, Natalie walks ahead, leaving Ryan behind, as he stands there, staring pensively at the wedding invitation and the accompanying RSVP card. After taking a moment to reflect deeply, he suddenly stops, turns around with determination, and begins to head back in the direction from which he originally came."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Alex, already fully dressed, meets her gaze, his eyes still filled with sleepiness, as she gently leans down to plant a soft kiss on his lips, causing a bright, genuine smile to spread across his face before he departs. Ryan and Natalie enjoy breakfast together at the hotel's outdoor cafe, selecting a table among many, shaded by a vibrant blue umbrella, and she intently watches him while they eat. They proceed to stroll along a picturesque pier, where Natalie holds a cherished photo of Julie and Jim, examining it before it unpredictably slips from her grasp, carried away by a brisk breeze into the water below. Swiftly, Ryan drops to his knees on the wooden pier's edge, stretching his arm as far as it can go, desperately trying to retrieve the photo but loses his balance and tumbles into the water. Back in his hotel room, now enveloped in a white towel and robe, Ryan uses a hairdryer to carefully dry the damp cut-out. Later, he hauls his case through the bustling airport, the image of Julie and Jim jutting from the top, slightly crumpled and showing signs of wear. As they arrive in Detroit, the airport is engulfed by a swirling snowstorm, and Ryan and Natalie navigate along a treacherously icy road, exchanging uneasy glances. Upon reaching an office car park, Ryan parks, and they both exit the vehicle, with Natalie carrying a stack of strategy packets tightly in her arms. A security guard escorts them through a vibrant, open-plan office and into a smaller, more intimate office space where they connect with Craig via a video feed displayed on a computer screen. Ryan gazes at the screen with a furrowed brow while Natalie produces a nervous smile, methodically arranging the packets. Suddenly, a robust, bald man appears on the computer screen across from Natalie, prompting Ryan to take a seat beside her. It dawns on them that Mr. Samuels is situated in the adjacent office, separated only by an opaque glass screen. Overcome with distress, Mr. Samuels' chest shudders as he lifts the packet, examines it, and begins to sob uncontrollably. Observing this, Ryan's expression remains troubled as he alternates his gaze between Natalie and the grieving Mr. Samuels on the screen. Meanwhile, Natalie's eyes dart around, she moistens her lips nervously, and Craig observes the unfolding scene from his own screen. Mr. Samuels suddenly looks up, surprised, rises from his seat, and exits the room, prompting Ryan and Natalie to watch as he wipes his face and strides past their office. Feeling unsettled, Natalie acknowledges the list of forty names with a slight nod, her eyes flitting nervously over them, and she decisively crosses out Mr. Samuels' name at the top. In the snowy car park, Ryan converses with Craig on his cell phone, while Natalie, leaning against the car, observes him. As Ryan listens intently, his brow furrows; he ends the call and turns his attention to Natalie. Later, within the north terminal of Detroit airport, the two stand silhouetted against a large window, through which the nose of a jet looms ominously outside. On a moving walkway, Ryan glimpses at the wedding invitation in his hand, with Natalie walking slightly behind him, her initial smile gradually fading. Natalie moves ahead, while Ryan, deep in thought, continues to examine the wedding invitation and its accompanying RSVP slip before making a sudden decision to halt, pivot around, and retrace his steps, heading back in the direction from which he came."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Alex, already dressed, beams after a kiss from her before leaving. Ryan and Natalie have breakfast at the hotel's outdoor cafe, where she gazes at him. They walk along a pier, and when a photo of Julie and Jim slips from Natalie's grasp and blows into the water, Ryan attempts to retrieve it but ends up falling in. Back in his hotel room, he dries the cut-out with a hair dryer, now in a robe and towel. At the airport, Ryan's luggage shows the photo of Julie and Jim poking out, a bit wrinkled. In Detroit, as they drive awkwardly through a snowstorm, Ryan and Natalie exchange glances. They reach an office, where a security guard escorts them to a smaller room with Craig on a video call. Ryan frowns at the screen while Natalie nervously prepares strategy packets. A thickset bald man appears on another screen, and they realize Mr. Samuels is sobbing in the next office. Ryan, concerned, looks between Natalie and the screen, while Craig observes from his end. Mr. Samuels, startled, exits the office in distress, brushing his face as he passes them. Natalie, appearing unsettled, crosses his name off a list of 40. In the snowy car park, Ryan talks to Craig on the phone while Natalie leans on the car, processing the situation. Later, at Detroit airport's north terminal, Ryan and Natalie stand silhouetted against a large window, with a jet visible outside. On a moving walkway, Ryan contemplates a wedding invitation, but as Natalie's smile fades, she walks ahead. Deep in thought, Ryan decides to turn around and retraces his steps."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Alex is already dressed, and he looks at her, bleary-eyed, possibly from lack of sleep after a long night of planning, as she leans down and kisses him, causing him to beam with a hint of relief before Alex goes. Ryan and Natalie have breakfast at the hotel's outdoor cafe, a popular spot known for its fresh pastries and bustling morning atmosphere, sitting at one of many tables under a blue umbrella while she stares at him. They walk along a pier, a historic site famous for its panoramic ocean views, where Natalie has the photo of Julie and Jim, who are old friends who played significant roles in her life. Natalie holds up the photo, which blows into the water, carried away by a sudden gust of wind typical of the coastal breeze. Ryan kneels on the edge of the wooden pier and reaches for it but falls in the water, splashing down with a loud commotion that attracts the attention of nearby tourists. In his hotel room, wearing a white towel and robe provided by the hotel known for its luxurious amenities, Ryan dries the cut-out with a hair dryer, salvaging the image despite its soggy state. Ryan drags his case through the airport, with Julie and Jim poking out of the top, looking a little wrinkled and worn from the earlier mishap. In Detroit, the airport is shrouded in a snowstorm, a common occurrence in Michigan winters, as Ryan and Natalie drive along an icy road, glancing at each other awkwardly, mindful of the treacherous driving conditions. Ryan parks in an office car park, maneuvering carefully on the slick surface, and he and Natalie get out as she holds an arm full of strategy packets, crucial documents for their upcoming meeting. A security guard, familiar with escorting visitors unfamiliar with the office layout, leads them through a busy, open-plan office into a smaller office where Craig is on a computer screen via a video feed, part of the company's efforts to leverage remote technology. Ryan looks at the screen and frowns while she smiles nervously and prepares the packets to distribute. A thickset bald man appears on a computer screen in front of Natalie, a senior manager known for his blunt communication style. Ryan sits with her, and they look up to realize Mr. Samuels is in the next office on the other side of an opaque glass screen, a symbolic barrier reflecting his emotional distance. In distress, Mr. Samuels' chest heaves as he picks up the packet, looks down, and starts to sob, overwhelmed by the gravity of the situation. Ryan frowns and looks between Natalie and Mr. Samuels on the screen, as the heavyset man shakes with grief, each movement heavy with emotion. Natalie's eyes rove, she licks her lips, and Craig watches on his screen, detached yet attentive. Mr. Samuels looks down, startled, gets up, walks out, and Ryan and Natalie watch him wipe his hand across his face as he walks past the office therein, his demeanor a mix of resignation and sorrow. Natalie looks unsettled, nods slightly, looks down at a list of 40 names, a roster of individuals impacted by the decisions made, with number one being Mr. Samuels, and she crosses it out, symbolically marking the completion of a difficult task. In the snowy car park, Ryan talks to Craig on his cell phone, where reception can be spotty due to the weather, while Natalie leans on the car, exhaling visibly in the cold air. Ryan frowns as he listens, hangs up, and turns to Natalie, his mind racing with the implications of their conversation. Later, in the north terminal of Detroit airport, a hub bustling with travelers despite the wintry delay, Ryan and Natalie stand silhouetted against a large window with the nose of a jet looming outside, ready to whisk them away to their next destination. Standing on a moving walkway, Ryan looks at the wedding invitation, a reminder of a joyful commitment amidst the day's somber events, with Natalie behind him, her smile fading as the weight of reality sets in. Natalie walks ahead, and Ryan stares thoughtfully at the wedding invitation and the RSVP slip, contemplating the personal connections that matter most, before stopping, turning around, and heading back the way he came, a decision to prioritize relationships over obligations."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Ryan frowns and looks between Natalie and Mr Samuels on the screen as the heavyset man shakes with grief In Detroit the airport is shrouded in a snow storm as Ryan and Natalie drive along an icy road glancing at each other awkwardly Alex is already dressed and he looks at her blearyeyed as she leans down and kisses him causing him to beam before Alex goes Ryan and Natalie have breakfast at the hotel's outdoor cafe sitting at one of many tables under a blue umbrella while she stares at him They walk along a pier where Natalie has the photo of Julie and Jim Natalie holds up the photo which blows into the water Ryan kneels on the edge of the wooden pier and reaches for it but falls in the water In his hotel room wearing a white towel and robe Ryan dries the cutout with a hair dryer Ryan frowns as he listens hangs up and turns to Natalie Natalie holds up the photo which blows into the water Ryan and Natalie have breakfast at the hotel's outdoor cafe sitting at one of many tables under a blue umbrella while she stares at him Ryan drags his case through the airport with Julie and Jim poking out of the top looking a little wrinkled and worn In Detroit the airport is shrouded in a snow storm as Ryan and Natalie drive along an icy road glancing at each other awkwardly Ryan parks in an office car park and he and Natalie get out as she holds an arm full of strategy packets Ryan kneels on the edge of the wooden pier and reaches for it but falls in the water A security guard leads them through a busy openplan office into a smaller office where Craig is on a computer screen via a video feed They walk along a pier where Natalie has the photo of Julie and Jim Ryan looks at the screen and frowns while she smiles nervously and prepares the packets A thickset bald man appears on a computer screen in front of Natalie Standing on a moving walkway Ryan sits with her and they look up to realize Mr Samuels is in the next office on the other side of an opaque glass screen In distress Mr Samuels' chest heaves as he picks up the packet looks down and starts to sob Natalie walks ahead and Ryan stares thoughtfully at the wedding invitation and the RSVP slip before stopping turning around and heading back the way he came Alex is already dressed and he looks at her blearyeyed as she leans down and kisses him causing him to beam before Alex goes Ryan frowns and looks between Natalie and Mr Samuels on the screen as the heavyset man shakes with grief Natalie's eyes rove Ryan parks in an office car park and he and Natalie get out as she holds an arm full of strategy packets she licks her lips and Craig watches on his screen Mr Samuels looks down startled gets up walks out and Ryan and Natalie watch him wipe his hand across his face as he walks past the office therein Natalie looks unsettled nods slightly looks down at a list of 40 names flitting her eyes nervously with number one being Mr Samuels and she crosses it out Ryan looks at the wedding invitation with Natalie behind him her smile fading In distress Mr Samuels' chest heaves as he picks up the packet looks down and starts to sob In the snowy car park Ryan talks to Craig on his cell phone while Natalie leans on the car Ryan frowns as he listens hangs up and turns to Natalie Later in the north terminal of Detroit airport Ryan and Natalie stand silhouetted against a large window with the nose of a jet looming outside Standing on a moving walkway Ryan looks at the wedding invitation with Natalie behind him her smile fading Natalie walks ahead and Ryan stares thoughtfully at the wedding invitation and the RSVP slip before stopping turning around and heading back the way he came"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Alex is already dressed and he looks at her blearyeyed as she leans down and kisses him causing him to beam before Alex goes. Ryan and Natalie have breakfast at the hotel's outdoor cafe sitting at one of many tables under a blue umbrella while she stares at him. They walk along a pier where Natalie has the photo of Julie and Jim. Natalie holds up the photo which blows into the water. Ryan kneels on the edge of the wooden pier and reaches for it but falls in the water. In his hotel room wearing a white towel and robe Ryan dries the cutout with a hair dryer. Ryan drags his case through the airport with Julie and Jim poking out of the top looking a little wrinkled and worn. In Detroit the airport is shrouded in a snow storm as Ryan and Natalie drive along an icy road glancing at each other awkwardly. Ryan parks in an office car park and he and Natalie get out as she holds an arm full of strategy packets. A security guard leads them through a busy openplan office into a smaller office where Craig is on a computer screen via a video feed. Ryan looks at the screen and frowns while she smiles nervously and prepares the packets. A thickset bald man appears on a computer screen in front of Natalie. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Ryan sits with her and they look up to realize Mr Samuels is in the next office on the other side of an opaque glass screen. In distress Mr Samuels' chest heaves as he picks up the packet looks down and starts to sob. Ryan frowns and looks between Natalie and Mr Samuels on the screen as the heavyset man shakes with grief. Natalie's eyes rove. she licks her lips and Craig watches on his screen. Mr Samuels looks down startled gets up walks out and Ryan and Natalie watch him wipe his hand across his face as he walks past the office therein. Natalie looks unsettled nods slightly looks down at a list of 40 names flitting her eyes nervously with number one being Mr Samuels and she crosses it out. In the snowy car park Ryan talks to Craig on his cell phone while Natalie leans on the car. Ryan frowns as he listens hangs up and turns to Natalie. Later in the north terminal of Detroit airport Ryan and Natalie stand silhouetted against a large window with the nose of a jet looming outside. Standing on a moving walkway. Ryan looks at the wedding invitation with Natalie behind him her smile fading. Natalie walks ahead and Ryan stares thoughtfully at the wedding invitation and the RSVP slip before stopping turning around and heading back the way he came."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Alex is already dressed and he looks at her blearyeyed as she leans down and kisses him causing him to beam before Alex goes. Ryan and Natalie have breakfast at the hotel's outdoor cafe sitting at one of many tables under a blue umbrella while she stares at him. They walk along a pier where Natalie has the photo of Julie and Jim. Natalie holds up the photo which blows into the water. Ryan kneels on the edge of the wooden pier and reaches for it but falls in the water. In his hotel room wearing a white towel and robe Ryan dries the cutout with a hair dryer. Ryan drags his case through the airport with Julie and Jim poking out of the top looking a little wrinkled and worn. In Detroit the airport is shrouded in a snow storm as Ryan and Natalie drive along an icy road glancing at each other awkwardly. Ryan parks in an office car park and he and Natalie get out as she holds an arm full of strategy packets. A security guard leads them through a busy openplan office into a smaller office where Craig is on a computer screen via a video feed. Ryan looks at the screen and frowns while she smiles nervously and prepares the packets. A thickset bald man appears on a computer screen in front of Natalie. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Ryan sits with her and they look up to realize Mr Samuels is in the next office on the other side of an opaque glass screen. In distress Mr Samuels' chest heaves as he picks up the packet looks down and starts to sob. Ryan frowns and looks between Natalie and Mr Samuels on the screen as the heavyset man shakes with grief. Natalie's eyes rove. she licks her lips and Craig watches on his screen. Mr Samuels looks down startled gets up walks out and Ryan and Natalie watch him wipe his hand across his face as he walks past the office therein. Natalie looks unsettled nods slightly looks down at a list of 40 names flitting her eyes nervously with number one being Mr Samuels and she crosses it out. In the snowy car park Ryan talks to Craig on his cell phone while Natalie leans on the car. Ryan frowns as he listens hangs up and turns to Natalie. Later in the north terminal of Detroit airport Ryan and Natalie stand silhouetted against a large window with the nose of a jet looming outside. Standing on a moving walkway. Ryan looks at the wedding invitation with Natalie behind him her smile fading. Natalie walks ahead and Ryan stares thoughtfully at the wedding invitation and the RSVP slip before stopping turning around and heading back the way he came."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Alex is already dressed and he looks at her blearyeyed as she leans down and kisses him causing him to beam before Alex goes. Ryan and Natalie have breakfast at the hotel's outdoor cafe sitting at one of many tables under a blue umbrella while she stares at him. They walk along a pier where Natalie has the photo of Julie and Jim. Natalie holds up the photo which blows into the water. Ryan kneels on the edge of the wooden pier and reaches for it but falls in the water. In his hotel room wearing a white towel and robe Ryan dries the cutout with a hair dryer. Natalie looks unsettled nods slightly looks down at a list of 40 names flitting her eyes nervously with number one being Mr Samuels and she crosses it out. In the snowy car park Ryan talks to Craig on his cell phone while Natalie leans on the car. Ryan frowns as he listens hangs up and turns to Natalie. Later in the north terminal of Detroit airport Ryan and Natalie stand silhouetted against a large window with the nose of a jet looming outside. Standing on a moving walkway. Ryan looks at the wedding invitation with Natalie behind him her smile fading. Natalie walks ahead and Ryan stares thoughtfully at the wedding invitation and the RSVP slip before stopping turning around and heading back the way he came."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Alex is already dressed and he looks at her blearyeyed as she leans down and kisses him causing him to beam before Alex goes. Ryan and Natalie have breakfast at the hotel's outdoor cafe sitting at one of many tables under a blue umbrella while she stares at him. Standing on a moving walkway. Ryan looks at the wedding invitation with Natalie behind him her smile fading. Natalie walks ahead and Ryan stares thoughtfully at the wedding invitation and the RSVP slip before stopping turning around and heading back the way he came."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dog is already dressed, and it looks at the goldfish, bleary-eyed, as the goldfish leans down and kisses the dog, causing the dog to beam before the dog goes. The kangaroo and the parrot have breakfast at the hotel's outdoor cafe, sitting at one of many tables under a blue umbrella while the parrot stares at the kangaroo. They walk along a pier where the parrot has the photo of the rabbit and the elephant. The parrot holds up the photo, which blows into the water. The kangaroo kneels on the edge of the wooden pier and reaches for it but falls in the water. In its hotel room, wearing a white towel and robe, the kangaroo dries the cut-out with a hair dryer. The kangaroo drags its case through the airport, with the rabbit and the elephant poking out of the top, looking a little wrinkled and worn. In Detroit, the airport is shrouded in a snow storm as the kangaroo and the parrot drive along an icy road, glancing at each other awkwardly. The kangaroo parks in an office car park, and it and the parrot get out as the parrot holds an arm full of strategy packets. A security guard leads them through a busy, open-plan office into a smaller office where the giraffe is on a computer screen via a video feed. The kangaroo looks at the screen and frowns while the parrot smiles nervously and prepares the packets. A thickset bald man appears on a computer screen in front of the parrot. The kangaroo sits with the parrot, and they look up to realize Mr. Samuels is in the next office on the other side of an opaque glass screen. In distress, Mr. Samuels' chest heaves as he picks up the packet, looks down, and starts to sob. The kangaroo frowns and looks between the parrot and Mr. Samuels on the screen, as the heavyset man shakes with grief. The parrot's eyes rove, it licks its lips, and the giraffe watches on its screen. Mr. Samuels looks down, startled, gets up, walks out, and the kangaroo and the parrot watch him wipe his hand across his face as he walks past the office therein. The parrot looks unsettled, nods slightly, looks down at a list of 40 names, flitting its eyes nervously, with number one being Mr. Samuels, and it crosses it out. In the snowy car park, the kangaroo talks to the giraffe on its cell phone while the parrot leans on the car. The kangaroo frowns as it listens, hangs up, and turns to the parrot. Later, in the north terminal of Detroit airport, the kangaroo and the parrot stand silhouetted against a large window with the nose of a jet looming outside. Standing on a moving walkway, the kangaroo looks at the wedding invitation with the parrot behind it, its smile fading. The parrot walks ahead, and the kangaroo stares thoughtfully at the wedding invitation and the RSVP slip before stopping, turning around, and heading back the way it came."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Alex is already dressed, and he looks at her, bleary-eyed, as she leans down and kisses him, causing him to beam before Alex goes. Ryan and Natalie have breakfast at the theme park's outdoor grill, sitting at one of many benches under a red balloon while she stares at him. They walk along a path where Natalie has the postcard of Julie and Jim. Natalie holds up the postcard, which blows into the fountain. Ryan kneels on the edge of the stone path and reaches for it but falls in the fountain. In his hotel room, wearing a striped blanket and robe, Ryan dries the pamphlet with a fan. Ryan drags his crate through the station, with Julie and Jim poking out of the top, looking a little crumpled and worn. In Detroit, the station is shrouded in a fog as Ryan and Natalie drive along a sandy road, glancing at each other awkwardly. Ryan parks in an office garage, and he and Natalie get out as she holds an arm full of instruction booklets. A security guard leads them through a crowded, open-plan workspace into a smaller cubicle where Craig is on a projector screen via a video link. Ryan looks at the screen and frowns while she smiles nervously and prepares the booklets. A thickset bald man appears on a projector screen in front of Natalie. Ryan sits with her, and they look up to realize Mr. Samuels is in the next cubicle on the other side of an opaque glass screen. In distress, Mr. Samuels' chest heaves as he picks up the booklet, looks down, and starts to sob. Ryan frowns and looks between Natalie and Mr. Samuels on the screen, as the heavyset man shakes with grief. Natalie's eyes rove, she licks her lips, and Craig watches on his link. Mr. Samuels looks down, startled, gets up, walks out, and Ryan and Natalie watch him wipe his hand across his face as he walks past the cubicle therein. Natalie looks unsettled, nods slightly, looks down at a list of 40 terms, flitting her eyes nervously, with number one being Mr. Samuels, and she crosses it out. In the foggy garage, Ryan talks to Craig on his pager while Natalie leans on the vehicle. Ryan frowns as he listens, hangs up, and turns to Natalie. Later, in the south terminal of Detroit station, Ryan and Natalie stand silhouetted against a large wall with the fin of a yacht looming outside. Standing on a moving platform, Ryan looks at the birthday invitation with Natalie behind him, her smile fading. Natalie walks ahead, and Ryan stares thoughtfully at the birthday invitation and the RSVP slip before stopping, turning around, and heading back the way he came."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Alex is already dressed, and he glances at her, bleary-eyed, as she leans down and tickles him, causing him to giggle before Alex departs. Ryan and Natalie sip coffee at the hotel's outdoor cafe, reclining at one of many tables under a blue umbrella while she glares at him. They stroll along a pier where Natalie possesses the photo of Julie and Jim. Natalie waves the photo, which flutters into the water. Ryan crouches on the edge of the wooden pier and reaches for it but tumbles into the water. In his hotel room, wearing a white towel and robe, Ryan arranges the cut-out with a hair dryer. Ryan rolls his case through the airport, with Julie and Jim peeking out of the top, appearing a little crumpled and worn. In Detroit, the airport is enveloped in a snow storm as Ryan and Natalie cruise along an icy road, peering at each other awkwardly. Ryan halts in an office car park, and he and Natalie exit as she cradles an arm full of strategy packets. A security guard guides them through a busy, open-plan office into a smaller office where Craig is on a computer screen via a video feed. Ryan glares at the screen and sighs while she grins nervously and arranges the packets. A thickset bald man emerges on a computer screen in front of Natalie. Ryan reclines with her, and they gaze up to realize Mr. Samuels is in the next office on the other side of an opaque glass screen. In distress, Mr. Samuels' chest heaves as he seizes the packet, glances down, and begins to sob. Ryan scowls and looks between Natalie and Mr. Samuels on the screen, as the heavyset man quivers with grief. Natalie's gaze flits, she purses her lips, and Craig observes on his screen. Mr. Samuels glances down, startled, rises, marches out, and Ryan and Natalie watch him brush his hand across his face as he strides past the office therein. Natalie looks unsettled, nods slightly, glances down at a list of 40 names, darting her eyes nervously, with number one being Mr. Samuels, and she strikes it out. In the snowy car park, Ryan converses with Craig on his cell phone while Natalie leans on the car. Ryan grimaces as he listens, hangs up, and turns to Natalie. Later, in the north terminal of Detroit airport, Ryan and Natalie stand silhouetted against a large window with the nose of a jet looming outside. Standing on a moving walkway, Ryan examines the wedding invitation with Natalie behind him, her smile fading. Natalie strolls ahead, and Ryan gazes thoughtfully at the wedding invitation and the RSVP slip before pausing, pivoting, and retracing his steps."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Jordan is already dressed, and she looks at him, bleary-eyed, as he leans down and kisses her, causing her to beam before Jordan goes. Taylor and Sam have breakfast at the library's outdoor bench, sitting at one of many chairs under a green awning while he stares at her. They stroll along a boardwalk where Sam has the postcard of Connor and Lisa. Sam holds up the postcard, which flies into the lake. Taylor kneels on the edge of the wooden boardwalk and reaches for it but falls in the lake. In his gym locker, wearing a yellow blanket and slippers, Taylor dries the brochure with a hair dryer. Taylor drags his backpack through the bus station, with Connor and Lisa poking out of the top, looking a little wrinkled and worn. In Chicago, the bus station is shrouded in a rainstorm as Taylor and Sam drive along a slick road, glancing at each other awkwardly. Taylor parks in a school parking lot, and he and Sam get out as he holds an arm full of presentation folders. A janitor leads them through a busy, open-plan classroom into a smaller classroom where Jamie is on a computer screen via a video feed. Taylor looks at the screen and frowns while he smiles nervously and prepares the folders. A skinny tall woman appears on a computer screen in front of Sam. Taylor sits with him, and they look up to realize Mrs. Green is in the next classroom on the other side of an opaque glass screen. In distress, Mrs. Green's chest heaves as she picks up the folder, looks down, and starts to sob. Taylor frowns and looks between Sam and Mrs. Green on the screen, as the thin woman shakes with grief. Sam's eyes rove, he licks his lips, and Jamie watches on his screen. Mrs. Green looks down, startled, gets up, walks out, and Taylor and Sam watch her wipe her hand across her face as she walks past the classroom therein. Sam looks unsettled, nods slightly, looks down at a list of 40 tasks, flitting his eyes nervously, with number one being Mrs. Green, and he crosses it out. In the rainy parking lot, Taylor talks to Jamie on his cell phone while Sam leans on the van. Taylor frowns as he listens, hangs up, and turns to Sam. Later, in the south terminal of Chicago bus station, Taylor and Sam stand silhouetted against a large window with the wheels of a train looming outside. Standing on a moving escalator, Taylor looks at the concert ticket with Sam behind him, his smile fading. Sam walks ahead, and Taylor stares thoughtfully at the concert ticket and the RSVP slip before stopping, turning around, and heading back the way he came."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Jordan is already prepared, and he glances at her, sleepy-headed, as she bends down and embraces him, causing him to chuckle before Jordan departs. Dylan and Samantha have brunch at the hotel's outdoor bistro, sitting at one of many tables under a red parasol while she gazes at him. They meander along a boardwalk where Samantha has the picture of Amanda and Tom. Samantha holds up the picture, which drifts into the water. Dylan squats on the edge of the wooden boardwalk and reaches for it but tumbles into the water. In his hotel room, wearing a blue towel and robe, Dylan dries the snapshot with a hand dryer. Dylan hauls his suitcase through the airport, with Amanda and Tom peeking out of the top, looking a tad crumpled and worn. In Chicago, the airport is enveloped in a rainstorm as Dylan and Samantha drive along a slippery street, glancing at each other uneasily. Dylan stops in a company parking lot, and he and Samantha get out as she carries a bundle of project folders. A receptionist guides them through a bustling, open-plan office into a smaller office where Mike is on a computer monitor via a video link. Dylan glances at the monitor and narrows his eyes while she grins nervously and arranges the folders. A burly bald man appears on a computer monitor in front of Samantha. Dylan sits with her, and they look up to realize Mr. Thompson is in the adjacent office on the other side of a frosted glass screen. In anguish, Mr. Thompson's shoulders shudder as he picks up the folder, looks down, and begins to weep. Dylan narrows his eyes and looks between Samantha and Mr. Thompson on the monitor, as the burly man trembles with sorrow. Samantha's gaze wanders, she bites her lip, and Mike observes on his monitor. Mr. Thompson looks down, taken aback, gets up, exits, and Dylan and Samantha watch him wipe his sleeve across his face as he walks past the office therein. Samantha looks discomposed, nods slightly, looks down at a roster of 40 individuals, darting her gaze anxiously, with number one being Mr. Thompson, and she crosses it out. In the rainy parking lot, Dylan speaks to Mike on his mobile while Samantha leans on the vehicle. Dylan narrows his eyes as he listens, ends the call, and turns to Samantha. Later, in the south terminal of Chicago airport, Dylan and Samantha stand silhouetted against a large window with the wing of a plane looming outside. Standing on a moving escalator, Dylan looks at the engagement invitation with Samantha behind him, her grin vanishing. Samantha strides ahead, and Dylan gazes thoughtfully at the engagement invitation and the RSVP slip before halting, turning around, and retracing his steps."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Alex is already adorned, and he gazes at her, groggy, as she bends down and nudges him, prompting him to grin before Alex departs. Ryan and Natalie enjoy brunch at the hotel's rooftop lounge, perched at one of several stools beneath a red lantern while she glances at him. They amble along a bridge where Natalie has the map of Julie and Jim. Natalie waves the map, which drifts onto the shoreline. Ryan crouches on the edge of the metal bridge and grasps for it but tumbles on the shore. In his hotel room, wearing a green scarf and jacket, Ryan warms the printout with a desk lamp. Ryan rolls his crate through the station, with Julie and Jim peeking out of the top, appearing slightly crumpled and faded. In Detroit, the station is cloaked in a rainstorm as Ryan and Natalie cruise along a slick road, peeking at each other uneasily. Ryan halts in a warehouse driveway, and he and Natalie hop out as she carries an armload of presentation folders. A security guard guides them through a bustling, cubicle-filled area into a compact meeting room where Craig is on a TV screen via a live stream. Ryan glances at the screen and grimaces while she grins timidly and arranges the folders. A burly mustached man appears on a TV screen in front of Natalie. Ryan sits with her, and they look up to realize Mr. Samuels is in the neighboring room on the other side of a frosted glass divider. In distress, Mr. Samuels' shoulders sag as he picks up the folder, looks down, and begins to cry. Ryan grimaces and looks between Natalie and Mr. Samuels on the screen, as the burly man trembles with sorrow. Natalie's eyes dart, she bites her lip, and Craig observes on his screen. Mr. Samuels looks down, surprised, rises, exits, and Ryan and Natalie watch him brush his hand across his face as he walks past the room nearby. Natalie appears uneasy, nods slightly, looks down at a list of 40 tasks, darting her eyes nervously, with item one being Mr. Samuels, and she marks it off. In the rainy driveway, Ryan chats with Craig on his mobile while Natalie leans on the van. Ryan grimaces as he listens, disconnects, and turns to Natalie. Later, in the west terminal of Detroit station, Ryan and Natalie stand silhouetted against a large window with the nose of a blimp hovering outside. Standing on a moving sidewalk, Ryan glances at the birthday card with Natalie behind him, her grin diminishing. Natalie strides ahead, and Ryan contemplates the birthday card and the RSVP note before pausing, turning around, and retracing his steps."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Jordan is already costumed, and she glances at him, half-asleep, as he bends up and nudges her, causing her to grin before Jordan departs. Taylor and Morgan have brunch at the park's petting zoo, lounging at one of many benches under a red balloon while he gazes at her. They shuffle past a brook where Morgan has the sketch of Charlie and Sam. Morgan waves the sketch, which floats into the pond. Taylor squats on the edge of the wooden path and reaches for it but tumbles into the pond. In her apartment suite, clad in a red scarf and slippers, Taylor dries the clipping with a space heater. Taylor lugs her satchel through the subway, with Charlie and Sam peeking out of the top, appearing a bit crumpled and faded. In Chicago, the subway is cloaked in a downpour as Taylor and Morgan trudge along a slippery lane, peering at each other hesitantly. Taylor stops in a conference lot, and he and Morgan step out as he clutches a bundle full of exploration maps. A janitor guides them through a crowded, cubicle-filled workspace into a smaller cubbyhole where Jamie is on a tablet via a video call. Taylor glances at the tablet and grimaces while he grins awkwardly and arranges the maps. A petite, bearded woman appears on a tablet in front of Morgan. Taylor lounges with him, and they look up to discover Ms. Jenkins is in the next cubicle on the far side of a frosted glass partition. In anguish, Ms. Jenkins’ shoulders shake as she picks up the map, peers down, and starts to wail. Taylor grimaces and glances between Morgan and Ms. Jenkins on the tablet, as the petite woman trembles with sorrow. Morgan’s eyes wander, he bites his tongue, and Jamie observes on his tablet. Ms. Jenkins gazes down, startled, rises up, strides out, and Taylor and Morgan observe her swipe her sleeve across her face as she strides past the cubbyhole therein. Morgan appears anxious, nods faintly, peers down at a directory of 40 contacts, darting her gaze nervously, with number one being Ms. Jenkins, and she erases it. In the drizzly conference lot, Taylor chats with Jamie on his mobile while Morgan reclines on the bus. Taylor grimaces as he hears, disconnects, and turns to Morgan. Later, in the west corridor of Chicago subway, Taylor and Morgan stand silhouetted against a massive doorway with the nose of a helicopter appearing outside. Standing on an escalator, Taylor gazes at the anniversary card with Morgan behind him, her grin dissipating. Morgan strides ahead, and Taylor contemplates quietly at the anniversary card and the RSVP note before pausing, pivoting around, and retracing the way he came."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Alex beams as he leaves after a kiss from her. Ryan and Natalie have breakfast at the hotel, sitting under a blue umbrella. On a pier, Natalie holds a photo of Julie and Jim, which blows into the water. Ryan falls in trying to retrieve it. In his hotel room, drying the photo with a hair dryer, Ryan sees the photo sticking out of his case at the airport. In snowy Detroit, Ryan and Natalie drive awkwardly and arrive at an office. They prepare strategy packets while Craig is on a video screen. Mr. Samuels, seen through opaque glass, becomes distressed as his chest heaves and he sobs. Ryan exchanges looks with Natalie as Craig observes. Mr. Samuels leaves, wiping his face. Natalie crosses his name off a list. In the snowy car park, Ryan talks to Craig on his phone. At Detroit airport, Ryan and Natalie are silhouetted against a jet. On a moving walkway, Ryan glances at a wedding invitation and RSVP, stops, and turns back thoughtfully as Natalie walks ahead, her smile fading."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Natalie walks ahead and Ryan stares thoughtfully at the wedding invitation and the RSVP slip before stopping turning around and heading back the way he came Ryan looks at the wedding invitation with Natalie behind him her smile fading Standing on a moving walkway Later in the north terminal of Detroit airport Ryan and Natalie stand silhouetted against a large window with the nose of a jet looming outside Ryan frowns as he listens hangs up and turns to Natalie In the snowy car park Ryan talks to Craig on his cell phone while Natalie leans on the car Natalie looks unsettled nods slightly looks down at a list of 40 names flitting her eyes nervously with number one being Mr Samuels and she crosses it out Mr Samuels looks down startled gets up walks out and Ryan and Natalie watch him wipe his hand across his face as he walks past the office therein she licks her lips and Craig watches on his screen Natalie's eyes rove Ryan frowns and looks between Natalie and Mr Samuels on the screen as the heavyset man shakes with grief In distress Mr Samuels' chest heaves as he picks up the packet looks down and starts to sob Ryan sits with her and they look up to realize Mr Samuels is in the next office on the other side of an opaque glass screen A thickset bald man appears on a computer screen in front of Natalie Ryan looks at the screen and frowns while she smiles nervously and prepares the packets A security guard leads them through a busy openplan office into a smaller office where Craig is on a computer screen via a video feed Ryan parks in an office car park and he and Natalie get out as she holds an arm full of strategy packets In Detroit the airport is shrouded in a snow storm as Ryan and Natalie drive along an icy road glancing at each other awkwardly Ryan drags his case through the airport with Julie and Jim poking out of the top looking a little wrinkled and worn In his hotel room wearing a white towel and robe Ryan dries the cutout with a hair dryer Ryan kneels on the edge of the wooden pier and reaches for it but falls in the water Natalie holds up the photo which blows into the water They walk along a pier where Natalie has the photo of Julie and Jim Ryan and Natalie have breakfast at the hotel's outdoor cafe sitting at one of many tables under a blue umbrella while she stares at him Alex is already dressed and he looks at her blearyeyed as she leans down and kisses him causing him to beam before Alex goes"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "she licks her lips and Craig watches on his screen Ryan sits with her and they look up to realize Mr Samuels is in the next office on the other side of an opaque glass screen A security guard leads them through a busy openplan office into a smaller office where Craig is on a computer screen via a video feed In the snowy car park Ryan talks to Craig on his cell phone while Natalie leans on the car Natalie looks unsettled nods slightly looks down at a list of 40 names flitting her eyes nervously with number one being Mr Samuels and she crosses it out Ryan drags his case through the airport with Julie and Jim poking out of the top looking a little wrinkled and worn In his hotel room wearing a white towel and robe Ryan dries the cutout with a hair dryer Ryan looks at the screen and frowns while she smiles nervously and prepares the packets Natalie's eyes rove Later in the north terminal of Detroit airport Ryan and Natalie stand silhouetted against a large window with the nose of a jet looming outside A thickset bald man appears on a computer screen in front of Natalie Mr Samuels looks down startled gets up walks out and Ryan and Natalie watch him wipe his hand across his face as he walks past the office therein Ryan and Natalie have breakfast at the hotel's outdoor cafe sitting at one of many tables under a blue umbrella while she stares at him Ryan frowns and looks between Natalie and Mr Samuels on the screen as the heavyset man shakes with grief Standing on a moving walkway In distress Mr Samuels' chest heaves as he picks up the packet looks down and starts to sob They walk along a pier where Natalie has the photo of Julie and Jim Ryan looks at the wedding invitation with Natalie behind him her smile fading Ryan kneels on the edge of the wooden pier and reaches for it but falls in the water Natalie walks ahead and Ryan stares thoughtfully at the wedding invitation and the RSVP slip before stopping turning around and heading back the way he came In Detroit the airport is shrouded in a snow storm as Ryan and Natalie drive along an icy road glancing at each other awkwardly Ryan parks in an office car park and he and Natalie get out as she holds an arm full of strategy packets Alex is already dressed and he looks at her blearyeyed as she leans down and kisses him causing him to beam before Alex goes Natalie holds up the photo which blows into the water Ryan frowns as he listens hangs up and turns to Natalie"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "In distress Mr Samuels' chest heaves as he picks up the packet looks down and starts to sob Ryan frowns and looks between Natalie and Mr Samuels on the screen as the heavyset man shakes with grief Natalie's eyes rove she licks her lips and Craig watches on his screen Mr Samuels looks down startled gets up walks out and Ryan and Natalie watch him wipe his hand across his face as he walks past the office therein Natalie looks unsettled nods slightly looks down at a list of 40 names flitting her eyes nervously with number one being Mr Samuels and she crosses it out In the snowy car park Ryan talks to Craig on his cell phone while Natalie leans on the car Ryan frowns as he listens hangs up and turns to Natalie Later in the north terminal of Detroit airport Ryan and Natalie stand silhouetted against a large window with the nose of a jet looming outside Standing on a moving walkway Ryan looks at the wedding invitation with Natalie behind him her smile fading Natalie walks ahead and Ryan stares thoughtfully at the wedding invitation and the RSVP slip before stopping turning around and heading back the way he came Alex is already dressed and he looks at her blearyeyed as she leans down and kisses him causing him to beam before Alex goes Ryan and Natalie have breakfast at the hotel's outdoor cafe sitting at one of many tables under a blue umbrella while she stares at him They walk along a pier where Natalie has the photo of Julie and Jim Natalie holds up the photo which blows into the water Ryan kneels on the edge of the wooden pier and reaches for it but falls in the water In his hotel room wearing a white towel and robe Ryan dries the cutout with a hair dryer Ryan drags his case through the airport with Julie and Jim poking out of the top looking a little wrinkled and worn In Detroit the airport is shrouded in a snow storm as Ryan and Natalie drive along an icy road glancing at each other awkwardly Ryan parks in an office car park and he and Natalie get out as she holds an arm full of strategy packets A security guard leads them through a busy openplan office into a smaller office where Craig is on a computer screen via a video feed Ryan looks at the screen and frowns while she smiles nervously and prepares the packets A thickset bald man appears on a computer screen in front of Natalie Ryan sits with her and they look up to realize Mr Samuels is in the next office on the other side of an opaque glass screen"
        }
      ]
    }
  ]
}