{
  "ground_truth": "Ryan is distracted, sitting in front of a computer screen, and he puts on a headset. In a meeting with Craig and other employees, Ryan looks at the schedule for the Gold Quest Conference on his laptop. At home, he takes a couple of whiskey miniatures from his fridge and stands looking out of a window with a drink in his hand. A large video screen outside a Las Vegas hotel displays a caption. Ryan waits in the wings of a packed conference hall, and smartly suited, he puts his backpack on a table and steps up to a lectern. Computer-generated backpacks revolve on the screens behind him, and Ryan looks out across the room full of seated delegates. Lost in his thoughts, he hangs his head, then shakes it slightly before looking up and smiling to himself. He taps his thumb on the lectern, walks off past a backstage guy, and leaves the building. Ryan runs through the airport, dragging his case with one hand, while a boarding pass flaps in the other. He reaches a Departure gate, gets the pass checked, and goes through. On a jet, Ryan gazes out of the window at the nighttime lights of Chicago. In a flurry of snow, Ryan picks up a Hertz rental car, signs, gets in, and drives away. Ryan drives along slush-covered roads, glancing at a piece of paper in his hand and scanning the streets. He pulls up, leaves the lights on, and gets out of the car. Jogging along a pavement, he walks up to a large suburban townhouse and rings the doorbell. Ryan steps back, puts his hands in the pockets of his long black coat, and tries to act casual as Alex opens the door. His cheeky smile quickly fades when he sees two young boys run up the stairs behind Alex. Mortified, Alex stares at Ryan, who slowly backs away as she shuts the door. Ryan turns and goes. In a hotel room, he sits staring out of the window into the night and sips a large whiskey. Ryan's solitary figure is framed by one of the row of tall windows in a nondescript hotel block. Ryan arrives at the airport, drags his case through the busy terminal building, swipes his card at the self-service check-in, and takes the shuttle train to his gate. He perches on the edge of a seat, looking morose, when Alex calls him from her car. Ryan looks tearful, and tears well up in his eyes. Ryan opens his mouth as if he's about to speak, but instead shuts his eyes and hangs up, looking deeply hurt. On his flight, Ryan sits staring into space, and a stewardess hands him a glass of champagne.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Ryan is inattentive, sitting in front of a computer display, and he puts on a headset. In a gathering with Craig and other workers, Ryan looks at the timetable for the Gold Quest Conference on his laptop. At home, he takes a pair of whiskey miniatures from his refrigerator and stands peering out of a window with a drink in his hand. A large video display outside a Las Vegas inn exhibits a caption. Ryan waits in the wings of a crowded conference hall, and smartly attired, he puts his backpack on a table and steps up to a lectern. Computer-generated backpacks spin on the screens behind him, and Ryan looks out across the room full of seated attendees. Lost in his reflections, he hangs his head, then shakes it slightly before looking up and grinning to himself. He taps his thumb on the lectern, walks off past a backstage technician, and leaves the structure. Ryan runs through the airport, dragging his suitcase with one hand, while a boarding pass flaps in the other. He reaches a Departure gate, gets the pass verified, and moves through. On a plane, Ryan gazes out of the window at the nighttime illuminations of Chicago. In a flurry of snow, Ryan picks up a Hertz lease car, signs, gets in, and drives away. Ryan drives along slush-covered avenues, glancing at a sheet of paper in his hand and scanning the thoroughfares. He pulls up, leaves the lights on, and gets out of the car. Jogging along a walkway, he walks up to a large suburban townhouse and rings the doorbell. Ryan steps back, puts his hands in the pockets of his long black coat, and attempts to act nonchalant as Alex opens the door. His impudent grin quickly fades when he sees two young boys run up the steps behind Alex. Mortified, Alex stares at Ryan, who slowly retreats as she shuts the door. Ryan turns and departs. In a hotel room, he sits staring out of the window into the night and sips a large whiskey. Ryan's solitary figure is framed by one of the row of tall windows in an unremarkable hotel block. Ryan arrives at the airport, drags his suitcase through the busy terminal building, swipes his card at the self-service check-in, and takes the shuttle train to his gate. He perches on the edge of a seat, looking despondent, when Alex calls him from her car. Ryan looks tearful, and tears well up in his eyes. Ryan opens his mouth as if he's about to speak, but instead shuts his eyes and hangs up, looking deeply hurt. On his flight, Ryan sits staring into space, and a stewardess hands him a glass of champagne."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Ryan is distracted, sitting in front of a computer screen, and a headset is put on by him. In a meeting with Craig and other employees, the schedule for the Gold Quest Conference on his laptop is looked at by Ryan. At home, a couple of whiskey miniatures are taken from his fridge by him, and he stands looking out of a window with a drink in his hand. A caption is displayed by a large video screen outside a Las Vegas hotel. Ryan waits in the wings of a packed conference hall, and smartly suited, his backpack is put on a table by him, and he steps up to a lectern. Computer-generated backpacks are revolved on the screens behind him, and Ryan looks out across the room full of seated delegates. Lost in his thoughts, his head is hung by him, then it is shaken slightly before he looks up and smiles to himself. His thumb is tapped on the lectern, he walks off past a backstage guy, and the building is left by him. Ryan runs through the airport, his case is dragged with one hand by him, while a boarding pass flaps in the other. A Departure gate is reached by him, the pass is checked by him, and he goes through. On a jet, the window is gazed out of by Ryan at the nighttime lights of Chicago. In a flurry of snow, a Hertz rental car is picked up by Ryan, and he signs, gets in, and drives away. Slush-covered roads are driven along by Ryan, and a piece of paper in his hand is glanced at by him while he scans the streets. A car is pulled up by him, the lights are left on by him, and the car is gotten out of by him. Jogging along a pavement, a large suburban townhouse is walked up to by him, and the doorbell is rung by him. Ryan steps back, his hands are put in the pockets of his long black coat by him, and he tries to act casual as Alex opens the door. A cheeky smile quickly fades on him when two young boys are seen by him running up the stairs behind Alex. Mortified, Alex stares at Ryan, who slowly backs away as she shuts the door. Ryan turns and goes. In a hotel room, the window is stared out of into the night by him, and a large whiskey is sipped by him. Ryan's solitary figure is framed by one of the row of tall windows in a nondescript hotel block. Ryan arrives at the airport, his case is dragged through the busy terminal building by him, his card is swiped at the self-service check-in by him, and the shuttle train is taken to his gate by him. He perches on the edge of a seat, looking morose, when a call is made to him by Alex from her car. Ryan looks tearful, and tears well up in his eyes. His mouth is opened by Ryan as if he's about to speak, but instead, his eyes are shut by him, and the call is hung up, looking deeply hurt. On his flight, space is stared into by Ryan, and a stewardess hands him a glass of champagne."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Ryan, distracted, sits at a computer and puts on a headset. In a meeting with Craig and others, he checks the Gold Quest Conference schedule on his laptop. At home, he takes whiskey miniatures from the fridge and gazes out the window with a drink. A large video screen outside a Las Vegas hotel displays a caption. Waiting in the wings of a packed conference hall, Ryan, smartly dressed, places his backpack on a table and approaches the lectern. Computer-generated backpacks spin on screens behind him as he surveys the room of delegates. Lost in thought, he hangs his head, then smiles to himself. He taps the lectern, walks past a backstage worker, and exits. Ryan runs through the airport, dragging his case and holding a boarding pass. He reaches a gate, gets the pass checked, and boards. On a jet, he gazes at Chicago's nighttime lights. In snow, Ryan picks up a Hertz rental car, signs, and drives away. He navigates slushy roads, glancing at a paper and scanning streets. He stops, leaves the lights on, and jogs to a suburban townhouse, ringing the doorbell. Ryan steps back, hands in pockets, trying to act casual as Alex opens the door. His smile fades seeing two young boys behind Alex. Mortified, Alex stares as Ryan backs away and she shuts the door. Ryan leaves. In a hotel room, he stares out the window, sipping whiskey. His solitary figure is framed by tall windows in a nondescript hotel block. At the airport, he drags his case, swipes his card at check-in, and takes the shuttle to his gate. He sits morosely when Alex calls from her car. Tearful, Ryan's eyes well up. He opens his mouth to speak but closes his eyes and hangs up, deeply hurt. On his flight, Ryan stares into space as a stewardess hands him champagne."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Ryan, distracted at his computer, puts on a headset for a meeting with Craig and others, checking the Gold Quest Conference schedule. At home, he takes whiskey miniatures from the fridge, gazing out the window. In Las Vegas, he waits at a conference hall, places his backpack on a table, and steps to a lectern. Computer-generated backpacks spin on screens as he surveys the delegates. Lost in thought, he shakes his head, smiles, taps the lectern, and exits past a backstage worker. Ryan rushes through the airport, boarding pass in hand, reaches the gate, and boards. On a jet, he watches Chicago's lights. In snow, he rents a Hertz car, drives on slushy roads, checks a paper, and stops at a townhouse. He rings the doorbell, steps back, and Alex opens the door. His smile fades seeing two boys behind her. Alex, shocked, closes the door, and Ryan leaves. In a hotel room, he sips whiskey, staring out. At the airport, he checks in, takes a shuttle, and sits morosely. Alex calls from her car, and Ryan, tearful, hangs up, hurt. On his flight, he stares into space, accepting champagne from a stewardess."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Ryan, appearing somewhat distracted, sits in front of a glowing computer screen, and after a moment, he places a headset over his ears. During a meeting with Craig and several other employees, Ryan attentively examines the detailed schedule for the upcoming Gold Quest Conference on his laptop. Later, at home, he retrieves a couple of whiskey miniatures from his refrigerator and stands pensively, gazing out of a window with a drink in his hand. Outside a Las Vegas hotel, a large video screen prominently displays a caption. Ryan waits in the wings of a bustling, packed conference hall, and dressed smartly in a suit, he places his backpack on a nearby table before stepping up to a lectern. Behind him, computer-generated images of backpacks revolve on the screens, and Ryan surveys the room filled with seated delegates. Lost in his thoughts, he lowers his head, then shakes it slightly before looking up and smiling to himself. He taps his thumb rhythmically on the lectern, walks past a backstage crew member, and exits the building. Ryan rushes through the airport, dragging his suitcase with one hand, while a boarding pass flutters in the other. He reaches a Departure gate, has his pass checked, and proceeds through. On a jet, Ryan gazes out of the window at the twinkling nighttime lights of Chicago. Amidst a flurry of snow, Ryan picks up a Hertz rental car, signs the necessary paperwork, gets in, and drives away. He navigates along slush-covered roads, glancing at a piece of paper in his hand while scanning the streets. He pulls up, leaves the car lights on, and steps out. Jogging along a pavement, he approaches a large suburban townhouse and rings the doorbell. Ryan steps back, places his hands in the pockets of his long black coat, and tries to appear casual as Alex opens the door. His cheeky smile quickly fades when he notices two young boys running up the stairs behind Alex. Mortified, Alex stares at Ryan, who slowly backs away as she closes the door. Ryan turns and leaves. In a hotel room, he sits, staring out of the window into the night, sipping a large whiskey. Ryan's solitary figure is framed by one of the row of tall windows in a nondescript hotel block. Ryan arrives at the airport, dragging his suitcase through the bustling terminal building, swipes his card at the self-service check-in, and takes the shuttle train to his gate. He perches on the edge of a seat, looking morose, when Alex calls him from her car. Ryan appears tearful, and tears begin to well up in his eyes. Ryan opens his mouth as if he's about to speak, but instead, he shuts his eyes and hangs up, looking deeply hurt. On his flight, Ryan sits staring into space, and a stewardess approaches, handing him a glass of champagne."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Ryan, who appears somewhat distracted and absorbed in his own thoughts, is sitting in front of the glow of a computer screen. After a brief moment of contemplation, he places a headset over his ears, preparing himself for what lies ahead. During an engaging meeting with Craig and several other employees, Ryan is completely focused as he attentively examines the detailed and meticulously planned schedule for the eagerly anticipated upcoming Gold Quest Conference on his sleek laptop. Later, when he is back at his home, he retrieves two small miniatures of whiskey from his refrigerator and stands, lost in thought, as he gazes out of the window, holding a drink in his hand.\n\nOutside a grand Las Vegas hotel, a large video screen prominently displays a captivating caption. Meanwhile, Ryan is waiting patiently in the wings of a bustling, packed conference hall. Dressed smartly in a well-tailored suit, he carefully places his backpack on a nearby table before stepping confidently up to the lectern. Behind him, eye-catching computer-generated images of backpacks revolve on the screens, creating an engaging backdrop as Ryan surveys the room filled with delegates seated attentively. Lost in his own thoughts, he lowers his head and then shakes it slightly, a smile slowly spreading across his face as he looks up again. Tapping his thumb rhythmically on the lectern, he walks past a backstage crew member and exits the building.\n\nRyan is seen rushing through the airport, dragging his suitcase with determination in one hand, while a boarding pass flutters in the breeze in the other. He arrives at the Departure gate, where his pass is checked, and he proceeds through. On a jet, Ryan gazes reflectively out of the window at the twinkling nighttime lights of the city of Chicago. Amidst a flurry of gently falling snowflakes, Ryan picks up a rental car from Hertz, signs the necessary paperwork, gets into the car, and drives away. He navigates along slush-covered roads, glancing occasionally at a piece of paper in his hand while scanning the streets. Pulling up to his destination, he leaves the car lights on and steps out. Jogging briskly along the pavement, he approaches a large suburban townhouse and rings the doorbell.\n\nRyan steps back, placing his hands casually in the pockets of his long, black coat, trying to appear at ease as Alex opens the door. His cheeky smile quickly fades when his eyes catch sight of two young boys running energetically up the stairs behind Alex. Mortified, Alex stares at Ryan, who slowly backs away, and as she closes the door, Ryan turns and leaves. Sitting in a nondescript hotel room, he stares out of the window into the expansive night, sipping a large glass of whiskey. His solitary figure is framed by one of the tall windows in a row within the hotel block.\n\nRyan arrives at the airport once more, dragging his suitcase through the bustling terminal building filled with travelers. He swipes his card at the self-service check-in and then takes the shuttle train to reach his gate. Perching on the edge of a seat, looking morose, he receives a call from Alex, who is speaking to him from her car. Ryan appears deeply affected, and tears begin to well up in his eyes. He opens his mouth as if he's about to speak but instead shuts his eyes and hangs up, looking deeply hurt. On his flight, Ryan sits in silence, staring into space, until a stewardess approaches, handing him a glass of champagne."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Ryan sits in front of a computer screen, his attention drifting as he becomes distracted by his surroundings. In an attempt to focus, he reaches for a headset and places it over his ears, adjusting it to fit comfortably. During a meeting with Craig and other employees, Ryan shifts his gaze to his laptop, where he meticulously examines the schedule for the Gold Quest Conference, absorbing the details displayed on the screen. Later, at home, he opens the fridge and selects a couple of whiskey miniatures, feeling the coolness of the bottles in his hand. He stands by the window, gazing out while holding a drink, lost in thought. In Las Vegas, a large video screen outside a hotel captures attention with its bright caption. Ryan waits in the wings of a packed conference hall, dressed smartly in a suit. He places his backpack on a table with care and confidently steps up to the lectern. Behind him, computer-generated backpacks revolve on the screens, creating a dynamic backdrop as he surveys the room filled with seated delegates. Momentarily lost in his thoughts, he lowers his head, then shakes it slightly to regain focus before lifting his gaze and smiling to himself. He taps his thumb rhythmically on the lectern, signaling the end of his presentation, and walks off, passing a backstage crew member as he exits the building. At the airport, Ryan runs with urgency, dragging his case with one hand while a boarding pass flutters in the other. He reaches the Departure gate, presents his pass for checking, and proceeds through. On the jet, Ryan sits by the window, his eyes fixed on the nighttime lights of Chicago below. Amidst a flurry of snow, he picks up a Hertz rental car, signs the necessary paperwork, and gets in, driving away into the night. Navigating slush-covered roads, he glances at a piece of paper in his hand, scanning the streets for his destination. He pulls up to a stop, leaves the car lights on, and steps out, jogging along the pavement. Approaching a large suburban townhouse, he rings the doorbell and steps back, slipping his hands into the pockets of his long black coat, attempting to appear casual. As Alex opens the door, his cheeky smile fades upon seeing two young boys running up the stairs behind her. Alex, mortified, stares at Ryan, who slowly backs away as she closes the door. Ryan turns and walks away. In a hotel room, he sits by the window, staring into the night while sipping a large whiskey, his solitary figure framed by one of the tall windows in the nondescript hotel block. Returning to the airport, he drags his case through the bustling terminal, swipes his card at the self-service check-in, and boards the shuttle train to his gate. He perches on the edge of a seat, looking morose, when Alex calls him from her car. As he listens, tears well up in his eyes, and he appears tearful. He opens his mouth as if to speak but instead closes his eyes, hangs up, and looks deeply hurt. On his flight, Ryan sits staring into space, lost in thought, when a stewardess approaches and hands him a glass of champagne."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Ryan, distracted, sits in front of his computer, puts on a headset, and joins a meeting with Craig and other employees to review the Gold Quest Conference schedule. Later, at home, he retrieves whiskey miniatures from his fridge and gazes out the window with a drink in hand. In Las Vegas, a large video screen outside a hotel displays a caption as Ryan waits backstage at a packed conference hall. Dressed smartly, he places his backpack on a table and approaches the lectern, where computer-generated backpacks revolve on screens behind him. He surveys the room of seated delegates, momentarily lost in thought, before regaining composure and smiling to himself. After tapping the lectern, he exits past a backstage crew member and leaves the building.\n\nRyan rushes through the airport, dragging his suitcase and holding a boarding pass, which he gets checked at the Departure gate. On the flight, he gazes out at Chicago's nighttime lights. Amidst a snowstorm, he picks up a Hertz rental car, signs the paperwork, and drives through slush-covered roads, glancing at a piece of paper for directions. He parks, leaves the lights on, and jogs to a large suburban townhouse, ringing the doorbell. Trying to appear casual, he steps back with his hands in his coat pockets as Alex opens the door. His smile fades upon seeing two young boys behind her. Alex, mortified, stares at Ryan, who retreats as she closes the door. Ryan turns away and leaves.\n\nIn a hotel room, Ryan sits by the window, sipping a large whiskey, his solitary figure framed by the tall windows of a nondescript hotel block. He arrives at the airport, navigates the busy terminal, checks in at a self-service kiosk, and takes the shuttle train to his gate. Sitting morosely, he receives a call from Alex in her car. Tearful, he closes his eyes and hangs up, visibly hurt. On his flight, Ryan stares into space as a stewardess hands him a glass of champagne."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Ryan is distracted, sitting in front of a computer screen, where lines of code from his recent project flicker, and he puts on a noise-canceling headset, a necessity for focusing in his bustling office. In a meeting with Craig, the project manager known for his meticulous attention to detail, and other employees, Ryan looks at the schedule for the Gold Quest Conference, a leading tech industry event held annually in notable cities, on his laptop. At home, he takes a couple of whiskey miniatures, which he collected from his last international flight, from his fridge and stands looking out of a window that overlooks the quiet suburban street with a drink in his hand. A large video screen outside a Las Vegas hotel, known for hosting various tech extravaganzas, displays a caption about the conference highlights. Ryan waits in the wings of a packed conference hall, renowned for its excellent acoustics, and smartly suited, he puts his backpack, which contains all his presentation essentials, on a table and steps up to a lectern. Computer-generated backpacks, showcasing the company's latest innovative designs, revolve on the screens behind him, and Ryan looks out across the room full of seated delegates, many of whom are investors and industry leaders. Lost in his thoughts, weighed down by both excitement and pressure, he hangs his head, then shakes it slightly before looking up and smiling to himself. He taps his thumb on the lectern, walks off past a backstage guy who nods in acknowledgment, and leaves the building. Ryan runs through the bustling terminals of the airport in Las Vegas, dragging his case with one hand, while a boarding pass, printed for his flight to Chicago O'Hare International Airport, flaps in the other. He reaches a Departure gate, gets the pass checked by a boarding agent wearing the airline's blue uniform, and goes through. On a jet, Ryan gazes out of the window at the nighttime lights of Chicago, a city renowned for its striking skyline and vibrant cultural scene. In a flurry of snow, which blankets the windy city in typical winter fashion, Ryan picks up a Hertz rental car, a popular choice for business travelers, signs, gets in, and drives away. Ryan drives along slush-covered roads, glancing at a piece of paper that contains the address for his next meeting and scanning the streets lined with snow-dusted trees. He pulls up, leaves the lights on, and gets out of the car. Jogging along a pavement, he walks up to a large suburban townhouse, characterized by its classical architecture, and rings the doorbell. Ryan steps back, puts his hands in the pockets of his long black coat, and tries to act casual as Alex opens the door. His cheeky smile quickly fades when he sees two young boys, Alex's nephews who are staying for the weekend, run up the stairs behind Alex. Mortified, Alex stares at Ryan, who slowly backs away as she shuts the door. Ryan turns and goes. In a hotel room, a standard suite with a view of the city's skyline, he sits staring out of the window into the night and sips a large whiskey, seeking solace in its warmth. Ryan's solitary figure is framed by one of the row of tall windows in a nondescript hotel block, a typical choice for business travelers. Ryan arrives at the airport, drags his case through the busy terminal building filled with travelers, swipes his card at the self-service check-in, a convenient feature for frequent flyers, and takes the shuttle train to his gate. He perches on the edge of a seat, looking morose, when Alex calls him from her car, parked in her driveway. Ryan looks tearful, and tears well up in his eyes. Ryan opens his mouth as if he's about to speak, but instead shuts his eyes and hangs up, looking deeply hurt. On his flight, Ryan sits staring into space, lost in his thoughts, and a stewardess, noticing his forlorn expression, hands him a glass of champagne, hoping to offer a small comfort."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Ryan is distracted sitting in front of a computer screen and he puts on a headset. In a meeting with Craig and other employees Ryan looks at the schedule for the Gold Quest Conference on his laptop. At home he takes a couple of whiskey miniatures from his fridge and stands looking out of a window with a drink in his hand. A large video screen outside a Las Vegas hotel displays a caption. Ryan waits in the wings of a packed conference hall and smartly suited he puts his backpack on a table and steps up to a lectern. Computergenerated backpacks revolve on the screens behind him and Ryan looks out across the room full of seated delegates. Lost in his thoughts he hangs his head then shakes it slightly before looking up and smiling to himself. He taps his thumb on the lectern walks off past a backstage guy and leaves the building. Ryan runs through the airport dragging his case with one hand while a boarding pass flaps in the other. He reaches a Departure gate gets the pass checked and goes through. On a jet Ryan gazes out of the window at the nighttime lights of Chicago. In a flurry of snow Ryan picks up a Hertz rental car signs gets in and drives away. Ryan drives along slushcovered roads glancing at a piece of paper in his hand and scanning the streets. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. He pulls up leaves the lights on and gets out of the car. Jogging along a pavement he walks up to a large suburban townhouse and rings the doorbell. Ryan steps back puts his hands in the pockets of his long black coat and tries to act casual as Alex opens the door. His cheeky smile quickly fades when he sees two young boys run up the stairs behind Alex. Mortified Alex stares at Ryan who slowly backs away as she shuts the door. Ryan turns and goes. In a hotel room he sits staring out of the window into the night and sips a large whiskey. Ryan's solitary figure is framed by one of the row of tall windows in a nondescript hotel block. Ryan arrives at the airport drags his case through the busy terminal building swipes his card at the selfservice checkin and takes the shuttle train to his gate. He perches on the edge of a seat looking morose when Alex calls him from her car. Ryan looks tearful and tears well up in his eyes. Ryan opens his mouth as if he is about to speak but instead shuts his eyes and hangs up looking deeply hurt. On his flight Ryan sits staring into space and a stewardess hands him a glass of champagne."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Ryan is distracted sitting in front of a computer screen and he puts on a headset. In a meeting with Craig and other employees Ryan looks at the schedule for the Gold Quest Conference on his laptop. At home he takes a couple of whiskey miniatures from his fridge and stands looking out of a window with a drink in his hand. A large video screen outside a Las Vegas hotel displays a caption. Ryan waits in the wings of a packed conference hall and smartly suited he puts his backpack on a table and steps up to a lectern. Computergenerated backpacks revolve on the screens behind him and Ryan looks out across the room full of seated delegates. Lost in his thoughts he hangs his head then shakes it slightly before looking up and smiling to himself. He taps his thumb on the lectern walks off past a backstage guy and leaves the building. Ryan runs through the airport dragging his case with one hand while a boarding pass flaps in the other. He reaches a Departure gate gets the pass checked and goes through. On a jet Ryan gazes out of the window at the nighttime lights of Chicago. In a flurry of snow Ryan picks up a Hertz rental car signs gets in and drives away. Ryan drives along slushcovered roads glancing at a piece of paper in his hand and scanning the streets. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. He pulls up leaves the lights on and gets out of the car. Jogging along a pavement he walks up to a large suburban townhouse and rings the doorbell. Ryan steps back puts his hands in the pockets of his long black coat and tries to act casual as Alex opens the door. His cheeky smile quickly fades when he sees two young boys run up the stairs behind Alex. Mortified Alex stares at Ryan who slowly backs away as she shuts the door. Ryan turns and goes. In a hotel room he sits staring out of the window into the night and sips a large whiskey. Ryan's solitary figure is framed by one of the row of tall windows in a nondescript hotel block. Ryan arrives at the airport drags his case through the busy terminal building swipes his card at the selfservice checkin and takes the shuttle train to his gate. He perches on the edge of a seat looking morose when Alex calls him from her car. Ryan looks tearful and tears well up in his eyes. Ryan opens his mouth as if he is about to speak but instead shuts his eyes and hangs up looking deeply hurt. On his flight Ryan sits staring into space and a stewardess hands him a glass of champagne."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Ryan is distracted sitting in front of a computer screen and he puts on a headset. In a meeting with Craig and other employees Ryan looks at the schedule for the Gold Quest Conference on his laptop. At home he takes a couple of whiskey miniatures from his fridge and stands looking out of a window with a drink in his hand. A large video screen outside a Las Vegas hotel displays a caption. Ryan waits in the wings of a packed conference hall and smartly suited he puts his backpack on a table and steps up to a lectern. Computergenerated backpacks revolve on the screens behind him and Ryan looks out across the room full of seated delegates. Lost in his thoughts he hangs his head then shakes it slightly before looking up and smiling to himself. Ryan's solitary figure is framed by one of the row of tall windows in a nondescript hotel block. Ryan arrives at the airport drags his case through the busy terminal building swipes his card at the selfservice checkin and takes the shuttle train to his gate. He perches on the edge of a seat looking morose when Alex calls him from her car. Ryan looks tearful and tears well up in his eyes. Ryan opens his mouth as if he is about to speak but instead shuts his eyes and hangs up looking deeply hurt. On his flight Ryan sits staring into space and a stewardess hands him a glass of champagne."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Ryan is distracted sitting in front of a computer screen and he puts on a headset. In a meeting with Craig and other employees Ryan looks at the schedule for the Gold Quest Conference on his laptop. At home he takes a couple of whiskey miniatures from his fridge and stands looking out of a window with a drink in his hand. Ryan looks tearful and tears well up in his eyes. Ryan opens his mouth as if he is about to speak but instead shuts his eyes and hangs up looking deeply hurt. On his flight Ryan sits staring into space and a stewardess hands him a glass of champagne."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Logan is captivated, kneeling in front of a television set, and he dons a hat. In a tea party with Oliver and other dancers, Logan examines the itinerary for the Silver Journey Festival on his tablet. At a cottage, he takes a couple of soda cans from his oven and stands admiring a painting with a snack in his hand. A massive billboard outside a San Francisco café displays a banner. Logan lingers in the shadows of a bustling carnival arena, and casually dressed, he places his suitcase on a chair and hops up to a podium. Animated suitcases spin on the billboards behind him, and Logan scans the area filled with standing visitors. Absorbed in his dreams, he raises his arms, then nods slightly before glancing upward and chuckling to himself. He taps his heel on the podium, hops away past a curtain operator, and enters a park. Logan jogs through the stadium, carrying his backpack with one paw, while a hat flutters in the other. He approaches an Entry station, gets the hat scanned, and walks through. On a tram, Logan peers out of the windshield at the daytime skyline of Boston. In a shower of rain, Logan grabs a Budget rental limo, stamps, hops in, and rides off. Logan cruises along mud-covered lanes, peeking at a brochure in his hand and inspecting the buildings. He halts, leaves the engine running, and steps out of the limo. Skipping along a trail, he trots up to a small urban cottage and knocks on the window. Logan steps aside, stuffs his gloves in the lining of his short green jacket, and tries to act amusing as Jamie unlocks the window. His mischievous grin quickly vanishes when he spots two small girls climb down the ladder behind Jamie. Embarrassed, Jamie glares at Logan, who carefully inches away as she closes the window. Logan spins and departs. In a cabin room, he lies gazing at the ceiling into the dusk and nips a tiny lemonade. Logan's lonely silhouette is framed by one of the cluster of short walls in a distinctive cabin tower. Logan arrives at the stadium, tows his backpack through the silent hangar, swipes his watch at the unattended ticket booth, and boards the trolley bus to his station. He leans on the brink of a bench, appearing gloomy, when Jamie calls him from her bicycle. Logan feels sorrowful, and raindrops form in his eyes. Logan opens his lips as if he's about to sing, but instead closes his eyes and disconnects, looking deeply saddened. On his train ride, Logan reclines, dreaming about nothing, and a porter hands him a mug of cocoa."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Ryan, distracted at his computer, attends a meeting and later reviews the Gold Quest Conference schedule. At the conference, he presents smart backpacks but appears lost in thought before regaining composure and leaving. He rushes through the airport to Chicago, navigating snowy roads to a suburban townhouse. There, he encounters Alex, whose reaction and presence of her children make him retreat. In a hotel, he contemplates alone, sipping whiskey. At the airport, he checks in and looks dejected until Alex calls him. Overwhelmed with emotion, Ryan ends the call, visibly hurt. During his flight, he remains deep in thought as he accepts champagne from a stewardess."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "On his flight Ryan sits staring into space and a stewardess hands him a glass of champagne Ryan opens his mouth as if he's about to speak but instead shuts his eyes and hangs up looking deeply hurt  Ryan looks tearful and tears well up in his eyes  He perches on the edge of a seat looking morose when Alex calls him from her car  Ryan arrives at the airport drags his case through the busy terminal building swipes his card at the selfservice checkin and takes the shuttle train to his gate  Ryan's solitary figure is framed by one of the row of tall windows in a nondescript hotel block  In a hotel room he sits staring out of the window into the night and sips a large whiskey  Ryan turns and goes  Mortified Alex stares at Ryan who slowly backs away as she shuts the door  His cheeky smile quickly fades when he sees two young boys run up the stairs behind Alex  Ryan steps back puts his hands in the pockets of his long black coat and tries to act casual as Alex opens the door  Jogging along a pavement he walks up to a large suburban townhouse and rings the doorbell  He pulls up leaves the lights on and gets out of the car  Ryan drives along slushcovered roads glancing at a piece of paper in his hand and scanning the streets  In a flurry of snow Ryan picks up a Hertz rental car signs gets in and drives away  On a jet Ryan gazes out of the window at the nighttime lights of Chicago  He reaches a Departure gate gets the pass checked and goes through  Ryan runs through the airport dragging his case with one hand while a boarding pass flaps in the other  He taps his thumb on the lectern walks off past a backstage guy and leaves the building  Lost in his thoughts he hangs his head then shakes it slightly before looking up and smiling to himself  Computergenerated backpacks revolve on the screens behind him and Ryan looks out across the room full of seated delegates  Ryan waits in the wings of a packed conference hall and smartly suited he puts his backpack on a table and steps up to a lectern  A large video screen outside a Las Vegas hotel displays a caption  At home he takes a couple of whiskey miniatures from his fridge and stands looking out of a window with a drink in his hand  In a meeting with Craig and other employees Ryan looks at the schedule for the Gold Quest Conference on his laptop  Ryan is distracted sitting in front of a computer screen and he puts on a headset "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "In a meeting with Craig and other employees Ryan looks at the schedule for the Gold Quest Conference on his laptop Ryan is distracted sitting in front of a computer screen and he puts on a headset A large video screen outside a Las Vegas hotel displays a caption At home he takes a couple of whiskey miniatures from his fridge and stands looking out of a window with a drink in his hand Computergenerated backpacks revolve on the screens behind him and Ryan looks out across the room full of seated delegates Ryan waits in the wings of a packed conference hall and smartly suited he puts his backpack on a table and steps up to a lectern He taps his thumb on the lectern walks off past a backstage guy and leaves the building Lost in his thoughts he hangs his head then shakes it slightly before looking up and smiling to himself He reaches a Departure gate gets the pass checked and goes through Ryan runs through the airport dragging his case with one hand while a boarding pass flaps in the other In a flurry of snow Ryan picks up a Hertz rental car signs gets in and drives away On a jet Ryan gazes out of the window at the nighttime lights of Chicago He pulls up leaves the lights on and gets out of the car Ryan drives along slushcovered roads glancing at a piece of paper in his hand and scanning the streets Ryan steps back puts his hands in the pockets of his long black coat and tries to act casual as Alex opens the door Jogging along a pavement he walks up to a large suburban townhouse and rings the doorbell Mortified Alex stares at Ryan who slowly backs away as she shuts the door His cheeky smile quickly fades when he sees two young boys run up the stairs behind Alex In a hotel room he sits staring out of the window into the night and sips a large whiskey Ryan turns and goes Ryan arrives at the airport drags his case through the busy terminal building swipes his card at the selfservice checkin and takes the shuttle train to his gate Ryan's solitary figure is framed by one of the row of tall windows in a nondescript hotel block Ryan looks tearful and tears well up in his eyes He perches on the edge of a seat looking morose when Alex calls him from her car On his flight Ryan sits staring into space and a stewardess hands him a glass of champagne Ryan opens his mouth as if he is about to speak but instead shuts his eyes and hangs up looking deeply hurt"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He pulls up leaves the lights on and gets out of the car  Jogging along a pavement he walks up to a large suburban townhouse and rings the doorbell  Ryan steps back puts his hands in the pockets of his long black coat and tries to act casual as Alex opens the door  His cheeky smile quickly fades when he sees two young boys run up the stairs behind Alex  Mortified Alex stares at Ryan who slowly backs away as she shuts the door  Ryan turns and goes  In a hotel room he sits staring out of the window into the night and sips a large whiskey  Ryan's solitary figure is framed by one of the row of tall windows in a nondescript hotel block  Ryan arrives at the airport drags his case through the busy terminal building swipes his card at the selfservice checkin and takes the shuttle train to his gate  He perches on the edge of a seat looking morose when Alex calls him from her car  Ryan looks tearful and tears well up in his eyes  Ryan opens his mouth as if he's about to speak but instead shuts his eyes and hangs up looking deeply hurt  On his flight Ryan sits staring into space and a stewardess hands him a glass of champagne Ryan is distracted sitting in front of a computer screen and he puts on a headset  In a meeting with Craig and other employees Ryan looks at the schedule for the Gold Quest Conference on his laptop  At home he takes a couple of whiskey miniatures from his fridge and stands looking out of a window with a drink in his hand  A large video screen outside a Las Vegas hotel displays a caption  Ryan waits in the wings of a packed conference hall and smartly suited he puts his backpack on a table and steps up to a lectern  Computergenerated backpacks revolve on the screens behind him and Ryan looks out across the room full of seated delegates  Lost in his thoughts he hangs his head then shakes it slightly before looking up and smiling to himself  He taps his thumb on the lectern walks off past a backstage guy and leaves the building  Ryan runs through the airport dragging his case with one hand while a boarding pass flaps in the other  He reaches a Departure gate gets the pass checked and goes through  On a jet Ryan gazes out of the window at the nighttime lights of Chicago  In a flurry of snow Ryan picks up a Hertz rental car signs gets in and drives away  Ryan drives along slushcovered roads glancing at a piece of paper in his hand and scanning the streets "
        }
      ]
    }
  ]
}