{
  "ground_truth": "A bright white light shines in front of a cloudy sky, held aloft by a statuesque woman wearing a long white robe with a blue sash draped around her. Silver metallic letters on a black background are seen, and framed within a V shape is a city skyline. A motorcade sweeps through the city streets, with motorcycles in the background. Men in suits climb stairs as the motorcade moves past a tall stone bell tower towards the flashing lights of a parked police car, with a GNN TV camera fixed on the vehicles. The convoy comes to a halt, cameras flash, and the President, a tall man with a receding hairline, emerges. He and his guards move away from the car, with one of the Secret Service agents, Barnes, a man in his 50s with a furrowed brow, glancing all around, scanning rooftops and the protesters as he walks ahead of the President. On a preview monitor, the GNN gallery crew watch footage of an assassination attempt on President Ashton, during which Barnes takes the bullets for the President, and the President is hustled to safety and recoils. A bomb goes off in the plaza, smoke erupts from the explosion and blanks out the TV cameras, covering the plaza in its dense blanket. The gallery is stunned, and as the smoke clears, the director catches sight of Angie lying on the ground with blood on her forehead and chest among the rubble. The picture constantly breaks up, and the director and her assistant fight back tears. Director Rex Brooks, in her 40s, gets to her feet and switches off the feed. Haggard and weary, she sits back down by her younger, weeping PA. The events rewind to pre-explosion, with Angie reporting and the President at the lectern, and the motorcade en route to the plaza. Agent Barnes, his torso bare, turns from his window, nods to his colleague Ken Taylor, then turns back to gaze out as he puts on a shirt, revealing a scar on his back. Barnes strolls across the room, sits down on his bed with a tie in his hand, fastens his shirt, and reaches for a pill bottle. Popping the lid, he tips the bottle, puts his hand to his grimacing face, seeing footage of the previous year's assassination attempt where he falls to the ground. In the hotel room, Barnes places the pill back in the bottle on the bedside cabinet, lifts his gun from the cabinet, and checks its magazine. In a hotel corridor, Barnes puts on his jacket while walking in front of a large window against which he is silhouetted.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A luminous alabaster glow gleams before a overcast heaven, held upward by a statuesque lady garbed in a lengthy alabaster gown with a azure band draped around her. Argent metallic characters on a sable backdrop are visible, and enclosed within a V outline is a metropolis skyline. A cavalcade glides through the metropolis avenues, with motorcycles in the rear. Gentlemen in blazers ascend steps as the cavalcade advances past a lofty stone chime spire towards the flickering gleams of a stationary law enforcement auto, with a GNN TV camera secured on the automobiles. The procession reaches a standstill, cameras illuminate, and the Leader, a lofty gentleman with a diminishing hairline, emerges. He and his escorts proceed away from the auto, with one of the Secret Service operatives, Barnes, a gentleman in his 50s with a wrinkled forehead, glancing all around, scanning rooftops and the demonstrators as he strides ahead of the Leader. On a preview monitor, the GNN gallery team observe footage of a murder attempt on Leader Ashton, during which Barnes intercepts the projectiles for the Leader, and the Leader is rushed to safety and recoils. An explosive detonates in the square, vapor erupts from the detonation and obscures the TV cameras, enveloping the square in its dense veil. The gallery is astonished, and as the vapor disperses, the director catches sight of Angie lying on the terrain with blood on her brow and torso amid the debris. The picture constantly disintegrates, and the director and her assistant restrain tears. Director Rex Brooks, in her 40s, rises to her feet and deactivates the feed. Worn and fatigued, she reclines back beside her younger, sobbing PA. The occurrences rewind to pre-detonation, with Angie reporting and the Leader at the platform, and the cavalcade en route to the square. Operative Barnes, his upper body bare, turns from his aperture, nods to his associate Ken Taylor, then turns back to gaze out as he dons a shirt, revealing a cicatrix on his back. Barnes strolls across the room, sits down on his bed with a tie in his hand, fastens his shirt, and reaches for a medication vial. Popping the cover, he tips the vial, puts his hand to his grimacing visage, seeing footage of the previous year's murder attempt where he falls to the terrain. In the inn chamber, Barnes places the medication back in the vial on the bedside cupboard, lifts his firearm from the cupboard, and examines its magazine. In a inn passageway, Barnes dons his coat while strolling in front of a substantial aperture against which he is silhouetted."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "In front of a cloudy sky, a bright white light is shone by a statuesque woman wearing a long white robe with a blue sash draped around her. Silver metallic letters are seen on a black background, and a city skyline is framed within a V shape. The city streets are swept through by a motorcade, with motorcycles seen in the background. As the motorcade moves past a tall stone bell tower towards the flashing lights of a parked police car, men in suits are climbing stairs, and a GNN TV camera is fixed on the vehicles. A halt is made by the convoy, cameras flash, and President, a tall man with a receding hairline, emerges. Away from the car, he and his guards move, with one of the Secret Service agents, Barnes, a man in his 50s with a furrowed brow, scanning rooftops and the protesters as he glances all around and walks ahead of the President. On a preview monitor, footage of an assassination attempt on President Ashton is watched by the GNN gallery crew, during which Barnes takes the bullets for the President, and safety is provided to the President who recoils. A bomb sets off in the plaza, and from the explosion, smoke erupts and blanks out the TV cameras, with the plaza being covered in its dense blanket. The gallery is stunned, and as the smoke clears, Angie is caught sight of by the director, lying on the ground with blood on her forehead and chest among the rubble. The picture constantly breaks up, and tears are fought back by the director and her assistant. Her feet are gotten to by Director Rex Brooks, in her 40s, and she switches off the feed. Haggard and weary, back down she sits by her younger, weeping PA. The events rewind to pre-explosion, with Angie reporting and the President at the lectern, and the plaza is en route to by the motorcade. From his window, Agent Barnes, his torso bare, turns, nods to his colleague Ken Taylor, then turns back to gaze out and puts on a shirt, revealing a scar on his back. Across the room, Barnes strolls, sits down on his bed with a tie in his hand, fastens his shirt, and a pill bottle is reached for. The lid is popped, the bottle is tipped, his hand is put to his grimacing face, and footage of the previous year's assassination attempt where he falls to the ground is seen. In the hotel room, the pill is placed by Barnes back in the bottle on the bedside cabinet, his gun is lifted from the cabinet, and its magazine is checked. In a hotel corridor, his jacket is put on by Barnes while he walks in front of a large window against which he is silhouetted."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A bright light shines in front of a cloudy sky, held by a statuesque woman in a white robe and blue sash. Silver letters on a black background show a city skyline in a V shape. A motorcade moves through city streets, past a bell tower and a police car, with a GNN TV camera focused on it. The convoy stops, cameras flash, and the President, a tall man with a receding hairline, emerges with guards. Secret Service agent Barnes, in his 50s, cautiously scans rooftops and protesters. On a monitor, the GNN gallery crew watches footage of an attempted assassination where Barnes takes bullets for President Ashton, who recoils to safety. A plaza bomb explodes, enveloping the area in smoke. The gallery is shocked; amid rubble, Angie is seen bleeding. The image breaks up as Director Rex Brooks, in her 40s, turns off the feed and sits by her weeping assistant. Events rewind to before the explosion, with Angie reporting and the President at the lectern. Agent Barnes nods to colleague Ken Taylor while dressing, revealing a scar on his back. He sits on his bed, takes a pill bottle, and recalls a previous assassination attempt. In a hotel, Barnes checks his gun and walks in a corridor, silhouetted against a window."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A bright light shines before a cloudy sky, held by a statuesque woman in a white robe with a blue sash. Silver letters on a black background frame a city skyline. A motorcade, with motorcycles behind, moves past a stone bell tower towards police flashing lights, spotlighted by a GNN camera. The President, a tall, balding man, exits as his guards and Secret Service agent Barnes, a furrowed-brow man in his 50s, scan rooftops and protesters. GNN staff view a preview of an assassination attempt on President Ashton, where Barnes takes the bullets, and a bomb explodes, covering the plaza in smoke. The gallery is shocked, and Angie is seen in rubble with injuries. The director, Rex Brooks, sees the chaos, turns off the feed, and comforts her PA. Events rewind to pre-explosion: Angie reports, the President at the lectern, and the motorcade en route. Barnes, bare-torsoed, nods at Ken Taylor, dons a shirt revealing a back scar, sits on his bed, takes a pill, and checks his gun's magazine. In a hotel corridor, Barnes is silhouetted against a large window, wearing his jacket."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A radiant and intensely luminous white light beams brightly in front of a sky filled with clouds. This light is held aloft by a statuesque, graceful woman who is elegantly attired in a long, flowing white robe, which has a beautiful blue sash draped around her form. In the background, large silver metallic letters are prominently displayed on a stark black backdrop, and a city skyline is framed artfully within a V shape. Moving swiftly through the bustling city streets is a prominent motorcade, accompanied by motorcycles that can be seen in the background. Several men dressed in suits ascend the stairs diligently as the motorcade makes its way past a towering stone bell tower, heading towards the bright, flashing lights of a parked police car. A GNN TV camera is dutifully trained on the vehicles as the convoy comes to a stop. Cameras flash chaotically, capturing the moment when the President, a tall man with a receding hairline, emerges with composure. He, along with his security detail, move away from the vehicle, with one of the Secret Service agents, identified as Barnes—a man in his 50s with a deeply furrowed brow—keenly on the lookout. He scans vigilantly, observing rooftops and the crowd of protesters while still walking ahead of the President. On a preview monitor, the GNN gallery crew are intently watching footage replaying the harrowing scene of an assassination attempt on President Ashton, wherein Barnes bravely takes the bullets meant for the President, who is then swiftly hustled away to safety, recoiling in shock. Subsequently, a bomb detonates in the plaza, causing smoke to billow out from the explosion and obscuring the television cameras with its dense, thick blanket. The gallery is left in a state of shock and as the smoke starts to dissipate, the director catches sight of Angie, who is lying on the ground among the debris, bloodied on her forehead and chest. The picture continues to break up intermittently, and both the director and her assistant struggle to hold back tears. Director Rex Brooks, who is in her 40s and appears haggard and weary, rises to her feet and switches off the feed with decisiveness. She then sits back down beside her younger, visibly weeping PA. The sequence of events rewinds to before the explosion, showing Angie reporting live and the President standing confidently at the lectern, with the motorcade making its way to the plaza. Agent Barnes, with his torso bared, turns away momentarily from his window, nodding to his colleague Ken Taylor before turning back to look out as he dresses, revealing a scar etched into his back. Barnes then meanders across the room and sits on his bed with a tie in his hand, fastening his shirt before reaching for a pill bottle. He opens the lid, tips the bottle, and raises his hand to his face, grimacing while viewing footage of the previous year's assassination attempt where he had fallen to the ground. In the hotel room, Barnes carefully returns the pill to the bottle on the bedside cabinet, picks up his gun from the cabinet, and checks its magazine with attention. In a hotel corridor, Barnes, now wearing his jacket, walks in front of a large window against which his silhouette is starkly outlined."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A radiant and intensely luminous white light beams brightly, shining with an almost ethereal glow, in front of a sky filled with large, fluffy clouds. This brilliant light is majestically held aloft by a statuesque and graceful woman, who is elegantly attired in a long, flowing white robe. The robe is complemented by a beautiful blue sash that drapes around her form in a fashion that is nothing short of exquisite. In the background of this scene, large silver metallic letters are prominently displayed against a stark, contrasting black backdrop. Additionally, a city skyline is artistically framed within a V shape, adding to the overall dramatic effect. Moving swiftly through the bustling city streets is a prominent, high-profile motorcade, accompanied by a formation of motorcycles easily visible in the background. Several diligent men, all dressed in sharp suits, can be seen ascending the stairs with purpose as the motorcade makes its way past a towering stone bell tower. The convoy continues toward the bright, flashing lights, which emanate from a parked police car, creating a sense of urgency and anticipation. A GNN TV camera is dutifully trained on the vehicles as they come to a definitive stop. Cameras flash chaotically, capturing the critical moment when the President, a tall man distinguished by his receding hairline, emerges with notable composure. He, along with his ever-watchful security detail, moves away from the vehicle with precision. One of the Secret Service agents, identified as Barnes—a man in his 50s characterized by his deeply furrowed brow—appears keenly on the lookout. He scans the surroundings vigilantly, observing the rooftops and the crowd of vocal protesters while skillfully staying ahead of the President. On a preview monitor, the GNN gallery crew are intently consumed by watching footage replaying the harrowing scene of an attempted assassination on President Ashton. In this distressing footage, Barnes is seen bravely taking the bullets meant for the President, who is then swiftly hustled away to safety, visibly recoiling in shock from the sudden turn of events. Subsequently, a bomb detonates in the plaza, causing dense, dark smoke to billow dramatically from the explosion, obscuring the television cameras with its thick, impenetrable blanket. The gallery is left in a state of shock, and as the smoke starts to finally dissipate, the director catches sight of Angie. She is lying on the ground amid the debris, visibly bloodied on her forehead and chest. The picture on the monitors continues to break up intermittently, and both the director and her assistant struggle to hold back their tears as they witness the chaos unfold. Director Rex Brooks, who is in her 40s and appears visibly haggard and weary from the emotional toll, rises to her feet with determination and switches off the feed decisively. She then sits back down beside her younger, visibly weeping PA. The sequence of tragic events rewinds to a time before the explosion, showing Angie reporting live from the scene, and the President standing confidently at the lectern as the motorcade makes its way to the plaza with precision. Meanwhile, Agent Barnes, with his torso bared, momentarily turns away from his window to nod to his colleague, Ken Taylor, before turning back to take in the view outside as he dresses, revealing a scar etched into his back. Barnes then meanders slowly across the room, eventually sitting on his bed with a tie in his hand as he fastens his shirt before reaching for a pill bottle nearby. He opens the lid, tips the bottle carefully, and raises his hand to his face, grimacing as he views footage of the previous year's assassination attempt, where he had fallen to the ground with impact. In the quiet solitude of the hotel room, Barnes carefully returns the pill to the bottle on the bedside cabinet, then picks up his gun from the cabinet and checks its magazine with focused attention. In a hotel corridor, Barnes, now fully dressed in his jacket, walks purposefully in front of a large window, against which his silhouette is starkly outlined, creating a striking image."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A bright white light beams down, radiating in front of a backdrop of a cloudy sky, held high by a statuesque woman adorned in a flowing long white robe complemented by a blue sash gracefully draped around her. In parallel, silver metallic letters set against a stark black background come into view, capturing attention, as these letters are elegantly framed within the distinctive shape of a V, through which a sprawling city skyline emerges, sharpening into focus. Concurrently, a motorcade makes its swift passage through the bustling city streets, a determined formation with motorcycles trailing in the background, exuding an aura of urgency and purpose. As this orchestrated movement unfolds, men clad in suits make their ascent up the steps, their figures a blur of motion, even as the motorcade progresses past a towering stone bell tower, directing its course towards the vibrant flashes emanating from a stationary police car, which stands under the vigilant gaze of a GNN TV camera capturing the unfolding scene. When the convoy ultimately draws to a systematic halt, a flurry of camera flashes ignites the surroundings, and from the interior of one of the vehicles emerges the President, a notably tall figure marked by a receding hairline, stepping forward with an air of gravitas. Accompanying him are his guards, who move efficiently away from the car, maintaining a protective formation. Among them is Secret Service agent Barnes, a man in his 50s distinguished by a furrowed brow, who adopts a posture of heightened alertness, his eyes darting in a perpetual scan of rooftops and protesting crowds, as he dutifully strides ahead of the President. In another setting, within a preview monitor, the GNN gallery crew intensely observes footage showcasing a critical moment—an assassination attempt on President Ashton, during which Barnes heroically takes the bullets meant for the President, resulting in the President being hurriedly ushered away to safety, visibly recoiling from the trauma. Suddenly, the serenity of the scene is shattered as a bomb detonates within the plaza, unleashing a torrent of smoke that erupts from the explosion, effectively obfuscating the TV cameras with its pervasive, dense shroud, engulfing the plaza in chaos. The gallery falls into stunned silence, reeling from the shock, and as the smoke slowly dissipates, the director's eyes fixate on the sight of Angie lying motionless on the ground amidst the debris, marred by blood on her forehead and chest. The broadcast becomes increasingly fragmented, and despite their efforts to maintain composure, the director and her assistant find themselves struggling to hold back tears. Director Rex Brooks, a woman in her 40s, regains her composure enough to rise to her feet, reaching decisively to turn off the feed. Overcome by a haggard sense of weariness, she sinks back into her seat beside her youthful, weeping PA. As if rewinding time, events revert to a point before the explosion, showcasing Angie actively reporting and the President confidently positioned at the lectern, alongside the motorcade's ongoing journey towards the plaza. Within the confines of a private room, Agent Barnes finds himself shirtless, momentarily pausing to nod at his colleague Ken Taylor before returning his attention to the window, contemplating the world beyond as he dons a shirt, which inadvertently exposes a scar etched on his back, a testament to past encounters. After a thoughtful pause, Barnes makes his way across the room, settling onto his bed with a tie in hand, carefully fastening his shirt and reaching purposefully for a bottle of pills. Opening the bottle with a practiced flick, he tips it slightly, hesitating as he brings his hand to his grimacing face, confronted by footage replaying last year's assassination attempt, a vivid memory of himself collapsing to the ground. In a moment of reflection, Barnes places the pill back into the bottle, leaving it on the bedside cabinet before lifting his gun from its resting place, diligently checking its magazine with methodical precision. As he transitions into the hotel corridor, Barnes slips on his jacket, continuing to walk with a purposeful stride in front of a large window, against which his silhouette is starkly outlined, projecting a figure of steadfast resolve amidst the unfolding narrative."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A bright white light illuminates a cloudy sky with a statuesque woman donned in a long white robe and blue sash. Silver metallic letters on a black background appear alongside a city skyline nestled in a V shape. As a motorcade sweeps through the city, men in suits ascend stairs while passing a tall stone bell tower, police car lights flashing nearby, and a GNN TV camera focuses on the vehicles. The convoy halts, cameras flash, and the President, a tall man with a receding hairline, steps out. He and his guards advance, with Secret Service agent Barnes, a man in his 50s, scanning rooftops and protesters as he precedes the President. In the GNN gallery, crew members review footage of a previous assassination attempt on President Ashton, where Barnes shields him and the President recoils in safety. A bomb detonates in the plaza, engulfing the area in smoke and obstructing TV cameras. Amidst the chaos and broken footage, the stunned gallery staff spot Angie on the ground with injuries. Director Rex Brooks, in her 40s, turns off the feed and, haggard and weary, sits beside her younger, weeping PA. Events rewind to pre-explosion, revealing Angie reporting and the President at the lectern with the motorcade en route. In his hotel room, Barnes, shirtless and revealing a back scar, nods to his colleague Ken Taylor before dressing and taking a moment with a pill bottle while recalling last year’s assassination attempt. He places the pill back, checks his gun’s magazine, and dons his jacket while walking past a large window, silhouetted against the light."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A bright white light shines in front of a cloudy sky, held aloft by a statuesque woman resembling the Statue of Liberty, a symbol of freedom, wearing a long white robe with a blue sash draped around her. Silver metallic letters on a black background are seen, and framed within a V shape is a city skyline, possibly that of Washington D.C., known for its iconic monuments and political significance. A motorcade, typical of high-security events involving heads of state, sweeps through the city streets, with motorcycles in the background providing an escort. Men in suits, likely government officials or aides, climb stairs as the motorcade moves past a tall stone bell tower reminiscent of historical landmarks found in European cities, towards the flashing lights of a parked police car, with a GNN TV camera, from a global news network with a reputation for breaking news, fixed on the vehicles. The convoy comes to a halt, cameras flash, and the President, a tall man with a receding hairline reflecting years of public service, emerges. He and his guards move away from the car, with one of the Secret Service agents, Barnes, a man in his 50s with a furrowed brow, glancing all around, scanning rooftops for threats and the protesters expressing their dissent as he walks ahead of the President. On a preview monitor, the GNN gallery crew watch footage of an assassination attempt on President Ashton, during which Barnes, displaying remarkable bravery, takes the bullets for the President, and the President is hustled to safety and recoils. A bomb goes off in the plaza, smoke erupts from the explosion and blanks out the TV cameras, covering the plaza in its dense blanket. The gallery is stunned, and as the smoke clears, the director catches sight of Angie, a seasoned reporter, lying on the ground with blood on her forehead and chest among the rubble. The picture constantly breaks up, and the director and her assistant fight back tears. Director Rex Brooks, in her 40s and known for her commanding presence in high-pressure situations, gets to her feet and switches off the feed. Haggard and weary, she sits back down by her younger, weeping PA who looks up to her for guidance. The events rewind to pre-explosion, with Angie reporting live from the scene and the President at the lectern delivering a keynote address, and the motorcade en route to the plaza. Agent Barnes, his torso bare, turns from his window, which overlooks the bustling cityscape, nods to his colleague Ken Taylor, part of his trusted team, then turns back to gaze out as he puts on a shirt, revealing a scar on his back from a past heroic act. Barnes strolls across the room, sits down on his bed with a tie in his hand, fastens his shirt, and reaches for a pill bottle, likely containing medication for pain or stress. Popping the lid, he tips the bottle, puts his hand to his grimacing face, seeing footage of the previous year's assassination attempt where he falls to the ground, an act of ultimate dedication. In the hotel room, Barnes places the pill back in the bottle on the bedside cabinet, lifts his gun from the cabinet, and checks its magazine, ensuring its readiness. In a hotel corridor, Barnes puts on his jacket while walking in front of a large window against which he is silhouetted, contemplating the day's imminent challenges."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "A bright white light shines in front of a cloudy sky held aloft by a statuesque woman wearing a long white robe with a blue sash draped around her. Silver metallic letters on a black background are seen and framed within a V shape is a city skyline. A motorcade sweeps through the city streets with motorcycles in the background. Men in suits climb stairs as the motorcade moves past a tall stone bell tower towards the flashing lights of a parked police car with a GNN TV camera fixed on the vehicles. The convoy comes to a halt. cameras flash and the President a tall man with a receding hairline emerges. He and his guards move away from the car with one of the Secret Service agents. Barnes a man in his 50s with a furrowed brow glancing all around scanning rooftops and the protesters as he walks ahead of the President. On a preview monitor the GNN gallery crew watch footage of an assassination attempt on President Ashton during which Barnes takes the bullets for the President and the President is hustled to safety and recoils. A bomb goes off in the plaza. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. smoke erupts from the explosion and blanks out the TV cameras covering the plaza in its dense blanket. The gallery is stunned and as the smoke clears the director catches sight of Angie lying on the ground with blood on her forehead and chest among the rubble. The picture constantly breaks up and the director and her assistant fight back tears. Director Rex Brooks in her 40s gets to her feet and switches off the feed. Haggard and weary she sits back down by her younger weeping PA. The events rewind to preexplosion with Angie reporting and the President at the lectern and the motorcade en route to the plaza. Agent Barnes his torso bare turns from his window nods to his colleague Ken Taylor then turns back to gaze out as he puts on a shirt revealing a scar on his back. Barnes strolls across the room sits down on his bed with a tie in his hand fastens his shirt and reaches for a pill bottle. Popping the lid he tips the bottle puts his hand to his grimacing face seeing footage of the previous year's assassination attempt where he falls to the ground. In the hotel room Barnes places the pill back in the bottle on the bedside cabinet lifts his gun from the cabinet and checks its magazine. In a hotel corridor Barnes puts on his jacket while walking in front of a large window against which he is silhouetted."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "A bright white light shines in front of a cloudy sky held aloft by a statuesque woman wearing a long white robe with a blue sash draped around her. Silver metallic letters on a black background are seen and framed within a V shape is a city skyline. A motorcade sweeps through the city streets with motorcycles in the background. Men in suits climb stairs as the motorcade moves past a tall stone bell tower towards the flashing lights of a parked police car with a GNN TV camera fixed on the vehicles. The convoy comes to a halt. cameras flash and the President a tall man with a receding hairline emerges. He and his guards move away from the car with one of the Secret Service agents. Barnes a man in his 50s with a furrowed brow glancing all around scanning rooftops and the protesters as he walks ahead of the President. On a preview monitor the GNN gallery crew watch footage of an assassination attempt on President Ashton during which Barnes takes the bullets for the President and the President is hustled to safety and recoils. A bomb goes off in the plaza. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. smoke erupts from the explosion and blanks out the TV cameras covering the plaza in its dense blanket. The gallery is stunned and as the smoke clears the director catches sight of Angie lying on the ground with blood on her forehead and chest among the rubble. The picture constantly breaks up and the director and her assistant fight back tears. Director Rex Brooks in her 40s gets to her feet and switches off the feed. Haggard and weary she sits back down by her younger weeping PA. The events rewind to preexplosion with Angie reporting and the President at the lectern and the motorcade en route to the plaza. Agent Barnes his torso bare turns from his window nods to his colleague Ken Taylor then turns back to gaze out as he puts on a shirt revealing a scar on his back. Barnes strolls across the room sits down on his bed with a tie in his hand fastens his shirt and reaches for a pill bottle. Popping the lid he tips the bottle puts his hand to his grimacing face seeing footage of the previous year's assassination attempt where he falls to the ground. In the hotel room Barnes places the pill back in the bottle on the bedside cabinet lifts his gun from the cabinet and checks its magazine. In a hotel corridor Barnes puts on his jacket while walking in front of a large window against which he is silhouetted."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "A bright white light shines in front of a cloudy sky held aloft by a statuesque woman wearing a long white robe with a blue sash draped around her. Silver metallic letters on a black background are seen and framed within a V shape is a city skyline. A motorcade sweeps through the city streets with motorcycles in the background. Men in suits climb stairs as the motorcade moves past a tall stone bell tower towards the flashing lights of a parked police car with a GNN TV camera fixed on the vehicles. The convoy comes to a halt. The events rewind to preexplosion with Angie reporting and the President at the lectern and the motorcade en route to the plaza. Agent Barnes his torso bare turns from his window nods to his colleague Ken Taylor then turns back to gaze out as he puts on a shirt revealing a scar on his back. Barnes strolls across the room sits down on his bed with a tie in his hand fastens his shirt and reaches for a pill bottle. Popping the lid he tips the bottle puts his hand to his grimacing face seeing footage of the previous year's assassination attempt where he falls to the ground. In the hotel room Barnes places the pill back in the bottle on the bedside cabinet lifts his gun from the cabinet and checks its magazine. In a hotel corridor Barnes puts on his jacket while walking in front of a large window against which he is silhouetted."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "A bright white light shines in front of a cloudy sky held aloft by a statuesque woman wearing a long white robe with a blue sash draped around her. Silver metallic letters on a black background are seen and framed within a V shape is a city skyline. Popping the lid he tips the bottle puts his hand to his grimacing face seeing footage of the previous year's assassination attempt where he falls to the ground. In the hotel room Barnes places the pill back in the bottle on the bedside cabinet lifts his gun from the cabinet and checks its magazine. In a hotel corridor Barnes puts on his jacket while walking in front of a large window against which he is silhouetted."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "A radiant crimson flame flickers beneath a radiant mountain, grasped by a diminutive dog sporting a short crimson vest with a green ribbon wrapped around it. Bronze wooden signs on a white wall are visible, and enclosed within a circle is a forest canopy. A parade floats through the forest paths, with balloons in the distance. Children in pajamas slide ropes as the parade floats past a giant wooden clock tower towards the twinkling stars of a parked fire engine, with an XYZ radio microphone aimed at the attractions. The procession comes to a pause, fireworks burst, and the Magician, a short woman with cascading curls, appears. She and her assistants shuffle away from the float, with one of the circus performers, Harris, a woman in her 30s with a serene gaze, observing all over, eyeing treetops and the spectators as she prances ahead of the Magician. On a crystal ball, the XYZ production team review footage of a juggling routine by Magician Clarke, during which Harris catches the cabbages for the Magician, and the Magician is guided to applause and bows. A wand ignites in the meadow, fog swells from the ignition and obscures the crystal balls, covering the meadow in its thick shroud. The production is astonished, and as the fog disperses, the producer notices Terry reclining on the grass with paint on her ankle and shoulder amidst the fragments. The transmission frequently distorts, and the producer and her technician hold back laughter. Producer Maxine Peters, in her 20s, rises and turns on the projector. Exhausted and jubilant, she leans back by her older, chuckling PA. The scenarios replay to pre-ignition, with Terry narrating and the Magician at the podium, and the parade heading to the meadow. Performer Harris, her legs clothed, swivels from her door, gestures to her partner Jay Parker, then returns to peer out as she adjusts a jacket, displaying a tattoo on her arm. Harris dances across the floor, perches on her chair with a scarf in her grasp, buttons her jacket, and reaches for a book. Unsealing the cover, she flips the book, touches her smiling lips, recalling images of last month's juggling routine where she leaps to the stage. In the cabin, Harris tosses the book back on the nightstand, hoists her hat from the stand, and inspects its lining. In a lodge hallway, Harris dons her sweater while skipping beside a tiny panel against which she is outlined."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A statuesque woman in a white robe stands against a cloudy sky, while silver letters and a city skyline emerge. A motorcade, including motorcycles and suited men, travels past a bell tower towards a police car with a GNN TV camera focused on the scene. The President, a tall man with a receding hairline, exits the car, protected by Secret Service agents, including Agent Barnes, who scans the area warily. GNN's crew watches a previous assassination attempt where Barnes saved the President. Suddenly, a bomb explodes in the plaza, obscuring cameras with smoke. The crew is shaken, and Director Rex Brooks, in her 40s, turns off the feed, upset by Angie, a reporter injured in the blast. Events rewind to prior scenes: Angie reporting, the President at the lectern, and the motorcade en route to the plaza. Agent Barnes, revealing a scar, prepares in his hotel room, recalling the past attack. He contemplates medication but instead checks his gun. Barnes, silhouetted, dons his jacket as he walks down a hotel corridor."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "In a hotel corridor Barnes puts on his jacket while walking in front of a large window against which he is silhouetted In the hotel room Barnes places the pill back in the bottle on the bedside cabinet lifts his gun from the cabinet and checks its magazine Popping the lid he tips the bottle puts his hand to his grimacing face seeing footage of the previous year's assassination attempt where he falls to the ground Barnes strolls across the room sits down on his bed with a tie in his hand fastens his shirt and reaches for a pill bottle Agent Barnes his torso bare turns from his window nods to his colleague Ken Taylor then turns back to gaze out as he puts on a shirt revealing a scar on his back The events rewind to preexplosion with Angie reporting and the President at the lectern and the motorcade en route to the plaza Haggard and weary she sits back down by her younger weeping PA Director Rex Brooks in her 40s gets to her feet and switches off the feed The picture constantly breaks up and the director and her assistant fight back tears The gallery is stunned and as the smoke clears the director catches sight of Angie lying on the ground with blood on her forehead and chest among the rubble smoke erupts from the explosion and blanks out the TV cameras covering the plaza in its dense blanket A bomb goes off in the plaza On a preview monitor the GNN gallery crew watch footage of an assassination attempt on President Ashton during which Barnes takes the bullets for the President and the President is hustled to safety and recoils Barnes a man in his 50s with a furrowed brow glancing all around scanning rooftops and the protesters as he walks ahead of the President He and his guards move away from the car with one of the Secret Service agents cameras flash and the President a tall man with a receding hairline emerges The convoy comes to a halt Men in suits climb stairs as the motorcade moves past a tall stone bell tower towards the flashing lights of a parked police car with a GNN TV camera fixed on the vehicles A motorcade sweeps through the city streets with motorcycles in the background Silver metallic letters on a black background are seen and framed within a V shape is a city skyline A bright white light shines in front of a cloudy sky held aloft by a statuesque woman wearing a long white robe with a blue sash draped around her"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Silver metallic letters on a black background are seen and framed within a V shape is a city skyline A bright white light shines in front of a cloudy sky held aloft by a statuesque woman wearing a long white robe with a blue sash draped around her Men in suits climb stairs as the motorcade moves past a tall stone bell tower towards the flashing lights of a parked police car with a GNN TV camera fixed on the vehicles A motorcade sweeps through the city streets with motorcycles in the background cameras flash and the President a tall man with a receding hairline emerges The convoy comes to a halt Barnes a man in his 50s with a furrowed brow glancing all around scanning rooftops and the protesters as he walks ahead of the President He and his guards move away from the car with one of the Secret Service agents A bomb goes off in the plaza On a preview monitor the GNN gallery crew watch footage of an assassination attempt on President Ashton during which Barnes takes the bullets for the President and the President is hustled to safety and recoils The gallery is stunned and as the smoke clears the director catches sight of Angie lying on the ground with blood on her forehead and chest among the rubble smoke erupts from the explosion and blanks out the TV cameras covering the plaza in its dense blanket Director Rex Brooks in her 40s gets to her feet and switches off the feed The picture constantly breaks up and the director and her assistant fight back tears The events rewind to preexplosion with Angie reporting and the President at the lectern and the motorcade en route to the plaza Haggard and weary she sits back down by her younger weeping PA Barnes strolls across the room sits down on his bed with a tie in his hand fastens his shirt and reaches for a pill bottle Agent Barnes his torso bare turns from his window nods to his colleague Ken Taylor then turns back to gaze out as he puts on a shirt revealing a scar on his back In the hotel room Barnes places the pill back in the bottle on the bedside cabinet lifts his gun from the cabinet and checks its magazine Popping the lid he tips the bottle puts his hand to his grimacing face seeing footage of the previous year's assassination attempt where he falls to the ground In a hotel corridor Barnes puts on his jacket while walking in front of a large window against which he is silhouetted"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The gallery is stunned and as the smoke clears the director catches sight of Angie lying on the ground with blood on her forehead and chest among the rubble The picture constantly breaks up and the director and her assistant fight back tears Director Rex Brooks in her 40s gets to her feet and switches off the feed Haggard and weary she sits back down by her younger weeping PA The events rewind to preexplosion with Angie reporting and the President at the lectern and the motorcade en route to the plaza Agent Barnes his torso bare turns from his window nods to his colleague Ken Taylor then turns back to gaze out as he puts on a shirt revealing a scar on his back Barnes strolls across the room sits down on his bed with a tie in his hand fastens his shirt and reaches for a pill bottle Popping the lid he tips the bottle puts his hand to his grimacing face seeing footage of the previous year's assassination attempt where he falls to the ground In the hotel room Barnes places the pill back in the bottle on the bedside cabinet lifts his gun from the cabinet and checks its magazine In a hotel corridor Barnes puts on his jacket while walking in front of a large window against which he is silhouetted A bright white light shines in front of a cloudy sky held aloft by a statuesque woman wearing a long white robe with a blue sash draped around her Silver metallic letters on a black background are seen and framed within a V shape is a city skyline A motorcade sweeps through the city streets with motorcycles in the background Men in suits climb stairs as the motorcade moves past a tall stone bell tower towards the flashing lights of a parked police car with a GNN TV camera fixed on the vehicles The convoy comes to a halt cameras flash and the President a tall man with a receding hairline emerges He and his guards move away from the car with one of the Secret Service agents Barnes a man in his 50s with a furrowed brow glancing all around scanning rooftops and the protesters as he walks ahead of the President On a preview monitor the GNN gallery crew watch footage of an assassination attempt on President Ashton during which Barnes takes the bullets for the President and the President is hustled to safety and recoils A bomb goes off in the plaza smoke erupts from the explosion and blanks out the TV cameras covering the plaza in its dense blanket"
        }
      ]
    }
  ]
}