{
  "ground_truth": "Lt. Dan lifts his pant leg to display his metal leg as Susan shakes Forrest's hand. Jenny steps forward and kisses Lt. Dan's cheek, and the group is seated as they watch Forrest and Jenny take vows on the front lawn. Forrest Jr. stands next to Jenny as the wind blows fallen leaves across the ground. Jenny, Forrest, and Forrest Jr. walk toward the house, holding hands as they walk. Forrest steps into Jenny's bedroom carrying a tray with breakfast on it, and looks at Jenny as she sleeps. Slowly she wakes up and looks at Forrest. Forrest looks up into the sky as the rain stops, removes his helmet, and the stars emerge from behind the clouds. He stands on his boat, looking at a deep orange and red sunset. Forrest runs along a highway and later along a desert highway as a lake reflects the mountains and the sky, and the morning light casts an orange glow over the desert. Jenny looks out the window, and Forrest looks at Jenny, who then reaches over and takes his hand. Forrest stands under the old oak tree where Jenny has been buried, trying to hold back his tears, and watches as her dad's house is knocked down by a bulldozer. He looks at Jenny's grave marker, which reads: JENNY GUMP July 16, 1945 -- March 22, 1982 Beloved Mother, Wife and Friend. Forrest Jr. reads a book to Forrest as they sit together, and Forrest looks down as he sobs. Forrest tries to teach Forrest Jr. how to play ping-pong, but when Forrest Jr. serves the ball, Forrest dives and misses it. They sit on a log by the river and fish, and Forrest looks down at the grave marker, placing the letter next to fresh flowers. As he steps back and looks at the grave, a flock of birds flies overhead and lands in the tree, and Forrest turns to watch. The bus drives toward them and stops; the door opens, and Forrest Jr. walks toward the bus. Forrest stands up as Forrest Jr. looks into the bus and at the bus driver, recognizing her as the same driver, only older now, who drove Forrest to school as a boy. Forrest Jr. waves to his father, and Forrest nods approvingly as Forrest Jr. gets on the bus, which then pulls away. Forrest stands next to the mailbox, sits down, and the camera cranes down to reveal the feather lying at his feet. A gust of wind picks the feather up.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Lt. Dan raises his trouser limb to exhibit his metal limb as Susan grasps Forrest's hand. Jenny advances forward and kisses Lt. Dan's cheek, and the group is seated as they observe Forrest and Jenny exchange vows on the front lawn. Forrest Jr. stands beside Jenny as the wind swirls fallen foliage across the ground. Jenny, Forrest, and Forrest Jr. stroll toward the residence, holding hands as they walk. Forrest steps into Jenny's bedroom bearing a platter with breakfast on it, and gazes at Jenny as she rests. Gradually she awakens and gazes at Forrest. Forrest gazes up into the sky as the rain ceases, removes his helmet, and the stars appear from behind the clouds. He stands on his vessel, gazing at a deep orange and red dusk. Forrest sprints along a highway and later along a desert highway as a lake mirrors the mountains and the sky, and the morning light casts an orange radiance over the desert. Jenny peers out the window, and Forrest gazes at Jenny, who then reaches over and takes his hand. Forrest stands under the old oak tree where Jenny has been interred, trying to hold back his tears, and observes as her dad's house is demolished by a bulldozer. He gazes at Jenny's grave marker, which reads: JENNY GUMP July 16, 1945 -- March 22, 1982 Beloved Mother, Wife and Friend. Forrest Jr. reads a book to Forrest as they sit together, and Forrest gazes down as he weeps. Forrest attempts to instruct Forrest Jr. how to play ping-pong, but when Forrest Jr. serves the ball, Forrest dives and misses it. They sit on a log by the river and fish, and Forrest gazes down at the grave marker, placing the letter beside fresh blossoms. As he steps back and gazes at the grave, a flock of birds soars overhead and lands in the tree, and Forrest turns to observe. The bus drives toward them and halts; the door opens, and Forrest Jr. walks toward the bus. Forrest stands up as Forrest Jr. gazes into the bus and at the bus driver, recognizing her as the same driver, only older now, who drove Forrest to school as a boy. Forrest Jr. waves to his father, and Forrest nods approvingly as Forrest Jr. boards the bus, which then departs. Forrest stands next to the mailbox, sits down, and the camera cranes down to reveal the feather lying at his feet. A gust of wind lifts the feather up."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Lt. Dan's pant leg is lifted by him to display his metal leg as Forrest's hand is shaken by Susan. Jenny steps forward and kisses Lt. Dan's cheek, and as they watch Forrest and Jenny take vows on the front lawn, the group seats themselves. Jenny is stood next to by Forrest Jr. as fallen leaves are blown across the ground by the wind. Jenny, Forrest, and Forrest Jr. are walked toward the house by themselves, holding hands as they walk. A tray with breakfast on it is carried by Forrest into Jenny's bedroom, and she is looked at by him as she sleeps. Slowly, she wakes up and looks at Forrest. The sky is looked up into by Forrest as the rain stops; his helmet is removed, and the stars emerge from behind the clouds. On his boat, he stands, looking at a deep orange and red sunset. A highway is run along by Forrest, and later a desert highway is run along as the mountains and the sky are reflected by a lake, and the morning light casts an orange glow over the desert. The window is looked out of by Jenny, and Jenny is looked at by Forrest, who then reaches over and takes his hand. Under the old oak tree, where Jenny has been buried, Forrest stands, trying to hold back his tears, as her dad's house is watched by him being knocked down by a bulldozer. Jenny's grave marker is looked at by him, which reads: JENNY GUMP July 16, 1945 -- March 22, 1982 Beloved Mother, Wife and Friend. A book is read by Forrest Jr. to Forrest as they sit together, and Forrest sobs while looking down. Forrest tries to teach Forrest Jr. how to play ping-pong, but Forrest dives and misses it when the ball is served by Forrest Jr. They sit on a log by the river and fish, and Forrest places the letter next to fresh flowers while looking down at the grave marker. As he steps back and looks at the grave, birds fly overhead and land in the tree, and he turns to watch. The bus drives toward them and stops; the door opens, and the bus is walked toward by Forrest Jr. As Forrest Jr. looks into the bus and at the bus driver, he stands up, recognizing her as the same driver, only older now, who drove Forrest to school as a boy. His father is waved to by Forrest Jr., and an approving nod is given by Forrest as the bus, which Forrest Jr. gets on, then pulls away. Next to the mailbox, Forrest stands, sits down, and the camera cranes down to reveal the feather lying at his feet. The feather is picked up by a gust of wind."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Lt. Dan shows his metal leg as Susan shakes Forrest's hand. Jenny kisses Lt. Dan's cheek, and they watch Forrest and Jenny exchange vows on the lawn. Forrest Jr. stands by Jenny as leaves blow across the ground. The family walks hand in hand toward the house. Forrest enters Jenny's room with breakfast, watching her sleep. She wakes and looks at him. Forrest gazes at the sky as rain stops, removes his helmet, and stars appear. He stands on his boat, admiring a sunset. Forrest runs along highways, with a lake reflecting mountains and the morning light casting an orange glow over the desert. Jenny looks out the window, and Forrest takes her hand. Forrest stands by the oak tree where Jenny is buried, holding back tears as her dad's house is demolished. He reads Jenny's grave marker: JENNY GUMP July 16, 1945 -- March 22, 1982 Beloved Mother, Wife, and Friend. Forrest Jr. reads to Forrest, who sobs. Forrest teaches Forrest Jr. ping-pong, but misses the ball. They fish by the river, and Forrest places a letter by Jenny's grave. Birds fly overhead as Forrest watches. The bus arrives, and Forrest Jr. boards, recognizing the older driver from Forrest's childhood. Forrest Jr. waves, and Forrest nods as the bus departs. Forrest sits by the mailbox, and a gust lifts a feather at his feet."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Lt. Dan shows his metal leg as Susan shakes Forrest's hand. Jenny kisses Lt. Dan's cheek, and they watch Forrest and Jenny's vows on the lawn. Forrest Jr. stands by Jenny as leaves blow. The family walks to the house holding hands. Forrest brings breakfast to Jenny, who wakes up. Forrest looks at the sky as rain stops, removes his helmet, and stars appear. He stands on his boat at sunset. Forrest runs along highways, with a lake reflecting mountains and the desert glowing orange. Jenny looks out the window, takes Forrest's hand. Forrest stands by Jenny's grave, holding back tears, as her dad's house is demolished. He reads her grave marker: JENNY GUMP July 16, 1945 -- March 22, 1982 Beloved Mother, Wife, and Friend. Forrest Jr. reads to Forrest, who sobs. Forrest teaches Forrest Jr. ping-pong, but misses the ball. They fish by the river, and Forrest places a letter by Jenny's grave. Birds land in the tree as Forrest watches. A bus arrives; Forrest Jr. recognizes the driver from Forrest's childhood. Forrest Jr. waves, boards the bus, and it leaves. Forrest sits by the mailbox, and a gust lifts a feather at his feet."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Lt. Dan, with a sense of pride and perhaps a touch of vulnerability, lifts his pant leg to reveal his metal leg, a testament to his resilience and strength. Meanwhile, Susan warmly shakes Forrest's hand, acknowledging the bond they share. Jenny, with affection and tenderness, steps forward to plant a gentle kiss on Lt. Dan's cheek. The group then settles into their seats, their eyes fixed on the heartwarming scene unfolding before them as Forrest and Jenny stand together on the front lawn, exchanging vows of love and commitment. Forrest Jr., standing proudly beside Jenny, is a picture of innocence and support as the wind playfully scatters fallen leaves across the ground, adding a touch of nature's beauty to the moment. \n\nHand in hand, Jenny, Forrest, and Forrest Jr. make their way toward the house, a united family basking in the joy of the day. Later, Forrest quietly enters Jenny's bedroom, carefully balancing a tray laden with breakfast. He pauses to gaze at Jenny, who is peacefully asleep. As she slowly awakens, their eyes meet, sharing a moment of unspoken connection. \n\nForrest, standing on his boat, looks up into the vast sky as the rain ceases, removing his helmet to witness the stars emerging from behind the clouds, painting the night with their brilliance. The deep orange and red hues of the sunset cast a mesmerizing glow over the water. Forrest runs tirelessly along a highway, and then along a desert highway, where a serene lake mirrors the majestic mountains and sky. The morning light bathes the desert in a warm, orange glow, creating a breathtaking scene.\n\nJenny gazes thoughtfully out the window, and Forrest, sensing her presence, looks at her with love. She reaches over, taking his hand in a gesture of comfort and solidarity. Under the old oak tree, where Jenny now rests, Forrest stands, struggling to hold back his tears. He watches as a bulldozer demolishes her father's house, a poignant reminder of the passage of time. His eyes fall upon Jenny's grave marker, which reads: JENNY GUMP July 16, 1945 -- March 22, 1982 Beloved Mother, Wife, and Friend.\n\nForrest Jr. sits beside Forrest, reading a book aloud, providing solace to his grieving father. Forrest, overcome with emotion, looks down, tears streaming as he sobs quietly. In an attempt to share a moment of joy, Forrest tries to teach Forrest Jr. the art of playing ping-pong. However, when Forrest Jr. serves the ball, Forrest dives and misses, adding a touch of humor to their day. They later sit together on a log by the river, fishing in peaceful companionship. Forrest places a letter next to fresh flowers at Jenny's grave, stepping back to reflect as a flock of birds gracefully flies overhead, landing in the tree. Forrest turns to watch them, finding a sense of peace.\n\nAs the bus approaches and comes to a stop, the door opens, and Forrest Jr. confidently walks toward it. Forrest stands up, watching as Forrest Jr. looks into the bus and recognizes the driver, now older, as the same woman who once drove Forrest to school as a young boy. Forrest Jr. waves goodbye to his father, and Forrest nods approvingly, filled with pride, as Forrest Jr. boards the bus, which then pulls away. Forrest stands quietly next to the mailbox, eventually sitting down. The camera cranes down to reveal a delicate feather lying at his feet. A gentle gust of wind lifts the feather, carrying it away, symbolizing the continuation of life's journey."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Lt. Dan, with a deep sense of pride and perhaps just a hint of vulnerability, lifts his pant leg to reveal his metal leg, a testament to his enduring resilience and remarkable strength. Meanwhile, Susan warmly extends her hand to shake Forrest's, acknowledging the deep and meaningful bond they share. Jenny, filled with affection and tenderness, steps forward to plant a gentle kiss on Lt. Dan's cheek, an act of warmth and endearment. The group then settles comfortably into their seats, their eyes fixed on the heartwarming scene unfolding before them. Forrest and Jenny stand together on the front lawn, exchanging vows of love and lifelong commitment. Forrest Jr., standing proudly beside Jenny, is the picture of innocence and support, as the wind playfully scatters fallen leaves across the ground, adding a touch of nature's beauty and whimsy to the moment.\n\nHand in hand, Jenny, Forrest, and Forrest Jr. make their way slowly toward the welcoming house, a united family basking in the joyful glow of the day. Later, Forrest gently enters Jenny's bedroom, carefully balancing a tray laden with an inviting breakfast. He pauses for a moment to gaze fondly at Jenny, who is peacefully asleep. As she slowly awakens, their eyes meet, sharing a moment of unspoken connection and understanding.\n\nForrest, standing tall on his boat, looks up into the vast expanse of the sky as the rain finally ceases. He removes his helmet to witness the stars emerging from behind the dissipating clouds, painting the night with their magnificent brilliance. The deep orange and red hues of the setting sun cast a mesmerizing glow over the water. Forrest runs tirelessly along a long highway, transitioning then along a serene desert highway, where a calm lake mirrors the majestic mountains and sky. The morning light bathes the vast desert in a warm, orange glow, creating an utterly breathtaking scene.\n\nJenny gazes thoughtfully out the window, and Forrest, sensing her presence, looks at her with profound love. She reaches over, taking his hand in a gesture of comfort and solidarity. Under the shade of the old oak tree, where Jenny now rests, Forrest stands, struggling valiantly to hold back his tears. He watches as a bulldozer methodically demolishes her father's house, a poignant reminder of the inevitable passage of time. His eyes fall upon Jenny's grave marker, which reads: JENNY GUMP July 16, 1945 -- March 22, 1982 Beloved Mother, Wife, and Friend.\n\nForrest Jr. sits companionably beside Forrest, reading a book aloud, offering solace to his grieving father. Forrest, overcome with emotion, looks down, tears quietly streaming as he sobs softly. In an attempt to share a moment of joy, Forrest tries to teach Forrest Jr. the art and skill of playing ping-pong. However, when Forrest Jr. serves the ball, Forrest dives and amusingly misses, adding a charming touch of humor to their day. They later sit side by side on a log by the tranquil river, fishing in peaceful companionship. Forrest places a heartfelt letter next to fresh flowers at Jenny's grave, stepping back to reflect as a flock of birds gracefully flies overhead, eventually landing in the nearby tree. Forrest turns to watch them, finding a moment of serene peace.\n\nAs the familiar bus approaches and comes to a stop, the door opens, and Forrest Jr. confidently walks toward it. Forrest stands up, watching as Forrest Jr. looks into the bus and recognizes the driver, now older, as the same woman who once drove Forrest to school when he was a young boy. Forrest Jr. waves goodbye to his father, and Forrest nods approvingly, filled with a sense of pride, as Forrest Jr. boards the bus, which then slowly pulls away. Forrest stands quietly next to the mailbox, eventually sitting down. The camera cranes down to reveal a delicate feather lying gently at his feet. A gentle gust of wind lifts the feather, carrying it away gracefully, symbolizing the continuation of life's ever-unfolding journey."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Lt. Dan carefully lifts his pant leg, revealing his metal leg to those around him, while Susan extends her hand to shake Forrest's hand in a friendly gesture. Jenny steps forward with a gentle smile and leans in to place a soft kiss on Lt. Dan's cheek, showing her affection. The group then finds their seats, settling down comfortably as they turn their attention to Forrest and Jenny, who are standing on the front lawn, ready to take their vows. Forrest Jr. stands quietly beside Jenny, his small figure framed by the gentle breeze that stirs the fallen leaves across the ground. After the ceremony, Jenny, Forrest, and Forrest Jr. walk hand in hand toward the house, their steps in sync as they move together. Later, Forrest enters Jenny's bedroom, carefully balancing a tray laden with breakfast items, and pauses to gaze at Jenny as she sleeps peacefully. Gradually, Jenny stirs awake, her eyes meeting Forrest's as she takes in the sight of him. In another moment, Forrest stands on his boat, looking up at the sky as the rain ceases, and he removes his helmet, watching as the stars begin to twinkle through the parting clouds. He remains on his boat, captivated by the deep orange and red hues of the sunset that paint the horizon. Forrest is then seen running along a highway, his feet pounding the pavement, and later, he runs along a desert highway where a serene lake mirrors the majestic mountains and sky, while the morning light casts a warm orange glow over the desert landscape. Inside, Jenny gazes out the window, her eyes searching the distance, and Forrest looks at her with tenderness before she reaches over to take his hand, their fingers intertwining. Forrest stands solemnly under the old oak tree, his heart heavy as he tries to hold back tears, looking at the spot where Jenny has been laid to rest, while in the background, a bulldozer demolishes her father's house. He turns his gaze to Jenny's grave marker, reading the inscription: JENNY GUMP July 16, 1945 -- March 22, 1982 Beloved Mother, Wife and Friend. Later, Forrest Jr. sits beside Forrest, reading a book aloud, and Forrest listens intently, though his eyes are cast downward as he quietly sobs. In an attempt to bond, Forrest tries to teach Forrest Jr. how to play ping-pong, but when Forrest Jr. serves the ball, Forrest dives to hit it and misses, eliciting laughter. They then sit together on a log by the river, fishing in companionable silence, and Forrest looks down at the grave marker, tenderly placing a letter next to the fresh flowers he has brought. As he steps back to take in the scene, a flock of birds flies overhead, landing gracefully in the tree, and Forrest turns to watch them, momentarily lost in thought. A bus approaches and comes to a stop, the door swinging open as Forrest Jr. walks toward it. Forrest stands up, watching as Forrest Jr. looks into the bus and recognizes the bus driver as the same woman, now older, who once drove Forrest to school. Forrest Jr. waves goodbye to his father, and Forrest nods approvingly, watching as his son boards the bus, which then pulls away down the road. Forrest stands quietly next to the mailbox, then sits down, and the camera slowly cranes down to reveal a feather lying at his feet. A gentle gust of wind lifts the feather, carrying it away."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Lt. Dan reveals his metal leg as Susan greets Forrest, and Jenny kisses Lt. Dan's cheek before they all sit to watch Forrest and Jenny exchange vows on the lawn. Forrest Jr. stands by Jenny as leaves scatter in the wind. The family walks hand in hand toward the house. Later, Forrest brings breakfast to a sleeping Jenny, who awakens to his gaze. Forrest reflects on the sky as rain ceases, revealing stars, and he stands on his boat, admiring a vibrant sunset. He runs along highways, with the desert's morning light casting an orange glow. Jenny looks out the window, and Forrest takes her hand. Under the oak tree where Jenny is buried, Forrest struggles with his emotions as her childhood home is demolished. He reads her grave marker, which honors her as a beloved mother, wife, and friend. Forrest Jr. reads to Forrest, who sobs quietly. Forrest attempts to teach ping-pong to Forrest Jr., but misses a serve, and they later fish by the river. Forrest places a letter by Jenny's grave, watching birds settle in the tree above. As a bus arrives, Forrest Jr. boards, recognizing the driver from Forrest's childhood. Forrest nods approvingly as the bus departs. Standing by the mailbox, Forrest sits, and a gust lifts a feather at his feet."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Lt. Dan lifts his pant leg to display his metal leg, a reminder of his service and injury during the Vietnam War, as Susan shakes Forrest's hand. Jenny steps forward and kisses Lt. Dan's cheek, and the group is seated on the porch, a common gathering place in Southern homes, as they watch Forrest and Jenny take vows on the front lawn. Forrest Jr. stands next to Jenny as the wind, a gentle breeze signaling the change of seasons, blows fallen leaves across the ground. Jenny, Forrest, and Forrest Jr. walk toward the house, holding hands, embodying the unity and strength of their family bond, as they walk. Forrest steps into Jenny's bedroom carrying a tray with breakfast on it and looks at Jenny as she sleeps, cherishing these quiet moments together. Slowly she wakes up and looks at Forrest, sharing a loving gaze. Forrest looks up into the sky as the rain stops, a common sudden change in weather in the Deep South, removes his helmet, and the stars, reminiscent of those clear Southern nights, emerge from behind the clouds. He stands on his boat, named after his beloved Jenny, looking at a deep orange and red sunset that paints the sky in vibrant hues. Forrest runs along a highway, famously known as U.S. Route 66 for part of his journey, and later along a desert highway as a lake reflects the mountains and the sky, and the morning light casts an orange glow over the desert. Jenny looks out the window, and Forrest looks at Jenny, who then reaches over and takes his hand, a simple gesture of enduring love. Forrest stands under the old oak tree, a place that holds many memories, where Jenny has been buried, trying to hold back his tears, and watches as her dad's house, a symbol of her troubled past, is knocked down by a bulldozer. He looks at Jenny's grave marker, which reads: JENNY GUMP July 16, 1945 -- March 22, 1982 Beloved Mother, Wife, and Friend. Forrest Jr. reads a book to Forrest, sharing a moment of learning and bonding, as they sit together, and Forrest looks down as he sobs, overwhelmed by emotion. Forrest tries to teach Forrest Jr. how to play ping-pong, a game he became exceptionally skilled at while recovering in the hospital, but when Forrest Jr. serves the ball, Forrest dives and misses it. They sit on a log by the river and fish, a peaceful pastime they often share together, and Forrest looks down at the grave marker, placing the letter next to fresh flowers, a gesture of remembrance and love. As he steps back and looks at the grave, a flock of birds, symbolic of freedom and renewal, flies overhead and lands in the tree, and Forrest turns to watch. The bus, an iconic symbol of American school days, drives toward them and stops; the door opens, and Forrest Jr. walks toward the bus. Forrest stands up as Forrest Jr. looks into the bus and at the bus driver, recognizing her as the same driver, only older now, who drove Forrest to school as a boy. Forrest Jr. waves to his father, and Forrest nods approvingly as Forrest Jr. gets on the bus, marking the continuation of tradition, which then pulls away. Forrest stands next to the mailbox, sits down, and the camera cranes down to reveal the feather lying at his feet, a recurring symbol in Forrest's life representing destiny and chance. A gust of wind, appearing at just the right moment, picks the feather up."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Lt Dan lifts his pant leg to display his metal leg as Susan shakes Forrest's hand. Jenny steps forward and kisses Lt Dan's cheek and the group is seated as they watch. Forrest and Jenny take vows on the front lawn. Forrest Jr stands next to Jenny as the wind blows fallen leaves across the ground. Jenny Forrest and Forrest Jr walk toward the house holding hands as they walk. Forrest steps into Jenny's bedroom carrying a tray with breakfast on it and looks at Jenny as she sleeps. Slowly she wakes up and looks at Forrest. Forrest looks up into the sky as the rain stops removes his helmet and the stars emerge from behind the clouds. He stands on his boat looking at a deep orange and red sunset. Forrest runs along a highway and later along a desert highway as a lake reflects the mountains and the sky and the morning light casts an orange glow over the desert. Jenny looks out the window and Forrest looks at Jenny who then reaches over and takes his hand. Forrest stands under the old oak tree where Jenny has been buried trying to hold back his tears and watches as her dad's house is knocked down by a bulldozer. He looks at Jenny's grave marker which reads JENNY GUMP. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. July 16 1945. March 22 1982. Beloved Mother Wife and Friend. Forrest Jr reads a book to Forrest as they sit together and Forrest looks down as he sobs. Forrest tries to teach Forrest Jr how to play pingpong but when Forrest Jr serves the ball Forrest dives and misses it. They sit on a log by the river and fish and Forrest looks down at the grave marker placing the letter next to fresh flowers. As he steps back and looks at the grave a flock of birds flies overhead and lands in the tree and Forrest turns to watch. The bus drives toward them and stops. the door opens and Forrest Jr walks toward the bus. Forrest stands up as Forrest Jr looks into the bus and at the bus driver recognizing her as the same driver only older now who drove Forrest to school as a boy. Forrest Jr waves to his father and Forrest nods approvingly as Forrest Jr gets on the bus which then pulls away. Forrest stands next to the mailbox sits down and the camera cranes down to reveal the feather lying at his feet. A gust of wind picks the feather up."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Lt Dan lifts his pant leg to display his metal leg as Susan shakes Forrest's hand. Jenny steps forward and kisses Lt Dan's cheek and the group is seated as they watch. Forrest and Jenny take vows on the front lawn. Forrest Jr stands next to Jenny as the wind blows fallen leaves across the ground. Jenny Forrest and Forrest Jr walk toward the house holding hands as they walk. Forrest steps into Jenny's bedroom carrying a tray with breakfast on it and looks at Jenny as she sleeps. Slowly she wakes up and looks at Forrest. Forrest looks up into the sky as the rain stops removes his helmet and the stars emerge from behind the clouds. He stands on his boat looking at a deep orange and red sunset. Forrest runs along a highway and later along a desert highway as a lake reflects the mountains and the sky and the morning light casts an orange glow over the desert. Jenny looks out the window and Forrest looks at Jenny who then reaches over and takes his hand. Forrest stands under the old oak tree where Jenny has been buried trying to hold back his tears and watches as her dad's house is knocked down by a bulldozer. He looks at Jenny's grave marker which reads JENNY GUMP. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. July 16 1945. March 22 1982. Beloved Mother Wife and Friend. Forrest Jr reads a book to Forrest as they sit together and Forrest looks down as he sobs. Forrest tries to teach Forrest Jr how to play pingpong but when Forrest Jr serves the ball Forrest dives and misses it. They sit on a log by the river and fish and Forrest looks down at the grave marker placing the letter next to fresh flowers. As he steps back and looks at the grave a flock of birds flies overhead and lands in the tree and Forrest turns to watch. The bus drives toward them and stops. the door opens and Forrest Jr walks toward the bus. Forrest stands up as Forrest Jr looks into the bus and at the bus driver recognizing her as the same driver only older now who drove Forrest to school as a boy. Forrest Jr waves to his father and Forrest nods approvingly as Forrest Jr gets on the bus which then pulls away. Forrest stands next to the mailbox sits down and the camera cranes down to reveal the feather lying at his feet. A gust of wind picks the feather up."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Lt Dan lifts his pant leg to display his metal leg as Susan shakes Forrest's hand. Jenny steps forward and kisses Lt Dan's cheek and the group is seated as they watch. Forrest and Jenny take vows on the front lawn. Forrest Jr stands next to Jenny as the wind blows fallen leaves across the ground. Jenny Forrest and Forrest Jr walk toward the house holding hands as they walk. Forrest steps into Jenny's bedroom carrying a tray with breakfast on it and looks at Jenny as she sleeps. Slowly she wakes up and looks at Forrest. The bus drives toward them and stops. the door opens and Forrest Jr walks toward the bus. Forrest stands up as Forrest Jr looks into the bus and at the bus driver recognizing her as the same driver only older now who drove Forrest to school as a boy. Forrest Jr waves to his father and Forrest nods approvingly as Forrest Jr gets on the bus which then pulls away. Forrest stands next to the mailbox sits down and the camera cranes down to reveal the feather lying at his feet. A gust of wind picks the feather up."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Lt Dan lifts his pant leg to display his metal leg as Susan shakes Forrest's hand. Jenny steps forward and kisses Lt Dan's cheek and the group is seated as they watch. Forrest and Jenny take vows on the front lawn. Forrest Jr waves to his father and Forrest nods approvingly as Forrest Jr gets on the bus which then pulls away. Forrest stands next to the mailbox sits down and the camera cranes down to reveal the feather lying at his feet. A gust of wind picks the feather up."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Sergeant Phil adjusts his hat brim to reveal his plastic shoe as Martha spins Oliver's umbrella. Carol leaps forward and hugs Sergeant Phil's elbow, and the assembly stretches out as they hear Oliver and Carol exchange stories on the back porch. Oliver Jr. lounges next to Carol as the breeze carries drifting balloons over the courtyard. Carol, Oliver, and Oliver Jr. stroll toward the library, swinging lanterns as they stroll. Oliver steps into Carol's closet holding a platter with pastries on it, and glances at Carol as she naps. Gradually she stirs and glances at Oliver. Oliver glances down into the ocean as the snow starts, drops his scarf, and the comets appear from above the rooftops. He kneels on his raft, gazing at a vivid purple and yellow sunrise. Oliver cycles along a railway and later along a forest trail as a pond mirrors the cliffs and the clouds, and the evening light throws a blue hue over the canyon. Carol peers through the doorway, and Oliver glances at Carol, who then reaches out and grasps his lantern. Oliver kneels under the ancient maple where Carol has been placed, trying to stifle his laughter, and gazes as her uncle's barn is constructed by a crane. He glances at Carol's statue, which reads: CAROL SMITH March 25, 1950 -- April 10, 1985 Cherished Artist, Sister and Neighbor. Oliver Jr. sketches a comic for Oliver as they relax together, and Oliver gazes up as he cheers. Oliver attempts to show Oliver Jr. how to play hopscotch, but when Oliver Jr. tosses the stone, Oliver leaps and catches it. They recline on a bench by the pond and read, and Oliver gazes up at the statue, placing the postcard next to fresh snacks. As he steps forward and gazes at the statue, a herd of deer prances around and collapses in the field, and Oliver turns to admire. The train glides toward them and pauses; the window closes, and Oliver Jr. strolls toward the train. Oliver rises as Oliver Jr. glances into the train and at the conductor, recognizing him as the same captain, only older now, who sailed Oliver to summer camp as a toddler. Oliver Jr. salutes his parent, and Oliver winks approvingly as Oliver Jr. boards the train, which then sails away. Oliver reclines next to the ladder, stands up, and the camera swoops up to reveal the balloon floating at his shoulder. A puff of breeze lifts the balloon."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Lt. Dan shows his metal leg as Susan shakes Forrest's hand. Jenny kisses Lt. Dan, and the group watches Forrest and Jenny's vows. Forrest Jr. stands beside them as they walk to the house. Forrest brings Jenny breakfast, watching her sleep. As rain stops, Forrest, aboard his boat, observes a sunset. He runs along highways, with picturesque landscapes reflecting his journey. Jenny looks out the window and holds Forrest's hand. Under an oak tree, Forrest tries to hold back tears as he stands at Jenny's grave, marked \"JENNY GUMP, Beloved Mother, Wife and Friend.\" Forrest Jr. reads to him, and they share moments fishing and playing ping-pong. Forrest places a letter at Jenny's grave, watches birds, and sees Forrest Jr. board a school bus driven by the same driver from his childhood. As the bus departs, Forrest smiles approvingly. He sits by the mailbox, watching a feather picked up by the wind."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "A gust of wind picks the feather up Forrest stands next to the mailbox sits down and the camera cranes down to reveal the feather lying at his feet  Forrest Jr waves to his father and Forrest nods approvingly as Forrest Jr gets on the bus which then pulls away  Forrest stands up as Forrest Jr looks into the bus and at the bus driver recognizing her as the same driver only older now who drove Forrest to school as a boy  the door opens and Forrest Jr walks toward the bus  The bus drives toward them and stops  As he steps back and looks at the grave a flock of birds flies overhead and lands in the tree and Forrest turns to watch  They sit on a log by the river and fish and Forrest looks down at the grave marker placing the letter next to fresh flowers  Forrest tries to teach Forrest Jr how to play pingpong but when Forrest Jr serves the ball Forrest dives and misses it  Forrest Jr reads a book to Forrest as they sit together and Forrest looks down as he sobs  Beloved Mother Wife and Friend  March 22 1982  July 16 1945   He looks at Jenny's grave marker which reads JENNY GUMP  Forrest stands under the old oak tree where Jenny has been buried trying to hold back his tears and watches as her dad's house is knocked down by a bulldozer  Jenny looks out the window and Forrest looks at Jenny who then reaches over and takes his hand  Forrest runs along a highway and later along a desert highway as a lake reflects the mountains and the sky and the morning light casts an orange glow over the desert  He stands on his boat looking at a deep orange and red sunset  Forrest looks up into the sky as the rain stops removes his helmet and the stars emerge from behind the clouds  Slowly she wakes up and looks at Forrest  Forrest steps into Jenny's bedroom carrying a tray with breakfast on it and looks at Jenny as she sleeps  Jenny Forrest and Forrest Jr walk toward the house holding hands as they walk  Forrest Jr stands next to Jenny as the wind blows fallen leaves across the ground  Forrest and Jenny take vows on the front lawn  Jenny steps forward and kisses Lt Dan's cheek and the group is seated as they watch  Lt Dan lifts his pant leg to display his metal leg as Susan shakes Forrest's hand "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Jenny steps forward and kisses Lt Dan's cheek and the group is seated as they watch Lt Dan lifts his pant leg to display his metal leg as Susan shakes Forrest's hand Forrest Jr stands next to Jenny as the wind blows fallen leaves across the ground Forrest and Jenny take vows on the front lawn Forrest steps into Jenny's bedroom carrying a tray with breakfast on it and looks at Jenny as she sleeps Jenny Forrest and Forrest Jr walk toward the house holding hands as they walk Forrest looks up into the sky as the rain stops removes his helmet and the stars emerge from behind the clouds Slowly she wakes up and looks at Forrest Forrest runs along a highway and later along a desert highway as a lake reflects the mountains and the sky and the morning light casts an orange glow over the desert He stands on his boat looking at a deep orange and red sunset Forrest stands under the old oak tree where Jenny has been buried trying to hold back his tears and watches as her dad's house is knocked down by a bulldozer Jenny looks out the window and Forrest looks at Jenny who then reaches over and takes his hand July 16 1945 He looks at Jenny's grave marker which reads JENNY GUMP Beloved Mother Wife and Friend March 22 1982 Forrest tries to teach Forrest Jr how to play pingpong but when Forrest Jr serves the ball Forrest dives and misses it Forrest Jr reads a book to Forrest as they sit together and Forrest looks down as he sobs As he steps back and looks at the grave a flock of birds flies overhead and lands in the tree and Forrest turns to watch They sit on a log by the river and fish and Forrest looks down at the grave marker placing the letter next to fresh flowers the door opens and Forrest Jr walks toward the bus The bus drives toward them and stops Forrest Jr waves to his father and Forrest nods approvingly as Forrest Jr gets on the bus which then pulls away Forrest stands up as Forrest Jr looks into the bus and at the bus driver recognizing her as the same driver only older now who drove Forrest to school as a boy A gust of wind picks the feather up Forrest stands next to the mailbox sits down and the camera cranes down to reveal the feather lying at his feet"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "July 16 1945   March 22 1982  Beloved Mother Wife and Friend  Forrest Jr reads a book to Forrest as they sit together and Forrest looks down as he sobs  Forrest tries to teach Forrest Jr how to play pingpong but when Forrest Jr serves the ball Forrest dives and misses it  They sit on a log by the river and fish and Forrest looks down at the grave marker placing the letter next to fresh flowers  As he steps back and looks at the grave a flock of birds flies overhead and lands in the tree and Forrest turns to watch  The bus drives toward them and stops  the door opens and Forrest Jr walks toward the bus  Forrest stands up as Forrest Jr looks into the bus and at the bus driver recognizing her as the same driver only older now who drove Forrest to school as a boy  Forrest Jr waves to his father and Forrest nods approvingly as Forrest Jr gets on the bus which then pulls away  Forrest stands next to the mailbox sits down and the camera cranes down to reveal the feather lying at his feet  A gust of wind picks the feather up Lt Dan lifts his pant leg to display his metal leg as Susan shakes Forrest's hand  Jenny steps forward and kisses Lt Dan's cheek and the group is seated as they watch  Forrest and Jenny take vows on the front lawn  Forrest Jr stands next to Jenny as the wind blows fallen leaves across the ground  Jenny Forrest and Forrest Jr walk toward the house holding hands as they walk  Forrest steps into Jenny's bedroom carrying a tray with breakfast on it and looks at Jenny as she sleeps  Slowly she wakes up and looks at Forrest  Forrest looks up into the sky as the rain stops removes his helmet and the stars emerge from behind the clouds  He stands on his boat looking at a deep orange and red sunset  Forrest runs along a highway and later along a desert highway as a lake reflects the mountains and the sky and the morning light casts an orange glow over the desert  Jenny looks out the window and Forrest looks at Jenny who then reaches over and takes his hand  Forrest stands under the old oak tree where Jenny has been buried trying to hold back his tears and watches as her dad's house is knocked down by a bulldozer  He looks at Jenny's grave marker which reads JENNY GUMP "
        }
      ]
    }
  ]
}