{
  "ground_truth": "The chase mounts a pedestrian area and crashes down a wide stone staircase, then rejoins the main road as other cars desperately veer to the side while Taylor powers onward. Barnes swerves to avoid a collision and mounts the pavement, wrestling with his steering wheel as Javier looks back and sees Barnes lose a little bit of ground. The chase continues as a fire engine bounds towards Taylor but holds while both Taylor and Barnes brake on the turn and then accelerate along parallel lines. Barnes drives through a pedestrian colonnade, spots two cars in the way, and brakes, being thrown around as the hatchback breaks through the gap. Taylor and Javier look behind them as they join a busy road and the chase weaves through a slow traffic. Javier pulls his gun, and Taylor clips another driver, who hits a parked car. Barnes powers through the flipping vehicles as Taylor looks back anxiously over his shoulder, and Javier lowers his gun, then leans out of the window and fires. Two bullet holes appear in Barnes' windscreen, and Javier sits back into the police car as Taylor looks in his rear view mirror and steers, then handbrake turns the police car round a corner and into the path of a truck which loses control. As Barnes rounds the corner, the truck smashes into the hatchback, causing pedestrians to scatter as Barnes is sandwiched between the truck and the nearby wall. Taylor smirks as they proceed along the underpass in the shadow of an elevated road, where Enrique steps from behind a pillar. Taylor stops the car, and Javier gets out, shooting the armed Enrique and then pointing his gun at Enrique's face while Howard films nearby and spots Anna crossing the road. Barnes pushes the windscreen out of the wrecked hatchback and climbs out onto the road as the truck driver holds his arms out, and Barnes pulls his gun, heading for the underpass. Veins stand out on Javier's forehead as he presses the gun up to Enrique's forehead while Barnes takes aim some way back. Javier spins and opens fire, and Barnes fires back as Taylor starts the police car, and they both land shoulder hits, with Javier grabbing the door of Taylor's car. Taylor pulls a gun and shoots Javier point blank as he accelerates, as Barnes gives chase on foot while Enrique dies by the roadside. A shot from Barnes shatters the back windscreen and hits Taylor in the shoulder, and Taylor looks dazed and loses control of the car, then veers onto the curb and crashes into a concrete ramp which smashes through the windscreen. Javier lies dead on the road with his face resting against his right arm as Barnes approaches the police car with his handgun held out in front of him.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Certainly! Here's the transformed text with synonyms replacing non-stop words:\n\nThe pursuit ascends a walker zone and slams down a broad rock stairway, then reunites with the primary route as additional automobiles frantically swerve to the side while Taylor drives onward. Barnes veers to prevent a crash and ascends the sidewalk, grappling with his steering wheel as Javier glances back and observes Barnes lose a slight bit of distance. The pursuit persists as a blaze truck leaps towards Taylor but pauses while both Taylor and Barnes decelerate on the curve and then speed along parallel paths. Barnes maneuvers through a walker arcade, notices two automobiles in the path, and decelerates, being tossed around as the compact car bursts through the gap. Taylor and Javier glance behind them as they merge with a crowded route and the pursuit weaves through a sluggish traffic. Javier draws his pistol, and Taylor clips another motorist, who strikes a stationary automobile. Barnes drives through the flipping vehicles as Taylor glances back worriedly over his shoulder, and Javier lowers his pistol, then leans outward of the window and discharges. Two projectile holes appear in Barnes' windshield, and Javier sits back inside the police automobile as Taylor glances in his rear view mirror and steers, then handbrake turns the police automobile around a corner and into the route of a lorry which loses command. As Barnes rounds the corner, the lorry collides into the compact car, causing walkers to scatter as Barnes is wedged between the lorry and the nearby barrier. Taylor grins as they proceed along the bypass in the shade of an elevated route, where Enrique steps from behind a column. Taylor halts the automobile, and Javier exits, shooting the armed Enrique and then aiming his pistol at Enrique's face while Howard records nearby and notices Anna crossing the road. Barnes pushes the windshield out of the ruined compact car and climbs out onto the route as the lorry driver holds his arms out, and Barnes draws his pistol, heading for the bypass. Veins stand out on Javier's forehead as he presses the pistol up to Enrique's forehead while Barnes takes aim some distance back. Javier spins and opens fire, and Barnes returns fire as Taylor starts the police automobile, and they both land shoulder hits, with Javier grasping the door of Taylor's automobile. Taylor draws a pistol and shoots Javier point blank as he accelerates, as Barnes gives pursuit on foot while Enrique perishes by the roadside. A shot from Barnes shatters the back windshield and hits Taylor in the shoulder, and Taylor looks stunned and loses command of the automobile, then veers onto the curb and crashes into a cement incline which smashes through the windshield. Javier lies deceased on the route with his face resting against his right arm as Barnes approaches the police automobile with his handgun held out in front of him."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The chase is mounted by a pedestrian area and is crashed down a wide stone staircase by it, then the main road is rejoined by it as other cars desperately veer to the side while onward is powered by Taylor. A collision is swerved to avoid by Barnes and the pavement is mounted, the steering wheel is wrestled with by him as Barnes loses a little bit of ground, seen by Javier when he looks back. The chase is continued as a fire engine bounds towards Taylor but while both Taylor and Barnes brake on the turn and then accelerate along parallel lines, it is held. A pedestrian colonnade is driven through by Barnes, who spots two cars in the way, brakes, and is thrown around as the gap is broken through by the hatchback. Behind them is looked by Taylor and Javier as a busy road is joined by them and a slow traffic is weaved through by the chase. His gun is pulled by Javier, and another driver is clipped by Taylor, who hits a parked car. The flipping vehicles are powered through by Barnes as Taylor anxiously looks back over his shoulder, and Javier lowers his gun, then the window is leaned out of and fires are opened by him. Two bullet holes are made to appear in Barnes' windscreen by him, and Javier sits back into the police car as his rear view mirror is looked in by Taylor and the police car is handbrake turned round a corner and into the path of a truck which loses control. As the corner is rounded by Barnes, the truck is smashed into by the hatchback, causing pedestrians to scatter as the truck and the nearby wall sandwich Barnes. A smirk is given by Taylor as they proceed along an underpass in the shadow of an elevated road, where a step is taken from behind a pillar by Enrique. The car is stopped by Taylor, and the armed Enrique is shot by Javier after he gets out, then his gun is pointed at Enrique's face by him while nearby filming is done by Howard and Anna is spotted crossing the road. The windscreen is pushed out of the wrecked hatchback by Barnes and the road is climbed onto by him as the truck driver holds his arms out, and Barnes pulls his gun, heading for the underpass. Veins stand out on Javier's forehead as the gun is pressed up to Enrique's forehead by him while aim is taken by Barnes some way back. A spin is made by Javier and fire is opened, and backfire is returned by Barnes as the police car is started by Taylor, and hits are landed on both shoulders, with the door of Taylor's car being grabbed by Javier. A gun is pulled by Taylor and a point-blank shot is given to Javier as acceleration takes place, as a chase is given by Barnes on foot while Enrique dies by the roadside. The back windscreen is shattered by a shot from Barnes and Taylor is hit in the shoulder by it, and dazed, control of the car is lost by Taylor, then the curb is veered onto and a concrete ramp is crashed into, which the windscreen is smashed through by. Dead on the road lies Javier with his face resting against his right arm as the police car is approached by Barnes with his handgun held out in front of him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The chase moves onto a pedestrian area, crashes down a stone staircase, and rejoins the main road as cars veer aside while Taylor continues. Barnes evades a collision, mounts the pavement, and loses ground. The chase proceeds as a fire engine approaches but holds while both brake and accelerate in parallel. Barnes drives through a pedestrian colonnade, brakes to avoid two cars, and is jostled as he squeezes through. Taylor and Javier join a busy road, weaving through slow traffic. Javier draws a gun, Taylor clips another driver who hits a parked car. Barnes navigates through chaos as Javier fires from the window, hitting Barnes' windscreen. Taylor handbrake-turns into a truck's path, causing a collision and scattering pedestrians. Taylor smirks under an elevated road where Enrique appears. Taylor stops, Javier exits, shoots Enrique, and holds him at gunpoint while Howard films Anna crossing. Barnes pushes out of his wrecked car, draws his gun, and heads for the underpass. Javier presses his gun to Enrique's forehead as Barnes aims. Javier fires, Barnes returns fire, hitting shoulders as Javier grabs Taylor's car. Taylor shoots Javier point-blank and speeds away, while Barnes pursues on foot. Barnes' shot shatters Taylor's windscreen, hitting his shoulder, causing Taylor to crash into a concrete ramp. Javier lies dead, and Barnes approaches the police car, gun ready."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The chase ascends a pedestrian area, crashes down stairs, and rejoins the main road as Taylor speeds on. Barnes swerves onto the pavement, struggling with the steering, losing ground to Taylor. A fire engine approaches but holds as both brake, then accelerate. Barnes drives through a colonnade, brakes to avoid cars, breaking through the gap. Amid slow traffic, Taylor clips a car; Barnes navigates through flipping vehicles as Javier fires, creating bullet holes in Barnes' windscreen. Taylor handbrake turns into a truck's path, causing it to smash into Barnes' car. Taylor stops at an underpass, where Javier shoots Enrique and points his gun, while Howard films Anna crossing the road. Barnes climbs out, gun drawn, and aims from a distance. A shootout ensues, with Taylor and Javier exchanging fire, both hit. Taylor shoots Javier as he accelerates; Barnes chases on foot, hitting Taylor's shoulder, causing him to crash. Javier lies dead as Barnes approaches, gun in hand."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The intense chase mounts a bustling pedestrian area, creating chaos as it crashes forcefully down a wide and ancient stone staircase. It then rejoins the main road, where other vehicles, in a frantic effort to avoid disaster, desperately veer to the side. Meanwhile, Taylor powers onward with determined speed. Barnes, in his pursuit, swerves sharply to avoid a potentially catastrophic collision, mounting the curb and wrestling intensely with his stubborn steering wheel. As this unfolds, Javier looks back, watching Barnes as he loses a bit of ground in the chaos. The pursuit continues unabated as a fire engine bounds toward Taylor, but it momentarily holds its position while both Taylor and Barnes expertly brake on the turn. They then accelerate fiercely, maintaining parallel lines. Barnes, unfazed, drives through a crowded pedestrian colonnade and quickly spots two cars obstructing his path. He brakes abruptly, being tossed around as his agile hatchback breaks through the narrow gap. Taylor and Javier glance behind them as they merge onto a busy road, their chase weaving skillfully through the sluggish traffic. In a tense moment, Javier pulls out his gun as Taylor clips another driver, causing the unfortunate driver to crash into a parked car. Unperturbed by the flipping vehicles around him, Barnes powers through with determination. Taylor, anxious, glances back over his shoulder, and Javier lowers his gun momentarily, only to lean out of the window and fire. Two sharp bullet holes appear in Barnes' windscreen as Javier retreats back into the police car. Taylor then checks his rear-view mirror, deftly steering and executing a precision handbrake turn around a corner, right into the path of an out-of-control truck. As Barnes rounds the corner, the massive truck violently smashes into the hatchback, causing pedestrians to scatter in fear. Barnes finds himself sandwiched precariously between the truck and the looming nearby wall. Taylor, watching this unfold, smirks confidently as they proceed along an underpass, shrouded in the shadow of an elevated road. Here, Enrique steps out suddenly from behind a pillar. Taylor halts the car, and Javier quickly exits, shooting the armed Enrique before pointing his gun menacingly at Enrique's face. Meanwhile, Howard, filming nearby, spots Anna as she crosses the road. At this moment, Barnes pushes the damaged windscreen out of the wrecked hatchback and climbs out onto the hard pavement as the truck driver holds his arms out in confusion. Barnes, seizing the moment, pulls his gun and heads determinedly toward the underpass. With veins protruding on Javier's forehead, he forcefully presses the gun against Enrique's forehead while Barnes takes careful aim from some distance away. In a flash, Javier spins and opens fire, prompting Barnes to return fire as Taylor starts the police car. Both men sustain shoulder hits. Javier, grasping the door of Taylor's car, meets a grim fate when Taylor pulls a gun and shoots him at point-blank range as he accelerates. Barnes, undeterred, gives chase on foot as Enrique dies quietly by the roadside. A well-placed shot from Barnes shatters the rear windscreen, striking Taylor in the shoulder. Taylor, now dazed, loses control of the car and veers onto the curb, crashing violently into a sturdy concrete ramp, which smashes through the windscreen. Javier lies lifeless on the road, his face resting against his right arm, as Barnes approaches the police car with his handgun held steady in front of him."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The intense and thrilling chase dramatically escalates as it mounts a bustling pedestrian area, causing widespread chaos and disarray as it crashes forcefully down a wide and ancient stone staircase. This frenetic scene then transitions back onto the main road, where other vehicles, in a frantic and desperate effort to avert disaster, veer sharply to the side. Meanwhile, Taylor powers onward with determined speed, while Barnes, in ardent pursuit, swerves sharply to avoid what could easily become a potentially catastrophic collision, mounting the curb and wrestling intensely with his stubborn, resistant steering wheel. Amidst this unfolding scene, Javier, looking back, watches closely as Barnes loses a bit of ground amid the chaos and disorder. The high-stakes pursuit carries on unabated as a fire engine bounds toward Taylor, but it momentarily holds its position while both Taylor and Barnes expertly brake on the sharp turn. They then accelerate fiercely, maintaining parallel lines with remarkable precision. Barnes, appearing unfazed by the surrounding chaos, drives through a crowded pedestrian colonnade and soon spots two cars obstructing his path. He brakes abruptly, being tossed around inside as his agile hatchback breaks through the narrow gap. Taylor and Javier glance behind them, assessing the situation as they merge onto a busy road, their chase weaving skillfully through the sluggish traffic. In a particularly tense moment, Javier pulls out his gun as Taylor clips another driver, resulting in the unfortunate driver crashing into a parked car. Undeterred by the flipping vehicles around him, Barnes powers through with sheer determination. Taylor, growing anxious, glances back over his shoulder, and Javier lowers his gun momentarily, only to quickly lean out of the window and fire. Two sharp bullet holes appear suddenly in Barnes' windscreen as Javier retreats back into the police car. Taylor then checks his rear-view mirror, deftly steering and executing a precision handbrake turn around a corner, directly into the path of an out-of-control truck. As Barnes rounds the corner, the massive truck violently smashes into the hatchback, causing pedestrians to scatter in fear. Barnes finds himself precariously sandwiched between the truck and the looming nearby wall. Taylor, watching this unfold, smirks confidently as they proceed along an underpass, shrouded in the shadow of an elevated road. Here, Enrique steps out suddenly from behind a hidden pillar. Taylor halts the car, and Javier quickly exits, shooting the now-armed Enrique before pointing his gun menacingly at Enrique's face. Meanwhile, Howard, filming nearby, catches sight of Anna as she crosses the road. At this crucial moment, Barnes pushes the damaged windscreen out of the wrecked hatchback and climbs out onto the hard, unforgiving pavement as the truck driver holds his arms out in evident confusion. Barnes, seizing the moment, pulls his gun and heads with determination toward the underpass. With veins prominently protruding on Javier's forehead, he forcefully presses the gun against Enrique's forehead while Barnes takes careful aim from a distance away. In a flash, Javier spins and opens fire, prompting Barnes to return fire as Taylor starts the police car. Both men sustain shoulder hits in the exchange. Javier, grasping the door of Taylor's car, meets a grim fate when Taylor pulls a gun and shoots him at point-blank range as he accelerates. Barnes, undeterred by the chaos, gives chase on foot as Enrique dies quietly by the roadside. A well-placed shot from Barnes shatters the rear windscreen, striking Taylor in the shoulder. Taylor, now dazed and disoriented, loses control of the car and veers onto the curb, crashing violently into a sturdy concrete ramp, which smashes through the windscreen. Javier lies lifeless on the road, his face resting against his right arm, as Barnes approaches the police car with his handgun held steady in front of him."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the chase intensifies, the car mounts the pedestrian area, its tires grinding against the pavement, before crashing down a wide stone staircase, each bounce jolting the vehicle. It then rejoins the main road seamlessly, as other cars scramble and desperately veer to the side to clear the path, while Taylor maintains a relentless forward momentum. Barnes, trailing behind, swerves sharply to avoid a looming collision, his hands gripping the steering wheel with force, and mounts the pavement, wrestling to maintain control. Javier, sitting beside Barnes, turns his head to glance back and notices Barnes losing a bit of ground to Taylor. The pursuit continues unabated, when a fire engine suddenly bounds into view rushing towards Taylor but comes to a cautious hold, allowing both Taylor and Barnes to brake simultaneously at the turn. With precision, they accelerate once more along parallel trajectories. Barnes navigates through a pedestrian colonnade, his eyes darting to two obstructive cars, prompting him to brake abruptly, causing his body to be thrown about as the hatchback narrowly breaks through the gap. Taylor and Javier, keeping the pace, glance behind them as they merge into a bustling road, skillfully weaving through the slow-moving traffic. Amidst the chaos, Javier pulls out his gun, his grip steady, just as Taylor clips another driver, resulting in the unfortunate car crashing into a parked vehicle. Barnes fearlessly plows through the flipping vehicles, unwavering in his pursuit, as Taylor throws a worried look over his shoulder. Sensing the urgency, Javier lowers his gun, then swiftly leans out of the window, firing a shot. In response, two bullet holes puncture Barnes' windscreen. Javier retreats back into the police car, his eyes locking with Taylor's in the rearview mirror. Taylor, with a decisive move, steers the car, engaging the handbrake to spin the car around a corner, steering it directly into the path of an oncoming truck, which careens out of control. As Barnes follows suit, rounding the corner, the truck catapults into the hatchback, forcing pedestrians to scatter for safety while Barnes braces against a collision between the truck and a nearby wall. Taylor smirks with satisfaction as they press on through the underpass, cast in shadow beneath an elevated road, where Enrique emerges stealthily from behind a pillar. Halting the car, Taylor watches as Javier steps out, his gun aimed with precision at the armed Enrique, firing a shot that finds its mark. Javier advances, pressing his gun ominously to Enrique's forehead, while nearby, Howard films the unfolding drama and catches sight of Anna making her way across the road. Not one to be deterred, Barnes forcibly pushes the damaged windscreen out of the mangled hatchback, climbing onto the road with determination, his gun ready in hand as the truck driver gestures in apology or disbelief. Barnes heads assuredly toward the underpass, veins pronounced on Javier's forehead as he maintains pressure against Enrique's forehead. As Barnes takes aim from a distance, Javier suddenly spins, unleashing a volley of gunfire. Barnes counters, returning fire as Taylor promptly starts the police car, both shooters landing glancing hits on each other's shoulders. Javier lunges, grabbing the door of Taylor’s car for leverage. In an abrupt twist, Taylor pulls a gun and, with ruthless efficiency, shoots Javier point-blank, simultaneously accelerating away. Barnes, undeterred, gives chase on foot, his gaze fixed on Enrique, who now lies lifeless by the roadside. A retaliatory shot from Barnes shatters the car's back windscreen, striking Taylor in the shoulder. Dazed, Taylor loses control, the car veering perilously onto the curb before crashing against a concrete ramp, the impact shattering the windscreen with a forceful explosion of glass. Javier lies lifeless on the road, his face resting gently against his right arm, a silent testament to the pursuit's violent end. Barnes approaches with calculated caution, his handgun held steadily before him, as he finally closes in on the wrecked police car."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The chase escalates through a pedestrian area onto a wide stone staircase, then returns to the main road as Taylor advances, forcing other vehicles aside. Barnes swerves to avoid a collision, briefly mounts the pavement, and loses some ground. As a fire engine approaches, both drivers brake and then accelerate, running parallel. Barnes navigates through a pedestrian colonnade, braking sharply to maneuver between obstructing cars. Meanwhile, Taylor and Javier weave through heavy traffic, Javier draws his gun, and their car clips another vehicle, causing a crash. Barnes powers through the wreckage as Javier leans out to fire at him, leaving bullet holes in Barnes' windscreen. Taylor deftly maneuvers around a corner, causing a truck to crash into Barnes, who becomes trapped between the truck and a wall. Taylor smirks and proceeds under the shadow of an elevated road where Enrique waits. Stopping the car, Javier exits, shoots Enrique, and threatens him as Howard films and Anna crosses nearby. Barnes escapes from his damaged vehicle and approaches the underpass. Under pressure, Javier presses his gun to Enrique's forehead, then spins to fire at Barnes, who returns fire, injuring Javier. In the chaos, Taylor shoots Javier at close range and speeds off, with Barnes chasing on foot. Barnes fires at the fleeing car, wounding Taylor, who loses control and crashes into a concrete ramp. Javier lies dead as Barnes approaches the crashed police car with his weapon ready."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The chase mounts a pedestrian area well-known for its frequent street performances and crashes down a wide stone staircase, a remnant of 19th-century architecture, then rejoins the main road as other cars desperately veer to the side while Taylor powers onward. Barnes swerves to avoid a collision and mounts the pavement, a sidewalk lined with small cafes, wrestling with his steering wheel as Javier looks back and sees Barnes lose a little bit of ground. The chase continues as a fire engine, responding to a nearby emergency, bounds towards Taylor but holds while both Taylor and Barnes brake on the turn and then accelerate along parallel lines. Barnes drives through a pedestrian colonnade, a historical walkway originally designed for horse-drawn carriages, spots two cars in the way, and brakes, being thrown around as the hatchback breaks through the gap. Taylor and Javier look behind them as they join a busy road known for its heavy rush-hour traffic, and the chase weaves through a slow traffic. Javier pulls his gun, an illegal firearm acquired through the black market, and Taylor clips another driver, who hits a parked car. Barnes powers through the flipping vehicles and Taylor looks back anxiously over his shoulder, as Javier lowers his gun, then leans out of the window and fires. Two bullet holes appear in Barnes' windscreen, and Javier sits back into the police car as Taylor looks in his rearview mirror and steers, then handbrake turns the police car round a corner and into the path of a truck carrying construction materials, which loses control. As Barnes rounds the corner, the truck smashes into the hatchback, causing pedestrians to scatter as Barnes is sandwiched between the truck and the nearby wall, part of an old industrial building. Taylor smirks as they proceed along the underpass in the shadow of an elevated road, a major route known to traffic reports for frequent jams, where Enrique steps from behind a pillar. Taylor stops the car, and Javier gets out, shooting the armed Enrique, a rival gang member, and then pointing his gun at Enrique's face while Howard, an investigative journalist, films nearby and spots Anna crossing the road. Barnes pushes the windscreen out of the wrecked hatchback and climbs out onto the road as the truck driver, shocked by the accident's severity, holds his arms out, and Barnes pulls his gun, heading for the underpass. Veins stand out on Javier's forehead as he presses the gun up to Enrique's forehead while Barnes takes aim some way back. Javier spins and opens fire, and Barnes fires back as Taylor starts the police car, and they both land shoulder hits, with Javier grabbing the door of Taylor's car. Taylor pulls a gun and shoots Javier point blank as he accelerates, as Barnes gives chase on foot while Enrique dies by the roadside, his last action unresolved. A shot from Barnes shatters the back windscreen and hits Taylor in the shoulder, and Taylor looks dazed and loses control of the car, then veers onto the curb and crashes into a concrete ramp used for pedestrian overpasses, which smashes through the windscreen. Javier lies dead on the road with his face resting against his right arm as Barnes approaches the police car with his handgun held out in front of him, his training drilled into his every move."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Javier lies dead on the road with his face resting against his right arm as Barnes approaches the police car with his handgun held out in front of him The chase mounts a pedestrian area and crashes down a wide stone staircase then rejoins the main road as other cars desperately veer to the side while Taylor powers onward The chase continues as a fire engine bounds towards Taylor but holds while both Taylor and Barnes brake on the turn and then accelerate along parallel lines Two bullet holes appear in Barnes' windscreen and Javier sits back into the police car as Taylor looks in his rear view mirror and steers Barnes swerves to avoid a collision and mounts the pavement wrestling with his steering wheel as Javier looks back and sees Barnes lose a little bit of ground Barnes drives through a pedestrian colonnade spots two cars in the way and brakes being thrown around as the hatchback breaks through the gap Taylor stops the car and Javier gets out shooting the armed Enrique and then pointing his gun at Enrique's face while Howard films nearby and spots Anna crossing the road Barnes swerves to avoid a collision and mounts the pavement wrestling with his steering wheel as Javier looks back and sees Barnes lose a little bit of ground The chase continues as a fire engine bounds towards Taylor but holds while both Taylor and Barnes brake on the turn and then accelerate along parallel lines Barnes drives through a pedestrian colonnade spots two cars in the way and brakes being thrown around as the hatchback breaks through the gap Taylor and Javier look behind them as they join a busy road and the chase weaves through a slow traffic Javier pulls his gun and Taylor clips another driver who hits a parked car Barnes powers through the flipping vehicles as Taylor looks back anxiously over his shoulder and Javier lowers his gun then leans out of the window and fires Two bullet holes appear in Barnes' windscreen and Javier sits back into the police car as Taylor looks in his rear view mirror and steers then handbrake turns the police car round a corner and into the path of a truck which loses control As Barnes rounds the corner the truck smashes into the hatchback causing pedestrians to scatter as Barnes is sandwiched between the truck and the nearby wall Taylor smirks as they proceed along the underpass in the shadow of an elevated road where Enrique steps from behind a pillar Taylor smirks as they proceed along the underpass in the shadow of an elevated road where Enrique steps from behind a pillar Taylor stops the car and Javier gets out shooting the armed Enrique and then pointing his gun at Enrique's face while Howard films nearby and spots Anna crossing the road A shot from Barnes shatters the back windscreen and hits Taylor in the shoulder and Taylor looks dazed and loses control of the car then handbrake turns the police car round a corner and into the path of a truck which loses control Barnes pushes the windscreen out of the wrecked hatchback and climbs out onto the road as the truck driver holds his arms out and Barnes pulls his gun heading for the underpass Veins stand out on Javier's forehead as he presses the gun up to Enrique's forehead while Barnes takes aim some way back Javier spins and opens fire and Barnes fires back as Taylor starts the police car and they both land shoulder hits with Javier grabbing the door of Taylor's car Taylor pulls a gun and shoots Javier point blank as he accelerates as Barnes gives chase on foot while Enrique dies by the roadside A shot from Barnes shatters the back windscreen and hits Taylor in the shoulder and Taylor looks dazed and loses control of the car The chase mounts a pedestrian area and crashes down a wide stone staircase then rejoins the main road as other cars desperately veer to the side while Taylor powers onward then veers onto the curb and crashes into a concrete ramp which smashes through the windscreen Javier lies dead on the road with his face resting against his right arm as Barnes approaches the police car with his handgun held out in front of him"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The chase mounts a pedestrian area and crashes down a wide stone staircase then rejoins the main road as other cars desperately veer to the side while Taylor powers onward. Barnes swerves to avoid a collision and mounts the pavement wrestling with his steering wheel as Javier looks back and sees Barnes lose a little bit of ground. The chase continues as a fire engine bounds towards Taylor but holds while both Taylor and Barnes brake on the turn and then accelerate along parallel lines. Barnes drives through a pedestrian colonnade spots two cars in the way and brakes being thrown around as the hatchback breaks through the gap. Taylor and Javier look behind them as they join a busy road and the chase weaves through a slow traffic. Javier pulls his gun and Taylor clips another driver who hits a parked car. Barnes powers through the flipping vehicles as Taylor looks back anxiously over his shoulder and Javier lowers his gun then leans out of the window and fires. Two bullet holes appear in Barnes' windscreen and Javier sits back into the police car as Taylor looks in his rear view mirror and steers. then handbrake turns the police car round a corner and into the path of a truck which loses control. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. As Barnes rounds the corner the truck smashes into the hatchback causing pedestrians to scatter as Barnes is sandwiched between the truck and the nearby wall. Taylor smirks as they proceed along the underpass in the shadow of an elevated road where Enrique steps from behind a pillar. Taylor stops the car and Javier gets out shooting the armed Enrique and then pointing his gun at Enrique's face while Howard films nearby and spots Anna crossing the road. Barnes pushes the windscreen out of the wrecked hatchback and climbs out onto the road as the truck driver holds his arms out and Barnes pulls his gun heading for the underpass. Veins stand out on Javier's forehead as he presses the gun up to Enrique's forehead while Barnes takes aim some way back. Javier spins and opens fire and Barnes fires back as Taylor starts the police car and they both land shoulder hits with Javier grabbing the door of Taylor's car. Taylor pulls a gun and shoots Javier point blank as he accelerates as Barnes gives chase on foot while Enrique dies by the roadside. A shot from Barnes shatters the back windscreen and hits Taylor in the shoulder and Taylor looks dazed and loses control of the car. then veers onto the curb and crashes into a concrete ramp which smashes through the windscreen. Javier lies dead on the road with his face resting against his right arm as Barnes approaches the police car with his handgun held out in front of him."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The chase mounts a pedestrian area and crashes down a wide stone staircase then rejoins the main road as other cars desperately veer to the side while Taylor powers onward. Barnes swerves to avoid a collision and mounts the pavement wrestling with his steering wheel as Javier looks back and sees Barnes lose a little bit of ground. The chase continues as a fire engine bounds towards Taylor but holds while both Taylor and Barnes brake on the turn and then accelerate along parallel lines. Barnes drives through a pedestrian colonnade spots two cars in the way and brakes being thrown around as the hatchback breaks through the gap. Taylor and Javier look behind them as they join a busy road and the chase weaves through a slow traffic. Javier pulls his gun and Taylor clips another driver who hits a parked car. Barnes powers through the flipping vehicles as Taylor looks back anxiously over his shoulder and Javier lowers his gun then leans out of the window and fires. Two bullet holes appear in Barnes' windscreen and Javier sits back into the police car as Taylor looks in his rear view mirror and steers. then handbrake turns the police car round a corner and into the path of a truck which loses control. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. As Barnes rounds the corner the truck smashes into the hatchback causing pedestrians to scatter as Barnes is sandwiched between the truck and the nearby wall. Taylor smirks as they proceed along the underpass in the shadow of an elevated road where Enrique steps from behind a pillar. Taylor stops the car and Javier gets out shooting the armed Enrique and then pointing his gun at Enrique's face while Howard films nearby and spots Anna crossing the road. Barnes pushes the windscreen out of the wrecked hatchback and climbs out onto the road as the truck driver holds his arms out and Barnes pulls his gun heading for the underpass. Veins stand out on Javier's forehead as he presses the gun up to Enrique's forehead while Barnes takes aim some way back. Javier spins and opens fire and Barnes fires back as Taylor starts the police car and they both land shoulder hits with Javier grabbing the door of Taylor's car. Taylor pulls a gun and shoots Javier point blank as he accelerates as Barnes gives chase on foot while Enrique dies by the roadside. A shot from Barnes shatters the back windscreen and hits Taylor in the shoulder and Taylor looks dazed and loses control of the car. then veers onto the curb and crashes into a concrete ramp which smashes through the windscreen. Javier lies dead on the road with his face resting against his right arm as Barnes approaches the police car with his handgun held out in front of him."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The chase mounts a pedestrian area and crashes down a wide stone staircase then rejoins the main road as other cars desperately veer to the side while Taylor powers onward. Barnes swerves to avoid a collision and mounts the pavement wrestling with his steering wheel as Javier looks back and sees Barnes lose a little bit of ground. The chase continues as a fire engine bounds towards Taylor but holds while both Taylor and Barnes brake on the turn and then accelerate along parallel lines. Barnes drives through a pedestrian colonnade spots two cars in the way and brakes being thrown around as the hatchback breaks through the gap. Taylor and Javier look behind them as they join a busy road and the chase weaves through a slow traffic. Javier spins and opens fire and Barnes fires back as Taylor starts the police car and they both land shoulder hits with Javier grabbing the door of Taylor's car. Taylor pulls a gun and shoots Javier point blank as he accelerates as Barnes gives chase on foot while Enrique dies by the roadside. A shot from Barnes shatters the back windscreen and hits Taylor in the shoulder and Taylor looks dazed and loses control of the car. then veers onto the curb and crashes into a concrete ramp which smashes through the windscreen. Javier lies dead on the road with his face resting against his right arm as Barnes approaches the police car with his handgun held out in front of him."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The chase mounts a pedestrian area and crashes down a wide stone staircase then rejoins the main road as other cars desperately veer to the side while Taylor powers onward. Barnes swerves to avoid a collision and mounts the pavement wrestling with his steering wheel as Javier looks back and sees Barnes lose a little bit of ground. then veers onto the curb and crashes into a concrete ramp which smashes through the windscreen. Javier lies dead on the road with his face resting against his right arm as Barnes approaches the police car with his handgun held out in front of him."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The bird mounts a pedestrian area and crashes down a wide stone staircase, then rejoins the main road as other cars desperately veer to the side while the rabbit powers onward. The turtle swerves to avoid a collision and mounts the pavement, wrestling with his steering wheel as the squirrel looks back and sees the turtle lose a little bit of ground. The chase continues as a fire engine bounds towards the rabbit but holds while both the rabbit and the turtle brake on the turn and then accelerate along parallel lines. The turtle drives through a pedestrian colonnade, spots two cars in the way, and brakes, being thrown around as the hatchback breaks through the gap. The rabbit and the squirrel look behind them as they join a busy road and the chase weaves through a slow traffic. The squirrel pulls his gun, and the rabbit clips another driver, who hits a parked car. The turtle powers through the flipping vehicles as the rabbit looks back anxiously over his shoulder, and the squirrel lowers his gun, then leans out of the window and fires. Two bullet holes appear in the turtle's windscreen, and the squirrel sits back into the police car as the rabbit looks in his rear view mirror and steers, then handbrake turns the police car round a corner and into the path of a truck which loses control. As the turtle rounds the corner, the truck smashes into the hatchback, causing pedestrians to scatter as the turtle is sandwiched between the truck and the nearby wall. The rabbit smirks as they proceed along the underpass in the shadow of an elevated road, where the elephant steps from behind a pillar. The rabbit stops the car, and the squirrel gets out, shooting the armed elephant and then pointing his gun at the elephant's face while the raccoon films nearby and spots the fox crossing the road. The turtle pushes the windscreen out of the wrecked hatchback and climbs out onto the road as the truck driver holds his arms out, and the turtle pulls his gun, heading for the underpass. Veins stand out on the squirrel's forehead as he presses the gun up to the elephant's forehead while the turtle takes aim some way back. The squirrel spins and opens fire, and the turtle fires back as the rabbit starts the police car, and they both land shoulder hits, with the squirrel grabbing the door of the rabbit's car. The rabbit pulls a gun and shoots the squirrel point blank as he accelerates, as the turtle gives chase on foot while the elephant dies by the roadside. A shot from the turtle shatters the back windscreen and hits the rabbit in the shoulder, and the rabbit looks dazed and loses control of the car, then veers onto the curb and crashes into a concrete ramp which smashes through the windscreen. The squirrel lies dead on the road with his face resting against his right arm as the turtle approaches the police car with his handgun held out in front of him."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The chase enters a bicycle path and crashes down a narrow wooden ramp, then rejoins the main avenue as other buses desperately veer to the side while Taylor powers onward. Barnes swerves to avoid a collision and mounts the grass, wrestling with his steering wheel as Javier looks back and sees Barnes lose a little bit of ground. The chase continues as a tanker bounds towards Taylor but holds while both Taylor and Barnes brake on the bend and then accelerate along parallel routes. Barnes drives through a pedestrian arcade, spots two buses in the way, and brakes, being thrown around as the sedan breaks through the gap. Taylor and Javier look behind them as they join a congested street and the chase weaves through a slow parade. Javier pulls his crossbow, and Taylor clips another bicyclist, who hits a parked tractor. Barnes powers through the flipping machines as Taylor looks back anxiously over his shoulder, and Javier lowers his crossbow, then leans out of the window and fires. Two bolt holes appear in Barnes' windshield, and Javier sits back into the ice cream van as Taylor looks in his rear view mirror and steers, then handbrake turns the ice cream van round a corner and into the path of a cart which loses control. As Barnes rounds the corner, the cart smashes into the sedan, causing cyclists to scatter as Barnes is sandwiched between the cart and the nearby fence. Taylor smirks as they proceed along the alley in the shadow of an elevated walkway, where Enrique steps from behind a bush. Taylor stops the van, and Javier gets out, shooting the armed Enrique and then pointing his crossbow at Enrique's face while Howard sketches nearby and spots Anna crossing the avenue. Barnes pushes the windshield out of the wrecked sedan and climbs out onto the street as the cart driver holds his arms out, and Barnes pulls his crossbow, heading for the alley. Veins stand out on Javier's forehead as he presses the crossbow up to Enrique's forehead while Barnes takes aim some way back. Javier spins and opens fire, and Barnes fires back as Taylor starts the ice cream van, and they both land shoulder hits, with Javier grabbing the door of Taylor's van. Taylor pulls a crossbow and shoots Javier point blank as he accelerates, as Barnes gives chase on foot while Enrique dies by the roadside. A shot from Barnes shatters the back windshield and hits Taylor in the shoulder, and Taylor looks dazed and loses control of the van, then veers onto the sand and crashes into a wooden barrier which smashes through the windshield. Javier lies dead on the street with his face resting against his right hand as Barnes approaches the ice cream van with his crossbow held out in front of him."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The chase dances through a pedestrian area and leaps off a wide stone staircase, then glides onto the main road as other cars haltingly drift to the side while Taylor glides onward. Barnes drifts to avoid a collision and ascends the pavement, fiddling with his steering wheel as Javier looks back and watches Barnes gain a little bit of ground. The chase lingers as a fire engine tiptoes towards Taylor but hesitates while both Taylor and Barnes coast on the turn and then cruise along parallel lines. Barnes meanders through a pedestrian colonnade, notices two cars in the way, and decelerates, being swayed around as the hatchback slips through the gap. Taylor and Javier look behind them as they traverse a busy road and the chase slides through a slow traffic. Javier raises his binoculars, and Taylor brushes against another driver, who glides into a parked car. Barnes dances through the spinning vehicles as Taylor looks back calmly over his shoulder, and Javier raises his binoculars, then leans out of the window and waves. Two bullet holes appear in Barnes' windscreen, and Javier sits back into the police car as Taylor glances in his rear view mirror and glides, then handbrake maneuvers the police car around a corner and into the path of a truck which drifts. As Barnes meanders around the corner, the truck slides into the hatchback, causing pedestrians to shuffle as Barnes is sandwiched between the truck and the nearby wall. Taylor grins as they proceed along the underpass in the shadow of an elevated road, where Enrique steps from behind a pillar. Taylor halts the car, and Javier steps out, saluting the armed Enrique and then shaking his binoculars at Enrique's face while Howard dances nearby and watches Anna cross the road. Barnes lifts the windscreen out of the wrecked hatchback and jumps out onto the road as the truck driver wiggles his arms out, and Barnes places his hat, heading for the underpass. Veins stand out on Javier's forehead as he places the binoculars up to Enrique's forehead while Barnes sets his gaze some way back. Javier pivots and raises his binoculars, and Barnes waves back as Taylor glides the police car, and they both land shoulder taps, with Javier grabbing the door of Taylor's car. Taylor hoists a binoculars and waves at Javier as he glides, as Barnes follows briskly on foot while Enrique naps by the roadside. A glance from Barnes shatters the back windscreen and nudges Taylor on the shoulder, and Taylor looks dazed and sways with the car, then drifts onto the curb and slides into a concrete ramp which melts through the windscreen. Javier rests peacefully on the road with his face against his right arm as Barnes approaches the police car with his binoculars pointed out in front of him."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The hurricane climbs a bicycle lane and tumbles down a narrow metal escalator, then rejoins the shallow river as other boats frantically swerve to the side while Samantha rockets onward. Jordan skids to avoid a crash and climbs the fence, grappling with their joystick as Felipe glances back and sees Jordan lose a little bit of momentum. The hurricane continues as a snowplow leaps towards Samantha but holds while both Samantha and Jordan halt on the curve and then zoom along parallel wires. Jordan sails through a floral gazebo, spots two kites in the way, and halts, being flung about as the skateboard bursts through the crevice. Samantha and Felipe glance behind them as they join a crowded racetrack and the hurricane weaves through a sluggish stampede. Felipe draws his slingshot, and Samantha brushes another cyclist, who crashes into a parked tractor. Jordan blasts through the tumbling wagons as Samantha looks back nervously over her shoulder, and Felipe lowers his slingshot, then leans out of the skylight and launches a projectile. Two cracks appear in Jordan's visor, and Felipe sinks into the submarine as Samantha peers in her side view mirror and steers, then handbrake pivots the submarine around a curve and into the path of a locomotive which loses balance. As Jordan rounds the curve, the locomotive plows into the skateboard, causing kangaroos to scatter as Jordan is crunched between the locomotive and the nearby billboard. Samantha grins as they cruise along the footpath in the shadow of a buried tunnel, where Leonardo steps from behind a bush. Samantha halts the unicycle, and Felipe gets out, hurling a paperweight at the tech-savvy Leonardo and then directing his slingshot at Leonardo's nose while Rebecca sketches nearby and sees Maria jaywalking. Jordan pushes the helmet off the shattered skateboard and climbs out onto the bench as the locomotive engineer raises his eyebrows, and Jordan draws his broomstick, heading for the footpath. Muscles tense on Felipe's neck as he presses the slingshot up to Leonardo's chin while Jordan takes aim some distance back. Felipe spins and throws rocks, and Jordan counters as Samantha starts the submarine, and they both land elbow nudges, with Felipe clinging to the handle of Samantha's unicycle. Samantha draws a slingshot and launches a projectile at Felipe point blank as she accelerates, as Jordan gives pursuit on stilts while Leonardo collapses by the fountain. A flash from Jordan splinters the rear window and strikes Samantha in the elbow, and Samantha looks bewildered and loses grip of the unicycle, then swerves onto the sidewalk and crashes into a marble platform which shatters through the window. Felipe lies motionless on the grass with his cheek resting against his left arm as Jordan nears the submarine with his broomstick held out in front of him."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The marathon leaps over a pedestrian area and tumbles down a wide stone staircase, then rejoins the main road as other bicycles anxiously glide to the side while Marion drifts onward. Lewis maneuvers to avoid a collision and leaps onto the pavement, grappling with his steering wheel as Marcus glances back and sees Lewis gain a little bit of ground. The marathon continues as an ambulance bounces toward Marion but hesitates while both Marion and Lewis skid on the turn and then zoom along parallel lines. Lewis glides through a pedestrian colonnade, spots two bicycles in the way, and halts, being tossed around as the scooter bursts through the gap. Marion and Marcus glance behind them as they join a busy road and the marathon snakes through a slow traffic. Marcus draws his flashlight, and Marion brushes another cyclist, who skids into a parked bicycle. Lewis sails through the flipping bicycles as Marion glances back nervously over his shoulder, and Marcus lowers his flashlight, then leans out of the window and shouts. Two dents appear in Lewis' windshield, and Marcus sits back into the parade float as Marion glances in his rearview mirror and maneuvers, then handbrake spins the parade float around a corner and into the path of a tram which spins out. As Lewis turns the corner, the tram collides with the scooter, causing pedestrians to dart as Lewis is wedged between the tram and the nearby fence. Marion grins as they continue along the underpass in the shadow of an elevated path, where Felipe steps from behind a pillar. Marion halts the float, and Marcus steps out, shouting at the startled Felipe and then pointing his flashlight at Felipe's face while Thomas films nearby and notices Bella crossing the road. Lewis pushes the windshield out of the wrecked scooter and clamors onto the road as the tram conductor raises his arms, and Lewis draws his flashlight, heading for the underpass. Veins stand out on Marcus' forehead as he presses the flashlight up to Felipe's forehead while Lewis takes aim some way back. Marcus whirls and gestures wildly, and Lewis flashes back as Marion starts the parade float, and they both land shoulder bumps, with Marcus clutching the door of Marion's float. Marion draws a flashlight and strikes Marcus point blank as he accelerates, as Lewis follows on foot while Felipe collapses by the roadside. A flash from Lewis shatters the back windshield and strikes Marion in the shoulder, and Marion looks bewildered and loses control of the float, then swerves onto the pavement and crashes into a metal bench which punches through the windshield. Marcus lies motionless on the road with his face resting against his right arm as Lewis approaches the parade float with his flashlight held out in front of him."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The chase climbs a garden path and stumbles down a narrow wooden ladder, then diverges to the side street as other bicycles calmly drift to the center while Taylor sails backward. Barnes zigzags to avoid a collision and scales the fence, juggling with his handlebars as Javier glances forward and sees Barnes gain a little bit of distance. The chase advances as a bulldozer waddles towards Taylor but pauses while both Taylor and Barnes glide through the junction and then decelerate along converging paths. Barnes glides through a market aisle, spots two bicycles in the way, and accelerates, being gently nudged as the scooter sneaks through the opening. Taylor and Javier glance ahead as they enter a quiet alley and the chase dances through the heavy crowd. Javier unsheathes his dagger, and Taylor grazes another pedestrian, who bumps into a moving cart. Barnes drifts past the spinning carts as Taylor glances nervously over his shoulder, and Javier sheaths his dagger, then leans out of the window and shouts. Two bird droppings appear on Barnes' side mirror, and Javier slumps back into the police horse carriage as Taylor glances in his rear view mirror and strides, then mirrors spins the police carriage round a lamppost and onto the path of a skateboard which gains momentum. As Barnes reaches the lamppost, the skateboard careens into the scooter, causing cyclists to leap as Barnes is wedged between the skateboard and the nearby pole. Taylor chuckles as they move along the footbridge in the cover of an overhanging tree, where Enrique emerges from behind a bush. Taylor halts the scooter, and Javier steps down, throwing a rock at the unarmed Enrique and then tossing his dagger at Enrique's shadow while Howard sketches nearby and notices Anna climbing the fence. Barnes releases the windshield wipers of the damaged scooter and scrambles out onto the sidewalk as the skateboard rider shrugs his shoulders, and Barnes slings his dagger, heading for the footbridge. Sweat glistens on Javier's brow as he presses the rock up to Enrique's nose while Barnes takes aim some distance away. Javier spins and hurls a stone, and Barnes throws a pebble back as Taylor rolls the police carriage, and they both land elbow nudges, with Javier reaching for the reins of Taylor's scooter. Taylor draws a pebble and hurls it at Javier point blank as he glides, as Barnes pursues on stilts while Enrique naps by the roadside. A pebble from Barnes cracks the rear windshield and taps Taylor on the elbow, and Taylor looks stunned and drops control of the scooter, then drifts onto the grass and bumps into a wooden bench which topples over the windshield. Javier rests peacefully on the path with his nose touching his left shoulder as Barnes approaches the police carriage with his slingshot held aloft in front of him."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The camel navigates a meadow and cartwheels up a narrow timber bridge, then exits the ocean as other boats lazily drift in the vicinity while Oliver floats backward. Harris waltzes to avoid a confrontation and jumps the fence, juggling with his compass as Sophia peeks forward and notices Harris gain a little bit of ground. The camel drifts as a submarine glides toward Oliver but pauses while both Oliver and Harris halt on the straightaway and then glide along dusty trails. Harris swims through a grassy valley, notices two bikes in the way, and skids, being tossed around as the scooter slides over the log. Oliver and Sophia glance ahead as they enter a bustling plaza and the camel spirals through a tranquil park. Sophia unfurls her map, and Oliver grazes another cyclist, who bumps a stationary motorcycle. Harris strolls past the tumbling animals as Oliver glances forward anxiously over his shoulder, and Sophia closes her map, then leans out of the tent and whispers. Two holes appear in Harris' periscope, and Sophia sinks back into the sailboat as Oliver peeks in his binoculars and glides, then somersaults the sailboat over a fence and into the path of a caravan which drifts sideways. As Harris slides past the fence, the caravan glances against the scooter, causing trees to sway as Harris is wedged between the caravan and the distant hill. Oliver chuckles as they drift beneath the canopy in the light of a hidden moon, where Sebastian leaps from behind a rock. Oliver parks the boat, and Sophia climbs out, sketching the cautious Sebastian and then raising her pencil at Sebastian's nose while Lily dances nearby and observes Carla chasing the star. Harris nudges the periscope out of the bobbing scooter and scrambles out onto the meadow as the caravan owner waves his fist, and Harris clutches his cushion, aiming for the canopy. Shadows dance on Sophia's arms as she places the pencil up to Sebastian's chin while Harris takes aim quite far away. Sophia whirls and sketches, and Harris sprinkles flowers as Oliver ignites the sailboat, and they both land head bumps, with Sophia reaching for the sail of Oliver's boat. Oliver waves a map and sketches Sophia point blank as he decelerates, as Harris gallops by foot while Sebastian rests by the roadway. A splash from Harris soaks the back sail and scratches Oliver on the elbow, and Oliver appears perplexed and drops the oar, then floats onto the sandbar and lands against a wooden plank which pierces the sail. Sophia rests peacefully in the park with her ear touching against her left foot as Harris approaches the sailboat with his megaphone held high in triumph."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The chase escalates as Taylor navigates through a pedestrian area, crashes down a staircase, and rejoins the main road with Barnes in pursuit. Barnes swerves and takes to the pavement to close the gap. The chase weaves through traffic, with Javier firing at Barnes and two bullet holes appearing in Barnes' windscreen. Taylor handbrake turns the car into a truck's path, causing a crash that Barnes narrowly avoids. Taylor smirks as they drive through an underpass where Enrique appears. Javier exits and shoots Enrique while Howard films nearby. Barnes emerges from the wreck, gun drawn, and heads toward the underpass. Javier holds Enrique at gunpoint, but Barnes fires at Javier and hits him, leading to a gunfight where both are injured. Taylor shoots Javier point-blank and accelerates with Barnes chasing on foot. Barnes shoots Taylor in the shoulder, causing him to lose control and crash. As Barnes approaches the wrecked car, Javier lies dead on the road."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Javier lies dead on the road with his face resting against his right arm as Barnes approaches the police car with his handgun held out in front of him then veers onto the curb and crashes into a concrete ramp which smashes through the windscreen A shot from Barnes shatters the back windscreen and hits Taylor in the shoulder and Taylor looks dazed and loses control of the car Taylor pulls a gun and shoots Javier point blank as he accelerates as Barnes gives chase on foot while Enrique dies by the roadside Javier spins and opens fire and Barnes fires back as Taylor starts the police car and they both land shoulder hits with Javier grabbing the door of Taylor's car Veins stand out on Javier's forehead as he presses the gun up to Enrique's forehead while Barnes takes aim some way back Barnes pushes the windscreen out of the wrecked hatchback and climbs out onto the road as the truck driver holds his arms out and Barnes pulls his gun heading for the underpass Taylor stops the car and Javier gets out shooting the armed Enrique and then pointing his gun at Enrique's face while Howard films nearby and spots Anna crossing the road Taylor smirks as they proceed along the underpass in the shadow of an elevated road where Enrique steps from behind a pillar As Barnes rounds the corner the truck smashes into the hatchback causing pedestrians to scatter as Barnes is sandwiched between the truck and the nearby wall then handbrake turns the police car round a corner and into the path of a truck which loses control Two bullet holes appear in Barnes' windscreen and Javier sits back into the police car as Taylor looks in his rear view mirror and steers Barnes powers through the flipping vehicles as Taylor looks back anxiously over his shoulder and Javier lowers his gun then leans out of the window and fires Javier pulls his gun and Taylor clips another driver who hits a parked car Taylor and Javier look behind them as they join a busy road and the chase weaves through a slow traffic Barnes drives through a pedestrian colonnade spots two cars in the way and brakes being thrown around as the hatchback breaks through the gap The chase continues as a fire engine bounds towards Taylor but holds while both Taylor and Barnes brake on the turn and then accelerate along parallel lines Barnes swerves to avoid a collision and mounts the pavement wrestling with his steering wheel as Javier looks back and sees Barnes lose a little bit of ground The chase mounts a pedestrian area and crashes down a wide stone staircase then rejoins the main road as other cars desperately veer to the side while Taylor powers onward"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Javier spins and opens fire and Barnes fires back as Taylor starts the police car and they both land shoulder hits with Javier grabbing the door of Taylor's car Veins stand out on Javier's forehead as he presses the gun up to Enrique's forehead while Barnes takes aim some way back Taylor and Javier look behind them as they join a busy road and the chase weaves through a slow traffic As Barnes rounds the corner the truck smashes into the hatchback causing pedestrians to scatter as Barnes is sandwiched between the truck and the nearby wall Javier pulls his gun and Taylor clips another driver who hits a parked car Taylor pulls a gun and shoots Javier point blank as he accelerates as Barnes gives chase on foot while Enrique dies by the roadside then veers onto the curb and crashes into a concrete ramp which smashes through the windscreen Barnes powers through the flipping vehicles as Taylor looks back anxiously over his shoulder and Javier lowers his gun then leans out of the window and fires Barnes pushes the windscreen out of the wrecked hatchback and climbs out onto the road as the truck driver holds his arms out and Barnes pulls his gun heading for the underpass A shot from Barnes shatters the back windscreen and hits Taylor in the shoulder and Taylor looks dazed and loses control of the car Taylor smirks as they proceed along the underpass in the shadow of an elevated road where Enrique steps from behind a pillar Barnes swerves to avoid a collision and mounts the pavement wrestling with his steering wheel as Javier looks back and sees Barnes lose a little bit of ground Taylor stops the car and Javier gets out shooting the armed Enrique and then pointing his gun at Enrique's face while Howard films nearby and spots Anna crossing the road The chase continues as a fire engine bounds towards Taylor but holds while both Taylor and Barnes brake on the turn and then accelerate along parallel lines Javier lies dead on the road with his face resting against his right arm as Barnes approaches the police car with his handgun held out in front of him Two bullet holes appear in Barnes' windscreen and Javier sits back into the police car as Taylor looks in his rear view mirror and steers then handbrake turns the police car round a corner and into the path of a truck which loses control The chase mounts a pedestrian area and crashes down a wide stone staircase then rejoins the main road as other cars desperately veer to the side while Taylor powers onward Barnes drives through a pedestrian colonnade spots two cars in the way and brakes being thrown around as the hatchback breaks through the gap"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Taylor smirks as they proceed along the underpass in the shadow of an elevated road where Enrique steps from behind a pillar Taylor stops the car and Javier gets out shooting the armed Enrique and then pointing his gun at Enrique's face while Howard films nearby and spots Anna crossing the road Barnes pushes the windscreen out of the wrecked hatchback and climbs out onto the road as the truck driver holds his arms out and Barnes pulls his gun heading for the underpass Veins stand out on Javier's forehead as he presses the gun up to Enrique's forehead while Barnes takes aim some way back Javier spins and opens fire and Barnes fires back as Taylor starts the police car and they both land shoulder hits with Javier grabbing the door of Taylor's car Taylor pulls a gun and shoots Javier point blank as he accelerates as Barnes gives chase on foot while Enrique dies by the roadside A shot from Barnes shatters the back windscreen and hits Taylor in the shoulder and Taylor looks dazed and loses control of the car then veers onto the curb and crashes into a concrete ramp which smashes through the windscreen Javier lies dead on the road with his face resting against his right arm as Barnes approaches the police car with his handgun held out in front of him The chase mounts a pedestrian area and crashes down a wide stone staircase then rejoins the main road as other cars desperately veer to the side while Taylor powers onward Barnes swerves to avoid a collision and mounts the pavement wrestling with his steering wheel as Javier looks back and sees Barnes lose a little bit of ground The chase continues as a fire engine bounds towards Taylor but holds while both Taylor and Barnes brake on the turn and then accelerate along parallel lines Barnes drives through a pedestrian colonnade spots two cars in the way and brakes being thrown around as the hatchback breaks through the gap Taylor and Javier look behind them as they join a busy road and the chase weaves through a slow traffic Javier pulls his gun and Taylor clips another driver who hits a parked car Barnes powers through the flipping vehicles as Taylor looks back anxiously over his shoulder and Javier lowers his gun then leans out of the window and fires Two bullet holes appear in Barnes' windscreen and Javier sits back into the police car as Taylor looks in his rear view mirror and steers then handbrake turns the police car round a corner and into the path of a truck which loses control As Barnes rounds the corner the truck smashes into the hatchback causing pedestrians to scatter as Barnes is sandwiched between the truck and the nearby wall"
        }
      ]
    }
  ]
}