{
  "ground_truth": "He looks down from the window at Barnes and Taylor. The Mayor waves to the crowd, then steps back from the lectern to welcome President Ashton with a handshake. Barnes sees an open window. A muzzle flash illuminates the window, and the President reels back before falling. Taylor yells to a stunned Barnes. Barnes looks back up. A bearded young man dashes to the podium. Barnes tackles him. Barnes stares down at the recumbent President. Taylor helps carry the President away. The President is loaded into an ambulance. The bearded young man. They lead him off. An exasperated look on his face, Holden turns away. They loop up on hearing the distant explosion. Barnes sees the man in the checked shirt. He runs to him and grabs his camera. Barnes points. They rewind the camera in vision. Both men stare at the LCD screen. Flames and black smoke rise into the air. The smoke clears. Barnes is lying on the ground. He regains consciousness. There is a scratch on his grubby face. Barnes hauls himself to his knees. Barnes struggles to get to his feet. There are small fires all around. A man throws a blanket over a woman whose clothes are in flames. Barnes takes in the number of people lying injured. Barnes recalls the muzzle flashes in the window. Across the plaza, Matthews, clutching a chest wound, tries to sit up. Barnes runs across to him, past the mess of twisted metal crowd control barriers. Barnes bends down. Holden staggers over. Matthews falls still. Holden shakes his head. Barnes stares at his fallen colleague. Holden looks up to see the Spanish bearded cop with a gun. Holden chases after the bearded man who has holstered his gun. Barnes looks up as a GNN cameraman runs past. Barnes reads the GNN logo and leaps to his feet. He runs to the GNN outside broadcast van and enters the gallery. Barnes stares at the bank of monitors. The director watches him. Barnes sees a still frame of him being shot. Barnes searches for the cell phone. Rex watches as Barnes keys in numbers on his cell phone. He speaks into his cuff mike. He dials a number. The PA whispers into her cellphone. Barnes' eyes are fixed on the monitor. Karen glances around and manually rewinds the tape control. Barnes looks intently at the screen, his eyes unblinking. Barnes turns and runs out of the van. The events rewind. Barnes turning to Mathews. The explosion, the shooting. Taylor at Barnes' hotel door. The time on the digital clock moves to midday. The bearded man, Enrique, a handsome man in his 30s wearing a light open shirt over a dark tee shirt and with a bag over his shoulder, marches past the protestors on his way to the plaza.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He gazes down from the casement at Barnes and Taylor. The Mayor signals to the throng, then retreats from the podium to greet President Ashton with a handshake. Barnes notices an ajar casement. A barrel flash brightens the casement, and the President stumbles back before tumbling. Taylor hollers to an astonished Barnes. Barnes glances back up. A whiskered young man rushes to the dais. Barnes tackles him. Barnes gazes down at the supine President. Taylor assists in carrying the President away. The President is loaded into an ambulance. The whiskered young man. They lead him off. An irritated expression on his face, Holden turns away. They look up upon hearing the distant detonation. Barnes notices the man in the plaid shirt. He dashes to him and seizes his camera. Barnes gestures. They reverse the camera in view. Both men gaze at the LCD display. Flames and dark smoke ascend into the sky. The smoke dissipates. Barnes is lying on the terrain. He regains consciousness. There is a scrape on his grimy face. Barnes pulls himself to his knees. Barnes struggles to stand. There are minor blazes all around. A man tosses a quilt over a woman whose garments are aflame. Barnes assesses the number of people lying hurt. Barnes remembers the barrel flashes in the casement. Across the square, Matthews, clutching a torso injury, attempts to sit up. Barnes dashes across to him, past the chaos of contorted metal crowd control obstacles. Barnes bends down. Holden staggers over. Matthews falls still. Holden shakes his head. Barnes gazes at his fallen companion. Holden looks up to observe the Spanish bearded officer with a firearm. Holden pursues the whiskered man who has sheathed his firearm. Barnes looks up as a GNN cameraman sprints past. Barnes reads the GNN emblem and bounds to his feet. He dashes to the GNN outside telecast vehicle and enters the studio. Barnes gazes at the array of screens. The director observes him. Barnes notices a still frame of him being shot. Barnes searches for the mobile phone. Rex observes as Barnes inputs numbers on his mobile phone. He speaks into his cuff microphone. He dials a number. The PA murmurs into her mobile phone. Barnes' eyes are affixed on the screen. Karen glances around and manually rewinds the tape control. Barnes looks intently at the display, his eyes unblinking. Barnes turns and rushes out of the vehicle. The events rewind. Barnes turning to Mathews. The detonation, the shooting. Taylor at Barnes' hotel entrance. The time on the digital clock shifts to noon. The whiskered man, Enrique, a handsome man in his 30s wearing a light open shirt over a dark tee shirt and with a bag over his shoulder, strides past the protestors on his way to the square."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He is looked down on from the window by Barnes and Taylor. The crowd is waved to by the Mayor, and President Ashton is then welcomed with a handshake by him. An open window is seen by Barnes. The window is illuminated by a muzzle flash, and the President is reeled back before falling by it. Taylor yells to Barnes, who is stunned. Barnes is looked back up at by him. A bearded young man is dashed to the podium by him. He is tackled by Barnes. The recumbent President is stared down at by Barnes. The President is helped to be carried away by Taylor. They load the President into an ambulance. They lead off the bearded young man. An exasperated look is on Holden's face as he turns away. They loop up upon hearing the distant explosion. The man in the checked shirt is seen by Barnes. He is run to, and his camera is grabbed by Barnes. A point is made by Barnes. The camera is rewound in vision by them. The LCD screen is stared at by both men. Flames and black smoke are rising into the air. The smoke is cleared. Barnes is found lying on the ground. Consciousness is regained by him. A scratch is on his grubby face. He hauls himself to his knees. Getting to his feet is struggled to be achieved by Barnes. Small fires are burning all around. A blanket is thrown over a woman whose clothes are in flames by a man. The number of people lying injured are taken in by Barnes. The muzzle flashes in the window are recalled by Barnes. Across the plaza, Matthews clutches a chest wound and tries to sit up. Barnes runs across to him, past the mess of twisted metal crowd control barriers. Down is bent by Barnes. Holden staggers over. Matthews is fallen still. His head is shaken by Holden. Barnes stares at his fallen colleague. Up is looked by Holden to see the Spanish bearded cop with a gun. The bearded man is chased after by Holden, who has holstered his gun. A GNN cameraman is looked up at by Barnes as he runs past. The GNN logo is read by Barnes, and he leaps to his feet. The GNN outside broadcast van is run to by him, and he enters the gallery. The bank of monitors is stared at by Barnes. Him is watched by the director. A still frame of Barnes being shot is seen by Barnes. The cell phone is searched for by him. Rex watches as numbers are keyed in by Barnes on his cell phone. His cuff mike is spoken into by him. A number is dialed by him. The PA whispers into her cellphone. Barnes' eyes are fixed on the monitor. Karen glances around and rewinds the tape control manually. The screen is looked at intently by Barnes, his eyes unblinking. Out of the van is turned and run by Barnes. The events are rewound. Matthews is turned to by Barnes. The explosion, the shooting. Taylor is at Barnes' hotel door. The time on the digital clock is moved to midday. The protestors are marched past by Enrique, a bearded man in his 30s, handsome, wearing a light open shirt over a dark tee shirt and with a bag over his shoulder, on his way to the plaza."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He looks down at Barnes and Taylor. The Mayor waves, then steps back to welcome President Ashton with a handshake. Barnes spots an open window. A muzzle flash appears, and the President reels back and falls. Taylor yells to a stunned Barnes, who looks up to see a bearded young man dashing to the podium. Barnes tackles him and stares at the fallen President. Taylor helps carry the President to an ambulance. The young man is led away. Exasperated, Holden turns away as they hear a distant explosion. Barnes sees a man in a checked shirt and grabs his camera. They rewind the footage on the LCD screen, revealing flames and smoke rising. Barnes regains consciousness, scratched and surrounded by small fires. He notices injured people and remembers the muzzle flashes. Across the plaza, Matthews, clutching a chest wound, tries to sit up. Barnes rushes past twisted barriers to him. Holden arrives as Matthews falls still. Holden spots a Spanish bearded cop with a holstered gun and chases him. Barnes sees a GNN cameraman, reads the logo, and rushes to the broadcast van. Inside, Barnes stares at monitors, watching a still of him getting shot. He searches for his cell phone and dials. The PA whispers into her cellphone. Barnes watches as Karen rewinds the tape. He runs out as events rewind: him turning to Matthews, the explosion, the shooting. Taylor at his hotel door. The clock shows midday as Enrique, a handsome man in his 30s, wearing a light shirt over a dark tee and carrying a bag, marches past protestors to the plaza."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He looks down from the window at Barnes and Taylor. The Mayor waves to the crowd, steps back, and shakes hands with President Ashton. Barnes notices an open window. A muzzle flash illuminates it, and the President collapses. Taylor yells at a shocked Barnes, who sees a bearded young man rush to the podium and tackles him. Barnes, stunned, watches the President being taken to an ambulance. The bearded man is led away. Holden turns away, frustrated, as an explosion echoes. Barnes spots a man in a checked shirt, grabs his camera, and rewinds it to see flames and smoke. As the smoke clears, Barnes regains consciousness on the ground, injured. Fires burn around him. A blanket is thrown over a woman in flames. Barnes notices the injured. Matthews tries to sit up, clutching a chest wound, as Barnes runs past barriers and bends to him. Holden arrives, but Matthews falls still. Holden shakes his head. They spot a Spanish bearded cop with a gun. Holden chases him. Barnes sees a GNN cameraman and runs to the GNN van, entering the gallery. He watches monitors and sees a still frame of him being shot. Barnes searches for his cell phone, dials a number, and speaks into his cuff mike. He watches the monitor as Karen rewinds the tape. Barnes analyzes the screen, then runs out. The events rewind: Barnes turning to Mathews, the explosion, and shooting. Taylor at Barnes' hotel door. The digital clock shows midday. Enrique, a bearded man in his 30s with a light open shirt over a dark tee and a bag, marches past protestors to the plaza."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He casts his gaze downward from the window, directing his attention to the bustling scene unfolding at the intersection of Barnes and Taylor. The Mayor, with a dignified air, waves cordially to the gathered crowd below, then carefully steps back from the prominent lectern, ready to extend a warm welcome to President Ashton with a firm handshake. Barnes observes an open window across the way. Suddenly, a startling muzzle flash momentarily illuminates the aperture, and the President reels backward as if struck, ultimately falling. Taylor urgently yells to a visibly stunned Barnes, who then looks back upward. A young man with a noticeable beard swiftly dashes toward the podium, full of intent. Barnes does not hesitate; he tackles the man to the ground with determination. Barnes then directs his gaze downward at the recumbent figure of the President. Taylor, without delay, steps in to assist in carrying the President away to safety. The President is quickly loaded into an awaiting ambulance. The bearded young man, apprehended, is led away by authorities. With an exasperated look etched upon his face, Holden turns his attention elsewhere. An audible explosion in the distance catches their attention, prompting all to look up. Barnes spots a man clad in a distinctive checked shirt. Barnes sprints toward him, seizing the man’s camera with urgency. He points emphatically, guiding the man to rewind the camera’s footage. Both men intently gaze at the LCD screen, captivated by the unfolding imagery. Flames and thick, black smoke begin rising ominously into the air. Once the smoke has cleared, we find Barnes lying prone on the ground, having regained consciousness. There is a noticeable scratch marking his otherwise grubby face. With effort, Barnes hauls himself up onto his knees, struggling against the chaos. He fights to get to his feet, surrounded by small fires scattered all around him. Nearby, a man throws a protective blanket over a woman whose clothing is aflame. Barnes takes a moment to comprehend the sheer number of people lying injured around him. He recalls the chilling muzzle flashes he witnessed in the window. Across the plaza, Matthews, clutching a wound in his chest, makes a desperate attempt to sit up. Barnes, propelled by urgency, runs across to him, navigating through the disarray of twisted metal and toppled crowd control barriers. As Barnes bends down, Holden staggers over to join him. Matthews falls still, unmoving. Holden, with a somber shake of his head, indicates the gravity of the situation. Barnes stands, transfixed, staring at his fallen colleague. Holden, as he raises his head, spots a Spanish bearded officer wielding a gun. Without further hesitation, Holden gives chase after the bearded man who has holstered his firearm. Barnes’ attention shifts as a GNN cameraman swiftly runs past him. Recognizing the GNN logo, Barnes leaps to his feet. He makes a dash toward the GNN outside broadcast van and hurriedly enters the gallery. Barnes stares intensely at the array of monitors in front of him. The director, sensing the gravity of the situation, watches him closely. Barnes zeroes in on a still frame showing the moment he was shot. He hurriedly searches for his cell phone. Rex observes as Barnes punches in numbers on his phone with quick precision. Speaking into his cuff mike, Barnes dials a number urgently. The PA, discreetly, whispers into her own cellphone. Barnes' eyes remain unwaveringly fixed on the monitor, absorbing every detail. Karen, with a cautious glance around, manually rewinds the tape control. Barnes watches the screen intently, his eyes never blinking. Instinctively, Barnes spins around and rushes out of the van. The sequence of events begins to rewind in his mind. Barnes turning toward Mathews. The explosion, the deafening sound of the shooting. The moment when Taylor knocks at Barnes' hotel door. The digital clock's display advances, indicating the time moving forward to midday. The bearded man, Enrique, a strikingly handsome figure in his 30s, distinctively dressed in a light open shirt layered over a dark tee shirt and carrying a bag nonchalantly over his shoulder, strides purposefully past the sea of protestors on his determined path toward the plaza."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He lowers his focus from his vantage point at the window, directing his attention with intensity to the lively and bustling scene unfolding at the dynamic intersection of Barnes and Taylor. The Mayor, exuding a dignified air of authority and importance, waves cordially to the assembled crowd gathered below, then steps back carefully from the prominent lectern, ready to graciously extend a warm and firm handshake as a welcoming gesture to President Ashton. Barnes notices an open window directly across the way. Suddenly and unexpectedly, a startling muzzle flash briefly illuminates the aperture, and the President reels backward as though struck by something unseen, ultimately collapsing. Taylor urgently calls out to a visibly stunned Barnes, who then shifts his gaze back upward. A young man with a noticeable beard swiftly dashes toward the podium, filled with intent and determination. Barnes, not wasting a moment, tackles the man to the ground with resolute determination. Barnes then directs his gaze downward at the recumbent figure of the President. Taylor, without delay or hesitation, steps in to assist in quickly carrying the President away to safety. The President is promptly loaded into an ambulance that awaits nearby. The bearded young man, apprehended by the authorities, is led away. With an exasperated expression etched unmistakably upon his face, Holden turns his attention to a different direction. Suddenly, an audible explosion in the distance seizes their attention, prompting all to look up in alarm. Barnes spots a man clad conspicuously in a distinctive checked shirt. Barnes sprints with urgency toward him, seizing the man’s camera with determination. He gestures emphatically, guiding the man to rewind the camera’s footage. Both men intently gaze at the small LCD screen, captivated by the unfolding imagery. Flames and thick, black smoke ominously begin to rise into the air. Once the smoke has dissipated, revealing the scene more clearly, we find Barnes lying prone on the ground, having regained consciousness. A noticeable scratch marks his otherwise grimy face. With effort, Barnes hauls himself up onto his knees, struggling against the surrounding chaos. He fights to get to his feet, finding himself surrounded by small fires scattered all around him. Nearby, a man throws a protective blanket over a woman whose clothing is aflame. Barnes takes a moment to fully comprehend the sheer number of people lying injured around him. He recalls with a chill the muzzle flashes he witnessed in the window. Across the plaza, Matthews, clutching a wound in his chest, makes a desperate attempt to sit up. Barnes, propelled by urgency and resolve, runs toward him, navigating through the disarray of twisted metal and toppled crowd control barriers. As Barnes bends down to help, Holden staggers over to join him. Matthews falls still, unmoving, indicating the severity of his condition. Holden, with a somber shake of his head, communicates the gravity of the situation. Barnes stands, transfixed and emotional, staring at his fallen colleague. Holden, as he raises his head, spots a Spanish bearded officer wielding a gun with intent. Without further hesitation, Holden gives chase after the bearded man, who has holstered his firearm. Barnes’ attention shifts as he notices a GNN cameraman swiftly running past him. Recognizing the GNN logo instantly, Barnes leaps to his feet. He makes a dash toward the GNN outside broadcast van and hurriedly enters the gallery inside. Barnes stares intensely and with focus at the array of monitors in front of him. The director, sensing the seriousness of the situation, watches him closely. Barnes zeroes in on a still frame showing the critical moment when he was shot. He hurriedly searches for his cell phone. Rex observes as Barnes punches in numbers with quick precision. Speaking into his cuff mike, Barnes dials a number urgently. The PA, discreetly, whispers into her own cellphone. Barnes’ eyes remain unwaveringly and intently fixed on the monitor, absorbing every detail it shows. Karen, with a cautious glance around, manually rewinds the tape control. Barnes watches the screen intently, his eyes never blinking or wavering. Instinctively, Barnes spins around and rushes out of the van with purpose. The sequence of events begins to rewind in his mind. Barnes turning toward Matthews, the explosion, the deafening sound of the shooting. The moment when Taylor knocks insistently at Barnes' hotel door. The digital clock's display advances forward, indicating the time moving steadily forward to midday. The bearded man, Enrique, a strikingly handsome figure in his 30s, distinctively dressed in a light open shirt layered over a dark tee shirt and carrying a bag nonchalantly over his shoulder, strides purposefully past the sea of protestors on his determined path toward the plaza."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He glances down from the window at the busy scene unfolding at Barnes and Taylor, taking in the activity below. The Mayor confidently waves to the enthusiastic crowd gathered around, a gesture that captures the moment's significance, before he steps back from the lectern with a practiced grace, turning to extend a welcoming handshake to President Ashton. Barnes's eyes catch on an open window in the nearby building, and in an instant, a bright muzzle flash lights up that very window, immediately followed by President Ashton reeling backward, the sudden force pushing him off balance until he collapses to the ground. Taylor's urgent shout jolts Barnes from his stunned state, and he quickly shifts his focus upward again. At that moment, a bearded young man makes a rapid dash towards the podium, prompting Barnes to spring into action; he lunges forward and tackles the man to the ground, ensuring he is subdued. With adrenaline still pumping, Barnes finds himself gazing down at the now recumbent President, processing the gravity of the situation before Taylor steps in, assisting with carrying the President away to safety. The urgency culminates as the President is then carefully loaded into an awaiting ambulance, while the bearded young man is apprehended and led away by authorities. In the midst of the chaos, Holden, exhibiting an exasperated demeanor, turns away from the scene. An unexpected loud explosion echoes in the distance, causing everyone, including Barnes, to instinctively look up. In the midst of this commotion, Barnes spots a man wearing a distinctive checked shirt and rushes over to him, seizing his camera. With urgency, Barnes gestures for the man to rewind the footage on the camera, both men intently staring at the LCD screen as it plays back. The screen displays a terrifying scene where flames and thick, black smoke billow upward into the sky, and as the smoke gradually dissipates, Barnes finds himself lying on the debris-laden ground. Regaining consciousness, he notices a painful scratch marking his dirt-streaked face, and with considerable effort, Barnes hauls himself up first onto his knees and then struggles laboriously to his feet. All around him, small fires stubbornly burn, casting a hellish glow, while a nearby man throws a life-saving blanket over a woman whose clothes have caught fire. As he surveys the devastation, Barnes is struck by the sobering number of people lying injured, and a flashback to the muzzle flashes in the window sears through his mind. Across the plaza, Barnes notices Matthews clutching his chest, wounded but determinedly attempting to sit up. Barnes races over to him, maneuvering through the mangled chaos of twisted metal barriers intended for crowd control. Reaching Matthews, Barnes bends down to offer assistance, just as Holden arrives, staggering over to the scene. But before any help can be given, Matthews succumbs to his injuries and falls still, prompting a sorrowful shake of Holden’s head. Barnes finds himself staring, grief-stricken, at his fallen colleague, a poignant moment interrupted when Holden’s gaze catches the movement of a Spanish bearded cop with a gun. Holden takes off in pursuit of the man as he holsters his weapon, leaving Barnes to look up just in time to see a GNN cameraman sprinting past. Reading the prominent GNN logo, Barnes is galvanized into action, leaping to his feet with renewed purpose. He darts towards the GNN outside broadcast van, barging into the gallery filled with equipment and monitors. Inside, Barnes’s eyes lock onto the bank of monitors, while the director observes him with a measured gaze. Amidst the visuals on the screens, Barnes identifies a still frame capturing the moment he was shot, escalating his urgency to search for his cell phone. As he locates the device, Rex watches closely, observing Barnes as he deliberately keys in numbers on his phone, simultaneously speaking into his cuff mike, creating a dual line of communication. He swiftly dials another number while a nearby PA discreetly whispers into her cellphone, and all the while, Barnes’s intense focus remains fixed on the monitor. Karen, sensing the tension, manually rewinds the tape control, allowing Barnes to fixate intently on the screen, his eyes transfixed and unblinking. Suddenly, Barnes pivots, propelled by a sudden realization, and dashes out of the van. As events rewind in his mind, he vividly recalls turning to Mathews, the explosion reverberating, and the shooting sequence. His memory travels back to Taylor at Barnes’ hotel door, the digital clock on the wall progressing to midday, and then the bearded man, Enrique, a striking figure in his 30s donning a light open shirt layered over a dark tee, strides with purpose past the assemblage of protestors, his bag slung over his shoulder, making his determined way to the plaza."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He observes the scene at Barnes and Taylor from the window as the Mayor welcomes President Ashton with a handshake. A window opens, and a muzzle flash signals the President being shot, causing him to collapse. Taylor shouts to a stunned Barnes, who then tackles a bearded young man rushing to the podium. As Taylor and others carry the President to an ambulance, the assailant is escorted away. Holden turns away in frustration, alerted by a distant explosion. Barnes sees a man in a checked shirt, seizes his camera, and both review footage showing flames and smoke. As the smoke clears, Barnes regains consciousness amidst small fires and injured people. He remembers the muzzle flash and notices Matthews, wounded and struggling. Barnes rushes to Matthews but watches him fall still as Holden arrives. Noticing a bearded cop with a gun, Holden pursues him while Barnes runs to the GNN broadcast van. Inside, Barnes scans the monitors, sees a still of the shooting, and uses his phone to communicate urgently. Karen rewinds the footage as Barnes intently watches the screen before sprinting out of the van. Events replay in his mind, including the explosion and shooting, as the story rewinds to Enrique, a handsome, bearded man in his 30s, approaching the plaza past protestors."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He looks down from the window at Barnes and Taylor, two undercover agents tasked with ensuring security at the event. The Mayor, a popular figure known for his community projects, waves to the crowd, then steps back from the lectern to welcome President Ashton, the nation's youngest elected leader in decades, with a handshake. Barnes, a seasoned agent, sees an open window across the street in the building known for housing antiques. A muzzle flash, indicative of a gunshot, illuminates the window, and the President reels back before falling, an eerie silence gripping the plaza. Taylor, known for his quick thinking under pressure, yells to a stunned Barnes. Barnes looks back up just as a bearded young man, later identified as an activist with ties to local protests, dashes to the podium. Barnes tackles him with the precision of years in the force. Barnes stares down at the recumbent President, his training kicking in amidst the chaos. Taylor helps carry the President away, weaving through the shocked crowd. The President is loaded into an ambulance, its sirens soon wailing through the city streets. The bearded young man, restrained now by security, is led away, confusion and anger etched on his face. An exasperated look on his face, Holden, a journalist with a keen nose for breaking news, turns away from the scene. They loop up, alerted by the distant explosion from a parked vehicle, now engulfed in flames. Barnes sees the man in the checked shirt, a known journalist from the local news station. He runs to him and grabs his camera, an older model with a large recording capacity. Barnes points, urgency in his voice. They rewind the camera in vision, a feature utilized for instant playback. Both men stare at the LCD screen, watching as flames and black smoke, a telltale sign of an incendiary device, rise into the air. The smoke clears, revealing the aftermath. Barnes is lying on the ground, debris scattered around him. He regains consciousness, groggy and disoriented, a scratch marking his dirt-streaked face. Barnes hauls himself to his knees, the ground rough beneath him. Barnes struggles to get to his feet, his legs shaky. There are small fires all around, the aftermath of the explosion. A man, a passerby moved by instinct, throws a blanket over a woman whose clothes are in flames, a heroic act amidst the chaos. Barnes takes in the number of people lying injured, the scale of the attack evident. Barnes recalls the muzzle flashes in the window, his training connecting the dots. Across the plaza, Matthews, a colleague in plainclothes, clutching a chest wound from the earlier gunfire, tries to sit up. Barnes runs across to him, dodging past the mess of twisted metal crowd control barriers, haphazard from the panic. Barnes bends down to assist. Holden, pale and shaken, staggers over, his camera still rolling. Matthews falls still, his breathing shallow. Holden shakes his head, a gesture of helplessness. Barnes stares at his fallen colleague, the weight of the day's events heavy on him. Holden looks up to see the Spanish bearded cop, rumored to be working undercover, with a gun now holstered. Holden chases after the bearded man, determination in his stride. Barnes looks up as a GNN cameraman, recognizable by his network's iconic blue vest, runs past. Barnes reads the GNN logo and leaps to his feet, a surge of realization hitting him. He runs to the GNN outside broadcast van and enters the gallery, the hub of live transmission. Barnes stares at the bank of monitors, a mosaic of live feeds. The director watches him, aware of the unfolding drama. Barnes sees a still frame of him being shot, a haunting image frozen in time. Barnes searches for the cell phone, his mind racing with options. Rex, a technician known for his expertise in crisis situations, watches as Barnes keys in numbers on his cell phone, the device a lifeline. He speaks into his cuff mike, a tool for discreet communication. He dials a number, urgency in his movements. The PA, a calm figure amidst the chaos, whispers into her cellphone, coordinating the next steps. Barnes' eyes are fixed on the monitor, scanning for details. Karen, the technical assistant, glances around and manually rewinds the tape control, her fingers deftly working. Barnes looks intently at the screen, his eyes unblinking, absorbing every detail. Barnes turns and runs out of the van, determination etched on his face. The events rewind in his mind: Barnes turning to Matthews, the explosion, the shooting, each event seared into his memory. Taylor at Barnes' hotel door, their last conversation replaying. The time on the digital clock moves to midday, the timestamp of tragedy. The bearded man, revealed to be Enrique, a handsome man in his 30s wearing a light open shirt over a dark tee shirt and with a bag over his shoulder, marches past the protestors on his way to the plaza, his steps purposeful and unyielding."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He looks down from the window at Barnes and Taylor. The Mayor waves to the crowd then steps back from the lectern to welcome President Ashton with a handshake. Barnes sees an open window. A muzzle flash illuminates the window and the President reels back before falling. Taylor yells to a stunned Barnes. Barnes looks back up. A bearded young man dashes to the podium. Barnes tackles him. Barnes stares down at the recumbent. President. Taylor helps carry the President away. The President is loaded into an ambulance. The bearded young man. They lead him off. An exasperated look on his face. Holden turns away. They loop up on hearing the distant explosion. Barnes sees the man in the checked shirt. He runs to him and grabs his camera. Barnes points. They rewind the camera in vision. Both men stare at the LCD screen. Flames and black smoke rise into the air. The smoke clears. Barnes is lying on the ground. He regains consciousness. There is a scratch on his grubby face. Barnes hauls himself to his knees. Barnes struggles to get to his feet. There are small fires all around. A man throws a blanket over a woman whose clothes are in flames. Barnes takes in the number of people lying injured. Barnes recalls the muzzle flashes in the window. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Across the plaza. Matthews clutching a chest wound tries to sit up. Barnes runs across to him past the mess of twisted metal. crowd control barriers. Barnes bends down. Holden staggers over. Matthews falls still. Holden shakes his head. Barnes stares at his fallen colleague. Holden looks up to see the Spanish bearded cop with a gun. Holden chases after the bearded man who has holstered his gun. Barnes looks up as a GNN cameraman runs past. Barnes reads the GNN logo and leaps to his feet. He runs to the GNN outside broadcast van and enters the gallery. Barnes stares at the bank of monitors. The director watches him. Barnes sees a still frame of him being shot. Barnes searches for the cell phone. Rex watches as Barnes keys in numbers on his cell phone. He speaks into his cuff mike. He dials a number. The PA whispers into her cellphone. Barnes' eyes are fixed on the monitor. Karen glances around and manually rewinds the tape control. Barnes looks intently at the screen his eyes unblinking. Barnes turns and runs out of the van. The events rewind. Barnes turning to Mathews. The explosion. the shooting Taylor at Barnes' hotel door. The time on the digital clock moves to midday. The bearded man. Enrique a handsome man in his 30s wearing a light open shirt over a dark tee shirt and with a bag over his shoulder marches past the protestors on his way to the plaza."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He looks down from the window at Barnes and Taylor. The Mayor waves to the crowd then steps back from the lectern to welcome President Ashton with a handshake. Barnes sees an open window. A muzzle flash illuminates the window and the President reels back before falling. Taylor yells to a stunned Barnes. Barnes looks back up. A bearded young man dashes to the podium. Barnes tackles him. Barnes stares down at the recumbent. President. Taylor helps carry the President away. The President is loaded into an ambulance. The bearded young man. They lead him off. An exasperated look on his face. Holden turns away. They loop up on hearing the distant explosion. Barnes sees the man in the checked shirt. He runs to him and grabs his camera. Barnes points. They rewind the camera in vision. Both men stare at the LCD screen. Flames and black smoke rise into the air. The smoke clears. Barnes is lying on the ground. He regains consciousness. There is a scratch on his grubby face. Barnes hauls himself to his knees. Barnes struggles to get to his feet. There are small fires all around. A man throws a blanket over a woman whose clothes are in flames. Barnes takes in the number of people lying injured. Barnes recalls the muzzle flashes in the window. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Across the plaza. Matthews clutching a chest wound tries to sit up. Barnes runs across to him past the mess of twisted metal. crowd control barriers. Barnes bends down. Holden staggers over. Matthews falls still. Holden shakes his head. Barnes stares at his fallen colleague. Holden looks up to see the Spanish bearded cop with a gun. Holden chases after the bearded man who has holstered his gun. Barnes looks up as a GNN cameraman runs past. Barnes reads the GNN logo and leaps to his feet. He runs to the GNN outside broadcast van and enters the gallery. Barnes stares at the bank of monitors. The director watches him. Barnes sees a still frame of him being shot. Barnes searches for the cell phone. Rex watches as Barnes keys in numbers on his cell phone. He speaks into his cuff mike. He dials a number. The PA whispers into her cellphone. Barnes' eyes are fixed on the monitor. Karen glances around and manually rewinds the tape control. Barnes looks intently at the screen his eyes unblinking. Barnes turns and runs out of the van. The events rewind. Barnes turning to Mathews. The explosion. the shooting Taylor at Barnes' hotel door. The time on the digital clock moves to midday. The bearded man. Enrique a handsome man in his 30s wearing a light open shirt over a dark tee shirt and with a bag over his shoulder marches past the protestors on his way to the plaza."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He looks down from the window at Barnes and Taylor. The Mayor waves to the crowd then steps back from the lectern to welcome President Ashton with a handshake. Barnes sees an open window. A muzzle flash illuminates the window and the President reels back before falling. Taylor yells to a stunned Barnes. Barnes looks back up. A bearded young man dashes to the podium. Barnes tackles him. Barnes stares down at the recumbent. President. Taylor helps carry the President away. The President is loaded into an ambulance. The bearded young man. They lead him off. An exasperated look on his face. Holden turns away. They loop up on hearing the distant explosion. Barnes searches for the cell phone. Rex watches as Barnes keys in numbers on his cell phone. He speaks into his cuff mike. He dials a number. The PA whispers into her cellphone. Barnes' eyes are fixed on the monitor. Karen glances around and manually rewinds the tape control. Barnes looks intently at the screen his eyes unblinking. Barnes turns and runs out of the van. The events rewind. Barnes turning to Mathews. The explosion. the shooting Taylor at Barnes' hotel door. The time on the digital clock moves to midday. The bearded man. Enrique a handsome man in his 30s wearing a light open shirt over a dark tee shirt and with a bag over his shoulder marches past the protestors on his way to the plaza."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He looks down from the window at Barnes and Taylor. The Mayor waves to the crowd then steps back from the lectern to welcome President Ashton with a handshake. Barnes sees an open window. A muzzle flash illuminates the window and the President reels back before falling. Taylor yells to a stunned Barnes. Barnes looks back up. A bearded young man dashes to the podium. The events rewind. Barnes turning to Mathews. The explosion. the shooting Taylor at Barnes' hotel door. The time on the digital clock moves to midday. The bearded man. Enrique a handsome man in his 30s wearing a light open shirt over a dark tee shirt and with a bag over his shoulder marches past the protestors on his way to the plaza."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "She peeks up from the mirror at Carter and Morgan. The Astronaut salutes the orchestra, then dances forward from the trampoline to greet Chef Bennett with a high-five. Carter hears a closed gate. A lightning bolt darkens the gate, and the Chef leaps forward before spinning. Morgan whispers to a confused Carter. Carter glances down. A bald old woman sprints to the gazebo. Carter hugs her. Carter frowns at the sitting Chef. Morgan assists in rolling the Chef away. The Chef is loaded onto a helicopter. The bald old woman. They pull her in. A joyful smile on her face, Spencer skips forward. They soar down on noticing the nearby transformation. Carter hears the woman in the polka-dot dress. She strolls to her and hugs her notebook. Carter gestures. They fast-forward the notebook in thought. Both women blink at the holographic display. Blossoms and golden mist descend into the sea. The mist settles. Carter is floating in the sky. She loses memory. There is a tear on her shiny shoe. Carter drags herself to her toes. Carter fights to stand upright. There are tiny plants everywhere. A woman tosses a basket over a child whose shoes are in ice. Carter notices the size of the flowers standing tall. Carter remembers the lightning bolts at the gate. Beside the fountain, Andrews, holding an ankle sprain, struggles to stand. Carter dances across to her, past the sea of melted glass garden gnomes. Carter stretches up. Spencer prances over. Andrews jumps up. Spencer nods her arms. Carter smiles at her flying companion. Spencer glances down to spot the Mexican bald dentist with a trumpet. Spencer follows the bald woman who has put aside her trumpet. Carter glances down as a CNN photographer strolls by. Carter reads the CNN emblem and springs to her hands. She strolls to the CNN small sound truck and leaves the studio. Carter smiles at the wall of speakers. The artist ignores her. Carter notices a moving image of her being hugged. Carter hunts for the recorder. Alex ignores as Carter types in symbols on her recorder. She sings into her wrist pen. She erases a letter. The DJ giggles into his typewriter. Carter's ears are stuck on the speaker. Susan peers up and automatically fast-forwards the disc slider. Carter grins brightly at the speaker, her ears twitching. Carter spins and strolls out of the studio. The landscapes fast-forward. Carter spinning to Andrews. The transformation, the hugging. Morgan at Carter's coffee shop counter. The time on the grandma clock flickers to midnight. The bald woman, Ernesto, a charming woman in her 60s wearing a heavy closed coat over a bright sweater and with a bag with her umbrella, floats past the artists on her way to the fountain."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Barnes observes Mayor welcoming President Ashton, who is then shot. A bearded young man rushes the podium, and Barnes tackles him. President Ashton is taken to an ambulance. A distant explosion is heard, and Barnes finds a cameraman to review footage of the chaos. Regaining consciousness amidst fires, Barnes tries to assist the injured, including Matthews, but Matthews succumbs to his wounds. Holden pursues a bearded cop wielding a gun while Barnes heads to a GNN van. There, he sees footage of himself being shot and urgently rewinds the events. The scene rewinds to Enrique, a man in his 30s, heading to the plaza with a bag, passing protestors."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Enrique a handsome man in his 30s wearing a light open shirt over a dark tee shirt and with a bag over his shoulder marches past the protestors on his way to the plaza The bearded man The time on the digital clock moves to midday the shooting Taylor at Barnes' hotel door The explosion Barnes turning to Mathews The events rewind Barnes turns and runs out of the van Barnes looks intently at the screen his eyes unblinking Karen glances around and manually rewinds the tape control Barnes' eyes are fixed on the monitor The PA whispers into her cellphone He dials a number He speaks into his cuff mike Rex watches as Barnes keys in numbers on his cell phone Barnes searches for the cell phone Barnes sees a still frame of him being shot The director watches him Barnes stares at the bank of monitors He runs to the GNN outside broadcast van and enters the gallery Barnes reads the GNN logo and leaps to his feet Barnes looks up as a GNN cameraman runs past Holden chases after the bearded man who has holstered his gun Holden looks up to see the Spanish bearded cop with a gun Barnes stares at his fallen colleague Holden shakes his head Matthews falls still Holden staggers over Barnes bends down crowd control barriers Barnes runs across to him past the mess of twisted metal Matthews clutching a chest wound tries to sit up Across the plaza Barnes recalls the muzzle flashes in the window Barnes takes in the number of people lying injured A man throws a blanket over a woman whose clothes are in flames There are small fires all around Barnes struggles to get to his feet Barnes hauls himself to his knees There is a scratch on his grubby face He regains consciousness Barnes is lying on the ground The smoke clears Flames and black smoke rise into the air Both men stare at the LCD screen They rewind the camera in vision Barnes points He runs to him and grabs his camera Barnes sees the man in the checked shirt They loop up on hearing the distant explosion Holden turns away An exasperated look on his face They lead him off The bearded young man The President is loaded into an ambulance Taylor helps carry the President away President Barnes stares down at the recumbent Barnes tackles him A bearded young man dashes to the podium Barnes looks back up Taylor yells to a stunned Barnes A muzzle flash illuminates the window and the President reels back before falling Barnes sees an open window The Mayor waves to the crowd then steps back from the lectern to welcome President Ashton with a handshake He looks down from the window at Barnes and Taylor"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The Mayor waves to the crowd then steps back from the lectern to welcome President Ashton with a handshake He looks down from the window at Barnes and Taylor A muzzle flash illuminates the window and the President reels back before falling Barnes sees an open window Barnes looks back up Taylor yells to a stunned Barnes Barnes tackles him A bearded young man dashes to the podium President Barnes stares down at the recumbent The President is loaded into an ambulance Taylor helps carry the President away They lead him off The bearded young man Holden turns away An exasperated look on his face Barnes sees the man in the checked shirt They loop up on hearing the distant explosion Barnes points He runs to him and grabs his camera Both men stare at the LCD screen They rewind the camera in vision The smoke clears Flames and black smoke rise into the air He regains consciousness Barnes is lying on the ground Barnes hauls himself to his knees There is a scratch on his grubby face There are small fires all around Barnes struggles to get to his feet Barnes takes in the number of people lying injured A man throws a blanket over a woman whose clothes are in flames Across the plaza Barnes recalls the muzzle flashes in the window Barnes runs across to him past the mess of twisted metal Matthews clutching a chest wound tries to sit up Barnes bends down crowd control barriers Matthews falls still Holden staggers over Barnes stares at his fallen colleague Holden shakes his head Holden chases after the bearded man who has holstered his gun Holden looks up to see the Spanish bearded cop with a gun Barnes reads the GNN logo and leaps to his feet Barnes looks up as a GNN cameraman runs past Barnes stares at the bank of monitors He runs to the GNN outside broadcast van and enters the gallery Barnes sees a still frame of him being shot The director watches him Rex watches as Barnes keys in numbers on his cell phone Barnes searches for the cell phone He dials a number He speaks into his cuff mike Barnes' eyes are fixed on the monitor The PA whispers into her cellphone Barnes looks intently at the screen his eyes unblinking Karen glances around and manually rewinds the tape control The events rewind Barnes turns and runs out of the van The explosion Barnes turning to Mathews The time on the digital clock moves to midday the shooting Taylor at Barnes' hotel door Enrique a handsome man in his 30s wearing a light open shirt over a dark tee shirt and with a bag over his shoulder marches past the protestors on his way to the plaza The bearded man"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Across the plaza Matthews clutching a chest wound tries to sit up Barnes runs across to him past the mess of twisted metal crowd control barriers Barnes bends down Holden staggers over Matthews falls still Holden shakes his head Barnes stares at his fallen colleague Holden looks up to see the Spanish bearded cop with a gun Holden chases after the bearded man who has holstered his gun Barnes looks up as a GNN cameraman runs past Barnes reads the GNN logo and leaps to his feet He runs to the GNN outside broadcast van and enters the gallery Barnes stares at the bank of monitors The director watches him Barnes sees a still frame of him being shot Barnes searches for the cell phone Rex watches as Barnes keys in numbers on his cell phone He speaks into his cuff mike He dials a number The PA whispers into her cellphone Barnes' eyes are fixed on the monitor Karen glances around and manually rewinds the tape control Barnes looks intently at the screen his eyes unblinking Barnes turns and runs out of the van The events rewind Barnes turning to Mathews The explosion the shooting Taylor at Barnes' hotel door The time on the digital clock moves to midday The bearded man Enrique a handsome man in his 30s wearing a light open shirt over a dark tee shirt and with a bag over his shoulder marches past the protestors on his way to the plaza He looks down from the window at Barnes and Taylor The Mayor waves to the crowd then steps back from the lectern to welcome President Ashton with a handshake Barnes sees an open window A muzzle flash illuminates the window and the President reels back before falling Taylor yells to a stunned Barnes Barnes looks back up A bearded young man dashes to the podium Barnes tackles him Barnes stares down at the recumbent President Taylor helps carry the President away The President is loaded into an ambulance The bearded young man They lead him off An exasperated look on his face Holden turns away They loop up on hearing the distant explosion Barnes sees the man in the checked shirt He runs to him and grabs his camera Barnes points They rewind the camera in vision Both men stare at the LCD screen Flames and black smoke rise into the air The smoke clears Barnes is lying on the ground He regains consciousness There is a scratch on his grubby face Barnes hauls himself to his knees Barnes struggles to get to his feet There are small fires all around A man throws a blanket over a woman whose clothes are in flames Barnes takes in the number of people lying injured Barnes recalls the muzzle flashes in the window"
        }
      ]
    }
  ]
}