{
  "ground_truth": "Enrique approaches a security checkpoint and a female officer, who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them, the short cropped-haired man walks away, and the two exchange looks as Enrique strides up to the pretty long-haired woman, Veronica. He grabs her hair and pushes her against a pillar; she holds his head. As she hugs him, he hands her her bag. Enrique reluctantly lets go of her hand and moves away, stopping to glance back. She blows him a kiss. Enrique turns and walks to the security barrier, where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern, and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation. The young man leaves her, and Enrique looks up as the Mayor finishes his introduction. President Ashton steps forward and raises his arms wide at his sides, then staggers back and falls. Enrique jumps up onto the podium and runs across it, only to be tackled by Barnes. Matthews and Holden lead Enrique away, as the man in the checked shirt videos it. Enrique spots Veronica striding through the crowd and watches her keenly. She catches sight of him and holds his gaze. His eyes move down from her face to the bag he brought through security for her, which she tosses under the podium. An agent leads Enrique away, but Enrique elbows him in the face and takes the agent's gun. Smoke fills the plaza as Enrique sits up, and Holden, leaning beside the fallen Mathews alongside Barnes, glances across and sees him. Enrique holsters the agent's gun, and Holden gives chase. Enrique rounds a corner with Holden and another agent in pursuit, and Holden shoots in the air. Enrique rushes out into the street, darting into the road as an ambulance approaches, where Veronica sits in the passenger seat. He stands gooping and is hit by a car, but he gets to his feet and runs. Holden and the second agent, Parsons, chase Enrique into an arcade, where he shoves people out of his way. Enrique sprints upstairs and dashes into an apartment building, with residents on the staircase delaying the secret service agents. Enrique runs onto a balcony and leaps from it into a courtyard, and Holden and Parsons reach the balcony railing. They race along the balcony as Enrique dashes away from the apartment building and sprints along the street, looking behind constantly. Dodging traffic, he crosses the road until he is hit by another car, then runs across a road to an underpass carrying highway traffic.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Enrique advances toward a safety checkpoint and a female officer, who summons next. He observes a pair murmuring and keeps his gaze on the youthful pair. As he nears them, the brief clipped-haired man departs, and the two swap glances as Enrique strides up to the attractive long-haired woman, Veronica. He seizes her tresses and thrusts her against a column; she clutches his head. As she embraces him, he hands her her sack. Enrique unwillingly releases her hand and moves away, pausing to look back. She blows him a kiss. Enrique turns and walks to the safety barrier, where he shows his ID and is permitted through. He marches through the platform as the Mayor shakes the President's hand. The Mayor steps to the lectern, and Spanish banners are waved. Enrique rubs his hands together and ponders Veronica's meeting. The youthful man leaves her, and Enrique glances up as the Mayor concludes his introduction. President Ashton steps forward and raises his arms wide at his sides, then reels back and collapses. Enrique springs up onto the platform and runs across it, only to be tackled by Barnes. Matthews and Holden guide Enrique away, as the man in the checked shirt records it. Enrique spots Veronica striding through the throng and watches her intently. She catches sight of him and holds his stare. His gaze moves down from her face to the sack he brought through safety for her, which she pitches under the platform. An agent guides Enrique away, but Enrique elbows him in the face and seizes the agent's weapon. Smoke fills the plaza as Enrique sits up, and Holden, leaning beside the fallen Mathews alongside Barnes, glances across and sees him. Enrique holsters the agent's weapon, and Holden follows. Enrique rounds a corner with Holden and another agent in pursuit, and Holden fires in the air. Enrique rushes out into the street, darting into the road as an ambulance nears, where Veronica sits in the passenger spot. He stands dazed and is struck by a vehicle, but he gets to his feet and runs. Holden and the second agent, Parsons, pursue Enrique into an arcade, where he pushes people out of his way. Enrique sprints upstairs and dashes into an apartment edifice, with inhabitants on the staircase delaying the secret service agents. Enrique runs onto a balcony and leaps from it into a courtyard, and Holden and Parsons reach the balcony railing. They race along the balcony as Enrique dashes away from the apartment edifice and sprints along the street, glancing behind continually. Dodging traffic, he crosses the road until he is struck by another vehicle, then runs across a road to an underpass carrying highway traffic."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Enrique is approached by a security checkpoint and called next by a female officer. A couple is noticed by him whispering, and his eyes are kept on the young couple. As they are approached by him, the short cropped-haired man is walked away by himself, and looks are exchanged by the two as the pretty long-haired woman, Veronica, is approached by Enrique striding up. Her hair is grabbed by him, and she is pushed against a pillar; his head is held by her. As he is hugged by her, her bag is handed to her by him. Her hand is reluctantly let go by Enrique, and away he moves, stopping to glance back. A kiss is blown to him by her. The security barrier is turned to and walked to by Enrique, where his ID is shown and he is allowed through. The podium is marched through by him as the Mayor's hand is shaken by the President. The lectern is gone to by the Mayor, and Spanish flags wave. His palms are rubbed together by Enrique, and he reflects on Veronica's assignation. Her is left by the young man, and up Enrique looks as the Mayor finishes his introduction. President Ashton steps forward, raises his arms wide at his sides, then staggers back and falls. The podium is jumped up onto and run across by Enrique, only for him to be tackled by Barnes. Matthews and Holden lead away Enrique, as it is videoed by the man in the checked shirt. Veronica is spotted striding through the crowd by Enrique, and she is watched keenly by him. She catches sight of him and his gaze is held by her. Her face is moved down from by his eyes to the bag brought through security for her by him, which is tossed under the podium by her. Enrique is led away by an agent, but the agent is elbowed in the face by Enrique, and the agent's gun is taken by him. Smoke fills the plaza, and Enrique sits up as Holden, leaning beside the fallen Mathews alongside Barnes, glances across and sees him. The agent's gun is holstered by Enrique, and Holden gives chase. A corner is rounded by Enrique with Holden and another agent in pursuit, and a shot is fired in the air by Holden. The street is rushed out into by Enrique, darting into the road as an ambulance approaches, where Veronica sits in the passenger seat. He is gooped by himself and hit by a car, but his feet are gotten to, and he runs. Enrique is chased by Holden and the second agent, Parsons, into an arcade, where people are shoved out of his way by him. Upstairs is sprinted by Enrique, and an apartment building is dashed into by him, with the secret service agents delayed by residents on the staircase. A balcony is run onto by Enrique, and a leap is taken from it into a courtyard by him, and the balcony railing is reached by Holden and Parsons. The balcony is raced along as Enrique is dashed away from the apartment building and the street is sprinted along by him, looking constantly behind. Traffic is dodged by him, and the road is crossed until hit by another car, then a road is run across by him to an underpass carrying highway traffic."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Enrique approaches a security checkpoint where a female officer calls him next. He notices a couple whispering and keeps his eyes on them. As he nears, the short-haired man walks away, and Enrique approaches the pretty long-haired woman, Veronica. He grabs her hair, pushes her against a pillar, and hands her her bag. Reluctantly, he lets go of her hand and moves away, glancing back as she blows him a kiss. Enrique proceeds to the security barrier, shows his ID, and is allowed through. He marches to the podium as the Mayor shakes the President's hand. Spanish flags wave as Enrique reflects on Veronica's meeting. The young man leaves her, and Enrique looks up as the Mayor finishes his introduction. President Ashton steps forward, raises his arms, then staggers and falls. Enrique jumps onto the podium but is tackled by Barnes. Matthews and Holden lead him away, while a man in a checked shirt videos it. Enrique spots Veronica in the crowd, watching her keenly. She holds his gaze and tosses the bag he brought through security under the podium. An agent leads Enrique away, but he elbows the agent, taking his gun. Smoke fills the plaza as Enrique sits up, and Holden sees him. Enrique holsters the gun, and Holden gives chase. Enrique rounds a corner with Holden and another agent in pursuit, and Holden fires into the air. Enrique rushes into the street, darting into the road as an ambulance approaches with Veronica in the passenger seat. He is hit by a car but gets up and runs. Holden and agent Parsons chase him into an arcade, where he shoves people aside. Enrique sprints upstairs into an apartment building, with residents delaying the agents. He runs onto a balcony, leaps into a courtyard, and Holden and Parsons reach the railing. They race along the balcony as Enrique dashes away, constantly looking back. Dodging traffic, he crosses the road, is hit by another car, then runs to an underpass carrying highway traffic."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Enrique approaches a security checkpoint, noticing a whispering couple. As he nears, the man leaves, and Enrique approaches the woman, Veronica. He grabs her hair, pushes her against a pillar, and hands her a bag. She blows him a kiss as he moves away. At the security barrier, Enrique shows his ID and is allowed through. He watches the Mayor shake the President's hand and reflects on Veronica. The President steps forward, staggers, and falls. Enrique rushes the podium but is tackled by Barnes. Matthews and Holden lead him away as a man videos it. Enrique spots Veronica, who tosses the bag under the podium. An agent leads Enrique away, but he elbows the agent, takes his gun, and smoke fills the plaza. Holden sees Enrique, who holsters the gun and runs. Holden and another agent chase him. Enrique darts into the road, is hit by a car, but continues running. Holden and Parsons pursue him into an arcade. Enrique sprints upstairs, leaps from a balcony, and escapes. He dodges traffic, is hit by another car, and runs to an underpass."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Enrique makes his way toward a security checkpoint, where a female officer is calling for the next person in line. As he approaches, he notices a young couple nearby, whispering to each other, and he keeps his eyes fixed on them. As he draws closer, the man with short, cropped hair walks away, and the two exchange meaningful looks. Enrique strides confidently up to the attractive woman with long hair, named Veronica. In a sudden move, he grabs her hair and pushes her against a nearby pillar, while she holds onto his head. As they embrace, he discreetly hands her a bag. With a sense of reluctance, Enrique releases her hand and begins to move away, pausing momentarily to glance back at her. She responds by blowing him a kiss. Enrique then turns and proceeds to the security barrier, where he presents his ID and is granted passage through. He marches forward to the podium area, where the Mayor is in the process of shaking hands with the President. The Mayor then steps up to the lectern, and Spanish flags are waved enthusiastically by the crowd. Enrique rubs his palms together, reflecting on his recent encounter with Veronica. Meanwhile, the young man departs from her side, and Enrique looks up just as the Mayor concludes his introduction. President Ashton steps forward, raising his arms wide at his sides, but suddenly staggers backward and collapses. Reacting quickly, Enrique jumps up onto the podium and runs across it, only to be tackled by Barnes. Matthews and Holden then lead Enrique away, while a man in a checked shirt captures the scene on video. Enrique spots Veronica making her way through the crowd and watches her intently. She notices him and holds his gaze, and his eyes drift down from her face to the bag he had brought through security for her, which she now tosses under the podium. An agent begins to lead Enrique away, but Enrique elbows the agent in the face and seizes the agent's gun. Smoke begins to fill the plaza as Enrique sits up, and Holden, who is leaning beside the fallen Mathews alongside Barnes, glances across and sees him. Enrique holsters the agent's gun, prompting Holden to give chase. Enrique rounds a corner with Holden and another agent in hot pursuit, and Holden fires a shot into the air. Enrique rushes out into the street, darting into the road just as an ambulance approaches, with Veronica seated in the passenger seat. He stands momentarily, only to be struck by a car, but he quickly gets to his feet and continues running. Holden and the second agent, Parsons, pursue Enrique into an arcade, where he shoves people out of his path. Enrique sprints upstairs and dashes into an apartment building, where residents on the staircase slow down the secret service agents. Enrique makes his way onto a balcony and leaps from it into a courtyard below, with Holden and Parsons reaching the balcony railing just in time to see him. They race along the balcony as Enrique dashes away from the apartment building and sprints along the street, constantly looking over his shoulder. Dodging traffic, he crosses the road until he is struck by another car, then continues running across a road to an underpass carrying highway traffic."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Enrique steadily makes his way toward a security checkpoint, where a female officer is calling out for the next person in line to step forward. As he walks in that direction, he becomes aware of a young couple standing nearby, whispering softly to each other, and he keeps his eyes sharply fixed on them. As he draws even closer, the man with short, cropped hair suddenly walks away, and the two exchange a series of meaningful looks. Enrique strides confidently up to the attractive woman with long, flowing hair, who he knows is named Veronica. In a sudden move, he grabs her hair and pushes her firmly against a nearby pillar, while she simultaneously holds onto his head. As they embrace in this manner, he discreetly hands her a bag. With a sense of reluctance, Enrique releases her hand and begins to move away, pausing momentarily to glance back at her, taking in her presence one last time. She responds by blowing him a tender kiss. Enrique then turns and makes his way to the security barrier, where he presents his identification and is granted permission to pass through. He continues marching forward to the podium area, where the Mayor is in the process of shaking hands with the President. The Mayor then steps up to the lectern, and the crowd waves Spanish flags with enthusiastic fervor. Enrique rubs his palms together, lost in thought as he reflects on his recent encounter with Veronica. Meanwhile, the young man departs from her side, and Enrique looks up just as the Mayor finishes delivering his introduction. President Ashton steps forward, raising his arms wide and confidently at his sides, but suddenly, he staggers backward and collapses without warning. Reacting with remarkable quickness, Enrique leaps up onto the podium and runs across it, only to be tackled forcefully by Barnes. Matthews and Holden then proceed to lead Enrique away, while a man in a checked shirt captures the unfolding scene on video. Enrique spots Veronica making her way through the crowd, and he watches her intently, not tearing his gaze away. She notices him and holds his gaze, and his eyes drift down from her face to the bag he had managed to bring through security for her, which she now tosses under the podium. An agent begins to lead Enrique away, but Enrique swiftly elbows the agent in the face and seizes the agent's gun. Smoke begins to fill the plaza as Enrique sits up, and Holden, who is leaning beside the fallen Mathews alongside Barnes, glances across and catches sight of him. Enrique quickly holsters the agent's gun, prompting Holden to give chase. Enrique rounds a corner with Holden and another agent in hot pursuit, and Holden fires a shot into the air to warn. Enrique rushes into the street, darting into the road just as an ambulance approaches, with Veronica seated calmly in the passenger seat. He stands momentarily, only to be struck by a car, but he quickly regains his footing and continues running. Holden and the second agent, Parsons, pursue Enrique into an arcade full of people, where he shoves bystanders out of his path. Enrique sprints upstairs in the arcade and dashes into an apartment building, where residents lingering on the staircase slow down the progress of the secret service agents. Enrique makes his way onto a balcony and bravely leaps from it into a courtyard below, with Holden and Parsons arriving at the balcony railing just in time to see him vanish into the distance. They race along the balcony as Enrique dashes away from the apartment building and sprints along the busy street, constantly looking anxiously over his shoulder. Dodging oncoming traffic, he dashes across the road until he is once again struck by a car, then continues running across the road to an underpass carrying the steady flow of highway traffic."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Enrique approaches the security checkpoint with a steady pace, his eyes scanning the area until they land on a female officer who calls for the next person in line. As he waits, he notices a couple nearby, whispering to each other, and his gaze lingers on the young couple, observing their interaction. As he moves closer to them, the man with short cropped hair suddenly walks away, leaving Enrique and the woman to exchange meaningful looks. With a determined stride, Enrique approaches the pretty long-haired woman, Veronica, and without hesitation, he reaches out to grab her hair, pushing her gently but firmly against a nearby pillar. In response, she wraps her arms around his head, pulling him closer in an embrace. As they hold each other, Enrique discreetly hands her a bag, which she accepts. Reluctantly, he releases her hand, stepping back and pausing momentarily to glance back at her. In a silent farewell, she blows him a kiss, and with a sense of resolve, Enrique turns away and heads towards the security barrier. There, he presents his ID to the officer, who examines it before allowing him to pass through. With a purposeful march, Enrique makes his way to the podium, where he witnesses the Mayor shaking hands with the President. The Mayor then steps up to the lectern, and the air is filled with the sight of Spanish flags waving enthusiastically. As Enrique rubs his palms together, he reflects on his recent encounter with Veronica, his mind momentarily drifting back to their assignation. Meanwhile, the young man who was with Veronica earlier leaves her side, and Enrique's attention is drawn back to the present as he looks up just in time to see the Mayor concluding his introduction. President Ashton steps forward, raising his arms wide at his sides in a gesture of acknowledgment, but suddenly, he staggers backward and collapses. Reacting swiftly, Enrique jumps onto the podium and sprints across it, only to be tackled by Barnes, who intercepts him. Matthews and Holden quickly move in, taking hold of Enrique and leading him away, while a man in a checked shirt captures the scene on video. As Enrique is being escorted, he spots Veronica moving purposefully through the crowd, and he watches her intently. Their eyes meet, and she holds his gaze, prompting his attention to shift from her face to the bag he had brought through security for her, which she now tosses under the podium. An agent attempts to lead Enrique away, but he reacts by elbowing the agent in the face and seizing the agent's gun. Amidst the chaos, smoke begins to fill the plaza, and Enrique sits up, taking in the scene around him. Nearby, Holden, leaning beside the fallen Mathews alongside Barnes, notices Enrique's actions. Enrique quickly holsters the agent's gun, prompting Holden to give chase. Enrique rounds a corner with Holden and another agent, Parsons, in hot pursuit, and as they close in, Holden fires a warning shot into the air. Undeterred, Enrique rushes out into the street, weaving through the traffic as an ambulance approaches, inside which Veronica sits in the passenger seat. In a moment of distraction, he stands gaping and is struck by a car, but he quickly regains his footing and continues to run. Holden and Parsons persist in their chase, following Enrique into an arcade where he forcefully shoves people aside to clear his path. With urgency, Enrique sprints upstairs, bursting into an apartment building where the presence of residents on the staircase momentarily hinders the secret service agents. Seizing the opportunity, Enrique races onto a balcony and, without hesitation, leaps from it into a courtyard below. Holden and Parsons reach the balcony railing just in time to see him land and continue his escape. They race along the balcony, determined to catch up, as Enrique dashes away from the apartment building and sprints along the street, constantly glancing over his shoulder to gauge the distance between him and his pursuers. Navigating through the traffic, he attempts to cross the road but is struck by another car. Undeterred, he quickly recovers and runs across the road, heading towards an underpass that carries highway traffic, determined to evade capture."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Enrique approaches a security checkpoint, noticing a couple whispering nearby. As he nears them, the man walks away, and Enrique exchanges looks with the woman, Veronica. He grabs her hair, pushes her against a pillar, and hands her a bag as they embrace. After a reluctant farewell, Enrique proceeds to the security barrier, shows his ID, and is allowed through. He moves to the podium where the Mayor shakes the President's hand and begins his introduction. Reflecting on his encounter with Veronica, Enrique watches as President Ashton steps forward, raises his arms, then staggers and falls. Enrique leaps onto the podium but is tackled by Barnes. As Matthews and Holden lead him away, Enrique spots Veronica in the crowd, noting the bag he brought for her, which she tosses under the podium. An agent tries to lead Enrique away, but he elbows the agent, takes his gun, and holsters it. Smoke fills the plaza, and Holden, seeing Enrique, gives chase. Enrique runs into the street, dodging traffic, and is hit by a car but continues running. Holden and Parsons pursue him into an arcade, where Enrique shoves through the crowd, sprints upstairs, and enters an apartment building. Residents delay the agents as Enrique leaps from a balcony into a courtyard. Holden and Parsons reach the balcony railing and race along it as Enrique dashes away, constantly looking back. He dodges traffic, crosses a road, and is hit by another car before running to an underpass carrying highway traffic."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Enrique approaches a security checkpoint at a bustling international airport known for its stringent safety protocols and a female officer, who calls next. He notices a couple whispering, their suspicious behavior drawing his attention, and keeps his eyes on the young couple. As he approaches them, the short cropped-haired man, who had been nervously scanning the area, walks away, and the two exchange looks as Enrique strides up to the pretty long-haired woman, Veronica, a known associate in his covert activities. He grabs her hair and pushes her against a pillar; she holds his head as if they were engaged in an intimate moment to avoid suspicion. As she hugs him, he hands her her bag that contains undisclosed but crucial items. Enrique reluctantly lets go of her hand and moves away, stopping to glance back. She blows him a kiss as a sign that their plan is on track. Enrique turns and walks to the security barrier, where he shows his forged ID, expertly crafted, and is allowed through. He marches through the podium at a high-profile political event as the Mayor, renowned for his progressive policies, shakes the President's hand. The Mayor goes to the lectern, and Spanish flags, symbols of national pride, are waved by the enthusiastic crowd. Enrique rubs his palms together and reflects on Veronica's assignation, a critical part of their intricate scheme. The young man leaves her, and Enrique looks up as the Mayor finishes his introduction, a customary speech praising bilateral relations. President Ashton, a key figure in international diplomacy, steps forward and raises his arms wide at his sides, then staggers back and falls amidst gasps from the audience. Enrique jumps up onto the podium, a move premeditated for its strategic advantage, and runs across it, only to be tackled by Barnes, a seasoned Secret Service agent. Matthews and Holden, part of the security detail, lead Enrique away, as the man in the checked shirt, a journalist capturing the unfolding chaos, videos it. Enrique spots Veronica striding through the crowd, her demeanor calm despite the commotion, and watches her keenly. She catches sight of him and holds his gaze. His eyes move down from her face to the bag he brought through security for her, understanding its significant contents, which she tosses under the podium as part of their planned operation. An agent leads Enrique away, but Enrique, demonstrating his martial arts training, elbows him in the face and takes the agent's gun. Smoke, a result of a distraction tactic used in emergencies, fills the plaza as Enrique sits up, and Holden, leaning beside the fallen Mathews alongside Barnes, glances across and sees him. Enrique holsters the agent's gun with practised ease, and Holden gives chase, driven by his duty to ensure public safety. Enrique rounds a corner with Holden and another agent in pursuit, and Holden shoots in the air, a warning shot to disperse the crowd and prevent further harm. Enrique rushes out into the street, darting into the road as an ambulance, coincidentally connected to their escape plan, approaches, where Veronica sits in the passenger seat. He stands gooping, momentarily disoriented, and is hit by a car, a likely result of the chaotic scene, but he miraculously gets to his feet and runs. Holden and the second agent, Parsons, chase Enrique into an arcade, where he shoves people out of his way, causing pandemonium in the crowded space. Enrique sprints upstairs and dashes into an apartment building, the structure's labyrinthine layout offering temporary cover, with residents on the staircase delaying the Secret Service agents. Enrique runs onto a balcony and leaps from it into a courtyard, a bold yet necessary move to evade capture, and Holden and Parsons reach the balcony railing. They race along the balcony, their urgency fueled by Enrique's notoriety, as Enrique dashes away from the apartment building and sprints along the street, looking behind constantly to gauge the distance between him and his pursuers. Dodging traffic, he crosses the road until he is hit by another car, a serendipitous event that slows him down momentarily, then runs across a road to an underpass carrying highway traffic, using it as a temporary shield against his relentless pursuers."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Enrique approaches a security checkpoint and a female officer who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them the short croppedhaired man walks away and the two exchange looks as Enrique strides up to the pretty longhaired woman Veronica. He grabs her hair and pushes her against a pillar. she holds his head. As she hugs him he hands her her bag. Enrique reluctantly let us go of her hand and moves away stopping to glance back. She blows him a kiss. Enrique turns and walks to the security barrier where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation. The young man leaves her and Enrique looks up as the Mayor finishes his introduction. President Ashton steps forward and raises his arms wide at his sides then staggers back and falls. Enrique jumps up onto the podium and runs across it only to be tackled by Barnes. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Matthews and Holden lead Enrique away as the man in the checked shirt videos it. Enrique spots Veronica striding through the crowd and watches her keenly. She catches sight of him and holds his gaze. His eyes move down from her face to the bag he brought through security for her which she tosses under the podium. An agent leads Enrique away but Enrique elbows him in the face and takes the agent's gun. Smoke fills the plaza as Enrique sits up and Holden leaning beside the fallen Mathews alongside. Barnes glances across and sees him. Enrique holsters the agent's gun and Holden gives chase. Enrique rounds a corner with Holden and another agent in pursuit and Holden shoots in the air. Enrique rushes out into the street darting into the road as an ambulance approaches where Veronica sits in the passenger seat. He stands gooping and is hit by a car but he gets to his feet and runs. Holden and the second agent Parsons chase Enrique into an arcade where he shoves people out of his way. Enrique sprints upstairs and dashes into an apartment building with residents on the staircase delaying the secret service agents. Enrique runs onto a balcony and leaps from it into a courtyard and Holden and Parsons reach the balcony railing. They race along the balcony as Enrique dashes away from the apartment building and sprints along the street looking behind constantly. Dodging traffic he crosses the road until he is hit by another car then runs across a road to an underpass carrying highway traffic."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Enrique approaches a security checkpoint and a female officer who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them the short croppedhaired man walks away and the two exchange looks as Enrique strides up to the pretty longhaired woman Veronica. He grabs her hair and pushes her against a pillar. she holds his head. As she hugs him he hands her her bag. Enrique reluctantly let us go of her hand and moves away stopping to glance back. She blows him a kiss. Enrique turns and walks to the security barrier where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation. The young man leaves her and Enrique looks up as the Mayor finishes his introduction. President Ashton steps forward and raises his arms wide at his sides then staggers back and falls. Enrique jumps up onto the podium and runs across it only to be tackled by Barnes. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Matthews and Holden lead Enrique away as the man in the checked shirt videos it. Enrique spots Veronica striding through the crowd and watches her keenly. She catches sight of him and holds his gaze. His eyes move down from her face to the bag he brought through security for her which she tosses under the podium. An agent leads Enrique away but Enrique elbows him in the face and takes the agent's gun. Smoke fills the plaza as Enrique sits up and Holden leaning beside the fallen Mathews alongside. Barnes glances across and sees him. Enrique holsters the agent's gun and Holden gives chase. Enrique rounds a corner with Holden and another agent in pursuit and Holden shoots in the air. Enrique rushes out into the street darting into the road as an ambulance approaches where Veronica sits in the passenger seat. He stands gooping and is hit by a car but he gets to his feet and runs. Holden and the second agent Parsons chase Enrique into an arcade where he shoves people out of his way. Enrique sprints upstairs and dashes into an apartment building with residents on the staircase delaying the secret service agents. Enrique runs onto a balcony and leaps from it into a courtyard and Holden and Parsons reach the balcony railing. They race along the balcony as Enrique dashes away from the apartment building and sprints along the street looking behind constantly. Dodging traffic he crosses the road until he is hit by another car then runs across a road to an underpass carrying highway traffic."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Enrique approaches a security checkpoint and a female officer who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them the short croppedhaired man walks away and the two exchange looks as Enrique strides up to the pretty longhaired woman Veronica. He grabs her hair and pushes her against a pillar. she holds his head. As she hugs him he hands her her bag. Enrique reluctantly let us go of her hand and moves away stopping to glance back. She blows him a kiss. Enrique rounds a corner with Holden and another agent in pursuit and Holden shoots in the air. Enrique rushes out into the street darting into the road as an ambulance approaches where Veronica sits in the passenger seat. He stands gooping and is hit by a car but he gets to his feet and runs. Holden and the second agent Parsons chase Enrique into an arcade where he shoves people out of his way. Enrique sprints upstairs and dashes into an apartment building with residents on the staircase delaying the secret service agents. Enrique runs onto a balcony and leaps from it into a courtyard and Holden and Parsons reach the balcony railing. They race along the balcony as Enrique dashes away from the apartment building and sprints along the street looking behind constantly. Dodging traffic he crosses the road until he is hit by another car then runs across a road to an underpass carrying highway traffic."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Enrique approaches a security checkpoint and a female officer who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them the short croppedhaired man walks away and the two exchange looks as Enrique strides up to the pretty longhaired woman Veronica. Enrique sprints upstairs and dashes into an apartment building with residents on the staircase delaying the secret service agents. Enrique runs onto a balcony and leaps from it into a courtyard and Holden and Parsons reach the balcony railing. They race along the balcony as Enrique dashes away from the apartment building and sprints along the street looking behind constantly. Dodging traffic he crosses the road until he is hit by another car then runs across a road to an underpass carrying highway traffic."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Giselle meanders toward a garden gate and a male gardener, who whistles softly. She overhears a trio singing and keeps her gaze on the middle-aged trio. As she meanders toward them, the tall, curly-haired woman dances away, and the group exchanges frowns as Giselle trudges up to the handsome, short-bearded man, Leonardo. She tugs his scarf and pulls him toward a swing; he pats her shoulder. As he spins her, she passes him his umbrella. Giselle hesitantly loosens her grip on his elbow and drifts away, pausing to peek back. He winks at her. Giselle pivots and tiptoes to the garden gate, where she displays her bracelet and is ushered out. She skips through the pavilion as the Captain salutes the Chancellor. The Captain leaps to the pulpit, and French kites flutter. Giselle claps her fingers together and dwells on Leonardo's interplay. The middle-aged woman departs, and Giselle glances sideways as the Captain concludes his monologue. Chancellor Brooks steps back and waves his hands high above his head, then slips forward and collapses. Giselle leaps onto the pavilion and slides across it, only to be tripped by Carter. Wilson and Jordan escort Giselle away, as the woman in the striped dress photographs it. Giselle glimpses Leonardo meandering through the throng and observes him curiously. He catches sight of her and holds her stare. Her focus drifts down from his hat to the umbrella she handed over at the gate, which he rolls under the pavilion. A guide ushers Giselle away, but Giselle nudges him in the stomach and grabs the guide's umbrella. Fog envelops the meadow as Giselle lies down, and Jordan, crouching beside the toppled Wilson alongside Carter, peers over and notices her. Giselle stows the guide's umbrella, and Jordan pursues swiftly. Giselle veers around a hedge with Jordan and another guide in pursuit, and Jordan whistles in the woods. Giselle scampers out into the field, darting into the bushes as a truck approaches, where Leonardo reclines in the driver's seat. She stands pondering and is hit by a bicycle, but she rises and darts. Jordan and the second guide, Reynolds, chase Giselle into a market, where she maneuvers past visitors. Giselle sprints through corridors and dashes into a cottage, with relatives on the staircase blocking the park rangers. Giselle rushes onto a terrace and dives from it into a lawn, and Jordan and Reynolds reach the terrace edge. They scramble along the terrace as Giselle rushes away from the cottage and dashes along the path, glancing backward continually. Dodging carriages, she traverses the trail until she is tripped by another bicycle, then rushes through an alley to an overpass carrying coastal walkers."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Enrique approaches a security checkpoint, observing a whispering couple. As the man leaves, Enrique confronts the woman, Veronica, handing her a bag. He passes through security, reflecting on his encounter. At a podium, the Mayor introduces President Ashton, who collapses unexpectedly. Enrique rushes to the scene but is tackled by Barnes and taken away by Matthews and Holden. Noticing Veronica in the crowd, he sees her discard the bag under the podium. Seizing an agent's gun, Enrique escapes and is pursued by Holden and Parsons. He races through crowds, apartments, and traffic, dodging obstacles. Despite being hit by cars, he runs toward an underpass, remaining determined to evade capture."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Dodging traffic he crosses the road until he is hit by another car then runs across a road to an underpass carrying highway traffic They race along the balcony as Enrique dashes away from the apartment building and sprints along the street looking behind constantly  Enrique runs onto a balcony and leaps from it into a courtyard and Holden and Parsons reach the balcony railing  Enrique sprints upstairs and dashes into an apartment building with residents on the staircase delaying the secret service agents  Holden and the second agent Parsons chase Enrique into an arcade where he shoves people out of his way  He stands gooping and is hit by a car but he gets to his feet and runs  Enrique rushes out into the street darting into the road as an ambulance approaches where Veronica sits in the passenger seat  Enrique rounds a corner with Holden and another agent in pursuit and Holden shoots in the air  Enrique holsters the agent's gun and Holden gives chase  Barnes glances across and sees him  Smoke fills the plaza as Enrique sits up and Holden leaning beside the fallen Mathews alongside  An agent leads Enrique away but Enrique elbows him in the face and takes the agent's gun  His eyes move down from her face to the bag he brought through security for her which she tosses under the podium  She catches sight of him and holds his gaze  Enrique spots Veronica striding through the crowd and watches her keenly  Matthews and Holden lead Enrique away as the man in the checked shirt videos it  Enrique jumps up onto the podium and runs across it only to be tackled by Barnes  President Ashton steps forward and raises his arms wide at his sides then staggers back and falls  The young man leaves her and Enrique looks up as the Mayor finishes his introduction  Enrique rubs his palms together and reflects on Veronica's assignation  The Mayor goes to the lectern and Spanish flags are waved  He marches through the podium as the Mayor shakes the President's hand  Enrique turns and walks to the security barrier where he shows his ID and is allowed through  She blows him a kiss  Enrique reluctantly lets go of her hand and moves away stopping to glance back  As she hugs him he hands her her bag  she holds his head  He grabs her hair and pushes her against a pillar  As he approaches them the short croppedhaired man walks away and the two exchange looks as Enrique strides up to the pretty longhaired woman Veronica  He notices a couple whispering and keeps his eyes on the young couple  Enrique approaches a security checkpoint and a female officer who calls next "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He notices a couple whispering and keeps his eyes on the young couple Enrique approaches a security checkpoint and a female officer who calls next He grabs her hair and pushes her against a pillar As he approaches them the short croppedhaired man walks away and the two exchange looks as Enrique strides up to the pretty longhaired woman Veronica As she hugs him he hands her her bag she holds his head She blows him a kiss Enrique reluctantly let us go of her hand and moves away stopping to glance back He marches through the podium as the Mayor shakes the President's hand Enrique turns and walks to the security barrier where he shows his ID and is allowed through Enrique rubs his palms together and reflects on Veronica's assignation The Mayor goes to the lectern and Spanish flags are waved President Ashton steps forward and raises his arms wide at his sides then staggers back and falls The young man leaves her and Enrique looks up as the Mayor finishes his introduction Matthews and Holden lead Enrique away as the man in the checked shirt videos it Enrique jumps up onto the podium and runs across it only to be tackled by Barnes She catches sight of him and holds his gaze Enrique spots Veronica striding through the crowd and watches her keenly An agent leads Enrique away but Enrique elbows him in the face and takes the agent's gun His eyes move down from her face to the bag he brought through security for her which she tosses under the podium Barnes glances across and sees him Smoke fills the plaza as Enrique sits up and Holden leaning beside the fallen Mathews alongside Enrique rounds a corner with Holden and another agent in pursuit and Holden shoots in the air Enrique holsters the agent's gun and Holden gives chase He stands gooping and is hit by a car but he gets to his feet and runs Enrique rushes out into the street darting into the road as an ambulance approaches where Veronica sits in the passenger seat Enrique sprints upstairs and dashes into an apartment building with residents on the staircase delaying the secret service agents Holden and the second agent Parsons chase Enrique into an arcade where he shoves people out of his way They race along the balcony as Enrique dashes away from the apartment building and sprints along the street looking behind constantly Enrique runs onto a balcony and leaps from it into a courtyard and Holden and Parsons reach the balcony railing Dodging traffic he crosses the road until he is hit by another car then runs across a road to an underpass carrying highway traffic"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Enrique spots Veronica striding through the crowd and watches her keenly  She catches sight of him and holds his gaze  His eyes move down from her face to the bag he brought through security for her which she tosses under the podium  An agent leads Enrique away but Enrique elbows him in the face and takes the agent's gun  Smoke fills the plaza as Enrique sits up and Holden leaning beside the fallen Mathews alongside  Barnes glances across and sees him  Enrique holsters the agent's gun and Holden gives chase  Enrique rounds a corner with Holden and another agent in pursuit and Holden shoots in the air  Enrique rushes out into the street darting into the road as an ambulance approaches where Veronica sits in the passenger seat  He stands gooping and is hit by a car but he gets to his feet and runs  Holden and the second agent Parsons chase Enrique into an arcade where he shoves people out of his way  Enrique sprints upstairs and dashes into an apartment building with residents on the staircase delaying the secret service agents  Enrique runs onto a balcony and leaps from it into a courtyard and Holden and Parsons reach the balcony railing  They race along the balcony as Enrique dashes away from the apartment building and sprints along the street looking behind constantly  Dodging traffic he crosses the road until he is hit by another car then runs across a road to an underpass carrying highway traffic Enrique approaches a security checkpoint and a female officer who calls next  He notices a couple whispering and keeps his eyes on the young couple  As he approaches them the short croppedhaired man walks away and the two exchange looks as Enrique strides up to the pretty longhaired woman Veronica  He grabs her hair and pushes her against a pillar  she holds his head  As she hugs him he hands her her bag  Enrique reluctantly lets go of her hand and moves away stopping to glance back  She blows him a kiss  Enrique turns and walks to the security barrier where he shows his ID and is allowed through  He marches through the podium as the Mayor shakes the President's hand  The Mayor goes to the lectern and Spanish flags are waved  Enrique rubs his palms together and reflects on Veronica's assignation  The young man leaves her and Enrique looks up as the Mayor finishes his introduction  President Ashton steps forward and raises his arms wide at his sides then staggers back and falls  Enrique jumps up onto the podium and runs across it only to be tackled by Barnes  Matthews and Holden lead Enrique away as the man in the checked shirt videos it "
        }
      ]
    }
  ]
}