{
  "ground_truth": "Howard zooms back in vision as Barnes watches keenly, observing Veronica throw her bag under the podium. Suddenly, Barnes and Howard are thrown off their feet by the force of the explosion, and flames soar up from the podium while black smoke fills the plaza. As the smoke subsides, Howard slowly sits up, rubs the back of his neck, checks his hand for blood, and takes in the scene of devastation in front of him. He stretches out for his camera by his side and sees Barnes with the injured Matthews. Howard pushes himself up onto his feet, looks around, and sees little Anna standing alone. She nods OK, and he picks her up in his arms and runs out of the plaza with her. Outside, he hears Holden chasing Enrique, sees Enrique making his escape, and notices Holden and Parsons in pursuit. Still carrying Anna, Howard runs after them and stops in front of a policewoman as Enrique keeps running, with Holden and Parsons racing after him on the street outside the plaza. Howard heads after them, filming as he goes, as Enrique dashes into a gated stone building with Holden and Parsons sprinting after him. Howard charges through the tall gate and halts inside a large church while the agents pursue Enrique out into the street, with Howard hot on their tail. Anna looks frantically for her mother and mistakenly chases a different olive skin woman. Howard videotapes a red sedan plowing into Enrique, who staggers to his feet and runs, prompting Parsons and Holden to dart after him across the busy road. Howard dashes through the panicking crowd in hot pursuit as they race under colored canopies on a market street. Heavyset Howard stops to catch his breath, captures Holden and Parsons on tape as they disappear around a corner, and then darts down a parallel street. Beating down the side street, Howard sees Enrique make a B-line for a busy highway, beams incredulously, and gives chase with the camcorder held out in front of him. Enrique's pistol is holstered in his belt beside his police badge as a white sedan brakes sharply while he bounds out into the road. Howard stops by the roadside, spots a pedestrian bridge over the highway, scampers up steel steps, and hot foots it along the bridge. He stops and stares out through some chain link mesh to see Enrique slow to a stop at an underpass and cranes the camera on him, spotting Enrique's badge as a squad car drives up in front of Enrique and a policeman approaches him.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Howard speeds back in sight as Barnes observes intently, watching Veronica hurl her sack beneath the platform. Instantly, Barnes and Howard are hurled off their legs by the might of the detonation, and blazes ascend from the platform while dark fumes inundate the square. As the fumes diminish, Howard gradually rises, massages the rear of his nape, inspects his palm for gore, and absorbs the panorama of destruction before him. He extends for his recorder by his flank and perceives Barnes with the wounded Matthews. Howard thrusts himself up onto his legs, surveys around, and glimpses diminutive Anna standing solitary. She acknowledges OK, and he lifts her up in his embrace and sprints out of the square with her. Outdoors, he detects Holden pursuing Enrique, witnesses Enrique making his getaway, and notices Holden and Parsons in chase. Still holding Anna, Howard sprints after them and halts before a policewoman as Enrique keeps sprinting, with Holden and Parsons racing after him on the boulevard outside the square. Howard trails after them, recording as he proceeds, as Enrique darts into a gated stone edifice with Holden and Parsons racing after him. Howard rushes through the lofty gateway and pauses inside a sizable sanctuary while the operatives chase Enrique out into the road, with Howard close on their heels. Anna glances frantically for her parent and mistakenly pursues a different olive complexion lady. Howard records a crimson automobile crashing into Enrique, who stumbles to his legs and sprints, urging Parsons and Holden to sprint after him across the bustling street. Howard races through the frantic throng in fierce pursuit as they dash under vibrant awnings on a marketplace street. Stout Howard halts to recover his breath, films Holden and Parsons on video as they disappear around a bend, and then races down a parallel avenue. Darting down the side lane, Howard notices Enrique make a beeline for a bustling thoroughfare, beams incredulously, and follows with the camcorder extended in front of him. Enrique's firearm is sheathed in his belt beside his law enforcement insignia as a pale automobile decelerates abruptly while he leaps out into the street. Howard pauses by the roadside, discerns a pedestrian overpass over the thoroughfare, scrambles up metallic stairs, and rushes along the overpass. He pauses and gazes out through some chain link barrier to see Enrique decelerate to a halt at an underpass and directs the camcorder on him, spotting Enrique's insignia as a squad car pulls up in front of Enrique and an officer approaches him."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Howard is zoomed back in vision as Barnes keenly watches, with Veronica’s bag being thrown under the podium by her. Suddenly, the force of the explosion throws Barnes and Howard off their feet, and flames soar up from the podium while black smoke fills the plaza. As the smoke subsides, Howard slowly sits up, rubs the back of his neck, checks his hand for blood, and absorbs the scene of devastation in front of him. He reaches out for his camera by his side and observes Barnes assisting the injured Matthews. Howard pushes himself up onto his feet, looks around, and sees little Anna standing alone. She nods OK, and he picks her up in his arms and runs out of the plaza with her. Outside, Holden chases Enrique, whom Howard sees making his escape, while Holden and Parsons pursue him. Still carrying Anna, Howard runs after them and stops in front of a policewoman as Holden and Parsons race after Enrique, who continues down the street outside the plaza. Howard heads after them, filming as he goes, as Enrique dashes into a gated stone building with Holden and Parsons sprinting after him. Howard charges through the tall gate and halts inside a large church, chasing the agents as they pursue Enrique out into the street, with Howard in hot pursuit. Anna frantically looks for her mother and mistakenly chases another olive-skinned woman. Howard videotapes a red sedan plowing into Enrique, who staggers to his feet and runs, prompting Parsons and Holden to dart after him across the busy road. Howard dashes through the panicking crowd in pursuit as they race under colored canopies on a market street. Heavyset Howard stops to catch his breath, capturing Holden and Parsons on tape as they disappear around a corner, and then darts down a parallel street. Beating down the side street, Howard sees Enrique making a B-line for a busy highway, beams incredulously, and gives chase with the camcorder held out in front of him. Enrique holsters his pistol in his belt beside his police badge as a white sedan brakes sharply while he bounds out into the road. Howard stops by the roadside, spots a pedestrian bridge over the highway, scampers up steel steps, and hurries along the bridge. He stops and stares out through some chain-link mesh, seeing Enrique slow to a stop at an underpass, and cranes the camera on him, spotting Enrique's badge as a squad car drives up in front of Enrique and a policeman approaches him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Howard returns to view as Barnes watches Veronica throw her bag under the podium. Suddenly, an explosion knocks Barnes and Howard off their feet, with flames and black smoke engulfing the plaza. As the smoke clears, Howard sits up, checks his neck for injuries, and surveys the devastation. He grabs his camera and notices Barnes with the injured Matthews. Howard stands up, sees little Anna alone, picks her up, and runs out of the plaza. Outside, he observes Holden pursuing Enrique, with Parsons joining in. Carrying Anna, Howard follows, filming as Enrique escapes into a gated stone building. Howard enters a large church, still filming, as the agents pursue Enrique. Anna mistakenly chases a different woman, while Howard captures a red sedan hitting Enrique. Enrique staggers and runs, with Parsons and Holden chasing him across a busy road. Howard follows through the crowd, filming as the agents disappear around a corner. He spots Enrique heading for a highway and chases with his camcorder ready. Enrique's pistol and badge are visible as a white sedan brakes sharply. Howard takes a pedestrian bridge over the highway, filming Enrique slowing at an underpass as a squad car and policeman approach him."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Howard reappears as Barnes observes Veronica toss her bag under the podium. An explosion throws Barnes and Howard off their feet, flames rise, and smoke fills the plaza. Howard sits up, checks for injuries, and surveys the devastation. He reaches for his camera, notices Barnes with injured Matthews, and finds Anna alone. She nods OK, and he carries her out. Outside, Holden chases Enrique, with Parsons following. Howard films while pursuing them as Enrique escapes into a gated building. Inside a large church, Howard continues filming, with Anna mistakenly chasing another woman. He records a red sedan hitting Enrique, who runs, pursued by Parsons and Holden across a busy road. Howard follows through a panicked crowd, losing breath but continuing to film. He sees Enrique head for a highway, incredulously gives chase, spotting Enrique’s pistol and badge. As Enrique runs, a white sedan stops abruptly, and Howard uses a pedestrian bridge to follow, watching Enrique at an underpass as a squad car approaches."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Howard swiftly zooms back into view as Barnes watches with intense focus, keenly observing Veronica as she casually tosses her bag beneath the podium. Without warning, the tranquility of the scene shatters as an explosion erupts with tremendous force, violently throwing both Barnes and Howard off their feet. Flames leap dramatically upwards from the podium's remains, while thick, black smoke billows ominously, engulfing the entire plaza. As the suffocating smoke gradually clears, Howard, in a daze, gingerly sits up, feeling the back of his neck with cautious fingers. He checks his hand for blood, taking in the scene of utter devastation and chaos that lies before him. Reaching out for his camera that rests by his side, Howard notices Barnes tending to the injured Matthews. Mustering his strength, Howard pushes himself upright and scans the surroundings, spotting young Anna standing all alone. With a reassuring nod from her, indicating she is unharmed, Howard sweeps her up into his protective arms and swiftly runs out of the beleaguered plaza with her. \n\nOutside, the clamor of a pursuit reaches his ears as Holden is seen fervently chasing Enrique, who is desperately trying to make his escape. Howard quickly takes note of Holden and Parsons following in hot pursuit, their determination evident. Still carrying Anna with him, Howard rushes after the unfolding chase, momentarily halting in front of a policewoman while Enrique continues his frantic dash, pursued relentlessly by Holden and Parsons on the street right outside the plaza. Not one to miss capturing the unfolding drama, Howard hurries after them, filming every moment as he goes. Enrique, in desperation, races into a massive gated stone building, closely followed by the sprinting agents, Holden and Parsons. Undeterred, Howard charges through the tall gate and halts abruptly within the large, echoing space of a church, trailing the agents as they chase Enrique back out onto the street. He follows closely behind, hot on their tail, keeping Anna secure.\n\nIn the chaotic scene, Anna desperately searches for her mother, mistakenly chasing after another woman with similar olive skin. Meanwhile, Howard documents a red sedan barreling into Enrique, who, despite being hit, manages to stagger back to his feet and continues to run, prompting the agents Parsons and Holden to pursue him with urgency across the bustling road. Howard, maintaining his pursuit, dashes through the panicking crowd, weaving under vibrant-colored canopies scattered along a busy market street. Breathless but persistent, the heavyset Howard pauses momentarily to catch his breath, capturing footage of Holden and Parsons disappearing swiftly around a corner before he, too, darts down a parallel street. \n\nBeating a determined path down the side street, Howard watches as Enrique makes a beeline towards a congested highway, his expression one of disbelief. With his camcorder prominently held out before him, Howard gives chase, capturing every moment. Enrique's pistol remains holstered at his side, positioned next to his police badge, as a white sedan screeches to a halt when Enrique leaps boldly out onto the road. Howard stops momentarily by the roadside, his eyes catching sight of a pedestrian bridge arching over the highway. Seizing the opportunity, he quickly scampers up the steel steps and hurries along the bridge, his breath coming in heaving gasps. Pausing briefly, Howard stares out through the chain-link mesh that lines the bridge to observe Enrique slowing to a stop beneath an underpass. He expertly zooms his camera in on the scene, capturing Enrique's police badge just as a squad car pulls up before Enrique, and a policeman approaches him, concluding the frantic chase."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Howard, with striking swiftness, zooms back into the frame as Barnes, his eyes filled with intense focus, keenly observes Veronica, who nonchalantly tosses her bag beneath the podium. Suddenly, the calm atmosphere is shattered without warning as an explosion erupts with extraordinary force, violently hurling both Barnes and Howard off their feet, sending them tumbling to the ground. Flames dramatically leap upwards from the remnants of the podium, while thick, black smoke billows ominously, engulfing the entire plaza in a suffocating cloud. As the choking smoke gradually begins to clear, a dazed Howard gingerly sits up, carefully feeling the back of his neck with cautious fingers. He checks his hand for any signs of blood while taking in the overwhelming scene of utter devastation and chaos before him. Reaching out for his camera, which lies by his side, Howard notices Barnes trying to help the injured Matthews. Gathering his strength, Howard pushes himself to an upright position and scans the surroundings, spotting young Anna standing all by herself. With a reassuring nod from Anna, indicating that she is unharmed, Howard sweeps her up protectively into his arms and swiftly runs out of the besieged plaza with her.\n\nOutside the plaza, the din of an urgent pursuit reaches his ears as Holden is seen fervently chasing after Enrique, who is desperately trying to make his escape. Howard quickly takes note of Holden and Parsons following closely, their determination evident in their swift movements. Still carrying Anna with him, Howard rushes after the unfolding chase, momentarily halting in front of a policewoman, while Enrique continues his frantic dash, pursued relentlessly by Holden and Parsons on the street right outside the plaza boundaries. Never one to miss capturing the unfolding drama, Howard hurries after them, filming every moment as he goes. In his desperate bid for freedom, Enrique races into a massive, gated stone building, closely pursued by the sprinting agents, Holden and Parsons. Undeterred by the obstacle, Howard charges through the tall gate, coming to an abrupt halt within the large, echoing confines of a church, trailing the agents as they chase Enrique back out onto the street. He follows closely behind, hot on their trail, while keeping Anna securely in his hold.\n\nIn the midst of the chaotic scene, Anna, in her desperation, searches for her mother, mistakenly pursuing another woman with similarly olive-toned skin. Meanwhile, Howard documents an unfolding incident as a red sedan barrels into Enrique. Despite being hit, Enrique astonishingly manages to stagger back to his feet and continues his frantic run, prompting the agents Parsons and Holden to pursue him with increased urgency across the bustling road. Howard, determined to keep up, dashes through the panicking crowd, weaving underneath vibrant-colored canopies scattered along a busy market street. Breathless but persistent, Howard pauses momentarily to catch his breath, capturing footage of Holden and Parsons as they swiftly disappear around a corner before he, too, darts down a parallel street.\n\nBeating a determined path down the side street, Howard watches intently as Enrique makes a beeline towards a congested highway, disbelief etched across his face. With his camcorder prominently held out before him, Howard gives chase, capturing every moment. Enrique’s pistol remains holstered at his side, positioned next to his police badge, as a white sedan screeches to a halt when Enrique leaps boldly out onto the road. Howard stops briefly by the roadside, his eyes catching sight of a pedestrian bridge gracefully arching over the highway. Seizing the opportunity, he quickly scampers up the steel steps and hurries along the bridge, his breath coming in heavy gasps. Pausing briefly, Howard stares out through the chain-link mesh that lines the bridge to observe Enrique slowing to a stop beneath an underpass. With precision, he expertly zooms his camera in on the scene, capturing Enrique’s police badge just as a squad car pulls up in front of Enrique, and a policeman approaches him, bringing the frantic chase to its conclusion."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As Howard zooms back into focus, he fixes his attention on Barnes, who watches with keen interest while Veronica swiftly tosses her bag under the podium. In a sudden, violent shift, the force of an explosion sends both Barnes and Howard sprawling off their feet. Flames shoot upwards from the podium, and thick black smoke rapidly fills the entire plaza. As the dense smoke gradually lifts, Howard slowly begins to sit up, gingerly rubbing the back of his neck to assess any injury. He checks his hand for traces of blood and absorbs the chaotic and devastating scene unfolding in front of him. Sensing his camera nearby, he stretches out to retrieve it, then takes in the sight of Barnes tending to the injured Matthews. Determined, Howard pushes himself to stand, scanning his surroundings until his gaze falls upon little Anna, standing alone amidst the chaos. Catching her nod that she is okay, he moves swiftly to scoop her up into his arms and, securing her safely, rushes out of the plaza. Once outside, his attention is drawn to the commotion as Holden pursues Enrique, who is attempting to flee. Observing Holden and Parsons in hot pursuit, Howard, still carrying Anna, runs after them, stopping momentarily in front of a policewoman as Enrique continues his desperate escape. In the hectic chase, Howard keeps pace with the action, filming as he runs, trailing Enrique who dashes into a gated stone building. Without hesitation, Howard charges through the tall gate, coming to an abrupt halt inside a large church, while the relentless agents pursue Enrique back out into the street. With the chase intensifying, Howard follows closely behind, capturing the frenzy on film as Anna anxiously looks for her mother, mistakenly trailing an olive-skinned woman. Howard records the jarring moment when a red sedan barrels into Enrique, who staggers but quickly resumes his flight. Parsons and Holden react instantly, darting after him across the busy thoroughfare, with Howard sprinting through the panicked crowd, driven by the urgency to document every moment. As they all race beneath the colorful canopies of a bustling market street, Howard's heavy frame demands a brief pause to catch his breath. He captures Holden and Parsons disappearing around a corner on tape, then veers down a parallel street in a determined bid to keep pace. Beating a path down the side street, Howard sees Enrique make a swift B-line for a congested highway, his incredulity at the sight only propelling him faster, camcorder held steadfastly out front. Enrique's pistol remains holstered beside a visible police badge as a white sedan brakes abruptly with Enrique vaulting into the road. Halting at the roadside, Howard spots a pedestrian bridge spanning the highway, quickly scampers up the steel steps, and hastily crosses the bridge. He pauses, peering through the chain-link mesh with intent focus, watching as Enrique slows his pace at an underpass. Howard zeroes in with his camera, catching sight of Enrique's badge just as a squad car arrives, and a policeman steps out to confront Enrique."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Howard zooms back in vision as Barnes keenly observes Veronica throw her bag under the podium. Suddenly, they're both thrown off their feet by an explosion, with flames and smoke filling the plaza. As the smoke clears, Howard sits up, checks himself for injuries, and surveys the devastation. He reaches for his camera and sees Barnes with the injured Matthews, then spots little Anna standing alone. After confirming she's okay, he picks her up and runs out of the plaza. \n\nOutside, Howard hears Holden chasing Enrique and sees Holden and Parsons in pursuit. Still holding Anna, he follows, filming as Enrique runs into a gated building with the agents chasing him. Howard follows them through the gate into a large church. As the agents pursue Enrique back out into the street, Howard keeps up, capturing the chase on camera. Amidst the chaos, Anna searches for her mother, mistakenly following another woman, while Howard records a red sedan hitting Enrique, prompting him to run again, with Parsons and Holden in pursuit.\n\nHoward navigates through the crowd, filming the chase as they pass market canopies. He pauses to catch his breath before continuing down a parallel street, capturing Enrique's dash toward a busy highway. Noticing Enrique's police badge, Howard follows him, sees a sedan brake as Enrique crosses the road, and then heads to a pedestrian bridge. From the bridge, he films Enrique at an underpass as a squad car arrives and a policeman approaches Enrique."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Howard, who worked as a freelance photojournalist known for his keen eye, zooms back in vision as Barnes watches keenly, observing Veronica, a local activist known for her passionate speeches, throw her bag under the podium. Suddenly, Barnes and Howard are thrown off their feet by the force of the explosion, a tragic event orchestrated by unknown assailants, and flames soar up from the podium while black smoke fills the plaza, a popular gathering spot in the city known for its open-air events. As the smoke subsides, Howard slowly sits up, rubs the back of his neck, checks his hand for blood, and takes in the scene of devastation in front of him, reminiscent of the chaos he had documented in conflict zones before. He stretches out for his camera by his side and sees Barnes with the injured Matthews, a local politician who had been scheduled to speak that day. Howard pushes himself up onto his feet, looks around, and sees little Anna, a girl who had been separated from her parents, standing alone. She nods OK, and he picks her up in his arms and runs out of the plaza with her. Outside, he hears Holden, a determined detective with a reputation for catching high-profile criminals, chasing Enrique, a notorious local figure suspected of the bombing, and notices Holden and Parsons in pursuit. Still carrying Anna, Howard runs after them and stops in front of a policewoman as Enrique keeps running, with Holden and Parsons racing after him on the street outside the plaza, a bustling thoroughfare known for its street vendors. Howard heads after them, filming as he goes, as Enrique dashes into a gated stone building, a historic church dating back to the 18th century, with Holden and Parsons sprinting after him. Howard charges through the tall gate and halts inside a large church while the agents pursue Enrique out into the street, with Howard hot on their tail. Anna, in her distress, looks frantically for her mother and mistakenly chases a different olive skin woman, a passerby caught in the commotion. Howard videotapes a red sedan plowing into Enrique, who staggers to his feet and runs, prompting Parsons and Holden to dart after him across the busy road, a major artery notorious for its heavy traffic. Howard dashes through the panicking crowd in hot pursuit as they race under colored canopies on a market street, famous for its vibrant stalls and artisan goods. Heavyset Howard, known more for his storytelling skills than his athleticism, stops to catch his breath, captures Holden and Parsons on tape as they disappear around a corner, and then darts down a parallel street, a narrow alley lined with old brick buildings. Beating down the side street, Howard sees Enrique make a B-line for a busy highway, a critical junction leading out of the city, beams incredulously, and gives chase with the camcorder held out in front of him. Enrique's pistol is holstered in his belt beside his police badge, a surprising revelation about his true identity, as a white sedan brakes sharply while he bounds out into the road. Howard stops by the roadside, spots a pedestrian bridge over the highway, a structure built to ensure safety for foot traffic, scampers up steel steps, and hot foots it along the bridge. He stops and stares out through some chain link mesh to see Enrique slow to a stop at an underpass and cranes the camera on him, spotting Enrique's badge as a squad car drives up in front of Enrique and a policeman, an officer from the city precinct with authority over the district, approaches him."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Howard zooms back in vision as Barnes watches keenly observing Veronica throw her bag under the podium. Suddenly Barnes and Howard are thrown off their feet by the force of the explosion and flames soar up from the podium while black smoke fills the plaza. As the smoke subsides Howard slowly sits up rubs the back of his neck checks his hand for blood and takes in the scene of devastation in front of him. He stretches out for his camera by his side and sees Barnes with the injured Matthews. Howard pushes himself up onto his feet looks around and sees little Anna standing alone. She nods OK and he picks her up in his arms and runs out of the plaza with her. Outside he hears Holden chasing. Enrique sees Enrique making his escape and notices Holden and Parsons in pursuit. Still carrying Anna. Howard runs after them and stops in front of a policewoman. as Enrique keeps running with Holden and Parsons racing after him on the street outside the plaza. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Howard heads after them filming as he goes as Enrique dashes into a gated stone building with Holden and Parsons sprinting after him. Howard charges through the tall gate and halts inside a large church while the agents pursue Enrique out into the street with Howard hot on their tail. Anna looks frantically for her mother and mistakenly chases a different olive skin woman. Howard videotapes a red sedan plowing into Enrique who staggers to his feet and runs prompting Parsons and Holden to dart after him across the busy road. Howard dashes through the panicking crowd in hot pursuit as they race under colored canopies on a market street. Heavyset Howard stops to catch his breath captures Holden and Parsons on tape as they disappear around a corner and then darts down a parallel street. Beating down the side street Howard sees Enrique make a Bline for a busy highway beams incredulously and gives chase with the camcorder held out in front of him. Enrique's pistol is holstered in his belt beside his police badge as a white sedan brakes sharply while he bounds out into the road. Howard stops by the roadside spots a pedestrian bridge over the highway scampers up steel steps and hot foots it along the bridge. He stops and stares out through some chain link mesh to see Enrique slow to a stop at an underpass and cranes the camera on him. spotting Enrique's badge. as a squad car drives up in front of Enrique and a policeman approaches him."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Howard zooms back in vision as Barnes watches keenly observing Veronica throw her bag under the podium. Suddenly Barnes and Howard are thrown off their feet by the force of the explosion and flames soar up from the podium while black smoke fills the plaza. As the smoke subsides Howard slowly sits up rubs the back of his neck checks his hand for blood and takes in the scene of devastation in front of him. He stretches out for his camera by his side and sees Barnes with the injured Matthews. Howard pushes himself up onto his feet looks around and sees little Anna standing alone. She nods OK and he picks her up in his arms and runs out of the plaza with her. Outside he hears Holden chasing. Enrique sees Enrique making his escape and notices Holden and Parsons in pursuit. Still carrying Anna. Howard runs after them and stops in front of a policewoman. as Enrique keeps running with Holden and Parsons racing after him on the street outside the plaza. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Howard heads after them filming as he goes as Enrique dashes into a gated stone building with Holden and Parsons sprinting after him. Howard charges through the tall gate and halts inside a large church while the agents pursue Enrique out into the street with Howard hot on their tail. Anna looks frantically for her mother and mistakenly chases a different olive skin woman. Howard videotapes a red sedan plowing into Enrique who staggers to his feet and runs prompting Parsons and Holden to dart after him across the busy road. Howard dashes through the panicking crowd in hot pursuit as they race under colored canopies on a market street. Heavyset Howard stops to catch his breath captures Holden and Parsons on tape as they disappear around a corner and then darts down a parallel street. Beating down the side street Howard sees Enrique make a Bline for a busy highway beams incredulously and gives chase with the camcorder held out in front of him. Enrique's pistol is holstered in his belt beside his police badge as a white sedan brakes sharply while he bounds out into the road. Howard stops by the roadside spots a pedestrian bridge over the highway scampers up steel steps and hot foots it along the bridge. He stops and stares out through some chain link mesh to see Enrique slow to a stop at an underpass and cranes the camera on him. spotting Enrique's badge. as a squad car drives up in front of Enrique and a policeman approaches him."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Howard zooms back in vision as Barnes watches keenly observing Veronica throw her bag under the podium. Suddenly Barnes and Howard are thrown off their feet by the force of the explosion and flames soar up from the podium while black smoke fills the plaza. As the smoke subsides Howard slowly sits up rubs the back of his neck checks his hand for blood and takes in the scene of devastation in front of him. He stretches out for his camera by his side and sees Barnes with the injured Matthews. Howard pushes himself up onto his feet looks around and sees little Anna standing alone. She nods OK and he picks her up in his arms and runs out of the plaza with her. Beating down the side street Howard sees Enrique make a Bline for a busy highway beams incredulously and gives chase with the camcorder held out in front of him. Enrique's pistol is holstered in his belt beside his police badge as a white sedan brakes sharply while he bounds out into the road. Howard stops by the roadside spots a pedestrian bridge over the highway scampers up steel steps and hot foots it along the bridge. He stops and stares out through some chain link mesh to see Enrique slow to a stop at an underpass and cranes the camera on him. spotting Enrique's badge. as a squad car drives up in front of Enrique and a policeman approaches him."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Howard zooms back in vision as Barnes watches keenly observing Veronica throw her bag under the podium. Suddenly Barnes and Howard are thrown off their feet by the force of the explosion and flames soar up from the podium while black smoke fills the plaza. He stops and stares out through some chain link mesh to see Enrique slow to a stop at an underpass and cranes the camera on him. spotting Enrique's badge. as a squad car drives up in front of Enrique and a policeman approaches him."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Sandra twirls back into focus as Dougie gazes intently, spotting Felicia hurl her coat beneath the lectern. Abruptly, Dougie and Sandra are lifted into the air by the blast, and sparks leap up from the lectern while gray fog envelops the courtyard. As the fog disperses, Sandra cautiously rises, massages her temple, inspects her fingers for dust, and surveys the chaos before her. She reaches for her notebook nearby and notices Dougie with the wounded Gregory. Sandra hoists herself upright, scans the area, and spots young Lucy standing quietly. Lucy gives a thumbs-up, and Sandra scoops her up and rushes out of the courtyard with her. Outside, she witnesses Riley tailing Carlos, observes Carlos making his getaway, and sees Riley and Morgan giving chase. Still holding Lucy, Sandra darts after them and halts in front of a firefighter as Carlos continues fleeing, with Riley and Morgan sprinting after him on the boulevard behind the courtyard. Sandra follows after them, recording as she advances, as Carlos bolts into a fenced brick structure with Riley and Morgan dashing after him. Sandra barrels through the wide gate and stops inside a vast cathedral while the officers chase Carlos onto the avenue, with Sandra close behind. Lucy searches desperately for her mother and inadvertently trails a different tan-skinned woman. Sandra videos a blue SUV barreling into Carlos, who staggers upright and bolts, prompting Morgan and Riley to sprint after him across the congested avenue. Sandra races through the alarmed throng in hot pursuit as they dash beneath vibrant awnings on a market avenue. Winded Sandra pauses to compose herself, captures Riley and Morgan on film as they vanish around an alley, and then speeds down a parallel lane. Charging down the lane, Sandra spots Carlos heading directly for a crowded expressway, grins with disbelief, and races after with the camcorder held out in front of her. Carlos's flashlight hangs on his vest next to his fire department badge as a yellow hatchback halts abruptly while he leaps into the avenue. Sandra pauses by the roadside, notices a cycle bridge over the expressway, scurries up iron stairs, and hustles along the bridge. She stops and peers out through some woven steel to see Carlos decelerate at a tunnel entrance and aims the camera at him, glimpsing Carlos's badge as a patrol car rolls up in front of Carlos and a firefighter approaches him."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Howard zooms back into focus as Barnes observes Veronica placing her bag under the podium. An explosion throws them off their feet, engulfing the area in flames and smoke. Once the smoke clears, Howard checks himself for injuries and surveys the damage. Spotting little Anna alone, he picks her up and runs from the plaza. Outside, he witnesses Holden pursuing Enrique, with Parsons joining the chase. Howard follows, filming the pursuit as Enrique enters a gated building with the agents in tow. Anna mistakenly pursues another woman, while Howard captures a red sedan hitting Enrique, who then continues to flee. As the agents give chase on a market street, Howard records and catches his breath before following a parallel route. He spots Enrique heading for a highway, armed with a pistol and police badge. Howard sprints up a pedestrian bridge, filming Enrique as he stops at an underpass, just as a squad car approaches him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "as a squad car drives up in front of Enrique and a policeman approaches him spotting Enrique's badge He stops and stares out through some chain link mesh to see Enrique slow to a stop at an underpass and cranes the camera on him Howard stops by the roadside spots a pedestrian bridge over the highway scampers up steel steps and hot foots it along the bridge Enrique's pistol is holstered in his belt beside his police badge as a white sedan brakes sharply while he bounds out into the road Beating down the side street Howard sees Enrique make a Bline for a busy highway beams incredulously and gives chase with the camcorder held out in front of him Heavyset Howard stops to catch his breath captures Holden and Parsons on tape as they disappear around a corner and then darts down a parallel street Howard dashes through the panicking crowd in hot pursuit as they race under colored canopies on a market street Howard videotapes a red sedan plowing into Enrique who staggers to his feet and runs prompting Parsons and Holden to dart after him across the busy road Anna looks frantically for her mother and mistakenly chases a different olive skin woman Howard charges through the tall gate and halts inside a large church while the agents pursue Enrique out into the street with Howard hot on their tail Howard heads after them filming as he goes as Enrique dashes into a gated stone building with Holden and Parsons sprinting after him as Enrique keeps running with Holden and Parsons racing after him on the street outside the plaza Howard runs after them and stops in front of a policewoman Still carrying Anna Enrique sees Enrique making his escape and notices Holden and Parsons in pursuit Outside he hears Holden chasing She nods OK and he picks her up in his arms and runs out of the plaza with her Howard pushes himself up onto his feet looks around and sees little Anna standing alone He stretches out for his camera by his side and sees Barnes with the injured Matthews As the smoke subsides Howard slowly sits up rubs the back of his neck checks his hand for blood and takes in the scene of devastation in front of him Suddenly Barnes and Howard are thrown off their feet by the force of the explosion and flames soar up from the podium while black smoke fills the plaza Howard zooms back in vision as Barnes watches keenly observing Veronica throw her bag under the podium"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Suddenly Barnes and Howard are thrown off their feet by the force of the explosion and flames soar up from the podium while black smoke fills the plaza Howard zooms back in vision as Barnes watches keenly observing Veronica throw her bag under the podium He stretches out for his camera by his side and sees Barnes with the injured Matthews As the smoke subsides Howard slowly sits up rubs the back of his neck checks his hand for blood and takes in the scene of devastation in front of him She nods OK and he picks her up in his arms and runs out of the plaza with her Howard pushes himself up onto his feet looks around and sees little Anna standing alone Enrique sees Enrique making his escape and notices Holden and Parsons in pursuit Outside he hears Holden chasing Howard runs after them and stops in front of a policewoman Still carrying Anna Howard heads after them filming as he goes as Enrique dashes into a gated stone building with Holden and Parsons sprinting after him as Enrique keeps running with Holden and Parsons racing after him on the street outside the plaza Anna looks frantically for her mother and mistakenly chases a different olive skin woman Howard charges through the tall gate and halts inside a large church while the agents pursue Enrique out into the street with Howard hot on their tail Howard dashes through the panicking crowd in hot pursuit as they race under colored canopies on a market street Howard videotapes a red sedan plowing into Enrique who staggers to his feet and runs prompting Parsons and Holden to dart after him across the busy road Beating down the side street Howard sees Enrique make a Bline for a busy highway beams incredulously and gives chase with the camcorder held out in front of him Heavyset Howard stops to catch his breath captures Holden and Parsons on tape as they disappear around a corner and then darts down a parallel street Howard stops by the roadside spots a pedestrian bridge over the highway scampers up steel steps and hot foots it along the bridge Enrique's pistol is holstered in his belt beside his police badge as a white sedan brakes sharply while he bounds out into the road spotting Enrique's badge He stops and stares out through some chain link mesh to see Enrique slow to a stop at an underpass and cranes the camera on him as a squad car drives up in front of Enrique and a policeman approaches him"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Howard charges through the tall gate and halts inside a large church while the agents pursue Enrique out into the street with Howard hot on their tail Anna looks frantically for her mother and mistakenly chases a different olive skin woman Howard videotapes a red sedan plowing into Enrique who staggers to his feet and runs prompting Parsons and Holden to dart after him across the busy road Howard dashes through the panicking crowd in hot pursuit as they race under colored canopies on a market street Heavyset Howard stops to catch his breath captures Holden and Parsons on tape as they disappear around a corner and then darts down a parallel street Beating down the side street Howard sees Enrique make a Bline for a busy highway beams incredulously and gives chase with the camcorder held out in front of him Enrique's pistol is holstered in his belt beside his police badge as a white sedan brakes sharply while he bounds out into the road Howard stops by the roadside spots a pedestrian bridge over the highway scampers up steel steps and hot foots it along the bridge He stops and stares out through some chain link mesh to see Enrique slow to a stop at an underpass and cranes the camera on him spotting Enrique's badge as a squad car drives up in front of Enrique and a policeman approaches him Howard zooms back in vision as Barnes watches keenly observing Veronica throw her bag under the podium Suddenly Barnes and Howard are thrown off their feet by the force of the explosion and flames soar up from the podium while black smoke fills the plaza As the smoke subsides Howard slowly sits up rubs the back of his neck checks his hand for blood and takes in the scene of devastation in front of him He stretches out for his camera by his side and sees Barnes with the injured Matthews Howard pushes himself up onto his feet looks around and sees little Anna standing alone She nods OK and he picks her up in his arms and runs out of the plaza with her Outside he hears Holden chasing Enrique sees Enrique making his escape and notices Holden and Parsons in pursuit Still carrying Anna Howard runs after them and stops in front of a policewoman as Enrique keeps running with Holden and Parsons racing after him on the street outside the plaza Howard heads after them filming as he goes as Enrique dashes into a gated stone building with Holden and Parsons sprinting after him"
        }
      ]
    }
  ]
}