{
  "ground_truth": "Holden and Parson open fire from across the highway, prompting Howard to flee and then zoom the camera back on Enrique. The officer stoops over Enrique's body and gently lifts his head, seeing Anna step out onto the highway as a white car swerves to avoid her. An ambulance motors over the crest of the hill bridge, and Howard runs along the highway towards Anna. He freezes in the middle of the road as the speeding ambulance hurdles towards her, then makes a mad dash for her. The picture freezes and the events run in reverse, showing Enrique bouncing from the windscreen of a red sedan. Howard scoops Anna in his arms as the fiery explosion shrinks into nothing, into blackness. Marksmen watch from the rooftops of tall buildings as the President's motorcade proceeds towards the plaza. President Ashton is on a car phone with Cavic and another agent sitting opposite him. The motorcade halts in the shadows beneath a bridge where another dark-suited man, Ted Heinkin, climbs into the President's car and lowers the phone. Heinkin hangs up the phone and narrows his eyes, removing two flags from the bonnet of the President's limousine and putting a document in a folder before slamming it shut. Ashton stares gravely out of the window as a seething crowd fills the Plaza Mayor. The double's motorcade passes beneath the watchful snipers while the crowd of protesters waves placards at the roadside. The President's limo drives into the hotel's underground car park where government agents stand watch outside the glass wall of the Hotel Vesta. The President gets out of his limo in a bright, empty parking lot dotted with armed agents, followed by Heinkin and silver-haired Phil McCullough into an elevator. A besuited agent runs a swipe card through a machine and talks into a radio. An inflatable skull and two skeleton hands are waved by protesters outside the Plaza Mayor as Matthews and Holden cross to the limousine, and Matthews opens the door for the Ashton double. In the elevator, Ashton reads through a folder of large photographs, while a guilty McCullough looks awkward and then looks away. Ashton stares at McCullough, then steps out of the elevator, and Heinkin raises an eyebrow as they follow Ashton down a corridor. At the plaza, the crowd waves Spanish flags as the Secret Service agents escort Ashton's double to the podium. In his hotel room, Ashton opens the curtains and gazes out of the window of the Plaza Mayor where the Secret Service agents take positions around the President on the red-carpeted podium. De Soto stands at the lectern. Ashton sees his double on TV and then his double is shot. McCullough grabs the phone as Barnes floors Enrique, and Ashton watches live footage of Barnes pinning Enrique down. Ashton is transfixed and then turns.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Holden and Parson initiate fire from across the roadway, prompting Howard to escape and then zoom the camera back on Enrique. The officer bends over Enrique's body and gently raises his head, observing Anna step out onto the roadway as a white automobile veers to avoid her. An ambulance motors over the crest of the hill bridge, and Howard runs along the roadway towards Anna. He freezes in the center of the route as the speeding ambulance rushes towards her, then makes a wild sprint for her. The image freezes and the events run in reverse, showing Enrique rebounding from the windscreen of a crimson sedan. Howard scoops Anna in his arms as the fiery detonation contracts into nothing, into blackness. Sharpshooters observe from the rooftops of tall structures as the President's motorcade advances towards the plaza. President Ashton is on a car phone with Cavic and another agent sitting opposite him. The motorcade stops in the shadows beneath a bridge where another dark-suited man, Ted Heinkin, climbs into the President's car and lowers the phone. Heinkin hangs up the phone and narrows his eyes, removing two flags from the hood of the President's limousine and placing a document in a folder before slamming it shut. Ashton gazes gravely out of the window as a seething crowd fills the Plaza Mayor. The double's motorcade passes beneath the watchful sharpshooters while the crowd of demonstrators waves placards at the roadside. The President's limo drives into the hotel's subterranean parking facility where government agents stand watch outside the glass wall of the Hotel Vesta. The President gets out of his limo in a bright, empty parking lot dotted with armed agents, followed by Heinkin and silver-haired Phil McCullough into an elevator. A besuited agent runs a swipe card through a device and talks into a radio. An inflatable skull and two skeleton hands are waved by demonstrators outside the Plaza Mayor as Matthews and Holden cross to the limousine, and Matthews opens the door for the Ashton double. In the elevator, Ashton peruses a folder of large photographs, while a guilty McCullough looks uncomfortable and then looks away. Ashton stares at McCullough, then steps out of the elevator, and Heinkin raises an eyebrow as they follow Ashton down a passageway. At the plaza, the crowd waves Spanish flags as the Secret Service agents escort Ashton's double to the podium. In his hotel room, Ashton opens the drapes and gazes out of the window of the Plaza Mayor where the Secret Service agents take positions around the President on the red-carpeted platform. De Soto stands at the lectern. Ashton sees his double on TV and then his double is shot. McCullough grabs the phone as Barnes floors Enrique, and Ashton watches live footage of Barnes pinning Enrique down. Ashton is mesmerized and then turns."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Fire was opened by Holden and Parson from across the highway, prompting Howard to flee and then the camera was zoomed back on Enrique by him. Enrique's body is stooped over by the officer, and his head is gently lifted by him, seeing Anna stepping out onto the highway as a white car swerves to avoid her. The crest of the hill bridge is motored over by an ambulance, and the highway is run along by Howard towards Anna. He is frozen in the middle of the road as the speeding ambulance hurdles towards her, then a mad dash is made for her by him. The picture is frozen and the events are run in reverse, showing Enrique being bounced from the windscreen of a red sedan. Anna is scooped in Howard's arms as the fiery explosion is shrunk into nothing, into blackness. Marksmen are watched from the rooftops of tall buildings as the President's motorcade proceeds towards the plaza. Cavic is on a car phone with President Ashton and another agent sitting opposite him. The shadows beneath a bridge halt the motorcade, where another dark-suited man, Ted Heinkin, climbs into the President's car and lowers the phone. The phone is hung up by Heinkin, and his eyes are narrowed, removing two flags from the bonnet of the President's limousine and putting a document in a folder before it is slammed shut by him. Ashton stares gravely out of the window as a seething crowd fills the Plaza Mayor. The watchful snipers are passed beneath by the double's motorcade while placards are waved at the roadside by the crowd of protesters. The hotel's underground car park is driven into by the President's limo where the glass wall of the Hotel Vesta is stood watch outside by government agents. The limo is exited by the President in a bright, empty parking lot dotted with armed agents, followed by Heinkin and silver-haired Phil McCullough into an elevator. A swipe card is run through a machine by a besuited agent and a radio is talked into by him. An inflatable skull and two skeleton hands are waved by protesters outside the Plaza Mayor as the limousine is crossed to by Matthews and Holden, and the door is opened by Matthews for the Ashton double. In the elevator, a folder of large photographs is read through by Ashton, while McCullough looks awkward and then looks away guiltily. McCullough is stared at by Ashton, then the elevator is stepped out of by him, and Heinkin raises an eyebrow as they follow Ashton down a corridor. At the plaza, Spanish flags are waved by the crowd as Ashton's double is escorted to the podium by Secret Service agents. In his hotel room, the curtains are opened by Ashton and the Plaza Mayor is gazed out of the window by him where positions around the President on the red-carpeted podium are taken by Secret Service agents. De Soto stands at the lectern. Ashton sees his double on TV and then the double is shot. The phone is grabbed by McCullough as Enrique is floored by Barnes, and live footage of Barnes pinning Enrique down is watched by Ashton. Ashton is transfixed and then he turns."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Holden and Parson fire from across the highway, causing Howard to flee and refocus the camera on Enrique. The officer lifts Enrique's head, seeing Anna step onto the highway as a white car swerves. An ambulance crests the hill bridge, and Howard runs toward Anna, freezing as the ambulance speeds toward her, then dashes to her. The scene rewinds, showing Enrique bouncing off a red sedan. Howard grabs Anna as the explosion shrinks to black. Marksmen watch from rooftops as the President's motorcade heads to the plaza. President Ashton is on a call with Cavic and another agent. The motorcade stops under a bridge where Ted Heinkin enters the President's car, hangs up the phone, removes flags from the limo, and places a document in a folder. Ashton gazes out at the crowd in Plaza Mayor. The double's motorcade passes snipers while protesters wave placards. The President's limo enters the hotel's underground parking, guarded by agents. Ashton exits in a bright lot with Heinkin and Phil McCullough, entering an elevator. An agent swipes a card and talks into a radio. Protesters wave an inflatable skull and skeleton hands as Matthews and Holden approach the limo, and Matthews opens the door for the Ashton double. In the elevator, Ashton reviews photos, while McCullough looks guilty. Ashton stares at McCullough, exits the elevator, and Heinkin raises an eyebrow as they follow Ashton. At the plaza, the crowd waves Spanish flags as agents escort Ashton's double to the podium. In his hotel room, Ashton opens the curtains, watching the Plaza Mayor where agents surround the President on the podium. De Soto stands at the lectern. Ashton sees his double on TV, then his double is shot. McCullough grabs the phone as Barnes floors Enrique, and Ashton watches Barnes pinning Enrique down, transfixed before turning away."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Holden and Parson fire from across the highway, causing Howard to flee and refocus on Enrique. An officer lifts Enrique's head as Anna steps onto the highway, narrowly missed by a swerving white car. An ambulance approaches, and Howard runs towards Anna, freezing as it speeds towards her, then dashes to save her. The scene rewinds, showing Enrique hitting a red sedan's windscreen. Howard grabs Anna as an explosion fades to black. Marksmen observe from rooftops as President Ashton's motorcade heads to the plaza. Ashton, on a call with Cavic, is joined by Ted Heinkin, who removes flags from the limo and places a document in a folder. Ashton watches the crowd in Plaza Mayor. The double's motorcade passes snipers while protesters wave placards. The President's limo enters the hotel's underground parking, guarded by agents. Ashton exits with Heinkin and Phil McCullough into an elevator. An agent swipes a card and communicates via radio. Protesters wave inflatable skulls outside as Matthews and Holden approach the limo, and Matthews opens the door for the Ashton double. In the elevator, Ashton reviews photos, McCullough looks guilty, and Ashton stares at him before exiting. At the plaza, the crowd waves Spanish flags as agents escort the double to the podium. In his hotel room, Ashton watches his double on TV, who is then shot. McCullough grabs the phone as Barnes floors Enrique, and Ashton watches live footage of Barnes pinning Enrique, transfixed before turning away."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Holden and Parson, positioned strategically from across the expansive highway, open fire, causing Howard to quickly flee the scene. The camera then zooms back to focus intently on Enrique. The officer, with a sense of urgency, stoops over Enrique's lifeless body and gently lifts his head, just in time to see Anna stepping out onto the busy highway. A white car swerves dramatically to avoid her. Meanwhile, an ambulance motors over the crest of the hill bridge, and Howard, filled with concern, runs along the highway towards Anna. He suddenly freezes in the middle of the road as the speeding ambulance hurdles dangerously towards her, then makes a desperate, mad dash to reach her in time. The picture abruptly freezes, and the events begin to run in reverse, showing Enrique bouncing off the windscreen of a red sedan. Howard, acting swiftly, scoops Anna into his arms as the fiery explosion shrinks into nothingness, fading into blackness. Marksmen, with their eyes trained on the scene, watch from the rooftops of tall buildings as the President's motorcade proceeds towards the bustling plaza. President Ashton is engaged in a conversation on a car phone with Cavic, while another agent sits opposite him. The motorcade comes to a halt in the shadows beneath a bridge, where another man in a dark suit, Ted Heinkin, climbs into the President's car and lowers the phone. Heinkin hangs up the phone with a decisive motion and narrows his eyes, removing two flags from the bonnet of the President's limousine and placing a document into a folder before slamming it shut with finality. Ashton stares gravely out of the window as a seething crowd fills the Plaza Mayor. The double's motorcade passes beneath the watchful eyes of snipers while the crowd of protesters waves placards energetically at the roadside. The President's limo drives into the hotel's underground car park, where government agents stand vigil outside the glass wall of the Hotel Vesta. The President steps out of his limo in a bright, empty parking lot dotted with armed agents, followed closely by Heinkin and the silver-haired Phil McCullough as they enter an elevator. A besuited agent runs a swipe card through a machine and speaks into a radio. Outside the Plaza Mayor, protesters wave an inflatable skull and two skeleton hands as Matthews and Holden cross to the limousine, and Matthews opens the door for the Ashton double. Inside the elevator, Ashton reads through a folder filled with large photographs, while a guilty-looking McCullough appears awkward and then averts his gaze. Ashton stares at McCullough, then steps out of the elevator, and Heinkin raises an eyebrow as they follow Ashton down a long corridor. At the plaza, the crowd waves Spanish flags enthusiastically as the Secret Service agents escort Ashton's double to the podium. In his hotel room, Ashton opens the curtains and gazes out of the window at the Plaza Mayor, where the Secret Service agents take strategic positions around the President on the red-carpeted podium. De Soto stands at the lectern. Ashton sees his double on TV, and then, shockingly, his double is shot. McCullough quickly grabs the phone as Barnes floors Enrique, and Ashton watches live footage of Barnes pinning Enrique down. Ashton is transfixed by the unfolding events and then turns away."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Holden and Parson, strategically positioned from their vantage point across the expansive, wide highway, open fire, prompting Howard to rapidly flee the scene in a hurry. The camera then dramatically zooms back to focus intently and closely on Enrique. The police officer, filled with a sense of urgency and determination, stoops over Enrique's lifeless body, gently lifting his head with care, just in time to catch sight of Anna stepping out onto the bustling, busy highway. A white car swerves dramatically and sharply to avoid her, creating a tense atmosphere. Meanwhile, an ambulance motors over the crest of the hill bridge, its sirens wailing as Howard, filled with rising concern, runs desperately along the highway towards Anna. He suddenly freezes in his tracks, right in the middle of the road, as the speeding ambulance hurdles dangerously in her direction, then makes a desperate, mad dash to try to reach her in time. Suddenly, the picture abruptly freezes, and the sequence of events begins to run in reverse, showing Enrique as he bounces off the windscreen of a red sedan. Howard, acting swiftly and without hesitation, scoops Anna into his arms as the fiery explosion that had occurred shrinks into nothingness, fading into blackness. Marksmen, with their sharp eyes trained intently on the unfolding scene, watch from the rooftops of tall buildings as the President's motorcade proceeds slowly towards the bustling and crowded plaza. President Ashton is engaged deeply in a conversation over a car phone with Cavic, while another agent sits opposite him, observing silently. The motorcade comes to a halt in the shadows cast beneath a bridge, where another man in a dark suit, known as Ted Heinkin, climbs into the President's car and decisively lowers the phone. With a decisive motion, Heinkin hangs up the phone and narrows his eyes, carefully removing two flags from the bonnet of the President's limousine and placing a significant document into a folder before slamming it shut with finality. Ashton stares gravely and intently out of the window, as a seething, energetic crowd fills the expansive Plaza Mayor. The double's motorcade passes smoothly beneath the watchful eyes of vigilant snipers, while the crowd of protesters waves placards energetically by the roadside. The President's limousine drives purposefully into the hotel's underground car park, where government agents stand vigilantly outside the glass wall of the Hotel Vesta. The President steps out of his limousine into a bright, empty parking lot dotted with armed agents, followed closely by Heinkin and the silver-haired Phil McCullough as they all enter an elevator together. A besuited agent swiftly runs a swipe card through a machine and speaks with authority into a radio. Outside in the Plaza Mayor, protesters vigorously wave an inflatable skull and two skeleton hands as Matthews and Holden cross to the limousine, and Matthews respectfully opens the door for the Ashton double. Inside the elevator, Ashton reads meticulously through a folder filled with large, detailed photographs, while a guilty-looking McCullough appears awkward, his eyes eventually averting. Ashton fixes a stare on McCullough, then steps confidently out of the elevator, and Heinkin raises an eyebrow as they both follow Ashton down a long, echoing corridor. At the plaza, the enthusiastic crowd waves Spanish flags energetically as the Secret Service agents escort Ashton's double to the podium. In his hotel room, Ashton opens the curtains, gazing out of the window at the Plaza Mayor, where the Secret Service agents take strategic positions around the President on the red-carpeted podium. De Soto stands at the lectern, ready to speak. Astonishingly, Ashton sees his double on TV, and then, shockingly, his double is shot. McCullough quickly grabs the phone, reacting with urgency as Barnes floors Enrique, and Ashton watches the live footage of Barnes pinning Enrique down. Ashton is transfixed by the unfolding events, unable to look away, and then he eventually turns away from the scene."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Holden and Parson, positioned strategically across the highway, begin firing their weapons, causing Howard to react instinctively by fleeing the scene. As the chaos unfolds, the camera quickly zooms back to focus on Enrique, capturing the tense moment. The officer, with a sense of urgency, stoops over Enrique's lifeless body, gently lifting his head to assess the situation. At that moment, Anna steps out onto the highway, her presence causing a white car to swerve abruptly to avoid a collision. Meanwhile, an ambulance emerges over the crest of the hill bridge, its sirens blaring as it speeds towards the scene. Howard, driven by a sense of duty, sprints along the highway towards Anna, but suddenly freezes in the middle of the road, paralyzed by the sight of the ambulance hurtling towards her at high speed. In a split second, he makes a desperate, mad dash to reach her in time. The scene then dramatically freezes, and the events begin to run in reverse, showing Enrique's body bouncing off the windscreen of a red sedan. In a moment of heroism, Howard scoops Anna into his arms, shielding her as the fiery explosion that had erupted moments before now shrinks into nothingness, fading into blackness. Meanwhile, marksmen stationed on the rooftops of tall buildings keep a vigilant watch as the President's motorcade makes its way towards the plaza. Inside the car, President Ashton is engaged in a conversation on a car phone with Cavic, while another agent sits opposite him, listening intently. The motorcade comes to a halt in the shadows beneath a bridge, where Ted Heinkin, another man in a dark suit, climbs into the President's car. Heinkin lowers the phone, hangs it up, and narrows his eyes with determination. He then removes two flags from the bonnet of the President's limousine and places a document into a folder, slamming it shut with finality. Ashton, with a grave expression, stares out of the window, observing the seething crowd that fills the Plaza Mayor. The double's motorcade continues its journey, passing beneath the watchful eyes of snipers, while the crowd of protesters waves placards energetically at the roadside. The President's limo then drives into the hotel's underground car park, where government agents stand watch outside the glass wall of the Hotel Vesta. In the bright, empty parking lot, dotted with armed agents, the President steps out of his limo, followed closely by Heinkin and the silver-haired Phil McCullough, as they make their way into an elevator. A besuited agent, maintaining security protocols, runs a swipe card through a machine and communicates into a radio. Outside the Plaza Mayor, protesters wave an inflatable skull and two skeleton hands, adding to the charged atmosphere. Matthews and Holden cross to the limousine, where Matthews opens the door for the Ashton double. Inside the elevator, Ashton reviews a folder filled with large photographs, while McCullough, feeling guilty, looks awkwardly away. Ashton, sensing the tension, stares at McCullough before stepping out of the elevator, with Heinkin raising an eyebrow as they follow Ashton down a corridor. At the plaza, the crowd waves Spanish flags enthusiastically as Secret Service agents escort Ashton's double to the podium. In his hotel room, Ashton opens the curtains and gazes out of the window at the Plaza Mayor, where Secret Service agents take strategic positions around the President on the red-carpeted podium. De Soto stands at the lectern, ready to address the crowd. Ashton watches his double on TV, and in a shocking turn of events, his double is shot. McCullough, reacting swiftly, grabs the phone as Barnes takes decisive action, flooring Enrique. Ashton, glued to the live footage, watches as Barnes pins Enrique down, his attention completely absorbed by the unfolding drama, before finally turning away."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Holden and Parson open fire from across the highway, causing Howard to flee and refocus the camera on Enrique. The officer lifts Enrique's head and sees Anna step onto the highway, narrowly avoiding a swerving white car. As an ambulance approaches, Howard runs toward Anna, freezing momentarily before dashing to save her. The scene rewinds, showing Enrique's collision with a red sedan, and Howard rescues Anna as an explosion reverses into darkness. Meanwhile, marksmen observe from rooftops as President Ashton's motorcade heads to the plaza. Ashton, on a call with Cavic, is joined by Ted Heinkin, who enters the car, ends the call, and removes flags from the limousine before securing a document. Ashton gazes out at the crowd in Plaza Mayor as his double's motorcade passes under sniper watch, with protesters waving placards. The President's limo enters the hotel's underground parking, where agents stand guard. Ashton exits the limo with Heinkin and Phil McCullough, entering an elevator. An agent swipes a card and communicates via radio. Outside, protesters wave an inflatable skull and skeleton hands as Matthews and Holden approach the limo, and Matthews opens the door for the Ashton double. In the elevator, Ashton reviews photographs while McCullough appears uneasy. Ashton exits the elevator, followed by Heinkin, who raises an eyebrow. At the plaza, the crowd waves Spanish flags as Secret Service agents escort Ashton's double to the podium. In his hotel room, Ashton watches his double on TV, who is then shot. McCullough grabs the phone as Barnes subdues Enrique, and Ashton, transfixed by the live footage, turns away."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Holden and Parson, skilled operatives known for their precision, open fire from across the highway, prompting Howard, an experienced detective, to flee and then zoom the camera back on Enrique. The officer stoops over Enrique's body and gently lifts his head, seeing Anna step out onto the highway as a white car, part of the bustling traffic common near urban centers, swerves to avoid her. An ambulance, responding to the chaotic scene, motors over the crest of the hill bridge, and Howard runs along the highway towards Anna. He freezes in the middle of the road as the speeding ambulance hurdles towards her, then makes a mad dash for her. The picture freezes and the events run in reverse, showing Enrique bouncing from the windscreen of a red sedan, a vehicle type often involved in high-speed accidents. Howard scoops Anna in his arms as the fiery explosion shrinks into nothing, into blackness.\n\nMarksmen, equipped with high-powered rifles, watch from the rooftops of tall buildings as the President's motorcade, a symbol of national importance and security, proceeds towards the plaza. President Ashton is on a car phone, a secure line designed to maintain communication during transit, with Cavic and another agent sitting opposite him. The motorcade halts in the shadows beneath a bridge where another dark-suited man, Ted Heinkin, a trusted advisor, climbs into the President's car and lowers the phone. Heinkin hangs up the phone and narrows his eyes, removing two flags, symbols of authority and diplomatic presence, from the bonnet of the President's limousine and putting a document in a folder before slamming it shut. Ashton stares gravely out of the window as a seething crowd fills the Plaza Mayor, a historic and politically significant square in many cities. \n\nThe double's motorcade passes beneath the watchful snipers while the crowd of protesters waves placards at the roadside, expressing their discontent. The President's limo drives into the hotel's underground car park where government agents, trained in tactical response, stand watch outside the glass wall of the Hotel Vesta, a renowned establishment in the area. The President gets out of his limo in a bright, empty parking lot dotted with armed agents, a standard security measure, followed by Heinkin and silver-haired Phil McCullough into an elevator. A besuited agent runs a swipe card through a machine, a security protocol, and talks into a radio. An inflatable skull and two skeleton hands are waved by protesters outside the Plaza Mayor as Matthews and Holden cross to the limousine, and Matthews opens the door for the Ashton double. In the elevator, Ashton reads through a folder of large photographs, critical intelligence documents, while a guilty McCullough looks awkward and then looks away. Ashton stares at McCullough, then steps out of the elevator, and Heinkin raises an eyebrow, a gesture of suspicion, as they follow Ashton down a corridor.\n\nAt the plaza, the crowd waves Spanish flags, underscoring the location's cultural backdrop, as the Secret Service agents escort Ashton's double to the podium. In his hotel room, Ashton opens the curtains and gazes out of the window of the Plaza Mayor where the Secret Service agents take positions around the President on the red-carpeted podium, a traditional setting for formal announcements. De Soto, a notable figure, stands at the lectern. Ashton sees his double on TV and then his double is shot. McCullough grabs the phone as Barnes, a seasoned operative, floors Enrique, and Ashton watches live footage of Barnes pinning Enrique down. Ashton is transfixed and then turns."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Holden and Parson open fire from across the highway prompting Howard to flee and then zoom the camera back on Enrique. The officer stoops over Enrique's body and gently lifts his head seeing Anna step out onto the highway as a white car swerves to avoid her. An ambulance motors over the crest of the hill bridge and Howard runs along the highway towards Anna. He freezes in the middle of the road as the speeding ambulance hurdles towards her then makes a mad dash for her. The picture freezes and the events run in reverse showing Enrique bouncing from the windscreen of a red sedan. Howard scoops Anna in his arms as the fiery explosion shrinks into nothing into blackness. Marksmen watch from the rooftops of tall buildings as the President's motorcade proceeds towards the plaza. President Ashton is on a car phone with Cavic and another agent sitting opposite him. The motorcade halts in the shadows beneath a bridge where another darksuited man Ted Heinkin climbs into the President's car and lowers the phone. Heinkin hangs up the phone and narrows his eyes removing two flags from the bonnet of the President's limousine and putting a document in a folder before slamming it shut. Ashton stares gravely out of the window as a seething crowd fills the Plaza Mayor. The double's motorcade passes beneath the watchful snipers while the crowd of protesters waves placards at the roadside. The President's limo drives into the hotel's underground car park where government agents stand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. watch outside the glass wall of the Hotel Vesta. The President gets out of his limo in a bright empty parking lot dotted with armed agents followed by Heinkin and silverhaired Phil McCullough into an elevator. A besuited agent runs a swipe card through a machine and talks into a radio. An inflatable skull and two skeleton hands are waved by protesters outside the Plaza Mayor as Matthews and Holden cross to the limousine and Matthews opens the door for the Ashton double. In the elevator Ashton reads through a folder of large photographs while a guilty McCullough looks awkward and then looks away. Ashton stares at McCullough then steps out of the elevator and Heinkin raises an eyebrow as they follow Ashton down a corridor. At the plaza the crowd waves Spanish flags as the Secret Service agents escort Ashton's double to the podium. In his hotel room Ashton opens the curtains and gazes out of the window of the Plaza Mayor where the Secret Service agents take positions around the President on the redcarpeted podium. De Soto stands at the lectern. Ashton sees his double on TV and then his double is shot. McCullough grabs the phone as Barnes floors. Enrique and Ashton watches live footage of Barnes pinning Enrique down. Ashton is transfixed and then turns."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Holden and Parson open fire from across the highway prompting Howard to flee and then zoom the camera back on Enrique. The officer stoops over Enrique's body and gently lifts his head seeing Anna step out onto the highway as a white car swerves to avoid her. An ambulance motors over the crest of the hill bridge and Howard runs along the highway towards Anna. He freezes in the middle of the road as the speeding ambulance hurdles towards her then makes a mad dash for her. The picture freezes and the events run in reverse showing Enrique bouncing from the windscreen of a red sedan. Howard scoops Anna in his arms as the fiery explosion shrinks into nothing into blackness. Marksmen watch from the rooftops of tall buildings as the President's motorcade proceeds towards the plaza. President Ashton is on a car phone with Cavic and another agent sitting opposite him. The motorcade halts in the shadows beneath a bridge where another darksuited man Ted Heinkin climbs into the President's car and lowers the phone. Heinkin hangs up the phone and narrows his eyes removing two flags from the bonnet of the President's limousine and putting a document in a folder before slamming it shut. Ashton stares gravely out of the window as a seething crowd fills the Plaza Mayor. The double's motorcade passes beneath the watchful snipers while the crowd of protesters waves placards at the roadside. The President's limo drives into the hotel's underground car park where government agents stand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. watch outside the glass wall of the Hotel Vesta. The President gets out of his limo in a bright empty parking lot dotted with armed agents followed by Heinkin and silverhaired Phil McCullough into an elevator. A besuited agent runs a swipe card through a machine and talks into a radio. An inflatable skull and two skeleton hands are waved by protesters outside the Plaza Mayor as Matthews and Holden cross to the limousine and Matthews opens the door for the Ashton double. In the elevator Ashton reads through a folder of large photographs while a guilty McCullough looks awkward and then looks away. Ashton stares at McCullough then steps out of the elevator and Heinkin raises an eyebrow as they follow Ashton down a corridor. At the plaza the crowd waves Spanish flags as the Secret Service agents escort Ashton's double to the podium. In his hotel room Ashton opens the curtains and gazes out of the window of the Plaza Mayor where the Secret Service agents take positions around the President on the redcarpeted podium. De Soto stands at the lectern. Ashton sees his double on TV and then his double is shot. McCullough grabs the phone as Barnes floors. Enrique and Ashton watches live footage of Barnes pinning Enrique down. Ashton is transfixed and then turns."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Holden and Parson open fire from across the highway prompting Howard to flee and then zoom the camera back on Enrique. The officer stoops over Enrique's body and gently lifts his head seeing Anna step out onto the highway as a white car swerves to avoid her. An ambulance motors over the crest of the hill bridge and Howard runs along the highway towards Anna. He freezes in the middle of the road as the speeding ambulance hurdles towards her then makes a mad dash for her. The picture freezes and the events run in reverse showing Enrique bouncing from the windscreen of a red sedan. Howard scoops Anna in his arms as the fiery explosion shrinks into nothing into blackness. Marksmen watch from the rooftops of tall buildings as the President's motorcade proceeds towards the plaza. In his hotel room Ashton opens the curtains and gazes out of the window of the Plaza Mayor where the Secret Service agents take positions around the President on the redcarpeted podium. De Soto stands at the lectern. Ashton sees his double on TV and then his double is shot. McCullough grabs the phone as Barnes floors. Enrique and Ashton watches live footage of Barnes pinning Enrique down. Ashton is transfixed and then turns."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Holden and Parson open fire from across the highway prompting Howard to flee and then zoom the camera back on Enrique. The officer stoops over Enrique's body and gently lifts his head seeing Anna step out onto the highway as a white car swerves to avoid her. An ambulance motors over the crest of the hill bridge and Howard runs along the highway towards Anna. McCullough grabs the phone as Barnes floors. Enrique and Ashton watches live footage of Barnes pinning Enrique down. Ashton is transfixed and then turns."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Brenda and Edwin unleash arrows from across the riverbank, prompting Julian to scamper and then angle the telescope back on Miguel. The detective crouches over Miguel's backpack and lightly nudges its zipper, spotting Lisa step into the river as a blue bicycle veers to skid past her. A fire truck wheels over the peak of the hill path, and Julian dances along the riverbank towards Lisa. He pauses in the middle of the trail as the rushing fire truck barrels towards her, then makes a frantic leap for her. The animation pauses and the scenes unravel backwards, showing Miguel ricocheting from the bumper of a yellow scooter. Julian gathers Lisa in his elbows as the blazing fireball retracts into oblivion, into darkness. Archers observe from the treetops of towering oaks as the King's chariot progresses towards the square. King Oliver is on a tablet with Trevor and another guard reclining next to him. The chariot pauses in the shade beneath a tunnel where another cloaked figure, Roger Pletkin, hops into the King's carriage and mutes the tablet. Pletkin silences the tablet and squints, removing two scarves from the bonnet of the King's carriage and inserting a map in a pouch before snapping it shut. Oliver gazes somberly out of the porthole as a simmering mob occupies the Central Courtyard. The impostor's chariot glides beneath the vigilant archers while the assembly of demonstrators waves banners at the roadside. The King's carriage rolls into the castle's subterranean garage where palace guards patrol outside the crystal barrier of the Villa Aurora. The King exits his carriage in a gleaming, barren garage scattered with armored guards, followed by Pletkin and silver-maned Neil Hargrove into an escalator. A uniformed guard inserts a key card through a slot and converses into a walkie-talkie. An inflatable dragon and two pirate swords are hoisted by activists outside the Central Courtyard as Roberts and Brenda trek to the carriage, and Roberts unlocks the door for the Oliver impostor. In the escalator, Oliver reviews a portfolio of oversized illustrations, while an uneasy Hargrove shifts awkwardly and then averts his gaze. Oliver scrutinizes Hargrove, then exits the escalator, and Pletkin arches a nostril as they tail Oliver down a passageway. At the courtyard, the mob flutters Italian flags as the Royal Guards escort Oliver's impostor to the stage. In his villa suite, Oliver parts the blinds and peers through the porthole of the Central Courtyard where the Royal Guards assume posts around the King on the emerald-carpeted stage. Ramirez stands at the pedestal. Oliver glimpses his impostor on the monitor and then his impostor is struck. Hargrove snatches the tablet as Parker punches Miguel, and Oliver observes live transmission of Parker pinning Miguel down. Oliver is mesmerized and then pivots."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Holden and Parson fire from the highway, causing Howard to zoom the camera to Enrique, whose body is being examined by an officer. As Anna steps onto the highway, a white car swerves, and Howard races to her as an ambulance speeds toward them. Events rewind, showing Enrique hit by a sedan. Howard rescues Anna, reversing a fiery explosion. Marksmen watch as President Ashton’s motorcade approaches the plaza. Ashton, on the phone, is joined by Ted Heinkin, who removes the limousine flags and places a document in a folder. Ashton watches a seething crowd in Plaza Mayor. The President enters an underground car park, followed by Heinkin and Phil McCullough. In the elevator, Ashton reads photos while McCullough appears guilty. Ashton exits as Heinkin raises an eyebrow. Outside, protesters wave flags and banners as Secret Service agents escort Ashton's double to the podium. In the hotel, Ashton watches his double on TV, who is then shot. McCullough grabs the phone as Barnes captures Enrique, and Ashton is transfixed by the live footage."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Ashton is transfixed and then turns Enrique and Ashton watches live footage of Barnes pinning Enrique down  McCullough grabs the phone as Barnes floors  Ashton sees his double on TV and then his double is shot  De Soto stands at the lectern  In his hotel room Ashton opens the curtains and gazes out of the window of the Plaza Mayor where the Secret Service agents take positions around the President on the redcarpeted podium  At the plaza the crowd waves Spanish flags as the Secret Service agents escort Ashton's double to the podium  Ashton stares at McCullough then steps out of the elevator and Heinkin raises an eyebrow as they follow Ashton down a corridor  In the elevator Ashton reads through a folder of large photographs while a guilty McCullough looks awkward and then looks away  An inflatable skull and two skeleton hands are waved by protesters outside the Plaza Mayor as Matthews and Holden cross to the limousine and Matthews opens the door for the Ashton double  A besuited agent runs a swipe card through a machine and talks into a radio  The President gets out of his limo in a bright empty parking lot dotted with armed agents followed by Heinkin and silverhaired Phil McCullough into an elevator  watch outside the glass wall of the Hotel Vesta  The President's limo drives into the hotel's underground car park where government agents stand  The double's motorcade passes beneath the watchful snipers while the crowd of protesters waves placards at the roadside  Ashton stares gravely out of the window as a seething crowd fills the Plaza Mayor  Heinkin hangs up the phone and narrows his eyes removing two flags from the bonnet of the President's limousine and putting a document in a folder before slamming it shut  The motorcade halts in the shadows beneath a bridge where another darksuited man Ted Heinkin climbs into the President's car and lowers the phone  President Ashton is on a car phone with Cavic and another agent sitting opposite him  Marksmen watch from the rooftops of tall buildings as the President's motorcade proceeds towards the plaza  Howard scoops Anna in his arms as the fiery explosion shrinks into nothing into blackness  The picture freezes and the events run in reverse showing Enrique bouncing from the windscreen of a red sedan  He freezes in the middle of the road as the speeding ambulance hurdles towards her then makes a mad dash for her  An ambulance motors over the crest of the hill bridge and Howard runs along the highway towards Anna  The officer stoops over Enrique's body and gently lifts his head seeing Anna step out onto the highway as a white car swerves to avoid her  Holden and Parson open fire from across the highway prompting Howard to flee and then zoom the camera back on Enrique "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The officer stoops over Enrique's body and gently lifts his head seeing Anna step out onto the highway as a white car swerves to avoid her Holden and Parson open fire from across the highway prompting Howard to flee and then zoom the camera back on Enrique He freezes in the middle of the road as the speeding ambulance hurdles towards her then makes a mad dash for her An ambulance motors over the crest of the hill bridge and Howard runs along the highway towards Anna Howard scoops Anna in his arms as the fiery explosion shrinks into nothing into blackness The picture freezes and the events run in reverse showing Enrique bouncing from the windscreen of a red sedan President Ashton is on a car phone with Cavic and another agent sitting opposite him Marksmen watch from the rooftops of tall buildings as the President's motorcade proceeds towards the plaza Heinkin hangs up the phone and narrows his eyes removing two flags from the bonnet of the President's limousine and putting a document in a folder before slamming it shut The motorcade halts in the shadows beneath a bridge where another darksuited man Ted Heinkin climbs into the President's car and lowers the phone The double's motorcade passes beneath the watchful snipers while the crowd of protesters waves placards at the roadside Ashton stares gravely out of the window as a seething crowd fills the Plaza Mayor watch outside the glass wall of the Hotel Vesta The President's limo drives into the hotel's underground car park where government agents stand A besuited agent runs a swipe card through a machine and talks into a radio The President gets out of his limo in a bright empty parking lot dotted with armed agents followed by Heinkin and silverhaired Phil McCullough into an elevator In the elevator Ashton reads through a folder of large photographs while a guilty McCullough looks awkward and then looks away An inflatable skull and two skeleton hands are waved by protesters outside the Plaza Mayor as Matthews and Holden cross to the limousine and Matthews opens the door for the Ashton double At the plaza the crowd waves Spanish flags as the Secret Service agents escort Ashton's double to the podium Ashton stares at McCullough then steps out of the elevator and Heinkin raises an eyebrow as they follow Ashton down a corridor De Soto stands at the lectern In his hotel room Ashton opens the curtains and gazes out of the window of the Plaza Mayor where the Secret Service agents take positions around the President on the redcarpeted podium McCullough grabs the phone as Barnes floors Ashton sees his double on TV and then his double is shot Ashton is transfixed and then turns Enrique and Ashton watches live footage of Barnes pinning Enrique down"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "watch outside the glass wall of the Hotel Vesta  The President gets out of his limo in a bright empty parking lot dotted with armed agents followed by Heinkin and silverhaired Phil McCullough into an elevator  A besuited agent runs a swipe card through a machine and talks into a radio  An inflatable skull and two skeleton hands are waved by protesters outside the Plaza Mayor as Matthews and Holden cross to the limousine and Matthews opens the door for the Ashton double  In the elevator Ashton reads through a folder of large photographs while a guilty McCullough looks awkward and then looks away  Ashton stares at McCullough then steps out of the elevator and Heinkin raises an eyebrow as they follow Ashton down a corridor  At the plaza the crowd waves Spanish flags as the Secret Service agents escort Ashton's double to the podium  In his hotel room Ashton opens the curtains and gazes out of the window of the Plaza Mayor where the Secret Service agents take positions around the President on the redcarpeted podium  De Soto stands at the lectern  Ashton sees his double on TV and then his double is shot  McCullough grabs the phone as Barnes floors  Enrique and Ashton watches live footage of Barnes pinning Enrique down  Ashton is transfixed and then turns Holden and Parson open fire from across the highway prompting Howard to flee and then zoom the camera back on Enrique  The officer stoops over Enrique's body and gently lifts his head seeing Anna step out onto the highway as a white car swerves to avoid her  An ambulance motors over the crest of the hill bridge and Howard runs along the highway towards Anna  He freezes in the middle of the road as the speeding ambulance hurdles towards her then makes a mad dash for her  The picture freezes and the events run in reverse showing Enrique bouncing from the windscreen of a red sedan  Howard scoops Anna in his arms as the fiery explosion shrinks into nothing into blackness  Marksmen watch from the rooftops of tall buildings as the President's motorcade proceeds towards the plaza  President Ashton is on a car phone with Cavic and another agent sitting opposite him  The motorcade halts in the shadows beneath a bridge where another darksuited man Ted Heinkin climbs into the President's car and lowers the phone  Heinkin hangs up the phone and narrows his eyes removing two flags from the bonnet of the President's limousine and putting a document in a folder before slamming it shut  Ashton stares gravely out of the window as a seething crowd fills the Plaza Mayor  The double's motorcade passes beneath the watchful snipers while the crowd of protesters waves placards at the roadside  The President's limo drives into the hotel's underground car park where government agents stand "
        }
      ]
    }
  ]
}