{
  "ground_truth": "McCullough proffers the phone as Ashton stares at them soberly, and a bomb explodes on the ground floor of the hotel. Ashton goes to the window and peers down at strewn bodies and flaming debris while McCullough holds out the phone and shoots Ashton a solemn look. A blast blows the door open and throws them to the floor, and a man in a balaclava enters holding a pistol. He dispatches Heinkin, McCullough, and Cavic then trains the pistol on the President, who cowers in a corner. A bright, white flash occurs, and events run in reverse order. Gunshots are fired, and black smoke rises from the bomb blast as the President's double is shot. Ashton sits safely in his limousine while Anna receives an ice cream cone and nods, and seated, Sam smiles at Anna. Veronica talks with a handsome, heavy-featured man, Javier, and she holds up a bracelet. Javier glares at her and flexes his jaw as raven-haired Veronica produces a cell phone and plays him a video of a bound and gagged man in his 20s. He grabs her wrist, takes the bracelet, grabs her head, and glowers, inches from her face, before letting go and striding off. Javier's eyes meet with Enrique's as they pass each other, and Javier walks past curly-haired Marie and pony-tailed Anna. Seated at his table in the cafe, Sam toggles through screens on his PDA phone, uses a touch screen wand to initiate a phone call, and glances at the television. A bellboy answers a phone in the hotel reception, and Felipe the bellboy hangs up the phone as the motorcade enters the underground parking lot. Javier answers his mobile and takes the phone from his ear, then gasps as he approaches the hotel. Sam punches buttons on his phone and talks into the mic of his hands-free kit. On TV, Ashton's double approaches the podium and pushes a button. A police constable scans Javier with a metal detector outside the Hotel Vesta, points at Javier's pocket, and Javier takes out a cell phone. Felipe opens the door for a woman entering the hotel. Javier approaches, shakes a man’s hand, placing a small envelope into it, and enters the lobby, which is filled with Secret Service agents. Javier talks into his cell phone as he passes the suited agents, lowers his phone, and calls an elevator. He turns the credit card-sized envelope in his hands. Sam steps out of the cafe onto the sunny street, the wire from his hands-free kit trailing down his white T-shirt to the phone in his hand, as the huge enclosed square of the plaza is surrounded by terra cotta colored buildings. Inside, Sam, holding a small Spanish flag, strolls to the back of the crowd.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "McCullough offers the handset as Ashton gazes at them gravely, and a bomb detonates on the ground floor of the inn. Ashton moves to the window and looks down at scattered bodies and blazing wreckage while McCullough extends the handset and gives Ashton a grave look. An explosion blasts the entryway open and hurls them to the floor, and a man in a balaclava enters wielding a firearm. He eliminates Heinkin, McCullough, and Cavic then aims the firearm on the Leader, who cringes in a corner. A bright, white flash happens, and incidents occur in reverse sequence. Gunshots are discharged, and black smoke ascends from the bomb detonation as the Leader's double is shot. Ashton sits safely in his limousine while Anna obtains an ice cream cone and nods, and seated, Sam grins at Anna. Veronica converses with a dashing, broad-featured man, Javier, and she raises a bangle. Javier glares at her and clenches his jaw as raven-haired Veronica reveals a mobile phone and plays him a video of a bound and gagged man in his 20s. He grasps her wrist, takes the bangle, seizes her head, and scowls, inches from her visage, before releasing and striding off. Javier's eyes connect with Enrique's as they pass each other, and Javier walks past curly-haired Marie and pony-tailed Anna. Seated at his table in the cafe, Sam switches through displays on his PDA handset, uses a touch screen stylus to initiate a phone call, and glances at the screen. A bellboy answers a handset in the inn lobby, and Felipe the bellboy hangs up the handset as the cavalcade enters the underground parking area. Javier answers his mobile and takes the handset from his ear, then gasps as he approaches the inn. Sam presses buttons on his handset and speaks into the mic of his hands-free kit. On TV, Ashton's double approaches the dais and presses a button. A police officer scans Javier with a metal detector outside the Hotel Vesta, points at Javier's pocket, and Javier takes out a mobile phone. Felipe opens the entryway for a woman entering the inn. Javier approaches, shakes a man’s hand, placing a small packet into it, and enters the foyer, which is filled with Secret Service agents. Javier speaks into his mobile phone as he passes the suited agents, lowers his handset, and summons an elevator. He turns the credit card-sized packet in his hands. Sam steps out of the cafe onto the sunny street, the wire from his hands-free kit trailing down his white T-shirt to the handset in his hand, as the huge enclosed square of the plaza is surrounded by terra cotta colored edifices. Inside, Sam, holding a small Spanish banner, strolls to the back of the crowd."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The phone is proffered by McCullough as they are stared at soberly by Ashton, and on the ground floor of the hotel, a bomb explodes. The window is approached by Ashton, who peers down at strewn bodies and flaming debris while the phone is held out by McCullough, who shoots Ashton a solemn look. The door is blown open by a blast and they are thrown to the floor, and a man in a balaclava enters holding a pistol. Heinkin, McCullough, and Cavic are dispatched by him before the pistol is trained on the President, who cowers in a corner. A bright, white flash occurs, events then run in reverse order. Gunshots are fired, and from the bomb blast, black smoke rises as the President's double is shot. Ashton is seated safely in his limousine while an ice cream cone is received by Anna, who nods, and Sam, seated, smiles at Anna. A conversation is had by Veronica with a handsome, heavy-featured man, Javier, as a bracelet is held up by her. Javier glares at her and flexes his jaw as a cell phone is produced by raven-haired Veronica, who plays him a video of a bound and gagged man in his 20s. Her wrist is grabbed by him, the bracelet is taken, her head is grabbed, and glowers are exchanged inches from her face, before she is let go and he strides off. Javier's eyes meet Enrique's as they pass each other, and curly-haired Marie and pony-tailed Anna are walked past by Javier. Screens on his PDA phone are toggled through by Sam, seated at his table in the cafe, he initiates a phone call with a touch screen wand, and glances at the television. A phone in the hotel reception is answered by a bellboy, and the phone is hung up by Felipe the bellboy as the underground parking lot is entered by the motorcade. Javier answers his mobile, takes the phone from his ear, then gasps as he approaches the hotel. Buttons are punched on his phone by Sam, and he talks into the mic of his hands-free kit. On TV, the podium is approached by Ashton's double, who pushes a button. Javier is scanned by a police constable with a metal detector outside the Hotel Vesta, who points at Javier's pocket, and a cell phone is taken out by Javier. The door is opened by Felipe for a woman entering the hotel. A man’s hand is shaken by Javier as he approaches, a small envelope is placed into it, and the lobby, filled with Secret Service agents, is entered. Into his cell phone, Javier talks as he passes the suited agents, lowers his phone, and an elevator is called. The credit card-sized envelope is turned in his hands. The cafe is exited by Sam, who steps out onto the sunny street, as trailing down his white T-shirt to the phone in his hand is the wire from his hands-free kit, while the huge enclosed square of the plaza is surrounded by terra cotta colored buildings. Inside, a small Spanish flag is held by Sam, who strolls to the back of the crowd."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "McCullough offers the phone as Ashton stares seriously, and a bomb detonates on the hotel's ground floor. Ashton looks out the window at bodies and debris while McCullough holds the phone, giving Ashton a solemn glance. A blast blows the door open, hurling them to the floor, as a man in a balaclava with a pistol enters. He shoots Heinkin, McCullough, and Cavic, then aims at the President, who crouches in a corner. A bright flash occurs, reversing events. Gunshots are fired, black smoke rises, and the President's double is shot. Ashton sits safely in his limo while Anna gets an ice cream cone and nods, as seated Sam smiles at her. Veronica talks to a handsome man, Javier, while holding a bracelet. Javier glares at her, flexing his jaw as Veronica shows a video of a bound man. He grabs her wrist, takes the bracelet, glares inches from her face, then leaves. Javier's eyes meet Enrique's as they pass each other, and Javier walks by curly-haired Marie and pony-tailed Anna. In the cafe, Sam scrolls through screens on his phone, uses a wand to call, and glances at the TV. Felipe the bellboy hangs up as the motorcade enters the parking lot. Javier answers, gasping as he nears the hotel. Sam talks into his hands-free mic. On TV, Ashton's double approaches the podium and presses a button. A constable scans Javier with a detector at Hotel Vesta, points at his pocket, and Javier takes out a cell phone. Felipe opens the door for a woman entering. Javier shakes a man’s hand, placing an envelope, and enters the lobby filled with Secret Service agents. Javier speaks on his phone, lowers it, then calls an elevator, turning the envelope in his hands. Sam exits the cafe onto a sunny street, the wire from his hands-free kit trailing to his phone. Inside, Sam, holding a small Spanish flag, walks to the back of the crowd."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "McCullough offers Ashton the phone just as a ground-floor hotel bomb detonates. Ashton peers from a window at bodies and flaming debris; McCullough solemnly holds the phone. A blast forces the door open, thrusting them to the floor. A masked man enters, killing Heinkin, McCullough, and Cavic, and aims at the President, huddled in fear. A bright flash reverses events: gunfire sounds, smoke lifts, and the President's double is shot. Safe in his limo, Ashton watches Anna receive ice cream and nod with Sam smiling nearby. Veronica, conversing with Javier, shows him a bracelet and a video of a bound man. Javier takes the bracelet, grabs Veronica's wrist and head, then releases her and leaves. Javier briefly meets Enrique's gaze as he passes Marie and Anna. Sam, at a cafe, flips through his PDA, makes a call, and watches TV. A hotel bellboy fields a call as the motorcade enters parking. Javier answers his phone, stunned as he nears the hotel. Sam uses his hands-free kit and watches TV as Ashton's double takes the podium. A police officer scans Javier for metal, leading him to reveal a cell phone. Felipe admits a woman into the hotel; Javier greets a man, handing him an envelope, and enters the agent-filled lobby. He dials on his cell phone while examining a small envelope. Sam exits to the street, hands-free wire trailing from his shirt, while holding a small Spanish flag, he moves to the crowd's rear in the plaza surrounded by terracotta buildings."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "McCullough extends the phone towards Ashton, who looks back at them with a serious and thoughtful expression in his eyes. Suddenly, an explosion shakes the ground floor of the hotel. Moving quickly to the window, Ashton peers down to witness the chaos below—bodies are scattered amidst smoldering, flaming debris. Meanwhile, McCullough still holds out the phone, offering a grim look towards Ashton. The force of a blast violently blows open the door, thrusting them onto the floor, and a man wearing a balaclava bursts into the room brandishing a pistol. He quickly and efficiently eliminates Heinkin, McCullough, and Cavic, before focusing his attention on the President, who is desperately cowering in a corner. An intense, bright, white flash suddenly envelops the scene, and in a surreal twist, events begin to unfold in reverse. Gunshots echo through the air once more, black smoke billows up from the detonation's aftermath, as the President's stand-in is struck down. Meanwhile, safely seated inside his limousine, Ashton remains unscathed. Elsewhere, Anna receives an ice cream cone with a nod, and seated nearby, Sam sends her a warm smile. During this, Veronica engages in conversation with a striking, heavy-featured man named Javier. She brandishes a bracelet, which catches his attention, and he fixes her with a intense glare, his jaw muscles flexing. The raven-haired Veronica produces a cell phone, using it to show him a video of a young man in his 20s who is bound and gagged. Javier reacts by seizing her wrist, snatching the bracelet, gripping her head, and glaring menacingly just inches from her face, before releasing her and striding purposefully away. As they cross paths, Javier exchanges a glance with Enrique, continuing past two distinct women: Marie with her curly hair and Anna with her ponytail. Meanwhile, seated at a table in a bustling cafe, Sam navigates through the screens on his PDA phone, skillfully operating the touch screen wand to initiate a phone call, momentarily glancing at the television screen in front of him. In the hotel reception, a bellboy responds to a ringing phone, and Felipe the bellboy places the receiver back as the motorcade makes its way into the subterranean parking area. As Javier answers his mobile phone, he removes it from his ear and gasps while approaching the hotel. Sam, meanwhile, presses buttons on his device, speaking into the microphone of his hands-free kit. On television, Ashton's double is seen confidently approaching the podium and pressing a button. Outside the Hotel Vesta, a vigilant police constable meticulously scans Javier with a metal detector, pointing out something in Javier's pocket, prompting him to take out a cell phone. Felipe courteously opens the door for a woman making her entrance into the hotel. As Javier makes his way forward, he shakes hands with a man, discreetly slipping a small envelope into his hand before entering the lobby filled with alert Secret Service agents. Javier, speaking into his cell phone, lowers it briefly to call for an elevator. In his hands, he turns over the credit card-sized envelope, contemplating it. Sam steps out from the cafe onto the sunlit street, the wire from his hands-free kit dangling down to his white T-shirt and connecting to the phone in his hand. The expansive plaza is impressively enclosed by buildings adorned with the warm hues of terra cotta. Inside this vibrant scene, Sam, a small Spanish flag in his hand, makes his way to the rear of the gathered crowd."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "McCullough, with a deliberate and steady motion, extends the phone towards Ashton, who meets their gaze with a serious and contemplative expression deeply etched in his eyes. Suddenly, without any warning, a powerful explosion jolts the ground floor of the hotel with a deafening roar. Reacting swiftly, Ashton rushes to the window and peers down anxiously, witnessing the chaos unfolding below—the ground is littered with bodies scattered amid smoldering and flaming debris. Meanwhile, McCullough, still holding the phone out, turns towards Ashton with a grim and foreboding expression. The force of another blast violently tears open the door, throwing them onto the hard floor, just as a man clad in a sinister balaclava bursts into the room, brandishing a deadly pistol. With shocking speed and ruthless efficiency, he eliminates Heinkin, McCullough, and Cavic, before turning his lethal focus on the President, who is desperately cowering, terrified, in a corner. An intense flash of bright, white light engulfs the scene, and in a surreal and unexpected twist, events begin to rewind in reverse. The echo of gunshots reverberates through the air once more, and black smoke rises ominously from what's left behind by the detonation's devastating aftermath, as the President's stand-in is struck down. Meanwhile, inside the secure confines of his limousine, Ashton remains unharmed. In another part of the city, Anna receives an ice cream cone with a gracious nod, and seated nearby, Sam sends her a warm, friendly smile. All the while, Veronica is deeply engaged in a conversation with a striking, heavy-featured man by the name of Javier. She flashes a bracelet that immediately captures his attention, and he fixes her with an intense, penetrating glare, his jaw muscles visibly flexing in response. The raven-haired Veronica retrieves a cell phone from her pocket, using it to show him a video of a young man in his 20s, bound and gagged. Javier reacts with sudden aggression, seizing her wrist, snatching the bracelet, and gripping her head menacingly as he glares just inches from her face before abruptly releasing her and striding away purposefully. As they cross paths, Javier exchanges a significant glance with Enrique before continuing past two distinct women: Marie, known for her curly hair, and Anna, recognizable by her ponytail. Meanwhile, in a bustling cafe, Sam sits at a table, skillfully navigating through the screens on his PDA phone, using the touch screen wand with expertise to initiate a phone call, briefly glancing at the television screen in front of him. At the hotel reception, a bellboy responds to a ringing phone, and Felipe the bellboy places the receiver back as the motorcade moves into the subterranean parking area. As Javier answers his mobile phone, he removes it from his ear with a gasp while approaching the hotel. Sam, on the other hand, presses buttons on his device and speaks into the microphone of his hands-free kit. On television, Ashton's double is confidently approaching the podium, pressing a button with determination. Outside the Hotel Vesta, a vigilant police constable meticulously scans Javier with a metal detector, pointing out something suspicious in Javier's pocket, prompting him to produce a cell phone. Felipe, with courteous manners, opens the door for a woman making her entrance into the hotel. As Javier proceeds forward, he shakes hands with a man, discreetly slipping a small envelope into his hand before entering the lobby, bustling with alert Secret Service agents. Speaking into his cell phone, Javier briefly lowers it to call for an elevator. He turns over the credit card-sized envelope in his hands, contemplating it with intensity. Sam steps out from the cafe onto the sunlit street, the wire from his hands-free kit dangling down to his white T-shirt and connecting to the phone in his hand. The expansive plaza is impressively enclosed by buildings adorned with the warm, inviting hues of terra cotta. Amidst this vibrant scene, Sam, holding a small Spanish flag in his hand, weaves his way to the rear of the gathered crowd."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "McCullough extends the phone toward Ashton, who is staring at them with a serious expression, when suddenly a bomb detonates on the ground floor of the hotel. Ashton moves swiftly to the window, straining to see the chaos below where bodies are scattered and debris is aflame, while McCullough continues to hold out the phone, casting Ashton a grave look. A violent blast abruptly forces the door open, propelling them both to the ground as a man wearing a balaclava storms in, brandishing a pistol. He efficiently eliminates Heinkin, McCullough, and Cavic, before directing the weapon towards the President, who is now crouched in a corner in fear. In an unexpected turn, a bright white flash occurs, causing events to rewind. Gunshots ring out amidst the rising black smoke from the bomb blast, while the President's double is struck down. Meanwhile, Ashton is safe and sound, seated in his limousine, as Anna receives an ice cream cone and acknowledges with a nod. Sam, meanwhile, sits smiling at Anna. Veronica finds herself in conversation with a handsome, strong-featured man named Javier, and she raises a bracelet in her hand. Javier responds with a fierce glare, his jaw tightening as Veronica, with her raven hair, pulls out a cell phone and shows him a video of a young man in his 20s, bound and gagged. Reacting swiftly, Javier seizes her wrist, snatches the bracelet, clutches her head, glaring intensely mere inches from her face before releasing her and walking away with determination. As Javier strides off, his eyes momentarily lock with Enrique's as they pass each other, and Javier continues past Marie, who has curly hair, and Anna, who wears a ponytail. Meanwhile, Sam sits at his cafe table, cycling through screens on his PDA phone; he uses a touch screen wand to make a phone call and checks the television for updates. The bellboy at the hotel reception answers a call, and after a brief conversation, Felipe the bellboy hangs up just as the motorcade rolls into the underground parking lot. As Javier answers his mobile, he suddenly pulls the phone away from his ear and gasps upon approaching the hotel. Sam, in the meantime, is busy pressing buttons on his phone and speaking into the mic of his hands-free kit. On television, Ashton's double steps up to the podium and presses a button. Outside the Hotel Vesta, a police constable runs a metal detector over Javier, gesturing towards Javier's pocket, prompting him to pull out a cell phone. As Felipe holds the door open for a woman entering the hotel, Javier approaches a man, shakes his hand, subtly passing a small envelope into it, and makes his way into the lobby, which is bustling with Secret Service agents. As he weaves through the suited agents, Javier speaks into his cell phone, lowers it, and proceeds to call an elevator, studying the credit card-sized envelope he holds. Sam exits the cafe, stepping onto the bright, sunny street, the cord from his hands-free kit dangling from his white T-shirt to the phone clutched in his hand, as around him, the expansive, enclosed square of the plaza is encircled by terra cotta colored buildings. Inside this vibrant setting, Sam, with a small Spanish flag in hand, leisurely walks to the rear of the crowd."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "McCullough offers the phone as Ashton soberly watches, then a bomb explodes on the hotel’s ground floor. Ashton peers from the window at the chaos below while McCullough gives him a solemn look. When a blast blows the door open, they are thrown to the floor, and a man in a balaclava enters, shooting Heinkin, McCullough, and Cavic before aiming at the cowering President. A bright flash reverses events; gunshots and black smoke follow as the President's double is shot. Meanwhile, Ashton is safe in his limousine as Anna receives an ice cream cone, nodding at Sam, who smiles at her. Veronica shows a bracelet to Javier, a handsome man, and then plays a video of a bound man on her phone. Javier reacts by grabbing her wrist, taking the bracelet, and confronting her before walking off. Javier briefly exchanges looks with Enrique and passes Marie and Anna. In a cafe, Sam uses his PDA to make a call and glances at the TV. Felipe the bellboy hangs up the hotel phone as the motorcade enters the parking lot. Javier answers his mobile but is startled as he approaches the hotel. Sam talks into his hands-free mic while Ashton's double is shown on TV. Outside Hotel Vesta, a police constable checks Javier with a metal detector, and Javier hands over his phone. Felipe opens a door for a woman entering the hotel as Javier discreetly hands an envelope during a handshake and enters the lobby filled with Secret Service agents. Javier, on his phone, lowers it to call an elevator, inspecting a credit card-sized envelope. Sam exits the cafe onto the sunny street with his hands-free wire trailing, walking toward the plaza surrounded by terra cotta buildings, holding a Spanish flag as he moves through the crowd."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "McCullough proffers the phone as Ashton, a high-ranking government official known for his calm demeanor, stares at them soberly, and a bomb explodes on the ground floor of the Hotel Vesta, a renowned luxury hotel in the city center. Ashton goes to the window and peers down at strewn bodies and flaming debris from what was once the elegant hotel lobby, while McCullough holds out the phone and shoots Ashton a solemn look, aware of the gravity of the unfolding situation. A blast, reminiscent of the series of coordinated attacks in recent years, blows the door open and throws them to the floor, and a man in a balaclava, a mask commonly used in covert operations, enters holding a pistol. He swiftly and efficiently dispatches Heinkin, McCullough, and Cavic, trained operatives in the Secret Service, then trains the pistol on the President, who cowers in a corner, a move uncharacteristic for a leader known for his courage. A bright, white flash occurs, and events eerily run in reverse order. Gunshots are fired, and black smoke rises ominously from the bomb blast as the President's double, a common security measure to protect high-value targets, is shot. Ashton sits safely in his armored limousine while Anna, a young girl blissfully unaware of the chaos, receives an ice cream cone and nods, and seated at a nearby café, Sam smiles at Anna, perhaps knowing she is his niece. Veronica talks with a handsome, heavy-featured man, Javier, who is rumored to have ties with an international espionage agency, and she holds up a bracelet, a piece of jewelry suspected to contain a hidden microchip. Javier glares at her and flexes his jaw as raven-haired Veronica, an undercover operative, produces a cell phone and plays him a video of a bound and gagged man in his 20s, likely used as leverage. He grabs her wrist, takes the bracelet, grabs her head, and glowers, inches from her face, before letting go and striding off, his mind racing with the possibilities of betrayal. Javier's eyes meet with Enrique's, another agent in deep cover, as they pass each other, and Javier walks past curly-haired Marie and pony-tailed Anna, both seemingly innocuous civilians. Seated at his table in the cafe, Sam, a tech-savvy analyst, toggles through screens on his PDA phone, a precursor to modern smartphones, uses a touch screen wand to initiate a phone call, and glances at the television, which shows a live report of the ongoing crisis. A bellboy answers a phone in the hotel reception, and Felipe, the dedicated bellboy working to support his family, hangs up the phone as the motorcade enters the underground parking lot. Javier answers his mobile and takes the phone from his ear, then gasps as he approaches the hotel, realizing the implications of the call. Sam punches buttons on his phone and talks into the mic of his hands-free kit, a common accessory for those on the go. On TV, Ashton's double, indistinguishable from the real Ashton, approaches the podium and pushes a button, setting off another sequence of events. A police constable scans Javier with a metal detector outside the Hotel Vesta, a standard security procedure, points at Javier's pocket, and Javier takes out a cell phone, a vital tool for communication in espionage. Felipe opens the door for a woman entering the hotel, unaware of her possible significance. Javier approaches, shakes a man’s hand, placing a small envelope, likely containing sensitive information, into it, and enters the lobby, which is filled with Secret Service agents, each trained to respond to any threat. Javier talks into his cell phone as he passes the suited agents, lowers his phone, and calls an elevator, a calculated move towards his next objective. He turns the credit card-sized envelope in his hands, pondering its contents. Sam steps out of the cafe onto the sunny street, the wire from his hands-free kit trailing down his white T-shirt to the phone in his hand, as the huge enclosed square of the plaza is surrounded by terra cotta-colored buildings, a hallmark of the historic district. Inside, Sam, holding a small Spanish flag, an emblem of his dual heritage, strolls to the back of the crowd, blending in seamlessly."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "McCullough proffers the phone as Ashton stares at them soberly and a bomb explodes on the ground floor of the hotel. Ashton goes to the window and peers down at strewn bodies and flaming debris while McCullough holds out the phone and shoots Ashton a solemn look. A blast blows the door open and throws them to the floor and a man in a balaclava enters holding a pistol. He dispatches Heinkin McCullough and Cavic then trains the pistol on the President who cowers in a corner. A bright white flash occurs and events run in reverse order. Gunshots are fired and black smoke rises from the bomb blast as the President's double is shot. Ashton sits safely in his limousine while Anna receives an ice cream cone and nods and seated. Sam smiles at Anna. Veronica talks with a handsome heavyfeatured man Javier and she holds up a bracelet. Javier glares at her and flexes his jaw as ravenhaired Veronica produces a cell phone and plays him a video of a bound and gagged man in his 20s. He grabs her wrist takes the bracelet grabs her head and glowers inches from her face before letting go and striding off. Javier's eyes meet with Enrique's as they pass each other and Javier walks past curlyhaired Marie and ponytailed Anna. Seated at his table in the cafe. Sam toggles through screens on his PDA phone uses a touch screen wand to initiate a phone call and glances at the television. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. A bellboy answers a phone in the hotel reception and Felipe the bellboy hangs up the phone as the motorcade enters the underground parking lot. Javier answers his mobile and takes the phone from his ear then gasps as he approaches the hotel. Sam punches buttons on his phone and talks into the mic of his handsfree kit. On TV Ashton's double approaches the podium and pushes a button. A police constable scans Javier with a metal detector outside the Hotel. Vesta points at Javier's pocket and Javier takes out a cell phone. Felipe opens the door for a woman entering the hotel. Javier approaches shakes a man’s hand placing a small envelope into it and enters the lobby which is filled with Secret Service agents. Javier talks into his cell phone as he passes. the suited agents lowers his phone and calls an elevator. He turns the credit cardsized envelope in his hands. Sam steps out of the cafe onto the sunny street. the wire from his handsfree kit trailing down his white Tshirt to the phone in his hand as the huge enclosed square of the plaza is surrounded by terra cotta colored buildings. Inside Sam holding a small Spanish flag strolls to the back of the crowd."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "McCullough proffers the phone as Ashton stares at them soberly and a bomb explodes on the ground floor of the hotel. Ashton goes to the window and peers down at strewn bodies and flaming debris while McCullough holds out the phone and shoots Ashton a solemn look. A blast blows the door open and throws them to the floor and a man in a balaclava enters holding a pistol. He dispatches Heinkin McCullough and Cavic then trains the pistol on the President who cowers in a corner. A bright white flash occurs and events run in reverse order. Gunshots are fired and black smoke rises from the bomb blast as the President's double is shot. Ashton sits safely in his limousine while Anna receives an ice cream cone and nods and seated. Sam smiles at Anna. Veronica talks with a handsome heavyfeatured man Javier and she holds up a bracelet. Javier glares at her and flexes his jaw as ravenhaired Veronica produces a cell phone and plays him a video of a bound and gagged man in his 20s. He grabs her wrist takes the bracelet grabs her head and glowers inches from her face before letting go and striding off. Javier's eyes meet with Enrique's as they pass each other and Javier walks past curlyhaired Marie and ponytailed Anna. Seated at his table in the cafe. Sam toggles through screens on his PDA phone uses a touch screen wand to initiate a phone call and glances at the television. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. A bellboy answers a phone in the hotel reception and Felipe the bellboy hangs up the phone as the motorcade enters the underground parking lot. Javier answers his mobile and takes the phone from his ear then gasps as he approaches the hotel. Sam punches buttons on his phone and talks into the mic of his handsfree kit. On TV Ashton's double approaches the podium and pushes a button. A police constable scans Javier with a metal detector outside the Hotel. Vesta points at Javier's pocket and Javier takes out a cell phone. Felipe opens the door for a woman entering the hotel. Javier approaches shakes a man’s hand placing a small envelope into it and enters the lobby which is filled with Secret Service agents. Javier talks into his cell phone as he passes. the suited agents lowers his phone and calls an elevator. He turns the credit cardsized envelope in his hands. Sam steps out of the cafe onto the sunny street. the wire from his handsfree kit trailing down his white Tshirt to the phone in his hand as the huge enclosed square of the plaza is surrounded by terra cotta colored buildings. Inside Sam holding a small Spanish flag strolls to the back of the crowd."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "McCullough proffers the phone as Ashton stares at them soberly and a bomb explodes on the ground floor of the hotel. Ashton goes to the window and peers down at strewn bodies and flaming debris while McCullough holds out the phone and shoots Ashton a solemn look. A blast blows the door open and throws them to the floor and a man in a balaclava enters holding a pistol. He dispatches Heinkin McCullough and Cavic then trains the pistol on the President who cowers in a corner. A bright white flash occurs and events run in reverse order. Gunshots are fired and black smoke rises from the bomb blast as the President's double is shot. Ashton sits safely in his limousine while Anna receives an ice cream cone and nods and seated. Javier approaches shakes a man’s hand placing a small envelope into it and enters the lobby which is filled with Secret Service agents. Javier talks into his cell phone as he passes. the suited agents lowers his phone and calls an elevator. He turns the credit cardsized envelope in his hands. Sam steps out of the cafe onto the sunny street. the wire from his handsfree kit trailing down his white Tshirt to the phone in his hand as the huge enclosed square of the plaza is surrounded by terra cotta colored buildings. Inside Sam holding a small Spanish flag strolls to the back of the crowd."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "McCullough proffers the phone as Ashton stares at them soberly and a bomb explodes on the ground floor of the hotel. Ashton goes to the window and peers down at strewn bodies and flaming debris while McCullough holds out the phone and shoots Ashton a solemn look. A blast blows the door open and throws them to the floor and a man in a balaclava enters holding a pistol. Sam steps out of the cafe onto the sunny street. the wire from his handsfree kit trailing down his white Tshirt to the phone in his hand as the huge enclosed square of the plaza is surrounded by terra cotta colored buildings. Inside Sam holding a small Spanish flag strolls to the back of the crowd."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Barnaby hands over the calculator as Madison gazes at them cheerfully, and a fire hydrant erupts in the basement of the cathedral. Madison approaches the bookshelf and gazes out at scattered toys and dancing flames while Barnaby extends the calculator and gives Madison a cheerful glance. A gust slams the window open and tumbles them to the couch, and an owl in a fedora swoops in grasping a lantern. It eliminates Hadley, Barnaby, and Shelby then aims the lantern at the Monarch, who quakes in a pantry. A vibrant, green glow appears, and moments proceed in forward sequence. Arrows are launched, and purple mist billows from the fire hydrant eruption as the Monarch's twin is tickled. Madison lounges comfortably in her convertible while Ellie grabs a hot dog and winks, and lounging, Max winks at Ellie. Lila chats with a charismatic, slender-nosed woman, Hector, and she holds up a necklace. Hector scowls at her and clenches his nostrils as blonde-haired Lila presents a camera and shows her a clip of a freed and laughing woman in her 30s. She seizes Lila's ankle, takes the necklace, pulls her hair, and frowns, centimeters from her elbow, before releasing and parading off. Hector's ears lock with Edgar's as they bypass each other, and Hector strides past curly-haired Mona and braided Ellie. Poised at his stall in the bazaar, Max scrolls through apps on his tablet, uses a stylus pen to start a video call, and peeks at the laptop. A chef dials a number in the lobby desk, and Giorgio the chef hangs up the number as the parade drives into the open courtyard. Hector answers his pager and removes the pager from his nose, then shouts as he nears the cathedral. Max taps icons on his tablet and whispers into the mic of his headset. On the laptop, Madison's twin reaches the lectern and flicks a dial. A security guard examines Hector with an X-ray device outside the Cathedral Luna, gestures at Hector's shoe, and Hector pulls out a pager. Giorgio swings the curtain for a child entering the cathedral. Hector approaches, grasps a woman's toe, placing a large sticker into it, and strides into the atrium, which is packed with royal guards. Hector whispers into his pager as he bypasses the uniformed guards, lowers his pager, and signals a conveyor. He spins the post-it sized sticker in his paws. Max exits the bazaar onto the bright sidewalk, the cord from his headset snaking down his red hoodie to the tablet in his paw, as the expansive enclosed courtyard of the pavilion is bordered by mint green clad towers. Inside, Max, clutching a tiny French flag, saunters to the front of the gathering."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "McCullough offers Ashton a phone as a bomb detonates on the hotel’s ground floor. Ashton observes the chaos below while McCullough maintains a serious demeanor. A blast propels them to the floor, followed by an armed man executing Heinkin, McCullough, and Cavic, then targeting the President in the corner. A bright flash rewinds events: gunfire erupts, smoke billows, and the President's double is shot. Meanwhile, Ashton remains safe in his limousine; Anna nods over ice cream, and Sam smiles at her. Veronica shows Javier a bracelet, playing a video of a captive man on her phone. Javier is visibly angry but releases her after taking the bracelet. Their tense encounter ends as Javier and Enrique cross paths. In the hotel, a bellboy answers a call as Javier, reacting to a call, gasps near the hotel. Sam operates his phone and watches the news as Ashton's double approaches a podium. Outside, Javier is screened by a police officer and hands an envelope to a man before entering the lobby filled with agents. As Javier maneuvers through, he calls an elevator and examines an envelope. Sam exits a cafe, with his hands-free kit connected to his phone, and joins the crowd in the plaza surrounded by terra cotta buildings."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Inside Sam holding a small Spanish flag strolls to the back of the crowd the wire from his handsfree kit trailing down his white Tshirt to the phone in his hand as the huge enclosed square of the plaza is surrounded by terra cotta colored buildings Sam steps out of the cafe onto the sunny street He turns the credit cardsized envelope in his hands the suited agents lowers his phone and calls an elevator Javier talks into his cell phone as he passes Javier approaches shakes a man’s hand placing a small envelope into it and enters the lobby which is filled with Secret Service agents Felipe opens the door for a woman entering the hotel Vesta points at Javier's pocket and Javier takes out a cell phone A police constable scans Javier with a metal detector outside the Hotel On TV Ashton's double approaches the podium and pushes a button Sam punches buttons on his phone and talks into the mic of his handsfree kit Javier answers his mobile and takes the phone from his ear then gasps as he approaches the hotel A bellboy answers a phone in the hotel reception and Felipe the bellboy hangs up the phone as the motorcade enters the underground parking lot Sam toggles through screens on his PDA phone uses a touch screen wand to initiate a phone call and glances at the television Seated at his table in the cafe Javier's eyes meet with Enrique's as they pass each other and Javier walks past curlyhaired Marie and ponytailed Anna He grabs her wrist takes the bracelet grabs her head and glowers inches from her face before letting go and striding off Javier glares at her and flexes his jaw as ravenhaired Veronica produces a cell phone and plays him a video of a bound and gagged man in his 20s Veronica talks with a handsome heavyfeatured man Javier and she holds up a bracelet Sam smiles at Anna Ashton sits safely in his limousine while Anna receives an ice cream cone and nods and seated Gunshots are fired and black smoke rises from the bomb blast as the President's double is shot A bright white flash occurs and events run in reverse order He dispatches Heinkin McCullough and Cavic then trains the pistol on the President who cowers in a corner A blast blows the door open and throws them to the floor and a man in a balaclava enters holding a pistol Ashton goes to the window and peers down at strewn bodies and flaming debris while McCullough holds out the phone and shoots Ashton a solemn look McCullough proffers the phone as Ashton stares at them soberly and a bomb explodes on the ground floor of the hotel"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Ashton goes to the window and peers down at strewn bodies and flaming debris while McCullough holds out the phone and shoots Ashton a solemn look McCullough proffers the phone as Ashton stares at them soberly and a bomb explodes on the ground floor of the hotel He dispatches Heinkin McCullough and Cavic then trains the pistol on the President who cowers in a corner A blast blows the door open and throws them to the floor and a man in a balaclava enters holding a pistol Gunshots are fired and black smoke rises from the bomb blast as the President's double is shot A bright white flash occurs and events run in reverse order Sam smiles at Anna Ashton sits safely in his limousine while Anna receives an ice cream cone and nods and seated Javier glares at her and flexes his jaw as ravenhaired Veronica produces a cell phone and plays him a video of a bound and gagged man in his 20s Veronica talks with a handsome heavyfeatured man Javier and she holds up a bracelet Javier's eyes meet with Enrique's as they pass each other and Javier walks past curlyhaired Marie and ponytailed Anna He grabs her wrist takes the bracelet grabs her head and glowers inches from her face before letting go and striding off Sam toggles through screens on his PDA phone uses a touch screen wand to initiate a phone call and glances at the television Seated at his table in the cafe Javier answers his mobile and takes the phone from his ear then gasps as he approaches the hotel A bellboy answers a phone in the hotel reception and Felipe the bellboy hangs up the phone as the motorcade enters the underground parking lot On TV Ashton's double approaches the podium and pushes a button Sam punches buttons on his phone and talks into the mic of his handsfree kit Vesta points at Javier's pocket and Javier takes out a cell phone A police constable scans Javier with a metal detector outside the Hotel Javier approaches shakes a man’s hand placing a small envelope into it and enters the lobby which is filled with Secret Service agents Felipe opens the door for a woman entering the hotel the suited agents lowers his phone and calls an elevator Javier talks into his cell phone as he passes Sam steps out of the cafe onto the sunny street He turns the credit cardsized envelope in his hands Inside Sam holding a small Spanish flag strolls to the back of the crowd the wire from his handsfree kit trailing down his white Tshirt to the phone in his hand as the huge enclosed square of the plaza is surrounded by terra cotta colored buildings"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "A bellboy answers a phone in the hotel reception and Felipe the bellboy hangs up the phone as the motorcade enters the underground parking lot Javier answers his mobile and takes the phone from his ear then gasps as he approaches the hotel Sam punches buttons on his phone and talks into the mic of his handsfree kit On TV Ashton's double approaches the podium and pushes a button A police constable scans Javier with a metal detector outside the Hotel Vesta points at Javier's pocket and Javier takes out a cell phone Felipe opens the door for a woman entering the hotel Javier approaches shakes a man’s hand placing a small envelope into it and enters the lobby which is filled with Secret Service agents Javier talks into his cell phone as he passes the suited agents lowers his phone and calls an elevator He turns the credit cardsized envelope in his hands Sam steps out of the cafe onto the sunny street the wire from his handsfree kit trailing down his white Tshirt to the phone in his hand as the huge enclosed square of the plaza is surrounded by terra cotta colored buildings Inside Sam holding a small Spanish flag strolls to the back of the crowd McCullough proffers the phone as Ashton stares at them soberly and a bomb explodes on the ground floor of the hotel Ashton goes to the window and peers down at strewn bodies and flaming debris while McCullough holds out the phone and shoots Ashton a solemn look A blast blows the door open and throws them to the floor and a man in a balaclava enters holding a pistol He dispatches Heinkin McCullough and Cavic then trains the pistol on the President who cowers in a corner A bright white flash occurs and events run in reverse order Gunshots are fired and black smoke rises from the bomb blast as the President's double is shot Ashton sits safely in his limousine while Anna receives an ice cream cone and nods and seated Sam smiles at Anna Veronica talks with a handsome heavyfeatured man Javier and she holds up a bracelet Javier glares at her and flexes his jaw as ravenhaired Veronica produces a cell phone and plays him a video of a bound and gagged man in his 20s He grabs her wrist takes the bracelet grabs her head and glowers inches from her face before letting go and striding off Javier's eyes meet with Enrique's as they pass each other and Javier walks past curlyhaired Marie and ponytailed Anna Seated at his table in the cafe Sam toggles through screens on his PDA phone uses a touch screen wand to initiate a phone call and glances at the television"
        }
      ]
    }
  ]
}