{
  "ground_truth": "Mrs. Gump looks into a sitting room and informs the boarders about dinner. She looks into Forrest's room, hears singing coming from another room, and walks over to a closed door. Mrs. Gump opens the door, revealing a young man with long sideburns playing the guitar and singing. Meanwhile, Forrest holds onto a broom and dances oddly, his legs rocking back and forth to the guitar. The young man is Elvis Presley. Mrs. Gump leaves and closes the door as Elvis sits back down, and Forrest begins to dance again as Elvis plays and sings. Forrest stands left, looks at himself in a mirror, and continues dancing while watching himself. Mrs. Gump and Forrest walk along a sidewalk and later watch television, where Elvis thrusts his hips and sings. Elvis dances in the same manner Forrest did, while a woman in the audience screams and applauds. Mrs. Gump walks away, pulling Forrest with her, and he stops to take one last look as Elvis continues performing on television. Forrest is still sitting on the bus bench, and a black nurse looks at him. Mrs. Gump and Forrest wait for the school bus, which pulls up as Mrs. Gump prepares Forrest for his first day of school. The bus driver opens the door, looks down, and smokes a cigarette, smiling as Forrest steps up into the bus. Mrs. Gump waves to Forrest as the bus drives away. Forrest begins to walk down the aisle, where two young boys look up from their seat. Forrest looks around while a larger girl slides over so he can't sit next to her, shaking her head. He looks to the other side where a boy sits alone on a larger seat, glaring up at Forrest. Forrest continues talking as he sits on the bus bench. Young Forrest is still standing in the aisle on the bus and looks back at Jenny Curran, a young girl about his age. Forrest sits down next to Jenny, who puts her hand out toward him. Forrest reaches over and shakes her hand. Young Jenny and Forrest run toward a large oak tree. Jenny sits on a large branch and calls down to Forrest, who dangles from the branch. Jenny and Forrest sit on a tree branch and read together. Forrest hangs upside down from a branch and swings back and forth, with his braces wedged in the tree. The silhouette of the oak tree shows Jenny and Forrest as they sit on a branch.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Mrs. Gump peers into a lounge and notifies the lodgers about supper. She peers into Forrest's chamber, detects crooning originating from another chamber, and strides over to a shut portal. Mrs. Gump opens the portal, unveiling a youthful gentleman with lengthy sideburns strumming the guitar and crooning. Concurrently, Forrest grasps a broom and gyrates strangely, his limbs swaying to and fro to the guitar. The youthful gentleman is Elvis Presley. Mrs. Gump departs and shuts the portal as Elvis settles back down, and Forrest commences to gyrate again as Elvis strums and croons. Forrest stands left, gazes at himself in a reflector, and persists gyrating while observing himself. Mrs. Gump and Forrest stroll along a walkway and later view television, where Elvis thrusts his hips and croons. Elvis gyrates in the identical manner Forrest did, while a lady in the audience shrieks and claps. Mrs. Gump strolls away, drawing Forrest with her, and he pauses to take one final glance as Elvis persists performing on television. Forrest is still sitting on the coach bench, and a black nurse gazes at him. Mrs. Gump and Forrest await the school coach, which pulls up as Mrs. Gump readies Forrest for his initial day of school. The coach driver opens the portal, gazes down, and smokes a cigarette, grinning as Forrest steps up into the coach. Mrs. Gump waves to Forrest as the coach drives away. Forrest commences to walk down the passageway, where two youthful boys gaze up from their seat. Forrest gazes around while a larger girl slides over so he can't sit adjacent to her, shaking her head. He gazes to the other side where a boy sits solitary on a larger seat, glowering up at Forrest. Forrest persists conversing as he sits on the coach bench. Young Forrest is still standing in the passageway on the coach and gazes back at Jenny Curran, a youthful girl about his age. Forrest settles down adjacent to Jenny, who extends her hand out toward him. Forrest reaches over and shakes her hand. Young Jenny and Forrest sprint toward a large oak tree. Jenny settles on a large bough and calls down to Forrest, who dangles from the bough. Jenny and Forrest sit on a tree bough and peruse together. Forrest hangs upside down from a bough and swings back and forth, with his braces wedged in the tree. The silhouette of the oak tree displays Jenny and Forrest as they sit on a bough."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Mrs. Gump looks into a sitting room and the boarders are informed about dinner by her. Into Forrest's room, she looks, hears singing coming from another room, and a closed door is walked over to by her. The door is opened by Mrs. Gump, revealing a young man with long sideburns playing the guitar and singing. Meanwhile, a broom is held onto by Forrest and he dances oddly, his legs are rocked back and forth to the guitar. The young man is Elvis Presley. The door is closed by Mrs. Gump as she leaves, and Elvis sits back down as Forrest begins to dance again while Elvis plays and sings. Forrest stands left, at himself in a mirror looks, and dancing is continued by him while watching himself. A sidewalk is walked along by Mrs. Gump and Forrest, and later television is watched by them, where Elvis thrusts his hips and sings. Elvis dances in the same manner Forrest did, while the audience screams and applauds by a woman. Away walks Mrs. Gump, pulling Forrest with her, and one last look is taken by him as the performance on television by Elvis is continued. The bus bench is still sat on by Forrest, and at him, a black nurse looks. For the school bus, Mrs. Gump and Forrest wait, which up pulls as for his first day of school, Forrest is prepared by Mrs. Gump. The door is opened by the bus driver, who looks down, and a cigarette is smoked by her, smiling as the bus is stepped up into by Forrest. Mrs. Gump waves to Forrest as the bus away drives. Down the aisle, Forrest begins to walk, where up look two young boys from their seat. Around looks Forrest while over slides a larger girl so he can't be sat next to by him, her head shaking. To the other side, he looks where alone on a larger seat sits a boy, glaring up at Forrest. Talking is continued by Forrest as the bus bench is sat on by him. Young Forrest is still standing in the aisle on the bus and back at Jenny Curran, a young girl about his age, he looks. Next to Jenny, who toward him puts her hand out, Forrest sits down. Over reaches Forrest and shakes her hand. Toward a large oak tree run Jenny and Forrest. On a large branch sits Jenny and calls down to Forrest, who from the branch dangles. On a tree branch, Jenny and Forrest sit and together they read. From a branch, Forrest hangs upside down and swings back and forth, his braces wedged in the tree. The silhouette of the oak tree shows sitting on a branch Jenny and Forrest."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Mrs. Gump informs the boarders about dinner, hears singing, and opens a door to find a young man with long sideburns playing guitar—Elvis Presley. Forrest holds a broom, oddly dancing to the music. Mrs. Gump closes the door as Elvis resumes singing, with Forrest dancing while watching himself in the mirror. Later, Mrs. Gump and Forrest see Elvis on TV, dancing similarly as Forrest did. A woman screams and applauds. Mrs. Gump pulls Forrest away as he pauses to watch Elvis perform on TV. Forrest sits at a bus stop, observed by a nurse. Mrs. Gump and Forrest wait for the school bus, which arrives as she prepares him for his first school day. The bus driver smiles as Forrest boards. Mrs. Gump waves goodbye. As Forrest walks down the aisle, two boys look up and a bigger girl blocks him from sitting. A lone boy on another seat glares. On the bus bench, Forrest talks. Young Forrest sees Jenny Curran, a girl his age, and sits beside her, shaking hands. They run to a large oak tree, where Jenny sits on a branch and calls to Forrest, who dangles. They read together on the tree, with Forrest swinging upside down, braces stuck. Their silhouettes are visible on the oak tree branch."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Mrs. Gump announces dinner to the boarders, checks Forrest's room, hears singing, and finds a young Elvis Presley playing guitar. Forrest dances oddly with a broom to the music. Mrs. Gump leaves, closing the door, as Elvis sings and Forrest watches himself dance in a mirror. Later, Mrs. Gump and Forrest see Elvis on TV, dancing like Forrest, with a woman applauding. They walk away as Forrest takes a last look at Elvis. Sitting on a bus bench, Forrest recalls waiting for the school bus. The driver smiles at Forrest stepping on the bus, while Mrs. Gump waves goodbye. Forrest walks down the aisle, finds a girl rejecting him, and a boy glaring. He continues talking on the bench. Young Forrest stands and notices Jenny Curran. He sits by Jenny, and they shake hands. They run to an oak tree, read together, and swing from a branch. The oak's silhouette shows Jenny and Forrest sitting together."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Mrs. Gump, with a sense of purpose, gazes into the cozy sitting room and informs the boarders politely that dinner is ready and waiting for them. She then turns her attention to Forrest's room, but her curiosity is piqued when she hears the distant sound of singing drifting from another part of the house. Intrigued, she walks over to a closed door from where the music emanates. With a gentle push, Mrs. Gump opens the door, revealing a young man with long, distinctive sideburns strumming a guitar and singing with enthusiasm. In the meantime, Forrest, clutching onto a broom with both hands, dances in a quirky manner, his legs swaying back and forth rhythmically to the guitar's melody. Quite remarkably, the young man is none other than Elvis Presley. After taking in the scene, Mrs. Gump exits the room, carefully closing the door behind her. As she departs, Elvis resumes his seat and continues his performance, while Forrest renews his peculiar dance to the beat of Elvis's music. Forrest stands to the left, glancing at his own reflection in a mirror, and merrily carries on with his dancing, amused by his mirrored image. Later, Mrs. Gump and Forrest find themselves strolling along a sidewalk before settling down to watch the television, where Elvis appears once more, passionately thrusting his hips and singing. His dance moves mirror those that Forrest exhibited earlier, enticing a woman in the audience to scream and applaud with delight. As Mrs. Gump walks away, she gently tugs Forrest along, urging him to come with her. However, he pauses briefly to steal one final glance at Elvis, who continues his lively performance on the screen.\n\nThe scene shifts back, and Forrest is still seated on the bus bench, where a nurse, dressed in a neat black uniform, glances over at him with curiosity. In another moment from the past, Mrs. Gump and Forrest stand patiently at the bus stop, waiting for the school bus to arrive. As the bus finally pulls up, Mrs. Gump helps Forrest get ready for his very first day of school. The bus driver swings the door open, looking down with a friendly smile, cigarette in hand, as Forrest steps up and onto the bus. Mrs. Gump waves goodbye enthusiastically as the bus drives away, carrying Forrest to a new adventure. Inside the bus, Forrest begins to walk down the narrow aisle, where two young boys raise their eyes from their seats to look at him. As Forrest glances around, a larger girl shifts her position to prevent him from sitting next to her, shaking her head disapprovingly. He then looks to the opposite side, where a boy, sitting alone on a spacious seat, glares up at him. Forrest continues his narration as he remains seated on the bus bench. Flashback to young Forrest, still standing in the bus aisle, and he turns to look back at Jenny Curran, a young girl who appears to be around his age. With a welcoming gesture, Forrest takes a seat next to Jenny, who extends her hand toward him in a friendly manner. Forrest, with a kind smile, reaches over and shakes her hand warmly.\n\nThe scene changes once more as young Jenny and Forrest run together toward a majestic, large oak tree. Jenny climbs up and perches on a substantial branch, calling down playfully to Forrest, who dangles effortlessly from the same branch. Together, Jenny and Forrest sit side by side on the branch, engrossed in reading together. Forrest, in a moment of carefree joy, hangs upside down from the branch, swinging back and forth with his braces securely wedged in the tree. The silhouette of the grand oak tree casts a dramatic shadow, showing Jenny and Forrest as they sit contentedly on a branch, surrounded by the serene beauty of nature."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Mrs. Gump, exuding a sense of purpose, casts her gaze into the inviting, cozy sitting room and politely informs the boarders that dinner has been prepared and is ready, waiting for them to enjoy. She then shifts her attention towards Forrest's room, but a hint of curiosity is stirred within her when she hears the faint, melodic sound of singing drifting from another corner of the house. Intrigued and eager to uncover the source of the music, she walks gracefully over to a closed door, the origin of the musical notes. With a gentle, deliberate push, Mrs. Gump opens the door, unveiling a young man with long, distinctive sideburns, passionately strumming a guitar and singing with enthusiastic vigor. Meanwhile, Forrest, grasping onto a broom with both hands, dances in an endearingly quirky manner, his legs swaying rhythmically back and forth to the infectious melody of the guitar. Remarkably, the young man is none other than Elvis Presley himself. After taking a moment to absorb the lively scene, Mrs. Gump quietly exits the room, carefully closing the door behind her with a quiet click. As she departs, Elvis resumes his seat and continues his vibrant performance, while Forrest is quick to renew his peculiar dance to the beat of Elvis's music. Forrest positions himself to the left, catching a glimpse of his reflection in a nearby mirror, and continues his dancing, amused by his own mirrored image. Later on, Mrs. Gump and Forrest are seen strolling leisurely along a sidewalk before settling comfortably to watch television, where Elvis appears once more, passionately thrusting his hips and singing. His charismatic dance moves mirror those that Forrest had exhibited earlier, prompting a woman in the audience to scream with delight and applaud energetically. As Mrs. Gump walks away, she gently tugs Forrest along, urging him to come with her. However, he pauses briefly to cast one final, lingering glance at Elvis, who continues his lively performance on the screen, captivating the audience.\n\nThe scene transitions back, and Forrest is still seated on the bus bench, where a nurse, dressed impeccably in a neat black uniform, glances over at him with genuine curiosity. In a separate moment from the past, Mrs. Gump and Forrest can be seen standing patiently at the bus stop, waiting for the school bus to arrive and take Forrest on his very first day of school. As the bus finally pulls up to the stop, Mrs. Gump assists Forrest in getting ready. The bus driver swings the door open, looking down with a friendly, cigarette-flavored smile, as Forrest steps up and onto the bus. Mrs. Gump waves goodbye enthusiastically as the bus rolls away, carrying Forrest toward a new adventure. Inside the bus, Forrest begins to make his way down the narrow aisle, where two young boys lift their eyes from their seats to look curiously at him. As Forrest glances around, a larger girl shifts her position deliberately to prevent him from sitting beside her, shaking her head disapprovingly. He then looks across to the opposite side, where a lone boy seated on a spacious seat glares up at him. Meanwhile, Forrest continues his narration as he remains seated on the bus bench. Meanwhile, in a flashback, young Forrest is still standing in the bus aisle and turns to look back at Jenny Curran, a young girl who appears to be around his age. With a welcoming gesture, Forrest takes a seat next to Jenny, who reaches out her hand towards him in a friendly manner. Forrest, wearing a kind smile, reaches over and shakes her hand warmly, embracing the start of a new friendship.\n\nThe scene shifts once more, and we see young Jenny and Forrest running together with youthful exuberance toward a majestic, large oak tree. Jenny climbs up skillfully and perches atop a substantial branch, playfully calling down to Forrest, who dangles effortlessly from the same branch. Together, Jenny and Forrest sit side by side on the branch, engrossed in reading, enveloped in a world of shared stories. In a moment of carefree joy, Forrest hangs upside down from the branch, swinging back and forth with his braces securely wedged within the tree branches. The silhouette of the grand oak tree casts a dramatic, expansive shadow, showing Jenny and Forrest as they sit contentedly on a branch, surrounded by the serene and tranquil beauty of nature."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Mrs. Gump peers into the inviting sitting room, taking a brief moment to gather the attention of the boarders gathered there, before gently informing them that dinner is ready, with her voice carrying a sense of warmth and hospitality. She then shifts her attention, turning to glance into Forrest's room momentarily, her senses picking up on the faint sound of singing emanating from another part of the house. Intrigued, she moves in the direction of the sound, her footsteps purposeful as she approaches a closed door. With a deliberate motion, Mrs. Gump turns the doorknob and gently opens the door, unveiling a young man with striking long sideburns who is engrossed in playing the guitar while singing passionately. This young man, though Mrs. Gump might not know it yet, is none other than Elvis Presley. Meanwhile, in a room nearby, young Forrest grips a broom tightly and dances in an odd yet earnest manner, his legs swaying back and forth in rhythm with the guitar's melody. Mrs. Gump quietly exits the room, closing the door behind her as Elvis resumes his seat and continues his musical performance. Forrest, undeterred by her departure, resumes his peculiar dance as Elvis's music fills the air once more. Forrest positions himself to the left, catching a glimpse of his reflection in a nearby mirror. He then continues his dance, captivated by his mirrored movements. Later, Mrs. Gump and Forrest walk serenely along a sidewalk, their pace unhurried, and subsequently find themselves in front of a television, observing as Elvis Presley performs energetically, thrusting his hips to the beat and singing with fervor. In sync with Forrest's earlier dance, Elvis moves in a similar fashion, his captivating performance eliciting cheers and applause from a woman in the audience. Mrs. Gump, sensing it's time to depart, gently tugs at Forrest's arm, guiding him away, but not before he pauses to take one last look at Elvis, who continues his electrifying performance on the television screen. The scene shifts, and Forrest is still seated on a bus bench, his presence noted by an attentive black nurse who gazes at him with curiosity. Transitioning to another moment, Mrs. Gump and Forrest stand in anticipation by the roadside, waiting patiently for the school bus to arrive. As the bus pulls up, Mrs. Gump offers final words of encouragement, preparing Forrest for the significant adventure of his first day of school. The bus driver, a woman with a friendly demeanor, opens the door while exhaling smoke from a cigarette and graces Forrest with a warm, welcoming smile as he steps into the bus. Mrs. Gump, filled with a mixture of pride and apprehension, waves to Forrest as the bus begins its journey away from view. Inside the bus, Forrest initiates his walk down the aisle, where his presence is noted by two young boys who momentarily lift their gaze from their seat to observe him. As Forrest surveys the available seating options, a larger girl on one side shifts her position, sliding over deliberately to prevent Forrest from taking the seat next to her, her body language and the shake of her head conveying clear refusal. His search continuing, Forrest looks to the other side, encountering the stern gaze of a boy sitting alone on a wider seat, who regards him with a glare. As these events unfold, Forrest continues his narrative, speaking animatedly while still perched on the bus bench. Flashing back to young Forrest standing uncertainly in the middle of the bus aisle, he turns his attention to Jenny Curran, a young girl of similar age, seated quietly toward the back. Finding solace in her friendly demeanor, Forrest decides to settle next to Jenny, who acknowledges him by extending her hand in a gesture of friendship. Forrest, with a sense of newfound companionship, reaches over and shakes her hand warmly. Time shifts once more to a picturesque scene where young Jenny and Forrest joyfully race toward a majestic oak tree, their laughter echoing through the air. Jenny confidently climbs onto a large branch and calls down to Forrest, who playfully swings from the branch, his infectious energy evident. Jenny and Forrest then sit side by side on the broad branch, engrossed in a shared moment of reading together, their connection growing. Ever playful, Forrest hangs upside down from the branch, swinging back and forth with carefree abandon, his leg braces inadvertently wedged in the tree, adding a touch of whimsy. The scene concludes with the serene silhouette of the oak tree framing the image of Jenny and Forrest as they sit together on the branch, a quiet testament to their enduring friendship."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Mrs. Gump informs the boarders about dinner, checks Forrest's room, and follows singing to discover Elvis Presley playing the guitar. Meanwhile, Forrest dances with a broom, imitating Elvis's movements. After Mrs. Gump closes the door, Elvis continues playing, and Forrest mirrors his dance while watching himself in the mirror. Later, Mrs. Gump and Forrest walk down a sidewalk and watch Elvis on television, performing with movements similar to Forrest's. As they leave, a woman in the audience on TV cheers for Elvis. Forrest remains seated on the bus bench, observed by a nurse. Transitioning to a memory, Mrs. Gump and Forrest await the school bus for his first day. The bus driver welcomes Forrest aboard, and Mrs. Gump waves as the bus departs. Inside, Forrest navigates through the aisle, facing reluctance from other children to sit beside him until he spots Jenny Curran. He sits next to her, and they shake hands. Forrest and Jenny later play at a large oak tree, climbing and reading together while Forrest swings from a branch with his braces. The scene ends with their silhouettes on the tree."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Mrs. Gump looks into a sitting room, part of a modest boarding house she manages to make ends meet, and informs the boarders about dinner, a simple meal she prepares every evening. She looks into Forrest's room, hears singing coming from another room, and walks over to a closed door. Mrs. Gump opens the door, revealing a young man with long sideburns playing the guitar and singing, a style reminiscent of the rockabilly movement that was gaining popularity. Meanwhile, Forrest holds onto a broom and dances oddly, his legs rocking back and forth to the rhythm of the guitar. The young man is Elvis Presley, who would soon become the King of Rock 'n' Roll, known for his electrifying stage presence. Mrs. Gump leaves and closes the door as Elvis sits back down, and Forrest begins to dance again, mimicking the moves of the soon-to-be iconic performer, as Elvis plays and sings. Forrest stands left, looks at himself in a mirror, and continues dancing while watching himself, imitating the dance styles he just observed. Mrs. Gump and Forrest walk along a sidewalk in their small Alabama town, and later watch television, where Elvis, now a household name, thrusts his hips and sings. Elvis dances in the same manner Forrest did, while a woman in the audience screams and applauds, captivated by his energetic performance. Mrs. Gump walks away, pulling Forrest with her, and he stops to take one last look as Elvis continues performing on television, a black-and-white program typical of the era. Forrest is still sitting on the bus bench, and a black nurse, dressed in her crisp white uniform, looks at him with mild curiosity. Mrs. Gump and Forrest wait for the school bus, which pulls up as Mrs. Gump prepares Forrest for his first day of school, adjusting his shirt and encouraging him with a few gentle words. The bus driver opens the door, a seasoned driver familiar with all the local kids, looks down, and smokes a cigarette, a common habit in the 1950s, smiling as Forrest steps up into the bus. Mrs. Gump waves to Forrest as the bus drives away, her expression a mix of pride and anxiety. Forrest begins to walk down the aisle, where two young boys look up from their seat, likely curious about the new arrival. Forrest looks around while a larger girl slides over so he can't sit next to her, shaking her head, reflecting the initial rejection he often faced from peers. He looks to the other side where a boy sits alone on a larger seat, glaring up at Forrest with an unfriendly demeanor. Forrest continues talking as he sits on the bus bench, reminiscing about these formative experiences. Young Forrest is still standing in the aisle on the bus and looks back at Jenny Curran, a young girl about his age who would become his lifelong friend. Forrest sits down next to Jenny, who puts her hand out toward him in a gesture of friendship. Forrest reaches over and shakes her hand, marking the beginning of a significant relationship in his life. Young Jenny and Forrest run toward a large oak tree, a symbol of stability and growth, on the outskirts of town. Jenny sits on a large branch and calls down to Forrest, who dangles from the branch, demonstrating his playful spirit. Jenny and Forrest sit on a tree branch and read together, sharing stories and dreams under the shade of the tree. Forrest hangs upside down from a branch and swings back and forth, with his braces wedged in the tree, an image of innocence and carefree childhood. The silhouette of the oak tree shows Jenny and Forrest as they sit on a branch, a poignant image of their enduring friendship."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Mrs Gump looks into a sitting room and informs the boarders about dinner. She looks into Forrest's room hears singing coming from another room and walks over to a closed door. Mrs Gump opens the door revealing a young man with long sideburns playing the guitar and singing. Meanwhile Forrest holds onto a broom and dances oddly his legs rocking back and forth to the guitar. The young man is Elvis Presley. Mrs Gump leaves and closes the door as Elvis sits back down and Forrest begins to dance again as Elvis plays and sings. Forrest stands left looks at himself in a mirror and continues dancing while watching himself. Mrs Gump and Forrest walk along a sidewalk and later watch television where Elvis thrusts his hips and sings. Elvis dances in the same manner Forrest did while a woman in the audience screams and applauds. Mrs Gump walks away pulling Forrest with her and he stops to take one last look as Elvis continues performing on television. Forrest is still sitting on the bus bench and a black nurse looks at him. Mrs Gump and Forrest wait for the school bus which pulls up as Mrs Gump prepares Forrest for his first day of school. The bus driver opens the door looks down and smokes a cigarette smiling as Forrest steps up into the bus. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Mrs Gump waves to Forrest as the bus drives away. Forrest begins to walk down the aisle where two young boys look up from their seat. Forrest looks around while a larger girl slides over so he cannot sit next to her shaking her head. He looks to the other side where a boy sits alone on a larger seat glaring up at Forrest. Forrest continues talking as he sits on the bus bench. Young Forrest is still standing in the aisle on the bus and looks back at Jenny Curran a young girl about his age. Forrest sits down next to Jenny who puts her hand out toward him. Forrest reaches over and shakes her hand. Young Jenny and Forrest run toward a large oak tree. Jenny sits on a large branch and calls down to Forrest who dangles from the branch. Jenny and Forrest sit on a tree branch and read together. Forrest hangs upside down from a branch and swings back and forth with his braces wedged in the tree. The silhouette of the oak tree shows Jenny and Forrest as they sit on a branch."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Mrs Gump looks into a sitting room and informs the boarders about dinner. She looks into Forrest's room hears singing coming from another room and walks over to a closed door. Mrs Gump opens the door revealing a young man with long sideburns playing the guitar and singing. Meanwhile Forrest holds onto a broom and dances oddly his legs rocking back and forth to the guitar. The young man is Elvis Presley. Mrs Gump leaves and closes the door as Elvis sits back down and Forrest begins to dance again as Elvis plays and sings. Forrest stands left looks at himself in a mirror and continues dancing while watching himself. Mrs Gump and Forrest walk along a sidewalk and later watch television where Elvis thrusts his hips and sings. Elvis dances in the same manner Forrest did while a woman in the audience screams and applauds. Mrs Gump walks away pulling Forrest with her and he stops to take one last look as Elvis continues performing on television. Forrest is still sitting on the bus bench and a black nurse looks at him. Mrs Gump and Forrest wait for the school bus which pulls up as Mrs Gump prepares Forrest for his first day of school. The bus driver opens the door looks down and smokes a cigarette smiling as Forrest steps up into the bus. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Mrs Gump waves to Forrest as the bus drives away. Forrest begins to walk down the aisle where two young boys look up from their seat. Forrest looks around while a larger girl slides over so he cannot sit next to her shaking her head. He looks to the other side where a boy sits alone on a larger seat glaring up at Forrest. Forrest continues talking as he sits on the bus bench. Young Forrest is still standing in the aisle on the bus and looks back at Jenny Curran a young girl about his age. Forrest sits down next to Jenny who puts her hand out toward him. Forrest reaches over and shakes her hand. Young Jenny and Forrest run toward a large oak tree. Jenny sits on a large branch and calls down to Forrest who dangles from the branch. Jenny and Forrest sit on a tree branch and read together. Forrest hangs upside down from a branch and swings back and forth with his braces wedged in the tree. The silhouette of the oak tree shows Jenny and Forrest as they sit on a branch."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Mrs Gump looks into a sitting room and informs the boarders about dinner. She looks into Forrest's room hears singing coming from another room and walks over to a closed door. Mrs Gump opens the door revealing a young man with long sideburns playing the guitar and singing. Meanwhile Forrest holds onto a broom and dances oddly his legs rocking back and forth to the guitar. The young man is Elvis Presley. Mrs Gump leaves and closes the door as Elvis sits back down and Forrest begins to dance again as Elvis plays and sings. Forrest stands left looks at himself in a mirror and continues dancing while watching himself. Forrest reaches over and shakes her hand. Young Jenny and Forrest run toward a large oak tree. Jenny sits on a large branch and calls down to Forrest who dangles from the branch. Jenny and Forrest sit on a tree branch and read together. Forrest hangs upside down from a branch and swings back and forth with his braces wedged in the tree. The silhouette of the oak tree shows Jenny and Forrest as they sit on a branch."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Mrs Gump looks into a sitting room and informs the boarders about dinner. She looks into Forrest's room hears singing coming from another room and walks over to a closed door. Mrs Gump opens the door revealing a young man with long sideburns playing the guitar and singing. Jenny and Forrest sit on a tree branch and read together. Forrest hangs upside down from a branch and swings back and forth with his braces wedged in the tree. The silhouette of the oak tree shows Jenny and Forrest as they sit on a branch."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Mrs. Herring peers into a library and announces to the bakers about lunch. She glances into Randall’s garage, hears whistling emanating from a different garage, and strolls over to a locked gate. Mrs. Herring unlocks the gate, revealing an elderly woman with short pigtails juggling the ukulele and whistling. Meanwhile, Randall clutches a rake and skips awkwardly, his hands flailing to the ukulele. The elderly woman is Greta Thunberg. Mrs. Herring departs and secures the gate as Greta curls back down, and Randall starts to hop again as Greta juggles and whistles. Randall perches right, gazes at himself in a puddle, and continues hopping while observing himself. Mrs. Herring and Randall shuffle along a corridor and later observe a painting, where Greta taps her feet and whistles. Greta skips in the same way Randall did, while a man in the gallery shouts and cheers. Mrs. Herring stomps away, dragging Randall with her, and he pauses to glimpse one last moment as Greta continues juggling on the canvas. Randall is still reclining on the picnic blanket, and a white doctor examines him. Mrs. Herring and Randall linger for the trolley, which pulls up as Mrs. Herring equips Randall for his first day of lessons. The trolley conductor flips the hatch, glances up, and chews a gum, chuckling as Randall climbs into the trolley. Mrs. Herring salutes to Randall as the trolley glides off. Randall starts to tiptoe down the corridor, where two elderly gentlemen peep over their bench. Randall surveys while a smaller boy nudges closer so he can't recline beside him, nodding his head. He peeks to the opposite side where a girl rests solo on a smaller bench, leering up at Randall. Randall continues humming as he reclines on the picnic blanket. Young Randall is still standing in the corridor on the trolley and looks back at Clara Peterson, a young boy around his age. Randall perches beside Clara, who extends her foot out toward him. Randall leans over and taps her foot. Young Clara and Randall sprint toward a tiny pine bush. Clara perches on a tiny root and calls over to Randall, who swings from the root. Clara and Randall rest on a root and sketch together. Randall dangles upside down from a root and sways side-to-side, with his laces snagged on the bush. The outline of the pine bush shows Clara and Randall as they rest on a root."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Mrs. Gump announces dinner to boarders and then finds Forrest dancing to Elvis Presley's music in his room. As Elvis continues to play and sing, Forrest mimics his moves. Later, Forrest and his mother watch Elvis on TV, and Forrest is captivated by his performance. On Forrest's first school day, Mrs. Gump accompanies him to the bus, which arrives with a friendly driver. Inside, Forrest encounters unfriendly peers but eventually finds a friend in Jenny Curran. They bond by a large oak tree, sharing moments of play and reading. The silhouette of the tree highlights their growing friendship."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The silhouette of the oak tree shows Jenny and Forrest as they sit on a branch Forrest hangs upside down from a branch and swings back and forth with his braces wedged in the tree Jenny and Forrest sit on a tree branch and read together Jenny sits on a large branch and calls down to Forrest who dangles from the branch Young Jenny and Forrest run toward a large oak tree Forrest reaches over and shakes her hand Forrest sits down next to Jenny who puts her hand out toward him Young Forrest is still standing in the aisle on the bus and looks back at Jenny Curran a young girl about his age Forrest continues talking as he sits on the bus bench He looks to the other side where a boy sits alone on a larger seat glaring up at Forrest Forrest looks around while a larger girl slides over so he cannot sit next to her shaking her head Forrest begins to walk down the aisle where two young boys look up from their seat Mrs Gump waves to Forrest as the bus drives away The bus driver opens the door looks down and smokes a cigarette smiling as Forrest steps up into the bus Mrs Gump and Forrest wait for the school bus which pulls up as Mrs Gump prepares Forrest for his first day of school Forrest is still sitting on the bus bench and a black nurse looks at him Mrs Gump walks away pulling Forrest with her and he stops to take one last look as Elvis continues performing on television Elvis dances in the same manner Forrest did while a woman in the audience screams and applauds Mrs Gump and Forrest walk along a sidewalk and later watch television where Elvis thrusts his hips and sings Forrest stands left looks at himself in a mirror and continues dancing while watching himself Mrs Gump leaves and closes the door as Elvis sits back down and Forrest begins to dance again as Elvis plays and sings The young man is Elvis Presley Meanwhile Forrest holds onto a broom and dances oddly his legs rocking back and forth to the guitar Mrs Gump opens the door revealing a young man with long sideburns playing the guitar and singing She looks into Forrest's room hears singing coming from another room and walks over to a closed door Mrs Gump looks into a sitting room and informs the boarders about dinner"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "She looks into Forrest's room hears singing coming from another room and walks over to a closed door Mrs Gump looks into a sitting room and informs the boarders about dinner Meanwhile Forrest holds onto a broom and dances oddly his legs rocking back and forth to the guitar Mrs Gump opens the door revealing a young man with long sideburns playing the guitar and singing Mrs Gump leaves and closes the door as Elvis sits back down and Forrest begins to dance again as Elvis plays and sings The young man is Elvis Presley Mrs Gump and Forrest walk along a sidewalk and later watch television where Elvis thrusts his hips and sings Forrest stands left looks at himself in a mirror and continues dancing while watching himself Mrs Gump walks away pulling Forrest with her and he stops to take one last look as Elvis continues performing on television Elvis dances in the same manner Forrest did while a woman in the audience screams and applauds Mrs Gump and Forrest wait for the school bus which pulls up as Mrs Gump prepares Forrest for his first day of school Forrest is still sitting on the bus bench and a black nurse looks at him Mrs Gump waves to Forrest as the bus drives away The bus driver opens the door looks down and smokes a cigarette smiling as Forrest steps up into the bus Forrest looks around while a larger girl slides over so he cannot sit next to her shaking her head Forrest begins to walk down the aisle where two young boys look up from their seat Forrest continues talking as he sits on the bus bench He looks to the other side where a boy sits alone on a larger seat glaring up at Forrest Forrest sits down next to Jenny who puts her hand out toward him Young Forrest is still standing in the aisle on the bus and looks back at Jenny Curran a young girl about his age Young Jenny and Forrest run toward a large oak tree Forrest reaches over and shakes her hand Jenny and Forrest sit on a tree branch and read together Jenny sits on a large branch and calls down to Forrest who dangles from the branch The silhouette of the oak tree shows Jenny and Forrest as they sit on a branch Forrest hangs upside down from a branch and swings back and forth with his braces wedged in the tree"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Mrs Gump waves to Forrest as the bus drives away Forrest begins to walk down the aisle where two young boys look up from their seat Forrest looks around while a larger girl slides over so he cannot sit next to her shaking her head He looks to the other side where a boy sits alone on a larger seat glaring up at Forrest Forrest continues talking as he sits on the bus bench Young Forrest is still standing in the aisle on the bus and looks back at Jenny Curran a young girl about his age Forrest sits down next to Jenny who puts her hand out toward him Forrest reaches over and shakes her hand Young Jenny and Forrest run toward a large oak tree Jenny sits on a large branch and calls down to Forrest who dangles from the branch Jenny and Forrest sit on a tree branch and read together Forrest hangs upside down from a branch and swings back and forth with his braces wedged in the tree The silhouette of the oak tree shows Jenny and Forrest as they sit on a branch Mrs Gump looks into a sitting room and informs the boarders about dinner She looks into Forrest's room hears singing coming from another room and walks over to a closed door Mrs Gump opens the door revealing a young man with long sideburns playing the guitar and singing Meanwhile Forrest holds onto a broom and dances oddly his legs rocking back and forth to the guitar The young man is Elvis Presley Mrs Gump leaves and closes the door as Elvis sits back down and Forrest begins to dance again as Elvis plays and sings Forrest stands left looks at himself in a mirror and continues dancing while watching himself Mrs Gump and Forrest walk along a sidewalk and later watch television where Elvis thrusts his hips and sings Elvis dances in the same manner Forrest did while a woman in the audience screams and applauds Mrs Gump walks away pulling Forrest with her and he stops to take one last look as Elvis continues performing on television Forrest is still sitting on the bus bench and a black nurse looks at him Mrs Gump and Forrest wait for the school bus which pulls up as Mrs Gump prepares Forrest for his first day of school The bus driver opens the door looks down and smokes a cigarette smiling as Forrest steps up into the bus"
        }
      ]
    }
  ]
}