{
  "ground_truth": "He hands it to her, bows, then heads off. Lizzy watches him for a moment, looks down at the letter, then searches for a comfortable place in which to read it. She settles down on a large tree stump. Lizzy folds up the letter and walks off. Mariah follows her inside and up the stairs. But, Lizzie hurries to her room and shuts the door behind her. Inside, she sits down near a window and opens up the letter again. Lizzie cringes as she remembers her family's improper behavior. Then she looks down at the letter once more. Darcy watches from above as Jane heads out dressed in a grey cloak and bonnet. Lizzie is now walking with Mr. Collins. Mr. Collins goes to bid his farewells to Lizzie. He looks over at his wife and gives her a little wave. She and Lizzie exchange a knowing smile. The horse-drawn carriage pulls away from the parsemage, gathering speed along the country road. Lizzie and Mariah are sitting inside. Mariah has a notebook open. Lizzie leans forward in her seat, looking thoughtful. As she stares out of the window, memories of Darcy pass through her mind. Platter of horses' hooves snaps at the rubbery. Finally, the carriage pulls up outside a busy inn. Lydia opens one of the upper windows excitedly. Lizzie waves up at her and Kitty. Lydia indicates that she'll come down and meet them then closes the window. She embraces her sister warmly then sits back on the bed. He leaves the room. Angrily, she throws down her knife, fork, and napkin. Now, Lizzie's out in the garden, carrying a basket full of flowers. She walks around Jane, who's busy sniffing blooms to put in her truck. Lizzie casts frequent concerned glances over at her sister. She comes over and takes Lizzie's hand. Jane sets off back towards the house, carrying her basket of flowers. As Lizzie is about to follow, her mother appears. Kitty stomps back into the house. Lizzie is with her father. Mr. Bennett gently pulls Lizzie onto a seat beside him. Officers from Wickham's regiment are taking tea at Longbourn. Lydia is having the time of her life. Wickham makes his way over to Lizzie. Lizzie takes a sip of tea. Now, it's the day of Lydia's departure. Lydia waves excitedly at them all as the carriage pulls away. Mrs. Bennet is close to tears. Kitty is fighting back tears of frustration. He heads inside and the girls follow him. Kitty still sobbing. A carriage drawn by four white horses arrives at Longbourn. Lizzie and Jane rush out to meet it. They wave excitedly at the occupants. Four children emerge first from the cab. Lizzie kisses her aunt and uncle.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He hands it to her, bows, then heads off. Lizzy observes him for a moment, glances down at the note, then searches for a cozy spot in which to peruse it. She settles down on a large tree stump. Lizzy folds up the note and walks off. Mariah trails her inside and up the stairs. But, Lizzie hastens to her room and shuts the door behind her. Inside, she sits down near a window and opens up the note again. Lizzie cringes as she recalls her family's improper conduct. Then she glances down at the note once more. Darcy observes from above as Jane heads out dressed in a grey cloak and bonnet. Lizzie is now walking with Mr. Collins. Mr. Collins goes to bid his farewells to Lizzie. He glances over at his wife and gives her a little wave. She and Lizzie exchange a knowing grin. The horse-drawn carriage pulls away from the parsonage, gathering speed along the country road. Lizzie and Mariah are sitting inside. Mariah has a notebook open. Lizzie leans forward in her seat, appearing thoughtful. As she gazes out of the window, recollections of Darcy pass through her mind. Platter of steeds' hooves snaps at the rubbery. Finally, the carriage pulls up outside a bustling inn. Lydia opens one of the upper windows excitedly. Lizzie waves up at her and Kitty. Lydia indicates that she'll come down and meet them then closes the window. She embraces her sister warmly then sits back on the bed. He leaves the room. Angrily, she throws down her knife, fork, and napkin. Now, Lizzie's out in the garden, carrying a basket full of blossoms. She walks around Jane, who's busy sniffing flowers to put in her truck. Lizzie casts frequent concerned glances over at her sister. She comes over and takes Lizzie's hand. Jane sets off back towards the house, carrying her basket of blossoms. As Lizzie is about to follow, her mother appears. Kitty stomps back into the house. Lizzie is with her father. Mr. Bennett gently pulls Lizzie onto a seat beside him. Officers from Wickham's regiment are taking tea at Longbourn. Lydia is having the time of her life. Wickham makes his way over to Lizzie. Lizzie takes a sip of tea. Now, it's the day of Lydia's departure. Lydia waves excitedly at them all as the carriage pulls away. Mrs. Bennet is close to tears. Kitty is fighting back tears of frustration. He heads inside and the girls trail him. Kitty still sobbing. A carriage drawn by four white steeds arrives at Longbourn. Lizzie and Jane rush out to meet it. They wave excitedly at the occupants. Four youngsters emerge first from the cab. Lizzie kisses her aunt and uncle."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "It is handed to her by him, a bow is given, and then he heads off. He is watched by Lizzy for a moment; she looks down at the letter, and then a comfortable place is searched for in which to read it by her. A large tree stump is settled down on by her. The letter is folded up by Lizzy, and she walks off. Her inside and up the stairs is followed by Mariah. But, the room is hurried to by Lizzie, and the door is shut behind her by her. Inside, a seat is taken by her near a window, and the letter is opened again. Lizzie cringes as her family's improper behavior is remembered by her. Then the letter is looked down at once more by her. From above, Darcy watches as Jane heads out dressed in a grey cloak and bonnet. Mr. Collins is now walking with Lizzie. Lizzie is bid farewell to by Mr. Collins. His wife is looked over at by him, and a little wave is given to her. A knowing smile is exchanged between her and Lizzie. From the parsonage, the horse-drawn carriage pulls away, and speed is gathered along the country road by it. Inside are Mariah and Lizzie sitting. An open notebook is had by Mariah. Forward in her seat Lizzie leans, looking thoughtful. As the window is stared out of by her, memories of Darcy pass through her mind. A platter of horses' hooves snaps at the rubbery. Finally, outside a busy inn, the carriage pulls up. One of the upper windows is opened excitedly by Lydia. Up at her and Kitty, Lizzie waves. Lydia indicates that she'll come down and meet them, then the window is closed by her. Her sister is embraced warmly, then the bed is sat back on by her. The room is left by him. Down are thrown angrily by her the knife, fork, and napkin. Now, out in the garden, Lizzie is carrying a basket full of flowers. Jane, who's busy sniffing blooms to put in her truck, is walked around by her. Over at her sister, frequent concerned glances are cast by Lizzie. Over she comes and Lizzie's hand is taken by her. Back towards the house, Jane sets off carrying her basket of flowers. As Lizzie is about to be followed, her mother appears. Back into the house, Kitty stomps. With her father, Lizzie is. Lizzie is gently pulled onto a seat beside him by Mr. Bennett. Tea at Longbourn is taken by officers from Wickham's regiment. The time of her life is had by Lydia. Over to Lizzie, Wickham makes his way. A sip of tea is taken by Lizzie. Now, it is the day of Lydia's departure. At them all Lydia waves excitedly as the carriage pulls away. Mrs. Bennet is close to tears. Tears of frustration are fought back by Kitty. Inside is headed by him, and he is followed by the girls. Still sobbing is Kitty. Arriving at Longbourn is a carriage drawn by four white horses. Lizzie and Jane rush out to meet it. The occupants are waved excitedly at by them. From the cab, four children emerge first. Her aunt and uncle are kissed by Lizzie."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He hands her the letter, bows, and leaves. Lizzy watches briefly, then finds a tree stump to read on. She folds the letter and walks off, with Mariah following her inside. Lizzy hurries to her room, shuts the door, and sits by a window to read. She cringes at her family's improper behavior. Meanwhile, Darcy watches Jane in a grey cloak. Lizzie walks with Mr. Collins, who bids farewell, waving to his wife. Lizzie and Mariah sit in a carriage; Lizzie gazes out, thinking of Darcy as the carriage reaches a busy inn. Lydia opens a window, waves, meets her sister warmly, and returns to her room. Angrily, she throws down her utensils. Lizzie, in the garden, carries a basket of flowers, concerned about Jane, who smells blooms for her trunk. Jane takes Lizzie’s hand and heads back to the house. Lizzie follows before her mother appears. Kitty stomps inside. Mr. Bennett seats Lizzie beside him. Officers from Wickham's regiment have tea at Longbourn, where Lydia is thrilled. Wickham approaches Lizzie, who sips tea. On Lydia's departure day, she waves as the carriage leaves. Mrs. Bennet is teary, and Kitty fights tears. A carriage with four white horses arrives at Longbourn; Lizzie and Jane rush to greet it, waving at the children. Lizzie kisses her aunt and uncle."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He hands her the letter, bows, and leaves. Lizzy watches him, then finds a spot to read on a tree stump. Folding the letter, she walks off, with Mariah following her upstairs. Lizzy hurries to her room, shuts the door, and reads by the window, cringing at her family's behavior. Darcy observes Jane in a grey cloak as Lizzy walks with Mr. Collins, who bids her farewell with a wave to his wife. Lizzy and Mariah ride a carriage, with Lizzy lost in thought of Darcy. At a busy inn, Lydia waves from above and joins them, embracing Lizzy. Lizzy is later in the garden with Jane, and they share concerned looks as Jane returns to the house. Lizzy is with Mr. Bennett as officers from Wickham's regiment visit. Wickham approaches Lizzy, who sips tea. On Lydia's departure day, the carriage leaves as Mrs. Bennet and Kitty near tears, and Lizzy and Jane meet an arriving carriage, greeting the occupants with excitement."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He carefully hands the letter to her, performs a respectful bow, and then proceeds to head off on his way. Lizzy watches him for a brief moment, her eyes lingering on his retreating figure before shifting her gaze downward to the letter in her hands. She begins to search for a comfortable spot to read it in peace. Eventually, she finds a large tree stump to settle upon, where she unfolds the letter with intent. After reading, Lizzy folds up the letter and makes her way elsewhere. Mariah follows her dutifully inside and up the stairs, but Lizzy quickly hurries to her room, closing the door firmly behind her. Inside the privacy of her room, she takes a seat near the window, reopening the letter to read it again. As she reads, Lizzy cringes at the memories of her family's improper behavior. Distracted, she glances back at the letter. Meanwhile, Darcy observes from above as Jane makes her way out, dressed smartly in a grey cloak and bonnet. Lizzy is now seen walking alongside Mr. Collins. Mr. Collins pauses to bid farewell to Lizzy. Before departing, he looks over at his wife and offers her a subtle wave. Lizzy and Mrs. Collins exchange a knowing smile. As the horse-drawn carriage pulls away from the parsonage, it gathers speed down the winding country road, with Lizzy and Mariah sitting inside. Mariah has a notebook open on her lap. Lizzy, deep in thought, leans forward in her seat, her eyes gazing thoughtfully out the window. Memories of Darcy flit through her mind, as the clattering of horses' hooves echoes around them. Finally, the carriage comes to a halt outside a bustling inn. With excitement, Lydia opens one of the upper windows. Lizzy waves up at her and Kitty, and Lydia signals that she'll come down to meet them before closing the window. She greets Lizzy warmly with an embrace, then sits back on the bed. He exits the room in anger, and she, frustrated, throws down her knife, fork, and napkin with a defiant gesture. Now, Lizzy is out in the garden, carrying a basket brimming with vibrant flowers. She walks around Jane, who is deeply engaged in sniffing blooms to place in her basket. Lizzy casts frequent, concerned glances toward her sister. Jane approaches Lizzy, taking her hand gently. Jane then heads back toward the house, her basket of flowers in tow. Just as Lizzy is about to follow, her mother makes an appearance. Kitty stomps back into the house, clearly upset. Lizzy joins her father, Mr. Bennett, who gently pulls her onto a seat beside him. Meanwhile, officers from Wickham's regiment are taking tea at Longbourn, much to Lydia's delight. Wickham approaches Lizzie, who takes a sip of tea, pondering. Now it is the day of Lydia's departure. Lydia waves with excitement as the carriage pulls away from the house. Mrs. Bennet stands nearby, on the verge of tears, while Kitty struggles to hold back her own tears of frustration. They head inside, with the girls closely following behind, Kitty still quietly sobbing. A grand carriage, drawn by four white horses, elegantly arrives at Longbourn. Lizzie and Jane rush out to greet it, waving excitedly at the occupants. Four children emerge first from the cab, followed by Lizzy, who greets her aunt and uncle with affectionate kisses."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With delicate precision, he carefully hands over the letter to her, bows respectfully in a gesture of deference, and then turns to proceed on his way without delay. Lizzy watches him for a brief moment, her eyes lingering thoughtfully on his retreating figure before she shifts her gaze downward to the letter now resting in her hands. She begins to search for a comfortable spot where she can read it in peace and without interruption. Eventually, she discovers a large tree stump upon which she can settle herself, and with intent, she unfolds the letter. Once she finishes reading, Lizzy folds the letter back up and then makes her way elsewhere. Mariah follows her dutifully inside and accompanies her up the stairs, but Lizzy quickly hurries to her room, closing the door firmly behind her with determination. Inside the privacy and quiet of her room, she takes a seat near the window, reopening the letter to immerse herself in its contents once more. As she reads, Lizzy cringes inwardly at the memories of her family's improper behavior. Distracted for a moment, she glances back at the letter. Meanwhile, Darcy observes from above as Jane makes her way out of the house, dressed smartly and elegantly in a grey cloak and bonnet. Lizzy is now seen walking alongside Mr. Collins, who pauses momentarily to bid farewell to her. Before departing, he looks over at his wife and offers her a subtle wave. Lizzy and Mrs. Collins exchange a knowing and understanding smile. As the horse-drawn carriage begins to pull away from the parsonage, it gathers speed while traveling down the winding, country road, with Lizzy and Mariah sitting comfortably inside. Mariah has a notebook open on her lap, ready for anything that might catch her attention. Lizzy, meanwhile, deep in thought, leans forward in her seat, her eyes gazing thoughtfully out the window. Memories of Darcy flit through her mind as the clattering sound of the horses' hooves echoes around them. Finally, the carriage comes to a halt outside a bustling and lively inn. With excitement, Lydia opens one of the upper windows and waves down at them. Lizzy waves up at her and Kitty, and Lydia signals that she'll come down to meet them before closing the window. She greets Lizzy warmly with an embrace filled with affection, then sits back on the bed, full of energy. He exits the room in anger, and she, equally frustrated, throws down her knife, fork, and napkin with a defiant gesture of exasperation. Now, Lizzy finds herself out in the garden, carrying a basket brimming to the top with vibrant, colorful flowers. She walks around Jane, who is deeply engaged in the act of sniffing blooms to place in her own basket. Lizzy casts frequent, concerned glances toward her sister. Jane approaches Lizzy, taking her hand gently in hers. Jane then heads back toward the house, her basket of flowers in tow. Just as Lizzy is about to follow, her mother makes an appearance. Kitty stomps back into the house, clearly upset and perturbed. Lizzy joins her father, Mr. Bennett, who gently pulls her onto a seat beside him with care. Meanwhile, officers from Wickham's regiment are taking tea at Longbourn, much to Lydia's delight and amusement. Wickham, confident and poised, approaches Lizzie, who takes a sip of tea, while pondering over her thoughts. Now it is the day of Lydia's departure. Lydia waves with excitement and enthusiasm as the carriage pulls away from the house. Mrs. Bennet stands nearby, on the verge of tears, while Kitty struggles to hold back her own tears of frustration and distress. They head inside, with the girls closely following behind, Kitty still quietly sobbing to herself. A grand and majestic carriage, drawn by four elegant white horses, arrives gracefully at Longbourn. Lizzie and Jane rush out eagerly to greet it, waving excitedly at the occupants. Four children emerge first from the cab, followed by Lizzy, who warmly greets her aunt and uncle with affectionate kisses."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He extends his hand, offering her the letter, and follows it with a respectful bow before turning on his heel and heading off on his way. Lizzy stands there, momentarily caught between watching his retreating figure and gazing downward at the letter now in her possession. She begins to scan the surroundings for a suitable, comfortable spot where she can immerse herself in its contents. Her eyes settle on a large tree stump, and she makes her way towards it, sitting down with a sense of anticipation. After carefully folding up the letter, she rises and begins walking once more. Mariah trails behind her as they enter the house and ascend the stairs. However, Lizzie quickens her pace, making a beeline for her room, where she swiftly shuts the door behind her, creating a private sanctuary. Inside, she positions herself near a window, allows the light to wash over her, and unfolds the letter again, opening it with a mix of dread and curiosity. As she reads, memories of her family's improper behavior flood her mind, causing her to cringe momentarily. She draws her focus back to the letter with a somber glance. Meanwhile, Darcy stands watch from above as Jane, cloaked in grey with a bonnet, steps out with purpose. The scene shifts, and Lizzie finds herself walking alongside Mr. Collins. As Mr. Collins prepares to bid her farewell, he shifts his gaze toward his wife, offering her a slight wave. Both women, Lizzie and the wife, exchange a knowing smile, understanding passing silently between them. The scene transitions to a horse-drawn carriage pulling away from the parsonage, gaining momentum along the winding country road. Nestled inside, Lizzie and Mariah occupy the carriage, with Mariah jotting notes in her open notebook. Lizzie leans forward thoughtfully, peering out the window, her mind drifting to memories of Darcy. As the rhythmic clatter of hooves fills the air, the carriage finally comes to a halt outside a bustling inn. Overhead, Lydia eagerly opens an upper window and peers down, while Lizzie waves up at both her and Kitty. Lydia signals her intention to come down and join them, then closes the window. Once downstairs, she enthusiastically embraces her sister, sharing a moment of warmth before retreating to sit back on her bed. He exits the room, leaving Lydia behind, who, in a burst of frustration, hurls down her knife, fork, and napkin. The scene shifts again to find Lizzie in the garden, a basket brimming with vibrant flowers in hand. She gracefully maneuvers around Jane, who's preoccupied with sniffing blooms destined for her trunk. Lizzie's eyes frequently dart over to her sister, a mix of concern and affection painting her features. Jane, sensing the moment, takes Lizzie's hand reassuringly before setting off towards the house with her own basket of flowers. As Lizzie is about to follow suit, her mother appears, prompting Kitty to stomp back into the house in a huff. The scene transitions to Lizzie being beside her father, with Mr. Bennet gently guiding her onto a seat next to him, sharing a quiet, comforting moment. Elsewhere, officers from Wickham's regiment are enjoying tea at Longbourn, and Lydia is caught up in the excitement of it all. Wickham discreetly approaches Lizzie, who takes a calming sip of her tea, maintaining her composure. Time progresses to the day of Lydia's departure, marked by Lydia's exuberant waves from the departing carriage. Mrs. Bennet stands on the verge of tears, while Kitty struggles to hold back her own tears of frustration. As he enters the house, the girls trail behind him, Kitty still sobbing quietly. Soon after, a carriage drawn by four majestic white horses arrives at Longbourn, capturing Lizzie and Jane's attention as they rush out to greet it with excitement. They wave enthusiastically at the carriage’s occupants, and four children eagerly spill out of the cab. Lizzie warmly embraces and kisses her aunt and uncle, rekindling familial bonds with joyful affection."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He hands the letter to her, bows, and departs. Lizzy briefly watches him, then finds a comfortable spot on a tree stump to read the letter. After reading, she folds it up and walks away, followed by Mariah into the house and up the stairs. Lizzy quickly retreats to her room, shuts the door, and reopens the letter by the window, cringing at memories of her family's behavior. Meanwhile, Darcy observes as Jane departs in a grey cloak and bonnet. Later, Lizzy is seen walking with Mr. Collins, who bids farewell with a wave to his wife. Lizzy and Mariah travel by horse-drawn carriage, with Lizzy deep in thought as she gazes out the window, recalling memories of Darcy. The carriage arrives at a bustling inn, where Lydia excitedly opens a window, and Lizzy waves at her and Kitty before Lydia warmly greets her sister and takes a seat. After leaving the room angrily, Lizzy is in the garden with a basket of flowers, exchanging concerned glances with Jane. They walk back to the house where their mother appears, and Kitty stomps inside. Lizzy joins her father as he gently seats her beside him. Officers from Wickham's regiment enjoy tea at Longbourn, with Lydia in high spirits. Wickham approaches Lizzy as she sips her tea. On Lydia's departure day, she waves excitedly while Mrs. Bennet and Kitty fight back tears. A carriage drawn by four white horses arrives at Longbourn, prompting Lizzy and Jane to rush out and wave excitedly as four children emerge, followed by affectionate greetings from their aunt and uncle."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He hands it to her, bows, a gesture of respect common in English society during the Regency era, then heads off. Lizzy, a young woman of quick wit from Longbourn, watches him for a moment, looks down at the letter, then searches for a comfortable place in which to read it. She settles down on a large tree stump, likely part of the estate's expansive grounds. Lizzy folds up the letter and walks off. Mariah follows her inside the elegant but aging Longbourn estate and up the creaking wooden stairs. But, Lizzie hurries to her room and shuts the door behind her. Inside, she sits down near a window overlooking the lush countryside and opens up the letter again. Lizzie cringes as she remembers her family's improper behavior, often seen as a source of embarrassment in their social circles. Then she looks down at the letter once more. Darcy, a wealthy and complex gentleman whose affections Lizzie struggles to understand, watches from above as Jane, Lizzie's kind-hearted elder sister, heads out dressed in a grey cloak and bonnet typical of the period. Lizzie is now walking with Mr. Collins, her obsequious cousin and suitor of unfortunate disposition. Mr. Collins goes to bid his farewells to Lizzie. He looks over at his wife, Charlotte, who accepted his proposal for practical reasons, and gives her a little wave. She and Lizzie exchange a knowing smile. The horse-drawn carriage pulls away from the parsonage, gathering speed along the picturesque country road typical of Hertfordshire. Lizzie and Mariah are sitting inside. Mariah has a notebook open, perhaps sketching or writing observations as was a common pastime. Lizzie leans forward in her seat, looking thoughtful. As she stares out of the window, memories of Darcy pass through her mind. The clatter of horses' hooves snaps at the rubbery silence of the countryside. Finally, the carriage pulls up outside a busy coaching inn, a hub for travelers in the area. Lydia opens one of the upper windows excitedly, her lively nature evident as she waves down at her sisters. Lizzie waves up at her and Kitty, both known for their youthful exuberance. Lydia indicates that she'll come down and meet them then closes the window. She embraces her sister warmly, full of familial affection, then sits back on the bed. He leaves the room. Angrily, Lydia throws down her knife, fork, and napkin, a reaction perhaps to a minor familial squabble. Now, Lizzie's out in the garden, carrying a basket full of freshly picked flowers. She walks around Jane, who's busy sniffing blooms to put in her work trunk. Lizzie casts frequent concerned glances over at her sister, worried for her well-being. She comes over and takes Lizzie's hand, a gesture of sisterly support. Jane sets off back towards the house, carrying her basket of flowers. As Lizzie is about to follow, her mother, Mrs. Bennet, appears, always eager to see her daughters well-matched. Kitty stomps back into the house, her frustration with familial dynamics evident. Lizzie is with her father, Mr. Bennet, who is known for his sardonic wit and aloof demeanor. Mr. Bennet gently pulls Lizzie onto a seat beside him. Officers from Wickham's regiment, stationed nearby, are taking tea at Longbourn, providing much excitement. Lydia is having the time of her life, her flirtatious nature on display. Wickham, charming yet unreliable, makes his way over to Lizzie. Lizzie takes a sip of tea, a moment of composure amidst social chaos. Now, it's the day of Lydia's departure to Brighton, a seaside town for leisurely pursuits. Lydia waves excitedly at them all as the carriage pulls away. Mrs. Bennet is close to tears, overly dramatic as usual. Kitty is fighting back tears of frustration, feeling left out. He heads inside and the girls follow him, sadness mixed with anticipation. Kitty still sobbing, her emotions running high. A carriage drawn by four white horses, a symbol of wealth, arrives at Longbourn. Lizzie and Jane rush out to meet it. They wave excitedly at the occupants, eager for news and companionship. Four children emerge first from the cab, likely their younger cousins visiting. Lizzie kisses her aunt and uncle, Mr. and Mrs. Gardiner, warmly embracing familial bonds."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He hands it to her bows then heads off. Lizzy watches him for a moment looks down at the letter then searches for a comfortable place in which to read it. She settles down on a large tree stump. Lizzy folds up the letter and walks off. Mariah follows her inside and up the stairs. But Lizzie hurries to her room and shuts the door behind her. Inside she sits down near a window and opens up the letter again. Lizzie cringes as she remembers her family's improper behavior. Then she looks down at the letter once more. Darcy watches from above as Jane heads out dressed in a grey cloak and bonnet. Lizzie is now walking with Mr Collins. Mr Collins goes to bid his farewells to Lizzie. He looks over at his wife and gives her a little wave. She and Lizzie exchange a knowing smile. The horsedrawn carriage pulls away from the parsemage gathering speed along the country road. Lizzie and Mariah are sitting inside. Mariah has a notebook open. Lizzie leans forward in her seat looking thoughtful. As she stares out of the window memories of Darcy pass through her mind. Platter of horses' hooves snaps at the rubbery. Finally the carriage pulls up outside a busy inn. Lydia opens one of the upper windows excitedly. Lizzie waves up at her and Kitty. Lydia indicates that she will come down and meet them then closes the window. She embraces her sister warmly then sits back on the bed. He leaves the room Angrily. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. she throws down her knife fork and napkin. Now Lizzie's out in the garden carrying a basket full of flowers. She walks around. Jane who is busy sniffing blooms to put in her truck. Lizzie casts frequent concerned glances over at her sister. She comes over and takes Lizzie's hand. Jane sets off back towards the house carrying her basket of flowers. As Lizzie is about to follow her mother appears. Kitty stomps back into the house. Lizzie is with her father. Mr Bennett gently pulls Lizzie onto a seat beside him. Officers from Wickham's regiment are taking tea at Longbourn. Lydia is having the time of her life. Wickham makes his way over to Lizzie. Lizzie takes a sip of tea. Now it is the day of Lydia's departure. Lydia waves excitedly at them all as the carriage pulls away. Mrs Bennet is close to tears. Kitty is fighting back tears of frustration. He heads inside and the girls follow him. Kitty still sobbing. A carriage drawn by four white horses arrives at Longbourn. Lizzie and Jane rush out to meet it. They wave excitedly at the occupants. Four children emerge first from the cab. Lizzie kisses her aunt and uncle."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He hands it to her bows then heads off. Lizzy watches him for a moment looks down at the letter then searches for a comfortable place in which to read it. She settles down on a large tree stump. Lizzy folds up the letter and walks off. Mariah follows her inside and up the stairs. But Lizzie hurries to her room and shuts the door behind her. Inside she sits down near a window and opens up the letter again. Lizzie cringes as she remembers her family's improper behavior. Then she looks down at the letter once more. Darcy watches from above as Jane heads out dressed in a grey cloak and bonnet. Lizzie is now walking with Mr Collins. Mr Collins goes to bid his farewells to Lizzie. He looks over at his wife and gives her a little wave. She and Lizzie exchange a knowing smile. The horsedrawn carriage pulls away from the parsemage gathering speed along the country road. Lizzie and Mariah are sitting inside. Mariah has a notebook open. Lizzie leans forward in her seat looking thoughtful. As she stares out of the window memories of Darcy pass through her mind. Platter of horses' hooves snaps at the rubbery. Finally the carriage pulls up outside a busy inn. Lydia opens one of the upper windows excitedly. Lizzie waves up at her and Kitty. Lydia indicates that she will come down and meet them then closes the window. She embraces her sister warmly then sits back on the bed. He leaves the room Angrily. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. she throws down her knife fork and napkin. Now Lizzie's out in the garden carrying a basket full of flowers. She walks around. Jane who is busy sniffing blooms to put in her truck. Lizzie casts frequent concerned glances over at her sister. She comes over and takes Lizzie's hand. Jane sets off back towards the house carrying her basket of flowers. As Lizzie is about to follow her mother appears. Kitty stomps back into the house. Lizzie is with her father. Mr Bennett gently pulls Lizzie onto a seat beside him. Officers from Wickham's regiment are taking tea at Longbourn. Lydia is having the time of her life. Wickham makes his way over to Lizzie. Lizzie takes a sip of tea. Now it is the day of Lydia's departure. Lydia waves excitedly at them all as the carriage pulls away. Mrs Bennet is close to tears. Kitty is fighting back tears of frustration. He heads inside and the girls follow him. Kitty still sobbing. A carriage drawn by four white horses arrives at Longbourn. Lizzie and Jane rush out to meet it. They wave excitedly at the occupants. Four children emerge first from the cab. Lizzie kisses her aunt and uncle."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He hands it to her bows then heads off. Lizzy watches him for a moment looks down at the letter then searches for a comfortable place in which to read it. She settles down on a large tree stump. Lizzy folds up the letter and walks off. Mariah follows her inside and up the stairs. But Lizzie hurries to her room and shuts the door behind her. Inside she sits down near a window and opens up the letter again. Lizzie cringes as she remembers her family's improper behavior. Then she looks down at the letter once more. Darcy watches from above as Jane heads out dressed in a grey cloak and bonnet. Lizzie is now walking with Mr Collins. Mr Collins goes to bid his farewells to Lizzie. He looks over at his wife and gives her a little wave. Wickham makes his way over to Lizzie. Lizzie takes a sip of tea. Now it is the day of Lydia's departure. Lydia waves excitedly at them all as the carriage pulls away. Mrs Bennet is close to tears. Kitty is fighting back tears of frustration. He heads inside and the girls follow him. Kitty still sobbing. A carriage drawn by four white horses arrives at Longbourn. Lizzie and Jane rush out to meet it. They wave excitedly at the occupants. Four children emerge first from the cab. Lizzie kisses her aunt and uncle."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He hands it to her bows then heads off. Lizzy watches him for a moment looks down at the letter then searches for a comfortable place in which to read it. She settles down on a large tree stump. Lizzy folds up the letter and walks off. Mariah follows her inside and up the stairs. But Lizzie hurries to her room and shuts the door behind her. A carriage drawn by four white horses arrives at Longbourn. Lizzie and Jane rush out to meet it. They wave excitedly at the occupants. Four children emerge first from the cab. Lizzie kisses her aunt and uncle."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat tosses it to the librarian, nods, then skips away. Charlie observes the cat for a moment, glances up at the painting, then hunts for a cozy corner in which to admire it. She perches on a tiny mushroom. Charlie rolls up the painting and drifts away. Marvin chases her outside and down the ladder. But, Charlie dashes to her cave and seals the entrance behind her. Inside, she curls up near a lantern and unrolls the painting again. Charlie flinches as she recalls her town's usual antics. Then she glances up at the painting once more. Larry observes from below as Emily dances out wearing a velvet cape and helmet. Charlie is strolling with Mr. Brown. Mr. Brown tries to say goodbye to Charlie. He glances over at his sister and gives her a small salute. She and Charlie exchange a cheeky grin. The steam-powered locomotive chugs away from the orchard, gaining momentum along the forest trail. Charlie and Marvin are perched inside. Marvin has a sketchbook open. Charlie slouches back in her hammock, appearing contemplative. As she gazes out of the hatch, dreams of Larry flutter through her thoughts. Clique of birds' songs chirps through the breeze. Eventually, the locomotive rolls up outside a quiet tavern. Clara opens one of the basement hatches joyfully. Charlie nods down at her and Daisy. Clara signals that she'll climb up and join them then secures the hatch. She hugs her sibling tightly then lies down on the mat. The mouse slips out the burrow. Irritably, she tosses away her spoon, plate, and towel. Now, Charlie's deep in the woods, holding a bucket full of berries. She tiptoes around Emily, who's busy counting seeds to toss in her wagon. Charlie casts frequent puzzled looks over at her sibling. She skips over and grabs Charlie's paw. Emily wanders off back towards the barn, juggling her bucket of berries. As Charlie is set to trail, her uncle materializes. Daisy trudges back into the barn. Charlie is with her grandfather. Mr. Smith gently guides Charlie onto a hammock beside him. Rangers from Patrick's crew are sipping cider at Greenfield. Clara is having the adventure of her life. Patrick steps over to Charlie. Charlie takes a gulp of cider. Now, it's the morning of Clara's journey. Clara gestures joyously at them all as the locomotive chugs away. Mrs. Smith is almost in tears. Daisy is holding back tears of laughter. The raven glides outside and the girls trail it. Daisy still giggling. A chariot drawn by two black zebras halts at Greenfield. Charlie and Emily dart out to greet it. They beam joyfully at the guests. Two puppies leap first from the back. Charlie hugs her cousin and brother."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Lizzy receives a letter and finds a quiet spot on a tree stump to read it, remembering her family's improper behavior. She then hurries to her room, reflecting on Darcy as she stares out the window. Later, she and Mariah travel in a horse-drawn carriage to a busy inn where Lydia greets them warmly. Lizzy observes Jane gathering flowers and is joined by her mother. Mr. Bennett gently seats Lizzy beside him while Lydia enjoys tea with officers, including Wickham. On Lydia's departure day, Mrs. Bennet and Kitty are emotional as the carriage leaves. A carriage with four horses arrives at Longbourn, and Lizzy and Jane greet it eagerly, welcoming their aunt, uncle, and children."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Lizzie kisses her aunt and uncle Four children emerge first from the cab They wave excitedly at the occupants Lizzie and Jane rush out to meet it A carriage drawn by four white horses arrives at Longbourn Kitty still sobbing He heads inside and the girls follow him Kitty is fighting back tears of frustration Mrs Bennet is close to tears Lydia waves excitedly at them all as the carriage pulls away Now it is the day of Lydia's departure Lizzie takes a sip of tea Wickham makes his way over to Lizzie Lydia is having the time of her life Officers from Wickham's regiment are taking tea at Longbourn Mr Bennett gently pulls Lizzie onto a seat beside him Lizzie is with her father Kitty stomps back into the house As Lizzie is about to follow her mother appears Jane sets off back towards the house carrying her basket of flowers She comes over and takes Lizzie's hand Lizzie casts frequent concerned glances over at her sister Jane who is busy sniffing blooms to put in her truck She walks around Now Lizzie's out in the garden carrying a basket full of flowers she throws down her knife fork and napkin He leaves the room Angrily She embraces her sister warmly then sits back on the bed Lydia indicates that she will come down and meet them then closes the window Lizzie waves up at her and Kitty Lydia opens one of the upper windows excitedly Finally the carriage pulls up outside a busy inn Platter of horses' hooves snaps at the rubbery As she stares out of the window memories of Darcy pass through her mind Lizzie leans forward in her seat looking thoughtful Mariah has a notebook open Lizzie and Mariah are sitting inside The horsedrawn carriage pulls away from the parsemage gathering speed along the country road She and Lizzie exchange a knowing smile He looks over at his wife and gives her a little wave Mr Collins goes to bid his farewells to Lizzie Lizzie is now walking with Mr Collins Darcy watches from above as Jane heads out dressed in a grey cloak and bonnet Then she looks down at the letter once more Lizzie cringes as she remembers her family's improper behavior Inside she sits down near a window and opens up the letter again But Lizzie hurries to her room and shuts the door behind her Mariah follows her inside and up the stairs Lizzy folds up the letter and walks off She settles down on a large tree stump Lizzy watches him for a moment looks down at the letter then searches for a comfortable place in which to read it He hands it to her bows then heads off"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Lizzy watches him for a moment looks down at the letter then searches for a comfortable place in which to read it He hands it to her bows then heads off Lizzy folds up the letter and walks off She settles down on a large tree stump But Lizzie hurries to her room and shuts the door behind her Mariah follows her inside and up the stairs Lizzie cringes as she remembers her family's improper behavior Inside she sits down near a window and opens up the letter again Darcy watches from above as Jane heads out dressed in a grey cloak and bonnet Then she looks down at the letter once more Mr Collins goes to bid his farewells to Lizzie Lizzie is now walking with Mr Collins She and Lizzie exchange a knowing smile He looks over at his wife and gives her a little wave Lizzie and Mariah are sitting inside The horsedrawn carriage pulls away from the parsemage gathering speed along the country road Lizzie leans forward in her seat looking thoughtful Mariah has a notebook open Platter of horses' hooves snaps at the rubbery As she stares out of the window memories of Darcy pass through her mind Lydia opens one of the upper windows excitedly Finally the carriage pulls up outside a busy inn Lydia indicates that she will come down and meet them then closes the window Lizzie waves up at her and Kitty He leaves the room Angrily She embraces her sister warmly then sits back on the bed Now Lizzie's out in the garden carrying a basket full of flowers she throws down her knife fork and napkin Jane who is busy sniffing blooms to put in her truck She walks around She comes over and takes Lizzie's hand Lizzie casts frequent concerned glances over at her sister As Lizzie is about to follow her mother appears Jane sets off back towards the house carrying her basket of flowers Lizzie is with her father Kitty stomps back into the house Officers from Wickham's regiment are taking tea at Longbourn Mr Bennett gently pulls Lizzie onto a seat beside him Wickham makes his way over to Lizzie Lydia is having the time of her life Now it is the day of Lydia's departure Lizzie takes a sip of tea Mrs Bennet is close to tears Lydia waves excitedly at them all as the carriage pulls away He heads inside and the girls follow him Kitty is fighting back tears of frustration A carriage drawn by four white horses arrives at Longbourn Kitty still sobbing They wave excitedly at the occupants Lizzie and Jane rush out to meet it Lizzie kisses her aunt and uncle Four children emerge first from the cab"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "she throws down her knife fork and napkin Now Lizzie's out in the garden carrying a basket full of flowers She walks around Jane who is busy sniffing blooms to put in her truck Lizzie casts frequent concerned glances over at her sister She comes over and takes Lizzie's hand Jane sets off back towards the house carrying her basket of flowers As Lizzie is about to follow her mother appears Kitty stomps back into the house Lizzie is with her father Mr Bennett gently pulls Lizzie onto a seat beside him Officers from Wickham's regiment are taking tea at Longbourn Lydia is having the time of her life Wickham makes his way over to Lizzie Lizzie takes a sip of tea Now it is the day of Lydia's departure Lydia waves excitedly at them all as the carriage pulls away Mrs Bennet is close to tears Kitty is fighting back tears of frustration He heads inside and the girls follow him Kitty still sobbing A carriage drawn by four white horses arrives at Longbourn Lizzie and Jane rush out to meet it They wave excitedly at the occupants Four children emerge first from the cab Lizzie kisses her aunt and uncle He hands it to her bows then heads off Lizzy watches him for a moment looks down at the letter then searches for a comfortable place in which to read it She settles down on a large tree stump Lizzy folds up the letter and walks off Mariah follows her inside and up the stairs But Lizzie hurries to her room and shuts the door behind her Inside she sits down near a window and opens up the letter again Lizzie cringes as she remembers her family's improper behavior Then she looks down at the letter once more Darcy watches from above as Jane heads out dressed in a grey cloak and bonnet Lizzie is now walking with Mr Collins Mr Collins goes to bid his farewells to Lizzie He looks over at his wife and gives her a little wave She and Lizzie exchange a knowing smile The horsedrawn carriage pulls away from the parsemage gathering speed along the country road Lizzie and Mariah are sitting inside Mariah has a notebook open Lizzie leans forward in her seat looking thoughtful As she stares out of the window memories of Darcy pass through her mind Platter of horses' hooves snaps at the rubbery Finally the carriage pulls up outside a busy inn Lydia opens one of the upper windows excitedly Lizzie waves up at her and Kitty Lydia indicates that she will come down and meet them then closes the window She embraces her sister warmly then sits back on the bed He leaves the room Angrily"
        }
      ]
    }
  ]
}