{
  "ground_truth": "Mr. Gardiner smiles over at Mr. Darcy while Georgiana stands at Lizzie's side, looking down at her. They both look over at Mr. Darcy, and then Lizzie gets up and sets the music out for Georgiana before making her way across the room, only to be stopped by Miss Bingley. Mr. Darcy sits up, and embarrassed, Lizzie hurries back over to Georgiana. Slowly, Lizzie raises her eyes to meet Mr. Darcy's, who sits across the room, watching her with an enraptured expression. The two gaze at each other, their eyes filled with warmth and understanding. Later, as dusk falls, a carriage pulls away from Pemberley, waved off by Mr. Bingley, Mr. Darcy, and Georgiana. Mr. Bingley and Georgiana head inside together, arm in arm, but Mr. Darcy remains on the doorstep, watching the carriage clatter down the long, curving driveway. Moments later, he and Mr. Bingley stride back into the drawing room, where Mrs. Hurst and Miss Bingley are waiting, and he gives Miss Bingley a piercing stare, causing her to look away. Mr. Darcy then walks through the magnificent portrait-lined hall at Pemberley, holding aloft a candle to light his way, with two dogs trotting at his heels. He enters the now-darkened drawing room and places the candle on a mantelpiece, pausing for a moment, leaning against the fireplace as if lost in thought, before looking over at the piano Lizzie was playing earlier and softening his expression as he remembers her lifting her eyes to meet his in a moment frozen in time. The next day dawns grey and misty over Pemberley as Darcy stands in front of his mirror, getting dressed, while his butler brings him his frock coat, which he takes and pulls on. Dressed immaculately in a bottle-green frock coat, cream breeches, riding boots, and a top hat, he gallops through the grounds on his white horse, giving it a faint tap with a whip to speed up the grassy hill. At Lambton, the maid finds Lizzie and the Gardiners, prompting Mr. Gardiner to open the door, and they head out, leaving Lizzie alone with her letters. She settles down to open the first one, while elsewhere a messenger dismounts from his horse and hands Mr. Bennet, in his night things, a letter, which he opens after passing his candle to the housekeeper. Lizzie's eyes fill with tears as Wickham turns to look at Lydia. Lizzie hurriedly opens the next letter, then puts down the letters and hurries to the door as Mr. Darcy strides in. The maid appears, and Mr. Darcy sits down, taking Lizzie's hand, as Lizzie breaks down in tears.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Mr. Gardiner grins over at Mr. Darcy while Georgiana stands at Lizzie's flank, gazing down at her. They both glance over at Mr. Darcy, and then Lizzie rises and places the sheet music out for Georgiana before making her way across the chamber, only to be halted by Miss Bingley. Mr. Darcy straightens up, and abashed, Lizzie rushes back over to Georgiana. Gradually, Lizzie lifts her gaze to meet Mr. Darcy's, who sits across the room, observing her with an enraptured countenance. The pair regard each other, their eyes brimming with warmth and comprehension. Later, as twilight descends, a carriage departs from Pemberley, waved off by Mr. Bingley, Mr. Darcy, and Georgiana. Mr. Bingley and Georgiana proceed inside together, arm in arm, but Mr. Darcy lingers on the threshold, observing the carriage rattle down the lengthy, curving driveway. Moments later, he and Mr. Bingley stride back into the drawing room, where Mrs. Hurst and Miss Bingley are waiting, and he grants Miss Bingley a penetrating glance, causing her to avert her eyes. Mr. Darcy then walks through the splendid portrait-lined hall at Pemberley, holding aloft a candle to illuminate his path, with two canines trotting at his heels. He enters the now-dimmed drawing room and places the candle on a mantelpiece, pausing for a moment, leaning against the fireplace as if absorbed in reflection, before glancing over at the piano Lizzie was playing earlier and softening his expression as he recalls her lifting her gaze to meet his in a moment frozen in time. The next day dawns grey and misty over Pemberley as Darcy stands in front of his mirror, attiring himself, while his butler brings him his frock coat, which he takes and pulls on. Dressed impeccably in a bottle-green frock coat, cream breeches, riding boots, and a top hat, he gallops through the grounds on his white steed, giving it a light tap with a whip to hasten up the verdant incline. At Lambton, the maid discovers Lizzie and the Gardiners, prompting Mr. Gardiner to open the door, and they proceed out, leaving Lizzie alone with her letters. She settles down to open the first one, while elsewhere a courier dismounts from his horse and hands Mr. Bennet, in his nightclothes, a letter, which he opens after passing his candle to the housekeeper. Lizzie's eyes overflow with tears as Wickham turns to gaze at Lydia. Lizzie hurriedly opens the next letter, then puts down the letters and hastens to the door as Mr. Darcy strides in. The maid appears, and Mr. Darcy sits down, taking Lizzie's hand, as Lizzie breaks down in tears."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Mr. Gardiner is smiled at by Mr. Darcy while Lizzie's side is stood at by Georgiana, who looks down at her. Mr. Darcy is looked over at by both of them, and then the music is set out for Georgiana by Lizzie before her way across the room is made, only for her to be stopped by Miss Bingley. Mr. Darcy is sat up by himself, and embarrassed, Georgiana is hurried back over to by Lizzie. Slowly, Mr. Darcy's eyes are raised to by Lizzie, who is sat across the room, watched by him with an enraptured expression. Each other are gazed at by the two, their eyes filled with warmth and understanding. Later, as dusk falls, a carriage is pulled away from Pemberley, waved off by Mr. Bingley, Mr. Darcy, and Georgiana. The inside is headed into together by Mr. Bingley and Georgiana, arm in arm, but the doorstep is remained on by Mr. Darcy, who watches the carriage clatter down the long, curving driveway. Moments later, back into the drawing room is stridden by him and Mr. Bingley, where Mrs. Hurst and Miss Bingley wait, and a piercing stare is given to Miss Bingley by him, causing her to look away. The magnificent portrait-lined hall at Pemberley is then walked through by Mr. Darcy, who holds aloft a candle to light his way, with two dogs trotting at his heels. The now-darkened drawing room is entered by him and the candle is placed on a mantelpiece, pausing for a moment, leaning against the fireplace as if lost in thought, before Lizzie, who was playing the piano earlier, is looked over at by him and his expression softens as he remembers her lifting her eyes to meet his in a moment frozen in time. The next day dawns grey and misty over Pemberley as Mr. Darcy stands in front of his mirror, getting dressed, while his butler brings his frock coat to him, which he takes and pulls on. Immaculately dressed in a bottle-green frock coat, cream breeches, riding boots, and a top hat, the grounds are galloped through by him on his white horse, and a faint tap with a whip is given to it to speed up the grassy hill. At Lambton, Lizzie and the Gardiners are found by the maid, prompting Mr. Gardiner to open the door, and they are headed out, leaving Lizzie alone with her letters. She settles down to open the first one, while elsewhere Mr. Bennet is dismounted upon by a messenger from his horse and hands a letter to him, in his night things, which he opens after the candle is passed to the housekeeper by him. Lizzie's eyes are filled with tears as Lydia is turned to look at by Wickham. The next letter is hurriedly opened by Lizzie, then the letters are put down, and the door is hurried to by her as Mr. Darcy strides in. The maid appears, and Lizzie's hand is taken by Mr. Darcy, as she breaks down in tears."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Mr. Gardiner smiles at Mr. Darcy while Georgiana stands beside Lizzie, looking at her. They glance at Mr. Darcy, and Lizzie sets music for Georgiana before crossing the room, only to be stopped by Miss Bingley. Embarrassed, Lizzie returns to Georgiana. Lizzie and Mr. Darcy exchange warm, understanding glances. As dusk falls, a carriage leaves Pemberley, waved off by Mr. Bingley, Mr. Darcy, and Georgiana. Mr. Bingley and Georgiana go inside, but Mr. Darcy watches the carriage down the driveway. He and Mr. Bingley return to the drawing room, where Mrs. Hurst and Miss Bingley wait, and he gives Miss Bingley a piercing stare. Mr. Darcy walks through the portrait-lined hall at Pemberley, holding a candle, with two dogs following. He enters the darkened drawing room, places the candle on the mantelpiece, and pauses, recalling Lizzie's gaze at the piano. The next day dawns grey and misty as Darcy dresses, assisted by his butler. Immaculately dressed, he rides his white horse through the grounds. At Lambton, the maid finds Lizzie and the Gardiners, prompting Mr. Gardiner to open the door, leaving Lizzie with her letters. She opens the first one, while elsewhere a messenger gives Mr. Bennet a letter. Lizzie's eyes fill with tears as Wickham looks at Lydia. Lizzie opens the next letter, then rushes to the door as Mr. Darcy enters. The maid appears, and Mr. Darcy sits, taking Lizzie's hand as she breaks down in tears."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Mr. Gardiner smiles at Mr. Darcy while Georgiana stands by Lizzie, looking at her. They glance at Mr. Darcy, and Lizzie sets music for Georgiana before Miss Bingley stops her. Embarrassed, Lizzie returns to Georgiana and meets Mr. Darcy's enraptured gaze. Later, as dusk falls, a carriage leaves Pemberley, waved off by Mr. Bingley, Mr. Darcy, and Georgiana. Mr. Bingley and Georgiana go inside, but Mr. Darcy watches the carriage depart. He and Mr. Bingley return to the drawing room, where Mrs. Hurst and Miss Bingley wait, and he gives Miss Bingley a piercing stare. Mr. Darcy walks through Pemberley's portrait-lined hall with two dogs, enters the darkened drawing room, and places a candle on the mantelpiece, pausing to remember Lizzie's gaze. The next day, Darcy dresses in a bottle-green frock coat, cream breeches, riding boots, and a top hat, then rides his white horse through the grounds. At Lambton, the maid finds Lizzie and the Gardiners, prompting Mr. Gardiner to leave with them, leaving Lizzie with her letters. She opens one as a messenger gives Mr. Bennet a letter. Lizzie's eyes fill with tears as Wickham looks at Lydia. Lizzie opens another letter, then rushes to the door as Mr. Darcy enters. The maid appears, and Mr. Darcy sits, taking Lizzie's hand as she breaks down in tears."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Mr. Gardiner, with a gentle and warm smile, glances over at Mr. Darcy, who is seated nearby, while Georgiana stands gracefully beside Lizzie, casting her gaze downward at her. Both of them turn their attention toward Mr. Darcy, and then Lizzie rises from her seat, arranging the sheet music for Georgiana with care before making her way across the elegantly furnished room. However, her path is unexpectedly interrupted by Miss Bingley. Observing this, Mr. Darcy sits up, and Lizzie, feeling a wave of embarrassment, quickly returns to Georgiana's side. Slowly and deliberately, Lizzie lifts her eyes to meet Mr. Darcy's, who is seated across the room, watching her intently with an expression of deep captivation. The two of them lock eyes, their gazes filled with a profound warmth and mutual understanding. As the day transitions into evening, a carriage departs from the grand estate of Pemberley, waved off by Mr. Bingley, Mr. Darcy, and Georgiana. Mr. Bingley and Georgiana, arm in arm, make their way back inside the house, but Mr. Darcy lingers on the doorstep, watching the carriage as it clatters down the long, winding driveway. A few moments later, he and Mr. Bingley stride purposefully back into the drawing room, where Mrs. Hurst and Miss Bingley are waiting. Mr. Darcy fixes Miss Bingley with a piercing stare, causing her to avert her gaze. He then walks through the magnificent hall of Pemberley, lined with portraits, holding a candle aloft to illuminate his path, with two loyal dogs trotting at his heels. Entering the now-darkened drawing room, he places the candle on the mantelpiece, pausing for a reflective moment as he leans against the fireplace, seemingly lost in thought. His eyes drift over to the piano that Lizzie had been playing earlier, and his expression softens as he recalls the moment when she lifted her eyes to meet his, a moment seemingly frozen in time. The following day dawns with a grey and misty atmosphere over Pemberley as Mr. Darcy stands before his mirror, dressing with meticulous care. His butler brings him his frock coat, which he takes and dons with precision. Impeccably dressed in a bottle-green frock coat, cream breeches, riding boots, and a top hat, he gallops through the expansive grounds on his white horse, giving it a gentle tap with a whip to quicken its pace up the grassy hill. Meanwhile, in Lambton, a maid finds Lizzie and the Gardiners, prompting Mr. Gardiner to open the door, and they head out, leaving Lizzie alone with her letters. She settles down to open the first one, while elsewhere, a messenger dismounts from his horse and hands Mr. Bennet, still in his night attire, a letter, which he opens after passing his candle to the housekeeper. Lizzie's eyes well up with tears as Wickham turns to look at Lydia. In a flurry of emotion, Lizzie hurriedly opens the next letter, then sets the letters aside and rushes to the door just as Mr. Darcy strides in. The maid appears, and Mr. Darcy sits down, taking Lizzie's hand in his, as Lizzie breaks down in tears."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Mr. Gardiner, bearing a gentle and warm smile that seemed to radiate kindness and goodwill, turns his gaze over to Mr. Darcy, who is comfortably seated in a nearby chair. Meanwhile, Georgiana stands elegantly beside Lizzie, her posture graceful yet understated, as she directs her gaze downward, casting her eyes softly upon Lizzie. Together, both women direct their attention toward Mr. Darcy. With a poised demeanor, Lizzie rises gracefully from her seat, taking great care as she arranges the sheet music intended for Georgiana. She then begins to make her way across the sumptuously furnished room. However, her progress is unexpectedly halted by the sudden appearance of Miss Bingley. Taking note of this interaction, Mr. Darcy sits up slightly in his chair, and Lizzie, momentarily consumed by a wave of embarrassment, quickly makes her way back to Georgiana's side. With deliberate slowness, Lizzie lifts her eyes, meeting Mr. Darcy's gaze, who is seated across the room, observing her with an expression filled with deep captivation and interest. Their eyes meet, locking with an intensity that speaks of profound warmth and a mutual understanding that runs deep. As the passage of the day gives way to the onset of evening, a carriage departs from the grand and stately estate of Pemberley. This departure is marked by the waving hands of Mr. Bingley, Mr. Darcy, and Georgiana. Linked arm in arm, Mr. Bingley and Georgiana proceed to make their way back inside the house, yet Mr. Darcy lingers on the doorstep for a moment longer, his eyes following the carriage as it clatters noisily down the long, winding driveway. A few moments later, both he and Mr. Bingley stride back into the welcoming confines of the drawing room, where Mrs. Hurst and Miss Bingley are patiently waiting. Fixing Miss Bingley with a piercing gaze that seems almost penetrating, Mr. Darcy causes her to avert her eyes. He then makes his way through the magnificent hall of Pemberley, which is lined with portraits of ancestral figures, holding a single candle aloft to illuminate his path in the dim light, with two loyal dogs trotting faithfully at his heels. As he enters the now-darkened drawing room, he places the candle gently on the mantelpiece, pausing for a thoughtful moment as he leans against the grand fireplace, appearing to be lost in deep contemplation. His eyes slowly drift over to the piano that Lizzie had been playing earlier, and his expression softens as he recalls the moment when she raised her eyes to meet his, a moment etched in his memory, seemingly frozen in time. The following day dawns with a grey and misty atmosphere enveloping Pemberley, as Mr. Darcy stands before his mirror, dressing with meticulous and careful attention to detail. His butler enters, carrying his frock coat, which Mr. Darcy takes and dons with precision. Impeccably dressed in a bottle-green frock coat, cream breeches, polished riding boots, and a distinguished top hat, he gallops across the expansive grounds on his white horse, giving it a gentle yet firm tap with his whip to quicken its pace as it ascends a grassy hill. Meanwhile, in the nearby town of Lambton, a maid approaches Lizzie and the Gardiners, prompting Mr. Gardiner to step up and open the door. They then head out, leaving Lizzie alone with her stack of letters. She settles down and proceeds to open the first letter, while elsewhere, a messenger dismounts from his horse and hands Mr. Bennet, who is still dressed in his night attire, a letter. He opens it after handing his candle to the housekeeper. Lizzie's eyes well up with tears as Wickham turns his attention to look at Lydia with an unreadable expression. In a flurry of mounting emotion, Lizzie hurriedly opens the next letter, then sets the letters aside and rushes to the door, just as Mr. Darcy strides in with purpose. The maid appears, and Mr. Darcy sits down, taking Lizzie's trembling hand gently in his own, as Lizzie breaks down in tears, overwhelmed by the unfolding events."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Mr. Gardiner, with a gentle smile, glances over at Mr. Darcy, while Georgiana stands quietly beside Lizzie, her gaze directed downward at her. Both Lizzie and Georgiana shift their attention towards Mr. Darcy, and Lizzie rises from her seat, carefully arranging the music sheets for Georgiana before she begins to move across the room. Her progress is halted by Miss Bingley, causing Lizzie to pause. Meanwhile, Mr. Darcy adjusts his posture, sitting up straighter, and Lizzie, feeling a wave of embarrassment, quickly returns to Georgiana's side. With a deliberate slowness, Lizzie lifts her eyes to meet Mr. Darcy's, who is seated across the room, his expression captivated and full of admiration as he watches her. Their eyes lock, and they share a moment of mutual warmth and understanding. As the day transitions into evening, a carriage departs from Pemberley, with Mr. Bingley, Mr. Darcy, and Georgiana waving it off. Mr. Bingley and Georgiana, linked arm in arm, make their way back inside, leaving Mr. Darcy standing on the doorstep, his eyes following the carriage as it rattles down the long, winding driveway. Shortly thereafter, Mr. Darcy and Mr. Bingley re-enter the drawing room, where Mrs. Hurst and Miss Bingley await them. Mr. Darcy fixes Miss Bingley with a sharp, penetrating stare, prompting her to avert her gaze. He then proceeds through the grand, portrait-adorned hall of Pemberley, holding a candle aloft to illuminate his path, with two dogs loyally trailing behind him. Entering the now-darkened drawing room, he places the candle on the mantelpiece and pauses, leaning against the fireplace, seemingly lost in contemplation. His eyes drift to the piano where Lizzie had played earlier, and his expression softens as he recalls the moment when she lifted her eyes to meet his, a memory suspended in time. The following day dawns with a grey, misty atmosphere over Pemberley, as Darcy stands before his mirror, meticulously dressing. His butler approaches, offering him his frock coat, which Darcy accepts and dons with precision. Impeccably dressed in a bottle-green frock coat, cream breeches, riding boots, and a top hat, he mounts his white horse and gallops through the estate grounds, urging the horse onward with a gentle tap of his whip as they ascend a grassy hill. In Lambton, a maid approaches Lizzie and the Gardiners, prompting Mr. Gardiner to open the door, and they depart, leaving Lizzie alone with her letters. She settles into a seat, preparing to open the first letter, while elsewhere, a messenger dismounts from his horse and hands Mr. Bennet, clad in his night attire, a letter. Mr. Bennet passes his candle to the housekeeper before opening the letter. As Lizzie reads, her eyes well up with tears, and she envisions Wickham turning to look at Lydia. In haste, Lizzie opens the next letter, then sets the letters aside and rushes to the door just as Mr. Darcy strides in. The maid makes her presence known, and Mr. Darcy takes a seat, gently taking Lizzie's hand in his, as Lizzie succumbs to her emotions and breaks down in tears."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Mr. Gardiner smiles at Mr. Darcy while Georgiana stands beside Lizzie, both glancing at Mr. Darcy. Lizzie rises, sets out music for Georgiana, and crosses the room, only to be intercepted by Miss Bingley. Embarrassed, she returns to Georgiana and exchanges a warm, understanding gaze with Mr. Darcy. As dusk falls, a carriage departs Pemberley, waved off by Mr. Bingley, Mr. Darcy, and Georgiana. Mr. Bingley and Georgiana head inside, while Mr. Darcy remains on the doorstep, watching the carriage disappear down the driveway. He and Mr. Bingley then return to the drawing room, where he gives Miss Bingley a piercing stare, causing her to look away. Mr. Darcy walks through the portrait-lined hall, lighting his way with a candle, accompanied by two dogs. In the darkened drawing room, he places the candle on the mantelpiece and pauses, lost in thought, before softening his expression as he recalls Lizzie's gaze at the piano. The next day, under a grey and misty sky, Darcy dresses with the help of his butler, dons his frock coat, and rides his white horse through the grounds, urging it up a grassy hill. In Lambton, the maid finds Lizzie and the Gardiners, prompting Mr. Gardiner to open the door, leaving Lizzie alone with her letters. She begins reading, while elsewhere, a messenger delivers a letter to Mr. Bennet, who opens it after handing his candle to the housekeeper. Lizzie's eyes fill with tears as she reads about Wickham and Lydia. She quickly opens the next letter, then rushes to the door as Mr. Darcy enters. The maid appears, and Mr. Darcy sits down, taking Lizzie's hand as she breaks down in tears."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Mr. Gardiner, a well-traveled businessman with a keen interest in local cultures, smiles over at Mr. Darcy, the wealthy and reserved owner of Pemberley, while Georgiana, Mr. Darcy's shy and musically gifted younger sister, stands at Lizzie's side, looking down at her. They both look over at Mr. Darcy, and then Lizzie gets up and sets the music out for Georgiana, known for her skillful piano playing, before making her way across the room, only to be stopped by Miss Bingley, who often tries to capture Mr. Darcy's attention. Mr. Darcy sits up, and embarrassed, Lizzie hurries back over to Georgiana. Slowly, Lizzie raises her eyes to meet Mr. Darcy's, who sits across the room, watching her with an enraptured expression of deep admiration. The two gaze at each other, their eyes filled with warmth and understanding. \n\nLater, as dusk falls over the expansive and manicured grounds of Pemberley, a carriage pulls away, waved off by Mr. Bingley, who is a close friend of Mr. Darcy and a charming, sociable gentleman, Mr. Darcy, and Georgiana. Mr. Bingley and Georgiana head inside together, arm in arm, but Mr. Darcy remains on the doorstep, watching the carriage clatter down the long, curving driveway lined with ancient oak trees. Moments later, he and Mr. Bingley stride back into the drawing room, where Mrs. Hurst and Miss Bingley are waiting, and he gives Miss Bingley a piercing stare, causing her to look away with a hint of discomfort. Mr. Darcy then walks through the magnificent portrait-lined hall at Pemberley, which is adorned with the lineage of Darcy ancestors, holding aloft a candle to light his way, with two dogs, loyal companions, trotting at his heels. He enters the now-darkened drawing room and places the candle on a mantelpiece, pausing for a moment, leaning against the fireplace as if lost in thought, before looking over at the piano Lizzie was playing earlier and softening his expression as he remembers her lifting her eyes to meet his in a moment frozen in time.\n\nThe next day dawns grey and misty over the estate of Pemberley as Darcy stands in front of his mirror, set in an elaborately carved wooden frame, getting dressed, while his butler, a man who has served the family for decades, brings him his frock coat, which he takes and pulls on. Dressed immaculately in a bottle-green frock coat, cream breeches, riding boots, and a top hat, he gallops through the grounds on his white horse, a spirited stallion known for its speed, giving it a faint tap with a whip to speed up the grassy hill. At Lambton, a picturesque village with charming cobblestone streets, the maid finds Lizzie and the Gardiners, prompting Mr. Gardiner to open the door, and they head out, leaving Lizzie alone with her letters. She settles down to open the first one, while elsewhere a messenger, part of the efficient network of communication, dismounts from his horse and hands Mr. Bennet, in his night things, a letter, which he opens after passing his candle to the housekeeper. Lizzie's eyes fill with tears at news about Wickham, a charismatic but unscrupulous officer who has eloped with Lydia, her youngest and most impetuous sister. Lizzie hurriedly opens the next letter, then puts down the letters and hurries to the door as Mr. Darcy strides in. The maid appears, and Mr. Darcy sits down, taking Lizzie's hand, as Lizzie breaks down in tears, overwhelmed by the gravity of the situation."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Mr Gardiner smiles over at Mr Darcy while Georgiana stands at Lizzie's side looking down at her. They both look over at Mr Darcy and then Lizzie gets up and sets the music out for Georgiana before making her way across the room only to be stopped by Miss Bingley. Mr Darcy sits up and embarrassed. Lizzie hurries back over to Georgiana. Slowly Lizzie raises her eyes to meet Mr Darcy's who sits across the room watching her with an enraptured expression. The two gaze at each other their eyes filled with warmth and understanding. Later as dusk falls a carriage pulls away from Pemberley waved off by Mr Bingley. Mr Darcy and Georgiana. Mr Bingley and Georgiana head inside together arm in arm but Mr Darcy remains on the doorstep watching the carriage clatter down the long curving driveway. Moments later he and Mr Bingley stride back into the drawing room where Mrs Hurst and Miss Bingley are waiting and he gives Miss Bingley a piercing stare causing her to look away. Mr Darcy then walks through the magnificent portraitlined hall at Pemberley holding aloft a candle to light his way with two dogs trotting at his heels. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. He enters the nowdarkened drawing room and places the candle on a mantelpiece pausing for a moment leaning against the fireplace as if lost in thought before looking over at the piano. Lizzie was playing earlier and softening his expression as he remembers her lifting her eyes to meet his in a moment frozen in time. The next day dawns grey and misty over Pemberley as Darcy stands in front of his mirror getting dressed while his butler brings him his frock coat which he takes and pulls on. Dressed immaculately in a bottlegreen frock coat cream breeches riding boots and a top hat he gallops through the grounds on his white horse giving it a faint tap with a whip to speed up the grassy hill. At Lambton the maid finds Lizzie and the Gardiners prompting Mr Gardiner to open the door and they head out leaving Lizzie alone with her letters. She settles down to open the first one. while elsewhere a messenger dismounts from his horse and hands Mr Bennet in his night things a letter which he opens after passing his candle to the housekeeper. Lizzie's eyes fill with tears as Wickham turns to look at Lydia. Lizzie hurriedly opens the next letter then puts down the letters and hurries to the door as Mr Darcy strides in. The maid appears and Mr Darcy sits down taking Lizzie's hand. as Lizzie breaks down in tears."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Mr Gardiner smiles over at Mr Darcy while Georgiana stands at Lizzie's side looking down at her. They both look over at Mr Darcy and then Lizzie gets up and sets the music out for Georgiana before making her way across the room only to be stopped by Miss Bingley. Mr Darcy sits up and embarrassed. Lizzie hurries back over to Georgiana. Slowly Lizzie raises her eyes to meet Mr Darcy's who sits across the room watching her with an enraptured expression. The two gaze at each other their eyes filled with warmth and understanding. Later as dusk falls a carriage pulls away from Pemberley waved off by Mr Bingley. Mr Darcy and Georgiana. Mr Bingley and Georgiana head inside together arm in arm but Mr Darcy remains on the doorstep watching the carriage clatter down the long curving driveway. Moments later he and Mr Bingley stride back into the drawing room where Mrs Hurst and Miss Bingley are waiting and he gives Miss Bingley a piercing stare causing her to look away. Mr Darcy then walks through the magnificent portraitlined hall at Pemberley holding aloft a candle to light his way with two dogs trotting at his heels. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. He enters the nowdarkened drawing room and places the candle on a mantelpiece pausing for a moment leaning against the fireplace as if lost in thought before looking over at the piano. Lizzie was playing earlier and softening his expression as he remembers her lifting her eyes to meet his in a moment frozen in time. The next day dawns grey and misty over Pemberley as Darcy stands in front of his mirror getting dressed while his butler brings him his frock coat which he takes and pulls on. Dressed immaculately in a bottlegreen frock coat cream breeches riding boots and a top hat he gallops through the grounds on his white horse giving it a faint tap with a whip to speed up the grassy hill. At Lambton the maid finds Lizzie and the Gardiners prompting Mr Gardiner to open the door and they head out leaving Lizzie alone with her letters. She settles down to open the first one. while elsewhere a messenger dismounts from his horse and hands Mr Bennet in his night things a letter which he opens after passing his candle to the housekeeper. Lizzie's eyes fill with tears as Wickham turns to look at Lydia. Lizzie hurriedly opens the next letter then puts down the letters and hurries to the door as Mr Darcy strides in. The maid appears and Mr Darcy sits down taking Lizzie's hand. as Lizzie breaks down in tears."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Mr Gardiner smiles over at Mr Darcy while Georgiana stands at Lizzie's side looking down at her. They both look over at Mr Darcy and then Lizzie gets up and sets the music out for Georgiana before making her way across the room only to be stopped by Miss Bingley. Mr Darcy sits up and embarrassed. Lizzie hurries back over to Georgiana. Slowly Lizzie raises her eyes to meet Mr Darcy's who sits across the room watching her with an enraptured expression. The two gaze at each other their eyes filled with warmth and understanding. while elsewhere a messenger dismounts from his horse and hands Mr Bennet in his night things a letter which he opens after passing his candle to the housekeeper. Lizzie's eyes fill with tears as Wickham turns to look at Lydia. Lizzie hurriedly opens the next letter then puts down the letters and hurries to the door as Mr Darcy strides in. The maid appears and Mr Darcy sits down taking Lizzie's hand. as Lizzie breaks down in tears."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Mr Gardiner smiles over at Mr Darcy while Georgiana stands at Lizzie's side looking down at her. They both look over at Mr Darcy and then Lizzie gets up and sets the music out for Georgiana before making her way across the room only to be stopped by Miss Bingley. Mr Darcy sits up and embarrassed. The maid appears and Mr Darcy sits down taking Lizzie's hand. as Lizzie breaks down in tears."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Mr. Elephant grins over at Mr. Fox while Georgina balances at Lily's elbow, peering up at her. They both glance over at Mr. Fox, and then Lily hops up and arranges the painting for Georgina before wandering across the meadow, only to be halted by Miss Bumblebee. Mr. Fox stretches out, and flustered, Lily dashes back over to Georgina. Gradually, Lily tilts her gaze to meet Mr. Fox's, who lounges across the garden, observing her with an enthralled look. The pair peer at each other, their eyes glowing with warmth and comprehension. Later, as twilight descends, a balloon floats away from Pasadena, waved off by Mr. Bumblebee, Mr. Fox, and Georgina. Mr. Bumblebee and Georgina mosey inside together, arm in arm, but Mr. Fox lingers on the porch, watching the balloon drift down the winding, lengthy path. Moments later, he and Mr. Bumblebee march back into the ballroom, where Mrs. Hawk and Miss Bumblebee are waiting, and he gives Miss Bumblebee a fierce glare, making her avert her gaze. Mr. Fox then glides through the grand tapestry-lined corridor at Pasadena, lifting high a torch to illuminate his path, with two cats ambling at his heels. He slips into the now-shadowed ballroom and sets the torch on a mantelpiece, pausing briefly, leaning against the bookshelf as if absorbed in thought, before glancing over at the violin Lily was playing earlier and softening his expression as he recalls her raising her eyes to meet his in a moment suspended in time. The next morning breaks overcast and hazy over Pasadena as Fox stands in front of his wardrobe, getting dressed, while his valet brings him his cloak, which he takes and drapes on. Dressed flawlessly in a seafoam cloak, ivory trousers, hiking shoes, and a wide-brimmed hat, he trots through the parklands on his black stallion, giving it a gentle nudge with a branch to hurry up the sandy dune. At Lambsville, the butler discovers Lily and the Elephants, prompting Mr. Elephant to unlock the gate, and they venture out, leaving Lily by herself with her packages. She curls up to unwrap the first one, while elsewhere a courier dismounts from his camel and hands Mr. Rabbit, in his slippers, a parcel, which he unwraps after passing his torch to the cook. Lily's eyes brim with tears as Willoughby turns to look at Lisa. Lily swiftly tears open the next parcel, then sets down the packages and rushes to the gate as Mr. Fox strides in. The butler arrives, and Mr. Fox settles down, grasping Lily's glove, as Lily collapses in tears."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Mr. Gardiner and Georgiana stand beside Lizzie, who sets music for Georgiana while exchanging warm glances with Mr. Darcy across the room. Miss Bingley interrupts Lizzie, but she returns to Georgiana. At dusk, a carriage departs Pemberley as Mr. Bingley and Georgiana go inside, leaving Mr. Darcy watching the carriage. Mr. Darcy later enters the drawing room, gives Miss Bingley a piercing stare, and reflects by the fireplace, softening at the memory of Lizzie's gaze. The next misty morning, Darcy dresses impeccably and rides his horse across the estate. Meanwhile, in Lambton, Lizzie opens letters, and a messenger delivers one to Mr. Bennet. Lizzie, moved to tears by her correspondence, rushes to the door as Mr. Darcy arrives. Lizzie, in tears, takes Mr. Darcy's hand as he comforts her."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "as Lizzie breaks down in tears The maid appears and Mr Darcy sits down taking Lizzie's hand  Lizzie hurriedly opens the next letter then puts down the letters and hurries to the door as Mr Darcy strides in  Lizzie's eyes fill with tears as Wickham turns to look at Lydia  while elsewhere a messenger dismounts from his horse and hands Mr Bennet in his night things a letter which he opens after passing his candle to the housekeeper  She settles down to open the first one  At Lambton the maid finds Lizzie and the Gardiners prompting Mr Gardiner to open the door and they head out leaving Lizzie alone with her letters  Dressed immaculately in a bottlegreen frock coat cream breeches riding boots and a top hat he gallops through the grounds on his white horse giving it a faint tap with a whip to speed up the grassy hill  The next day dawns grey and misty over Pemberley as Darcy stands in front of his mirror getting dressed while his butler brings him his frock coat which he takes and pulls on  Lizzie was playing earlier and softening his expression as he remembers her lifting her eyes to meet his in a moment frozen in time  He enters the nowdarkened drawing room and places the candle on a mantelpiece pausing for a moment leaning against the fireplace as if lost in thought before looking over at the piano  Mr Darcy then walks through the magnificent portraitlined hall at Pemberley holding aloft a candle to light his way with two dogs trotting at his heels  Moments later he and Mr Bingley stride back into the drawing room where Mrs Hurst and Miss Bingley are waiting and he gives Miss Bingley a piercing stare causing her to look away  Mr Bingley and Georgiana head inside together arm in arm but Mr Darcy remains on the doorstep watching the carriage clatter down the long curving driveway  Mr Darcy and Georgiana  Later as dusk falls a carriage pulls away from Pemberley waved off by Mr Bingley  The two gaze at each other their eyes filled with warmth and understanding  Slowly Lizzie raises her eyes to meet Mr Darcy's who sits across the room watching her with an enraptured expression  Lizzie hurries back over to Georgiana  Mr Darcy sits up and embarrassed  They both look over at Mr Darcy and then Lizzie gets up and sets the music out for Georgiana before making her way across the room only to be stopped by Miss Bingley  Mr Gardiner smiles over at Mr Darcy while Georgiana stands at Lizzie's side looking down at her "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "They both look over at Mr Darcy and then Lizzie gets up and sets the music out for Georgiana before making her way across the room only to be stopped by Miss Bingley Mr Gardiner smiles over at Mr Darcy while Georgiana stands at Lizzie's side looking down at her Lizzie hurries back over to Georgiana Mr Darcy sits up and embarrassed The two gaze at each other their eyes filled with warmth and understanding Slowly Lizzie raises her eyes to meet Mr Darcy's who sits across the room watching her with an enraptured expression Mr Darcy and Georgiana Later as dusk falls a carriage pulls away from Pemberley waved off by Mr Bingley Moments later he and Mr Bingley stride back into the drawing room where Mrs Hurst and Miss Bingley are waiting and he gives Miss Bingley a piercing stare causing her to look away Mr Bingley and Georgiana head inside together arm in arm but Mr Darcy remains on the doorstep watching the carriage clatter down the long curving driveway He enters the nowdarkened drawing room and places the candle on a mantelpiece pausing for a moment leaning against the fireplace as if lost in thought before looking over at the piano Mr Darcy then walks through the magnificent portraitlined hall at Pemberley holding aloft a candle to light his way with two dogs trotting at his heels The next day dawns grey and misty over Pemberley as Darcy stands in front of his mirror getting dressed while his butler brings him his frock coat which he takes and pulls on Lizzie was playing earlier and softening his expression as he remembers her lifting her eyes to meet his in a moment frozen in time At Lambton the maid finds Lizzie and the Gardiners prompting Mr Gardiner to open the door and they head out leaving Lizzie alone with her letters Dressed immaculately in a bottlegreen frock coat cream breeches riding boots and a top hat he gallops through the grounds on his white horse giving it a faint tap with a whip to speed up the grassy hill while elsewhere a messenger dismounts from his horse and hands Mr Bennet in his night things a letter which he opens after passing his candle to the housekeeper She settles down to open the first one Lizzie hurriedly opens the next letter then puts down the letters and hurries to the door as Mr Darcy strides in Lizzie's eyes fill with tears as Wickham turns to look at Lydia as Lizzie breaks down in tears The maid appears and Mr Darcy sits down taking Lizzie's hand"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He enters the nowdarkened drawing room and places the candle on a mantelpiece pausing for a moment leaning against the fireplace as if lost in thought before looking over at the piano  Lizzie was playing earlier and softening his expression as he remembers her lifting her eyes to meet his in a moment frozen in time  The next day dawns grey and misty over Pemberley as Darcy stands in front of his mirror getting dressed while his butler brings him his frock coat which he takes and pulls on  Dressed immaculately in a bottlegreen frock coat cream breeches riding boots and a top hat he gallops through the grounds on his white horse giving it a faint tap with a whip to speed up the grassy hill  At Lambton the maid finds Lizzie and the Gardiners prompting Mr Gardiner to open the door and they head out leaving Lizzie alone with her letters  She settles down to open the first one  while elsewhere a messenger dismounts from his horse and hands Mr Bennet in his night things a letter which he opens after passing his candle to the housekeeper  Lizzie's eyes fill with tears as Wickham turns to look at Lydia  Lizzie hurriedly opens the next letter then puts down the letters and hurries to the door as Mr Darcy strides in  The maid appears and Mr Darcy sits down taking Lizzie's hand  as Lizzie breaks down in tears Mr Gardiner smiles over at Mr Darcy while Georgiana stands at Lizzie's side looking down at her  They both look over at Mr Darcy and then Lizzie gets up and sets the music out for Georgiana before making her way across the room only to be stopped by Miss Bingley  Mr Darcy sits up and embarrassed  Lizzie hurries back over to Georgiana  Slowly Lizzie raises her eyes to meet Mr Darcy's who sits across the room watching her with an enraptured expression  The two gaze at each other their eyes filled with warmth and understanding  Later as dusk falls a carriage pulls away from Pemberley waved off by Mr Bingley  Mr Darcy and Georgiana  Mr Bingley and Georgiana head inside together arm in arm but Mr Darcy remains on the doorstep watching the carriage clatter down the long curving driveway  Moments later he and Mr Bingley stride back into the drawing room where Mrs Hurst and Miss Bingley are waiting and he gives Miss Bingley a piercing stare causing her to look away  Mr Darcy then walks through the magnificent portraitlined hall at Pemberley holding aloft a candle to light his way with two dogs trotting at his heels "
        }
      ]
    }
  ]
}