{
  "ground_truth": "An empty carriage arrives at Longbourn, and as it pulls to a halt, the footman opens the door, allowing the Wickhams to emerge from the house, surrounded by Lydia's sisters and parents. He ushers Lydia into the carriage, which then pulls away as Lydia leans out of the window to wave a cheery goodbye to her family. Later, Lizzie and Jane are taking a turn in the gardens, with the bright sun beating down on them, while indoors, Mary practices her piano and Kitty is busy decorating a straw bonnet with ribbon until she stops, looks wearily at the bonnet, and tosses it away. Mrs. Bennet is lying back on a chaise lounge in her room, fanning herself and ordering the servants about, while Mr. Bennet sits peacefully by the fire in the parlor, reading a book and sipping a glass of wine. Lizzie, now in her room and in her nightgown, sits in front of the mirror, gazes sadly at her reflection, and then leans forward to blow out the candle. It is a bright, sunny day when Mrs. Phillips comes to visit her sister, Mrs. Bennet, at Longbourn, and a horse and cart filled with trunks pulls up at Netherfield. Inside the house, shutters are opened and smoke pours out of the chimney as the fires are lit, while a procession of servants troop inside, carrying baskets of food and provisions. Mr. Bingley is out shooting, and they are in the kitchen, hanging up bunches of herbs. Lizzie looks at her sister while Mary is at the piano, and as Mrs. Bennet scurries over to the window, Jane tries to hide her excitement. Lizzie breathes deeply as Mrs. Bennet checks her reflection in the mirror, swiftly taking a seat as the housekeeper shows their guests in. Jane and Lizzie look nervous as the two gentlemen enter and bow. Everyone takes their seats, except Mr. Darcy, who strolls over to the window and smiles at Jane. Mr. Darcy continues looking out the window as Lizzie glares at her mother with embarrassment. The two gentlemen are now on their horses, riding away from Longbourn, while Jane and Lizzie take a stroll in the gardens and continue on their walk, with Jane looking somewhat sheepish. At Netherfield, Mr. Bingley and Mr. Darcy emerge from the front door, and astonished, Mr. Bingley watches as Mr. Darcy climbs into his carriage. As the carriage pulls away, Mr. Bingley immediately looks around for the nearest servant, and then he is on horseback, trotting through a shady avenue of trees on his way to Longbourn. She bursts into Lizzie's room, and afterward, an awkward-looking Mr. Bingley is sitting opposite Lizzie, Kitty, and Jane in the parlor.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "An unfilled conveyance arrives at Longbourn, and as it pulls to a stop, the attendant opens the portal, allowing the Wickhams to emerge from the dwelling, surrounded by Lydia's siblings and progenitors. He ushers Lydia into the conveyance, which then pulls away as Lydia leans out of the casement to wave a cheery farewell to her kin. Later, Lizzie and Jane are taking a turn in the gardens, with the bright sun beating down on them, while indoors, Mary practices her pianoforte and Kitty is busy decorating a straw hat with ribbon until she stops, looks wearily at the hat, and tosses it aside. Mrs. Bennet is lying back on a chaise longue in her chamber, fanning herself and ordering the domestics about, while Mr. Bennet sits tranquilly by the hearth in the parlor, reading a tome and sipping a goblet of wine. Lizzie, now in her chamber and in her nightdress, sits in front of the mirror, gazes sadly at her reflection, and then leans forward to extinguish the candle. It is a bright, sunny day when Mrs. Phillips comes to visit her sister, Mrs. Bennet, at Longbourn, and a horse and wagon filled with trunks pulls up at Netherfield. Inside the dwelling, shutters are opened and smoke pours out of the chimney as the fires are kindled, while a procession of domestics troop inside, carrying baskets of nourishment and provisions. Mr. Bingley is out shooting, and they are in the kitchen, hanging up bunches of herbs. Lizzie looks at her sister while Mary is at the pianoforte, and as Mrs. Bennet scurries over to the casement, Jane tries to conceal her excitement. Lizzie breathes deeply as Mrs. Bennet checks her reflection in the mirror, swiftly taking a seat as the housekeeper shows their visitors in. Jane and Lizzie look nervous as the two gentlemen enter and bow. Everyone takes their seats, except Mr. Darcy, who strolls over to the casement and smiles at Jane. Mr. Darcy continues looking out the casement as Lizzie glares at her mother with embarrassment. The two gentlemen are now on their horses, riding away from Longbourn, while Jane and Lizzie take a stroll in the gardens and continue on their walk, with Jane looking somewhat sheepish. At Netherfield, Mr. Bingley and Mr. Darcy emerge from the front portal, and astonished, Mr. Bingley watches as Mr. Darcy climbs into his conveyance. As the conveyance pulls away, Mr. Bingley immediately looks around for the nearest domestic, and then he is on horseback, trotting through a shady avenue of trees on his way to Longbourn. She bursts into Lizzie's chamber, and afterward, an awkward-looking Mr. Bingley is sitting opposite Lizzie, Kitty, and Jane in the parlor."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "An empty carriage is arrived at Longbourn, and as it is pulled to a halt, the door is opened by the footman, allowing the Wickhams to be emerged from the house, surrounded by Lydia's sisters and parents. Lydia is ushered into the carriage by him, which is then pulled away as a cheery goodbye is waved to her family by Lydia, leaning out of the window. Later, a turn is taken by Lizzie and Jane in the gardens, the bright sun beats down on them, while indoors, Mary practices her piano and a straw bonnet is decorated with ribbon by Kitty until it is stopped, the bonnet is looked at wearily, and it is tossed away by her. Mrs. Bennet lies back on a chaise lounge in her room, herself is fanned and the servants are ordered about by her, while Mr. Bennet sits peacefully by the fire in the parlor, reads a book, and sips a glass of wine. Lizzie, now in her room and in her nightgown, is seated in front of the mirror, her reflection is gazed at sadly by her, and then the candle is leaned forward to be blown out. It is a bright, sunny day when Mrs. Phillips visits her sister, Mrs. Bennet, at Longbourn, and a horse and cart filled with trunks are pulled up at Netherfield. Inside the house, shutters are opened and smoke pours out of the chimney as the fires are lit, while a procession of servants troops inside, carrying baskets of food and provisions. Mr. Bingley shoots outside, and they hang up bunches of herbs in the kitchen. Lizzie looks at her sister while Mary plays the piano, and as Mrs. Bennet scurries over to the window, Jane tries to hide her excitement. Lizzie deeply breathes as Mrs. Bennet's reflection is checked in the mirror by her, a seat is swiftly taken by her as their guests are shown in by the housekeeper. Jane and Lizzie nervously look as the two gentlemen enter and bow. Seats are taken by everyone except Mr. Darcy, who strolls over to the window and smiles at Jane. Mr. Darcy continues to look out the window while Lizzie glares at her mother with embarrassment. The two gentlemen ride on their horses away from Longbourn, while a stroll is taken by Jane and Lizzie in the gardens, and their walk is continued by them, with Jane looking somewhat sheepish. Mr. Bingley and Mr. Darcy emerge from the front door at Netherfield, and astonished, Mr. Bingley watches as Mr. Darcy climbs into his carriage. As the carriage is pulled away, Mr. Bingley immediately looks around for the nearest servant, then he trots on horseback through a shady avenue of trees on his way to Longbourn. Lizzie's room is burst into by her, and afterward, an awkward-looking Mr. Bingley sits opposite Lizzie, Kitty, and Jane in the parlor."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "An empty carriage arrives at Longbourn, stopping so the footman can open the door for the Wickhams. Lydia boards the carriage, waving a cheerful goodbye as it departs. Later, Lizzie and Jane stroll in the garden under the bright sun, while indoors, Mary practices piano and Kitty decorates a straw bonnet, soon discarding it in frustration. Mrs. Bennet relaxes on a chaise lounge, fanning herself and directing servants, while Mr. Bennet reads by the fire, sipping wine. Lizzie, in her nightgown, gazes sadly at her reflection before extinguishing the candle. A sunny day sees Mrs. Phillips visiting Mrs. Bennet at Longbourn, and a cart of trunks arrives at Netherfield. Inside, shutters open and smoke emerges as fires are lit, with servants carrying baskets of provisions. Mr. Bingley is shooting, and herbs hang in the kitchen. Lizzie and Jane exchange looks as Mrs. Bennet rushes to the window with Jane hiding her excitement. Lizzie sighs as Mrs. Bennet checks her reflection, sitting as guests are shown in by the housekeeper. Jane and Lizzie appear nervous as the gentlemen enter. Everyone sits except Mr. Darcy, who smiles at Jane by the window. Darcy looks out as Lizzie glares at her mother with embarrassment. The gentlemen depart on horseback as Jane and Lizzie walk in the gardens, Jane appearing sheepish. At Netherfield, Mr. Bingley watches Mr. Darcy board a carriage and, shocked, seeks a servant before riding through a tree-lined avenue to Longbourn. He bursts into Lizzie's room, later sitting awkwardly opposite Lizzie, Kitty, and Jane in the parlor."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "An empty carriage arrives at Longbourn. The footman opens the door, allowing the Wickhams to leave, surrounded by Lydia's family. Lydia gets in, waves a cheery goodbye, and the carriage departs. Outside, Lizzie and Jane walk in the garden under the bright sun. Indoors, Mary practices piano, while Kitty decorates a straw bonnet, then tosses it aside. Mrs. Bennet lounges, fanning herself and instructing servants, while Mr. Bennet reads peacefully by the fire. Lizzie, now in her room and nightgown, gazes sadly at the mirror before blowing out the candle. It's sunny when Mrs. Phillips visits Mrs. Bennet at Longbourn. A horse and cart with trunks arrives at Netherfield, where shutters open and fires are lit. Servants carry baskets of food, and Mr. Bingley is out shooting as herbs hang in the kitchen. Lizzie looks at Mary on the piano while Mrs. Bennet checks her reflection and takes a seat as guests arrive. Jane and Lizzie are nervous as two gentlemen enter and bow; Mr. Darcy smiles at Jane from the window. The gentlemen leave on horses as Jane and Lizzie stroll in the garden. At Netherfield, Mr. Bingley watches Mr. Darcy leave in a carriage, and then rides to Longbourn. He bursts into Lizzie's room, and later, he awkwardly sits opposite Lizzie, Kitty, and Jane in the parlor."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "An unoccupied carriage arrives at the front of Longbourn, and as it gradually comes to a complete stop, the attentive footman promptly opens the door, allowing the Wickhams to make their way out of the house. They are accompanied by Lydia's sisters and their parents, who gather around them. With a courteous gesture, the footman ushers Lydia into the carriage, which then begins to pull away from the property as Lydia enthusiastically leans out of the window to wave a cheerful farewell to her family members. Later in the day, Lizzie and Jane are seen taking a leisurely walk around the gardens, with the bright, warm sun shining down upon them, while indoors, Mary is diligently practicing her piano, and Kitty is occupied with adorning a straw bonnet using ribbons. As she works on the bonnet, Kitty pauses, gazes tiredly at her handiwork, and eventually discards it in frustration. Mrs. Bennet finds herself reclining on a chaise lounge in her room, fanning herself lazily while giving orders to the servants, whereas Mr. Bennet is settled contentedly by the fire in the parlor, absorbed in a book while sipping a glass of wine. Upstairs, Lizzie, now dressed in her nightgown, sits reflectively in front of the mirror, staring sadly at her own reflection, and then leans in to blow out the candle. \n\nIt is another bright, sunny day when Mrs. Phillips decides to come by and visit her sister, Mrs. Bennet, at Longbourn. At the same time, a horse and cart laden with trunks pulls up at Netherfield. Inside the house, shutters are flung open and smoke begins to billow out of the chimney as the fires are lit, while a procession of servants makes their way inside, carrying baskets filled with food and various provisions. Mr. Bingley is out enjoying a morning of shooting, and within the kitchen, herbs are being hung up to dry. Lizzie exchanges a meaningful glance with her sister while Mary continues to play the piano, and Mrs. Bennet scurries over to the window, with Jane attempting to contain her visible excitement. Lizzie takes a deep breath as Mrs. Bennet checks her appearance in the mirror and swiftly takes a seat as the housekeeper shows their esteemed guests into the room. Jane and Lizzie appear anxious as the two gentlemen make their entrance and graciously bow. Everyone finds their seats, except for Mr. Darcy, who leisurely strolls over to the window, offering a smile in Jane's direction. Mr. Darcy maintains his position at the window, looking out thoughtfully, while Lizzie casts a glance of embarrassment toward her mother. The two gentlemen are now seen on horseback, riding away from Longbourn, while Jane and Lizzie take yet another peaceful walk in the gardens, with Jane exuding a rather sheepish demeanor. Over at Netherfield, Mr. Bingley and Mr. Darcy step through the front door, and with astonishment, Mr. Bingley watches as Mr. Darcy climbs into his carriage. As the carriage departs, Mr. Bingley's immediate response is to look around eagerly for the nearest servant, and before long, he is mounted on horseback, trotting briskly through a shaded avenue of trees on his way back to Longbourn. She bursts energetically into Lizzie's room, and shortly thereafter, an awkward-looking Mr. Bingley is seated opposite Lizzie, Kitty, and Jane in the parlor."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "An unoccupied carriage arrives punctually at the entrance of the Longbourn estate, and as it gradually comes to a complete stop, the attentive footman, performing his duties with precision, promptly opens the door. This action allows the Wickhams to make their way out of the house. They are accompanied on this occasion by Lydia's sisters and their parents, who gather around them with a sense of familial support. With a courteous gesture, the footman helps usher Lydia gracefully into the waiting carriage, which soon begins to pull away from the property. Lydia, filled with emotion, leans enthusiastically out of the window to wave a cheerful farewell to her family members gathered below. Later in the day, Lizzie and Jane can be seen taking an unhurried, leisurely walk around the lush gardens, with the bright, warm sun shining radiantly down upon them, casting light and warmth on their path. Meanwhile, indoors, Mary is diligently practicing her piano with focused determination, and Kitty is occupied with the creative task of adorning a straw bonnet using ribbons. As she meticulously works on the bonnet, Kitty pauses, casting a tired gaze at her handiwork, and eventually discards it in frustration, unable to hide her exasperation. Mrs. Bennet finds herself reclining comfortably on a chaise lounge in her room, fanning herself lazily as she efficiently gives orders to the servants. At the same time, Mr. Bennet is settled contentedly by the comforting fire in the parlor, completely absorbed in a book while sipping leisurely from a glass of wine. Upstairs, Lizzie, now dressed in her nightgown, sits reflectively in front of the mirror, staring sadly at her own reflection, and then gently leans in to blow out the flickering candle.\n\nIt is yet another bright, sunny day when Mrs. Phillips decides to come by for a visit to see her sister, Mrs. Bennet, at Longbourn. At this very same time, a horse and cart heavily laden with trunks makes its way to Netherfield and comes to a stop. Inside the house, shutters are flung open wide, and smoke begins to billow steadily from the chimney as the fires are lit with care. Meanwhile, a procession of servants makes their way inside, their arms carrying baskets filled with food and various necessary provisions. Mr. Bingley is outdoors, enjoying a morning filled with the sport of shooting. Within the bustling kitchen, herbs are being hung up carefully to dry. Lizzie exchanges a meaningful glance with her sister, conveying unspoken thoughts, while Mary continues to play the piano with dedication. At the same time, Mrs. Bennet scurries over to the window with a sense of urgency, and Jane attempts to contain her visible excitement, smiling all the while. Lizzie takes a deep, steadying breath as Mrs. Bennet checks her appearance in the mirror, and swiftly takes a seat just as the attentive housekeeper shows their esteemed guests into the room. Jane and Lizzie both appear anxious as the two gentlemen make their entrance and graciously bow in unison. Everyone finds their seats, except for Mr. Darcy, who leisurely strolls over to the window, where he offers a gentle smile in Jane's direction. Mr. Darcy maintains his position at the window, thoughtfully looking out as Lizzie casts a glance of embarrassment toward her mother. The two gentlemen are now seen on horseback, making their way away from Longbourn, while Jane and Lizzie take yet another peaceful walk in the gardens, with Jane exuding a somewhat sheepish demeanor. Over at Netherfield, Mr. Bingley and Mr. Darcy step through the front door, and with astonishment, Mr. Bingley watches closely as Mr. Darcy ascends into his carriage. As the carriage departs from view, Mr. Bingley's immediate response is to look around eagerly for the nearest servant, and before long, he is mounted on horseback, trotting briskly through a shaded avenue of trees on his way back to Longbourn. He bursts energetically into Lizzie's room, and shortly thereafter, an awkward-looking Mr. Bingley is seated opposite Lizzie, Kitty, and Jane in the parlor, attempting to engage with them as best he can."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "An empty carriage makes its way to Longbourn and comes to a halt in front of the house. As the carriage settles, the footman deftly opens its door, creating an entrance for the Wickhams, who are emerging from the house with Lydia flanked by her sisters and parents. The footman skillfully guides Lydia into the carriage, ensuring she is settled before the carriage begins to move. As the carriage pulls away from Longbourn, Lydia leans out of the window, a playful gesture, and waves enthusiastically, bidding a cheerful farewell to her family. The scene shifts to later where Lizzie and Jane are seen taking a leisurely stroll in the garden, the sun brightly shining down upon them, casting long shadows on the ground. Inside, Mary is seated at the piano, her fingers gracefully moving over the keys as she practices, while Kitty is absorbed in the task of decorating a straw bonnet with ribbon. Kitty pauses her work, looks at the bonnet with a tired expression, and, as if frustrated, tosses it aside. In another part of the house, Mrs. Bennet reclines comfortably on a chaise lounge in her room, waving a fan back and forth to keep cool and giving instructions to the servants with an air of indulgence. At the same time, Mr. Bennet is in the parlor, settled in his armchair by the fire, engrossed in a book while leisurely sipping from his glass of wine. The scene transitions to Lizzie in the quiet of her room, now dressed in her nightgown. She sits at her vanity, looking intently at her own reflection, a sad expression crossing her face, before she leans forward and extinguishes the candle, casting the room into darkness. The narrative moves to a bright and sunny day when Mrs. Phillips visits her sister, Mrs. Bennet, at Longbourn. Meanwhile, at Netherfield, a horse and cart loaded with trunks pulls up, signifying the arrival of guests or new occupants. Inside the house, a flurry of activity unfolds as shutters are opened, illuminating the rooms, while smoke begins billowing from the chimney as fires are lit, signaling warmth and hospitality. A line of servants enters the house, each carrying baskets brimming with food and provisions, ensuring that the household is well-stocked. Mr. Bingley is outside, engaged in shooting, while inside the kitchen, bunches of herbs are being hung up, adding to the household preparations. Lizzie, meanwhile, exchanges a glance with her sister while Mary continues playing the piano. Mrs. Bennet, always alert to visitors, hurries over to the window, and Jane makes a concerted effort to conceal her excitement at the prospect of seeing Mr. Bingley. Lizzie draws a deep breath, steadying herself, as Mrs. Bennet inspects her reflection in the mirror, ensuring her appearance is perfect before promptly sitting as the housekeeper escorts guests inside. Jane and Lizzie wear expressions of nervous anticipation as two gentlemen, Mr. Bingley and Mr. Darcy, enter and offer a polite bow. The group gradually takes their seats, the exception being Mr. Darcy, who casually ambles over to the window, casting a smile in Jane's direction, lingering there as Lizzie directs a look of embarrassment at her mother. The scene changes to show the two gentlemen now on horseback, departing from Longbourn, the sound of hooves marking their departure. Jane and Lizzie continue their walk in the gardens, Jane's expression reflecting a hint of sheepishness. Back at Netherfield, Mr. Bingley and Mr. Darcy emerge from the front entrance, with Mr. Bingley appearing astonished as he observes Mr. Darcy stepping into his carriage. As the carriage rolls away, Mr. Bingley quickly scans for the nearest servant, and soon he is mounted on his horse, riding through a shaded avenue of trees as he makes his way to Longbourn. Suddenly, Mrs. Bennet bursts into Lizzie's room, full of excitement, and shortly after, a slightly awkward Mr. Bingley finds himself seated opposite Lizzie, Kitty, and Jane in the parlor, an air of unease hovering over the gathering."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "An empty carriage arrives at Longbourn, and as it halts, the footman opens the door for the Wickhams, who emerge from the house with Lydia's family. Lydia enters the carriage with her family's farewell, leaning out to wave as it departs. Later, Lizzie and Jane stroll through the sunlit gardens, while indoors, Mary practices the piano, and Kitty decorates a bonnet before discarding it in frustration. Mrs. Bennet relaxes on a chaise, fanning herself and directing servants, while Mr. Bennet enjoys a book and wine by the fire. Lizzie, now in her nightgown, reflects sadly in the mirror before extinguishing the candle. On a bright day, Mrs. Phillips visits Mrs. Bennet at Longbourn as a horse and cart with trunks arrives at Netherfield. Inside Netherfield, shutters open, fires are lit, and servants bring provisions, while Mr. Bingley is out shooting. Lizzie observes Jane as Mary plays the piano, and Mrs. Bennet eagerly watches from the window. Jane struggles to conceal her excitement as Lizzie takes a deep breath, and Mrs. Bennet checks her reflection before seating herself as the housekeeper announces their guests. Jane and Lizzie show nervousness as the gentlemen enter and bow. Everyone sits except Mr. Darcy, who smiles at Jane from the window while Lizzie exchanges an embarrassed glance with her mother. The gentlemen leave on horseback, and Jane and Lizzie continue their garden stroll. At Netherfield, Mr. Bingley watches surprised as Mr. Darcy departs in his carriage. Bingley quickly mounts his horse, riding through a tree-lined avenue toward Longbourn. He arrives, appearing awkward, to join Lizzie, Kitty, and Jane in the parlor."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "An empty carriage arrives at Longbourn, the Bennet family's home situated in the rural countryside of Hertfordshire, and as it pulls to a halt, the footman, dressed in the distinctive livery of the Bennet household, opens the door, allowing the Wickhams to emerge from the house, surrounded by Lydia's sisters and parents. He ushers Lydia, known for her impulsive and lively nature, into the carriage, which then pulls away as Lydia leans out of the window to wave a cheery goodbye to her family. Later, Lizzie and Jane are taking a turn in the gardens, a popular pastime for young women in the Regency era, with the bright sun beating down on them, while indoors, Mary practices her piano, an instrument indicative of her studious demeanor, and Kitty is busy decorating a straw bonnet with ribbon until she stops, looks wearily at the bonnet, and tosses it away. Mrs. Bennet is lying back on a chaise lounge in her room, fanning herself in the warm afternoon, and ordering the servants about, while Mr. Bennet sits peacefully by the fire in the parlor, reading a book with the quiet concentration of a man who enjoys his solitude and sipping a glass of wine. Lizzie, now in her room and in her nightgown, sits in front of the mirror, gazes sadly at her reflection, pondering the weight of recent events, and then leans forward to blow out the candle. It is a bright, sunny day when Mrs. Phillips, who regularly visits to gossip, comes to visit her sister, Mrs. Bennet, at Longbourn, and a horse and cart filled with trunks pulls up at Netherfield, recently reacquired by Mr. Bingley. Inside the house, shutters are opened, and smoke pours out of the chimney as the fires are lit, while a procession of servants, integral to maintaining the grand estate, troop inside, carrying baskets of food and provisions. Mr. Bingley is out shooting, a common pastime for gentlemen of his status, and they are in the kitchen, hanging up bunches of herbs for drying and use in cooking. Lizzie looks at her sister while Mary is at the piano, and as Mrs. Bennet scurries over to the window, Jane tries to hide her excitement at the thought of Mr. Bingley's attention. Lizzie breathes deeply as Mrs. Bennet checks her reflection in the mirror, her thoughts likely on social appearances, swiftly taking a seat as the housekeeper, an authoritative figure in household management, shows their guests in. Jane and Lizzie look nervous as the two gentlemen enter and bow, a customary greeting of the time. Everyone takes their seats, except Mr. Darcy, who strolls over to the window and smiles at Jane, acknowledging her presence and perhaps hinting at his approval. Mr. Darcy continues looking out the window as Lizzie glares at her mother with embarrassment, aware of Mrs. Bennet's often indiscreet behavior. The two gentlemen are now on their horses, riding away from Longbourn, while Jane and Lizzie take a stroll in the gardens and continue on their walk, with Jane looking somewhat sheepish, reflecting on her feelings for Mr. Bingley. At Netherfield, Mr. Bingley and Mr. Darcy emerge from the front door, and astonished, Mr. Bingley watches as Mr. Darcy, always one step ahead, climbs into his carriage. As the carriage pulls away, Mr. Bingley immediately looks around for the nearest servant, demonstrating his eagerness and perhaps his reliance on his staff, and then he is on horseback, trotting through a shady avenue of trees on his way to Longbourn, eager to return to Jane. She bursts into Lizzie's room, and afterward, an awkward-looking Mr. Bingley is sitting opposite Lizzie, Kitty, and Jane in the parlor, the room filled with a mix of anticipation and unease."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "An empty carriage arrives at Longbourn and as it pulls to a halt the footman opens the door allowing the Wickhams to emerge from the house surrounded by Lydia's sisters and parents. He ushers Lydia into the carriage which then pulls away as Lydia leans out of the window to wave a cheery goodbye to her family. Later Lizzie and Jane are taking a turn in the gardens with the bright sun beating down on them. while indoors Mary practices her piano and Kitty is busy decorating a straw bonnet with ribbon until she stops looks wearily at the bonnet and tosses it away. Mrs Bennet is lying back on a chaise lounge in her room fanning herself and ordering the servants about while Mr Bennet sits peacefully by the fire in the parlor reading a book and sipping a glass of wine. Lizzie now in her room and in her nightgown sits in front of the mirror gazes sadly at her reflection and then leans forward to blow out the candle. It is a bright sunny day when Mrs Phillips comes to visit her sister Mrs Bennet at Longbourn and a horse and cart filled with trunks pulls up at Netherfield. Inside the house shutters are opened and smoke pours out of the chimney as the fires are lit while a procession of servants troop inside carrying baskets of food and provisions. Mr Bingley is out shooting and they are in the kitchen hanging up bunches of herbs. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Lizzie looks at her sister while Mary is at the piano and as Mrs Bennet scurries over to the window Jane tries to hide her excitement. Lizzie breathes deeply as Mrs Bennet checks her reflection in the mirror swiftly taking a seat as the housekeeper shows their guests in. Jane and Lizzie look nervous as the two gentlemen enter and bow. Everyone takes their seats except Mr Darcy who strolls over to the window and smiles at Jane. Mr Darcy continues looking out the window as Lizzie glares at her mother with embarrassment. The two gentlemen are now on their horses riding away from Longbourn while Jane and Lizzie take a stroll in the gardens and continue on their walk with Jane looking somewhat sheepish. At Netherfield Mr Bingley and Mr Darcy emerge from the front door and astonished Mr Bingley watches as Mr Darcy climbs into his carriage. As the carriage pulls away Mr Bingley immediately looks around for the nearest servant and then he is on horseback trotting through a shady avenue of trees on his way to Longbourn. She bursts into Lizzie's room and afterward an awkwardlooking Mr Bingley is sitting opposite Lizzie Kitty and Jane in the parlor."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "An empty carriage arrives at Longbourn and as it pulls to a halt the footman opens the door allowing the Wickhams to emerge from the house surrounded by Lydia's sisters and parents. He ushers Lydia into the carriage which then pulls away as Lydia leans out of the window to wave a cheery goodbye to her family. Later Lizzie and Jane are taking a turn in the gardens with the bright sun beating down on them. while indoors Mary practices her piano and Kitty is busy decorating a straw bonnet with ribbon until she stops looks wearily at the bonnet and tosses it away. Mrs Bennet is lying back on a chaise lounge in her room fanning herself and ordering the servants about while Mr Bennet sits peacefully by the fire in the parlor reading a book and sipping a glass of wine. Lizzie now in her room and in her nightgown sits in front of the mirror gazes sadly at her reflection and then leans forward to blow out the candle. It is a bright sunny day when Mrs Phillips comes to visit her sister Mrs Bennet at Longbourn and a horse and cart filled with trunks pulls up at Netherfield. Inside the house shutters are opened and smoke pours out of the chimney as the fires are lit while a procession of servants troop inside carrying baskets of food and provisions. Mr Bingley is out shooting and they are in the kitchen hanging up bunches of herbs. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Lizzie looks at her sister while Mary is at the piano and as Mrs Bennet scurries over to the window Jane tries to hide her excitement. Lizzie breathes deeply as Mrs Bennet checks her reflection in the mirror swiftly taking a seat as the housekeeper shows their guests in. Jane and Lizzie look nervous as the two gentlemen enter and bow. Everyone takes their seats except Mr Darcy who strolls over to the window and smiles at Jane. Mr Darcy continues looking out the window as Lizzie glares at her mother with embarrassment. The two gentlemen are now on their horses riding away from Longbourn while Jane and Lizzie take a stroll in the gardens and continue on their walk with Jane looking somewhat sheepish. At Netherfield Mr Bingley and Mr Darcy emerge from the front door and astonished Mr Bingley watches as Mr Darcy climbs into his carriage. As the carriage pulls away Mr Bingley immediately looks around for the nearest servant and then he is on horseback trotting through a shady avenue of trees on his way to Longbourn. She bursts into Lizzie's room and afterward an awkwardlooking Mr Bingley is sitting opposite Lizzie Kitty and Jane in the parlor."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "An empty carriage arrives at Longbourn and as it pulls to a halt the footman opens the door allowing the Wickhams to emerge from the house surrounded by Lydia's sisters and parents. He ushers Lydia into the carriage which then pulls away as Lydia leans out of the window to wave a cheery goodbye to her family. Later Lizzie and Jane are taking a turn in the gardens with the bright sun beating down on them. while indoors Mary practices her piano and Kitty is busy decorating a straw bonnet with ribbon until she stops looks wearily at the bonnet and tosses it away. Mrs Bennet is lying back on a chaise lounge in her room fanning herself and ordering the servants about while Mr Bennet sits peacefully by the fire in the parlor reading a book and sipping a glass of wine. The two gentlemen are now on their horses riding away from Longbourn while Jane and Lizzie take a stroll in the gardens and continue on their walk with Jane looking somewhat sheepish. At Netherfield Mr Bingley and Mr Darcy emerge from the front door and astonished Mr Bingley watches as Mr Darcy climbs into his carriage. As the carriage pulls away Mr Bingley immediately looks around for the nearest servant and then he is on horseback trotting through a shady avenue of trees on his way to Longbourn. She bursts into Lizzie's room and afterward an awkwardlooking Mr Bingley is sitting opposite Lizzie Kitty and Jane in the parlor."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "An empty carriage arrives at Longbourn and as it pulls to a halt the footman opens the door allowing the Wickhams to emerge from the house surrounded by Lydia's sisters and parents. He ushers Lydia into the carriage which then pulls away as Lydia leans out of the window to wave a cheery goodbye to her family. As the carriage pulls away Mr Bingley immediately looks around for the nearest servant and then he is on horseback trotting through a shady avenue of trees on his way to Longbourn. She bursts into Lizzie's room and afterward an awkwardlooking Mr Bingley is sitting opposite Lizzie Kitty and Jane in the parlor."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "A deserted bicycle rolls into Wuthering Heights, and as it slides to a stop, the gardener swings open the gate, permitting the Thompsons to float from the barn, encircled by Jamie's aunts and cousins. He steers Jamie into the sleigh, which then glides away as Jamie peeks out of the skylight to wave a bubbly farewell to the troupe. Eventually, Hector and Olivia are spinning in the atrium, with the soft rain tapping on them, while outdoors, Vivian sketches her sculpture and Lila is busy embroidering a wool blanket with sequins until she pauses, peers dully at the quilt, and hurls it aside. Miss Morton is lounging atop a hammock in her terrace, fanning herself and commanding the neighbors around, while Mr. Morton lounges calmly by the pond in the conservatory, poring over a scroll and nibbling on a slice of pie. Hector, now in his balcony and in his robe, perches in front of the clock, peers wistfully at his shadow, and then leans back to extinguish the lantern. It is a dull, rainy evening when Aunt Wilkinson arrives to visit her niece, Miss Morton, at Wuthering Heights, and a donkey and cart laden with barrels trundles up to Pemberley. Outside the cottage, awnings are closed and steam pours out of the chimney as the ovens are ignited, while a parade of neighbors sneak outside, holding bundles of tools and treasures. Ms. Rogers is up swimming, and they are on the lawn, hanging up strands of lanterns. Hector peeks at his cousin while Vivian is at the easel, and as Miss Morton hurries toward the skylight, Olivia tries to suppress her anticipation. Hector exhales loudly as Miss Morton examines her silhouette in the portrait, eagerly standing as the sibling welcomes their visitors out. Olivia and Hector appear anxious as the two chefs arrive and curtsy. Everyone stands, except Dr. Collins, who wanders toward the skylight and grins at Olivia. Dr. Collins remains gazing out the skylight as Hector fumes at his grandmother with mortification. The two chefs are now on their skateboards, gliding away from Wuthering Heights, while Olivia and Hector skip through the atrium and carry on with their jaunt, with Olivia appearing slightly bashful. At Pemberley, Ms. Rogers and Dr. Collins burst through the side gate, and bewildered, Ms. Rogers listens as Dr. Collins climbs aboard his bicycle. As the bicycle glides away, Ms. Rogers suddenly searches around for the nearest gardener, and then she is on foot, jogging through a bright alley of flowers on her way to Wuthering Heights. He crashes into Hector’s veranda, and afterward, an uneasy Dr. Collins is lounging beside Hector, Lila, and Olivia in the conservatory."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "An empty carriage arrives at Longbourn, and the Wickhams leave with Lydia waving goodbye. Lizzie and Jane stroll in the garden under the sun, while indoors, Mary plays piano, Kitty decorates a hat, and the Bennet parents relax. Lizzie, later in her room, blows out a candle, reflecting sadly. Mrs. Phillips visits Mrs. Bennet as preparations begin at Netherfield, with Mr. Bingley out shooting. Lizzie and Jane grow nervous when Mr. Bingley and Mr. Darcy visit; Darcy smiles at Jane, causing Lizzie embarrassment. As the gentlemen leave, Jane and Lizzie take another walk. At Netherfield, Mr. Bingley is surprised as Mr. Darcy departs. Bingley quickly rides to Longbourn, bursts into Lizzie's room, and sits awkwardly with Lizzie, Kitty, and Jane in the parlor."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She bursts into Lizzie's room and afterward an awkwardlooking Mr Bingley is sitting opposite Lizzie Kitty and Jane in the parlor As the carriage pulls away Mr Bingley immediately looks around for the nearest servant and then he is on horseback trotting through a shady avenue of trees on his way to Longbourn At Netherfield Mr Bingley and Mr Darcy emerge from the front door and astonished Mr Bingley watches as Mr Darcy climbs into his carriage The two gentlemen are now on their horses riding away from Longbourn while Jane and Lizzie take a stroll in the gardens and continue on their walk with Jane looking somewhat sheepish Mr Darcy continues looking out the window as Lizzie glares at her mother with embarrassment Everyone takes their seats except Mr Darcy who strolls over to the window and smiles at Jane Jane and Lizzie look nervous as the two gentlemen enter and bow Lizzie breathes deeply as Mrs Bennet checks her reflection in the mirror swiftly taking a seat as the housekeeper shows their guests in Lizzie looks at her sister while Mary is at the piano and as Mrs Bennet scurries over to the window Jane tries to hide her excitement Mr Bingley is out shooting and they are in the kitchen hanging up bunches of herbs Inside the house shutters are opened and smoke pours out of the chimney as the fires are lit while a procession of servants troop inside carrying baskets of food and provisions It is a bright sunny day when Mrs Phillips comes to visit her sister Mrs Bennet at Longbourn and a horse and cart filled with trunks pulls up at Netherfield Lizzie now in her room and in her nightgown sits in front of the mirror gazes sadly at her reflection and then leans forward to blow out the candle Mrs Bennet is lying back on a chaise lounge in her room fanning herself and ordering the servants about while Mr Bennet sits peacefully by the fire in the parlor reading a book and sipping a glass of wine while indoors Mary practices her piano and Kitty is busy decorating a straw bonnet with ribbon until she stops looks wearily at the bonnet and tosses it away Later Lizzie and Jane are taking a turn in the gardens with the bright sun beating down on them He ushers Lydia into the carriage which then pulls away as Lydia leans out of the window to wave a cheery goodbye to her family An empty carriage arrives at Longbourn and as it pulls to a halt the footman opens the door allowing the Wickhams to emerge from the house surrounded by Lydia's sisters and parents"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He ushers Lydia into the carriage which then pulls away as Lydia leans out of the window to wave a cheery goodbye to her family An empty carriage arrives at Longbourn and as it pulls to a halt the footman opens the door allowing the Wickhams to emerge from the house surrounded by Lydia's sisters and parents while indoors Mary practices her piano and Kitty is busy decorating a straw bonnet with ribbon until she stops looks wearily at the bonnet and tosses it away Later Lizzie and Jane are taking a turn in the gardens with the bright sun beating down on them Lizzie now in her room and in her nightgown sits in front of the mirror gazes sadly at her reflection and then leans forward to blow out the candle Mrs Bennet is lying back on a chaise lounge in her room fanning herself and ordering the servants about while Mr Bennet sits peacefully by the fire in the parlor reading a book and sipping a glass of wine Inside the house shutters are opened and smoke pours out of the chimney as the fires are lit while a procession of servants troop inside carrying baskets of food and provisions It is a bright sunny day when Mrs Phillips comes to visit her sister Mrs Bennet at Longbourn and a horse and cart filled with trunks pulls up at Netherfield Lizzie looks at her sister while Mary is at the piano and as Mrs Bennet scurries over to the window Jane tries to hide her excitement Mr Bingley is out shooting and they are in the kitchen hanging up bunches of herbs Jane and Lizzie look nervous as the two gentlemen enter and bow Lizzie breathes deeply as Mrs Bennet checks her reflection in the mirror swiftly taking a seat as the housekeeper shows their guests in Mr Darcy continues looking out the window as Lizzie glares at her mother with embarrassment Everyone takes their seats except Mr Darcy who strolls over to the window and smiles at Jane At Netherfield Mr Bingley and Mr Darcy emerge from the front door and astonished Mr Bingley watches as Mr Darcy climbs into his carriage The two gentlemen are now on their horses riding away from Longbourn while Jane and Lizzie take a stroll in the gardens and continue on their walk with Jane looking somewhat sheepish She bursts into Lizzie's room and afterward an awkwardlooking Mr Bingley is sitting opposite Lizzie Kitty and Jane in the parlor As the carriage pulls away Mr Bingley immediately looks around for the nearest servant and then he is on horseback trotting through a shady avenue of trees on his way to Longbourn"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Lizzie looks at her sister while Mary is at the piano and as Mrs Bennet scurries over to the window Jane tries to hide her excitement Lizzie breathes deeply as Mrs Bennet checks her reflection in the mirror swiftly taking a seat as the housekeeper shows their guests in Jane and Lizzie look nervous as the two gentlemen enter and bow Everyone takes their seats except Mr Darcy who strolls over to the window and smiles at Jane Mr Darcy continues looking out the window as Lizzie glares at her mother with embarrassment The two gentlemen are now on their horses riding away from Longbourn while Jane and Lizzie take a stroll in the gardens and continue on their walk with Jane looking somewhat sheepish At Netherfield Mr Bingley and Mr Darcy emerge from the front door and astonished Mr Bingley watches as Mr Darcy climbs into his carriage As the carriage pulls away Mr Bingley immediately looks around for the nearest servant and then he is on horseback trotting through a shady avenue of trees on his way to Longbourn She bursts into Lizzie's room and afterward an awkwardlooking Mr Bingley is sitting opposite Lizzie Kitty and Jane in the parlor An empty carriage arrives at Longbourn and as it pulls to a halt the footman opens the door allowing the Wickhams to emerge from the house surrounded by Lydia's sisters and parents He ushers Lydia into the carriage which then pulls away as Lydia leans out of the window to wave a cheery goodbye to her family Later Lizzie and Jane are taking a turn in the gardens with the bright sun beating down on them while indoors Mary practices her piano and Kitty is busy decorating a straw bonnet with ribbon until she stops looks wearily at the bonnet and tosses it away Mrs Bennet is lying back on a chaise lounge in her room fanning herself and ordering the servants about while Mr Bennet sits peacefully by the fire in the parlor reading a book and sipping a glass of wine Lizzie now in her room and in her nightgown sits in front of the mirror gazes sadly at her reflection and then leans forward to blow out the candle It is a bright sunny day when Mrs Phillips comes to visit her sister Mrs Bennet at Longbourn and a horse and cart filled with trunks pulls up at Netherfield Inside the house shutters are opened and smoke pours out of the chimney as the fires are lit while a procession of servants troop inside carrying baskets of food and provisions Mr Bingley is out shooting and they are in the kitchen hanging up bunches of herbs"
        }
      ]
    }
  ]
}