{
  "ground_truth": "At school, young women walk with books balanced on their heads, lead to dance, and circle the hall in pairs. Later, they use whisks in the cookery class. Heavy snow is falling as a teenage girl with long dark hair walks down a suburban street in school uniform. Girls play hula hoop in the playground, breathe on a cold window, make foot shapes in condensation, and play lacrosse. Inside, the girls daydream and doze in class, while one girl scratches the back of her ankle with her other foot, and a graphic paper plane flies into a bin. The girls continue to daydream and look bored. At home, her father sips his juice. Jenny attends orchestra practice, where a young boy next to her on violin stares at her, and she waves to an older fresh-faced lad in the violin section. The youngsters tease, and Jenny sighs in frustration. Jenny and the violinist exchange glances as they play. Later, Jenny frowns at the sky as she leaves orchestra practice, stands getting soaked at the bus stop, and a car speeds past, nearly hitting a woman with a pram and a young boy. The car pulls over beside Jenny, and she avoids eye-contact with the handsome driver who gets out, runs around to put the cello in the back seat, and gets back behind the wheel. He drives beside her at walking pace, and she hops into the passenger seat. David changes gear, and they arrive on Jenny's tree-lined street. A large black car overtakes them, and David nods, giving a tight smile. Jenny smiles and gets out of the car. Lying on the floor of her room, Jenny sings along with the record which spins on a small player on the floor. She winces as Graham flounders, resorting to his tea. On another day, Jenny finds a card in a large bouquet of flowers; her father frowns, while her mother smirks as Jenny strides off on the garden path. David crosses the road in front of them. Jenny agonizes, but they shake hands, and she heads back to her friends. They sit awkwardly in the living room, where Jack studies David, who gallantly kisses Marjorie's hand. David and Jenny run through the London rain, up stone steps to the concert venue where men and women pair up and go in. Jenny admires glamorous blonde Helen and touches her fur stole as the pair walk off together, with Helen tapping Jenny playfully on the shoulder. Jenny and David listen with rapt attention to the concert, while Helen looks unimpressed and sleepy, and Danny concentrates serenely. Jenny smiles to herself as she listens. Later, everyone files out of the concert hall, and they walk to the nightclub, where a platinum blonde singer fronts the band.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "At academy, youthful women stroll with volumes balanced on their heads, lead to prance, and circle the gallery in duos. Subsequently, they employ whisks in the culinary class. Dense snow is descending as a teenage girl with long dark hair strides down a suburban avenue in school attire. Girls play hula hoop in the recreation area, exhale on a chilly pane, create foot shapes in condensation, and play lacrosse. Inside, the girls fantasize and slumber in class, while one girl scratches the back of her ankle with her other foot, and a graphic paper plane flies into a bin. The girls persist to daydream and look bored. At home, her father sips his juice. Jenny attends symphony practice, where a young boy adjacent to her on violin gazes at her, and she waves to an older fresh-faced lad in the violin section. The youngsters taunt, and Jenny sighs in exasperation. Jenny and the violinist swap glances as they perform. Later, Jenny frowns at the sky as she departs orchestra practice, stands getting drenched at the bus stop, and a vehicle speeds past, nearly striking a woman with a pram and a young boy. The car pulls over beside Jenny, and she averts eye-contact with the charismatic driver who exits, runs around to place the cello in the rear seat, and gets back behind the wheel. He drives beside her at strolling pace, and she hops into the passenger seat. David adjusts gear, and they arrive on Jenny's tree-lined street. A large black vehicle overtakes them, and David nods, giving a tight grin. Jenny smiles and gets out of the car. Lying on the floor of her chamber, Jenny chants along with the record which spins on a small player on the floor. She winces as Graham flounders, resorting to his tea. On another day, Jenny discovers a card in a large bouquet of blooms; her father frowns, while her mother smirks as Jenny strides off on the garden path. David crosses the road in front of them. Jenny agonizes, but they shake hands, and she heads back to her companions. They sit awkwardly in the living room, where Jack studies David, who gallantly kisses Marjorie's hand. David and Jenny run through the London rain, up stone steps to the recital venue where men and women pair up and go in. Jenny admires glamorous blonde Helen and touches her fur shawl as the pair wander off together, with Helen tapping Jenny playfully on the shoulder. Jenny and David listen with rapt attention to the concert, while Helen looks unimpressed and drowsy, and Danny concentrates serenely. Jenny smiles to herself as she listens. Later, everyone files out of the concert hall, and they walk to the nightclub, where a platinum blonde vocalist fronts the ensemble."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "At school, books are balanced on their heads by young women, who are led to dance and circle the hall in pairs. Later, whisks are used by them in the cookery class. Heavy snow falls as a teenage girl with long dark hair is walked down a suburban street in school uniform. Hula hoops are played by girls in the playground, a cold window is breathed on, foot shapes are made in condensation, and lacrosse is played. Inside, daydreams and dozing are done by the girls in class, while one girl’s ankle is scratched at the back with her other foot, and a graphic paper plane is flown into a bin. Daydreams continue to be had by the girls, who look bored. At home, juice is sipped by her father. Orchestra practice is attended by Jenny, where a young boy next to her on violin stares at her, and she is waved at by an older fresh-faced lad in the violin section. The youngsters are teased, and frustration is sighed in by Jenny. Glances are exchanged by Jenny and the violinist as they play. Later, the sky is frowned at by Jenny as she leaves orchestra practice, she stands getting soaked at the bus stop, and a woman with a pram and a young boy are nearly hit by a car that speeds past. Beside Jenny, the car is pulled over, and eye-contact is avoided by her with the handsome driver who gets out, runs around to put the cello in the back seat, and gets back behind the wheel. The car is driven beside her at walking pace, and she hops into the passenger seat. Gear is changed by David, and Jenny's tree-lined street is arrived at by them. A large black car is overtaken by them, and David gives a tight smile, nodding. A smile is given by Jenny as she gets out of the car. The floor of her room is laid on by Jenny, who sings along with the record spinning on a small player on the floor. A wince is made by her as Graham flounders, resorting to his tea. On another day, a card is found by Jenny in a large bouquet of flowers; her father frowns, while her mother smirks as Jenny strides off on the garden path. The road in front of them is crossed by David. Agonizing is done by Jenny, but hands are shaken, and she heads back to her friends. Awkward sitting is done by them in the living room, where David is studied by Jack, who gallantly kisses Marjorie's hand. The London rain is run through by David and Jenny, up stone steps to the concert venue where men and women pair up and go in. Glamorous blonde Helen is admired by Jenny, who touches her fur stole as the pair walk off together, with Jenny being tapped playfully on the shoulder by Helen. With rapt attention, the concert is listened to by Jenny and David, while Helen looks unimpressed and sleepy, and serene concentration is shown by Danny. A smile is given by Jenny to herself as she listens. Later, the concert hall is filed out of by everyone, and the nightclub is walked to by them, where a platinum blonde singer fronts the band."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "At school, young women walk with books on their heads, lead to dance, and circle the hall in pairs, then use whisks in cookery class. A teenage girl with long dark hair walks down a snowy suburban street in her school uniform. Girls play hula hoop, make foot shapes in window condensation, and play lacrosse. Inside, they daydream and doze in class; one scratches her ankle, and a paper plane lands in a bin. At home, Jenny's father sips juice. At orchestra, a boy on violin stares at Jenny, who waves to another lad. They tease, and Jenny sighs. She frowns leaving practice, stands at a bus stop, and a car nearly hits a woman with a pram. A car pulls over beside Jenny; she avoids eye contact with the handsome driver, who puts a cello in the back seat. He drives beside her, she hops in, and they arrive on Jenny’s street, where a large car overtakes them. Jenny gets out smiling. In her room, Jenny sings along to a record. She winces as Graham flounders. Another day, Jenny finds a card in flowers; her mother smirks while her father frowns. David crosses the road in front of them. Jenny agonizes but shakes hands and returns to her friends. They sit awkwardly in the living room, where Jack studies David, who kisses Marjorie's hand gallantly. Jenny and David run through London rain to a concert venue. She admires Helen's fur stole, and Helen taps her playfully. Jenny and David listen attentively to the concert, while Helen appears sleepy and Danny serene. Jenny smiles as she listens. Later, they exit the concert hall and head to a nightclub, where a platinum blonde singer fronts the band."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "At school, girls balance books on their heads, lead to dance, and circle the hall in pairs. They whisk in cookery class. Amid heavy snow, a teenage girl walks in uniform down a suburban street. Girls play hula hoop, breathe on cold windows, and play lacrosse. Daydreaming and dozing inside, one girl scratches her ankle, and a paper plane flies into a bin. Later, Jenny plays at orchestra practice, waves to a lad, and a boy stares at her. Upset by teasing, she exchanges glances with a violinist. Afterward, Jenny frowns at the sky, stands soaked at a bus stop, and a speeding car nearly hits a woman and boy. The car stops beside Jenny; she avoids eye contact with the driver, who loads a cello and drives at her pace until she enters. David drives to Jenny's street, where a black car overtakes them. Jenny exits, smiling, and sings along with a record in her room. Later, Jenny receives flowers, her father frowns, and her mother smirks. David crosses before them; Jenny agonizes but shakes his hand, then joins her friends awkwardly in a living room. They go to a concert in the rain, where Jenny admires Helen and her fur stole. Jenny and David listen attentively; Helen looks sleepy, and Danny is serene. Jenny smiles as she listens. Afterward, they leave for a nightclub, where a platinum blonde singer fronts the band."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Within the vibrant and bustling atmosphere of the school, young women can be seen gracefully walking with books expertly balanced atop their heads. They are guided towards dancing and begin to form circles, moving elegantly around the hall in synchronized pairs. Later in the day, they transition into the cookery class, where they skillfully wield whisks. Meanwhile, outside, snow falls heavily as a teenage girl with long, dark hair makes her way down a quiet suburban street, dressed neatly in her school uniform. In the playground, girls energetically play with hula hoops, breathe on the cold window panes, create shapes with their feet in the condensation, and engage in spirited games of lacrosse.\n\nInside the classroom, the girls drift into daydreams, some even dozing off, while one girl reaches down to scratch the back of her ankle with the opposite foot. A graphic paper plane makes a smooth flight into the bin, and yet, the girls remain lost in their daydreams, appearing visibly bored. At home, her father sips thoughtfully on his juice. Jenny then attends orchestra practice, where a young boy seated next to her, also playing the violin, can't help but stare at her, while she waves warmly to an older, fresh-faced boy in the violin section. The youngsters are in a teasing mood, and Jenny sighs with a hint of frustration. As they play, Jenny and the violinist exchange meaningful glances.\n\nLater, Jenny frowns at the overcast sky while leaving the orchestra practice, standing at the bus stop as rain begins to drench her. A car zooms by, dangerously close to hitting a woman with a pram and a young boy. The car then pulls over beside Jenny, and she deliberately avoids making eye-contact with the attractive driver who quickly steps out, runs to place the cello in the back seat, and returns to the driver's seat. He drives slowly beside her as she walks, eventually inviting her into the passenger seat. David changes gears smoothly as they travel down Jenny's tree-lined street. A large, imposing black car overtakes them, prompting David to nod with a tight, controlled smile. Jenny returns the smile and gets out of the car, making her way to her room where she lies on the floor, singing along with the record spinning on the small player placed on the floor. She winces at moments when Graham struggles, turning back to his tea in defeat.\n\nOn another day, Jenny discovers a card tucked within a large bouquet of flowers. Her father frowns in concern while her mother smirks knowingly as Jenny confidently strides down the garden path. David crosses the road ahead of them. Despite her agonizing thoughts, Jenny and David shake hands before she returns to her friends. They all sit somewhat awkwardly in the living room, where Jack observes David, who gallantly kisses Marjorie's hand with charm. Under the pouring rain of London, David and Jenny run through the city streets, ascending stone steps to reach the concert venue where impeccably dressed men and women pair up, eagerly entering inside. Jenny admires the glamorous blonde Helen and reaches out to touch her luxurious fur stole. As they walk off together, Helen playfully taps Jenny on the shoulder. \n\nAt the concert, Jenny and David listen with rapt attention, both completely absorbed in the music, while Helen seems unimpressed and sleepy. Meanwhile, Danny remains serenely focused. Jenny finds herself smiling privately as she enjoys the performance. Later, as the concert comes to an end, everyone files out of the grand hall, making their way to the lively nightclub, where a striking platinum blonde singer takes center stage to lead the band with her powerful voice."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In the lively and bustling atmosphere that envelops the school, young women can be observed gracefully traversing the corridors, expertly balancing an array of books atop their heads with remarkable poise. They are gently guided towards their dancing class, where they begin to form graceful circles, moving elegantly and in perfect harmony with one another around the spacious hall in synchronized pairs. As the day progresses, they transition seamlessly into the cookery class, where they skillfully wield whisks with practiced hands. Meanwhile, outside, snow is descending heavily from the sky as a teenage girl with long, dark hair makes her way down a quiet suburban street, dressed neatly and smartly in her school uniform. In the playground, girls are filled with uncontained energy as they play with hula hoops, breathe upon the cold window panes, create intricate shapes with their feet in the condensation, and engage in spirited, lively games of lacrosse.\n\nInside the classroom, the girls drift off into their own daydreams, with some of them even dozing off, while one girl reaches down to scratch the back of her ankle using the opposite foot. A graphic paper plane takes a smooth and precise flight into the waiting bin, and yet, the girls remain lost in their daydreams, visibly appearing bored and disinterested. At home, her father sits thoughtfully and sips on his juice. Jenny then attends orchestra practice, where a young boy seated next to her, also playing the violin, cannot help but stare at her, and she waves warmly to an older, fresh-faced boy in the violin section. The youngsters are clearly in a teasing mood, and Jenny releases a sigh tinged with a hint of frustration. As they continue to play, Jenny and the young violinist exchange meaningful glances across the room.\n\nLater, as Jenny is leaving the orchestra practice, she frowns at the gloomy and overcast sky while standing at the bus stop, rain beginning to drench her as it falls steadily. A car suddenly zooms by, coming dangerously close to hitting a woman with a pram and a young boy accompanying her. This car then pulls over beside Jenny, and she deliberately avoids making any kind of eye contact with the attractive driver who swiftly steps out, runs to place the cello in the back seat, and returns hastily to the driver's seat. He proceeds to drive slowly beside her as she walks, eventually inviting her with an air of casual ease into the passenger seat. David changes gears with a smooth, practiced motion as they travel down Jenny's tree-lined street. A large, imposing black car overtakes them, prompting David to nod with a tight, controlled smile. Jenny returns the smile gently and gets out of the car, making her way to her room where she lies comfortably on the floor, singing along with the record spinning on a small player placed strategically nearby. She winces at certain moments when Graham struggles, turning back to his tea in a moment of defeat.\n\nOn another occasion, Jenny discovers a card tucked discreetly within a large bouquet of flowers. Her father observes the scene with a frown of concern, while her mother smirks knowingly as Jenny confidently strides down the garden path. David crosses the road ahead of them. Despite her swirling, agonizing thoughts, Jenny and David shake hands firmly before she returns to join her friends. They all sit somewhat awkwardly together in the living room, where Jack observes David, who gallantly kisses Marjorie's hand with undeniable charm. Under the relentless pouring rain of London, David and Jenny run energetically through the city streets, climbing the stone steps to reach the grand concert venue, where impeccably dressed men and women pair up eagerly, entering inside with anticipation. Jenny admires the glamorous blonde Helen and reaches out, unable to resist, to touch her luxurious, elegant fur stole. As they walk off together, Helen playfully taps Jenny on the shoulder with a lighthearted gesture.\n\nDuring the concert, Jenny and David listen intently with rapt attention, both becoming completely absorbed in the flowing music, while Helen seems unimpressed and slightly sleepy. Meanwhile, Danny remains serenely focused, seemingly lost in his own world. Jenny finds herself smiling privately, thoroughly enjoying the performance. Later, as the concert comes to a captivating end, everyone files out of the grand hall, making their way to the lively, vibrant nightclub, where a striking platinum blonde singer takes center stage to lead the band with her powerful, commanding voice."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "At school, young women make their way across the hallway, each one balancing a stack of books gracefully on their heads, focusing intently to maintain the delicate equilibrium. As the instructor directs them, they shift seamlessly into a dance, moving in practiced synchrony. The girls form pairs and begin to circle the hall, their steps precise and rhythmic. Later, they transition to the cookery class, where each girl picks up a whisk, engaging in a methodical back-and-forth whipping motion as they prepare ingredients. Outside, heavy snowflakes cascade from the sky, blanketing the suburban street as a teenage girl with long dark hair, clad in her school uniform, trudges steadily down the path. In the playground, laughter fills the air as the girls play with hula hoops, their bodies swaying rhythmically to keep the hoops spinning. They pause to breathe on a cold window, watching the foggy patterns form, and then press their feet against the glass, leaving faint outlines in the condensation. On the field, they energetically wield lacrosse sticks, chasing after the ball with fervor. Inside the classroom, the girls drift into daydreams, some even succumbing to brief dozes, while one girl absentmindedly scratches the back of her ankle with the other foot. A graphic paper plane, soaring across the room, finds its way into a bin with a final swoop. The classroom atmosphere continues to be one of lethargy, with the girls appearing bored and disengaged. Meanwhile, at home, her father lifts his glass to his lips, taking a measured sip of his juice. Jenny makes her way to orchestra practice, where the melodic strains of instruments fill the air. Seated next to her, a young boy with a violin can't help but stare at her, and she responds with a casual wave to an older fresh-faced boy in the violin section. The youngsters exchange teasing remarks, eliciting a sigh of frustration from Jenny. During the practice, Jenny and the violinist lock eyes, a silent conversation unfolding between them as they play their instruments with precision. After practice, Jenny exits the building, frowning slightly as she glances up at the sky, feeling the raindrops begin to fall. She stands at the bus stop, getting increasingly soaked by the downpour, when suddenly a car speeds by, narrowly avoiding a woman pushing a pram with a young boy beside her. The car pulls over next to Jenny, and she deliberately avoids making eye contact with the handsome driver who emerges, quickly circles the vehicle to place the cello in the back seat, and then slips behind the wheel again. He matches her pace, driving beside her at a slow crawl, and she eventually hops into the passenger seat. David shifts gears smoothly as they make their way to Jenny's street, which is lined with trees swaying in the breeze. A large black car zooms past them, and David responds with a nod and a tight smile. Jenny returns the smile before stepping out of the car. In her room, she sprawls out on the floor, singing softly along with the record spinning on a small player, her voice mingling with the music. She grimaces slightly, watching as Graham struggles and then finally turns to his tea for comfort. On another occasion, Jenny discovers a card nestled among a large bouquet of flowers; her father's brow furrows in disapproval, while her mother merely smirks, observing as Jenny strides purposefully down the garden path. David makes his way across the road in front of them. Jenny wrestles with her thoughts momentarily, but they eventually exchange a handshake, and she returns to her friend's company. Later, they find themselves sitting stiffly in the living room, where Jack scrutinizes David intently, while David bestows a gallant kiss on Marjorie's hand. Hand in hand, David and Jenny race through the London rain, their feet splashing against the wet pavement, as they ascend the stone steps leading to the concert venue. Inside, men and women partner up and proceed inside. Jenny gazes admiringly at the glamorous blonde Helen, reaching out to lightly touch her fur stole, and Helen, in turn, playfully taps Jenny's shoulder as they walk off together. As the concert unfolds, Jenny and David listen with rapt attention, utterly absorbed by the music, while Helen appears unimpressed and slightly drowsy, and Danny sits serenely, deeply focused. Jenny can't help but smile to herself as she listens intently. Once the concert concludes, the crowd files out of the concert hall, and they make their way to the nightclub, where a platinum blonde singer commands the stage, fronting the band with vivacious energy."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "At school, young women practice balance and coordination by walking with books on their heads and dancing in pairs, later transitioning to cookery class where they use whisks. Amid falling snow, a teenage girl in school uniform navigates a suburban street. In the playground, girls enjoy hula hooping, engage with the cold window by making footprints in condensation, and play lacrosse. Inside, they daydream and doze, clearly uninterested, as one girl scratches her ankle and a graphic paper plane lands in the bin. Meanwhile, Jenny's father sips juice at home. At orchestra practice, Jenny exchanges glances with a young violinist and waves to an older lad, feeling teased and frustrated by the youngsters. As Jenny leaves, she frowns at the sky while waiting at the bus stop, watching a car nearly collide with a woman and child. The same car stops beside her; she avoids eye contact with the driver, who loads the cello and offers her a ride. David drives alongside her slowly, and once inside, they arrive at her street where another car overtakes them. Jenny exits, smiling, as David gives a tight-lipped nod. Later, in her room, Jenny sings along to a record, wincing when Graham struggles, and resorts to sipping tea. On another day, Jenny discovers a card in a bouquet, her father frowns while her mother smirks as she heads off purposefully, encountering David who crosses the road before they part amicably. In the living room, Jenny's friends sit awkwardly as Jack scrutinizes David, who gallantly greets Marjorie, then he and Jenny dash through London's rain to a concert venue. There, Jenny admires the glamorous Helen before they both enter the venue, sharing a playful moment. Jenny and David listen attentively to the concert, while Helen appears unimpressed and sleepy, with Danny serenely concentrating beside her. Jenny, lost in her thoughts, smiles to herself. Afterwards, they leave the concert hall and walk to a nightclub where a platinum blonde singer leads the band."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "At school, young women, adhering to a traditional form of posture training, walk with books balanced on their heads, lead to dance in a manner reminiscent of 19th-century European balls, and circle the hall in pairs. Later, in a cookery class that emphasizes traditional culinary skills, they use whisks to master basic baking techniques. Heavy snow, an unusual occurrence this early in the season, is falling as a teenage girl with long dark hair walks down a quiet suburban street in her neatly pressed school uniform. Outside, the girls play hula hoop in the playground, a popular activity that rose to prominence in the 1950s, breathe on a cold window to draw playful designs, make foot shapes in condensation, and practice playing lacrosse, a sport of Native American origin that gained popularity in English schools. Inside, the girls daydream, perhaps imagining themselves in far-off places, and doze in class, while one girl, feeling restless, scratches the back of her ankle with her other foot, and a graphic paper plane, expertly folded by a bored student, flies into a bin. The girls continue to daydream and look bored, their minds drifting to anything but the lesson at hand. At home, in a moment of routine comfort, her father sips his freshly squeezed juice. Jenny attends orchestra practice, a commitment that hones her musical skills, where a young boy next to her on violin, perhaps a first-time participant, stares at her in admiration, and she waves to an older fresh-faced lad in the violin section, who is known for his talent and easy camaraderie. The youngsters tease, a common occurrence among friends, and Jenny sighs in frustration. Jenny and the violinist exchange glances, a silent conversation, as they play. Later, Jenny frowns at the gray, overcast sky as she leaves orchestra practice, stands getting soaked at the bus stop, and a car speeds past, creating a dangerous near-miss as it nearly hits a woman with a pram and a young boy. The car pulls over beside Jenny, and she avoids eye-contact with the handsome driver, a mysterious figure in town, who gets out, runs around to put the cello in the back seat, and gets back behind the wheel. He drives beside her at walking pace, an unusual gesture in the quiet neighborhood, and she hops into the passenger seat. David, known for his smooth driving, changes gear, and they arrive on Jenny's tree-lined street, a picturesque scene far removed from the city's hustle. A large black car overtakes them, and David nods, giving a tight smile that suggests tension. Jenny smiles and gets out of the car. Lying on the floor of her room, Jenny sings along with the record, a popular hit of the time, which spins on a small player on the floor. She winces as Graham, a new but enthusiastic learner, flounders, resorting to his comforting tea. On another day, Jenny finds a card nestled in a large bouquet of flowers, a romantic gesture that leaves her father frowning, while her mother smirks in understanding as Jenny strides off on the garden path. David, ever punctual, crosses the road in front of them. Jenny agonizes over her feelings, but they shake hands, a gesture of mutual respect, and she heads back to her friends. They sit awkwardly in the living room, a formal setting, where Jack studies David with curiosity, who gallantly kisses Marjorie's hand, a charming gentleman’s move. David and Jenny run through the London rain, up the historic stone steps to the concert venue where men and women, dressed in their finest, pair up and go in. Jenny admires glamorous blonde Helen, whose fashion sense is envied by many, and touches her luxurious fur stole as the pair walk off together, with Helen tapping Jenny playfully on the shoulder. Jenny and David listen with rapt attention to the concert, a well-known event in the city, while Helen looks unimpressed and sleepy, and Danny concentrates serenely, fully absorbed in the music. Jenny smiles to herself as she listens, lost in the melody. Later, everyone files out of the concert hall, animated by the experience, and they walk to the nightclub, a vibrant destination where a platinum blonde singer, noted for her powerful voice, fronts the band."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "At school young women walk with books balanced on their heads lead to dance and circle the hall in pairs. Later they use whisks in the cookery class. Heavy snow is falling as a teenage girl with long dark hair walks down a suburban street in school uniform. Girls play hula hoop in the playground breathe on a cold window make foot shapes in condensation and play lacrosse. Inside the girls daydream and doze in class while one girl scratches the back of her ankle with her other foot and a graphic paper plane flies into a bin. The girls continue to daydream and look bored. At home her father sips his juice. Jenny attends orchestra practice where a young boy next to her on violin stares at her and she waves to an older freshfaced lad in the violin section. The youngsters tease and Jenny sighs in frustration. Jenny and the violinist exchange glances as they play. Later Jenny frowns at the sky as she leaves orchestra practice stands getting soaked at the bus stop and a car speeds past nearly hitting a woman with a pram and a young boy. The car pulls over beside Jenny and she avoids eyecontact with the handsome driver who gets out runs around to put the cello in the back seat and gets back behind the wheel. He drives beside her at walking pace and she hops into the passenger seat. David changes gear and they arrive on Jenny's treelined street. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. A large black car overtakes them and David nods giving a tight smile. Jenny smiles and gets out of the car. Lying on the floor of her room Jenny sings along with the record which spins on a small player on the floor. She winces as Graham flounders resorting to his tea. On another day Jenny finds a card in a large bouquet of flowers. her father frowns while her mother smirks as Jenny strides off on the garden path. David crosses the road in front of them. Jenny agonizes but they shake hands and she heads back to her friends. They sit awkwardly in the living room where Jack studies David who gallantly kisses Marjorie's hand. David and Jenny run through the London rain up stone steps to the concert venue where men and women pair up and go in. Jenny admires glamorous blonde Helen and touches her fur stole as the pair walk off together with Helen tapping Jenny playfully on the shoulder. Jenny and David listen with rapt attention to the concert while Helen looks unimpressed and sleepy and Danny concentrates serenely. Jenny smiles to herself as she listens. Later everyone files out of the concert hall and they walk to the nightclub where a platinum blonde singer fronts the band."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "At school young women walk with books balanced on their heads lead to dance and circle the hall in pairs. Later they use whisks in the cookery class. Heavy snow is falling as a teenage girl with long dark hair walks down a suburban street in school uniform. Girls play hula hoop in the playground breathe on a cold window make foot shapes in condensation and play lacrosse. Inside the girls daydream and doze in class while one girl scratches the back of her ankle with her other foot and a graphic paper plane flies into a bin. The girls continue to daydream and look bored. At home her father sips his juice. Jenny attends orchestra practice where a young boy next to her on violin stares at her and she waves to an older freshfaced lad in the violin section. The youngsters tease and Jenny sighs in frustration. Jenny and the violinist exchange glances as they play. Later Jenny frowns at the sky as she leaves orchestra practice stands getting soaked at the bus stop and a car speeds past nearly hitting a woman with a pram and a young boy. The car pulls over beside Jenny and she avoids eyecontact with the handsome driver who gets out runs around to put the cello in the back seat and gets back behind the wheel. He drives beside her at walking pace and she hops into the passenger seat. David changes gear and they arrive on Jenny's treelined street. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. A large black car overtakes them and David nods giving a tight smile. Jenny smiles and gets out of the car. Lying on the floor of her room Jenny sings along with the record which spins on a small player on the floor. She winces as Graham flounders resorting to his tea. On another day Jenny finds a card in a large bouquet of flowers. her father frowns while her mother smirks as Jenny strides off on the garden path. David crosses the road in front of them. Jenny agonizes but they shake hands and she heads back to her friends. They sit awkwardly in the living room where Jack studies David who gallantly kisses Marjorie's hand. David and Jenny run through the London rain up stone steps to the concert venue where men and women pair up and go in. Jenny admires glamorous blonde Helen and touches her fur stole as the pair walk off together with Helen tapping Jenny playfully on the shoulder. Jenny and David listen with rapt attention to the concert while Helen looks unimpressed and sleepy and Danny concentrates serenely. Jenny smiles to herself as she listens. Later everyone files out of the concert hall and they walk to the nightclub where a platinum blonde singer fronts the band."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "At school young women walk with books balanced on their heads lead to dance and circle the hall in pairs. Later they use whisks in the cookery class. Heavy snow is falling as a teenage girl with long dark hair walks down a suburban street in school uniform. Girls play hula hoop in the playground breathe on a cold window make foot shapes in condensation and play lacrosse. Inside the girls daydream and doze in class while one girl scratches the back of her ankle with her other foot and a graphic paper plane flies into a bin. The girls continue to daydream and look bored. At home her father sips his juice. Jenny agonizes but they shake hands and she heads back to her friends. They sit awkwardly in the living room where Jack studies David who gallantly kisses Marjorie's hand. David and Jenny run through the London rain up stone steps to the concert venue where men and women pair up and go in. Jenny admires glamorous blonde Helen and touches her fur stole as the pair walk off together with Helen tapping Jenny playfully on the shoulder. Jenny and David listen with rapt attention to the concert while Helen looks unimpressed and sleepy and Danny concentrates serenely. Jenny smiles to herself as she listens. Later everyone files out of the concert hall and they walk to the nightclub where a platinum blonde singer fronts the band."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "At school young women walk with books balanced on their heads lead to dance and circle the hall in pairs. Later they use whisks in the cookery class. Heavy snow is falling as a teenage girl with long dark hair walks down a suburban street in school uniform. Jenny and David listen with rapt attention to the concert while Helen looks unimpressed and sleepy and Danny concentrates serenely. Jenny smiles to herself as she listens. Later everyone files out of the concert hall and they walk to the nightclub where a platinum blonde singer fronts the band."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "At the zoo, young penguins glide with balloons tied to their flippers, draw to jump, and tumble around the ice in groups. Later, they wield feathers in the knitting class. Heavy rain is pouring as a teenage boy with short blonde hair skips down a country lane in a karate suit. Dogs play frisbee in the meadow, whistle on a wet fence, leave handprints in frost, and dribble basketballs. Outside, the penguins doodle and nap on benches, while one penguin tickles the tip of its nose with its other flipper, and a wooden kite lands in a barrel. The penguins persist in doodling and appear disinterested. At a café, her uncle pours his soda. Sam joins chess club, where a young girl beside him on cello watches him, and he nods to an older bearded fellow in the cello section. The elders jest, and Sam groans in dismay. Sam and the cellist trade looks as they perform. Later, Sam glances at the ground as he leaves chess club, waits getting frozen at the bakery door, and a bike zips past, barely missing a man with a suitcase and an old lady. The bike pulls up beside Sam, and he avoids eye-contact with the grumpy rider who hops off, jogs around to place the puppy in the sidecar, and gets back on the seat. He pedals alongside him at a crawling pace, and he climbs into the sidecar. Alex shifts stance, and they reach Sam's flower-lined avenue. A small red trike passes them, and Alex waves, offering a polite grin. Sam grins and steps out of the sidecar. Standing in the corner of his study, Sam hums along with the cassette which twirls on a gramophone on the desk. He grimaces as Colin stumbles, sipping on his coffee. On another evening, Sam discovers a brochure in a small stack of newspapers; his uncle scowls, while his aunt chuckles as Sam marches away across the porch. Alex tiptoes across the bridge in front of them. Sam muses, but they exchange hats, and he walks back to his cousins. They lounge comfortably in the dining room, where Ben watches Alex, who politely shakes Miranda's wrist. Alex and Sam jump through the Paris storm, down wooden paths to the theater entrance where cats and dogs split apart and climb in. Sam admires energetic brunette Sarah and adjusts her woolen scarf as the group drift off together, with Sarah nudging Sam gently on the elbow. Sam and Alex engage with intense focus to the orchestration, while Sarah appears disillusioned and drowsy, and Terry immerses contently. Sam grins privately as he absorbs. Later, everybody streams out of the theater, and they hike to the gallery, where a golden-haired artist displays the canvas."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "At school, young girls balance books on their heads, dance, and use whisks in cookery class. Amid heavy snowfall, a teenage girl walks home in uniform. They play hula hoop, make foot shapes in condensation, and play lacrosse. In class, the girls daydream, while one scratches her ankle, and a paper plane flies into a bin. At home, Jenny’s father drinks juice. During orchestra practice, a boy next to her stares, and Jenny exchanges glances with a violinist. Frustrated, she later leaves practice and stands soaked at a bus stop. A car speeds by, nearly hitting a woman and boy. The driver, handsome David, stops and offers Jenny a ride. They drive to her street, where she smiles and exits. Jenny sings along with a record in her room. Another day, Jenny receives flowers; her father frowns, but her mother smirks. Jenny meets David, and after some hesitation, they shake hands. David kisses her mother’s hand gallantly, and they all head to a concert where Jenny admires glamorous Helen. After the concert, they visit a nightclub with a platinum blonde singer, leaving Jenny smiling."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Later everyone files out of the concert hall and they walk to the nightclub where a platinum blonde singer fronts the band Jenny smiles to herself as she listens Jenny and David listen with rapt attention to the concert while Helen looks unimpressed and sleepy and Danny concentrates serenely Jenny admires glamorous blonde Helen and touches her fur stole as the pair walk off together with Helen tapping Jenny playfully on the shoulder David and Jenny run through the London rain up stone steps to the concert venue where men and women pair up and go in They sit awkwardly in the living room where Jack studies David who gallantly kisses Marjorie's hand Jenny agonizes but they shake hands and she heads back to her friends David crosses the road in front of them her father frowns while her mother smirks as Jenny strides off on the garden path On another day Jenny finds a card in a large bouquet of flowers She winces as Graham flounders resorting to his tea Lying on the floor of her room Jenny sings along with the record which spins on a small player on the floor Jenny smiles and gets out of the car A large black car overtakes them and David nods giving a tight smile David changes gear and they arrive on Jenny's treelined street He drives beside her at walking pace and she hops into the passenger seat The car pulls over beside Jenny and she avoids eyecontact with the handsome driver who gets out runs around to put the cello in the back seat and gets back behind the wheel Later Jenny frowns at the sky as she leaves orchestra practice stands getting soaked at the bus stop and a car speeds past nearly hitting a woman with a pram and a young boy Jenny and the violinist exchange glances as they play The youngsters tease and Jenny sighs in frustration Jenny attends orchestra practice where a young boy next to her on violin stares at her and she waves to an older freshfaced lad in the violin section At home her father sips his juice The girls continue to daydream and look bored Inside the girls daydream and doze in class while one girl scratches the back of her ankle with her other foot and a graphic paper plane flies into a bin Girls play hula hoop in the playground breathe on a cold window make foot shapes in condensation and play lacrosse Heavy snow is falling as a teenage girl with long dark hair walks down a suburban street in school uniform Later they use whisks in the cookery class At school young women walk with books balanced on their heads lead to dance and circle the hall in pairs"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Later they use whisks in the cookery class At school young women walk with books balanced on their heads lead to dance and circle the hall in pairs Girls play hula hoop in the playground breathe on a cold window make foot shapes in condensation and play lacrosse Heavy snow is falling as a teenage girl with long dark hair walks down a suburban street in school uniform The girls continue to daydream and look bored Inside the girls daydream and doze in class while one girl scratches the back of her ankle with her other foot and a graphic paper plane flies into a bin Jenny attends orchestra practice where a young boy next to her on violin stares at her and she waves to an older freshfaced lad in the violin section At home her father sips his juice Jenny and the violinist exchange glances as they play The youngsters tease and Jenny sighs in frustration The car pulls over beside Jenny and she avoids eyecontact with the handsome driver who gets out runs around to put the cello in the back seat and gets back behind the wheel Later Jenny frowns at the sky as she leaves orchestra practice stands getting soaked at the bus stop and a car speeds past nearly hitting a woman with a pram and a young boy David changes gear and they arrive on Jenny's treelined street He drives beside her at walking pace and she hops into the passenger seat Jenny smiles and gets out of the car A large black car overtakes them and David nods giving a tight smile She winces as Graham flounders resorting to his tea Lying on the floor of her room Jenny sings along with the record which spins on a small player on the floor her father frowns while her mother smirks as Jenny strides off on the garden path On another day Jenny finds a card in a large bouquet of flowers Jenny agonizes but they shake hands and she heads back to her friends David crosses the road in front of them David and Jenny run through the London rain up stone steps to the concert venue where men and women pair up and go in They sit awkwardly in the living room where Jack studies David who gallantly kisses Marjorie's hand Jenny and David listen with rapt attention to the concert while Helen looks unimpressed and sleepy and Danny concentrates serenely Jenny admires glamorous blonde Helen and touches her fur stole as the pair walk off together with Helen tapping Jenny playfully on the shoulder Later everyone files out of the concert hall and they walk to the nightclub where a platinum blonde singer fronts the band Jenny smiles to herself as she listens"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "A large black car overtakes them and David nods giving a tight smile Jenny smiles and gets out of the car Lying on the floor of her room Jenny sings along with the record which spins on a small player on the floor She winces as Graham flounders resorting to his tea On another day Jenny finds a card in a large bouquet of flowers her father frowns while her mother smirks as Jenny strides off on the garden path David crosses the road in front of them Jenny agonizes but they shake hands and she heads back to her friends They sit awkwardly in the living room where Jack studies David who gallantly kisses Marjorie's hand David and Jenny run through the London rain up stone steps to the concert venue where men and women pair up and go in Jenny admires glamorous blonde Helen and touches her fur stole as the pair walk off together with Helen tapping Jenny playfully on the shoulder Jenny and David listen with rapt attention to the concert while Helen looks unimpressed and sleepy and Danny concentrates serenely Jenny smiles to herself as she listens Later everyone files out of the concert hall and they walk to the nightclub where a platinum blonde singer fronts the band At school young women walk with books balanced on their heads lead to dance and circle the hall in pairs Later they use whisks in the cookery class Heavy snow is falling as a teenage girl with long dark hair walks down a suburban street in school uniform Girls play hula hoop in the playground breathe on a cold window make foot shapes in condensation and play lacrosse Inside the girls daydream and doze in class while one girl scratches the back of her ankle with her other foot and a graphic paper plane flies into a bin The girls continue to daydream and look bored At home her father sips his juice Jenny attends orchestra practice where a young boy next to her on violin stares at her and she waves to an older freshfaced lad in the violin section The youngsters tease and Jenny sighs in frustration Jenny and the violinist exchange glances as they play Later Jenny frowns at the sky as she leaves orchestra practice stands getting soaked at the bus stop and a car speeds past nearly hitting a woman with a pram and a young boy The car pulls over beside Jenny and she avoids eyecontact with the handsome driver who gets out runs around to put the cello in the back seat and gets back behind the wheel He drives beside her at walking pace and she hops into the passenger seat David changes gear and they arrive on Jenny's treelined street"
        }
      ]
    }
  ]
}