{
  "ground_truth": "She looks at him, shifting awkwardly, and David smiles but squirms at her discomfort, indicating that's a yes. Jenny smiles and pulls her nightie off her shoulders, and David heaves a sigh. Embarrassed, Jenny avoids eye contact, then David smiles, stands, and moves to her, pulling her nightie back on. He goes to kiss her but hugs her instead, and her arms remain by her sides until she puts them around him, and they hold one another. Sun shines on the small village as the Bristol pulls up at some old-timbered houses. Jenny stands completely aghast as the men walk away, and she and Helen walk through a cemetery, having slipped a picture in the back of the car. Jenny stops playing ball with some children and hurries over, where the picture, a map, is sitting between Jenny and Helen on the back seat. Jenny eyes him wearily as they later arrive at Danny's place. Jenny takes her bags and strides off, pausing at the cab without even looking at David, then stops angrily in the middle of the road and turns to him. He wanders over, wanting to explain, looks at her imploringly, then grins, and she can't help but grin back. He takes all of her bags, she makes a show of pulling away, but then he takes her hand and twirls her around, and they hug and slow dance in the street. On a colonnaded balcony, Danny holds up two glasses. At night, the Bristol arrives back at Jenny's house, and Jenny sits glumly in the passenger seat while David looks across at her. Wearing a tight smile, she doesn't look at him, but he smiles lovingly at her and looks down. Very slowly, they lean together and kiss, but she pulls away, and they smile, then sit awkwardly. Jenny puts her handbag on the kitchen table and shows it to her father. Marjorie stops her cake baking and goes to look at the book, while Jenny licks cake mixture off the whisk and grins to herself. At school, the girls, in their PE kits, get out for a run, but Jenny and her friends hide behind a tree smoking until the teacher arrives, prompting the girls to file out of the classroom, and Tina sticks her tongue out. Jenny enters the head's wood-paneled office, and the headmistress watches Jenny leave. At home, the dining room is in darkness as Graham has come for tea, and Jenny closes her eyes while Marjorie puts the candle-decked cake down in front of her. Jack switches the lights back on, and Marjorie drops Graham's slice of cake. Jenny unwraps the present and tries to look pleased as she shows Graham, accepting the gift with a tight smile and placing it on top of the other one. Jack gets up to answer the door, and David is laden with presents.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She observes at him, shifting uncomfortably, and David beams but wriggles at her unease, indicating that's a yes. Jenny beams and pulls her nightie off her shoulders, and David exhales a breath. Mortified, Jenny avoids gaze contact, then David beams, stands, and moves to her, pulling her nightie back on. He goes to kiss her but embraces her instead, and her arms remain by her sides until she puts them around him, and they hold one another. Sunlight shines on the small hamlet as the Bristol pulls up at some old-timbered dwellings. Jenny stands completely astonished as the men walk away, and she and Helen walk through a graveyard, having slipped a photograph in the back of the car. Jenny stops playing ball with some youngsters and rushes over, where the photograph, a chart, is resting between Jenny and Helen on the back seat. Jenny eyes him tiredly as they later arrive at Danny's place. Jenny takes her luggage and strides off, pausing at the cab without even glancing at David, then stops angrily in the middle of the road and turns to him. He wanders over, eager to explain, gazes at her beseechingly, then grins, and she can't help but grin back. He takes all of her luggage, she makes a show of pulling away, but then he takes her hand and spins her around, and they embrace and slow dance in the street. On a colonnaded balcony, Danny holds up two glasses. At night, the Bristol arrives back at Jenny's abode, and Jenny sits dejectedly in the passenger seat while David gazes across at her. Wearing a tight smile, she doesn't look at him, but he smiles affectionately at her and looks down. Very slowly, they lean together and kiss, but she pulls away, and they smile, then sit uncomfortably. Jenny puts her handbag on the kitchen table and shows it to her father. Marjorie stops her cake baking and goes to look at the book, while Jenny licks cake mixture off the whisk and grins to herself. At school, the girls, in their PE kits, get out for a run, but Jenny and her friends hide behind a tree smoking until the teacher arrives, prompting the girls to file out of the classroom, and Tina sticks her tongue out. Jenny enters the head's wood-paneled office, and the headmistress watches Jenny leave. At home, the dining room is in darkness as Graham has come for tea, and Jenny closes her eyes while Marjorie puts the candle-adorned cake down in front of her. Jack switches the lights back on, and Marjorie drops Graham's slice of cake. Jenny unwraps the present and tries to look pleased as she shows Graham, accepting the gift with a tight smile and placing it on top of the other one. Jack gets up to answer the door, and David is burdened with presents."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "She is looked at by him, shifting awkwardly, and a smile is given by David, but her discomfort makes him squirm, indicating that's a yes. A smile is given by Jenny and her nightie is pulled off her shoulders by her, and a sigh is heaved by David. Embarrassed, eye contact is avoided by Jenny, then David smiles, stands, and moves to her, her nightie being pulled back on by him. He goes to kiss her but gives her a hug instead, and her arms are kept by her sides until they are put around him, and they hold one another. The small village is shone upon by the sun as the Bristol pulls up at some old-timbered houses. Jenny stands completely aghast as the men walk away, and a walk through a cemetery is taken by her and Helen, having slipped a picture in the back of the car. A game of ball is stopped by Jenny with some children, and over she hurries, where the picture, a map, sits between Jenny and Helen on the back seat. Jenny eyes him wearily as Danny's place is later arrived at by them. Her bags are taken by Jenny and she strides off, the cab being paused at by her without even looking at David, then angrily she stops in the middle of the road and turns to him. He wanders over, wanting to explain, looks at her imploringly, then grins, and a grin is forced back by her. All of her bags are taken by him; she makes a show of pulling away, but then her hand is taken by him, she is twirled around, and they hug and slow dance in the street. On a colonnaded balcony, two glasses are held up by Danny. At night, Jenny's house is arrived at by the Bristol, and a glum Jenny sits in the passenger seat while David looks across at her. Wearing a tight smile, he is not looked at by her, but a loving smile is given to her by him and he looks down. Very slowly, they lean together and kiss, but away she pulls, and a smile is shared, then awkward sitting occurs. Her handbag is put on the kitchen table by Jenny and it is shown to her father. Marjorie stops her cake baking and looks at the book, while the cake mixture is licked off the whisk by Jenny, and she grins to herself. At school, a run is gotten out for by the girls in their PE kits, but Jenny and her friends hide behind a tree smoking until the arrival of the teacher prompts the girls to file out of the classroom, and Tina sticks her tongue out. Jenny enters the head's wood-paneled office, and Jenny is watched leave by the headmistress. At home, darkness envelops the dining room as Graham comes for tea, and Jenny closes her eyes while the candle-decked cake is put down in front of her by Marjorie. The lights are switched back on by Jack, and Graham's slice of cake is dropped by Marjorie. The present is unwrapped by Jenny and an attempt is made to look pleased as she shows Graham, the gift being accepted with a tight smile and it is placed on top of the other one. The door is answered by Jack, and David is laden with presents."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She looks at him awkwardly, and David smiles nervously, confirming her unspoken question. Jenny smiles, removes her nightie’s straps, but David pulls it back on before hugging her; she hesitantly hugs back. The sun shines on the village as the Bristol stops by old-timbered houses. Jenny is shocked as the men walk away; she and Helen stroll through a cemetery after putting a photo in the car. Jenny stops playing with children to retrieve a map from the car seat with Helen. Weary, she arrives at Danny's place, grabs her bags, pauses at the cab, then stops in the street, turns to David. He approaches, smiles imploringly, and she grins back. He takes her bags, twirls her, and they slow dance on the street. Danny offers two glasses on a balcony. At night, back at Jenny's house, she sits glumly in the car. Despite her tight smile, David grins at her lovingly. They lean in to kiss but pull back awkwardly. Jenny shows her father her handbag while Marjorie looks at a book as Jenny licks cake mixture off a whisk. At school, Jenny and friends smoke behind a tree in PE kits until the teacher arrives. Jenny visits the headmistress's office and leaves. At home, the dining room darkens for tea with Graham. Marjorie places a candle-lit cake before Jenny, and Jack turns the lights on as Marjorie drops Graham's slice. Jenny unwraps a present, smiles tightly at Graham, placing it with another gift. Jack answers the door to find David with presents."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Jenny looks at David, feeling awkward. David smiles, indicating agreement. Jenny removes her nightie, and David sighs. Embarrassed, Jenny avoids eye contact, but David helps her cover up again, hugs her, and they embrace. Sunlight bathes the village as the Bristol arrives. Jenny, shocked, sees Helen and a map in the car. Later, at Danny's, Jenny, upset, pauses at the cab without looking at David. He approaches, grins, and she responds similarly. He takes her bags, twirls her around, and they slow dance. On a balcony, Danny holds glasses. At night, the Bristol leaves Jenny’s house. Jenny, looking glum in the passenger seat, is beside David. They awkwardly lean in to kiss but smile instead. At home, Jenny shows her father her handbag and tastes cake mixture, smiling. At school, Jenny and friends hide during PE, smoke, then file out when caught. Jenny visits the headmistress’s office. At home, the dark dining room reveals Graham's arrival. Marjorie presents a cake, and lights illuminate the room. Jenny unwraps a gift from Graham, forcing a smile, placing it with others. Jack answers the door to a gift-laden David."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "She gazes at him with uncertainty, shifting her weight awkwardly from one foot to the other, and in response, David offers a reassuring smile, though he himself squirms slightly, indicating that, indeed, that's a silent affirmation. With a soft smile, Jenny gently pulls her nightie off her shoulders, and David releases a deep sigh. Feeling a wave of embarrassment, Jenny avoids making eye contact with him, and then, seeing her discomfort, David smiles warmly, stands up, and moves closer to her, carefully pulling her nightie back onto her shoulders. He leans in with the intention to kiss her, but instead, he wraps her in an embrace, and initially, her arms hang limply by her sides until she finally places them around him. They hold each other in a tender embrace. Meanwhile, the bright sun shines down on the quaint little village as the Bristol car pulls up to a cluster of charming old-timbered houses. Jenny stands there, completely taken aback as she observes the men walking away, and she joins Helen in walking through a peaceful cemetery, having discreetly slipped a precious photograph into the back of the car. Jenny takes a break from playing ball with some children to hurry over to where the photograph—revealed to be a map—is positioned between Jenny and Helen on the back seat of the car. She casts a weary glance at him as they later arrive at Danny's residence. Jenny collects her bags and strides off purposefully, pausing only briefly at the cab without even offering a glance at David, then abruptly stops in the middle of the road, her anger evident as she turns to confront him. He wanders over, eager to explain himself, looking at her with pleading eyes, then breaks into a grin, and she can't help but grin back at him. He gathers up all of her bags, and she makes a show of reluctance, trying to pull away, but then he takes her hand and gracefully twirls her around, and they wrap each other in a warm embrace, slow dancing together right there in the street. On a colonnaded balcony, Danny raises two glasses high into the air. Later, as night falls, the Bristol pulls back up to Jenny's house, and Jenny sits gloomily in the passenger seat, while David looks at her from across the car. Wearing a tight-lipped smile, she avoids looking directly at him, yet he gazes lovingly at her and directs his eyes downward. Slowly, very slowly, they both lean toward each other and share a gentle kiss, but she pulls away, and they exchange smiles, then sit in a moment of awkward silence. Jenny places her handbag on the kitchen table, proudly presenting it to her father. Marjorie pauses her cake baking to come over and examine the book, while Jenny mischievously licks cake mixture off the whisk and grins to herself with pleasure. At school, the girls, dressed in their PE kits, head out for a run, but Jenny and her friends slyly hide behind a tree, smoking until the teacher eventually arrives, prompting the girls to file out of the classroom, and Tina cheekily sticks her tongue out. Jenny steps into the headmistress's wood-paneled office, and the headmistress watches her leave afterward. Back at home, the dining room is shrouded in darkness as Graham has come over for tea, and Jenny closes her eyes, anticipating the moment when Marjorie places the candle-adorned cake down in front of her. Jack switches the lights back on, and amid the commotion, Marjorie accidentally drops Graham's slice of cake. Jenny unwraps the present with care and attempts to look genuinely pleased as she shows it to Graham, accepting the gift with a tight smile and carefully placing it atop the other one. Jack rises to answer the door, revealing David standing there, arms laden with gifts."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "She looks at David with a look of uncertainty, shifting her weight awkwardly from one foot to the other. In response to her hesitance, David offers a reassuring smile, though he himself squirms slightly, a subtle indication that, indeed, this is a silent affirmation. With a soft and gentle smile, Jenny carefully pulls her nightie off her shoulders, and David responds by releasing a deep sigh. Overwhelmed by a wave of embarrassment, Jenny avoids making any eye contact with him. Sensing her discomfort, David smiles warmly, stands up from where he was sitting, and moves closer to her. With great care, he pulls her nightie back onto her shoulders. He leans in with the intention of kissing her, but instead, he wraps her in a warm and affectionate embrace. Initially, her arms hang limply by her sides, but eventually, she places them around him, allowing them to hold each other in a tender embrace.\n\nMeanwhile, the bright sun casts its cheerful light over the quaint little village as the Bristol car pulls up to a cluster of charming, old-timbered houses. Jenny stands there, completely taken aback as she observes the men walking away. She then joins Helen as they walk through a peaceful cemetery, having discreetly slipped a precious photograph into the back of the car. Jenny, who was taking a break from playing ball with some children, abruptly hurries over to the spot where the photograph—now revealed to be a map—is carefully positioned between Jenny and Helen on the back seat of the car. She casts a weary glance at him as they later arrive at Danny's residence. With determination, Jenny collects her bags and strides off purposefully, pausing only briefly at the cab without even offering a glance at David. She then abruptly stops in the middle of the road, her anger palpable as she turns to confront him. With a look of eagerness to explain himself, he wanders over, looking at her with pleading eyes, then breaks into a grin. Unable to resist, she grins back at him. He gathers up all of her bags, and she makes a show of reluctance, trying to pull away, but then he takes her hand and gracefully twirls her around. Together, they wrap each other in a warm embrace, slow dancing together right there in the middle of the street.\n\nOn a colonnaded balcony, Danny raises two glasses high into the air in celebration. Later on, as the night falls, the Bristol car pulls back up to Jenny's house, and Jenny sits gloomily in the passenger seat, while David looks at her from across the car. Wearing a tight-lipped smile, she avoids looking directly at him, yet he gazes lovingly at her and directs his eyes downward. Slowly, ever so slowly, they both lean toward each other and share a gentle kiss, but she pulls away, and they exchange smiles, then sit in a moment of awkward silence. Jenny places her handbag on the kitchen table, presenting it proudly to her father. Marjorie pauses her cake baking to come over and examine the book, while Jenny mischievously licks cake mixture off the whisk and grins to herself with pleasure. At school, the girls, dressed in their PE kits, head out for a run, but Jenny and her friends slyly hide behind a tree, smoking until the teacher eventually arrives. This prompts the girls to file out of the classroom, and Tina cheekily sticks her tongue out as they do so. Jenny steps into the headmistress's wood-paneled office, and the headmistress watches her leave afterward. Back at home, the dining room is shrouded in darkness as Graham has come over for tea, and Jenny closes her eyes, anticipating the moment when Marjorie places the candle-adorned cake down in front of her. Amid the commotion, Jack switches the lights back on, and Marjorie accidentally drops Graham's slice of cake. Jenny unwraps the present with care, attempting to look genuinely pleased as she shows it to Graham, accepting the gift with a tight smile and carefully placing it atop the other one. Jack rises to answer the door, revealing David standing there, his arms laden with an array of gifts."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She looks at him, shifting her weight from one foot to the other awkwardly, trying to suppress the discomfort she's feeling, and David, noticing her unease, offers a reassuring smile but can't help but squirm slightly himself, indicating an affirmative response to an unspoken question. Jenny, encouraged by this, smiles back at him and gently slides her nightie off her shoulders, allowing it to fall with hesitant grace as David watches, letting out a deep sigh that signifies a mix of emotions. Feeling a rush of embarrassment, Jenny deliberately avoids meeting his gaze, focusing instead on a point in the distance, and in response, David's smile grows warmer as he rises from his seat. He moves towards her with purpose, gently lifting her nightie and repositioning it over her shoulders, covering her with a careful tenderness. He leans in with the intention of kissing her, but at the last moment, he envelops her in a hug instead, his arms wrapping around her in a protective embrace. Her own arms hang loosely by her sides for a moment, uncertain and hesitant, until she finally raises them to encircle him, and together, they hold onto each other with a comforting sense of connection. Meanwhile, outside, the sun bathes the small village in a golden glow as the Bristol vehicle comes to a halt in front of a row of charming, old-timbered houses. Jenny stands, momentarily frozen in astonishment, as the men stroll away. She and Helen then proceed to walk through a serene cemetery after having discreetly placed a picture in the back of the car. The scene shifts, and Jenny is seen playing ball with some children, but she is soon distracted and hurries over to where the picture, now revealed to be a map, lies between her and Helen on the back seat. When they later arrive at Danny's place, Jenny eyes him with a weary gaze, burdened by the weight of emotions and circumstances. She gathers her belongings and strides away purposefully, but as she reaches the cab, she pauses, refusing to acknowledge David. She stops abruptly in the middle of the road, emotion bubbling to the surface, and turns to face him. David, compelled to bridge the gap, approaches her with an eagerness to explain, his eyes pleading for understanding. He manages to break into a grin, and in that moment, Jenny finds herself mirroring his expression with a grin of her own. Taking charge, he gathers all of her bags, and although she initially feigns reluctance by pulling away in a dramatic gesture, he gently takes her hand and twirls her around, drawing her close into a hug. They begin to slow dance right there in the street, swaying gently as if the world around them has ceased to exist. From a distance, on a colonnaded balcony, Danny appears holding up two glasses, a silent observer of the scene unfolding below. Later that night, the Bristol returns Jenny to her house, where she sits in the passenger seat with a glum expression, weighed down by her thoughts, while David, seated beside her, casts affectionate glances her way. Wearing a forced, tight smile, she deliberately avoids eye contact, yet David continues to regard her with loving eyes before lowering his gaze. Slowly and tentatively, they both lean in towards each other and share a soft kiss, but she soon pulls away, leaving them both smiling awkwardly. Back inside, Jenny places her handbag on the kitchen table, opening it to show its contents to her father. In the midst of her cake baking, Marjorie pauses, curious, and approaches to examine the book Jenny reveals, while Jenny herself licks residual cake mixture from the whisk with a satisfied grin. In the world outside, at school, Jenny and her friends, clad in their physical education kits, are supposed to join their classmates for a run. However, they choose instead to hide behind a tree, indulging in a secretive smoking session until the teacher's arrival, which prompts the girls to finally make their way out of the classroom in a mock display of compliance, with Tina defiantly sticking her tongue out. Jenny later makes her way into the headmistress's wood-paneled office, where she faces the watchful eyes of authority before eventually being allowed to leave. At home, the dining room is shrouded in darkness as Graham comes over for tea, and Jenny, momentarily retreating into herself, closes her eyes in anticipation while Marjorie carefully places a candle-adorned cake in front of her. Jack flips the light switch back on, illuminating the room, and in the ensuing commotion, Marjorie accidentally drops Graham's slice of cake. Despite the misstep, Jenny unwraps her present, doing her best to appear pleased, and shows it to Graham, accepting it with a forced, tight smile before placing it atop the other gifts. Just then, Jack rises to answer the door, revealing David, who stands there laden with presents, adding to the growing collection of shared memories and gestures of affection."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Jenny looks at David, feeling awkward, and when he smiles, she takes it as a yes and removes her nightie. David, noticing her discomfort, sighs, helps her put the nightie back on, and they share a tender hug. As the sun shines on the small village, Jenny is surprised when the car arrives at some old-timbered houses. She and Helen discreetly place a picture in the car before heading through a cemetery. After playing ball with children, Jenny joins Helen to examine the map positioned on the back seat. Upon reaching Danny's place, Jenny grabs her bags, pauses near the cab, then stops in the road to confront David. He approaches with a grin, and they share a mutual smile. After taking her bags, David twirls her around, and they embrace in a slow dance on the street. Later, on a colonnaded balcony, Danny holds up two glasses. That night, as they return to Jenny's house, she sits silently beside David. Despite exchanging a loving look and a slow kiss, they end up sitting awkwardly. Inside, Jenny shows her father the contents of her handbag, while Marjorie stops baking to inspect a book, and Jenny enjoys tasting the cake mixture. At school, Jenny and her friends skip running by smoking behind a tree until caught by the teacher, prompting them to leave. Jenny visits the headmistress's office, observed silently by the headmistress. At home, with the dining room dark, Graham arrives for tea. A cake with candles is set before Jenny, who closes her eyes, and Jack turns on the lights, leading to Marjorie dropping Graham's slice. Jenny unwraps Graham's gift, puts on a pleased face, and adds it to a pile of presents. As Jack answers the door, David enters, laden with gifts."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She looks at him, shifting awkwardly, and David smiles but squirms at her discomfort, indicating that's a yes. Jenny smiles and pulls her nightie off her shoulders, and David heaves a sigh. Embarrassed, Jenny avoids eye contact, then David smiles, stands, and moves to her, pulling her nightie back on as a gesture of respect, reflecting the conservative values of his upbringing. He goes to kiss her but hugs her instead, and her arms remain by her sides until she puts them around him, and they hold one another in the warmth of the sun that illuminates the small village known for its traditional architecture. The Bristol, a classic British car renowned for its elegance and rarity, pulls up at some old-timbered houses that date back to the Tudor period. Jenny stands completely aghast as the men walk away, and she and Helen walk through a cemetery, which has been maintained for centuries and is the final resting place of many local historical figures, having slipped a picture in the back of the car. Jenny stops playing ball with some children from the village school and hurries over, where the picture, a map depicting an ancient route, is sitting between Jenny and Helen on the back seat. Jenny eyes him wearily as they later arrive at Danny's place, a popular gathering spot known for its vibrant community events. Jenny takes her bags and strides off, pausing at the cab without even looking at David, then stops angrily in the middle of the road and turns to him. He wanders over, wanting to explain in the same spot where they first met, looks at her imploringly, then grins, and she can't help but grin back. He takes all of her bags, she makes a show of pulling away, but then he takes her hand and twirls her around, a move they'd often practiced during their dance lessons, and they hug and slow dance in the street. On a colonnaded balcony, a feature inspired by classic Greek architecture, Danny holds up two glasses, signaling a celebration. At night, the Bristol arrives back at Jenny's house, a quaint cottage passed down through generations of her family, and Jenny sits glumly in the passenger seat while David looks across at her. Wearing a tight smile, she doesn't look at him, but he smiles lovingly at her and looks down. Very slowly, they lean together and kiss, but she pulls away, and they smile, then sit awkwardly. Jenny puts her handbag on the kitchen table and shows it to her father, who recognizes the bag as a cherished family heirloom. Marjorie stops her cake baking, a time-honored family tradition, and goes to look at the book, while Jenny licks cake mixture off the whisk and grins to herself. At school, the girls, in their PE kits designed for function rather than fashion, get out for a run, but Jenny and her friends hide behind a tree smoking, a rebellious act typical of their teenage years, until the teacher arrives, prompting the girls to file out of the classroom, and Tina sticks her tongue out in defiance. Jenny enters the head's wood-paneled office, which has hosted countless disciplinary meetings over the years, and the headmistress watches Jenny leave. At home, the dining room is in darkness as Graham has come for tea, a customary British social ritual, and Jenny closes her eyes while Marjorie puts the candle-decked cake down in front of her. Jack switches the lights back on, and Marjorie drops Graham's slice of cake in her surprise. Jenny unwraps the present and tries to look pleased as she shows Graham, accepting the gift with a tight smile and placing it on top of the other one. Jack gets up to answer the door, and David is laden with presents, gifts selected with care from their favorite local shop."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Embarrassed Jenny avoids eye contact She looks at him shifting awkwardly and David smiles but squirms at her discomfort indicating that is a yes Jenny eyes him wearily as they later arrive at Danny's place Jenny smiles and pulls her nightie off her shoulders and David heaves a sigh At school the girls in their PE kits get out for a run but Jenny and her friends hide behind a tree smoking until the teacher arrives prompting the girls to file out of the classroom and Tina sticks her tongue out Embarrassed Jenny avoids eye contact then David smiles stands and moves to her pulling her nightie back on He goes to kiss her but hugs her instead and her arms remain by her sides until she puts them around him and they hold one another then David smiles stands and moves to her pulling her nightie back on She looks at him shifting awkwardly and David smiles but squirms at her discomfort indicating that is a yes she makes a show of pulling away but then he takes her hand and twirls her around and they hug and slow dance in the street Sun shines on the small village as the Bristol pulls up at some oldtimbered houses Jenny stands completely aghast as the men walk away and she and Helen walk through a cemetery having slipped a picture in the back of the car Jenny stops playing ball with some children and hurries over where the picture a map is sitting between Jenny and Helen on the back seat Jenny stops playing ball with some children and hurries over where the picture a map is sitting between Jenny and Helen on the back seat Jenny eyes him wearily as they later arrive at Danny's place He goes to kiss her but hugs her instead and her arms remain by her sides until she puts them around him and they hold one another Jenny takes her bags and strides off pausing at the cab without even looking at David then stops angrily in the middle of the road and turns to him Very slowly they lean together and kiss but she pulls away and they smile then sit awkwardly He wanders over wanting to explain looks at her imploringly then grins and she cannot help but grin back On a colonnaded balcony Danny holds up two glasses He takes all of her bags At home the dining room is in darkness as Graham has come for tea and Jenny closes her eyes while Marjorie puts the candledecked cake down in front of her she makes a show of pulling away but then he takes her hand and twirls her around and they hug and slow dance in the street On a colonnaded balcony Danny holds up two glasses At night the Bristol arrives back at Jenny's house and Jenny sits glumly in the passenger seat while David looks across at her Wearing a tight smile she does not look at him but he smiles lovingly at her and looks down Jack switches the lights back on and Marjorie drops Graham's slice of cake Very slowly they lean together and kiss but she pulls away and they smile then sit awkwardly Jenny puts her handbag on the kitchen table and shows it to her father Marjorie stops her cake baking and goes to look at the book while Jenny licks cake mixture off the whisk and grins to herself Jenny enters the head's woodpaneled office and the headmistress watches Jenny unwraps the present and tries to look pleased as she shows Graham accepting the gift with a tight smile and placing it on top of the other one At school the girls in their PE kits get out for a run but Jenny and her friends hide behind a tree smoking until the teacher arrives prompting the girls to file out of the classroom and Tina sticks her tongue out Jenny enters the head's woodpaneled office and the headmistress watches Jenny leave At home the dining room is in darkness as Graham has come for tea and Jenny closes her eyes while Marjorie puts the candledecked cake down in front of her Jack switches the lights back on and Marjorie drops Graham's slice of cake Jenny unwraps the present and tries to look pleased as she shows Graham accepting the gift with a tight smile and placing it on top of the other one Jack gets up to answer the door and David is laden with presents"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "She looks at him shifting awkwardly and David smiles but squirms at her discomfort indicating that is a yes. Jenny smiles and pulls her nightie off her shoulders and David heaves a sigh. Embarrassed Jenny avoids eye contact. then David smiles stands and moves to her pulling her nightie back on. He goes to kiss her but hugs her instead and her arms remain by her sides until she puts them around him and they hold one another. Sun shines on the small village as the Bristol pulls up at some oldtimbered houses. Jenny stands completely aghast as the men walk away and she and Helen walk through a cemetery having slipped a picture in the back of the car. Jenny stops playing ball with some children and hurries over where the picture a map is sitting between Jenny and Helen on the back seat. Jenny eyes him wearily as they later arrive at Danny's place. Jenny takes her bags and strides off pausing at the cab without even looking at. David then stops angrily in the middle of the road and turns to him. He wanders over wanting to explain looks at her imploringly then grins and she cannot help but grin back. He takes all of her bags. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. she makes a show of pulling away but then he takes her hand and twirls her around and they hug and slow dance in the street. On a colonnaded balcony Danny holds up two glasses. At night the Bristol arrives back at Jenny's house and Jenny sits glumly in the passenger seat while David looks across at her. Wearing a tight smile she does not look at him but he smiles lovingly at her and looks down. Very slowly they lean together and kiss but she pulls away and they smile then sit awkwardly. Jenny puts her handbag on the kitchen table and shows it to her father. Marjorie stops her cake baking and goes to look at the book while Jenny licks cake mixture off the whisk and grins to herself. At school the girls in their PE kits get out for a run but Jenny and her friends hide behind a tree smoking until the teacher arrives prompting the girls to file out of the classroom and Tina sticks her tongue out. Jenny enters the head's woodpaneled office and the headmistress watches. Jenny leave. At home the dining room is in darkness as Graham has come for tea and Jenny closes her eyes while Marjorie puts the candledecked cake down in front of her. Jack switches the lights back on and Marjorie drops Graham's slice of cake. Jenny unwraps the present and tries to look pleased as she shows Graham accepting the gift with a tight smile and placing it on top of the other one. Jack gets up to answer the door and David is laden with presents."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "She looks at him shifting awkwardly and David smiles but squirms at her discomfort indicating that is a yes. Jenny smiles and pulls her nightie off her shoulders and David heaves a sigh. Embarrassed Jenny avoids eye contact. then David smiles stands and moves to her pulling her nightie back on. He goes to kiss her but hugs her instead and her arms remain by her sides until she puts them around him and they hold one another. Sun shines on the small village as the Bristol pulls up at some oldtimbered houses. Jenny stands completely aghast as the men walk away and she and Helen walk through a cemetery having slipped a picture in the back of the car. Jenny stops playing ball with some children and hurries over where the picture a map is sitting between Jenny and Helen on the back seat. Jenny eyes him wearily as they later arrive at Danny's place. Jenny takes her bags and strides off pausing at the cab without even looking at. David then stops angrily in the middle of the road and turns to him. He wanders over wanting to explain looks at her imploringly then grins and she cannot help but grin back. He takes all of her bags. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. she makes a show of pulling away but then he takes her hand and twirls her around and they hug and slow dance in the street. On a colonnaded balcony Danny holds up two glasses. At night the Bristol arrives back at Jenny's house and Jenny sits glumly in the passenger seat while David looks across at her. Wearing a tight smile she does not look at him but he smiles lovingly at her and looks down. Very slowly they lean together and kiss but she pulls away and they smile then sit awkwardly. Jenny puts her handbag on the kitchen table and shows it to her father. Marjorie stops her cake baking and goes to look at the book while Jenny licks cake mixture off the whisk and grins to herself. At school the girls in their PE kits get out for a run but Jenny and her friends hide behind a tree smoking until the teacher arrives prompting the girls to file out of the classroom and Tina sticks her tongue out. Jenny enters the head's woodpaneled office and the headmistress watches. Jenny leave. At home the dining room is in darkness as Graham has come for tea and Jenny closes her eyes while Marjorie puts the candledecked cake down in front of her. Jack switches the lights back on and Marjorie drops Graham's slice of cake. Jenny unwraps the present and tries to look pleased as she shows Graham accepting the gift with a tight smile and placing it on top of the other one. Jack gets up to answer the door and David is laden with presents."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "She looks at him shifting awkwardly and David smiles but squirms at her discomfort indicating that is a yes. Jenny smiles and pulls her nightie off her shoulders and David heaves a sigh. Embarrassed Jenny avoids eye contact. then David smiles stands and moves to her pulling her nightie back on. He goes to kiss her but hugs her instead and her arms remain by her sides until she puts them around him and they hold one another. Sun shines on the small village as the Bristol pulls up at some oldtimbered houses. Jenny stands completely aghast as the men walk away and she and Helen walk through a cemetery having slipped a picture in the back of the car. At school the girls in their PE kits get out for a run but Jenny and her friends hide behind a tree smoking until the teacher arrives prompting the girls to file out of the classroom and Tina sticks her tongue out. Jenny enters the head's woodpaneled office and the headmistress watches. Jenny leave. At home the dining room is in darkness as Graham has come for tea and Jenny closes her eyes while Marjorie puts the candledecked cake down in front of her. Jack switches the lights back on and Marjorie drops Graham's slice of cake. Jenny unwraps the present and tries to look pleased as she shows Graham accepting the gift with a tight smile and placing it on top of the other one. Jack gets up to answer the door and David is laden with presents."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "She looks at him shifting awkwardly and David smiles but squirms at her discomfort indicating that is a yes. Jenny smiles and pulls her nightie off her shoulders and David heaves a sigh. Embarrassed Jenny avoids eye contact. Jack switches the lights back on and Marjorie drops Graham's slice of cake. Jenny unwraps the present and tries to look pleased as she shows Graham accepting the gift with a tight smile and placing it on top of the other one. Jack gets up to answer the door and David is laden with presents."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "She looks at him, shifting awkwardly, and the cat smiles but squirms at her discomfort, indicating that's a yes. The dog smiles and pulls her nightie off her shoulders, and the cat heaves a sigh. Embarrassed, the dog avoids eye contact, then the cat smiles, stands, and moves to her, pulling her nightie back on. The cat goes to kiss her but hugs her instead, and her arms remain by her sides until she puts them around him, and they hold one another. Sun shines on the small village as the elephant pulls up at some old-timbered houses. The dog stands completely aghast as the men walk away, and she and the giraffe walk through a cemetery, having slipped a picture in the back of the car. The dog stops playing ball with some children and hurries over, where the picture, a map, is sitting between the dog and the giraffe on the back seat. The dog eyes him wearily as they later arrive at the rabbit's place. The dog takes her bags and strides off, pausing at the cab without even looking at the cat, then stops angrily in the middle of the road and turns to him. The cat wanders over, wanting to explain, looks at her imploringly, then grins, and she can't help but grin back. The cat takes all of her bags, she makes a show of pulling away, but then he takes her hand and twirls her around, and they hug and slow dance in the street. On a colonnaded balcony, the rabbit holds up two glasses. At night, the elephant arrives back at the dog's house, and the dog sits glumly in the passenger seat while the cat looks across at her. Wearing a tight smile, she doesn't look at him, but he smiles lovingly at her and looks down. Very slowly, they lean together and kiss, but she pulls away, and they smile, then sit awkwardly. The dog puts her handbag on the kitchen table and shows it to her father. The parrot stops her cake baking and goes to look at the book, while the dog licks cake mixture off the whisk and grins to herself. At school, the llamas, in their PE kits, get out for a run, but the dog and her friends hide behind a tree smoking until the turtle arrives, prompting the llamas to file out of the classroom, and the penguin sticks her tongue out. The dog enters the head's wood-paneled office, and the owl watches the dog leave. At home, the dining room is in darkness as the fox has come for tea, and the dog closes her eyes while the parrot puts the candle-decked cake down in front of her. The rabbit switches the lights back on, and the parrot drops the fox's slice of cake. The dog unwraps the present and tries to look pleased as she shows the fox, accepting the gift with a tight smile and placing it on top of the other one. The rabbit gets up to answer the door, and the cat is laden with presents."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "She looks at him, shifting awkwardly, and David smiles but squirms at her discomfort, indicating that's a yes. Jenny smiles and pulls her scarf off her shoulders, and David heaves a sigh. Embarrassed, Jenny avoids eye contact, then David smiles, stands, and moves to her, pulling her scarf back on. He goes to kiss her but hugs her instead, and her arms remain by her sides until she puts them around him, and they hold one another. Rain drizzles on the bustling city as the pickup truck pulls up at some brick buildings. Jenny stands completely aghast as the men walk away, and she and Helen walk through a garden, having slipped a painting in the back of the van. Jenny stops playing cards with some children and hurries over, where the painting, a blueprint, is sitting between Jenny and Helen on the back seat. Jenny eyes him wearily as they later arrive at Danny's studio. Jenny takes her luggage and strides off, pausing at the bus without even looking at David, then stops angrily in the middle of the sidewalk and turns to him. He wanders over, wanting to explain, looks at her imploringly, then grins, and she can't help but grin back. He takes all of her luggage, she makes a show of pulling away, but then he takes her hand and twirls her around, and they hug and slow dance in the park. On a terraced patio, Danny holds up two mugs. At night, the pickup truck arrives back at Jenny's apartment, and Jenny sits glumly in the passenger seat while David looks across at her. Wearing a tight smile, she doesn't look at him, but he smiles lovingly at her and looks down. Very slowly, they lean together and kiss, but she pulls away, and they smile, then sit awkwardly. Jenny puts her backpack on the living room table and shows it to her father. Marjorie stops her pie baking and goes to look at the magazine, while Jenny licks dough off the spatula and grins to herself. At school, the girls, in their jerseys, get out for a walk, but Jenny and her friends hide behind a shed playing cards until the teacher arrives, prompting the girls to file out of the hallway, and Tina sticks her tongue out. Jenny enters the head's glass-walled office, and the headmistress watches Jenny leave. At home, the dining room is in darkness as Graham has come for dinner, and Jenny closes her eyes while Marjorie puts the candle-decked pie down in front of her. Jack switches the lights back on, and Marjorie drops Graham's slice of pie. Jenny unwraps the ornament and tries to look pleased as she shows Graham, accepting the gift with a tight smile and placing it on top of the other one. Jack gets up to answer the door, and David is laden with flowers."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "She gazes at him, twitching awkwardly, and David laughs but fidgets at her discomfort, suggesting that's a yes. Jenny beams and tosses her nightie off her shoulders, and David releases a chuckle. Embarrassed, Jenny dodges eye contact, then David grins, rises, and approaches her, wrapping her nightie back on. He intends to kiss her but pats her instead, and her arms dangle by her sides until she lifts them around him, and they embrace one another. Sunlight dances on the small village as the Bristol sidles up to some old-timbered houses. Jenny stands completely stunned as the men stride away, and she and Helen meander through a cemetery, having tucked a picture in the back of the car. Jenny halts skipping ball with some children and dashes over, where the picture, a map, is resting between Jenny and Helen on the back seat. Jenny glances at him cautiously as they later settle at Danny's place. Jenny collects her bags and marches off, lingering at the cab without even glancing at David, then halts frustratedly in the middle of the road and spins to him. He strolls over, wanting to explain, gazes at her imploringly, then chuckles, and she can't help but chuckle back. He gathers all of her bags, she makes a show of tugging away, but then he catches her hand and twirls her around, and they cuddle and sway slowly in the street. On a colonnaded balcony, Danny presents two glasses. At night, the Bristol rolls back at Jenny's house, and Jenny sits gloomily in the passenger seat while David glances across at her. Wearing a tight grin, she doesn't glance at him, but he beams tenderly at her and gazes down. Very slowly, they lean together and embrace, but she recoils, and they grin, then sit uneasily. Jenny places her handbag on the kitchen table and displays it to her father. Marjorie ceases her cake baking and advances to peek at the book, while Jenny samples cake mixture off the whisk and smirks to herself. At school, the girls, in their PE kits, get out for a jog, but Jenny and her friends lurk behind a tree smoking until the teacher appears, urging the girls to parade out of the classroom, and Tina pokes her tongue out. Jenny steps into the head's wood-paneled office, and the headmistress witnesses Jenny exit. At home, the dining room is in darkness as Graham has arrived for tea, and Jenny shuts her eyes while Marjorie sets the candle-decked cake down in front of her. Jack flips the lights back on, and Marjorie spills Graham's slice of cake. Jenny unwraps the present and struggles to look delighted as she shows Graham, receiving the gift with a tight grin and placing it atop the other one. Jack rises to answer the door, and David is burdened with presents."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "She observes the lamp, shifting awkwardly, and the bookshelf smiles but squirms at the lamp's discomfort, indicating that's a yes. The curtain smiles and pulls its lampshade off its shoulders, and the bookshelf heaves a sigh. Embarrassed, the curtain avoids eye contact, then the bookshelf smiles, stands, and moves to it, pulling its lampshade back on. It goes to kiss the curtain but hugs it instead, and the curtain's arms remain by its sides until the curtain puts them around the bookshelf, and they hold one another. Moonlight shines on the large forest as the wagon pulls up at some stone statues. The curtain stands completely aghast as the trees walk away, and it and the stool walk through a garden, having slipped a painting in the back of the truck. The curtain stops juggling plates with some cats and hurries over, where the painting, a blueprint, is sitting between the curtain and the stool on the back seat. The curtain eyes the teapot wearily as they later arrive at the rabbit's house. The curtain takes its hats and strides off, pausing at the train without even looking at the bookshelf, then stops angrily in the middle of the bridge and turns to the bookshelf. It wanders over, wanting to explain, looks at the curtain imploringly, then grins, and the curtain can't help but grin back. The bookshelf takes all of the curtain’s hats, the curtain makes a show of pulling away, but then the bookshelf takes its hand and twirls it around, and they hug and slow dance in the park. On a grassy hill, the rabbit holds up two umbrellas. At night, the wagon arrives back at the curtain's apartment, and the curtain sits glumly in the passenger seat while the bookshelf looks across at it. Wearing a tight smile, it doesn't look at the bookshelf, but the bookshelf smiles lovingly at it and looks down. Very slowly, they lean together and kiss, but the curtain pulls away, and they smile, then sit awkwardly. The curtain puts its folder on the kitchen floor and shows it to the bird. The squirrel stops its cookie decorating and goes to look at the magazine, while the curtain licks frosting off the spoon and grins to itself. At practice, the dogs, in their running shoes, get out for a swim, but the curtain and its siblings hide behind a car playing until the coach arrives, prompting the dogs to file out of the tent, and the apple sticks its tongue out. The curtain enters the coach's glass-paneled office, and the coach watches the curtain leave. At the pond, the patio is in sunlight as the rose has come for dinner, and the curtain closes its eyes while the squirrel puts the candle-decked pie down in front of it. The banana switches the lights back on, and the squirrel drops the rose's slice of pie. The curtain unwraps the painting and tries to look pleased as it shows the rose, accepting the canvas with a tight smile and placing it on top of the other book. The banana gets up to answer the door, and the bookshelf is laden with sculptures."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "He observes her, fidgeting uncomfortably, and Michael chuckles but flinches at her unease, suggesting that's an affirmative. Susan laughs and slides her coat off her shoulders, and Michael exhales deeply. Ashamed, Susan sidesteps eye contact, then Michael grins, rises, and approaches her, draping her coat back on. He attempts to embrace her but pats her on the back instead, and her arms stay at her sides until she wraps them around him, and they embrace each other. Rain falls on the bustling city as the Mercedes pulls up at some brick-red apartments. Susan stands completely bemused as the women stroll away, and she and Lisa walk through a park, having hidden a brochure in the trunk of the car. Susan stops painting a fence with some teenagers and rushes over, where the brochure, a guide, is sitting between Susan and Lisa on the back seat. Susan scrutinizes him cautiously as they later depart from Tom's place. Susan picks up her suitcases and marches off, pausing at the train without even glancing at Michael, then halts angrily in the middle of the sidewalk and turns to him. He meanders over, eager to justify himself, gazes at her pleadingly, then smirks, and she can't resist but smirk back. He grabs all of her bags, she pretends to pull away, but then he seizes her hand and spins her around, and they embrace and sway gently in the lane. On a rooftop terrace, Tom lifts two plates. At dusk, the Mercedes arrives back at Susan's apartment, and Susan sits morosely in the passenger seat while Michael glances over at her. Wearing a forced grin, she doesn't glance at him, but he beams lovingly at her and looks away. Quite slowly, they lean together and peck, but she withdraws, and they chuckle, then sit uncomfortably. Susan places her purse on the dining table and displays it to her mother. Elizabeth halts her pie-making and goes to peer at the journal, while Susan tastes pie filling off the spoon and giggles quietly. At the gym, the boys, in their soccer gear, set out for practice, but Susan and her pals hide behind a bench smoking until the coach arrives, prompting the boys to file out of the locker room, and Rachel makes a face. Susan steps into the principal's glass-walled office, and the principal watches Susan exit. At home, the lounge is in shadows as Nathan has come for supper, and Susan closes her eyes while Elizabeth sets the flower-topped pie down in front of her. Alex switches the lamps back on, and Elizabeth spills Nathan's slice of pie. Susan unwraps the card and attempts to appear delighted as she displays it to Nathan, accepting the note with a forced grin and placing it on top of the pile. Alex stands up to greet the guest, and Michael is burdened with notes."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "She observes him, shifting clumsily, and David grins but fidgets at her unease, suggesting that's an affirmation. Jenny grins and tugs her scarf off her shoulders, and David exhales a breath. Embarrassed, Jenny avoids glancing directly, then David grins, rises, and drifts to her, draping her scarf back on. He attempts to embrace her but pats her on the back instead, and her arms remain by her sides until she wraps them around him, and they embrace each other. The stars twinkle over the small hamlet as the sailboat glides past some ancient stone cottages. Jenny stands completely startled as the men cycle away, and she and Helen stroll through a meadow, having tucked a letter in the back of the wagon. Jenny stops skipping rope with some children and rushes over, where the letter, a painting, is nestled between Jenny and Helen on the back bench. Jenny glances at him cautiously as they later arrive at Danny's door. Jenny gathers her boxes and bounds off, pausing at the taxi without even glancing at David, then halts furiously in the middle of the sidewalk and turns to him. He ambles over, wanting to clarify, gazes at her pleadingly, then chuckles, and she can't help but chuckle back. He gathers all of her boxes, she makes a show of pulling aside, but then he takes her hand and spins her around, and they embrace and sway together in the square. On a terraced balcony, Danny raises two teacups. By dusk, the sailboat returns to Jenny's apartment, and Jenny sits gloomily in the driver’s seat while David glances over at her. Wearing a faint grin, she doesn't glance at him, but he grins affectionately at her and looks down. Very slowly, they lean together and nuzzle, but she pulls away, and they grin, then sit uneasily. Jenny places her backpack on the kitchen chair and presents it to her father. Marjorie pauses her pie making and goes to peek at the magazine, while Jenny licks icing off the beater and smirks to herself. At school, the girls, in their PE uniforms, get ready for a jog, but Jenny and her friends duck behind a bush chatting until the coach arrives, prompting the girls to file out of the locker room, and Tina wiggles her fingers. Jenny strides into the head's book-lined office, and the headmistress observes Jenny depart. At home, the living room is in shadows as Graham has arrived for biscuits, and Jenny closes her eyes while Marjorie places the flower-adorned tart down in front of her. Jack flips the switches back on, and Marjorie spills Graham's cup of tea. Jenny unwraps the package and attempts to look delighted as she shows Graham, receiving the item with a slight nod and positioning it on top of the bookshelf. Jack stands up to respond to the knock, and David is loaded with parcels."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "She glances at a table, hopping unsteadily, and Michael frowns but shuffles at the napkin's awkwardness, signaling that's a no. Linda frowns and tosses her necklace off her lamp, and Michael inhales a chuckle. Mortified, Linda dodges direct sunlight, then Michael frowns, kneels, and leaps to her, tossing her necklace back on. He attempts to shake her hand but nods instead, and her eyebrows hang by her ears until she raises them around him, and they gaze at one another. Moonlight drizzles on the large city as the train stations at some new-fangled hotels. Linda sits completely enthralled as the women fly toward, and she and Harold stroll through a marketplace, having nudged a letter in the front of the bicycle. Linda resumes juggling coins with several cats and trots away, where the letter, a globe, is lying beneath Linda and Harold on the front porch. Linda gazes at him calmly as they finally depart for Lucy's café. Linda grabs her shoes and leaps forward, dancing at the horse without ever glancing at Michael, then trots happily in the heart of the field and spins at him. He races near, wishing to chat, nods at her mysteriously, then giggles, and she can't help but giggle back. He grabs all of her shoes, she makes a scene of pushing him aside, but then he grabs her book and spins her around, and they laugh and waltz on the riverbank. On a flowered veranda, Lucy lifts up sixteen hats. By dawn, the train returns back at Linda's apartment, and Linda sits blissfully in the driver’s lounge while Michael hums near her. Wearing a wide frown, she hums near him, but he frowns affectionately at her and hums up. Quite quickly, they stretch apart and wave, but he dodges away, and they frown, then stand excitedly. Linda places her backpack on the dining chair and whispers it to her brother. Gerald pauses his bread slicing and hops to taste the candle, while Linda strokes candle wax off the tray and frowns to herself. At daycare, the boys, in their raincoats, climb in for a nap, but Linda and her cousins wait beneath a table dancing until the guard leaves, prompting the boys to stream into the closet, and Sarah holds her breath. Linda exits the janitor's glass-walled closet, and the caretaker follows Linda in. At daycare, the garden patio is in blazing light as Barry has left for dessert, and Linda opens her arms while Gerald tosses the cardboard-packed pie up over her. Joan dims the lamps back off, and Gerald slides Barry’s piece of pie. Linda investigates the envelope and struggles to look bored as she tells Barry, declining the envelope with a wide frown and hiding it under the couch. Joan sits down to lock the door, and Michael is crowded with balloons."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "David tries to comfort Jenny, pulling her nightie back on and hugging her as they reconcile. As they travel through a sunny village, Jenny is shocked when the men leave, and she and Helen examine a map. Later, Jenny avoids David but eventually can't help smiling back at him when he tries to explain himself. They hug and dance in the street, rekindling their relationship. Danny welcomes them with drinks on a balcony. Returning home, Jenny sits silently with David, finally sharing a kiss before they awkwardly sit together. Jenny then shares a moment with her parents, tasting cake mix and showing her father a book. At school, Jenny and her friends skip running to smoke, getting caught by the teacher. Later, Graham visits her dark dining room, surprising Jenny with a candlelit cake. She tries to seem pleased with his gifts, even as David arrives with more presents."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Jack gets up to answer the door and David is laden with presents Jenny unwraps the present and tries to look pleased as she shows Graham accepting the gift with a tight smile and placing it on top of the other one Jack switches the lights back on and Marjorie drops Graham's slice of cake At home the dining room is in darkness as Graham has come for tea and Jenny closes her eyes while Marjorie puts the candledecked cake down in front of her Jenny leave Jenny enters the head's woodpaneled office and the headmistress watches At school the girls in their PE kits get out for a run but Jenny and her friends hide behind a tree smoking until the teacher arrives prompting the girls to file out of the classroom and Tina sticks her tongue out Marjorie stops her cake baking and goes to look at the book while Jenny licks cake mixture off the whisk and grins to herself Jenny puts her handbag on the kitchen table and shows it to her father Very slowly they lean together and kiss but she pulls away and they smile then sit awkwardly Wearing a tight smile she does not look at him but he smiles lovingly at her and looks down At night the Bristol arrives back at Jenny's house and Jenny sits glumly in the passenger seat while David looks across at her On a colonnaded balcony Danny holds up two glasses she makes a show of pulling away but then he takes her hand and twirls her around and they hug and slow dance in the street He takes all of her bags He wanders over wanting to explain looks at her imploringly then grins and she cannot help but grin back David then stops angrily in the middle of the road and turns to him Jenny takes her bags and strides off pausing at the cab without even looking at Jenny eyes him wearily as they later arrive at Danny's place Jenny stops playing ball with some children and hurries over where the picture a map is sitting between Jenny and Helen on the back seat Jenny stands completely aghast as the men walk away and she and Helen walk through a cemetery having slipped a picture in the back of the car Sun shines on the small village as the Bristol pulls up at some oldtimbered houses He goes to kiss her but hugs her instead and her arms remain by her sides until she puts them around him and they hold one another then David smiles stands and moves to her pulling her nightie back on Embarrassed Jenny avoids eye contact Jenny smiles and pulls her nightie off her shoulders and David heaves a sigh She looks at him shifting awkwardly and David smiles but squirms at her discomfort indicating that is a yes"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Wearing a tight smile she does not look at him but he smiles lovingly at her and looks down He takes all of her bags Jenny takes her bags and strides off pausing at the cab without even looking at Jack gets up to answer the door and David is laden with presents Marjorie stops her cake baking and goes to look at the book while Jenny licks cake mixture off the whisk and grins to herself Jenny stands completely aghast as the men walk away and she and Helen walk through a cemetery having slipped a picture in the back of the car Sun shines on the small village as the Bristol pulls up at some oldtimbered houses David then stops angrily in the middle of the road and turns to him At night the Bristol arrives back at Jenny's house and Jenny sits glumly in the passenger seat while David looks across at her Jenny leave He wanders over wanting to explain looks at her imploringly then grins and she cannot help but grin back Jenny puts her handbag on the kitchen table and shows it to her father Jenny smiles and pulls her nightie off her shoulders and David heaves a sigh On a colonnaded balcony Danny holds up two glasses Jack switches the lights back on and Marjorie drops Graham's slice of cake she makes a show of pulling away but then he takes her hand and twirls her around and they hug and slow dance in the street Embarrassed Jenny avoids eye contact Very slowly they lean together and kiss but she pulls away and they smile then sit awkwardly Jenny unwraps the present and tries to look pleased as she shows Graham accepting the gift with a tight smile and placing it on top of the other one He goes to kiss her but hugs her instead and her arms remain by her sides until she puts them around him and they hold one another Jenny enters the head's woodpaneled office and the headmistress watches Jenny stops playing ball with some children and hurries over where the picture a map is sitting between Jenny and Helen on the back seat Jenny eyes him wearily as they later arrive at Danny's place At home the dining room is in darkness as Graham has come for tea and Jenny closes her eyes while Marjorie puts the candledecked cake down in front of her She looks at him shifting awkwardly and David smiles but squirms at her discomfort indicating that is a yes then David smiles stands and moves to her pulling her nightie back on At school the girls in their PE kits get out for a run but Jenny and her friends hide behind a tree smoking until the teacher arrives prompting the girls to file out of the classroom and Tina sticks her tongue out"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "On a colonnaded balcony Danny holds up two glasses At night the Bristol arrives back at Jenny's house and Jenny sits glumly in the passenger seat while David looks across at her Wearing a tight smile she does not look at him but he smiles lovingly at her and looks down Very slowly they lean together and kiss but she pulls away and they smile then sit awkwardly Jenny puts her handbag on the kitchen table and shows it to her father Marjorie stops her cake baking and goes to look at the book while Jenny licks cake mixture off the whisk and grins to herself At school the girls in their PE kits get out for a run but Jenny and her friends hide behind a tree smoking until the teacher arrives prompting the girls to file out of the classroom and Tina sticks her tongue out Jenny enters the head's woodpaneled office and the headmistress watches Jenny leave At home the dining room is in darkness as Graham has come for tea and Jenny closes her eyes while Marjorie puts the candledecked cake down in front of her Jack switches the lights back on and Marjorie drops Graham's slice of cake Jenny unwraps the present and tries to look pleased as she shows Graham accepting the gift with a tight smile and placing it on top of the other one Jack gets up to answer the door and David is laden with presents She looks at him shifting awkwardly and David smiles but squirms at her discomfort indicating that is a yes Jenny smiles and pulls her nightie off her shoulders and David heaves a sigh Embarrassed Jenny avoids eye contact then David smiles stands and moves to her pulling her nightie back on He goes to kiss her but hugs her instead and her arms remain by her sides until she puts them around him and they hold one another Sun shines on the small village as the Bristol pulls up at some oldtimbered houses Jenny stands completely aghast as the men walk away and she and Helen walk through a cemetery having slipped a picture in the back of the car Jenny stops playing ball with some children and hurries over where the picture a map is sitting between Jenny and Helen on the back seat Jenny eyes him wearily as they later arrive at Danny's place Jenny takes her bags and strides off pausing at the cab without even looking at David then stops angrily in the middle of the road and turns to him He wanders over wanting to explain looks at her imploringly then grins and she cannot help but grin back He takes all of her bags she makes a show of pulling away but then he takes her hand and twirls her around and they hug and slow dance in the street"
        }
      ]
    }
  ]
}