{
  "ground_truth": "At dawn, an orange glow silhouettes two people and a tree. His grandfather grabs his fishing pole as the boy lies wide-eyed on the bottom while a White man in a suit falls face-first into the water. The man floats lifelessly over the boy, his blood staining the water, and then sinks to the bottom. The boy breaks the surface and sees a horse panicking in the water, reaches out, and the horse swims towards him, allowing him to stroke its muzzle. He climbs on the horse's back, urging it out of the water. Wearing only shorts, with his long hair streaming, he rides through a dusty landscape with thinly spread trees and rocky crags, continuing through a settlement of wood buildings and animal pens. Bonfire smoke mixes with the dust in the air, and an animal skull hangs from a dry branch. Spotting an overloaded truck approaching, he dismounts and looks worried, sprinting through the settlement called Faraway Downs. He hides in a water tank as a man tries to grab the horse, peeking through a crack as an elegant woman in a bonnet and long coat strides towards the house. A woman rides a horse, and a car pulls up at a large country house while a man in a bowler hat gets out. She frowns, her blue eyes glittering, and screws up a telegram, later looking out of an airplane window at a port with a moored ship. A red-bearded speaker is sent sprawling, making the rough-looking crew in a bar nervous; Drover downs a drink and up-ends his glass as an Aboriginal man approaches, while the pipe-smoking barman glares. Coolly, the barman closes the sealing doors as Drover is busy with Bull with the red beard. Meanwhile, Sarah marshals her porters, brushing past disdainfully and striding on. Drover is thrown over the bar but comes up swinging, with the brawl in full swing as Sarah approaches the pub. As she walks in, the fight spills out the back. Upon entering the pub, she notices the barman's raised truncheon and an old drunk in the corner. The barman rolls his eyes as she heads for the door, walking out just as Drover hurls Bull into her luggage. They hit each other with the suitcases, one bursts, sending underwear flying. Carney watches with binoculars as she approaches in horror through the brawlers, rubberneckers, and flying undies. Drover breaks a case over his opponent's head, and Bull goes down. Sarah looks appalled at the exhausted Drover as his black friend gestures that she is behind him.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "At sunrise, a tangerine radiance outlines two individuals and a tree. His grandfather clutches his fishing rod as the boy lies wide-eyed on the floor while a White man in a suit plunges face-first into the water. The man drifts lifelessly above the boy, his blood coloring the water, and then descends to the bottom. The boy surfaces and notices a horse panicking in the water, extends his hand, and the horse swims towards him, permitting him to stroke its muzzle. He mounts the horse's back, urging it out of the water. Wearing only shorts, with his long hair trailing, he rides through a dusty terrain with sparsely scattered trees and stony crags, continuing through a settlement of timber buildings and animal enclosures. Bonfire smoke mingles with the dust in the air, and an animal skull hangs from a barren branch. Noticing an overloaded truck arriving, he dismounts and looks worried, sprinting through the settlement called Faraway Downs. He conceals himself in a water tank as a man attempts to seize the horse, peering through a gap as an elegant woman in a bonnet and long coat strides towards the house. A woman rides a horse, and a vehicle pulls up at a large rural house while a man in a bowler hat alights. She frowns, her blue eyes sparkling, and crumples a telegram, afterward gazing out of an airplane window at a harbor with a docked ship. A red-bearded speaker is sent sprawling, making the rough-looking crew in a tavern uneasy; Drover downs a drink and up-ends his glass as an Indigenous man approaches, while the pipe-smoking barkeeper glowers. Coolly, the barkeeper closes the sealing doors as Drover is engaged with Bull with the red beard. Meanwhile, Sarah assembles her porters, brushing past disdainfully and striding on. Drover is hurled over the counter but comes up swinging, with the skirmish in full swing as Sarah approaches the pub. As she enters, the fight spills out the back. Upon entering the tavern, she notices the barkeeper's raised truncheon and an old drunkard in the corner. The barkeeper rolls his eyes as she heads for the door, walking out just as Drover throws Bull into her baggage. They hit each other with the suitcases, one bursts, sending underwear flying. Carney observes with binoculars as she approaches in horror through the combatants, rubberneckers, and flying undergarments. Drover breaks a case over his adversary's head, and Bull goes down. Sarah looks appalled at the exhausted Drover as his dark-skinned friend gestures that she is behind him."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "At dawn, two people and a tree are silhouetted by an orange glow. A fishing pole is grabbed by his grandfather as the boy lies wide-eyed on the bottom while a White man in a suit is falling face-first into the water. The boy watches as the man floats lifelessly over him, his blood stains the water, and then he sinks to the bottom. The surface is broken by the boy and he sees a horse panicking in the water, reaches out, and it swims towards him, allowing its muzzle to be stroked by him. It is climbed on by the boy, who urges it out of the water. Dressed in only shorts, with long hair streaming, through a dusty landscape with thinly spread trees and rocky crags, he rides, continuing through a settlement of wood buildings and animal pens. Dust in the air is mixed with bonfire smoke, and an animal skull is hung from a dry branch. An overloaded truck is spotted approaching, and he dismounts and looks worried, sprinting through the settlement called Faraway Downs. He hides in a water tank as a man tries to grab the horse, peeking through a crack as an elegant woman in a bonnet and long coat strides towards the house. A horse is ridden by a woman, and a large country house is approached by a car while a man in a bowler hat gets out. She frowns, her blue eyes glittering, and screws up a telegram, later looking out of an airplane window at a port with a moored ship. A red-bearded speaker sprawls as he is sent, making the rough-looking crew in a bar nervous; Drover downs a drink and up-ends his glass as an Aboriginal man approaches, while a glare is given by the pipe-smoking barman. The sealing doors are closed coolly by the barman as Bull with the red beard is busied with by Drover. Meanwhile, her porters are marshaled by Sarah, brushing past disdainfully and striding on. Drover is thrown over the bar but comes up swinging, with the brawl in full swing as the pub is approached by Sarah. As she walks in, the fight is spilling out the back. The pub is entered by her, and she notices the barman's raised truncheon and an old drunk in the corner. His eyes are rolled by the barman as she heads for the door, walking out just as Bull is hurled by Drover into her luggage. They hit each other with the suitcases, one bursts, sending underwear flying. With binoculars, Carney watches as she approaches in horror through the brawlers, rubberneckers, and flying undies. A case is broken by Drover over his opponent's head, and Bull goes down. Sarah looks appalled at the exhausted Drover as his black friend gestures that she is behind him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "At dawn, an orange glow outlines two people and a tree. The grandfather grabs his fishing pole while the boy lies wide-eyed as a White man in a suit falls into the water, blood staining it. The boy surfaces, sees a panicking horse, and reaches out. The horse swims to him, and he climbs on its back, riding through a dusty landscape with sparse trees and rocky crags, passing a settlement of wooden buildings and animal pens. Bonfire smoke mixes with dust, and an animal skull hangs from a branch. Spotting an overloaded truck, he dismounts and hides in a water tank as a man tries to grab the horse. He peeks through a crack as an elegant woman in a bonnet approaches the house. A woman rides a horse, and a car arrives at a country house; a man in a bowler hat exits. She frowns, her blue eyes glittering, and crumples a telegram, later looking out of an airplane window at a port. A red-bearded speaker is knocked down, making the rough crew in a bar nervous; Drover downs a drink as an Aboriginal man approaches, while the barman glares. The barman closes the doors as Drover deals with Bull. Meanwhile, Sarah marshals her porters and strides on. Drover is thrown over the bar but comes up swinging as Sarah approaches the pub. As she enters, the fight spills out. She notices the barman's raised truncheon and an old drunk. The barman rolls his eyes as she heads for the door, exiting as Drover hurls Bull into her luggage. They hit each other with suitcases, one bursts, sending underwear flying. Carney watches with binoculars as she approaches through the chaos. Drover breaks a case over Bull's head, and Bull goes down. Sarah looks appalled at the exhausted Drover as his friend gestures that she is behind him."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "At dawn, an orange glow outlines two people and a tree. His grandfather grabs his fishing pole as the boy lies wide-eyed, while a White man in a suit falls into the water, floating lifelessly and sinking. The boy surfaces, sees a panicking horse, reaches out, and strokes its muzzle. He climbs on the horse, riding through a dusty landscape with trees and rocky crags, passing a settlement with wood buildings and animal pens. Bonfire smoke mixes with dust, and an animal skull hangs from a branch. Spotting a truck, he dismounts and hides in a water tank as a man tries to grab the horse. An elegant woman in a bonnet approaches the house. A woman rides a horse, and a car arrives at a country house as a man in a bowler hat exits. She frowns, crumples a telegram, and later looks out of an airplane window at a port. A red-bearded speaker is knocked down, making the crew nervous; Drover drinks as an Aboriginal man approaches, while the barman glares. The barman closes the doors as Drover fights Bull. Sarah marshals her porters and strides on. Drover is thrown over the bar but continues fighting as Sarah approaches the pub. She enters, noticing the barman's truncheon and an old drunk. The barman rolls his eyes as she leaves, just as Drover throws Bull into her luggage. They hit each other with suitcases, one bursts, sending underwear flying. Carney watches as she approaches through the chaos. Drover breaks a case over Bull's head, and Bull goes down. Sarah looks appalled at the exhausted Drover as his friend gestures that she is behind him."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As the first light of dawn begins to break, an orange glow beautifully silhouettes two figures and a solitary tree against the horizon. The boy's grandfather, with a sense of purpose, reaches for his fishing pole, while the young boy lies wide-eyed at the bottom of the boat. Suddenly, a White man dressed in a formal suit unexpectedly falls face-first into the water. The man floats lifelessly above the boy, his blood slowly spreading and staining the water around them, before he eventually sinks to the bottom. The boy, filled with urgency, breaks through the surface of the water and is met with the sight of a horse, panicking and thrashing in the water. He reaches out with determination, and the horse, sensing his presence, swims towards him, allowing the boy to gently stroke its muzzle. With agility, he climbs onto the horse's back, urging it to carry them out of the water. Clad only in shorts, his long hair streaming behind him, he rides through a dusty landscape dotted with sparsely spread trees and rugged rocky crags. He continues his journey through a settlement composed of wooden buildings and animal pens. The air is thick with a mix of bonfire smoke and dust, and an animal skull ominously hangs from a dry branch. \n\nAs he rides, he spots an overloaded truck approaching in the distance. With a sense of urgency, he dismounts and looks around worriedly, sprinting through the settlement known as Faraway Downs. Seeking refuge, he hides inside a water tank, peeking through a crack as a man attempts to seize the horse. Meanwhile, an elegant woman, wearing a bonnet and a long coat, strides purposefully towards the house. Another woman rides a horse, and a car pulls up to a large country house, from which a man in a bowler hat emerges. The woman frowns, her blue eyes glittering with emotion, as she crumples a telegram in her hand. Later, she gazes out of an airplane window at a bustling port with a ship moored nearby. In a bar, a red-bearded speaker is sent sprawling, causing the rough-looking crew to become nervous. Drover, unfazed, downs his drink and up-ends his glass as an Aboriginal man approaches, while the pipe-smoking barman glares at the scene. Coolly, the barman closes the sealing doors as Drover becomes engaged in a confrontation with Bull, the man with the red beard. Meanwhile, Sarah, with an air of authority, marshals her porters, brushing past them disdainfully and striding onward. Drover is thrown over the bar but quickly recovers, coming up swinging as the brawl reaches its peak just as Sarah approaches the pub. As she enters, the fight spills out the back, and upon stepping inside, she notices the barman's raised truncheon and an old drunk slumped in the corner. The barman rolls his eyes as she heads for the door, exiting just as Drover hurls Bull into her luggage. They collide with the suitcases, one bursting open and sending underwear flying through the air. Carney, watching through binoculars, observes in horror as she navigates through the chaos of brawlers, rubberneckers, and flying undies. Drover breaks a case over his opponent's head, causing Bull to go down. Sarah looks on, appalled, at the exhausted Drover, as his black friend gestures to indicate that she is standing right behind him."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As the very first light of dawn begins to gently break over the landscape, an orange glow magnificently silhouettes two figures alongside a solitary tree against the distant horizon. The grandfather, filled with a sense of purpose and determination, reaches out to grasp his trusty fishing pole, while the young boy lies wide-eyed with wonder at the bottom of the boat. Quite unexpectedly, a White man, dressed in a formal suit, suddenly and unceremoniously falls face-first into the water. The man, appearing lifeless, floats ominously above the boy, while his blood slowly spreads, staining the water around them with a crimson hue, before eventually sinking to the bottom. Filled with urgency and determination, the boy breaks through the water’s surface and is greeted by the sight of a horse, frantically panicking and thrashing about in the water. With determination, he reaches out, and the horse, sensing his calming presence, swims toward him, allowing the boy to gently stroke its muzzle. Demonstrating agility and resolve, he climbs onto the horse's back, urging it to transport them out of the water. Clad only in shorts, his long hair streaming dramatically behind him, he rides with purpose through a dusty landscape dotted with sparsely spread trees and rugged, rocky crags. He continues onward, journeying through a settlement composed of wooden buildings and various animal pens. The air is thick with a mix of bonfire smoke and swirling dust, an animal skull hanging ominously from a dry, barren branch. \n\nAs he rides with urgency, he spots an overloaded truck making its way toward them in the distance. With a sense of urgency, he dismounts from the horse and looks around worriedly, sprinting through the settlement known as Faraway Downs. In search of refuge, he hides inside a water tank, peering through a crack as a man attempts to seize the horse. Meanwhile, an elegant woman, attired in a bonnet and long coat, strides with purpose towards the house. Another woman is seen riding a horse, while a car pulls up to the front of a large country house, from which a man wearing a bowler hat emerges. The woman frowns, her blue eyes glittering with deep emotion, as she crumples a telegram in her hand. Later, she is seen gazing out of an airplane window at a bustling port below, near which a ship is moored. In a bar, a red-bearded speaker is abruptly sent sprawling, causing the rough-looking crew to become visibly nervous. Drover, unfazed by the chaos, downs his drink and up-ends his glass as an Aboriginal man approaches, while the pipe-smoking barman glares disapprovingly at the scene. Coolly, the barman closes the sealing doors as Drover becomes engaged in a heated confrontation with Bull, the red-bearded man. Meanwhile, Sarah, exuding an air of authority, marshals her porters, brushing past them disdainfully and striding onward. Drover is thrown over the bar but quickly recovers, coming up swinging as the brawl reaches its peak at the exact moment Sarah approaches the pub. As she steps inside, the fight spills out the back door, and upon entering, she immediately notices the barman's raised truncheon and an old drunk slumped lazily in the corner. The barman rolls his eyes in exasperation as she heads for the exit, leaving just as Drover hurls Bull into her carefully packed luggage. They collide with the suitcases, one bursting open and sending underwear flying through the air. Carney, watching the scene unfold through binoculars, observes in horror as she maneuvers through the chaos of brawlers, onlookers, and flying garments. Drover breaks a case over his opponent's head, causing Bull to topple down. Sarah looks on, appalled, at the exhausted Drover, as his black friend gestures to indicate that she is standing right behind him."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the first light of dawn casts an orange glow, it creates a silhouette of two people and a tree against the horizon. His grandfather, with a deliberate motion, reaches for his fishing pole, while the boy lies wide-eyed on the bottom of the boat, taking in the scene around him. Suddenly, a White man dressed in a suit unexpectedly falls face-first into the water, creating a splash that disturbs the calm surface. The man, now floating lifelessly, drifts over the boy, and as his blood begins to seep into the water, it creates a dark, spreading stain before he slowly sinks to the bottom. The boy, reacting to the unfolding events, breaks through the surface of the water, gasping for air, and immediately notices a horse thrashing in panic nearby. Instinctively, he reaches out his hand, and the horse, sensing his presence, swims towards him, allowing the boy to gently stroke its muzzle in a calming gesture. Seizing the moment, he climbs onto the horse's back, urging it to move forward and out of the water. Clad only in shorts, with his long hair streaming behind him, he rides through a dusty landscape dotted with sparse trees and rocky crags, continuing his journey through a settlement composed of wooden buildings and animal pens. The air is thick with a mixture of bonfire smoke and dust, and an animal skull ominously hangs from a dry branch. As he rides, he spots an overloaded truck approaching in the distance, prompting him to dismount quickly, his expression turning to one of worry. He sprints through the settlement known as Faraway Downs, seeking refuge by hiding inside a water tank. Peering through a narrow crack, he observes a man attempting to seize the horse, while an elegant woman, adorned in a bonnet and long coat, strides purposefully towards a nearby house. Meanwhile, a woman rides a horse, and a car arrives at a large country house, from which a man in a bowler hat emerges. The woman frowns, her blue eyes sparkling with emotion, as she crumples a telegram in her hand, later gazing out of an airplane window at a port where a ship is moored. In a bar, a red-bearded speaker is sent sprawling, causing the rough-looking crew to become visibly nervous. Drover, unfazed, downs his drink and dramatically up-ends his glass as an Aboriginal man approaches, while the pipe-smoking barman watches with a glare. With a cool demeanor, the barman closes the sealing doors as Drover becomes embroiled in a confrontation with Bull, the man with the red beard. Meanwhile, Sarah, with an air of authority, organizes her porters, brushing past them disdainfully and striding onward. In the midst of the chaos, Drover is thrown over the bar but quickly recovers, coming up swinging as the brawl reaches its peak just as Sarah approaches the pub. As she enters, the fight spills out the back, and upon stepping inside, she immediately notices the barman's raised truncheon and an old drunk slumped in the corner. The barman rolls his eyes in exasperation as she makes her way to the door, exiting just as Drover hurls Bull into her luggage. The impact causes them to collide with the suitcases, one of which bursts open, sending underwear flying into the air. Carney, observing the scene through binoculars, watches in horror as she navigates through the chaos of brawlers, onlookers, and the scattered undergarments. Drover, in a final act of defiance, breaks a case over his opponent's head, causing Bull to collapse. Sarah, witnessing the aftermath, looks appalled at the sight of the exhausted Drover, while his black friend gestures to indicate her presence behind him."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "At dawn, an orange glow silhouettes two people and a tree. The boy's grandfather grabs his fishing pole while the boy lies wide-eyed on the bottom of a boat, witnessing a White man in a suit fall face-first into the water. The man floats lifelessly, his blood staining the water, before sinking. The boy surfaces, calms a panicking horse, and climbs onto its back, urging it out of the water. Wearing only shorts, with his long hair streaming, he rides through a dusty landscape with sparse trees and rocky crags, passing through a settlement of wooden buildings and animal pens. Bonfire smoke mingles with the dust, and an animal skull hangs from a dry branch. Spotting an overloaded truck, he dismounts, looks worried, and sprints through the settlement called Faraway Downs, hiding in a water tank as a man tries to grab the horse. He peeks through a crack as an elegant woman in a bonnet and long coat strides towards the house. Meanwhile, a woman rides a horse, and a car arrives at a large country house, where a man in a bowler hat disembarks. She frowns, her blue eyes glittering, and crumples a telegram, later gazing out of an airplane window at a port with a moored ship. In a bar, a red-bearded speaker is sent sprawling, making the rough-looking crew nervous. Drover downs a drink and up-ends his glass as an Aboriginal man approaches, while the pipe-smoking barman glares and coolly closes the sealing doors. Drover is busy with Bull with the red beard, and Sarah marshals her porters, brushing past disdainfully. Drover is thrown over the bar but comes up swinging as the brawl intensifies. Sarah approaches the pub, and as she enters, the fight spills out the back. Inside, she notices the barman's raised truncheon and an old drunk in the corner. The barman rolls his eyes as she heads for the door, exiting just as Drover hurls Bull into her luggage. They hit each other with suitcases, one bursting and sending underwear flying. Carney watches with binoculars as she approaches in horror through the chaos. Drover breaks a case over his opponent's head, and Bull goes down. Sarah looks appalled at the exhausted Drover as his black friend gestures that she is behind him."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "At dawn, an orange glow silhouettes two people and a tree, casting long shadows in the early morning light. His grandfather, an avid fisherman known around their lakeside community, grabs his fishing pole as the boy lies wide-eyed on the bottom while a White man in a suit, perhaps a businessman caught in unexpected circumstances, falls face-first into the water. The man floats lifelessly over the boy, his blood from a previously unknown wound staining the water, and then sinks to the bottom as if the depths were claiming him. The boy breaks the surface and sees a horse, a valuable and often unpredictable creature, panicking in the water, reaches out, and the horse swims towards him, allowing him to stroke its muzzle as a sign of trust. He climbs on the horse's back, urging it out of the water with a confidence born from years spent around animals. Wearing only shorts, with his long hair streaming like a banner behind him, he rides through a dusty landscape reminiscent of the Australian Outback, with thinly spread trees and rocky crags, continuing through a settlement of wood buildings and animal pens that dot the rural areas. Bonfire smoke, a common feature at community gatherings, mixes with the dust in the air, and an animal skull hangs from a dry branch as a grim totem. Spotting an overloaded truck approaching, likely carrying supplies or people to the remote area, he dismounts and looks worried, sprinting through the settlement called Faraway Downs, a name perhaps chosen for its isolation. He hides in a water tank as a man tries to grab the horse, peeking through a crack as an elegant woman in a bonnet and long coat, attire suggesting she is from a well-to-do background, strides towards the house. A woman rides a horse, and a car, a rare sight in such remote parts, pulls up at a large country house while a man in a bowler hat, a style associated with formality, gets out. She frowns, her blue eyes glittering with determination, and screws up a telegram, a means of communication that can bring both good and bad news swiftly, later looking out of an airplane window at a port with a moored ship awaiting its next voyage. A red-bearded speaker is sent sprawling, making the rough-looking crew in a bar nervous; Drover, known for his no-nonsense attitude, downs a drink and up-ends his glass as an Aboriginal man approaches, a member of a people with deep cultural ties to the land, while the pipe-smoking barman glares with suspicion. Coolly, the barman closes the sealing doors as Drover is busy with Bull with the red beard. Meanwhile, Sarah marshals her porters, brushing past disdainfully and striding on with the authority of someone accustomed to command. Drover is thrown over the bar but comes up swinging, with the brawl in full swing as Sarah approaches the pub, a common social hub in such communities. As she walks in, the fight spills out the back, a chaotic scene of flying fists and shouted curses. Upon entering the pub, she notices the barman's raised truncheon, a tool often used for maintaining order, and an old drunk in the corner who seems to be a fixture of the place. The barman rolls his eyes as she heads for the door, walking out just as Drover hurls Bull into her luggage. They hit each other with the suitcases, one bursts, sending underwear flying like an explosion of fabric. Carney, a figure with perhaps a vested interest in the unfolding drama, watches with binoculars as she approaches in horror through the brawlers, rubberneckers, and flying undies. Drover breaks a case over his opponent's head, and Bull goes down with a heavy thud. Sarah looks appalled at the exhausted Drover as his black friend, a figure symbolizing camaraderie across cultural boundaries, gestures that she is behind him."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "At dawn an orange glow silhouettes two people and a tree  His grandfather grabs his fishing pole as the boy lies wideeyed on the bottom while a White man in a suit falls facefirst into the water  The man floats lifelessly over the boy his blood staining the water and then sinks to the bottom  A woman rides a horse and a car pulls up at a large country house while a man in a bowler hat gets out  She frowns her blue eyes glittering and screws up a telegram later looking out of an airplane window at a port with a moored ship  A redbearded speaker is sent sprawling making the roughlooking crew in a bar  nervous Drover downs a drink and upends his glass as an Aboriginal man approaches while the pipesmoking barman glares Coolly  the barman closes the sealing doors as Drover is busy with Bull with the red beard  Meanwhile Sarah marshals her porters brushing past disdainfully and striding on  Drover is thrown over the bar but comes up swinging with the brawl in full swing  as Sarah approaches the pub  As she walks in the fight spills out the back  Upon entering the pub she notices the barman's raised truncheon and an old drunk in the corner  The barman rolls his eyes as she heads for the door walking out just as Drover hurls Bull into her luggage  They hit each other with the suitcases  one bursts sending underwear flying  The boy breaks the surface and sees a horse panicking in the water reaches out and the horse swims towards him allowing him to stroke its muzzle  He climbs on the horse's back urging it out of the water  Wearing only shorts with his long hair streaming he rides through a dusty landscape with thinly spread trees and rocky crags continuing through a settlement of wood buildings and animal pens  Bonfire smoke mixes with the dust in the air and an animal skull hangs from a dry branch  Spotting an overloaded truck approaching he dismounts and looks worried sprinting through the settlement called Faraway Downs  He hides in a water tank as a man tries to grab the horse peeking through a crack  as an elegant woman in a bonnet and long coat strides towards the house  A woman rides a horse and a car pulls up at a large country house while a man in a bowler hat gets out  She frowns her blue eyes glittering and screws up a telegram later looking out of an airplane window at a port with a moored ship  A redbearded speaker is sent sprawling making the roughlooking crew in a bar  nervous Drover downs a drink and upends his glass as an Aboriginal man approaches while the pipesmoking barman glares Coolly  the barman closes the sealing doors as Drover is busy with Bull with the red beard  Meanwhile Sarah marshals her porters brushing past disdainfully and striding on  Drover is thrown over the bar but comes up swinging with the brawl in full swing  as Sarah approaches the pub  As she walks in the fight spills out the back  Upon entering the pub she notices the barman's raised truncheon and an old drunk in the corner  The barman rolls his eyes as she heads for the door walking out just as Drover hurls Bull into her luggage  They hit each other with the suitcases  one bursts sending underwear flying  Carney watches with binoculars as she approaches in horror through the brawlers rubberneckers and flying undies  Drover breaks a case over his opponent's head and Bull goes down  Sarah looks appalled at the exhausted Drover as his black friend gestures that she is behind him"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "At dawn an orange glow silhouettes two people and a tree. His grandfather grabs his fishing pole as the boy lies wideeyed on the bottom while a White man in a suit falls facefirst into the water. The man floats lifelessly over the boy his blood staining the water and then sinks to the bottom. The boy breaks the surface and sees a horse panicking in the water reaches out and the horse swims towards him allowing him to stroke its muzzle. He climbs on the horse's back urging it out of the water. Wearing only shorts with his long hair streaming he rides through a dusty landscape with thinly spread trees and rocky crags continuing through a settlement of wood buildings and animal pens. Bonfire smoke mixes with the dust in the air and an animal skull hangs from a dry branch. Spotting an overloaded truck approaching he dismounts and looks worried sprinting through the settlement called Faraway Downs. He hides in a water tank as a man tries to grab the horse peeking through a crack. as an elegant woman in a bonnet and long coat strides towards the house. A woman rides a horse and a car pulls up at a large country house while a man in a bowler hat gets out. She frowns her blue eyes glittering and screws up a telegram later looking out of an airplane window at a port with a moored ship. A redbearded speaker is sent sprawling making the roughlooking crew in a bar. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. nervous Drover downs a drink and upends his glass as an Aboriginal man approaches while the pipesmoking barman glares Coolly. the barman closes the sealing doors as Drover is busy with Bull with the red beard. Meanwhile Sarah marshals her porters brushing past disdainfully and striding on. Drover is thrown over the bar but comes up swinging with the brawl in full swing. as Sarah approaches the pub. As she walks in the fight spills out the back. Upon entering the pub she notices the barman's raised truncheon and an old drunk in the corner. The barman rolls his eyes as she heads for the door walking out just as Drover hurls Bull into her luggage. They hit each other with the suitcases. one bursts sending underwear flying. Carney watches with binoculars as she approaches in horror through the brawlers rubberneckers and flying undies. Drover breaks a case over his opponent's head and Bull goes down. Sarah looks appalled at the exhausted Drover as his black friend gestures that she is behind him."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "At dawn an orange glow silhouettes two people and a tree. His grandfather grabs his fishing pole as the boy lies wideeyed on the bottom while a White man in a suit falls facefirst into the water. The man floats lifelessly over the boy his blood staining the water and then sinks to the bottom. The boy breaks the surface and sees a horse panicking in the water reaches out and the horse swims towards him allowing him to stroke its muzzle. He climbs on the horse's back urging it out of the water. Wearing only shorts with his long hair streaming he rides through a dusty landscape with thinly spread trees and rocky crags continuing through a settlement of wood buildings and animal pens. Bonfire smoke mixes with the dust in the air and an animal skull hangs from a dry branch. Spotting an overloaded truck approaching he dismounts and looks worried sprinting through the settlement called Faraway Downs. He hides in a water tank as a man tries to grab the horse peeking through a crack. as an elegant woman in a bonnet and long coat strides towards the house. A woman rides a horse and a car pulls up at a large country house while a man in a bowler hat gets out. She frowns her blue eyes glittering and screws up a telegram later looking out of an airplane window at a port with a moored ship. A redbearded speaker is sent sprawling making the roughlooking crew in a bar. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. nervous Drover downs a drink and upends his glass as an Aboriginal man approaches while the pipesmoking barman glares Coolly. the barman closes the sealing doors as Drover is busy with Bull with the red beard. Meanwhile Sarah marshals her porters brushing past disdainfully and striding on. Drover is thrown over the bar but comes up swinging with the brawl in full swing. as Sarah approaches the pub. As she walks in the fight spills out the back. Upon entering the pub she notices the barman's raised truncheon and an old drunk in the corner. The barman rolls his eyes as she heads for the door walking out just as Drover hurls Bull into her luggage. They hit each other with the suitcases. one bursts sending underwear flying. Carney watches with binoculars as she approaches in horror through the brawlers rubberneckers and flying undies. Drover breaks a case over his opponent's head and Bull goes down. Sarah looks appalled at the exhausted Drover as his black friend gestures that she is behind him."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "At dawn an orange glow silhouettes two people and a tree. His grandfather grabs his fishing pole as the boy lies wideeyed on the bottom while a White man in a suit falls facefirst into the water. The man floats lifelessly over the boy his blood staining the water and then sinks to the bottom. The boy breaks the surface and sees a horse panicking in the water reaches out and the horse swims towards him allowing him to stroke its muzzle. He climbs on the horse's back urging it out of the water. Wearing only shorts with his long hair streaming he rides through a dusty landscape with thinly spread trees and rocky crags continuing through a settlement of wood buildings and animal pens. Bonfire smoke mixes with the dust in the air and an animal skull hangs from a dry branch. The barman rolls his eyes as she heads for the door walking out just as Drover hurls Bull into her luggage. They hit each other with the suitcases. one bursts sending underwear flying. Carney watches with binoculars as she approaches in horror through the brawlers rubberneckers and flying undies. Drover breaks a case over his opponent's head and Bull goes down. Sarah looks appalled at the exhausted Drover as his black friend gestures that she is behind him."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "At dawn an orange glow silhouettes two people and a tree. His grandfather grabs his fishing pole as the boy lies wideeyed on the bottom while a White man in a suit falls facefirst into the water. The man floats lifelessly over the boy his blood staining the water and then sinks to the bottom. Carney watches with binoculars as she approaches in horror through the brawlers rubberneckers and flying undies. Drover breaks a case over his opponent's head and Bull goes down. Sarah looks appalled at the exhausted Drover as his black friend gestures that she is behind him."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "At dawn, an orange glow silhouettes a dolphin and a tree. The dog grabs the fishing pole as the cat lies wide-eyed on the bottom while a penguin in a suit falls face-first into the water. The penguin floats lifelessly over the cat, his blood staining the water, and then sinks to the bottom. The cat breaks the surface and sees an elephant panicking in the water, reaches out, and the elephant swims towards the cat, allowing the cat to stroke its muzzle. The cat climbs on the elephant's back, urging it out of the water. Wearing only shorts, with its long hair streaming, the cat rides through a dusty landscape with thinly spread trees and rocky crags, continuing through a settlement of wood buildings and animal pens. Bonfire smoke mixes with the dust in the air, and an animal skull hangs from a dry branch. Spotting an overloaded truck approaching, the cat dismounts and looks worried, sprinting through the settlement called Faraway Downs. The cat hides in a water tank as a parrot tries to grab the elephant, peeking through a crack as an elegant llama in a bonnet and long coat strides towards the house. A kangaroo rides a horse, and a car pulls up at a large country house while a zebra in a bowler hat gets out. The llama frowns, its blue eyes glittering, and screws up a telegram, later looking out of an airplane window at a port with a moored ship. A red-bearded monkey is sent sprawling, making the rough-looking crew in a bar nervous; Drover downs a drink and up-ends his glass as a giraffe approaches, while the pipe-smoking barman glares. Coolly, the barman closes the sealing doors as Drover is busy with Bull with the red beard. Meanwhile, Sarah marshals her porters, brushing past disdainfully and striding on. Drover is thrown over the bar but comes up swinging, with the brawl in full swing as Sarah approaches the pub. As Sarah walks in, the fight spills out the back. Upon entering the pub, Sarah notices the barman's raised truncheon and an old drunk in the corner. The barman rolls his eyes as Sarah heads for the door, walking out just as Drover hurls Bull into her luggage. They hit each other with the suitcases, one bursts, sending underwear flying. Carney watches with binoculars as Sarah approaches in horror through the brawlers, rubberneckers, and flying undies. Drover breaks a case over his opponent's head, and Bull goes down. Sarah looks appalled at the exhausted Drover as his black friend gestures that she is behind him."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "At dawn, an orange glow silhouettes two people and a shrub. His grandfather grabs his walking stick as the boy lies wide-eyed on the hammock while a White man in a raincoat falls face-first into the sand. The man floats lifelessly over the boy, his wine staining the sand, and then sinks to the ground. The boy breaks the surface and sees a camel panicking in the distance, reaches out, and the camel trots towards him, allowing him to stroke its ear. He climbs on the camel's back, urging it out of the area. Wearing only shorts, with his long hair streaming, he rides through a barren landscape with thinly spread bushes and rocky cliffs, continuing through a settlement of brick buildings and bird cages. Chimney smoke mixes with the dust in the air, and a lantern hangs from a dry post. Spotting an overloaded cart approaching, he dismounts and looks worried, sprinting through the settlement called Faraway Plains. He hides in a barn as a man tries to grab the camel, peeking through a crack as an elegant woman in a scarf and long cloak strides towards the cabin. A woman rides a donkey, and a bicycle pulls up at a large manor while a man in a baseball cap gets out. She frowns, her brown eyes glittering, and screws up a letter, later looking out of a helicopter window at a harbor with a docked boat. A bald speaker is sent sprawling, making the rough-looking crew in a café nervous; Drover downs a cider and up-ends his cup as an Aboriginal man approaches, while the cigar-smoking barista glares. Coolly, the barista closes the swinging doors as Drover is busy with Bull with the bald head. Meanwhile, Sarah marshals her assistants, brushing past disdainfully and striding on. Drover is thrown over the counter but comes up swinging, with the scuffle in full swing as Sarah approaches the café. As she walks in, the fight spills out the side. Upon entering the café, she notices the barista's raised baton and an old drunk in the corner. The barista rolls his eyes as she heads for the entrance, walking out just as Drover hurls Bull into her parcels. They hit each other with the parcels, one bursts, sending papers flying. Carney watches with binoculars as she approaches in horror through the fighters, onlookers, and flying papers. Drover breaks a crate over his opponent's head, and Bull goes down. Sarah looks appalled at the exhausted Drover as his black friend gestures that she is behind him."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "At dawn, an orange glow outlines two people and a tree. His grandfather points to his fishing pole as the boy sits wide-eyed on the bottom while a White man in a suit trips face-first into the water. The man drifts peacefully over the boy, his blood mingling with the water, and then floats to the surface. The boy emerges from the water and sees a horse standing by the water's edge, waves at it, and the horse gallops towards him, allowing him to hug its neck. He slides onto the horse's back, signaling it out of the water. Wearing only shorts, with his long hair fluttering, he trots through a dusty landscape with thinly spread trees and rocky crags, passing through a settlement of wood buildings and animal pens. Bonfire smoke mingles with the dust in the air, and an animal skull dangles from a dry branch. Noticing an overloaded truck approaching, he dismounts and looks worried, crawling through the settlement called Faraway Downs. He crouches in a water tank as a man tries to lead the horse, peeking through a crack as an elegant woman in a bonnet and long coat marches towards the house. A woman guides a horse, and a car idles at a large country house while a man in a bowler hat steps out. She frowns, her blue eyes sparkling, and crumples a telegram, later gazing out of an airplane window at a port with a docked ship. A red-bearded speaker is sent tumbling, unnerving the rough-looking crew in a bar; Drover sips a drink and sets down his glass as an Aboriginal man watches, while the pipe-smoking barman smirks. Casually, the barman secures the sealing doors as Drover is engaged with Bull with the red beard. Meanwhile, Sarah organizes her porters, brushing past disdainfully and marching on. Drover is tossed over the bar but stands up swinging, with the brawl in full motion as Sarah nears the pub. As she enters, the fight spills outside. Upon entering the pub, she notices the barman's lifted truncheon and an old drunk in the corner. The barman sighs as she heads for the door, stepping out just as Drover shoves Bull into her luggage. They strike each other with the suitcases, one comes apart, sending underwear fluttering. Carney watches with binoculars as she reacts in shock through the brawlers, onlookers, and flying undies. Drover smashes a case over his opponent's head, and Bull staggers. Sarah looks dismayed at the weary Drover as his black friend signals that she is behind him."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "At dawn, a purple glow silhouettes two owls and a boulder. Her grandmother grabs her umbrella as the girl lies wide-eyed on the ceiling while a Green alien in a cape falls face-first into the river. The alien floats lifelessly over the girl, its ink staining the river, and then sinks to the ceiling. The girl breaks the surface and sees a bicycle panicking in the river, reaches out, and the bicycle swims towards her, allowing her to stroke its wheel. She climbs on the bicycle's seat, urging it out of the river. Wearing only socks, with her short hair streaming, she rides through a muddy landscape with thinly spread flowers and rocky peaks, continuing through a settlement of metal statues and insect hives. Campfire smoke mixes with the mud in the air, and a robot skull hangs from a wet branch. Spotting an overloaded plane approaching, she dismounts and looks worried, sprinting through the settlement called Distant Heights. She hides in a picture frame as a cat tries to grab the bicycle, peeking through a crack as an elegant octopus in a helmet and long boots glides towards the barn. An octopus rides a bicycle, and a scooter pulls up at a large desert barn while an owl in a sombrero gets out. She frowns, her brown eyes glittering, and screws up a map, later looking out of a helicopter window at a meadow with a parked bus. A blue-bearded canary is sent sprawling, making the polished-looking chefs in a cafe nervous; Sailor downs a juice and up-ends his mug as a Martian child approaches, while the cigar-smoking cashier glares. Coolly, the cashier closes the opening windows as Sailor is busy with Moose with the blue beard. Meanwhile, Linda marshals her chefs, brushing past disdainfully and striding on. Sailor is thrown over the counter but comes up swinging, with the wrestling in full swing as Linda approaches the cafe. As she walks in, the fight spills out the front. Upon entering the cafe, she notices the cashier's raised notebook and an old clown in the corner. The cashier rolls his eyes as she heads for the window, walking out just as Sailor hurls Moose into her chair. They hit each other with the backpacks, one bursts, sending marbles flying. Turner watches with a telescope as she approaches in horror through the wrestlers, spectators, and flying marbles. Sailor breaks a drawer over his opponent's head, and Moose goes down. Linda looks appalled at the exhausted Sailor as his white companion gestures that she is behind him."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "At dawn, a turquoise glow silhouettes two cats and a bush. His uncle fetches his telescope as the girl rests wide-eyed on the floor while an elderly woman in a dress tumbles face-first into the water. The woman drifts motionlessly over the girl, her tears staining the water, and then vanishes to the bottom. The girl breaches the surface and sees a dog struggling in the water, reaches out, and the dog paddles towards her, permitting her to stroke its snout. She climbs on the dog's back, encouraging it out of the water. Wearing only a hat, with her long hair billowing, she rides through a sandy landscape with sparsely spread shrubs and stony cliffs, proceeding through a village of stone buildings and bird cages. Campfire smoke mingles with the sand in the air, and a bird skull dangles from a dry twig. Noticing an overflowing cart approaching, she dismounts and feels anxious, dashing through the village called Distant Meadows. She conceals herself in a barrel as a woman tries to snatch the dog, peering through a gap as a stylish man in a bonnet and long coat strides towards the cabin. A man rides a horse, and a van pulls up at a grand country manor while a woman in a sun hat steps out. He scowls, his green eyes shimmering, and crumples a letter, later glancing out of a helicopter window at a dock with a docked yacht. A blonde-bearded juggler is sent tumbling, making the unkempt band in a saloon uneasy; Harper gulps a drink and overturns his glass as an Inuit man approaches, while the cigar-smoking bartender grins. Calmly, the bartender opens the sealing windows as Harper is engaged with Bear with the blonde beard. Meanwhile, Emily gathers her assistants, brushing past indifferently and striding on. Harper is thrown under the table but rises swinging, with the clash in full swing as Emily approaches the tavern. As she enters, the skirmish spills out the front. Upon stepping into the tavern, she notices the bartender's raised wand and an old poet in the corner. The bartender shakes his head as she heads for the exit, walking out just as Harper tosses Bear into her baggage. They hit each other with the bags, one bursts, sending hats flying. Marley observes with magnifying glasses as she approaches in shock through the fighters, bystanders, and airborne hats. Harper shatters a bag over his rival's head, and Bear collapses. Emily looks shocked at the weary Harper as his white acquaintance signals that she is behind him."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "At dawn, a purple hue outlines two people and a cactus. His grandfather grabs his paintbrush as the boy lies wide-eyed on the rooftop while a White man in a tuxedo tumbles legs-first into the sand. The man rolls lifelessly over the boy, his tears soaking the ground, and then burrows into the earth. The boy emerges from the underbrush and sees a llama panicking in the desert, reaches out, and the llama trots toward him, allowing him to pat its neck. He clambers onto the llama's back, urging it out of the underbrush. Wearing only a vest, with his long hair billowing, he rides through a grassy landscape with densely clustered bushes and sandy ridges, continuing through a settlement of brick buildings and water wells. Chimney smoke mixes with the haze in the air, and a bird's nest hangs from a dry reed. Spotting an overloaded cart approaching, he dismounts and looks anxious, jogging through the settlement called Faraway Downs. He hides in a fruit crate as a woman tries to tether the llama, peeking through a gap as an elegant woman in a bonnet and long coat marches towards the gate. A woman rides a camel, and a bicycle pulls up at a large country house while a man in a top hat steps down. She scowls, her green eyes sparkling, and crumples up a brochure, later glancing out of a train window at a field with a grazing herd. A red-bearded musician is sent tumbling, making the rough-looking crowd in a park tense; Drover gulps a sip and rolls his chair as an Aboriginal man arrives, while the cigar-smoking vendor frowns. Casually, the vendor shuts the swinging gate as Drover is entangled with Bull with the red beard. Meanwhile, Sarah directs her helpers, brushing past distastefully and striding on. Drover is tossed into the flowerbed but rises swinging, with the fracas in full flow as Sarah approaches the bazaar. As she enters, the scuffle pours out the front. Upon entering the bazaar, she notices the vendor's raised hatchet and an old poet in the corner. The vendor sighs as she heads for the exit, stepping out just as Drover flings Bull into her backpack. They clash heads with the rucksacks, one bursts, sending scarves fluttering. Carney observes with a telescope as she closes in with horror through the scrappers, bystanders, and fluttering scarves. Drover smashes a drum over his opponent's back, and Bull goes down. Sarah looks aghast at the weary Drover as his black friend signals that she is behind him."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "At twilight, a green haze outlines three cats and a mountain. Her aunt seizes her telescope as the girl stands mesmerized on the rooftop while a Red woman in a gown tumbles head-first into the sand. The woman bobs motionlessly above the girl, her tears coloring the sand, and then drifts to the surface. The girl dives under the earth and observes a camel fretting in the sand, stretches a hand, and the camel strides towards her, permitting her to pat its hoof. She mounts on the camel's side, coaxing it into the sand. Adorned only in a robe, with her short hair gliding, she saunters through a snowy valley with densely packed shrubs and towering peaks, heading through a village of stone huts and bird cages. Lantern light mingles with the ash in the air, and a bird nest dangles from a wet twig. Noticing an empty bicycle advancing, she alights and looks relieved, strolling through the village known as Nearby Hills. She conceals herself in a grain silo as a woman attempts to seize the camel, peering through an opening as a grand gentleman in a top hat and short jacket strides towards the barn. A man rides a camel, and a train halts at a small urban apartment while a woman in a tiara steps out. He smiles, his green eyes twinkling, and unfolds a newsletter, eventually gazing out of a helicopter door at a wharf with a docked ferry. A blue-haired dancer is sent flying, making the well-dressed throng in a café anxious; Jumper sips a cocktail and sets down his cup as an Asian woman enters, while the hat-wearing waitress scowls. Calmly, the waitress opens the sliding windows as Jumper is engaged with Bear with the blue hair. Meanwhile, George organizes her carriers, brushing past amiably and marching on. Jumper is flung over the table but rises swinging, with the scuffle in full motion as George nears the café. As she strolls in, the skirmish spills into the front. Upon entering the café, she observes the waitress's lifted platter and a young reveler at the counter. The waitress shrugs as she steps toward the exit, strolling out just as Jumper tosses Bear into his backpack. They collide with the bags, one ruptures, dispersing gadgets soaring. Jason observes with a telescope as he approaches in curiosity through the fighters, onlookers, and flinging gadgets. Jumper shatters a crate over his adversary's shoulder, and Bear collapses. George looks impressed at the invigorated Jumper as his white companion indicates that he is ahead of her."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "At dawn, a boy and his grandfather fish under an orange glow. A tragic incident unfolds as a White man in a suit falls lifelessly into the water, staining it with blood. The boy surfaces, calms a panicking horse, and rides through a dusty landscape and settlement called Faraway Downs. Spotting a suspicious truck, he hides in a water tank as a well-dressed woman arrives. Meanwhile, in a bar, Drover downs a drink amidst a tense crowd. He gets into a brawl with Bull, drawing attention as Sarah, the elegant woman, approaches the pub. The fight spills out, and she gets caught in the chaos, her luggage scattered. Carney watches as Drover triumphs over Bull, and Sarah looks on, appalled at the scene."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Sarah looks appalled at the exhausted Drover as his black friend gestures that she is behind him Drover breaks a case over his opponent's head and Bull goes down  Carney watches with binoculars as she approaches in horror through the brawlers rubberneckers and flying undies  one bursts sending underwear flying  They hit each other with the suitcases  The barman rolls his eyes as she heads for the door walking out just as Drover hurls Bull into her luggage  Upon entering the pub she notices the barman's raised truncheon and an old drunk in the corner  As she walks in the fight spills out the back  as Sarah approaches the pub  Drover is thrown over the bar but comes up swinging with the brawl in full swing  Meanwhile Sarah marshals her porters brushing past disdainfully and striding on  the barman closes the sealing doors as Drover is busy with Bull with the red beard  nervous Drover downs a drink and upends his glass as an Aboriginal man approaches while the pipesmoking barman glares Coolly  A redbearded speaker is sent sprawling making the roughlooking crew in a bar  She frowns her blue eyes glittering and screws up a telegram later looking out of an airplane window at a port with a moored ship  A woman rides a horse and a car pulls up at a large country house while a man in a bowler hat gets out  as an elegant woman in a bonnet and long coat strides towards the house  He hides in a water tank as a man tries to grab the horse peeking through a crack  Spotting an overloaded truck approaching he dismounts and looks worried sprinting through the settlement called Faraway Downs  Bonfire smoke mixes with the dust in the air and an animal skull hangs from a dry branch  Wearing only shorts with his long hair streaming he rides through a dusty landscape with thinly spread trees and rocky crags continuing through a settlement of wood buildings and animal pens  He climbs on the horse's back urging it out of the water  The boy breaks the surface and sees a horse panicking in the water reaches out and the horse swims towards him allowing him to stroke its muzzle  The man floats lifelessly over the boy his blood staining the water and then sinks to the bottom  His grandfather grabs his fishing pole as the boy lies wideeyed on the bottom while a White man in a suit falls facefirst into the water  At dawn an orange glow silhouettes two people and a tree "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Drover is thrown over the bar but comes up swinging with the brawl in full swing  Sarah looks appalled at the exhausted Drover as his black friend gestures that she is behind him The barman rolls his eyes as she heads for the door walking out just as Drover hurls Bull into her luggage  as Sarah approaches the pub  Upon entering the pub she notices the barman's raised truncheon and an old drunk in the corner  She frowns her blue eyes glittering and screws up a telegram later looking out of an airplane window at a port with a moored ship  Meanwhile Sarah marshals her porters brushing past disdainfully and striding on  His grandfather grabs his fishing pole as the boy lies wideeyed on the bottom while a White man in a suit falls facefirst into the water  Spotting an overloaded truck approaching he dismounts and looks worried sprinting through the settlement called Faraway Downs  At dawn an orange glow silhouettes two people and a tree  They hit each other with the suitcases  as an elegant woman in a bonnet and long coat strides towards the house  the barman closes the sealing doors as Drover is busy with Bull with the red beard  Drover breaks a case over his opponent's head and Bull goes down  Wearing only shorts with his long hair streaming he rides through a dusty landscape with thinly spread trees and rocky crags continuing through a settlement of wood buildings and animal pens  As she walks in the fight spills out the back  A redbearded speaker is sent sprawling making the roughlooking crew in a bar  The man floats lifelessly over the boy his blood staining the water and then sinks to the bottom  The boy breaks the surface and sees a horse panicking in the water reaches out and the horse swims towards him allowing him to stroke its muzzle  Carney watches with binoculars as she approaches in horror through the brawlers rubberneckers and flying undies  Bonfire smoke mixes with the dust in the air and an animal skull hangs from a dry branch  He climbs on the horse's back urging it out of the water  He hides in a water tank as a man tries to grab the horse peeking through a crack  A woman rides a horse and a car pulls up at a large country house while a man in a bowler hat gets out  nervous Drover downs a drink and upends his glass as an Aboriginal man approaches while the pipesmoking barman glares Coolly  one bursts sending underwear flying "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "nervous Drover downs a drink and upends his glass as an Aboriginal man approaches while the pipesmoking barman glares Coolly  the barman closes the sealing doors as Drover is busy with Bull with the red beard  Meanwhile Sarah marshals her porters brushing past disdainfully and striding on  Drover is thrown over the bar but comes up swinging with the brawl in full swing  as Sarah approaches the pub  As she walks in the fight spills out the back  Upon entering the pub she notices the barman's raised truncheon and an old drunk in the corner  The barman rolls his eyes as she heads for the door walking out just as Drover hurls Bull into her luggage  They hit each other with the suitcases  one bursts sending underwear flying  Carney watches with binoculars as she approaches in horror through the brawlers rubberneckers and flying undies  Drover breaks a case over his opponent's head and Bull goes down  Sarah looks appalled at the exhausted Drover as his black friend gestures that she is behind him At dawn an orange glow silhouettes two people and a tree  His grandfather grabs his fishing pole as the boy lies wideeyed on the bottom while a White man in a suit falls facefirst into the water  The man floats lifelessly over the boy his blood staining the water and then sinks to the bottom  The boy breaks the surface and sees a horse panicking in the water reaches out and the horse swims towards him allowing him to stroke its muzzle  He climbs on the horse's back urging it out of the water  Wearing only shorts with his long hair streaming he rides through a dusty landscape with thinly spread trees and rocky crags continuing through a settlement of wood buildings and animal pens  Bonfire smoke mixes with the dust in the air and an animal skull hangs from a dry branch  Spotting an overloaded truck approaching he dismounts and looks worried sprinting through the settlement called Faraway Downs  He hides in a water tank as a man tries to grab the horse peeking through a crack  as an elegant woman in a bonnet and long coat strides towards the house  A woman rides a horse and a car pulls up at a large country house while a man in a bowler hat gets out  She frowns her blue eyes glittering and screws up a telegram later looking out of an airplane window at a port with a moored ship  A redbearded speaker is sent sprawling making the roughlooking crew in a bar "
        }
      ]
    }
  ]
}