{
  "ground_truth": "Drover staggers, distraught, through the burning wreck of the Carney house, sobbing in uncontrollable grief, as the flickering flames illuminate the calm figure of King George, while others mill around trying to help. Drover walks through the town, with King George shadowing him, looking out across the bay at the broken, burning hulks of ships, and walks towards the shattered pub where some people are trying to patch it up, while others sit around staring or drinking vacantly. He approaches Ivan, who's sweeping up in the bar, followed by Magarri. Drover looks around, taking in the white drinkers and his nervous black brother-in-law, then turns slowly back to Ivan, who stares as tears of grief and rage run down his face, while the bar patrons stare as he looks round at Magarri. Magarri enters tentatively, removes his hat, and approaches the bar, as a woman glares at him, drawing on a cigarette. Ivan has placed a glass and a tin cup on the bar, and tears roll down Drover's cheeks. Reluctantly, Ivan replaces the cup with another glass, and looks at Magarri, raising a glass. Magarri eyeballs him, glances at Drover, and they all take a drink, placing the empty glasses on the bar. Magarri wipes away a tear as Drover frowns in disbelief. Dutton checks the body on the stretcher as Sarah comes in, and his eyes bore into her, trying to make her understand. Meanwhile, a priest is down at the wharf, as Drover releases the mooring, takes a chain out of Bull's unconscious hand, and runs onto the small Mission Island sailing boat, while the priest prays. Magarri holds a rifle and Drover stands holding a rope as they get underway, while Sarah stares, grief-stricken, at the devastation. The wooden buildings of the Mission burn fiercely in the night, as Drover, Magarri, and Ivan stand staring on the beach. Drover nods to Magarri, who moves off, then moves fearfully up the beach, weapons raised, passing burning buildings and approaching the tree line. Drover looks into a building and sees a row of boys' shoes, looks horrified, and lowers his rifle, as his eyes fill with tears. He turns towards a noise, raising his rifle as something moves in the undergrowth, and a boy emerges. Drover lowers his weapon as more children come out of the undergrowth and smiles with relief as Magarri beckons the boys forward. Another figure with long hair appears, and they embrace, throwing their arms around one another. Drover holds the boy out at arm's length, grins happily, stroking his hair, as Nullah hangs his head sadly. A torch beam sweeps across the water towards them as they look around fearfully, while armed figures march out of the jungle through the smoke.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Drover reels, distressed, through the blazing ruin of the Carney home, weeping in uncontrollable sorrow, as the flickering blazes light up the serene silhouette of King George, while others mill about trying to assist. Drover strides through the township, with King George following him, gazing out across the bay at the shattered, flaming hulks of vessels, and strides towards the broken tavern where some folks are trying to mend it, while others sit around gazing or imbibing vacantly. He approaches Ivan, who's cleaning up in the saloon, followed by Magarri. Drover glances around, noticing the white tipplers and his anxious black brother-in-law, then turns gradually back to Ivan, who gazes as tears of sorrow and fury stream down his visage, while the bar clientele gaze as he looks around at Magarri. Magarri enters cautiously, doffs his hat, and approaches the bar, as a woman scowls at him, puffing on a cigarette. Ivan has placed a glass and a tin vessel on the bar, and tears flow down Drover's cheeks. Unwillingly, Ivan switches the vessel with another glass, and looks at Magarri, lifting a glass. Magarri glares at him, glances at Drover, and they all sip a drink, placing the emptied glasses on the bar. Magarri brushes away a tear as Drover scowls in incredulity. Dutton examines the corpse on the stretcher as Sarah enters, and his eyes penetrate her, endeavoring to make her comprehend. Meanwhile, a clergyman is down at the wharf, as Drover releases the tether, takes a chain from Bull's inert hand, and sprints onto the small Mission Island sailing craft, while the clergyman entreats. Magarri grips a firearm and Drover stands holding a cord as they set sail, while Sarah gazes, grief-stricken, at the ruin. The wooden structures of the Mission blaze fiercely in the night, as Drover, Magarri, and Ivan stand gazing on the shore. Drover nods to Magarri, who moves away, then advances fearfully up the shore, arms raised, passing blazing structures and nearing the tree line. Drover peers into a structure and sees a row of boys' footwear, appears appalled, and lowers his firearm, as his eyes brim with tears. He turns towards a sound, raising his firearm as something stirs in the undergrowth, and a boy appears. Drover lowers his weapon as more youngsters emerge from the undergrowth and grins with relief as Magarri signals the boys onward. Another figure with lengthy hair appears, and they embrace, throwing their arms around one another. Drover holds the boy out at arm's length, beams joyfully, stroking his hair, as Nullah hangs his head sadly. A flashlight beam sweeps across the water towards them as they look around fearfully, while armed silhouettes march out of the forest through the haze."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Drover staggers, distraught, through the burning wreck of the Carney house, sobbing in uncontrollable grief, as the calm figure of King George is illuminated by the flickering flames, while assistance is attempted by others milling around. The town is walked through by Drover, with King George shadowing him, and the broken, burning hulks of ships are looked out at by him across the bay. Towards the shattered pub he walks, where some people are trying to patch it up, while others sit around staring or drinking vacantly. Ivan is approached by him, who's sweeping up in the bar, and Magarri follows. The white drinkers and his nervous black brother-in-law are taken in by Drover as he looks around, then Ivan is turned slowly back to by him, who stares as tears of grief and rage run down his face, while the bar patrons are stared at by him as Magarri is looked round at. Tentatively entering is Magarri, his hat is removed, and the bar is approached by him, as a cigarette is drawn on by a woman glaring at him. A glass and a tin cup have been placed on the bar by Ivan, and Drover's cheeks have tears rolling down them. Reluctantly, the cup is replaced by Ivan with another glass, and Magarri is looked at by him, raising a glass. Ivan is eyeballed by Magarri, and Drover is glanced at by him, and a drink is taken by them all, the empty glasses placed on the bar. A tear is wiped away by Magarri as disbelief causes Drover to frown. The body on the stretcher is checked by Dutton as Sarah comes in, and she is stared at by him, trying to make her understand. Meanwhile, down at the wharf, a priest prays as Drover releases the mooring, a chain is taken out of Bull's unconscious hand by him, and the small Mission Island sailing boat is run onto by him. A rifle is held by Magarri and a rope is held by Drover as they get underway, while devastation is grief-strickenly stared at by Sarah. The wooden buildings of the Mission burn fiercely in the night, and Drover, Magarri, and Ivan stand staring on the beach. Magarri is nodded to by Drover, who moves off, then fearfully the beach is moved up by him, weapons raised, as the burning buildings are passed by him and the tree line is approached. A building is looked into by Drover and a row of boys' shoes is seen by him, horrified is he, and his rifle is lowered by him, as tears fill his eyes. A noise is turned towards by him, his rifle is raised as something in the undergrowth moves, and a boy emerges. His weapon is lowered by Drover as more children come out of the undergrowth, and relief causes him to smile as Magarri beckons the boys forward. Another figure with long hair appears, and an embrace is shared by them, arms thrown around one another. The boy is held out at arm's length by Drover, happiness causes him to grin, and his hair is stroked by him, as his head is hung sadly by Nullah. A torch beam sweeps across the water towards them as they look around fearfully, while out of the jungle, armed figures march through the smoke."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Drover staggers through the burning wreck of the Carney house, overwhelmed with grief, as King George stands calmly amid the chaos. In town, with King George shadowing him, Drover observes the bay's burning ship hulks and the shattered pub where people try to rebuild or sit vacantly. He approaches Ivan, sweeping the bar, trailed by Magarri. Drover notices the white drinkers and nervous Magarri, then turns back to Ivan, who is teary with grief and rage. Magarri enters, removes his hat, and approaches the bar as a woman smokes angrily. Ivan replaces a tin cup with a glass for Magarri, and they all drink, placing empty glasses on the bar. Magarri wipes away a tear, while Drover frowns. Dutton checks a stretcher as Sarah enters, and a priest prays at the wharf. Drover releases the mooring, takes a chain from Bull's hand, and runs onto the boat, with Magarri holding a rifle. Sarah stares at the devastation as the Mission's wooden buildings burn. Drover, Magarri, and Ivan stand on the beach, and Drover nods to Magarri, who moves cautiously up the beach, weapons raised. Drover finds boys' shoes in a building, horrified, and hears a noise. He lowers his rifle as a boy emerges, followed by more children. Relieved, Drover smiles as Magarri beckons the boys forward. Another figure appears, and they embrace. Drover grins, strokes the boy's hair, as Nullah lowers his head. A torch beam moves across the water as they look around anxiously, and armed figures emerge from the jungle smoke."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Drover staggers, distraught, through the burning Carney house wreck, sobbing in grief, as flames illuminate King George, while others try to help. Drover walks through the town, shadowed by King George, and sees the burning ships across the bay, heading to a damaged pub where some attempt repairs while others sit vacantly. He approaches Ivan, who's sweeping, followed by Magarri. Drover observes the white drinkers and his nervous black brother-in-law, then looks at Ivan, who weeps in grief and rage. Magarri enters, removes his hat, and approaches the bar, as a woman glares, smoking. Ivan places a glass and tin cup on the bar; tears flow down Drover's cheeks. Reluctantly, Ivan replaces the cup with a glass, raising it to Magarri. They all drink and place empty glasses on the bar as Magarri wipes a tear, and Drover frowns. Dutton checks a body on a stretcher as Sarah enters, his eyes trying to convey understanding. A priest is at the wharf, as Drover releases the mooring, takes a chain from Bull's hand, rushes onto the Mission Island sailing boat, while the priest prays. Magarri holds a rifle and Drover a rope as they sail away, while Sarah watches, grief-stricken, at the devastation. Mission wooden buildings burn fiercely at night, as Drover, Magarri, and Ivan stand on the beach. Drover nods to Magarri, who moves up the beach, weapons raised, passing burning buildings towards the tree line. Drover sees a row of boys' shoes, horrified, lowering his rifle as tears fill his eyes. He turns to a noise, raises his rifle as something moves, and a boy emerges. Drover lowers his weapon as more children appear, smiling with relief as Magarri beckons them. Another figure with long hair appears, embracing Drover. He holds the boy at arm's length, grinning, stroking his hair, as Nullah hangs his head sadly. A torch beam sweeps across the water, and they look around fearfully as armed figures emerge from the jungle."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Drover, overwhelmed with emotions and staggering aimlessly, moves with a heavy heart through the smoldering ruins of what was once the Carney house, his body wracked by uncontrollable sobs of deep, unfathomable grief. The flickering flames cast ghostly shadows that highlight the calm and composed figure of King George, who stands amidst the chaos while others bustle about, desperately attempting to offer assistance. As Drover trudges through the town, King George faithfully shadows him, looking with a solemn gaze across the bay at the broken, burning remains of ships that once sailed proudly. Drover makes his way toward the devastated pub, where a few determined individuals make attempts to repair the damage, while others sit in a daze, staring blankly or drinking to numb their pain. Upon entering, he approaches Ivan, who is diligently sweeping up the mess within the establishment, trailed closely by Magarri. Drover surveys his surroundings, noting the white patrons sipping their drinks alongside his apprehensive black brother-in-law. He then turns back to Ivan, whose eyes lock onto Drover's, tears of grief and simmering rage streaming down his face, while those seated in the bar observe intently as he glances toward Magarri. Magarri approaches the bar cautiously, respectfully removing his hat as a woman shoots him a harsh glare, puffing smoke from her cigarette. Ivan places a glass and a tin cup on the bar, and witnessing the tears that continue to slide down Drover’s cheeks, he hesitantly swaps the cup for another glass, then looks at Magarri, raising his own glass in a silent salute. Magarri returns Ivan's gaze, briefly shifting his eyes to Drover, before they all take a drink, setting their now-empty glasses back on the bar. As Drover's expression shifts to one of disbelief, Magarri discreetly wipes away a solitary tear. Meanwhile, Dutton is seen carefully examining a body lying on a stretcher. When Sarah enters, his eyes fixate on her, silently urging her to comprehend the gravity of the situation. At the wharf, a priest stands in solemn prayer as Drover releases the mooring, takes a chain from Bull's limp hand, and hastily boards a nearby small Mission Island sailing boat. Magarri stands guard with a rifle while Drover grips a rope as they set sail, and Sarah watches on, heartbroken, at the widespread devastation. The wooden structures of the Mission blaze furiously against the backdrop of the night sky, as Drover, Magarri, and Ivan stand rooted on the beach, absorbing the scene before them. Drover nods at Magarri, who cautiously advances up the beach with weapons at the ready, passing by the inferno-consumed buildings as he approaches the tree line. Upon peering inside a building, Drover's eyes widen in horror at the sight of a row of boys' shoes, prompting him to lower his rifle as tears pool in his eyes. Alerted by a nearby noise, he turns, weapon raised, as a shadowy movement emerges from the undergrowth, revealing a boy. Drover lowers his weapon in recognition and relief as more children step out of hiding. He offers a reassuring smile while Magarri motions for the boys to come forward. Emerging from the shadows, another figure with long hair appears, and they embrace warmly, arms wrapped tightly around one another. Drover holds the boy at arm's length, grinning with joy as he gently strokes his hair, while Nullah looks downward, burdened by his own sadness. As a torch beam cuts across the water towards them, they become alert, senses heightened as armed figures materialize, marching through the jungle smoke towards them."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In a state of emotional turmoil, overwhelmed and staggering without purpose, Drover proceeds with a heart heavy with sorrow through the smoldering remnants of what was once the proud Carney house. His body is convulsed by deep, uncontrollable sobs, each one a testament to profound and unfathomable grief. The flickering flames dance around, casting ghostly shadows that seem to highlight the calm and composed figure of King George, who stands serenely amidst the chaos. Meanwhile, others around him bustle with urgency, desperately trying to offer any assistance they can. As Drover shuffles through the devastated town, King George remains a constant presence, faithfully shadowing him. King George gazes solemnly across the bay, where the broken, burning ships lie. Once they sailed with pride, but now they stand as sad remnants of their former glory.\n\nDrover's path leads him to the devastated pub, where a handful of resolute individuals endeavor to repair the damages. Meanwhile, others sit in a daze, their eyes vacant or drinking in a futile attempt to numb their pain. Upon entering the establishment, Drover makes his way toward Ivan, who is diligently sweeping up the chaos within, accompanied by Magarri. As Drover surveys the scene, he notes the white patrons sipping their drinks alongside his apprehensive brother-in-law, who stands out in contrast. Turning his attention back to Ivan, Drover finds Ivan’s eyes meeting his own, tears of mourning and simmering rage streaming down Ivan’s face. Those seated at the bar watch with keen interest as he glances toward Magarri. Magarri approaches with a sense of caution, respectfully removing his hat. A woman nearby shoots him a harsh glare, exhaling cigarette smoke in his direction. Ivan places a glass and an old tin cup on the bar. Observing the tears still sliding down Drover’s cheeks, Ivan hesitates and then replaces the tin cup with another glass, looking back at Magarri and raising his own glass in a silent salute of solidarity. Magarri meets Ivan’s gaze, his eyes flickering briefly toward Drover before they all take a drink together, setting their now-empty glasses back down on the worn bar.\n\nDrover's expression shifts to disbelief as he processes his surroundings, and Magarri discreetly wipes away a solitary tear from his eye. Meanwhile, Dutton is seen meticulously examining a body laid solemnly on a stretcher. When Sarah enters, Dutton’s eyes fixate on her, silently imploring her to grasp the full gravity of the unfolding situation. Down at the wharf, a priest stands in solitude, engaged in solemn prayer. As Drover releases the mooring line, he takes a chain from Bull’s limp hand and quickly boards a nearby small Mission Island sailing boat. Magarri stands poised with a rifle, faithfully guarding while Drover grips a rope as they set out to sail. Sarah watches on, her heart breaking, as she takes in the widespread devastation surrounding her. The wooden structures of the Mission blaze with ferocity against the dramatic backdrop of the night sky, as Drover, Magarri, and Ivan stand riveted to the beach, absorbing the heart-wrenching scene unfolding before them. Drover nods at Magarri, who cautiously moves up the beach with weapons prepared. He passes by buildings engulfed in flames as he makes his approach to the tree line. \n\nUpon peering into one of the buildings, Drover's eyes widen in horror at the sight of a row of boys' shoes neatly lined up, a sight that prompts him to lower his rifle as tears begin to pool in his eyes. Alerted by a sudden noise nearby, he turns with heightened vigilance, weapon raised, as a shadowy movement emerges from the undergrowth, revealing itself to be a boy. Recognizing the boy, Drover lowers his weapon, filled with relief, as more children gradually step out from their hiding places. He offers a reassuring smile while Magarri gestures for the boys to come forward, emerging from their shadows. Another figure with long hair appears, stepping out from the shadows, and together they share a warm embrace, arms wrapped tightly around one another. Holding the boy at arm’s length, Drover grins with sheer joy as he gently strokes the child’s hair. Nullah, however, gazes downward, burdened by his own inner sadness. As the beam of a torch sweeps across the water towards them, their senses are heightened, alert to the approaching danger as the armed figures materialize, marching resolutely through the jungle smoke toward them."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Drover, with his movements unsteady and marked by visible distress, navigates through the fiery remains of the Carney house. His uncontrolled sobbing echoes amid the destruction, while the dancing flames create a surreal backdrop, casting a glow over King George's composed figure. Around them, people move frantically, trying to assist in any way they can. As Drover continues his path through the town, King George follows closely, a silent guardian, while Drover’s eyes scan the horizon, taking in the wreckage of burning ships scattered across the bay. His journey leads him to the shattered remnants of a pub, where some individuals are attempting makeshift repairs, whereas others sit around, lost in vacant stares or drowning their sorrows in drink. Upon entering, Drover approaches Ivan, who diligently sweeps up debris within the bar, followed closely by Magarri. Inside, Drover's gaze sweeps over the room, noting the presence of white patrons and his uneasy brother-in-law, who stands out amid the scene. Drover's gaze returns to Ivan, who is transfixed as tears of profound grief and fury carve paths down his cheeks, while bar patrons observe in curious silence. As Drover turns to Magarri, who enters the room with cautious steps, he removes his hat and makes his way to the bar, eliciting a cold glare from a woman who silently drags on her cigarette. Ivan, standing behind the bar, sets down a glass and a tin cup, and in the emotional silence, tears continue to fall from Drover's eyes. In a gesture of reluctant acceptance, Ivan replaces the tin cup with another glass, raising it towards Magarri. Magarri, locking eyes with Ivan, then glances at Drover as all three men raise their drinks and take a solemn sip, the clinking of glass punctuating the air before they set their empty glasses back on the bar. Magarri discreetly brushes away a tear, while Drover peers at him with a frown of disbelief etched on his face. Meanwhile, Dutton, preoccupied with the body on a stretcher, casts a penetrating look at Sarah as she enters, silently willing her to understand the gravity of the situation. Down at the wharf, a priest murmurs prayers as Drover goes about his task of untying the mooring, carefully extracting a chain from Bull's limp hand. Hastily, he sprints onto the small Mission Island sailing boat, signaling their impending departure, while Magarri clutches a rifle, and Drover secures his grip on a rope as the vessel sets in motion, Sarah standing ashore, her expression a portrait of sorrow as she surveys the ruin around her. The night air is thick with the acrid smoke of the Mission's wooden buildings as they succumb to the flames. On the beach, Drover, Magarri, and Ivan stand in a somber tableau, watching the inferno. With a nod from Drover, Magarri moves forward, courageously advancing up the beach, weapons poised, cautiously passing by smoldering structures and nearing the boundary of the forest. Drover peers into one building, his eyes landing on a chilling sight—an orderly row of boys' shoes, prompting him to lower his rifle in horror, his eyes brimming with fresh tears. A sudden noise catches his attention, prompting him to raise his weapon defensively as he scans the underbrush. To his immense relief, a boy emerges from the foliage, prompting Drover to lower his firearm. As more children step out into the open, Drover’s face softens into a smile of relief, and Magarri gestures for the boys to come forward, welcoming them with a wave of his hand. Another figure, distinguished by long hair, emerges from the jungle, and Drover, overcome with emotion, rushes to embrace them, their arms enveloping each other in a heartfelt reunion. He gently holds the boy at arm's length, his face alight with joy, as he tenderly strokes the boy's hair. Meanwhile, Nullah stands quietly, his head bowed in poignant reflection. A sudden flash of light from a torch sweeps across the water, alerting them all to the presence of danger, as they frantically look around. Tension mounts as armed figures emerge from the jungle, their march through the smoke signaling an ominous turn in the unfolding drama."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Drover, overwhelmed with grief, staggers through the burning wreckage of the Carney house, sobbing as King George observes calmly amidst the chaos. He makes his way through town, with King George in tow, passing smoldering shipwrecks in the bay and moving toward the damaged pub. There, people attempt makeshift repairs while others sit idly. Inside, Drover sees Ivan cleaning up, joined by Magarri. Surveying the scene filled with white patrons and his uneasy black brother-in-law, Drover turns back to Ivan, who, filled with grief and anger, replaces a tin cup with a glass for Magarri. Despite the tense atmosphere, they share a drink, and Magarri wipes away a tear as Drover looks on in disbelief. Meanwhile, Dutton checks a stretcher-bound body as Sarah enters, trying to convey unspoken understanding through his gaze. Near the wharf, a priest prays as Drover releases the mooring, takes a chain from Bull's unconscious hand, and boards a small Mission Island sailing boat with Magarri, who holds a rifle. As they depart, Sarah watches the devastation, deeply pained. On the beach, Drover, Magarri, and Ivan observe the Mission's fierce night fire. At Drover's nod, Magarri advances cautiously, weapons raised, past burning buildings toward the tree line. Inside a structure, Drover finds a row of boys' shoes, lowers his rifle in horror, and tears up. He hears a noise, raises his weapon but lowers it as a boy and more children emerge from the undergrowth. Relieved, Drover smiles as Magarri beckons them forward, then embraces a long-haired figure who appears. Joyfully, Drover holds the boy at arm's length, strokes his hair as Nullah looks down sadly. A torch beam sweeps across the water, and armed figures emerge from the jungle, adding to their apprehension."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Drover staggers, distraught, through the burning wreck of the Carney house, a historic building known for its intricately carved wooden veranda, sobbing in uncontrollable grief, as the flickering flames illuminate the calm figure of King George, a respected elder who often served as a spiritual guide in the community, while others mill around trying to help. Drover walks through the town, devastated by the recent conflict that left many homeless, with King George shadowing him, looking out across the bay at the broken, burning hulks of ships, remnants of the fleet attacked during the night, and walks towards the shattered pub where some people are trying to patch it up, while others sit around staring or drinking vacantly. He approaches Ivan, whose family has owned the bar for generations, who's sweeping up in the bar, followed by Magarri, a skilled tracker known for his sharp senses. Drover looks around, taking in the white drinkers and his nervous black brother-in-law, reflecting the racial tensions still persisting in the area, then turns slowly back to Ivan, who stares as tears of grief and rage run down his face, while the bar patrons stare as he looks round at Magarri. Magarri enters tentatively, removes his hat, a gesture of respect, and approaches the bar, as a woman glares at him, drawing on a cigarette, a bad habit she picked up during the war. Ivan has placed a glass and a tin cup on the bar, and tears roll down Drover's cheeks. Reluctantly, Ivan replaces the cup with another glass, acknowledging Magarri as an equal, and looks at Magarri, raising a glass. Magarri eyeballs him, glances at Drover, and they all take a drink, placing the empty glasses on the bar. Magarri wipes away a tear as Drover frowns in disbelief at the silent solidarity shared in the room. Dutton, a local medic with years of field experience, checks the body on the stretcher as Sarah comes in, and his eyes bore into her, trying to make her understand the gravity of the situation. Meanwhile, a priest is down at the wharf, a place where many sailors sought solace before their voyages, as Drover releases the mooring, takes a chain out of Bull's unconscious hand, and runs onto the small Mission Island sailing boat, while the priest prays for their safety. Magarri holds a rifle, a relic from his grandfather's time, and Drover stands holding a rope as they get underway, while Sarah stares, grief-stricken, at the devastation. The wooden buildings of the Mission, established decades ago to provide education to local children, burn fiercely in the night, as Drover, Magarri, and Ivan stand staring on the beach. Drover nods to Magarri, who moves off, then moves fearfully up the beach, weapons raised, passing burning buildings and approaching the tree line, a natural boundary often used by locals for cover. Drover looks into a building and sees a row of boys' shoes, a reminder of the innocence lost, looks horrified, and lowers his rifle, as his eyes fill with tears. He turns towards a noise, raising his rifle as something moves in the undergrowth, and a boy emerges, one of the many orphans the Mission took in. Drover lowers his weapon as more children come out of the undergrowth and smiles with relief as Magarri beckons the boys forward. Another figure with long hair appears, revealing themselves to be Nullah's mother, and they embrace, throwing their arms around one another. Drover holds the boy out at arm's length, grins happily, stroking his hair, as Nullah, a child with an extraordinary ability to navigate the land, hangs his head sadly. A torch beam, used by the local authorities searching for survivors, sweeps across the water towards them as they look around fearfully, while armed figures march out of the jungle through the smoke, part of the rescue operation finally arriving."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Drover staggers distraught through the burning wreck of the Carney house sobbing in uncontrollable grief as the flickering flames illuminate the calm figure of King George while others mill around trying to help. Drover walks through the town with King George shadowing him looking out across the bay at the broken burning hulks of ships and walks towards the shattered pub where some people are trying to patch it up while others sit around staring or drinking vacantly. He approaches Ivan who is sweeping up in the bar followed by Magarri. Drover looks around taking in the white drinkers and his nervous black brotherinlaw then turns slowly back to Ivan who stares as tears of grief and rage run down his face while the bar patrons stare as he looks round at Magarri. Magarri enters tentatively removes his hat and approaches the bar as a woman glares at him drawing on a cigarette. Ivan has placed a glass and a tin cup on the bar and tears roll down Drover's cheeks. Reluctantly Ivan replaces the cup with another glass and looks at Magarri raising a glass. Magarri eyeballs him glances at Drover and they all take a drink placing the empty glasses on the bar. Magarri wipes away a tear as Drover frowns in disbelief. Dutton checks the body on the stretcher as Sarah comes in and his eyes bore into her trying to make her understand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Meanwhile a priest is down at the wharf as Drover releases the mooring takes a chain out of Bull's unconscious hand and runs onto the small Mission Island sailing boat while the priest prays. Magarri holds a rifle and Drover stands holding a rope as they get underway while Sarah stares griefstricken at the devastation. The wooden buildings of the Mission burn fiercely in the night as Drover. Magarri and Ivan stand staring on the beach. Drover nods to Magarri who moves off then moves fearfully up the beach weapons raised passing burning buildings and approaching the tree line. Drover looks into a building and sees a row of boys' shoes looks horrified and lowers his rifle as his eyes fill with tears. He turns towards a noise raising his rifle as something moves in the undergrowth and a boy emerges. Drover lowers his weapon as more children come out of the undergrowth and smiles with relief as Magarri beckons the boys forward. Another figure with long hair appears and they embrace throwing their arms around one another. Drover holds the boy out at arm's length grins happily stroking his hair as Nullah hangs his head sadly. A torch beam sweeps across the water towards them as they look around fearfully while armed figures march out of the jungle through the smoke."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Drover staggers distraught through the burning wreck of the Carney house sobbing in uncontrollable grief as the flickering flames illuminate the calm figure of King George while others mill around trying to help. Drover walks through the town with King George shadowing him looking out across the bay at the broken burning hulks of ships and walks towards the shattered pub where some people are trying to patch it up while others sit around staring or drinking vacantly. He approaches Ivan who is sweeping up in the bar followed by Magarri. Drover looks around taking in the white drinkers and his nervous black brotherinlaw then turns slowly back to Ivan who stares as tears of grief and rage run down his face while the bar patrons stare as he looks round at Magarri. Magarri enters tentatively removes his hat and approaches the bar as a woman glares at him drawing on a cigarette. Ivan has placed a glass and a tin cup on the bar and tears roll down Drover's cheeks. Reluctantly Ivan replaces the cup with another glass and looks at Magarri raising a glass. Magarri eyeballs him glances at Drover and they all take a drink placing the empty glasses on the bar. Magarri wipes away a tear as Drover frowns in disbelief. Dutton checks the body on the stretcher as Sarah comes in and his eyes bore into her trying to make her understand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Meanwhile a priest is down at the wharf as Drover releases the mooring takes a chain out of Bull's unconscious hand and runs onto the small Mission Island sailing boat while the priest prays. Magarri holds a rifle and Drover stands holding a rope as they get underway while Sarah stares griefstricken at the devastation. The wooden buildings of the Mission burn fiercely in the night as Drover. Magarri and Ivan stand staring on the beach. Drover nods to Magarri who moves off then moves fearfully up the beach weapons raised passing burning buildings and approaching the tree line. Drover looks into a building and sees a row of boys' shoes looks horrified and lowers his rifle as his eyes fill with tears. He turns towards a noise raising his rifle as something moves in the undergrowth and a boy emerges. Drover lowers his weapon as more children come out of the undergrowth and smiles with relief as Magarri beckons the boys forward. Another figure with long hair appears and they embrace throwing their arms around one another. Drover holds the boy out at arm's length grins happily stroking his hair as Nullah hangs his head sadly. A torch beam sweeps across the water towards them as they look around fearfully while armed figures march out of the jungle through the smoke."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Drover staggers distraught through the burning wreck of the Carney house sobbing in uncontrollable grief as the flickering flames illuminate the calm figure of King George while others mill around trying to help. Drover walks through the town with King George shadowing him looking out across the bay at the broken burning hulks of ships and walks towards the shattered pub where some people are trying to patch it up while others sit around staring or drinking vacantly. He approaches Ivan who is sweeping up in the bar followed by Magarri. Drover looks around taking in the white drinkers and his nervous black brotherinlaw then turns slowly back to Ivan who stares as tears of grief and rage run down his face while the bar patrons stare as he looks round at Magarri. Magarri enters tentatively removes his hat and approaches the bar as a woman glares at him drawing on a cigarette. Drover looks into a building and sees a row of boys' shoes looks horrified and lowers his rifle as his eyes fill with tears. He turns towards a noise raising his rifle as something moves in the undergrowth and a boy emerges. Drover lowers his weapon as more children come out of the undergrowth and smiles with relief as Magarri beckons the boys forward. Another figure with long hair appears and they embrace throwing their arms around one another. Drover holds the boy out at arm's length grins happily stroking his hair as Nullah hangs his head sadly. A torch beam sweeps across the water towards them as they look around fearfully while armed figures march out of the jungle through the smoke."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Drover staggers distraught through the burning wreck of the Carney house sobbing in uncontrollable grief as the flickering flames illuminate the calm figure of King George while others mill around trying to help. Drover walks through the town with King George shadowing him looking out across the bay at the broken burning hulks of ships and walks towards the shattered pub where some people are trying to patch it up while others sit around staring or drinking vacantly. Another figure with long hair appears and they embrace throwing their arms around one another. Drover holds the boy out at arm's length grins happily stroking his hair as Nullah hangs his head sadly. A torch beam sweeps across the water towards them as they look around fearfully while armed figures march out of the jungle through the smoke."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Wanderer shuffles, bewildered, through the frozen ruins of the Hawkins mansion, laughing in uncontrollable joy, as the bright lasers illuminate the serene shape of Emperor Harold, while creatures drift around trying to entertain. Wanderer floats through the forest, with Emperor Harold trailing him, gazing out across the stars at the crumpled, icy remains of spaceships, and floats towards the shattered observatory where some aliens are trying to construct it, while others hover around pondering or whistling tunelessly. He confronts Marcus, who's painting inside the cabin, followed by Aldrin. Wanderer scans the area, observing the green scholars and his jittery red sister-in-law, then pivots slowly back to Marcus, who gawks as tears of delight and confusion tumble down his face, while the cabin guests gawk as he surveys Aldrin. Aldrin glides cautiously, removes his scarf, and confronts the cabin, as a man peers at him, tapping on a keyboard. Marcus has placed a plate and a wooden spoon on the counter, and blossoms roll down Wanderer's cheeks. Hesitantly, Marcus replaces the spoon with another plate, and glances at Aldrin, raising a dish. Aldrin scrutinizes him, glances at Wanderer, and they all take a bite, placing the empty plates on the counter. Aldrin brushes away a grin as Wanderer sighs in astonishment. Finley examines the statue on the cart as Lily enters, and her gaze drills into him, attempting to make him know. Meanwhile, a witch is up at the tower, as Wanderer secures the anchor, takes a feather out of Cat's sleeping paw, and jumps onto the giant Saturn floating canoe, while the witch chants. Aldrin holds a spear and Wanderer stands clutching a chain as they sail away, while Lily gazes, elated, at the wonderland. The stone castles of the Saturn blaze brightly in the dawn, as Wanderer, Aldrin, and Marcus stand gawking on the meadow. Wanderer gestures to Aldrin, who drifts away, then drifts cautiously up the meadow, tools lifted, bypassing blazing castles and confronting the mountain range. Wanderer peers into a castle and notices a row of girls' sandals, looks elated, and drops his spear, as his gaze fills with laughter. He pivots towards a sound, lifting his spear as something shakes in the grass, and a rabbit hops out. Wanderer drops his weapon as more creatures hop out of the grass and giggles with excitement as Aldrin waves the rabbits forward. Another creature with long ears materializes, and they pretend to wrestle, covering themselves with mud. Wanderer holds the rabbit out at arm's length, laughs merrily, patting its fur, as Zazu shakes his tail cheerfully. A lantern glow sweeps across the sky towards them as they turn around excitedly, while armored creatures dance out of the forest through the mist."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Drover stumbles through the ruins of the Carney house, overcome with grief, as flames illuminate King George nearby. He walks through the town, observing the destruction and ending up at a shattered pub. With Magarri and Ivan inside, tense racial dynamics unfold as they drink together, sharing a moment of sorrow. Meanwhile, Dutton attends to a body as Sarah arrives, sharing a poignant gaze. At the wharf, Drover joins Magarri and a priest on a Mission Island sailing boat amidst prayers. The Mission's wooden buildings blaze fiercely as Drover, Magarri, and Ivan watch from the beach. Moving cautiously, Drover passes burning structures and discovers abandoned boys' shoes, expressing horror. As children emerge from the undergrowth, Drover is relieved, welcoming them with a smile. He embraces another figure with long hair, stroking the boy's hair joyfully. The mood shifts as armed figures approach, casting torch beams over the water, and the group looks around in fear."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "A torch beam sweeps across the water towards them as they look around fearfully while armed figures march out of the jungle through the smoke Drover holds the boy out at arm's length grins happily stroking his hair as Nullah hangs his head sadly Another figure with long hair appears and they embrace throwing their arms around one another Drover lowers his weapon as more children come out of the undergrowth and smiles with relief as Magarri beckons the boys forward He turns towards a noise raising his rifle as something moves in the undergrowth and a boy emerges Drover looks into a building and sees a row of boys' shoes looks horrified and lowers his rifle as his eyes fill with tears Drover nods to Magarri who moves off then moves fearfully up the beach weapons raised passing burning buildings and approaching the tree line Magarri and Ivan stand staring on the beach The wooden buildings of the Mission burn fiercely in the night as Drover Magarri holds a rifle and Drover stands holding a rope as they get underway while Sarah stares griefstricken at the devastation Meanwhile a priest is down at the wharf as Drover releases the mooring takes a chain out of Bull's unconscious hand and runs onto the small Mission Island sailing boat while the priest prays Dutton checks the body on the stretcher as Sarah comes in and his eyes bore into her trying to make her understand Magarri wipes away a tear as Drover frowns in disbelief Magarri eyeballs him glances at Drover and they all take a drink placing the empty glasses on the bar Reluctantly Ivan replaces the cup with another glass and looks at Magarri raising a glass Ivan has placed a glass and a tin cup on the bar and tears roll down Drover's cheeks Magarri enters tentatively removes his hat and approaches the bar as a woman glares at him drawing on a cigarette Drover looks around taking in the white drinkers and his nervous black brotherinlaw then turns slowly back to Ivan who stares as tears of grief and rage run down his face while the bar patrons stare as he looks round at Magarri He approaches Ivan who is sweeping up in the bar followed by Magarri Drover walks through the town with King George shadowing him looking out across the bay at the broken burning hulks of ships and walks towards the shattered pub where some people are trying to patch it up while others sit around staring or drinking vacantly Drover staggers distraught through the burning wreck of the Carney house sobbing in uncontrollable grief as the flickering flames illuminate the calm figure of King George while others mill around trying to help"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Drover walks through the town with King George shadowing him looking out across the bay at the broken burning hulks of ships and walks towards the shattered pub where some people are trying to patch it up while others sit around staring or drinking vacantly Drover staggers distraught through the burning wreck of the Carney house sobbing in uncontrollable grief as the flickering flames illuminate the calm figure of King George while others mill around trying to help Drover looks around taking in the white drinkers and his nervous black brotherinlaw then turns slowly back to Ivan who stares as tears of grief and rage run down his face while the bar patrons stare as he looks round at Magarri He approaches Ivan who is sweeping up in the bar followed by Magarri Ivan has placed a glass and a tin cup on the bar and tears roll down Drover's cheeks Magarri enters tentatively removes his hat and approaches the bar as a woman glares at him drawing on a cigarette Magarri eyeballs him glances at Drover and they all take a drink placing the empty glasses on the bar Reluctantly Ivan replaces the cup with another glass and looks at Magarri raising a glass Dutton checks the body on the stretcher as Sarah comes in and his eyes bore into her trying to make her understand Magarri wipes away a tear as Drover frowns in disbelief Magarri holds a rifle and Drover stands holding a rope as they get underway while Sarah stares griefstricken at the devastation Meanwhile a priest is down at the wharf as Drover releases the mooring takes a chain out of Bull's unconscious hand and runs onto the small Mission Island sailing boat while the priest prays Magarri and Ivan stand staring on the beach The wooden buildings of the Mission burn fiercely in the night as Drover Drover looks into a building and sees a row of boys' shoes looks horrified and lowers his rifle as his eyes fill with tears Drover nods to Magarri who moves off then moves fearfully up the beach weapons raised passing burning buildings and approaching the tree line Drover lowers his weapon as more children come out of the undergrowth and smiles with relief as Magarri beckons the boys forward He turns towards a noise raising his rifle as something moves in the undergrowth and a boy emerges Drover holds the boy out at arm's length grins happily stroking his hair as Nullah hangs his head sadly Another figure with long hair appears and they embrace throwing their arms around one another A torch beam sweeps across the water towards them as they look around fearfully while armed figures march out of the jungle through the smoke"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Magarri holds a rifle and Drover stands holding a rope as they get underway while Sarah stares griefstricken at the devastation The wooden buildings of the Mission burn fiercely in the night as Drover Magarri and Ivan stand staring on the beach Drover nods to Magarri who moves off then moves fearfully up the beach weapons raised passing burning buildings and approaching the tree line Drover looks into a building and sees a row of boys' shoes looks horrified and lowers his rifle as his eyes fill with tears He turns towards a noise raising his rifle as something moves in the undergrowth and a boy emerges Drover lowers his weapon as more children come out of the undergrowth and smiles with relief as Magarri beckons the boys forward Another figure with long hair appears and they embrace throwing their arms around one another Drover holds the boy out at arm's length grins happily stroking his hair as Nullah hangs his head sadly A torch beam sweeps across the water towards them as they look around fearfully while armed figures march out of the jungle through the smoke Drover staggers distraught through the burning wreck of the Carney house sobbing in uncontrollable grief as the flickering flames illuminate the calm figure of King George while others mill around trying to help Drover walks through the town with King George shadowing him looking out across the bay at the broken burning hulks of ships and walks towards the shattered pub where some people are trying to patch it up while others sit around staring or drinking vacantly He approaches Ivan who is sweeping up in the bar followed by Magarri Drover looks around taking in the white drinkers and his nervous black brotherinlaw then turns slowly back to Ivan who stares as tears of grief and rage run down his face while the bar patrons stare as he looks round at Magarri Magarri enters tentatively removes his hat and approaches the bar as a woman glares at him drawing on a cigarette Ivan has placed a glass and a tin cup on the bar and tears roll down Drover's cheeks Reluctantly Ivan replaces the cup with another glass and looks at Magarri raising a glass Magarri eyeballs him glances at Drover and they all take a drink placing the empty glasses on the bar Magarri wipes away a tear as Drover frowns in disbelief Dutton checks the body on the stretcher as Sarah comes in and his eyes bore into her trying to make her understand Meanwhile a priest is down at the wharf as Drover releases the mooring takes a chain out of Bull's unconscious hand and runs onto the small Mission Island sailing boat while the priest prays"
        }
      ]
    }
  ]
}