{
  "ground_truth": "He picks up something silky and holds it out, smiling apologetically. He passes water to the men on the truck's roof. Holding his dog, he looks at Sarah. She looks out of the passenger window. A kangaroo paw and a dribble of blood run down the windscreen. She peers in horror through her desert glasses, her net veil blowing in the breeze. The hunters lounge happily on top of the truck, which heads out across the flat, sandy desert. They drive along the top of a weir, across a wide river. At night, they camp around a fire. Drover is washing his muscled torso, using water from a bucket. Sarah pops her head out of her tent, staring as the water pours off his rippling muscles. They mime keeping each other warm, and she ducks back into her tent. He walks towards her with a raised eyebrow. He pulls down the waistband of his trousers suggestively. Camels pull a truck with no engine, watched by Goolaj and Magarri. A man falls off the vehicle. He lies in a heap in the dust. Later, he's in the truck next to the horrified Sarah. Drover nods. They drive on across a flat, dusty plain. They're bumping slowly along a rocky track. A girl runs up to them. The boy gallops on the horse, through the sparse trees. The boy arrives at Faraway Downs and reins in the horse, looking out at the approaching truck. The boy runs through the gate to the house and leaps over a fence. They just miss the horse, which rears up. Thick smoke obscures the house. As he loads, the boy climbs into the water tower. Drover walks through the smoke. The boy drops down inside the tower. Sarah sits uncomfortably next to the drunk Kipling. The smoke clears, revealing a large house. Kipling collapses. Drover, shrouded in smoke, walks past a dead cow. Sarah, jaw set, gets out of the truck. She stomps furiously towards the house, as Drover approaches a blazing funeral fire. He examines it thoughtfully and looks around. The boy stretches out his hands. An aboriginal is sitting on the ground. As she enters the house, women hold out buckets of smoking leaves. The boy poses mystically. Sarah strides past members of the household and sees her husband, dead on a table. She reels in shock. He's got a wound in the middle of his chest. His eyes stare glassily. She stares at the Chinese man and reaches out to close Maitland's eyes, but a man's hand does it for her. She eyes the man, her hand poised near Maitland's face. Members of staff hover in the corners of the room. The house is shrouded in a cloud of dust and smoke, a big blaze but tiny in the vast landscape.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He selects up something smooth and holds it out, grinning regretfully. He hands over water to the men on the truck's roof. Clutching his canine, he gazes at Sarah. She glances out of the passenger window. A kangaroo paw and a trickle of blood stream down the windshield. She gapes in horror through her desert goggles, her mesh veil fluttering in the breeze. The hunters recline contentedly on top of the truck, which proceeds out across the level, sandy desert. They drive along the top of a dam, across a broad river. At night, they camp around a blaze. Drover is cleansing his muscled torso, employing water from a pail. Sarah pokes her head out of her shelter, gazing as the water cascades off his rippling muscles. They gesture keeping each other warm, and she ducks back into her shelter. He strides towards her with a raised eyebrow. He tugs down the waistband of his trousers suggestively. Camels pull a truck with no engine, observed by Goolaj and Magarri. A man tumbles off the vehicle. He lies in a pile in the dust. Later, he's in the truck next to the horrified Sarah. Drover acknowledges. They travel on across a flat, dusty plain. They're jostling slowly along a rocky trail. A girl dashes up to them. The boy gallops on the steed, through the sparse trees. The boy arrives at Faraway Downs and reins in the steed, gazing out at the incoming truck. The boy dashes through the gate to the house and jumps over a fence. They just miss the steed, which rears up. Dense smoke hides the house. As he loads, the boy climbs into the water tower. Drover strides through the smoke. The boy descends inside the tower. Sarah sits awkwardly next to the intoxicated Kipling. The smoke dissipates, revealing a large house. Kipling collapses. Drover, enshrouded in smoke, walks past a deceased cow. Sarah, jaw set, exits the truck. She stomps angrily towards the house, as Drover approaches an ablaze funeral pyre. He inspects it thoughtfully and looks around. The boy extends out his hands. An aboriginal is sitting on the ground. As she enters the house, women offer buckets of smoldering leaves. The boy poses mystically. Sarah strides past members of the household and sees her spouse, dead on a table. She reels in shock. He's got a wound in the center of his chest. His eyes gaze glassily. She stares at the Chinese man and reaches out to shut Maitland's eyes, but a man's hand does it for her. She eyes the man, her hand poised near Maitland's face. Members of staff linger in the corners of the room. The house is enshrouded in a cloud of dust and smoke, a large blaze but tiny in the vast landscape."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Something silky is picked up by him and held out while smiling apologetically. Water is passed by him to the men on the truck's roof. His dog is held as he looks at Sarah. Out of the passenger window, she looks. Down the windscreen run a kangaroo paw and a dribble of blood. Horror is peered through her desert glasses by her, with her net veil blowing in the breeze. Happily lounging on top of the truck, the hunters head out across the flat, sandy desert. Along the top of a weir, they drive across a wide river. At night, a camp is made around a fire by them. Drover washes his muscled torso, using water from a bucket. Out of her tent, Sarah pops her head, staring as water pours off his rippling muscles. Mimicking keeping each other warm, she ducks back into her tent. Towards her, he walks with a raised eyebrow. Suggestively, the waistband of his trousers is pulled down by him. A truck with no engine is pulled by camels, watched by Goolaj and Magarri. A vehicle is fallen off by a man. In the dust, he lies in a heap. Later, Sarah is horrified as he is in the truck next to her. A nod is given by Drover. Across a flat, dusty plain, they are driven on. Slowly, they're bumped along a rocky track. Up to them runs a girl. Through the sparse trees, the boy gallops on the horse. At Faraway Downs, the boy arrives and reins in the horse, looking out at the approaching truck. Through the gate to the house, the boy runs and leaps over a fence. The horse is just missed by them, which rears up. The house is obscured by thick smoke. Into the water tower, the boy climbs as loading is done by him. Through the smoke, Drover walks. Inside the tower, the boy is dropped down. Uncomfortably, Sarah sits next to the drunk Kipling. As the smoke clears, a large house is revealed. Kipling collapses. Shrouded in smoke, Drover walks past a dead cow. Out of the truck, Sarah, jaw set, gets. Towards the house, she stomps furiously, while Drover approaches a blazing funeral fire. Thoughtfully, he examines it and looks around. Outstretching his hands, the boy poses. On the ground sits an aboriginal. As she enters the house, buckets of smoking leaves are held out by women. Mystically posing is done by the boy. Past members of the household, Sarah strides and sees her husband, dead on a table. In shock, she reels. A wound in the middle of his chest is on him. Glassily, his eyes stare. At the Chinese man, she stares and reaches out to close Maitland's eyes, but a man's hand is used to do it for her. The man is eyed by her, her hand poised near Maitland's face. In the corners of the room, members of staff hover. A cloud of dust and smoke shrouds the house, a big blaze but tiny in the vast landscape."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He picks up something silky, smiling apologetically, and hands water to the men on the truck's roof. Holding his dog, he looks at Sarah, who peers out the passenger window. A kangaroo paw and blood streak the windscreen. She gazes in horror through her desert glasses, her net veil fluttering. The hunters relax atop the truck as it crosses the flat, sandy desert and a wide river. At night, they camp by a fire. Drover washes his muscled torso with bucket water. Sarah peeks from her tent, watching the water cascade off his muscles. They mime warmth, and she retreats. He approaches with a raised eyebrow, pulling down his waistband suggestively. Camels pull a truck without an engine, observed by Goolaj and Magarri. A man falls off, landing in the dust. Later, he's in the truck beside horrified Sarah. Drover nods as they drive across a dusty plain, bumping along a rocky track. A girl runs up, and a boy gallops through sparse trees, arriving at Faraway Downs. He reins in, watching the truck approach, then runs to the house, leaping a fence. They narrowly miss the rearing horse. Thick smoke obscures the house. The boy climbs into the water tower as Drover walks through smoke. Sarah sits uncomfortably next to the drunk Kipling. The smoke clears, revealing a large house. Kipling collapses. Drover, shrouded in smoke, passes a dead cow. Sarah, determined, exits the truck and heads to the house as Drover examines a funeral fire. The boy stretches his hands, and an aboriginal sits nearby. Inside, women offer buckets of smoking leaves. Sarah strides past household members, seeing her dead husband on a table. She reels in shock at the chest wound and glassy eyes. She reaches to close Maitland's eyes, but a man's hand does it. She eyes him, her hand near Maitland's face. Staff hover in the room's corners. The house is enveloped in dust and smoke, a small blaze in the vast landscape."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He picks up something silky, smiling apologetically, and passes water to men on the truck's roof. Holding his dog, he looks at Sarah, who peers in horror through her desert glasses at a kangaroo paw and blood on the windscreen. The hunters lounge on the truck as it crosses the desert and a wide river. At night, they camp around a fire. Drover washes his torso with bucket water, and Sarah stares as it pours off his muscles. They mime warmth, and she ducks into her tent. He approaches her, pulling down his waistband suggestively. Camels pull a truck, watched by Goolaj and Magarri. A man falls off, later sitting next to horrified Sarah. Drover nods as they drive across a dusty plain and rocky track. A girl runs up, and a boy gallops to Faraway Downs, reining in the horse as the truck approaches. The boy leaps over a fence, narrowly missing the rearing horse. Smoke obscures the house as he climbs into the water tower. Drover walks through smoke, and the boy drops inside the tower. Sarah sits uncomfortably next to drunk Kipling. Smoke clears, revealing a large house. Kipling collapses. Drover walks past a dead cow, and Sarah, jaw set, exits the truck, heading to the house. Drover examines a funeral fire. The boy stretches his hands, and an aboriginal sits on the ground. Women offer smoking leaves as Sarah enters the house, seeing her dead husband on a table. She reels in shock at his chest wound and glassy eyes. She reaches to close Maitland's eyes, but a man's hand does it. She eyes the man, her hand near Maitland's face, as staff hover in the dusty, smoky house."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He carefully picks up something silky and holds it out in front of him, offering it with a smile that is both apologetic and sincere. With a gesture of kindness, he passes bottles of water to the men perched on the roof of the truck. Holding his loyal dog close, he turns his gaze towards Sarah. She, in turn, looks out through the passenger window, her eyes catching sight of a kangaroo paw and a thin dribble of blood that streaks down the windscreen. Peering in horror, she adjusts her desert glasses, the net veil attached to them fluttering gently in the breeze. Meanwhile, the hunters lounge contentedly on top of the truck, which begins to make its way across the flat, sandy expanse of the desert. They continue their journey, driving along the top of a weir that spans a wide, flowing river. As night falls, they set up camp around a crackling fire. Drover, with his muscled torso glistening, washes himself using water from a bucket. Sarah pops her head out of her tent, her eyes fixed on the water cascading off his rippling muscles. They mime the act of keeping each other warm, and she quickly ducks back into her tent. With a raised eyebrow, he walks towards her, pulling down the waistband of his trousers in a suggestive manner. Camels, with their steady gait, pull a truck that lacks an engine, under the watchful eyes of Goolaj and Magarri. Suddenly, a man loses his balance and falls off the vehicle, landing in a heap in the dust. Later, he finds himself in the truck, seated next to a horrified Sarah. Drover gives a nod of acknowledgment. They continue driving across a flat, dusty plain, bumping slowly along a rocky track. A girl runs up to them, while a boy gallops on a horse through the sparse trees. The boy arrives at Faraway Downs, reining in the horse as he looks out at the approaching truck. He runs through the gate to the house and leaps over a fence, narrowly missing the horse, which rears up in surprise. Thick smoke obscures the view of the house. As he loads supplies, the boy climbs into the water tower. Drover walks through the dense smoke. The boy drops down inside the tower for safety. Sarah sits uncomfortably next to the inebriated Kipling. As the smoke clears, it reveals a large, imposing house. Kipling collapses in a drunken stupor. Shrouded in smoke, Drover walks past a dead cow. With her jaw set in determination, Sarah gets out of the truck and stomps furiously towards the house, while Drover approaches a blazing funeral fire. He examines it thoughtfully, taking in the scene around him. The boy stretches out his hands in a gesture of longing. An Aboriginal man sits quietly on the ground. As Sarah enters the house, women hold out buckets filled with smoking leaves. The boy poses mystically, as if in a trance. Sarah strides past members of the household and is confronted with the sight of her husband, lying dead on a table. She reels in shock, noticing the wound in the middle of his chest and his eyes staring glassily. She stares at the Chinese man and reaches out to close Maitland's eyes, but a man's hand does it for her. She eyes the man, her hand still poised near Maitland's face. Members of the staff hover in the corners of the room, the house enveloped in a cloud of dust and smoke, a big blaze that seems tiny in the vast, expansive landscape."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He gingerly lifts an object with a silky texture and holds it out in front of him, offering it with a smile that exudes both a sense of apology and genuine sincerity. With a thoughtful gesture of kindness, he hands bottles of refreshing water to the men perched precariously on the roof of the truck. As he cradles his loyal dog against him, he turns his gaze toward Sarah. In response, she shifts her eyes to look through the passenger window, her gaze catching sight of a kangaroo paw alongside a thin trickle of blood that streaks ominously down the windscreen. Peering in horror, she adjusts her desert glasses, which have a net veil attached that flutters gently in the soft breeze. Meanwhile, the hunters lounge contentedly on top of the truck as it begins to make its way across the flat, sandy expanse of the seemingly endless desert. They continue their journey, carefully navigating along the top of a weir that stretches over a wide, flowing river. As night descends upon them, they set up camp around a crackling fire that provides warmth and light in the encroaching darkness. Drover, his muscled torso glistening in the dim light, washes himself using water from a simple bucket. Sarah pops her head out of her tent, her eyes fixated on the water as it cascades down his rippling muscles. They mime the act of keeping each other warm, prompting her to swiftly duck back inside her tent with an awkward blush. With a raised eyebrow, he saunters towards her, cheekily pulling down the waistband of his trousers in a suggestive manner. Camels, moving with their steady and deliberate gait, pull a truck that is devoid of an engine, all under the watchful eyes of Goolaj and Magarri. Without warning, a man loses his balance and tumbles off the vehicle, landing awkwardly in a heap of dust. Later on, he finds himself seated in the truck next to a horrified Sarah. Drover offers a nod of acknowledgment, and they resume their drive across the flat, dusty plain, bumping slowly along a rugged, rocky track. A young girl dashes up to them, while a boy gallops on a horse through the sparse trees that dot the landscape. The boy arrives at Faraway Downs, pulling on the reins tightly as he surveys the approaching truck. He runs through the gate to the large house and nimbly leaps over a fence, narrowly avoiding the horse, which rears up in surprise. Thick, billowing smoke obscures the view of the house. As he loads supplies, the boy climbs into the towering water tower. Drover walks through the dense, suffocating smoke. The boy crouches and drops down inside the tower for safety and protection. Sarah sits uncomfortably next to the inebriated Kipling. As the smoke slowly dissipates, it reveals a large, imposing house. Kipling collapses into a drunken stupor. With smoke shrouding his movements, Drover walks past the lifeless form of a cow. With her jaw set in determination, Sarah steps out of the truck and stomps angrily toward the house, while Drover approaches a blazing funeral fire. He examines it thoughtfully, taking in the somber scene that surrounds him. The boy stretches out his hands in a gesture filled with longing and desperation. An Aboriginal man sits quietly on the ground, observing the scene. As Sarah makes her way into the house, women hold out buckets filled with smoking leaves. The boy poses mystically, as if caught in a trance-like state. Sarah strides past the household members and is confronted with the shocking sight of her husband, lying lifeless on a table. She reels in shock, her eyes drawn to the gaping wound in the middle of his chest and his eyes staring glassily into the void. She stares at the Chinese man nearby and reaches out to close Maitland's eyes, but a man's hand accomplishes the task for her. She regards the man with curiosity, her hand still hovering near Maitland's face. Members of the staff linger in the corners of the room, the house enveloped in a thick cloud of dust and smoke, a large blaze that seems minuscule within the vast, expansive landscape surrounding them."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He carefully picks up an object with a silky texture, holding it out in front of him while offering a smile that conveys a sense of apology. With a gentle motion, he hands bottles of water to the men perched on the roof of the truck. Cradling his dog in his arms, he turns his gaze towards Sarah, who is seated inside the vehicle. Sarah, meanwhile, directs her attention out of the passenger window, her eyes catching sight of a kangaroo paw and a thin stream of blood that trickles down the windscreen. She peers through her desert glasses, her expression turning to one of horror as her net veil flutters lightly in the breeze. The hunters, appearing relaxed and content, lounge atop the truck as it begins its journey across the expansive, sandy desert. The vehicle makes its way along the top of a weir, traversing a wide river. As night falls, they set up camp around a crackling fire. Drover, standing nearby, uses water from a bucket to wash his well-defined torso, the liquid cascading over his muscles. Sarah, curious, pops her head out of her tent, her eyes fixed on the sight of the water glistening on his skin. They exchange playful gestures, miming the act of keeping each other warm, prompting her to retreat back into her tent. With a playful expression, he walks towards her, one eyebrow raised, and teasingly tugs down the waistband of his trousers. Elsewhere, camels are harnessed to a truck that lacks an engine, observed by Goolaj and Magarri. Suddenly, a man loses his balance and tumbles off the vehicle, landing in a heap on the dusty ground. Later, he finds himself seated in the truck beside Sarah, who looks on in horror. Drover acknowledges the situation with a nod, and they continue their journey across a flat, dusty plain. The truck bumps along slowly on a rocky track, and a girl runs up to meet them. Meanwhile, a boy rides a horse at a gallop through the sparse trees. The boy arrives at Faraway Downs, pulling the horse to a stop as he surveys the approaching truck. He quickly dismounts, runs through the gate towards the house, and leaps over a fence. The truck narrowly avoids the horse, which rears up in response. Thick smoke envelops the house, obscuring it from view. As the boy loads something, he climbs into the water tower. Drover strides through the smoke, and the boy drops down inside the tower for safety. Inside the truck, Sarah sits uncomfortably next to the inebriated Kipling. As the smoke begins to clear, a large house comes into view. Kipling suddenly collapses, and Drover, still shrouded in smoke, walks past the lifeless body of a cow. With her jaw set in determination, Sarah exits the truck and marches angrily towards the house, while Drover approaches a blazing funeral fire, examining it with a thoughtful expression and scanning his surroundings. The boy stretches out his hands in a gesture, and an Aboriginal man sits quietly on the ground. As Sarah enters the house, women offer her buckets filled with smoking leaves. The boy strikes a mystical pose. Sarah strides past the household members and is confronted with the sight of her husband, lifeless on a table. She reels back in shock, noticing the wound in the center of his chest and his eyes staring blankly. She turns her gaze to a Chinese man and reaches out to close Maitland's eyes, but a man's hand intervenes, performing the task for her. She eyes the man, her hand still hovering near Maitland's face, while members of the staff linger in the corners of the room. The house is enveloped in a cloud of dust and smoke, a significant blaze that appears small against the vastness of the surrounding landscape."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He picks up something silky, smiles apologetically, and hands water to the men on the truck's roof. Holding his dog, he exchanges a glance with Sarah, who peers out the passenger window in horror at a kangaroo paw and blood on the windscreen, her veil blowing in the breeze. The hunters lounge on the truck as it traverses the flat, sandy desert and crosses a wide river atop a weir. At night, they camp around a fire, where Drover washes his muscled torso with bucket water, catching Sarah's attention as she peeks from her tent. They mime keeping each other warm before she retreats, and he approaches with a suggestive gesture. Camels pull a truck without an engine, observed by Goolaj and Magarri, as a man falls off, later joining a horrified Sarah in the truck. Drover nods, and they continue across a flat, dusty plain and a rocky track. A girl runs up, and a boy gallops through sparse trees to Faraway Downs, reining in his horse to watch the approaching truck. The boy runs to the house, leaping over a fence, narrowly missing the rearing horse. Thick smoke obscures the house as he climbs into the water tower, and Drover walks through the smoke. The boy drops inside the tower while Sarah sits uncomfortably next to the drunk Kipling, who collapses as the smoke clears to reveal a large house. Drover, shrouded in smoke, passes a dead cow, and Sarah, determined, exits the truck and heads to the house as Drover examines a blazing funeral fire. The boy stretches his hands toward an Aboriginal man sitting on the ground. Inside, women offer buckets of smoking leaves as Sarah strides past household members to find her husband dead on a table, reeling in shock at the wound in his chest and his glassy eyes. She reaches to close Maitland's eyes, but a man's hand does it first, and she eyes him, her hand poised near Maitland's face, while staff hover in the dusty, smoky room, the house a small blaze in the vast landscape."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He picks up something silky, a piece of luxurious fabric imported from China, and holds it out, smiling apologetically. He passes water, scarce and precious in the arid climate, to the men on the truck's roof. Holding his dog, a loyal Australian cattle dog bred for herding and companionship, he looks at Sarah. She looks out of the passenger window. A kangaroo paw, named for its resemblance to the native marsupial's foot, and a dribble of blood run down the windscreen. She peers in horror through her desert glasses, specialized eyewear designed to protect against the harsh sun and sandstorms, her net veil blowing in the breeze. The hunters, skilled in tracking animals in the unforgiving outback, lounge happily on top of the truck, which heads out across the flat, sandy desert of the Northern Territory. They drive along the top of a weir, a man-made barrier that controls the flow of water, across a wide river. At night, they camp around a fire, a traditional Australian bush campfire used for warmth and cooking. Drover is washing his muscled torso, hardened from years of working the land, using water from a bucket. Sarah pops her head out of her tent, staring as the water pours off his rippling muscles. They mime keeping each other warm, an unspoken understanding developing between them, and she ducks back into her tent. He walks towards her with a raised eyebrow, an invitation lingering in the desert night air. He pulls down the waistband of his trousers suggestively, a gesture laden with implication. Camels, introduced to Australia in the 19th century to help explorers traverse the desert, pull a truck with no engine, watched by Goolaj and Magarri, two Aboriginal men skilled in living off the land. A man falls off the vehicle. He lies in a heap in the dust, momentarily stunned. Later, he's in the truck next to the horrified Sarah. Drover nods, a silent reassurance. They drive on across a flat, dusty plain, typical of the Australian outback. They're bumping slowly along a rocky track, a barely there road worn by time and weather. A girl runs up to them, a local child likely familiar with the travelers. The boy gallops on the horse, through the sparse trees that manage to survive in the harsh conditions. The boy arrives at Faraway Downs, a vast cattle station, and reins in the horse, looking out at the approaching truck. The boy runs through the gate to the house and leaps over a fence, agile and full of youthful energy. They just miss the horse, which rears up, startled by the commotion. Thick smoke obscures the house, indicative of the widespread bushfires that frequently threaten this region. As he loads, the boy climbs into the water tower, a strategic vantage point. Drover walks through the smoke, his figure a silhouette against the flames. The boy drops down inside the tower, a safe haven from the chaos outside. Sarah sits uncomfortably next to the drunk Kipling, whose bloodshot eyes and slurred speech betray his inebriation. The smoke clears, revealing a large house, a symbol of colonial wealth and ambition. Kipling collapses, succumbing to his excesses. Drover, shrouded in smoke, walks past a dead cow, an unfortunate casualty of the fire. Sarah, jaw set with determination, gets out of the truck. She stomps furiously towards the house, her anger fuelled by grief and shock, as Drover approaches a blazing funeral fire, an Aboriginal tradition to honor the deceased. He examines it thoughtfully and looks around, as if searching for answers in the flames. The boy stretches out his hands, a gesture of communication or prayer. An Aboriginal, wise in the ways of the land, is sitting on the ground. As she enters the house, women hold out buckets of smoking leaves, used in ceremonial rituals to cleanse and purify. The boy poses mystically, embodying the spirit and stories of his ancestors. Sarah strides past members of the household and sees her husband, dead on a table, the victim of a sudden and violent event. She reels in shock, the weight of her loss hitting her. He's got a wound in the middle of his chest, the likely cause of his untimely death. His eyes stare glassily, the life drained from them. She stares at the Chinese man, part of the multicultural workforce that built this region, and reaches out to close Maitland's eyes, but a man's hand does it for her, a gesture of unexpected compassion. She eyes the man, her hand poised near Maitland's face. Members of staff hover in the corners of the room, unsure and uneasy. The house is shrouded in a cloud of dust and smoke, a big blaze but tiny in the vast landscape of the outback."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He picks up something silky and holds it out smiling apologetically. He passes water to the men on the truck's roof. Holding his dog he looks at Sarah. She looks out of the passenger window. A kangaroo paw and a dribble of blood run down the windscreen. She peers in horror through her desert glasses her net veil blowing in the breeze. The hunters lounge happily on top of the truck which heads out across the flat sandy desert. They drive along the top of a weir across a wide river. At night they camp around a fire. Drover is washing his muscled torso using water from a bucket. Sarah pops her head out of her tent staring as the water pours off his rippling muscles. They mime keeping each other warm and she ducks back into her tent. He walks towards her with a raised eyebrow. He pulls down the waistband of his trousers suggestively. Camels pull a truck with no engine watched by Goolaj and Magarri. A man falls off the vehicle. He lies in a heap in the dust. Later he is in the truck next to the horrified Sarah. Drover nods. They drive on across a flat dusty plain. They are bumping slowly along a rocky track. A girl runs up to them. The boy gallops on the horse through the sparse trees. The boy arrives at Faraway Downs and reins in the horse looking out at the approaching truck. The boy runs through the gate to the house and leaps over a fence. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. They just miss the horse which rears up. Thick smoke obscures the house. As he loads the boy climbs into the water tower. Drover walks through the smoke. The boy drops down inside the tower. Sarah sits uncomfortably next to the drunk Kipling. The smoke clears revealing a large house. Kipling collapses. Drover shrouded in smoke walks past a dead cow. Sarah jaw set gets out of the truck. She stomps furiously towards the house as Drover approaches a blazing funeral fire. He examines it thoughtfully and looks around. The boy stretches out his hands. An aboriginal is sitting on the ground. As she enters the house women hold out buckets of smoking leaves. The boy poses mystically. Sarah strides past members of the household and sees her husband dead on a table. She reels in shock. He is got a wound in the middle of his chest. His eyes stare glassily. She stares at the Chinese man and reaches out to close Maitland's eyes but a man's hand does it for her. She eyes the man her hand poised near Maitland's face. Members of staff hover in the corners of the room. The house is shrouded in a cloud of dust and smoke. a big blaze but tiny in the vast landscape."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He picks up something silky and holds it out smiling apologetically. He passes water to the men on the truck's roof. Holding his dog he looks at Sarah. She looks out of the passenger window. A kangaroo paw and a dribble of blood run down the windscreen. She peers in horror through her desert glasses her net veil blowing in the breeze. The hunters lounge happily on top of the truck which heads out across the flat sandy desert. They drive along the top of a weir across a wide river. At night they camp around a fire. Drover is washing his muscled torso using water from a bucket. Sarah pops her head out of her tent staring as the water pours off his rippling muscles. They mime keeping each other warm and she ducks back into her tent. He walks towards her with a raised eyebrow. He pulls down the waistband of his trousers suggestively. Camels pull a truck with no engine watched by Goolaj and Magarri. A man falls off the vehicle. He lies in a heap in the dust. Later he is in the truck next to the horrified Sarah. Drover nods. They drive on across a flat dusty plain. They are bumping slowly along a rocky track. A girl runs up to them. The boy gallops on the horse through the sparse trees. The boy arrives at Faraway Downs and reins in the horse looking out at the approaching truck. The boy runs through the gate to the house and leaps over a fence. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. They just miss the horse which rears up. Thick smoke obscures the house. As he loads the boy climbs into the water tower. Drover walks through the smoke. The boy drops down inside the tower. Sarah sits uncomfortably next to the drunk Kipling. The smoke clears revealing a large house. Kipling collapses. Drover shrouded in smoke walks past a dead cow. Sarah jaw set gets out of the truck. She stomps furiously towards the house as Drover approaches a blazing funeral fire. He examines it thoughtfully and looks around. The boy stretches out his hands. An aboriginal is sitting on the ground. As she enters the house women hold out buckets of smoking leaves. The boy poses mystically. Sarah strides past members of the household and sees her husband dead on a table. She reels in shock. He is got a wound in the middle of his chest. His eyes stare glassily. She stares at the Chinese man and reaches out to close Maitland's eyes but a man's hand does it for her. She eyes the man her hand poised near Maitland's face. Members of staff hover in the corners of the room. The house is shrouded in a cloud of dust and smoke. a big blaze but tiny in the vast landscape."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He picks up something silky and holds it out smiling apologetically. He passes water to the men on the truck's roof. Holding his dog he looks at Sarah. She looks out of the passenger window. A kangaroo paw and a dribble of blood run down the windscreen. She peers in horror through her desert glasses her net veil blowing in the breeze. The hunters lounge happily on top of the truck which heads out across the flat sandy desert. They drive along the top of a weir across a wide river. At night they camp around a fire. Drover is washing his muscled torso using water from a bucket. Sarah pops her head out of her tent staring as the water pours off his rippling muscles. They mime keeping each other warm and she ducks back into her tent. He walks towards her with a raised eyebrow. An aboriginal is sitting on the ground. As she enters the house women hold out buckets of smoking leaves. The boy poses mystically. Sarah strides past members of the household and sees her husband dead on a table. She reels in shock. He is got a wound in the middle of his chest. His eyes stare glassily. She stares at the Chinese man and reaches out to close Maitland's eyes but a man's hand does it for her. She eyes the man her hand poised near Maitland's face. Members of staff hover in the corners of the room. The house is shrouded in a cloud of dust and smoke. a big blaze but tiny in the vast landscape."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He picks up something silky and holds it out smiling apologetically. He passes water to the men on the truck's roof. Holding his dog he looks at Sarah. She looks out of the passenger window. A kangaroo paw and a dribble of blood run down the windscreen. She stares at the Chinese man and reaches out to close Maitland's eyes but a man's hand does it for her. She eyes the man her hand poised near Maitland's face. Members of staff hover in the corners of the room. The house is shrouded in a cloud of dust and smoke. a big blaze but tiny in the vast landscape."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat picks up something furry and holds it out, grinning sheepishly. The cat passes juice to the squirrels on the ship's mast. Holding his parrot, the cat looks at Lucy. Lucy gazes out of the driver window. A fox tail and a splash of paint slide down the windshield. Lucy peers in amusement through her ocean goggles, her silk scarf fluttering in the gust. The gardeners lounge lazily on top of the ship, which sails out across the wide, green ocean. They glide along the top of a dam, across a narrow bridge. At dawn, they nap around a lantern. Carpenter is scrubbing his tattooed legs, using milk from a pitcher. Lucy pops her head out of her cabin, gawking as the milk dribbles off his gleaming tattoos. They mimic keeping each other cozy, and she ducks back into her cabin. The cat strolls towards her with a curious smile. The cat pulls up the brim of his hat teasingly. Elephants tug a canoe with no paddles, watched by Kookaburra and Koala. A woman tumbles off the machine. She lands in a heap in the gravel. Eventually, she's in the canoe next to the startled Lucy. Carpenter winks. They sail on across a narrow, grassy valley. They're gliding smoothly along a sandy path. A dolphin swims up to them. The monkey dashes on the ostrich, through the dense bushes. The monkey arrives at Distant Plains and reigns in the ostrich, peering out at the rolling canoe. The monkey dashes through the gate to the barn and vaults over a wall. They narrowly miss the ostrich, which bucks up. Dense fog blankets the barn. As he loads, the monkey scrambles into the watchtower. Carpenter strolls through the fog. The monkey drops down inside the tower. Lucy sits awkwardly next to the sober Hemingway. The fog lifts, revealing a small barn. Hemingway stands. Carpenter, cloaked in fog, strolls past a sleeping chicken. Lucy, mouth open, gets out of the canoe. She strides cheerfully towards the barn, as Carpenter approaches a crackling bonfire. He inspects it curiously and glances around. The monkey stretches out his toes. A musician is lying on the bench. As she enters the barn, children hold out baskets of steaming rocks. The monkey stands gracefully. Lucy strides past members of the crew and spots her son, napping on a chair. She sways in surprise. He's got a bruise on the top of his head. His eyes blink sleepily. She glances at the Japanese woman and extends a hand to close Dennis's eyes, but a dolphin's fin does it for her. She regards the dolphin, her paw poised near Dennis's face. Members of the audience linger in the shadows of the barn. The barn is engulfed in a storm of mist and fog, a tiny drizzle but massive in the narrow alley."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A man smiles apologetically while handing a silk item and water to men on a truck. He holds his dog, glancing at Sarah, who peers anxiously out the window at a kangaroo paw and blood on the windscreen. Hunters relax on the truck as it travels through the desert and across a river. At night, Drover washes under a bucket's water, catching Sarah's attention. She retreats into her tent as Drover approaches suggestively. Meanwhile, camels pull an engine-less truck, and a man falls off, later ending up beside a horrified Sarah. They drive across a plain, encountering a girl and a boy on horseback at Faraway Downs. The boy narrowly avoids the truck, then climbs into a water tower amid smoke. Sarah sits next to a drunken Kipling as smoke clears to reveal a large house. Kipling collapses; Drover walks past a dead cow towards a funeral fire. Sarah, angry, heads to the house filled with smoking leaves, discovering her husband dead with a chest wound. Shocked, she reaches to close his eyes, but another man does it, as staff linger in the smoky room."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "a big blaze but tiny in the vast landscape The house is shrouded in a cloud of dust and smoke  Members of staff hover in the corners of the room  She eyes the man her hand poised near Maitland's face  She stares at the Chinese man and reaches out to close Maitland's eyes but a man's hand does it for her  His eyes stare glassily  He's got a wound in the middle of his chest  She reels in shock  Sarah strides past members of the household and sees her husband dead on a table  The boy poses mystically  As she enters the house women hold out buckets of smoking leaves  An aboriginal is sitting on the ground  The boy stretches out his hands  He examines it thoughtfully and looks around  She stomps furiously towards the house as Drover approaches a blazing funeral fire  Sarah jaw set gets out of the truck  Drover shrouded in smoke walks past a dead cow  Kipling collapses  The smoke clears revealing a large house  Sarah sits uncomfortably next to the drunk Kipling  The boy drops down inside the tower  Drover walks through the smoke  As he loads the boy climbs into the water tower  Thick smoke obscures the house  They just miss the horse which rears up  The boy runs through the gate to the house and leaps over a fence  The boy arrives at Faraway Downs and reins in the horse looking out at the approaching truck  The boy gallops on the horse through the sparse trees  A girl runs up to them  They're bumping slowly along a rocky track  They drive on across a flat dusty plain  Drover nods  Later he's in the truck next to the horrified Sarah  He lies in a heap in the dust  A man falls off the vehicle  Camels pull a truck with no engine watched by Goolaj and Magarri  He pulls down the waistband of his trousers suggestively  He walks towards her with a raised eyebrow  They mime keeping each other warm and she ducks back into her tent  Sarah pops her head out of her tent staring as the water pours off his rippling muscles  Drover is washing his muscled torso using water from a bucket  At night they camp around a fire  They drive along the top of a weir across a wide river  The hunters lounge happily on top of the truck which heads out across the flat sandy desert  She peers in horror through her desert glasses her net veil blowing in the breeze  A kangaroo paw and a dribble of blood run down the windscreen  She looks out of the passenger window  Holding his dog he looks at Sarah  He passes water to the men on the truck's roof  He picks up something silky and holds it out smiling apologetically "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He passes water to the men on the truck's roof He picks up something silky and holds it out smiling apologetically She looks out of the passenger window Holding his dog he looks at Sarah She peers in horror through her desert glasses her net veil blowing in the breeze A kangaroo paw and a dribble of blood run down the windscreen They drive along the top of a weir across a wide river The hunters lounge happily on top of the truck which heads out across the flat sandy desert Drover is washing his muscled torso using water from a bucket At night they camp around a fire They mime keeping each other warm and she ducks back into her tent Sarah pops her head out of her tent staring as the water pours off his rippling muscles He pulls down the waistband of his trousers suggestively He walks towards her with a raised eyebrow A man falls off the vehicle Camels pull a truck with no engine watched by Goolaj and Magarri Later he is in the truck next to the horrified Sarah He lies in a heap in the dust They drive on across a flat dusty plain Drover nods A girl runs up to them They are bumping slowly along a rocky track The boy arrives at Faraway Downs and reins in the horse looking out at the approaching truck The boy gallops on the horse through the sparse trees They just miss the horse which rears up The boy runs through the gate to the house and leaps over a fence As he loads the boy climbs into the water tower Thick smoke obscures the house The boy drops down inside the tower Drover walks through the smoke The smoke clears revealing a large house Sarah sits uncomfortably next to the drunk Kipling Drover shrouded in smoke walks past a dead cow Kipling collapses She stomps furiously towards the house as Drover approaches a blazing funeral fire Sarah jaw set gets out of the truck The boy stretches out his hands He examines it thoughtfully and looks around As she enters the house women hold out buckets of smoking leaves An aboriginal is sitting on the ground Sarah strides past members of the household and sees her husband dead on a table The boy poses mystically He is got a wound in the middle of his chest She reels in shock She stares at the Chinese man and reaches out to close Maitland's eyes but a man's hand does it for her His eyes stare glassily Members of staff hover in the corners of the room She eyes the man her hand poised near Maitland's face a big blaze but tiny in the vast landscape The house is shrouded in a cloud of dust and smoke"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "They just miss the horse which rears up  Thick smoke obscures the house  As he loads the boy climbs into the water tower  Drover walks through the smoke  The boy drops down inside the tower  Sarah sits uncomfortably next to the drunk Kipling  The smoke clears revealing a large house  Kipling collapses  Drover shrouded in smoke walks past a dead cow  Sarah jaw set gets out of the truck  She stomps furiously towards the house as Drover approaches a blazing funeral fire  He examines it thoughtfully and looks around  The boy stretches out his hands  An aboriginal is sitting on the ground  As she enters the house women hold out buckets of smoking leaves  The boy poses mystically  Sarah strides past members of the household and sees her husband dead on a table  She reels in shock  He's got a wound in the middle of his chest  His eyes stare glassily  She stares at the Chinese man and reaches out to close Maitland's eyes but a man's hand does it for her  She eyes the man her hand poised near Maitland's face  Members of staff hover in the corners of the room  The house is shrouded in a cloud of dust and smoke  a big blaze but tiny in the vast landscape He picks up something silky and holds it out smiling apologetically  He passes water to the men on the truck's roof  Holding his dog he looks at Sarah  She looks out of the passenger window  A kangaroo paw and a dribble of blood run down the windscreen  She peers in horror through her desert glasses her net veil blowing in the breeze  The hunters lounge happily on top of the truck which heads out across the flat sandy desert  They drive along the top of a weir across a wide river  At night they camp around a fire  Drover is washing his muscled torso using water from a bucket  Sarah pops her head out of her tent staring as the water pours off his rippling muscles  They mime keeping each other warm and she ducks back into her tent  He walks towards her with a raised eyebrow  He pulls down the waistband of his trousers suggestively  Camels pull a truck with no engine watched by Goolaj and Magarri  A man falls off the vehicle  He lies in a heap in the dust  Later he's in the truck next to the horrified Sarah  Drover nods  They drive on across a flat dusty plain  They're bumping slowly along a rocky track  A girl runs up to them  The boy gallops on the horse through the sparse trees  The boy arrives at Faraway Downs and reins in the horse looking out at the approaching truck  The boy runs through the gate to the house and leaps over a fence "
        }
      ]
    }
  ]
}