{
  "ground_truth": "The boy watches from long grass. He gives a smile as dry as the flat plains which stretch out to the hills on the horizon, and accompanies Sarah down the hill, away from the cemetery. The sun sets on the darkening plains and hills. Darkness settles on the house and buildings of Faraway Downs. The lights go out. Sarah is asleep in bed, moonlight filtering through the curtains. Fletcher looks out at the night, and urges an Aboriginal lady indoors. As King George chants by a fire, Sarah sits bolt upright in bed and lights a lamp. Something moves beneath the steps she's standing on, and King George dances by his hilltop fire. She hurries indoors to find the boy in her bedroom. As he strikes a pose, the curtains billowed. He grins broadly. Sarah's intrigued. A shadow falls over the porch. Fletcher peers in through the shutters, but seeing nothing and leaves. Sarah stands up and looks around the room. She goes to the window, accompanied by Nullah, and peers out. She turns with a start. The curtain is billowing. Clothes hang on a line in the morning sun. Fletcher emerges from his cabin. Nullah's mother hovers in the doorway. He looks around the homestead and scratches his head. She follows him out. Wearing an orange dress, she looks at Fletcher, then walks away from him and the cabin. He idly tosses a stone and watches her go. The sun rises in the clear blue sky. Sarah walks out onto the veranda of the main house. Nullah follows her. He scampers off, as two riders approach. Nullah, hiding behind the gate, opens it. Nullah walks slowly to him. She smiles and nods nervously. Nullah pulls away from the Chinese cook. He's climbed up and removed a chain holding the blades in place. The windmill swings around and starts to turn. They all stare as rusty water is pumped from a pipe. Fletcher chases after the boy. Nullah leaps over the fence before being grabbed by the man. He holds the boy's mother aside and hits him again as Sarah strides up. She cracks him across the face with a riding crop. She points a finger with steely determination. He reaches his truck, then looks around. Flynn tilts his head stubbornly. He backs up as Flynn joins Sarah. He drives off into the dusty distance. His Drovers abandon the cattle and ride off with him. Sing Song watches without emotion. Nullah, his mother, and her friend comfort each other and also join Sarah. She looks at Flynn, who respectfully removes his hat. She looks at her little entourage, and turns and sheds her eyes from the sun. Sarah sits at her messy desk.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The lad observes from tall vegetation. He offers a grin as arid as the level fields which extend out to the knolls on the skyline, and escorts Sarah down the incline, away from the graveyard. The sun descends on the dimming fields and knolls. Gloom settles on the dwelling and structures of Faraway Downs. The lights extinguish. Sarah is slumbering in bed, moonlight passing through the drapes. Fletcher gazes out at the evening, and urges an Aboriginal woman indoors. As King George intones by a blaze, Sarah sits bolt upright in bed and ignites a lamp. Something stirs beneath the steps she's standing on, and King George dances by his hilltop blaze. She rushes indoors to locate the lad in her chamber. As he strikes a stance, the drapes billowed. He beams broadly. Sarah's captivated. A shadow descends over the veranda. Fletcher peers in through the shutters, but perceiving nothing and departs. Sarah rises and glances around the chamber. She goes to the casement, accompanied by Nullah, and peers out. She turns with a start. The drape is billowing. Garments hang on a line in the morning sun. Fletcher emerges from his cabin. Nullah's mother lingers in the entryway. He glances around the homestead and scratches his head. She follows him out. Wearing an orange gown, she glances at Fletcher, then strides away from him and the cabin. He idly tosses a pebble and observes her depart. The sun rises in the clear azure sky. Sarah strides out onto the veranda of the principal house. Nullah accompanies her. He scampers off, as two equestrians approach. Nullah, concealing behind the gate, opens it. Nullah ambles slowly to him. She grins and nods apprehensively. Nullah pulls away from the Chinese cook. He's climbed up and detached a chain holding the blades in place. The windmill swivels around and begins to turn. They all gaze as rusty water is pumped from a conduit. Fletcher pursues after the lad. Nullah leaps over the barrier before being seized by the man. He holds the lad's mother aside and hits him again as Sarah strides up. She strikes him across the visage with a riding crop. She indicates a finger with steely resolve. He reaches his truck, then glances around. Flynn tilts his head obstinately. He retreats as Flynn joins Sarah. He drives off into the dusty expanse. His Drovers forsake the livestock and ride off with him. Sing Song observes without emotion. Nullah, his mother, and her companion console each other and also join Sarah. She glances at Flynn, who respectfully removes his hat. She glances at her small entourage, and turns and shields her eyes from the sun. Sarah sits at her chaotic desk."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The long grass is watched by the boy. A smile as dry as the flat plains which stretch out to the hills on the horizon is given by him, and Sarah is accompanied down the hill, away from the cemetery. The darkening plains and hills are set upon by the sun. The house and buildings of Faraway Downs are settled in darkness. The lights are turned off. Sarah sleeps in bed, with moonlight filtering through the curtains. The night is looked out at by Fletcher, and an Aboriginal lady is urged indoors by him. As King George chants by a fire, the lamp is lit by Sarah who sits bolt upright in bed. Something is moved beneath the steps she's standing on, and King George dances by his hilltop fire. Indoors is hurried by her to find the boy in her bedroom. A pose is struck by him, and the curtains billow. A broad grin is given by him. Sarah is intrigued. The porch is shadowed. The shutters are peered in through by Fletcher, but nothing is seen by him, so he leaves. The room is looked around by Sarah as she stands up. The window is gone to by her, accompanied by Nullah, and they peer out. She turns with a start. The billowing curtain is observed by her. The morning sun sees clothes hung on a line. Fletcher emerges from his cabin. Nullah's mother is hovered in the doorway. The homestead is looked around and his head is scratched by him. She follows him out. An orange dress is worn by her, and she looks at Fletcher, then walks away from him and the cabin. A stone is idly tossed by him, and her departure is watched. The clear blue sky sees the sun rise. The veranda of the main house is walked out onto by Sarah. Nullah follows her. As two riders approach, off is scampered by him. Nullah opens the gate, hiding behind it. Nullah slowly walks to him. A smile and a nervous nod are given by her. Nullah pulls away from the Chinese cook. The chain holding the blades in place is climbed up to and removed by him. The windmill is swung around and started to turn. Rusty water is pumped from a pipe, witnessed by all. The boy is chased after by Fletcher. The fence is leaped over by Nullah before the man grabs him. The boy’s mother is held aside and hit again by him as Sarah strides up. Fletcher is cracked across the face with a riding crop by her. A finger is pointed with steely determination by her. His truck is reached by him, then he looks around. Flynn tilts his head stubbornly. Flynn joins Sarah as he backs up. The dusty distance sees him driven off into it. His Drovers abandon the cattle and ride off with him. Sing Song watches without emotion. Nullah, his mother, and her friend comfort each other and also join Sarah. Flynn is looked at by her, and his hat is respectfully removed by him. Her little entourage is looked at by her, and then her eyes are shed from the sun. Her messy desk is sat at by Sarah."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The boy watches from tall grass, smiling as dryly as the flat plains stretching to distant hills, and walks with Sarah down from the cemetery. The sun sets over the darkening plains. Darkness falls on Faraway Downs; lights go out. Sarah sleeps, moonlight filtering in. Fletcher looks outside and urges an Aboriginal woman in. As King George chants by fire, Sarah bolts upright and lights a lamp. Something moves beneath her. King George dances on the hill. She rushes inside to find the boy in her room. He poses as the curtains billow and grins. Sarah is intrigued. A shadow crosses the porch. Fletcher peers in but, seeing nothing, walks off. Sarah rises, looks around, and goes to the window with Nullah. She turns suddenly. The curtain billows again. Clothes sway in the morning sun. Fletcher exits his cabin. Nullah’s mother lingers in the doorway, then follows him. In an orange dress, she looks at him and walks away. He tosses a stone, watching her. The sun rises in a blue sky. Sarah steps onto the veranda. Nullah follows but scampers off as two riders near. Hiding behind a gate, he opens it. Nullah walks toward them. Sarah smiles nervously. Nullah pulls from the Chinese cook, who’s climbed the windmill and removes a chain. The blades spin, pumping rusty water. Fletcher chases Nullah, who jumps a fence before being caught. He shoves the boy’s mother and hits Nullah. Sarah storms in and strikes him with a riding crop, pointing firmly. He reaches his truck and pauses. Flynn stands firm. Fletcher backs off, and Flynn joins Sarah. Fletcher drives into the dust. His Drovers abandon the cattle and ride with him. Sing Song watches blankly. Nullah, his mother, and her friend comfort one another and join Sarah. Flynn doffs his hat as Sarah looks at him, then turns away, shielding her eyes from the sun. Sarah sits at her messy desk."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The boy watches, smiling from tall grass, as dry as the plains. He walks with Sarah from the cemetery as the sun sets, darkness enveloping Faraway Downs. Sarah sleeps; moonlight through curtains. Fletcher urges an Aboriginal woman inside. King George chants by fire. Sarah wakes, finding the boy in her room, posing as curtains billow. Fletcher peers in, sees nothing, and leaves. With Nullah, she looks out the window, startled. Morning sun shines on laundry. Fletcher exits; Nullah’s mother follows him in an orange dress. He tosses a stone, watching her leave. The sun rises; Sarah steps onto the veranda, Nullah follows, then runs off. Two riders approach; Nullah opens the gate. Sarah smiles, nodding nervously. Nullah pulls from the Chinese cook, unchains blades, windmill turns, rusty water pumps. Fletcher chases Nullah, catches him, holding back the mother. Sarah arrives, strikes Fletcher with a riding crop, points firmly. He reaches his truck, glances around, leaves. Flynn joins Sarah; they drive off in dust. Drovers abandon cattle, follow. Sing Song watches. Nullah, his mother, and her friend comfort each other and join Sarah. She sees Flynn, who doffs his hat. Sarah turns to her group, shielding her eyes from the sun, then sits at her cluttered desk."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The young boy observes quietly from the cover of the long, swaying grass. His smile is as dry and subtle as the expansive flat plains that stretch endlessly toward the distant hills on the horizon. With a gentle demeanor, he accompanies Sarah as they make their way down the hill, moving away from the solemn cemetery. As the sun begins its descent, casting a warm glow over the darkening plains and hills, darkness gradually envelops the house and surrounding buildings of Faraway Downs. One by one, the lights flicker out. Sarah, now resting in her bed, is bathed in the soft glow of moonlight filtering delicately through the curtains. Meanwhile, Fletcher stands gazing out into the night, urging an Aboriginal lady to come indoors. As King George chants rhythmically by a crackling fire, Sarah suddenly sits bolt upright in her bed, quickly lighting a lamp. She senses movement beneath the steps she is standing on, while King George continues his dance by the hilltop fire. In a hurry, she rushes indoors, only to find the boy already in her bedroom. As he strikes a confident pose, the curtains billow dramatically. He grins broadly, and Sarah finds herself intrigued. A shadow ominously falls over the porch. Fletcher peers cautiously through the shutters, but upon seeing nothing, he departs. Sarah stands up, casting a curious glance around the room. Accompanied by Nullah, she approaches the window and peers out. Suddenly, she turns with a start, noticing the curtain billowing once more. Outside, clothes hang lazily on a line, basking in the morning sun. Fletcher emerges from his cabin, and Nullah's mother hovers uncertainly in the doorway. He surveys the homestead, scratching his head in thought. She follows him outside, wearing an eye-catching orange dress. She looks at Fletcher, then decisively walks away from him and the cabin. He idly tosses a stone, watching her as she goes. The sun rises majestically in the clear blue sky. Sarah steps out onto the veranda of the main house, with Nullah trailing behind her. He quickly scampers off as two riders approach. Nullah, hiding cleverly behind the gate, opens it with care. He walks slowly toward him, and she smiles, nodding nervously. Nullah pulls away from the Chinese cook, having climbed up to remove a chain holding the windmill blades in place. The windmill swings around, creaking to life, and begins to turn. They all watch in awe as rusty water is pumped from a pipe. Fletcher chases after the boy, but Nullah leaps over the fence just before being grabbed by the man. Fletcher holds the boy's mother aside and strikes him again, just as Sarah strides up with purpose. She cracks him across the face with a riding crop, pointing a finger with steely determination. He retreats to his truck, looking around cautiously. Flynn tilts his head stubbornly, backing up as he joins Sarah. Fletcher drives off into the dusty distance, his Drovers abandoning the cattle to ride off with him. Sing Song watches the scene unfold without a trace of emotion. Nullah, his mother, and her friend find comfort in each other and join Sarah. She looks at Flynn, who respectfully removes his hat in acknowledgment. She gazes at her little entourage, then turns, shielding her eyes from the bright sun. Sarah sits at her cluttered desk, deep in thought."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The young boy observes quietly and with great attentiveness from his hidden vantage point within the cover of the tall, long, swaying grass. His smile is as dry and subtle as the expansive flat plains that stretch seemingly and endlessly toward the distant, gently rolling hills on the horizon. With a gentle and kind demeanor, he accompanies Sarah as they both make their way down the hill, moving gradually away from the solemn, silent cemetery. As the sun begins its slow descent, casting a warm, golden glow over the darkening plains and surrounding hills, darkness gradually and inevitably envelops the house and the surrounding buildings of Faraway Downs. One by one, the small lights flicker out and are extinguished. Sarah, now resting comfortably in her bed, is bathed in the soft, serene glow of moonlight filtering delicately and gently through the thin curtains. Meanwhile, outside, Fletcher stands gazing intently into the night, urging and coaxing an Aboriginal lady to come indoors. As King George rhythmically chants his incantations by a crackling, lively fire, Sarah suddenly sits bolt upright in her bed, quickly lighting a lamp with a sense of urgency. She senses movement beneath the very steps she is standing on, while King George persists with his dance by the hilltop fire. In a hurry, she rushes indoors, only to find the boy already standing confidently in her bedroom. As he strikes a confident, self-assured pose, the curtains billow dramatically in the breeze. He grins broadly, and Sarah finds herself intrigued and fascinated by him. A shadow ominously falls across the porch. Fletcher peers cautiously and curiously through the shutters, but upon seeing nothing of concern, he departs. Sarah stands up, casting a curious glance around the room. Accompanied by Nullah, she approaches the window and peers out into the distance. Suddenly, she turns with a start, noticing the curtain billowing once more. Outside, clothes hang lazily on a line, basking in the warm embrace of the morning sun. Fletcher emerges from his cabin, and Nullah's mother hovers uncertainly and hesitantly in the doorway. He surveys the homestead, scratching his head thoughtfully. She follows him outside, wearing an eye-catching and vibrant orange dress. She looks at Fletcher, then decisively and firmly walks away from both him and the cabin. He idly tosses a small stone, watching her intently as she goes. The sun rises majestically and grandly in the clear blue sky. Sarah steps out onto the veranda of the main house, with Nullah trailing closely behind her. He quickly scampers off as two riders approach the scene. Nullah, hiding cleverly and strategically behind the gate, opens it with care. He walks slowly and cautiously toward him, and she smiles, nodding nervously. Nullah pulls away from the Chinese cook, having climbed nimbly up to remove a chain holding the windmill blades in place. The windmill swings around, creaking audibly to life, and begins to turn steadily. They all watch in awe and astonishment as rusty water is pumped up from the pipe. Fletcher chases determinedly after the boy, but Nullah leaps deftly over the fence just before being grabbed by the man. Fletcher holds the boy's mother aside and strikes him again, just as Sarah strides up with purpose and determination. She cracks him across the face with a riding crop, pointing a finger with steely resolve. He retreats hastily to his truck, looking around cautiously and warily. Flynn tilts his head stubbornly, backing up as he joins Sarah. Fletcher drives off into the dusty, vast distance, his Drovers abandoning the cattle to ride off with him. Sing Song watches the scene unfold without a trace or hint of emotion. Nullah, his mother, and her friend find solace and comfort in each other and join Sarah. She looks at Flynn, who respectfully removes his hat in acknowledgment of the situation. She gazes at her little entourage, then turns slowly, shielding her eyes from the bright and glaring sun. Sarah sits at her cluttered desk, deep in reflective thought."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The boy crouches low, hidden within the long grass, his eyes fixed on the scene before him. He allows a smile to form on his lips, a smile as dry and expansive as the flat plains that extend endlessly toward the distant hills on the horizon. With a sense of companionship, he joins Sarah, and together they make their way down the hill, moving away from the solemnity of the cemetery. As they descend, the sun begins its slow retreat, casting a warm glow over the darkening plains and hills, eventually giving way to the encroaching darkness that envelops the house and buildings of Faraway Downs. One by one, the lights flicker out, leaving the landscape in shadow. Inside, Sarah lies asleep in her bed, the soft glow of moonlight filtering gently through the curtains. Meanwhile, Fletcher stands at a window, peering out into the night, and gestures for an Aboriginal lady to come inside. Elsewhere, King George chants rhythmically by a fire, his voice carrying through the night air. Suddenly, Sarah jolts upright in her bed, her heart racing, and quickly lights a lamp to dispel the shadows. She senses movement beneath the steps she stands on, while King George continues his dance by the hilltop fire. Alarmed, she hurries indoors, her mind racing, only to find the boy standing in her bedroom. He strikes a confident pose, and as he does, the curtains billow dramatically. His grin widens, full of mischief and intrigue, capturing Sarah's attention. A shadow looms over the porch, and Fletcher, curious, peers in through the shutters. Finding nothing amiss, he turns away and leaves. Sarah rises from her seat, her eyes scanning the room for any signs of disturbance. She moves to the window, with Nullah by her side, and peers out into the night. Suddenly, she turns with a start, noticing the curtain billowing once more. Outside, clothes sway gently on a line under the morning sun. Fletcher emerges from his cabin, his eyes scanning the homestead as he scratches his head in thought. Nullah's mother lingers in the doorway, watching him intently. She steps out, wearing an orange dress that catches the light, and looks at Fletcher before turning away, walking purposefully away from him and the cabin. Fletcher, with a casual flick of his wrist, tosses a stone and watches her retreating figure. The sun continues its ascent into the clear blue sky, casting a bright light over the land. Sarah steps out onto the veranda of the main house, with Nullah trailing behind her. He quickly scampers off as two riders approach, seeking a better vantage point. Nullah, hiding behind the gate, cautiously opens it, then walks slowly toward the approaching figures. Sarah offers a nervous smile and nod, acknowledging their presence. Nullah, feeling a sense of independence, pulls away from the Chinese cook. He climbs up with agility and removes a chain that holds the windmill blades in place. With a creak, the windmill swings around and begins to turn, drawing the attention of all as rusty water gushes from a pipe. Fletcher, seeing the commotion, chases after the boy, determined to catch him. Nullah, quick on his feet, leaps over the fence, but Fletcher grabs him, holding his mother aside and striking him again. Sarah, witnessing the scene, strides up with purpose and cracks Fletcher across the face with a riding crop, her eyes blazing with steely determination. She points a finger at him, her resolve unshaken. Fletcher, taken aback, retreats to his truck, casting a final glance around. Flynn, standing nearby, tilts his head stubbornly, refusing to back down. Fletcher reverses as Flynn joins Sarah, and then drives off into the dusty distance, his Drovers abandoning the cattle to ride off with him. Sing Song watches the departure without a trace of emotion. Nullah, his mother, and her friend find solace in each other's company and join Sarah, seeking comfort and solidarity. Sarah looks at Flynn, who respectfully removes his hat in acknowledgment. She surveys her little entourage, then turns away, shielding her eyes from the bright sun. Finally, Sarah sits at her messy desk, her mind filled with the events that have unfolded."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The boy observes from the long grass, smiling dryly as he accompanies Sarah down the hill from the cemetery. As darkness envelops Faraway Downs, Sarah sleeps with moonlight filtering through her curtains, while Fletcher urges an Aboriginal lady indoors. King George chants by a fire, prompting Sarah to awaken and light a lamp. She hurries inside upon sensing movement beneath the steps, finding the boy in her bedroom, grinning broadly as the curtains billow. Intrigued, Sarah looks around, noticing Fletcher peering through the shutters before he leaves. Accompanied by Nullah, she peers out the window, startled by the billowing curtain.\n\nIn the morning sun, Fletcher emerges from his cabin, observed by Nullah's mother, who follows him outside. Wearing an orange dress, she walks away as Fletcher idly tosses a stone. Sarah steps onto the veranda, followed by Nullah, who scampers off as two riders approach. Nullah opens the gate and slowly approaches, smiling nervously. He pulls away from the Chinese cook, climbs up, and removes a chain, setting the windmill in motion. Rusty water pumps from a pipe as Fletcher chases Nullah, grabbing him before Sarah intervenes, striking Fletcher with a riding crop and pointing with determination. Fletcher retreats to his truck, joined by his Drovers, and drives off into the distance, leaving Sing Song watching emotionlessly.\n\nNullah, his mother, and her friend join Sarah, who exchanges a respectful glance with Flynn as he removes his hat. She turns to her entourage, shielding her eyes from the sun, and later sits at her messy desk."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The boy watches from long grass, a common feature in the outback regions where this story unfolds. He gives a smile as dry as the flat plains, reminiscent of the arid Australian outback, which stretch out to the hills on the horizon, and accompanies Sarah down the hill, away from the cemetery known to be a resting place for early settlers. The sun sets on the darkening plains and hills, casting hues typical of the vast Australian landscape. Darkness settles on the house and buildings of Faraway Downs, a sprawling cattle station central to local life. The lights go out. Sarah is asleep in bed, moonlight filtering through the curtains, a common sight in this remote area with clear night skies. Fletcher, whose demeanor is as tough as the land he works, looks out at the night and urges an Aboriginal lady indoors, aware of the tensions between settlers and Indigenous communities. As King George, an elder with deep spiritual connections to the land, chants by a fire, Sarah sits bolt upright in bed and lights a lamp, a gesture of caution in the quiet night. Something moves beneath the steps she's standing on, and King George dances by his hilltop fire, his presence a guardian over the events unfolding. She hurries indoors to find the boy in her bedroom. As he strikes a pose, the curtains billowed, caught by the night's gentle breeze. He grins broadly. Sarah's intrigued by this mysterious boy and the aura of magic he seems to carry. A shadow falls over the porch. Fletcher peers in through the shutters, but seeing nothing, he leaves, his suspicion unfulfilled. Sarah stands up and looks around the room. She goes to the window, accompanied by Nullah, the half-Aboriginal, half-white boy finding his place between two worlds, and peers out. She turns with a start. The curtain is billowing. Clothes hang on a line in the morning sun, drying quickly in the warm climate. Fletcher emerges from his cabin. Nullah's mother hovers in the doorway, her presence a reminder of the entwined lives on the station. He looks around the homestead and scratches his head, pondering the day's challenges. She follows him out. Wearing an orange dress, she looks at Fletcher, then walks away from him and the cabin, asserting her autonomy. He idly tosses a stone and watches her go. The sun rises in the clear blue sky, signaling the start of another hot day. Sarah walks out onto the veranda of the main house, the community's central hub. Nullah follows her. He scampers off, as two riders approach, their arrival heralding change. Nullah, hiding behind the gate, opens it. Nullah walks slowly to him, exhibiting both bravery and caution in his movements. She smiles and nods nervously. Nullah pulls away from the Chinese cook, a figure blending diverse cultural threads into their shared life. He's climbed up and removed a chain holding the blades in place. The windmill swings around and starts to turn, a sign of ingenuity and resourcefulness. They all stare as rusty water is pumped from a pipe, a precious resource in their parched environment. Fletcher chases after the boy. Nullah leaps over the fence before being grabbed by the man. He holds the boy's mother aside and hits him again as Sarah strides up, embodying the spirit of fairness and justice. She cracks him across the face with a riding crop, a symbol of authority. She points a finger with steely determination. He reaches his truck, then looks around, deciding his next move. Flynn, a strong and silent presence, tilts his head stubbornly. He backs up as Flynn joins Sarah. He drives off into the dusty distance, leaving behind the life they all know. His Drovers abandon the cattle and ride off with him, the herd left to roam. Sing Song, the Chinese cook, watches without emotion, a stoic figure amid chaos. Nullah, his mother, and her friend comfort each other and also join Sarah, forming a makeshift family. She looks at Flynn, who respectfully removes his hat, a gesture of camaraderie and respect. She looks at her little entourage, and turns and sheds her eyes from the sun, contemplating the future. Sarah sits at her messy desk, papers scattered in the whirlwind of events."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The boy watches from long grass. He gives a smile as dry as the flat plains which stretch out to the hills on the horizon and accompanies Sarah down the hill away from the cemetery. The sun sets on the darkening plains and hills. Darkness settles on the house and buildings of Faraway Downs. The lights go out. Sarah is asleep in bed. moonlight filtering through the curtains. Fletcher looks out at the night and urges an Aboriginal lady indoors. As King George chants by a fire. Sarah sits bolt upright in bed and lights a lamp. Something moves beneath the steps she is standing on and King George dances by his hilltop fire. She hurries indoors to find the boy in her bedroom. As he strikes a pose the curtains billowed. He grins broadly. Sarah's intrigued. A shadow falls over the porch. Fletcher peers in through the shutters but seeing nothing and leaves. Sarah stands up and looks around the room. She goes to the window accompanied by Nullah and peers out. She turns with a start. The curtain is billowing. Clothes hang on a line in the morning sun. Fletcher emerges from his cabin. Nullah's mother hovers in the doorway. He looks around the homestead and scratches his head. She follows him out. Wearing an orange dress she looks at Fletcher then walks away from him and the cabin. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. He idly tosses a stone and watches her go. The sun rises in the clear blue sky. Sarah walks out onto the veranda of the main house. Nullah follows her. He scampers off as two riders approach. Nullah hiding behind the gate opens it. Nullah walks slowly to him. She smiles and nods nervously. Nullah pulls away from the Chinese cook. He is climbed up and removed a chain holding the blades in place. The windmill swings around and starts to turn. They all stare as rusty water is pumped from a pipe. Fletcher chases after the boy. Nullah leaps over the fence before being grabbed by the man. He holds the boy's mother aside and hits him again as Sarah strides up. She cracks him across the face with a riding crop. She points a finger with steely determination. He reaches his truck then looks around. Flynn tilts his head stubbornly. He backs up as Flynn joins Sarah. He drives off into the dusty distance. His Drovers abandon the cattle and ride off with him. Sing Song watches without emotion. Nullah his mother and her friend comfort each other and also join Sarah. She looks at Flynn who respectfully removes his hat. She looks at her little entourage and turns and sheds her eyes from the sun. Sarah sits at her messy desk."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The boy watches from long grass. He gives a smile as dry as the flat plains which stretch out to the hills on the horizon and accompanies Sarah down the hill away from the cemetery. The sun sets on the darkening plains and hills. Darkness settles on the house and buildings of Faraway Downs. The lights go out. Sarah is asleep in bed. moonlight filtering through the curtains. Fletcher looks out at the night and urges an Aboriginal lady indoors. As King George chants by a fire. Sarah sits bolt upright in bed and lights a lamp. Something moves beneath the steps she is standing on and King George dances by his hilltop fire. She hurries indoors to find the boy in her bedroom. As he strikes a pose the curtains billowed. He grins broadly. Sarah's intrigued. A shadow falls over the porch. Fletcher peers in through the shutters but seeing nothing and leaves. Sarah stands up and looks around the room. She goes to the window accompanied by Nullah and peers out. She turns with a start. The curtain is billowing. Clothes hang on a line in the morning sun. Fletcher emerges from his cabin. Nullah's mother hovers in the doorway. He looks around the homestead and scratches his head. She follows him out. Wearing an orange dress she looks at Fletcher then walks away from him and the cabin. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. He idly tosses a stone and watches her go. The sun rises in the clear blue sky. Sarah walks out onto the veranda of the main house. Nullah follows her. He scampers off as two riders approach. Nullah hiding behind the gate opens it. Nullah walks slowly to him. She smiles and nods nervously. Nullah pulls away from the Chinese cook. He is climbed up and removed a chain holding the blades in place. The windmill swings around and starts to turn. They all stare as rusty water is pumped from a pipe. Fletcher chases after the boy. Nullah leaps over the fence before being grabbed by the man. He holds the boy's mother aside and hits him again as Sarah strides up. She cracks him across the face with a riding crop. She points a finger with steely determination. He reaches his truck then looks around. Flynn tilts his head stubbornly. He backs up as Flynn joins Sarah. He drives off into the dusty distance. His Drovers abandon the cattle and ride off with him. Sing Song watches without emotion. Nullah his mother and her friend comfort each other and also join Sarah. She looks at Flynn who respectfully removes his hat. She looks at her little entourage and turns and sheds her eyes from the sun. Sarah sits at her messy desk."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The boy watches from long grass. He gives a smile as dry as the flat plains which stretch out to the hills on the horizon and accompanies Sarah down the hill away from the cemetery. The sun sets on the darkening plains and hills. Darkness settles on the house and buildings of Faraway Downs. The lights go out. Sarah is asleep in bed. moonlight filtering through the curtains. Fletcher looks out at the night and urges an Aboriginal lady indoors. As King George chants by a fire. Sarah sits bolt upright in bed and lights a lamp. Something moves beneath the steps she is standing on and King George dances by his hilltop fire. She hurries indoors to find the boy in her bedroom. As he strikes a pose the curtains billowed. He grins broadly. He holds the boy's mother aside and hits him again as Sarah strides up. She cracks him across the face with a riding crop. She points a finger with steely determination. He reaches his truck then looks around. Flynn tilts his head stubbornly. He backs up as Flynn joins Sarah. He drives off into the dusty distance. His Drovers abandon the cattle and ride off with him. Sing Song watches without emotion. Nullah his mother and her friend comfort each other and also join Sarah. She looks at Flynn who respectfully removes his hat. She looks at her little entourage and turns and sheds her eyes from the sun. Sarah sits at her messy desk."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The boy watches from long grass. He gives a smile as dry as the flat plains which stretch out to the hills on the horizon and accompanies Sarah down the hill away from the cemetery. The sun sets on the darkening plains and hills. Darkness settles on the house and buildings of Faraway Downs. The lights go out. Sarah is asleep in bed. Sing Song watches without emotion. Nullah his mother and her friend comfort each other and also join Sarah. She looks at Flynn who respectfully removes his hat. She looks at her little entourage and turns and sheds her eyes from the sun. Sarah sits at her messy desk."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The rabbit observes from dense shrubbery. It gives a frown as wet as the steep mountains that rise up to the cliffs in the distance, and escorts Margaret up the mountain, toward the factory. The moon rises on the brightening mountains and cliffs. Lightness descends on the apartment and skyscrapers of Closeby Heights. The candles turn on. Margaret is awake in a hammock, sunlight streaming through the blinds. Smith peeks out at the day, and beckons a European gentleman outdoors. As Queen Mary whispers near a fountain, Margaret lies flat on the hammock and extinguishes a torch. Everything shifts above the roof she's sitting on, and Queen Mary sings near her forest fountain. She strolls outdoors to find the rabbit in her living room. As it balances a vase, the blinds fluttered. It frowns slightly. Margaret's confused. A light casts onto the patio. Smith gazes out from the curtains, but hearing something, arrives. Margaret lies down and glances around the house. She heads to the door, followed by Ralph, and observes in. She turns without warning. The blind is fluttering. Tools rest on a rack in the evening fog. Smith vanishes into his tent. Ralph's father runs in the hallway. She glances around the depot and stretches her arms. She trails him in. Wearing a pink coat, he glances at Smith, then skips toward him and the tent. She deliberately drops a coin and listens to it clink. The moon sets in the cloudy purple sky. Margaret lounges indoors near the small cottage. Ralph trails her. He slinks in, as three walkers depart. Ralph, standing on the bench, closes it. Ralph strolls quickly from her. He scowls and shakes excitedly. Ralph shoves toward the Brazilian dancer. She's crouched down and secured a padlock holding the wheels in place. The waterwheel grinds to a stop and ceases to spin. They all smirk as polished gems are drained from a bottle. Smith flees from the rabbit. Ralph dives under the hedge after being left by the woman. She pushes the rabbit's father aside and hugs him closely as Margaret sneaks down. She kisses him on the cheek with a gentle hug. She waves a hand with gentle curiosity. He reaches his motorcycle, then glances around. Burns nods her hand thoughtfully. She leans forward as Burns leaves Margaret. She pedals away into the silent nighttime. Her Farmers maintain the sheep and stroll along with her. Ping Pong laughs with enthusiasm. Ralph, his father, and her cousin entertain one another and also follow Margaret. She glances at Burns, who politely keeps his shoes on. She observes her large entourage, and turns and opens her arms to the moon. Margaret stands at her empty table."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The boy watches from the grass with a dry smile and joins Sarah as they leave the cemetery. As darkness falls over Faraway Downs, Sarah wakes suddenly and lights a lamp. She finds the boy, Nullah, in her room, and Fletcher is lurking outside. The next morning, Fletcher emerges from his cabin, while Nullah's mother watches him warily. Sarah steps onto the veranda with Nullah as two riders approach. Nullah manages to start the windmill, and rusty water flows, prompting Fletcher to chase and hit him. Sarah intervenes, striking Fletcher with a riding crop and forcing him to leave in his truck. His Drovers abandon the cattle, joining Fletcher. Nullah, his mother, and her friend seek comfort with Sarah, who shares a moment of respect with Flynn. Sarah then retreats to her desk, contemplating the events."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Sarah sits at her messy desk She looks at her little entourage and turns and sheds her eyes from the sun  She looks at Flynn who respectfully removes his hat  Nullah his mother and her friend comfort each other and also join Sarah  Sing Song watches without emotion  His Drovers abandon the cattle and ride off with him  He drives off into the dusty distance  He backs up as Flynn joins Sarah  Flynn tilts his head stubbornly  He reaches his truck then looks around  She points a finger with steely determination  She cracks him across the face with a riding crop  He holds the boy's mother aside and hits him again as Sarah strides up  Nullah leaps over the fence before being grabbed by the man  Fletcher chases after the boy  They all stare as rusty water is pumped from a pipe  The windmill swings around and starts to turn  He's climbed up and removed a chain holding the blades in place  Nullah pulls away from the Chinese cook  She smiles and nods nervously  Nullah walks slowly to him  Nullah hiding behind the gate opens it  He scampers off as two riders approach  Nullah follows her  Sarah walks out onto the veranda of the main house  The sun rises in the clear blue sky  He idly tosses a stone and watches her go  Wearing an orange dress she looks at Fletcher then walks away from him and the cabin  She follows him out  He looks around the homestead and scratches his head  Nullah's mother hovers in the doorway  Fletcher emerges from his cabin  Clothes hang on a line in the morning sun  The curtain is billowing  She turns with a start  She goes to the window accompanied by Nullah and peers out  Sarah stands up and looks around the room  Fletcher peers in through the shutters but seeing nothing and leaves  A shadow falls over the porch  Sarah's intrigued  He grins broadly  As he strikes a pose the curtains billowed  She hurries indoors to find the boy in her bedroom  Something moves beneath the steps she's standing on and King George dances by his hilltop fire  As King George chants by a fire Sarah sits bolt upright in bed and lights a lamp  Fletcher looks out at the night and urges an Aboriginal lady indoors  moonlight filtering through the curtains  Sarah is asleep in bed  The lights go out  Darkness settles on the house and buildings of Faraway Downs  The sun sets on the darkening plains and hills  He gives a smile as dry as the flat plains which stretch out to the hills on the horizon and accompanies Sarah down the hill away from the cemetery  The boy watches from long grass "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He gives a smile as dry as the flat plains which stretch out to the hills on the horizon and accompanies Sarah down the hill away from the cemetery The boy watches from long grass Darkness settles on the house and buildings of Faraway Downs The sun sets on the darkening plains and hills Sarah is asleep in bed The lights go out Fletcher looks out at the night and urges an Aboriginal lady indoors moonlight filtering through the curtains Sarah sits bolt upright in bed and lights a lamp As King George chants by a fire She hurries indoors to find the boy in her bedroom Something moves beneath the steps she is standing on and King George dances by his hilltop fire He grins broadly As he strikes a pose the curtains billowed A shadow falls over the porch Sarah's intrigued Sarah stands up and looks around the room Fletcher peers in through the shutters but seeing nothing and leaves She turns with a start She goes to the window accompanied by Nullah and peers out Clothes hang on a line in the morning sun The curtain is billowing Nullah's mother hovers in the doorway Fletcher emerges from his cabin She follows him out He looks around the homestead and scratches his head He idly tosses a stone and watches her go Wearing an orange dress she looks at Fletcher then walks away from him and the cabin Sarah walks out onto the veranda of the main house The sun rises in the clear blue sky He scampers off as two riders approach Nullah follows her Nullah walks slowly to him Nullah hiding behind the gate opens it Nullah pulls away from the Chinese cook She smiles and nods nervously The windmill swings around and starts to turn He is climbed up and removed a chain holding the blades in place Fletcher chases after the boy They all stare as rusty water is pumped from a pipe He holds the boy's mother aside and hits him again as Sarah strides up Nullah leaps over the fence before being grabbed by the man She points a finger with steely determination She cracks him across the face with a riding crop Flynn tilts his head stubbornly He reaches his truck then looks around He drives off into the dusty distance He backs up as Flynn joins Sarah Sing Song watches without emotion His Drovers abandon the cattle and ride off with him She looks at Flynn who respectfully removes his hat Nullah his mother and her friend comfort each other and also join Sarah Sarah sits at her messy desk She looks at her little entourage and turns and sheds her eyes from the sun"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The sun rises in the clear blue sky  Sarah walks out onto the veranda of the main house  Nullah follows her  He scampers off as two riders approach  Nullah hiding behind the gate opens it  Nullah walks slowly to him  She smiles and nods nervously  Nullah pulls away from the Chinese cook  He's climbed up and removed a chain holding the blades in place  The windmill swings around and starts to turn  They all stare as rusty water is pumped from a pipe  Fletcher chases after the boy  Nullah leaps over the fence before being grabbed by the man  He holds the boy's mother aside and hits him again as Sarah strides up  She cracks him across the face with a riding crop  She points a finger with steely determination  He reaches his truck then looks around  Flynn tilts his head stubbornly  He backs up as Flynn joins Sarah  He drives off into the dusty distance  His Drovers abandon the cattle and ride off with him  Sing Song watches without emotion  Nullah his mother and her friend comfort each other and also join Sarah  She looks at Flynn who respectfully removes his hat  She looks at her little entourage and turns and sheds her eyes from the sun  Sarah sits at her messy desk The boy watches from long grass  He gives a smile as dry as the flat plains which stretch out to the hills on the horizon and accompanies Sarah down the hill away from the cemetery  The sun sets on the darkening plains and hills  Darkness settles on the house and buildings of Faraway Downs  The lights go out  Sarah is asleep in bed  moonlight filtering through the curtains  Fletcher looks out at the night and urges an Aboriginal lady indoors  As King George chants by a fire Sarah sits bolt upright in bed and lights a lamp  Something moves beneath the steps she's standing on and King George dances by his hilltop fire  She hurries indoors to find the boy in her bedroom  As he strikes a pose the curtains billowed  He grins broadly  Sarah's intrigued  A shadow falls over the porch  Fletcher peers in through the shutters but seeing nothing and leaves  Sarah stands up and looks around the room  She goes to the window accompanied by Nullah and peers out  She turns with a start  The curtain is billowing  Clothes hang on a line in the morning sun  Fletcher emerges from his cabin  Nullah's mother hovers in the doorway  He looks around the homestead and scratches his head  She follows him out  Wearing an orange dress she looks at Fletcher then walks away from him and the cabin  He idly tosses a stone and watches her go "
        }
      ]
    }
  ]
}