{
  "ground_truth": "Nullah notices and drops in after her, and she eyes him coldly. He studies her and smiles as the Drover rides up while they pull away, in the tank. Nullah brings Daisy to the surface, and as the truck drives away down the dusty road, Drover hauls Daisy's body from the tank. Sarah sprints over, and Nullah desperately hugs his mother while Drover hangs his head as Nullah clings to the body. Bandy runs out of the house, and the cop's truck continues down the long, straight, dusty road into the vast scrub lands of Faraway Downs. The windmill turns slowly at sunset as Sarah looks tearfully out towards Daisy's blazing funeral pyre. Smoke drifts from the top of a rocky summit nearby, and Magarri signals to the hilltop, waving to King George who starts to chant. The body is carried towards the fire, with the old man looking down on the homestead from his hilltop in the soft glow of dawn. Sarah steps out of the house as Drover sits down on the fence and lights a cigarette. She looks distraught, and he frowns as she avoids his gaze. She walks to where Nullah is grieving, lying curled up on the ground on a mattress, while she's completely at a loss. She crouches down next to him, laying newspapers from a pile on the ground to kneel on, as she kneels and thinks, with the nearest front page having an advert for a film. He looks up and sees the smoke on the hilltop while she looks perplexed, and he holds up his hand with a cloth tied around it as she's not sure how to proceed. He watches her expectantly as she finishes with a self-deprecating flourish, and her eyes fill with tears in the blazing sun. Sarah faces Drover in the saddle, and Nullah looks up as a twister starts to form in the dust in front of the house. He looks unconvinced while Flynn salutes and eyeballs Sarah, and Bandy and Flynn nod as Sing Song winks and Nullah grins. Sing Song's chop wagon moves on as Drover opens the gate to the cattle pen, and Drover marshals his motley gang of riders as the huge herd moves out of the pen, raising a massive cloud of dust. The army of cattle moves off, while King George follows their progress from his rocky mountain top. The herd approaches a wide river as Drover and Sarah ride ahead of the cattle, and the others ride behind and alongside, keeping them together. Sing Song drives his wagon into the water, and the crossing is successful. Crowds fill an open-air cinema in nighttime Darwin as Carney stares grimly and drops a curtain down between himself and Fletcher, who turns angrily away. The drive moves on through the soft light of sunset, approaching a range of jagged vertical cliffs.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Nullah observes and descends in after her, and she regards him coolly. He examines her and grins as the Drover rides up while they move away, in the basin. Nullah retrieves Daisy to the exterior, and as the vehicle drives away down the dusty path, Drover hoists Daisy's form from the basin. Sarah dashes over, and Nullah frantically embraces his mother while Drover lowers his head as Nullah clings to the form. Bandy rushes out of the dwelling, and the cop's vehicle continues down the long, straight, dusty path into the vast bush lands of Faraway Downs. The windmill rotates slowly at sunset as Sarah gazes tearfully out towards Daisy's blazing funeral pyre. Smoke floats from the peak of a rocky summit nearby, and Magarri signals to the hilltop, gesturing to King George who begins to chant. The form is carried towards the flame, with the old man observing down on the homestead from his hilltop in the soft glow of dawn. Sarah steps out of the dwelling as Drover sits down on the barrier and lights a cigarette. She appears distraught, and he scowls as she avoids his look. She walks to where Nullah is mourning, lying curled up on the ground on a mattress, while she's completely at a loss. She crouches down next to him, placing newspapers from a stack on the ground to kneel on, as she kneels and considers, with the closest front page having an advert for a film. He glances up and sees the smoke on the hilltop while she appears perplexed, and he raises his hand with a cloth tied around it as she's unsure how to advance. He observes her expectantly as she concludes with a self-deprecating flourish, and her eyes fill with tears in the blazing sun. Sarah faces Drover in the saddle, and Nullah glances up as a twister begins to form in the dust in front of the dwelling. He seems unconvinced while Flynn salutes and eyeballs Sarah, and Bandy and Flynn nod as Sing Song winks and Nullah beams. Sing Song's chop wagon moves on as Drover opens the gate to the cattle pen, and Drover marshals his motley crew of riders as the vast herd moves out of the pen, raising a massive cloud of dust. The army of cattle proceeds, while King George observes their progress from his rocky mountain peak. The herd reaches a wide river as Drover and Sarah ride ahead of the cattle, and the others ride behind and alongside, keeping them united. Sing Song drives his wagon into the water, and the crossing is successful. Crowds fill an open-air cinema in nighttime Darwin as Carney observes grimly and drops a curtain down between himself and Fletcher, who turns angrily away. The drive continues through the soft light of sunset, approaching a series of jagged vertical cliffs."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Nullah is noticed and is dropped in after by her, and he is eyed coldly by her. She is studied by him, and he smiles as the Drover rides up while away is pulled by them, in the tank. Daisy is brought to the surface by Nullah, and as the truck is driven away down the dusty road, Drover hauls Daisy's body from the tank. Over is sprinted by Sarah, and his mother is desperately hugged by Nullah while his head is hung by Drover as the body is clung to by Nullah. Bandy runs out of the house, and the cop continues driving the truck down the long, straight, dusty road into the vast scrub lands of Faraway Downs. Slowly at sunset, the windmill is turned as Sarah tearfully looks out towards Daisy's blazing funeral pyre. Smoke drifts from the top of a rocky summit nearby, and Magarri waves to King George while signaling to the hilltop, and a chant is started by King George. Towards the fire, the body is carried, with the old man looking down on the homestead from his hilltop in the soft glow of dawn. Out of the house steps Sarah as on the fence sits Drover, lighting a cigarette. Distraught, she looks, and when his gaze is avoided by her, he frowns. To where Nullah is grieving, she walks, lying curled up on the ground on a mattress, while she is completely at a loss. Next to him, she crouches, laying newspapers from a pile on the ground to kneel on, as she kneels and thinks, having the nearest front page with an advert for a film. Up, he looks and sees the smoke on the hilltop while she looks perplexed, and his hand is held up with a cloth tied around it by him as she is unsure how to proceed. Expectantly, she is watched by him as a self-deprecating flourish is finished by her, and in the blazing sun, her eyes fill with tears. In the saddle, Drover is faced by Sarah, and as a twister starts to form in the dust in front of the house, up looks Nullah. Unconvinced, he looks while Flynn salutes and eyeballs Sarah, and Bandy and Flynn nod while Sing Song winks and grins Nullah. Sing Song moves his chop wagon on as the gate to the cattle pen is opened by Drover, and Drover marshals his motley gang of riders as out of the pen moves the huge herd, raising a massive cloud of dust. Off moves the army of cattle, while their progress is followed by King George from his rocky mountain top. A wide river is approached by the herd as ahead of the cattle ride Drover and Sarah, and behind and alongside, the others ride, keeping them together. His wagon is driven by Sing Song into the water, and the crossing is successful. Crowds fill an open-air cinema in nighttime Darwin as Carney stares grimly and drops a curtain down between himself and Fletcher, who turns angrily away. On through the soft light of sunset, the drive moves, approaching a range of jagged vertical cliffs."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Nullah notices and follows her, eyeing him coldly. He studies her with a smile as Drover arrives while they move in the tank. Nullah helps Daisy surface as the truck drives down the dusty road, and Drover pulls Daisy from the tank. Sarah rushes over, and Nullah hugs his mother while Drover hangs his head. Bandy runs out, and the cop's truck continues down the straight, dusty road into Faraway Downs' scrub lands. The windmill turns at sunset as Sarah tearfully watches Daisy's blazing pyre. Smoke drifts from a nearby rocky summit, with Magarri signaling to King George, who starts chanting. The body heads to the fire as the old man looks from his hilltop at dawn. Sarah exits the house as Drover, on the fence, lights a cigarette. She looks upset, and he frowns as she avoids eye contact. She goes to grieving Nullah, curled on a mattress, and kneels, laying newspapers to kneel on, pondering with a film ad on the front page. He notices the hilltop smoke while she looks confused, holding a hand with a cloth tied around it. He watches her, and her eyes tear in the sun. Sarah faces Drover in the saddle as a twister forms in front of the house. Nullah seems unconvinced as Flynn salutes Sarah, and Bandy and Flynn nod, with Sing Song winking and Nullah grinning. Sing Song's wagon moves as Drover opens the cattle pen, rallying his riders as the herd exits, creating a dust cloud. The cattle move, with King George observing from the mountain. The herd nears a river, Drover and Sarah leading, others keeping cattle together. Sing Song successfully drives his wagon through the water. Crowds gather at Darwin's open-air cinema as Carney grimly drops a curtain between himself and a turned-away Fletcher. The drive continues at sunset, approaching jagged cliffs."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Nullah follows her, casting a cold glance, as Drover approaches while they move away in the tank. Nullah surfaces with Daisy, and Drover pulls her body out as the truck departs. Sarah rushes over, embracing Nullah, while Drover watches somberly. Bandy emerges as the cop's truck drives down the road into Faraway Downs. At sunset, Sarah gazes at Daisy's funeral pyre. Nearby, Magarri signals to King George on a hilltop, who chants as the body approaches the fire. In dawn's glow, Sarah exits the house; Drover lights a cigarette, frowning as she avoids him. Distraught, she joins grieving Nullah on the ground, kneeling on newspaper while he looks at the smoke. He holds up his bandaged hand, unsure of her intent as she finishes, tear-filled. Facing Drover, a dust twister forms; Nullah remains unconvinced. Flynn salutes Sarah while Bandy and Flynn nod; Sing Song winks as Nullah grins. Sing Song's wagon departs as Drover opens the cattle pen, guiding his gang as the herd creates a dust cloud. King George watches from the mountain as the herd nears a river. Drover and Sarah lead, successfully crossing. In Darwin, a crowd watches a film; Carney lowers a curtain between him and a furious Fletcher. The drive continues towards jagged cliffs at sunset."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Nullah, with a watchful eye, notices the unfolding scene and decides to drop in right after her, yet she returns his gaze with a cold, detached demeanor. He takes a moment to scrutinize her, the edges of his mouth curling into a faint, knowing smile just as the Drover makes his timely entrance, riding up while the tank begins its gradual departure. In a brave effort, Nullah brings Daisy up to the surface, and as the truck slowly pulls away, journeying down the dusty, winding road, Drover painstakingly hauls Daisy's lifeless body from the tank. In a flurry of motion, Sarah comes sprinting over, and with an outpouring of emotion, Nullah clings desperately to his mother, enveloping her in a heartfelt embrace, while Drover stands there, head hanging low, as Nullah holds onto the body with fierce determination. From the house, Bandy hastily runs out, and the cop's truck continues to drive steadily down the long, straight, dusty road, disappearing into the sprawling, desolate scrub lands of Faraway Downs. \n\nAs the windmill turns slowly, silhouetted against the golden hues of the sunset, Sarah gazes out with tear-filled eyes towards Daisy's blazing funeral pyre. From the top of a nearby rocky summit, smoke drifts gently, and Magarri signals with a wave towards the hilltop, where King George begins to chant solemnly. The body is carefully carried towards the crackling fire, with the venerable old man observing the homestead from his vantage point on the hilltop, bathed in the soft glow of the breaking dawn. Sarah steps out of the house, her expression deeply troubled, while Drover sits quietly on the fence, lighting a cigarette. She looks deeply distraught and he frowns, his concerns evident, as she avoids meeting his gaze. She walks over to where Nullah is grieving, his small frame curled up on a mattress on the ground, while she finds herself utterly at a loss. She crouches down beside him, laying newspapers from a nearby pile upon the ground so she can kneel, her thoughts churning, the nearest front page displaying an advert for a film. As Nullah looks up, he sees the smoke on the distant hilltop, and she watches him, perplexed, as he raises his hand, a cloth tied around it, signaling his state of mind while she remains unsure about how to respond. He watches her with anticipation as she concludes her actions with a self-deprecating flourish, her eyes welling with tears in the intense, blazing sun.\n\nFacing Drover as he sits comfortably in the saddle, Sarah stands firm, while Nullah looks up at the sky as a twister begins to form and swirl in the dust, right in front of the house. He remains skeptical while Flynn gives a sharp salute and fixes his gaze on Sarah, and both Bandy and Flynn nod in understanding as Sing Song winks knowingly and Nullah rewards them with a grin. Sing Song's chop wagon begins to move onward, as Drover opens the gate to the cattle pen, and he efficiently organizes his motley gang of riders as the enormous, bustling herd moves out of the pen, kicking up a massive, billowing cloud of dust as they go. This formidable army of cattle forges ahead, while King George observes their progress closely from his rocky mountain perch. The herd makes its way towards a wide, flowing river, as Drover and Sarah ride at the forefront of the cattle, with the others riding in formation behind and to the sides, ensuring the herd stays together. Sing Song drives his wagon purposefully into the water, and the river crossing is executed successfully. Meanwhile, crowds gather to fill the open-air cinema in the nighttime setting of Darwin, where Carney stares grimly, pulling a curtain decisively between himself and Fletcher, who reacts by turning away angrily. The drive continues onward, bathed in the soft, fading light of sunset, approaching a strikingly jagged range of vertical cliffs."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Nullah, with a keen and observant eye, notices the situation unfolding before him and makes the decision to drop in right after her, yet her reaction is to return his gaze with a demeanor that is cold and detached. He pauses for a brief moment to scrutinize her closely, the corners of his mouth curling slowly into a faint, knowing smile just as the Drover makes his timely entrance. The Drover rides up on horseback while the tank begins its steady and gradual departure. In a brave and determined effort, Nullah manages to bring Daisy up to the surface, and as the truck slowly pulls away, journeying down the dusty, winding road with determination, Drover painstakingly hauls Daisy's lifeless body from the tank. In a flurry of motion and urgency, Sarah comes sprinting over, and with an outpouring of raw emotion, Nullah clings desperately to his mother, enveloping her in a heartfelt and deeply emotional embrace, while Drover stands there, head hanging low in silent grief, as Nullah holds onto the lifeless body with fierce determination and resolve. From the nearby house, Bandy hastily runs out, and the cop's truck continues to drive steadily down the long, straight, dusty road, disappearing into the sprawling and desolate scrub lands of Faraway Downs.\n\nAs the windmill turns ever so slowly, silhouetted against the golden and radiant hues of the sunset, Sarah gazes out with tear-filled eyes towards Daisy's blazing funeral pyre. From the top of a nearby rocky summit, smoke drifts gently upwards, and Magarri signals with a wave towards the hilltop, where King George begins to chant solemnly. The body is carefully carried towards the crackling and flickering fire, with the venerable old man observing the homestead from his vantage point on the hilltop, bathed in the soft glow of the breaking dawn. Sarah steps out of the house, her expression deeply troubled and burdened, while Drover sits quietly on the fence, lighting a cigarette with a thoughtful demeanor. She looks deeply distraught, and he frowns, his concerns and empathy evident, as she avoids meeting his gaze. She walks over to where Nullah is grieving, his small frame curled up on a mattress laid upon the ground, while she finds herself utterly at a loss for what to do. She crouches down beside him, carefully laying newspapers from a nearby pile upon the ground so she can kneel, her thoughts swirling and churning, the nearest front page displaying an advert for a popular film. As Nullah looks up, he sees the smoke rising on the distant hilltop, and she watches him, perplexed and unsure, as he raises his hand, a cloth wrapped around it, signaling his state of mind while she remains at a loss about how to respond. He watches her with anticipation as she concludes her actions with a self-deprecating flourish, her eyes welling with tears in the intense, blazing sun overhead.\n\nFacing Drover as he sits comfortably in the saddle, Sarah stands firm and resolute, while Nullah looks up at the sky as a twister begins to form and swirl in the dusty air, right in front of the house. He remains skeptical of the phenomenon while Flynn gives a sharp salute and fixes his gaze intently on Sarah. Both Bandy and Flynn nod in understanding as Sing Song winks knowingly, and Nullah rewards them with a bright grin. Sing Song's chop wagon begins to move onward, as Drover opens the gate to the cattle pen, and he efficiently organizes his motley gang of riders as the enormous, bustling herd moves out of the pen, kicking up a massive, billowing cloud of dust as they go. This formidable army of cattle forges ahead with purpose, while King George observes their progress closely from his rocky mountain perch. The herd makes its way diligently towards a wide, flowing river, as Drover and Sarah ride confidently at the forefront of the cattle, with the others riding in formation behind and to the sides, ensuring the herd stays together as a cohesive unit. Sing Song drives his wagon purposefully into the water, and the river crossing is executed successfully with precision. Meanwhile, crowds gather eagerly to fill the open-air cinema in the nighttime setting of Darwin, where Carney stares grimly, pulling a curtain decisively between himself and Fletcher, who reacts by turning away angrily. The drive continues onward with determination, bathed in the soft, fading light of sunset, approaching a strikingly jagged range of vertical cliffs."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Nullah notices the unfolding situation and, with a quick decision, follows after her. As he catches up, she greets him with a cold, penetrating stare, prompting him to study her expression carefully before offering a tentative smile. Meanwhile, Drover approaches on horseback, and they all become aware that the tank is beginning to pull away. In a swift, smooth motion, Nullah brings Daisy to the surface of the tank. As the vehicle continues its journey down the dusty, seemingly endless road, Drover works diligently to haul Daisy's lifeless body from the tank. With urgency, Sarah sprints towards them while Nullah clings desperately to his mother’s motionless form, enveloping her in a tight embrace as Drover stands nearby, lowering his head sorrowfully. Bandy rushes out of the house, his focus on the scene unfolding, and the cop's truck persists in its steady progress along the long, straight road leading into the expansive scrublands of Faraway Downs. In the peaceful quiet of sunset, the windmill turns slowly, and Sarah gazes tearfully towards where Daisy's funeral pyre blazes intensely. Smoke drifts idly from the summit of a rocky hill as Magarri sends a signal to the hilltop, waving to King George who, in response, begins to chant in a deep, resonant voice. The solemn act of carrying Daisy's body towards the fire commences, with the old man watching from his vantage point on the hilltop, bathed in the soft glow of dawn. Emerging from the house, Sarah catches sight of Drover who is seated on the fence, lighting a cigarette and taking a reflective moment. She appears distraught and avoids meeting his concerned gaze, prompting him to frown slightly. With determination, she walks over to where Nullah, engulfed in his sorrow, is lying curled up on a mattress on the ground. Feeling completely at a loss, she crouches beside him, methodically laying newspapers from a nearby pile on the ground to create a makeshift kneeling space. As she kneels, contemplating their predicament, a front page featuring a film advert catches her eye. Nullah, sensing a change, looks up and observes the smoke on the hilltop; she appears perplexed and unsure of how to proceed, which prompts him to lift his hand, revealing a cloth tied around it. Watching her with a hopeful look, Nullah sees her finish her actions with a self-deprecating flourish, tears beginning to form in her eyes under the blazing sun. Sarah approaches Drover, who sits astride his horse, while Nullah looks up, witnessing the formation of a twister kicking up dust in front of the house. He remains unconvinced as Flynn acknowledges them with a salute, also taking a moment to scrutinize Sarah. Bandy and Flynn exchange nods; Sing Song winks playfully, causing Nullah to break into a grin. As Sing Song's chop wagon moves onward, Drover swings the gate open to the cattle pen, ushering out his motley gang of riders who, in turn, guide the massive herd moving together, raising an immense cloud of dust in their wake. King George follows their progress attentively from his elevated position on the rocky mountaintop. As the herd advances, they near a wide river; Drover and Sarah ride at the forefront while the rest of the team positions themselves behind and alongside the herd, ensuring that the cattle remain together. Sing Song deftly maneuvers his wagon into the water, successfully leading the crossing. Later, crowds gather enthusiastically at an open-air cinema in nighttime Darwin, where the tension is palpable as Carney stares grimly and lets a curtain fall between himself and Fletcher, who turns away in frustration. As the day winds down, the drive progresses through the soft, fading light of sunset, and they approach a range of jagged vertical cliffs, their journey continuing."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Nullah drops into the tank after her, noticing her cold demeanor, as the Drover rides up and they begin to pull away. With the truck departing down the dusty road, Nullah brings Daisy to the surface, and Drover lifts Daisy's body from the tank. Sarah rushes over, while Nullah clings desperately to his mother, and Drover looks on with a bowed head. As Bandy emerges from the house, the cop's truck disappears into the scrub lands of Faraway Downs. At sunset, Sarah tearfully watches Daisy's funeral pyre blaze, with smoke drifting from a nearby rocky summit where Magarri signals to King George, who begins to chant. The body is carried to the fire as the old man overlooks the homestead from his hilltop at dawn. Sarah exits the house to find Drover lighting a cigarette on the fence, appearing somber as she avoids his gaze. She walks to grieving Nullah, curled on a mattress, and kneels beside him, using newspapers to cushion her knees, lost in thought. Nullah notices smoke on the hilltop and shows her a cloth-bound hand, as she ponders, unsure of her next move. Her eyes well with tears in the sun as she completes her task with a self-deprecating flourish. Facing Drover in the saddle, Sarah witnesses a dust twister forming, and Nullah looks up skeptically. Amid nods and gestures from Flynn, Bandy, and Sing Song, a grinning Nullah observes the scene. As Sing Song moves on with his chop wagon, Drover opens the cattle pen gate, rallying his diverse group of riders. A massive cloud of dust rises as they drive the cattle out, under King George's watchful eye from the mountain top. Approaching a wide river, Drover and Sarah lead the herd, with others riding alongside. Sing Song successfully drives his wagon through the water. In Darwin, crowds gather at an open-air cinema, where Carney drops a curtain between himself and a fuming Fletcher. As the drive continues, they near jagged cliffs in the soft light of sunset."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Nullah notices and drops in after her, and she eyes him coldly, her expression reminiscent of the deep-seated cultural divides that persist in the region. He studies her and smiles as the Drover, a rugged cattle herder known for his fearless reputation in the Australian Outback, rides up while they pull away, in the tank used for watering cattle on the sprawling property. Nullah brings Daisy, a much-beloved family cow, to the surface, and as the truck drives away down the dusty road that winds through the desolate terrain, Drover hauls Daisy's body from the tank. Sarah sprints over, her years on the harsh land reflected in her determined stride, and Nullah desperately hugs his mother while Drover hangs his head as Nullah clings to the body with a child's raw grief. Bandy runs out of the house, a homestead dating back to the pioneering days of the early settlers, and the cop's truck continues down the long, straight, dusty road into the vast scrub lands of Faraway Downs, an expanse once heralded for its endless horizons. The windmill turns slowly at sunset as Sarah looks tearfully out towards Daisy's blazing funeral pyre, a traditional practice to honor their loss. Smoke drifts from the top of a rocky summit nearby, and Magarri signals to the hilltop, waving to King George, a revered elder and spiritual leader, who starts to chant, evoking the sacred stories of his ancestors. The body is carried towards the fire, with the old man looking down on the homestead from his hilltop in the soft glow of dawn that paints the land in serenity. Sarah steps out of the house as Drover sits down on the fence, a relic of the early cattle industry, and lights a cigarette, his face shadowed by contemplation. She looks distraught, reflecting the weight of the responsibilities she bears, and he frowns as she avoids his gaze. She walks to where Nullah is grieving, lying curled up on the ground on a mattress, made from worn-out sacks, while she's completely at a loss. She crouches down next to him, laying newspapers from a pile on the ground to kneel on, as she kneels and thinks, with the nearest front page featuring an advert for a film showcasing the glitz of Hollywood. He looks up and sees the smoke on the hilltop, a symbol of eternal connections between land and spirit while she looks perplexed, and he holds up his hand with a cloth tied around it, a makeshift bandage from a recent mishap, as she's not sure how to proceed. He watches her expectantly as she finishes with a self-deprecating flourish, and her eyes fill with tears in the blazing sun that casts stark shadows of reality. Sarah faces Drover in the saddle, drawing on their shared experiences to bridge the silence, and Nullah looks up as a twister starts to form in the dust in front of the house, a harbinger of change and upheaval. He looks unconvinced while Flynn, an enigmatic mechanic, salutes and eyeballs Sarah, and Bandy and Flynn nod as Sing Song, the jovial cook renowned for his culinary skills, winks and Nullah grins, finding solace in their odd camaraderie. Sing Song's chop wagon moves on, stocked with supplies for the long trek, as Drover opens the gate to the cattle pen, releasing the lowing beasts, and Drover marshals his motley gang of riders as the huge herd moves out of the pen, raising a massive cloud of dust that settles on their determined faces. The army of cattle moves off, a testament to the enduring spirit of the outback, while King George follows their progress from his rocky mountain top, a sentinel over the vast land. The herd approaches a wide river, a natural barrier in their journey, as Drover and Sarah ride ahead of the cattle, and the others ride behind and alongside, keeping them together like a well-oiled machine. Sing Song drives his wagon into the water, his confidence inspiring the group, and the crossing is successful. Crowds fill an open-air cinema in nighttime Darwin, a bustling frontier town during the war years, as Carney stares grimly and drops a curtain down between himself and Fletcher, who turns angrily away, tensions echoing the undercurrents of their rivalry. The drive moves on through the soft light of sunset, approaching a range of jagged vertical cliffs, formations that have stood for millennia, shaping legends and challenging those who dare to pass."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Bandy runs out of the house and the cop's truck continues down the long straight dusty road into the vast scrub lands of Faraway Downs Sing Song drives his wagon into the water and the crossing is successful Nullah notices and drops in after her and she eyes him coldly Sarah sprints over and Nullah desperately hugs his mother while Drover hangs his head as Nullah clings to the body He studies her and smiles as the Drover rides up while they pull away in the tank Nullah brings Daisy to the surface and as the truck drives away down the dusty road Drover hauls Daisy's body from the tank Sarah sprints over and Nullah desperately hugs his mother while Drover hangs his head as Nullah clings to the body Nullah notices and drops in after her and she eyes him coldly Sarah steps out of the house as Drover sits down on the fence and lights a cigarette Bandy runs out of the house and the cop's truck continues down the long straight dusty road into the vast scrub lands of Faraway Downs The windmill turns slowly at sunset as Sarah looks tearfully out towards Daisy's blazing funeral pyre Smoke drifts from the top of a rocky summit nearby and Magarri signals to the hilltop waving to King George who starts to chant Darwin as Carney stares grimly and drops a curtain down between himself and Fletcher who turns angrily away The body is carried towards the fire with the old man looking down on the homestead from his hilltop in the soft glow of dawn She looks distraught and he frowns as she avoids his gaze Sarah steps out of the house as Drover sits down on the fence and lights a cigarette She looks distraught and he frowns as she avoids his gaze Crowds fill an openair cinema in nighttime She walks to where Nullah is grieving lying curled up on the ground on a mattress while she is completely at a loss She crouches down next to him laying newspapers from a pile on the ground to kneel on as she kneels and thinks with the nearest front page having an advert for a film The body is carried towards the fire with the old man looking down on the homestead from his hilltop in the soft glow of dawn He looks up and sees the smoke on the hilltop while she looks perplexed and he holds up his hand with a cloth tied around it as she is not sure how to proceed He watches her expectantly as she finishes with a selfdeprecating flourish and her eyes fill with tears in the blazing sun The herd approaches a wide river as Drover and Sarah ride ahead of the cattle and the others ride behind and alongside keeping them together Sarah faces Drover in the saddle and Nullah looks up as a twister starts to form in the dust in front of the house He looks unconvinced while Flynn salutes and eyeballs Sarah and Bandy and Flynn nod as Sing Song winks and Nullah grins Sing Song's chop wagon moves on as Drover opens the gate to the cattle pen and Drover marshals his motley gang of riders as the huge herd moves out of the pen raising a massive cloud of dust Nullah brings Daisy to the surface and as the truck drives away down the dusty road Drover hauls Daisy's body from the tank Smoke drifts from the top of a rocky summit nearby and Magarri signals to the hilltop waving to King George who starts to chant The army of cattle moves off while King George follows their progress from his rocky mountain top The herd approaches a wide river as Drover and Sarah ride ahead of the cattle and the others ride behind and alongside keeping them together Sing Song drives his wagon into the water and the crossing is successful Crowds fill an openair cinema in nighttime Darwin as Carney stares grimly and drops a curtain down between himself and Fletcher who turns angrily away The drive moves on through the soft light of sunset approaching a range of jagged vertical cliffs"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Nullah notices and drops in after her and she eyes him coldly. He studies her and smiles as the Drover rides up while they pull away in the tank. Nullah brings Daisy to the surface and as the truck drives away down the dusty road Drover hauls Daisy's body from the tank. Sarah sprints over and Nullah desperately hugs his mother while Drover hangs his head as Nullah clings to the body. Bandy runs out of the house and the cop's truck continues down the long straight dusty road into the vast scrub lands of Faraway Downs. The windmill turns slowly at sunset as Sarah looks tearfully out towards Daisy's blazing funeral pyre. Smoke drifts from the top of a rocky summit nearby and Magarri signals to the hilltop waving to King George who starts to chant. The body is carried towards the fire with the old man looking down on the homestead from his hilltop in the soft glow of dawn. Sarah steps out of the house as Drover sits down on the fence and lights a cigarette. She looks distraught and he frowns as she avoids his gaze. She walks to where Nullah is grieving lying curled up on the ground on a mattress while she is completely at a loss. She crouches down next to him laying newspapers from a pile on the ground to kneel on as she kneels and thinks with the nearest front page having an advert for a film. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. He looks up and sees the smoke on the hilltop while she looks perplexed and he holds up his hand with a cloth tied around it as she is not sure how to proceed. He watches her expectantly as she finishes with a selfdeprecating flourish and her eyes fill with tears in the blazing sun. Sarah faces Drover in the saddle and Nullah looks up as a twister starts to form in the dust in front of the house. He looks unconvinced while Flynn salutes and eyeballs Sarah and Bandy and Flynn nod as Sing Song winks and Nullah grins. Sing Song's chop wagon moves on as Drover opens the gate to the cattle pen and Drover marshals his motley. gang of riders as the huge herd moves out of the pen raising a massive cloud of dust. The army of cattle moves off while King George follows their progress from his rocky mountain top. The herd approaches a wide river as Drover and Sarah ride ahead of the cattle and the others ride behind and alongside keeping them together. Sing Song drives his wagon into the water and the crossing is successful. Crowds fill an openair cinema in nighttime. Darwin as Carney stares grimly and drops a curtain down between himself and Fletcher who turns angrily away. The drive moves on through the soft light of sunset approaching a range of jagged vertical cliffs."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Nullah notices and drops in after her and she eyes him coldly. He studies her and smiles as the Drover rides up while they pull away in the tank. Nullah brings Daisy to the surface and as the truck drives away down the dusty road Drover hauls Daisy's body from the tank. Sarah sprints over and Nullah desperately hugs his mother while Drover hangs his head as Nullah clings to the body. Bandy runs out of the house and the cop's truck continues down the long straight dusty road into the vast scrub lands of Faraway Downs. The windmill turns slowly at sunset as Sarah looks tearfully out towards Daisy's blazing funeral pyre. Smoke drifts from the top of a rocky summit nearby and Magarri signals to the hilltop waving to King George who starts to chant. The body is carried towards the fire with the old man looking down on the homestead from his hilltop in the soft glow of dawn. Sarah steps out of the house as Drover sits down on the fence and lights a cigarette. She looks distraught and he frowns as she avoids his gaze. She walks to where Nullah is grieving lying curled up on the ground on a mattress while she is completely at a loss. She crouches down next to him laying newspapers from a pile on the ground to kneel on as she kneels and thinks with the nearest front page having an advert for a film. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. He looks up and sees the smoke on the hilltop while she looks perplexed and he holds up his hand with a cloth tied around it as she is not sure how to proceed. He watches her expectantly as she finishes with a selfdeprecating flourish and her eyes fill with tears in the blazing sun. Sarah faces Drover in the saddle and Nullah looks up as a twister starts to form in the dust in front of the house. He looks unconvinced while Flynn salutes and eyeballs Sarah and Bandy and Flynn nod as Sing Song winks and Nullah grins. Sing Song's chop wagon moves on as Drover opens the gate to the cattle pen and Drover marshals his motley. gang of riders as the huge herd moves out of the pen raising a massive cloud of dust. The army of cattle moves off while King George follows their progress from his rocky mountain top. The herd approaches a wide river as Drover and Sarah ride ahead of the cattle and the others ride behind and alongside keeping them together. Sing Song drives his wagon into the water and the crossing is successful. Crowds fill an openair cinema in nighttime. Darwin as Carney stares grimly and drops a curtain down between himself and Fletcher who turns angrily away. The drive moves on through the soft light of sunset approaching a range of jagged vertical cliffs."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Nullah notices and drops in after her and she eyes him coldly. He studies her and smiles as the Drover rides up while they pull away in the tank. Nullah brings Daisy to the surface and as the truck drives away down the dusty road Drover hauls Daisy's body from the tank. Sarah sprints over and Nullah desperately hugs his mother while Drover hangs his head as Nullah clings to the body. Bandy runs out of the house and the cop's truck continues down the long straight dusty road into the vast scrub lands of Faraway Downs. The windmill turns slowly at sunset as Sarah looks tearfully out towards Daisy's blazing funeral pyre. The army of cattle moves off while King George follows their progress from his rocky mountain top. The herd approaches a wide river as Drover and Sarah ride ahead of the cattle and the others ride behind and alongside keeping them together. Sing Song drives his wagon into the water and the crossing is successful. Crowds fill an openair cinema in nighttime. Darwin as Carney stares grimly and drops a curtain down between himself and Fletcher who turns angrily away. The drive moves on through the soft light of sunset approaching a range of jagged vertical cliffs."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Nullah notices and drops in after her and she eyes him coldly. He studies her and smiles as the Drover rides up while they pull away in the tank. Nullah brings Daisy to the surface and as the truck drives away down the dusty road Drover hauls Daisy's body from the tank. Darwin as Carney stares grimly and drops a curtain down between himself and Fletcher who turns angrily away. The drive moves on through the soft light of sunset approaching a range of jagged vertical cliffs."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Nullah notices and drops in after her, and the elephant eyes him coldly. The cat studies her and smiles as the rabbit rides up while they pull away, in the tank. Nullah brings Daisy to the surface, and as the truck drives away down the dusty road, the rabbit hauls Daisy's body from the tank. The giraffe sprints over, and Nullah desperately hugs his mother while the rabbit hangs his head as Nullah clings to the body. The bear runs out of the house, and the squirrel's truck continues down the long, straight, dusty road into the vast scrub lands of Faraway Downs. The windmill turns slowly at sunset as the giraffe looks tearfully out towards Daisy's blazing funeral pyre. Smoke drifts from the top of a rocky summit nearby, and the kangaroo signals to the hilltop, waving to the owl who starts to chant. The body is carried towards the fire, with the old manatee looking down on the homestead from his hilltop in the soft glow of dawn. The giraffe steps out of the house as the rabbit sits down on the fence and lights a cigarette. The giraffe looks distraught, and the rabbit frowns as the giraffe avoids his gaze. The giraffe walks to where Nullah is grieving, lying curled up on the ground on a mattress, while the giraffe is completely at a loss. The giraffe crouches down next to him, laying newspapers from a pile on the ground to kneel on, as the giraffe kneels and thinks, with the nearest front page having an advert for a film. The cat looks up and sees the smoke on the hilltop while the giraffe looks perplexed, and the cat holds up his hand with a cloth tied around it as the giraffe is not sure how to proceed. The cat watches the giraffe expectantly as the giraffe finishes with a self-deprecating flourish, and her eyes fill with tears in the blazing sun. The giraffe faces the rabbit in the saddle, and Nullah looks up as a twister starts to form in the dust in front of the house. The cat looks unconvinced while the fox salutes and eyeballs the giraffe, and the bear and the fox nod as the donkey winks and Nullah grins. The donkey's chop wagon moves on as the rabbit opens the gate to the cattle pen, and the rabbit marshals his motley gang of riders as the huge herd moves out of the pen, raising a massive cloud of dust. The army of cattle moves off, while the owl follows their progress from his rocky mountain top. The herd approaches a wide river as the rabbit and the giraffe ride ahead of the cattle, and the others ride behind and alongside, keeping them together. The donkey drives his wagon into the water, and the crossing is successful. Crowds fill an open-air cinema in nighttime Darwin as the lion stares grimly and drops a curtain down between himself and the turtle, who turns angrily away. The drive moves on through the soft light of sunset, approaching a range of jagged vertical cliffs."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Nullah notices and drops in after her, and she eyes him coldly. He studies her and smiles as the Drover rides up while they pull away, in the canoe. Nullah brings Garnet to the surface, and as the bicycle rides away down the grassy trail, Drover hauls Garnet's body from the canoe. Sarah sprints over, and Nullah desperately hugs his mother while Drover hangs his head as Nullah clings to the body. Bandy runs out of the barn, and the conductor's bicycle continues down the long, winding, grassy trail into the vast meadows of Faraway Downs. The lighthouse turns slowly at sunset as Sarah looks tearfully out towards Garnet's glowing fireworks display. Mist drifts from the top of a sandy hill nearby, and Magarri signals to the plateau, waving to King George who starts to chant. The body is carried towards the fireworks, with the old man looking down on the orchard from his plateau in the soft glow of dawn. Sarah steps out of the barn as Drover sits down on the wheelbarrow and lights a lantern. She looks distraught, and he frowns as she avoids his gaze. She walks to where Nullah is grieving, lying curled up on the ground on a hammock, while she's completely at a loss. She crouches down next to him, laying diaries from a pile on the ground to kneel on, as she kneels and thinks, with the nearest front page having an advert for a concert. He looks up and sees the mist on the plateau while she looks perplexed, and he holds up his hand with a ribbon tied around it as she's not sure how to proceed. He watches her expectantly as she finishes with a self-deprecating flourish, and her eyes fill with tears in the blazing sun. Sarah faces Drover in the carriage, and Nullah looks up as a rainbow starts to form in the dew in front of the barn. He looks unconvinced while Flynn salutes and eyeballs Sarah, and Bandy and Flynn nod as Sing Song winks and Nullah grins. Sing Song's parade float moves on as Drover opens the gate to the pigsty, and Drover marshals his motley gang of riders as the huge flock moves out of the sty, raising a massive cloud of dew. The army of sheep moves off, while King George follows their progress from his sandy hilltop. The flock approaches a narrow creek as Drover and Sarah ride ahead of the sheep, and the others ride behind and alongside, keeping them together. Sing Song drives his float into the water, and the crossing is successful. Crowds fill an open-air theater in nighttime Darwin as Carney stares grimly and drops a curtain down between himself and Fletcher, who turns angrily away. The drive moves on through the soft light of sunset, approaching a range of rounded vertical rocks."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Nullah observes and hops in after her, and she examines him coldly. He analyzes her and grins as the Drover strolls up while they drift away, in the tank. Nullah lifts Daisy to the surface, and as the truck cruises away down the dusty road, Drover hoists Daisy's body from the tank. Sarah dashes over, and Nullah tightly embraces his mother while Drover lowers his head as Nullah holds onto the body. Bandy rushes out of the house, and the cop's truck rolls down the long, straight, dusty road into the vast scrub lands of Faraway Downs. The windmill rotates slowly at sunset as Sarah gazes tearfully out towards Daisy's blazing funeral pyre. Smoke wafts from the top of a rocky summit nearby, and Magarri gestures to the hilltop, signaling to King George who begins to hum. The body is transported towards the fire, with the old man gazing down on the homestead from his hilltop in the soft glow of dawn. Sarah emerges from the house as Drover settles down on the fence and ignites a cigarette. She appears distraught, and he scowls as she avoids his gaze. She strides to where Nullah is grieving, lying curled up on the ground on a mattress, while she's completely at a loss. She bends down next to him, spreading newspapers from a pile on the ground to kneel on, as she kneels and ponders, with the nearest front page showing an advert for a film. He glances up and spots the smoke on the hilltop while she appears perplexed, and he raises his hand with a cloth tied around it as she's uncertain how to proceed. He observes her expectantly as she concludes with a self-deprecating flourish, and her eyes well up with tears beneath the blazing sun. Sarah confronts Drover in the saddle, and Nullah glances up as a whirlwind begins to coil in the dust in front of the house. He seems doubtful while Flynn salutes and scrutinizes Sarah, and Bandy and Flynn nod as Sing Song blinks and Nullah beams. Sing Song's chop wagon glides on as Drover swings the gate to the cattle pen, and Drover assembles his varied gang of riders as the huge herd streams out of the pen, stirring a massive cloud of dust. The army of cattle proceeds, while King George monitors their journey from his rocky mountain top. The herd nears a wide river as Drover and Sarah glide ahead of the cattle, and the others trail behind and flank them, keeping them together. Sing Song steers his wagon into the water, and the crossing is achieved. Crowds gather at an open-air cinema in nighttime Darwin as Carney glares grimly and lowers a curtain between himself and Fletcher, who turns away angrily. The drive rolls on through the soft light of sunset, nearing a range of jagged vertical cliffs."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Crankshaft notices and drops in after her, and she eyes him coldly. He studies her and smiles as the Trowel rides up while they pull away, in the jug. Crankshaft brings Ribbon to the surface, and as the suitcase drives away down the dusty road, Trowel hauls Ribbon's portrait from the jug. Melody sprints over, and Crankshaft desperately hugs his suitcase while Trowel hangs his head as Crankshaft clings to the portrait. Marble runs out of the barn, and the shoe's lamp continues down the long, straight, dusty road into the vast scrub lands of Faraway Swirls. The gramophone turns slowly at sunset as Melody looks tearfully out towards Ribbon's blazing graduation cake. Leaves drift from the top of a rocky necklace nearby, and Nebula signals to the shoelace, waving to Emperor Neptune who starts to hum. The portrait is carried towards the cake, with the old tree looking down on the lighthouse from his shoelace in the soft glow of dawn. Melody steps out of the barn as Trowel sits down on the wardrobe and lights a candle. She looks distraught, and he frowns as she avoids his gaze. She walks to where Crankshaft is grieving, lying curled up on the ground on a banister, while she's completely at a loss. She crouches down next to him, laying postcards from a pile on the ground to kneel on, as she kneels and thinks, with the nearest front page having an advert for a book. He looks up and sees the leaves on the shoelace while she looks perplexed, and he holds up his wrist with a scarf tied around it as she's not sure how to proceed. He watches her expectantly as she finishes with a self-deprecating flourish, and her eyes fill with tears in the blazing sun. Melody faces Trowel in the hammock, and Crankshaft looks up as a whirlwind starts to form in the dust in front of the barn. He looks unconvinced while Paintbrush salutes and eyeballs Melody, and Marble and Paintbrush nod as Cyan Song winks and Crankshaft grins. Cyan Song's jump rope moves on as Trowel opens the gate to the window pane, and Trowel marshals his motley bouquet of drummers as the huge ensemble moves out of the pane, raising a massive cloud of dust. The army of trumpets moves off, while Emperor Neptune follows their progress from his rocky fountain top. The ensemble approaches a wide meadow as Trowel and Melody ride ahead of the trumpets, and the others ride behind and alongside, keeping them together. Cyan Song drives his jump rope into the water, and the crossing is successful. Crowds fill an open-air laboratory in nighttime Aspen as Lantern stares grimly and drops a curtain down between himself and Paintbrush, who turns angrily away. The drive moves on through the soft light of sunset, approaching a range of jagged vertical lanterns."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Blinky spies and jumps in after her, and she glares at him coolly. He observes her and chuckles as the Wrangler strolls up while they drift away, in the tank. Blinky lifts Daisy to the surface, and as the vehicle rolls away down the dusty road, Wrangler lifts Daisy's figure from the tank. Emily runs over, and Blinky eagerly embraces his aunt while Wrangler lowers his head as Blinky clings to the figure. Butch darts out of the barn, and the detective's truck trundles down the long, straight, dusty road into the vast plains of Distant Downs. The windmill spins gently at sunset as Emily gazes tearfully out towards Daisy's roaring funeral pyre. Smoke wafts from the top of a craggy summit nearby, and Jobe gestures to the hilltop, waving to Elder George who begins to sing. The figure is carried towards the blaze, with the elder surveying the homestead from his summit in the soft light of dawn. Emily steps out of the barn as Wrangler perches on the fence and ignites a pipe. She appears troubled, and he scowls as she evades his eyes. She strides to where Blinky is lamenting, lying curled up on the ground on a mattress, while she's utterly bewildered. She bends down next to him, spreading newspapers from a heap on the ground to lean on, as she kneels and ponders, with the nearest front page having an advert for a concert. He glances up and notices the smoke on the summit while she looks baffled, and he raises his hand with a scarf wrapped around it as she's unsure how to proceed. He watches her keenly as she concludes with a playful gesture, and her eyes well up with tears in the blazing sun. Emily faces Wrangler in the saddle, and Blinky glances up as a whirlwind begins to swirl in the dust in front of the barn. He looks skeptical while Riley salutes and examines Emily, and Butch and Riley nod as Bucko winks and Blinky beams. Bucko's noodle wagon rolls on as Wrangler swings open the gate to the livestock pen, and Wrangler commands his eclectic crew of riders as the vast herd moves out of the pen, stirring a tremendous cloud of dust. The mass of livestock moves off, while Elder George tracks their path from his craggy mountain peak. The herd nears a wide stream as Wrangler and Emily ride ahead of the cattle, and the others ride behind and alongside, keeping them together. Bucko drives his wagon into the water, and the passage is smooth. Crowds gather at an open-air theater in nighttime Darwin as Marney gazes solemnly and lowers a curtain between himself and Fletcher, who storms away angrily. The expedition continues through the soft glow of sunset, nearing a series of jagged vertical cliffs."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Nullah observes and hovers after her, and she glares at him suspiciously. He examines her and chuckles as the Drover glides up while they drift away, in the submarine. Nullah lifts Daisy to the shoreline, and as the bicycle rolls away down the grassy path, Drover drags Daisy's form from the submarine. Sarah jogs over, and Nullah eagerly embraces his mother while Drover lowers his head as Nullah holds onto the form. Bandy dashes out of the cabin, and the sailor's van proceeds down the winding, narrow, grassy path into the dense forest of Faraway Downs. The weather vane spins slowly at sunrise as Sarah gazes tearfully out towards Daisy's burning bonfire. Steam wafts from the top of a mossy hill nearby, and Magarri gestures to the ridge, waving to King George who begins to whisper. The form is transported towards the embers, with the elder surveying the homestead from his ridge in the gentle light of dusk. Sarah steps out of the cabin as Drover perches on the bench and ignites a cigar. She appears troubled, and he grimaces as she sidesteps his gaze. She strolls to where Nullah is mourning, sprawled out on the ground on a blanket, while she's completely bewildered. She kneels down next to him, spreading magazines from a stack on the ground to sit on, as she sits and ponders, with the nearest cover featuring an advert for a concert. He glances up and notices the steam on the ridge while she looks confused, and he raises his hand with a ribbon tied around it as she's unsure of what to do next. He observes her expectantly as she concludes with a bashful wave, and her eyes well up with tears in the glaring sun. Sarah faces Drover in the carriage, and Nullah looks up as a cyclone begins to spin in the mist in front of the cabin. He looks skeptical while Flynn salutes and squints at Sarah, and Bandy and Flynn agree as Sing Song nods and Nullah laughs. Sing Song's pushcart rolls on as Drover unlocks the gate to the horse stable, and Drover leads his diverse group of riders as the enormous flock moves out of the stable, kicking up a vast mist of dirt. The legion of sheep moves on, while King George tracks their movement from his mossy mountain ridge. The flock nears a wide chasm as Drover and Sarah advance ahead of the sheep, and the others follow behind and beside, ensuring they stay together. Sing Song steers his pushcart into the gorge, and the journey is successful. Crowds gather at an outdoor concert in nighttime Darwin as Carney stares sternly and lowers a curtain down between himself and Fletcher, who turns irately away. The expedition continues through the gentle glow of dusk, approaching a series of jagged horizontal ridges."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Nullah observes and settles down before her, and she glares at him indifferently. He examines her and grins as the Cyclist pedals up while they sail away, in the spaceship. Nullah pushes Petunia to the surface, and as the limo rolls away down the paved street, Cyclist lifts Petunia's form from the spaceship. Olivia dashes over, and Nullah frantically embraces his aunt while Cyclist bows his head as Nullah clutches the figure. Bandy sprints out of the barn, and the detective's van progresses down the lengthy, winding, paved street into the expansive farmlands of Nearby Plains. The kite spins gently at dawn as Olivia gazes tearfully out towards Petunia's towering bonfire. Mist wafts from the peak of a grassy hill nearby, and Magarri gestures to the plateau, motioning to King Louis who begins to sing. The figure is moved towards the blaze, with the elder observing the estate from his plateau in the dim light of twilight. Olivia strides out of the barn as Cyclist perches on the gate and ignites a cigar. She appears troubled, and he scowls as she avoids his look. She strides to where Nullah is mourning, resting curled up on the turf on a blanket, while she's completely bewildered. She bends down next to him, placing papers from a bundle on the turf to kneel on, as she kneels and reflects, with the closest headline displaying an advert for a concert. He glances up and observes the mist on the plateau while she appears puzzled, and he raises his hand with a ribbon tied around it as she's unsure how to act. He observes her expectantly as she concludes with a self-mocking gesture, and her eyes well up in tears in the scorching daylight. Olivia confronts Cyclist in the cart, and Nullah glances up as a hurricane begins to spin in the sand in front of the barn. He seems doubtful while Henry salutes and scrutinizes Olivia, and Bandy and Henry agree as Sing Song blinks and Nullah beams. Sing Song's vegetable truck continues as Cyclist unfastens the barrier to the livestock barn, and Cyclist directs his mixed crew of performers as the massive troupe exits the barn, stirring an enormous haze of sand. The caravan of livestock moves along, while King Louis tracks their journey from his grassy hilltop. The troupe nears a broad lake as Cyclist and Olivia journey ahead of the livestock, and the others follow behind and alongside, keeping them united. Sing Song navigates his truck into the pond, and the voyage is triumphant. Spectators pack an open-air theater in evening Arkham as Carney glances sternly and pulls a shade down between himself and Fletcher, who pivots irately away. The voyage advances through the gentle glow of twilight, nearing a series of rugged horizontal crests."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Nullah follows Sarah into the tank as Drover approaches. Nullah surfaces with Daisy, and Drover retrieves Daisy's body while Nullah clings to her, grieving. Sarah tearfully watches Daisy's funeral pyre, while Magarri signals to King George, who chants from a hilltop. Sarah, distressed, watches Nullah mourn on a mattress and kneels beside him, unsure how to comfort him. Meanwhile, a dust twister forms as Drover leads a diverse group to drive cattle, creating a dust cloud. King George observes them from atop a mountain. The cattle successfully cross a wide river with Drover and Sarah leading. In nighttime Darwin, crowds gather at an open-air cinema as tension builds between Carney and Fletcher. The drive continues into the sunset, nearing jagged cliffs."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The drive moves on through the soft light of sunset approaching a range of jagged vertical cliffs Darwin as Carney stares grimly and drops a curtain down between himself and Fletcher who turns angrily away Crowds fill an openair cinema in nighttime Sing Song drives his wagon into the water and the crossing is successful The herd approaches a wide river as Drover and Sarah ride ahead of the cattle and the others ride behind and alongside keeping them together The army of cattle moves off while King George follows their progress from his rocky mountain top gang of riders as the huge herd moves out of the pen raising a massive cloud of dust Sing Song's chop wagon moves on as Drover opens the gate to the cattle pen and Drover marshals his motley He looks unconvinced while Flynn salutes and eyeballs Sarah and Bandy and Flynn nod as Sing Song winks and Nullah grins Sarah faces Drover in the saddle and Nullah looks up as a twister starts to form in the dust in front of the house He watches her expectantly as she finishes with a selfdeprecating flourish and her eyes fill with tears in the blazing sun He looks up and sees the smoke on the hilltop while she looks perplexed and he holds up his hand with a cloth tied around it as she is not sure how to proceed She crouches down next to him laying newspapers from a pile on the ground to kneel on as she kneels and thinks with the nearest front page having an advert for a film She walks to where Nullah is grieving lying curled up on the ground on a mattress while she is completely at a loss She looks distraught and he frowns as she avoids his gaze Sarah steps out of the house as Drover sits down on the fence and lights a cigarette The body is carried towards the fire with the old man looking down on the homestead from his hilltop in the soft glow of dawn Smoke drifts from the top of a rocky summit nearby and Magarri signals to the hilltop waving to King George who starts to chant The windmill turns slowly at sunset as Sarah looks tearfully out towards Daisy's blazing funeral pyre Bandy runs out of the house and the cop's truck continues down the long straight dusty road into the vast scrub lands of Faraway Downs Sarah sprints over and Nullah desperately hugs his mother while Drover hangs his head as Nullah clings to the body Nullah brings Daisy to the surface and as the truck drives away down the dusty road Drover hauls Daisy's body from the tank He studies her and smiles as the Drover rides up while they pull away in the tank Nullah notices and drops in after her and she eyes him coldly"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He looks unconvinced while Flynn salutes and eyeballs Sarah and Bandy and Flynn nod as Sing Song winks and Nullah grins The windmill turns slowly at sunset as Sarah looks tearfully out towards Daisy's blazing funeral pyre The army of cattle moves off while King George follows their progress from his rocky mountain top The drive moves on through the soft light of sunset approaching a range of jagged vertical cliffs He watches her expectantly as she finishes with a selfdeprecating flourish and her eyes fill with tears in the blazing sun She walks to where Nullah is grieving lying curled up on the ground on a mattress while she is completely at a loss gang of riders as the huge herd moves out of the pen raising a massive cloud of dust She crouches down next to him laying newspapers from a pile on the ground to kneel on as she kneels and thinks with the nearest front page having an advert for a film Sarah faces Drover in the saddle and Nullah looks up as a twister starts to form in the dust in front of the house Sing Song's chop wagon moves on as Drover opens the gate to the cattle pen and Drover marshals his motley He studies her and smiles as the Drover rides up while they pull away in the tank He looks up and sees the smoke on the hilltop while she looks perplexed and he holds up his hand with a cloth tied around it as she is not sure how to proceed Crowds fill an openair cinema in nighttime Smoke drifts from the top of a rocky summit nearby and Magarri signals to the hilltop waving to King George who starts to chant She looks distraught and he frowns as she avoids his gaze Nullah brings Daisy to the surface and as the truck drives away down the dusty road Drover hauls Daisy's body from the tank Darwin as Carney stares grimly and drops a curtain down between himself and Fletcher who turns angrily away Bandy runs out of the house and the cop's truck continues down the long straight dusty road into the vast scrub lands of Faraway Downs The herd approaches a wide river as Drover and Sarah ride ahead of the cattle and the others ride behind and alongside keeping them together The body is carried towards the fire with the old man looking down on the homestead from his hilltop in the soft glow of dawn Sarah steps out of the house as Drover sits down on the fence and lights a cigarette Nullah notices and drops in after her and she eyes him coldly Sarah sprints over and Nullah desperately hugs his mother while Drover hangs his head as Nullah clings to the body Sing Song drives his wagon into the water and the crossing is successful"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He looks up and sees the smoke on the hilltop while she looks perplexed and he holds up his hand with a cloth tied around it as she is not sure how to proceed He watches her expectantly as she finishes with a selfdeprecating flourish and her eyes fill with tears in the blazing sun Sarah faces Drover in the saddle and Nullah looks up as a twister starts to form in the dust in front of the house He looks unconvinced while Flynn salutes and eyeballs Sarah and Bandy and Flynn nod as Sing Song winks and Nullah grins Sing Song's chop wagon moves on as Drover opens the gate to the cattle pen and Drover marshals his motley gang of riders as the huge herd moves out of the pen raising a massive cloud of dust The army of cattle moves off while King George follows their progress from his rocky mountain top The herd approaches a wide river as Drover and Sarah ride ahead of the cattle and the others ride behind and alongside keeping them together Sing Song drives his wagon into the water and the crossing is successful Crowds fill an openair cinema in nighttime Darwin as Carney stares grimly and drops a curtain down between himself and Fletcher who turns angrily away The drive moves on through the soft light of sunset approaching a range of jagged vertical cliffs Nullah notices and drops in after her and she eyes him coldly He studies her and smiles as the Drover rides up while they pull away in the tank Nullah brings Daisy to the surface and as the truck drives away down the dusty road Drover hauls Daisy's body from the tank Sarah sprints over and Nullah desperately hugs his mother while Drover hangs his head as Nullah clings to the body Bandy runs out of the house and the cop's truck continues down the long straight dusty road into the vast scrub lands of Faraway Downs The windmill turns slowly at sunset as Sarah looks tearfully out towards Daisy's blazing funeral pyre Smoke drifts from the top of a rocky summit nearby and Magarri signals to the hilltop waving to King George who starts to chant The body is carried towards the fire with the old man looking down on the homestead from his hilltop in the soft glow of dawn Sarah steps out of the house as Drover sits down on the fence and lights a cigarette She looks distraught and he frowns as she avoids his gaze She walks to where Nullah is grieving lying curled up on the ground on a mattress while she is completely at a loss She crouches down next to him laying newspapers from a pile on the ground to kneel on as she kneels and thinks with the nearest front page having an advert for a film"
        }
      ]
    }
  ]
}