{
  "ground_truth": "Aron, sitting with his legs drawn up in front of him, slowly gets up to his feet, and throws the cloth bundle over his shoulder as dark green conifers stretch as far as the eye can see. A man strides through the undergrowth and comes across Asael lying asleep by a tree with Aron in his arms. The stone-faced man in his late thirties, in a cloth cap and a brown leather jacket over heavy wool trousers, picks up a stone and tosses it onto the ground. Asael wakes up, gets to his feet, and Tuvia grabs him roughly. The two brothers hug fiercely, and Tuvia beckons to their youngest brother, and all three stand locked in a hug. Zus appears carrying kindling, and Tuvia nods bitterly as Zus fishes in his pocket, brings out the mezuzah, and tosses it to Tuvia, then drops the kindling to the ground. As Zus starts snapping the twigs, Tuvia glances at the Hebrew markings on the mezuzah and hugs Aron even more tightly. Zus hands Tuvia some vodka, and the four of them huddle together in the pouring rain, with Aron sitting with a coat on his head listening quietly. They have a little fire near to a stream. Tuvia crouches down next to Zus, who is the tallest of the three adults, while elsewhere in the forest, ants scurry over a mound of twigs. Aron pushes a stick into the mud with a curious expression and watches several ants climb onto it, brings the stick closer to him, and studies their movements. He reels around and spots a female figure running through the trees some distance away, gets to his feet, and starts to run after her. He stops between two silver birch trees and watches the teen girl run towards a gray-bearded man in a Homburg hat, shirt and waistcoat, and suit trousers sitting on a log with a little girl in his arms. Aron looks in another direction and sees a young man accompanying an old woman. From behind more trees, a man in a black hat and black overcoat with a smartly dressed woman are standing. Clutching his stick, Aron steps towards a mud ditch in the middle of a clearing, where the long winding ditch is full of dead bodies piled on top of each other, and Aron's eyes fill with horror. His brothers are sitting around the fire, and Zus and Tuvia look at each other. Aron has brought the old man and the child, and Tuvia lays the child down near the fire. Zus, armed with a rifle, watches the other people arrive, and he and Tuvia glance at each other in mute surprise as the old man weeps and strokes the little girl's glossy dark hair.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Aron, seated with his limbs drawn up in front of him, slowly rises to his feet, and hurls the fabric bundle over his shoulder as dark emerald conifers extend as far as the vision can perceive. A gentleman strides through the underbrush and encounters Asael lying asleep by a tree with Aron in his embrace. The stone-faced individual in his late thirties, in a cloth cap and a brown leather jacket over heavy wool pants, picks up a rock and flings it onto the soil. Asael awakens, rises to his feet, and Tuvia seizes him roughly. The two siblings embrace fiercely, and Tuvia signals to their youngest brother, and all three stand locked in an embrace. Zus emerges carrying kindling, and Tuvia nods bitterly as Zus rummages in his pocket, brings out the mezuzah, and flings it to Tuvia, then drops the kindling to the ground. As Zus starts snapping the twigs, Tuvia glances at the Hebrew inscriptions on the mezuzah and embraces Aron even more tightly. Zus hands Tuvia some vodka, and the four of them huddle together in the pouring rain, with Aron seated with a coat on his head listening quietly. They have a small fire near to a stream. Tuvia crouches down next to Zus, who is the tallest of the three adults, while elsewhere in the woods, ants scurry over a heap of twigs. Aron pushes a stick into the soil with a curious expression and watches several ants climb onto it, brings the stick nearer to him, and examines their movements. He spins around and notices a female figure sprinting through the trees some distance away, rises to his feet, and begins to run after her. He pauses between two silver birch trees and watches the teen girl run towards a gray-bearded man in a Homburg hat, shirt and waistcoat, and suit pants seated on a log with a little girl in his embrace. Aron looks in another direction and sees a young man accompanying an elderly woman. From behind more trees, a man in a black hat and black overcoat with a smartly dressed woman are standing. Clutching his stick, Aron steps towards a mud ditch in the middle of a clearing, where the long winding ditch is full of dead bodies piled on top of each other, and Aron's eyes fill with horror. His brothers are sitting around the fire, and Zus and Tuvia look at each other. Aron has brought the elderly man and the child, and Tuvia lays the child down near the fire. Zus, armed with a rifle, watches the other individuals arrive, and he and Tuvia glance at each other in silent surprise as the elderly man weeps and strokes the little girl's glossy dark hair."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Aron, while sitting with his legs drawn up in front of him, slowly gets up to his feet, and the cloth bundle is thrown over his shoulder by him as dark green conifers stretch as far as the eye can see. A man strides through the undergrowth and comes across Asael lying asleep by a tree with Aron in his arms. The stone-faced man in his late thirties, in a cloth cap and a brown leather jacket over heavy wool trousers, picks up a stone and it is tossed onto the ground by him. Asael wakes up, gets to his feet, and he is grabbed roughly by Tuvia. The two brothers hug fiercely, and their youngest brother is beckoned by Tuvia, and all three stand locked in a hug. Zus appears carrying kindling, and Tuvia nods bitterly as Zus fishes in his pocket, brings out the mezuzah, and it is tossed to Tuvia, then the kindling is dropped to the ground by him. As Zus starts snapping the twigs, the Hebrew markings on the mezuzah are glanced at by Tuvia, and Aron is hugged even more tightly by him. Tuvia is handed some vodka by Zus, and the four of them huddle together in the pouring rain, with Aron sitting with a coat on his head listening quietly. A little fire is had by them near to a stream. Tuvia crouches down next to Zus, who is the tallest of the three adults, while elsewhere in the forest, ants scurry over a mound of twigs. Aron pushes a stick into the mud with a curious expression and watches several ants climb onto it, brings the stick closer to him, and studies their movements. He reels around and spots a female figure running through the trees some distance away, gets to his feet, and starts to run after her. He stops between two silver birch trees and watches the teen girl run towards a gray-bearded man in a Homburg hat, shirt and waistcoat, and suit trousers sitting on a log with a little girl in his arms. Aron looks in another direction and sees a young man accompanying an old woman. From behind more trees, a man in a black hat and black overcoat with a smartly dressed woman is standing. Clutching his stick, Aron steps towards a mud ditch in the middle of a clearing, where the long winding ditch is filled with dead bodies piled on top of each other, and horror fills Aron's eyes. His brothers are sitting around the fire, and each other is looked at by Zus and Tuvia. Aron brings the old man and the child, and the child is laid down near the fire by Tuvia. Armed with a rifle, Zus watches the other people arrive, and he and Tuvia glance at each other in mute surprise as the old man weeps and strokes the little girl's glossy dark hair."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Aron, seated with legs pulled in, rises and slings a cloth bundle over his shoulder as dark green conifers stretch infinitely. A man approaches Asael, asleep by a tree with Aron, and tosses a stone to wake him. Asael stands, and Tuvia grabs him roughly, leading to a fierce hug. Tuvia calls their youngest brother, and they embrace. Zus, carrying kindling, tosses a mezuzah to Tuvia, who glances at its Hebrew markings and hugs Aron more tightly. Zus gives Tuvia vodka, and they huddle in the rain near a stream. Aron, under a coat, listens quietly as Tuvia crouches beside Zus. Aron watches ants on a stick, sees a girl running, and follows. He stops between birch trees, observing a girl with a gray-bearded man on a log. Aron notices a young man with an old woman and a couple nearby. Clutching his stick, Aron approaches a mud ditch filled with bodies, eyes filled with horror. His brothers sit by the fire; Zus and Tuvia share a glance. Aron brings the old man and child; Tuvia lays the child by the fire as Zus watches others arrive. The old man weeps, stroking the girl's dark hair, and Zus and Tuvia exchange a surprised look."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Aron, sitting with his legs drawn up, stands and throws a bundle over his shoulder as dark green conifers stretch endlessly. A man finds Asael asleep by a tree with Aron. The stone-faced man in his late thirties, wearing a cloth cap, leather jacket, and wool trousers, tosses a stone on the ground. Asael wakes, stands, and Tuvia roughly grabs him. The brothers hug fiercely as Tuvia calls their youngest brother, and all three embrace. Zus arrives with kindling, and Tuvia nods bitterly as Zus throws a mezuzah to him, then drops the kindling. As Zus snaps twigs, Tuvia studies the mezuzah and hugs Aron tighter. Zus gives Tuvia vodka, and they huddle in the rain, Aron sitting with a coat on his head listening quietly. They have a fire near a stream. Tuvia crouches by Zus, the tallest adult. Elsewhere, ants scurry over twigs. Aron curiously prods a stick into the mud, watching ants climb it. He sees a girl running, chases her, then stops between birch trees and observes her reach a gray-bearded man with a girl in his arms. Nearby, a young man accompanies an old woman, and a man in a black hat with a woman stands. Clutching his stick, Aron approaches a ditch filled with bodies, his eyes filled with horror. His brothers at the fire, Zus with a rifle, watch others arrive. Aron brings the old man and child, and Tuvia places the child by the fire. The old man weeps, stroking the child's hair, as Zus and Tuvia exchange glances."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Aron, sitting with his legs drawn up in front of him, takes a moment before he slowly rises to his feet, gradually lifting himself up and throwing the cloth bundle over his shoulder. In the distance, dark green conifers stretch endlessly as far as the eye can see, creating a vast, verdant tapestry. Meanwhile, a man strides purposefully through the undergrowth, making his way through the dense foliage, and eventually comes across Asael, who is lying asleep by a tree with Aron cradled protectively in his arms. The stone-faced man, appearing to be in his late thirties, is dressed in a cloth cap and a brown leather jacket that he wears over heavy wool trousers. He bends down, picks up a stone, and deliberately tosses it onto the ground. The noise wakes Asael, who then gets to his feet, and Tuvia, the man who picked up the stone, grabs him roughly. Despite the roughness, the two brothers embrace fiercely, a testament to their bond, and Tuvia waves over their youngest brother, and all three siblings stand united in a locked hug. Zus then appears, carrying kindling, and Tuvia acknowledges him with a bitter nod as Zus reaches into his pocket, pulls out a mezuzah, and throws it to Tuvia before letting the kindling drop to the ground. As Zus begins to snap the twigs, Tuvia examines the Hebrew markings on the mezuzah and hugs Aron even more tightly, feeling a deep connection. Zus then hands Tuvia some vodka, and the four of them huddle together in the pouring rain, with Aron sitting quietly, a coat draped over his head. A small fire flickers nearby, close to a stream. Tuvia crouches down beside Zus, who stands as the tallest among the three adults, while elsewhere in the expansive forest, ants scurry busily over a mound of twigs. Resembling a curious scholar, Aron pushes a stick into the mud with a look of interest and watches as several ants climb onto it, bringing the stick closer to his face to study their movements. Suddenly, he turns around and notices a female figure dashing through the trees in the distance. He quickly gets to his feet and begins to run in pursuit of her. He comes to a halt between two silver birch trees, watching the teenage girl run towards a gray-bearded man wearing a Homburg hat, shirt, waistcoat, and suit trousers, sitting on a log with a little girl held tenderly in his arms. Aron then shifts his gaze in another direction and sees a young man assisting an elderly woman. From behind additional trees, there stands a man in a black hat and black overcoat alongside a smartly dressed woman. Clutching his stick tightly, Aron steps hesitantly towards a mud ditch in the middle of a clearing, where the long, winding ditch is filled with the harrowing sight of dead bodies piled on top of each other, and his eyes reflect the horror he feels. Back at the campsite, his brothers are seated around the fire, and Zus and Tuvia exchange meaningful glances with each other. Aron has now brought the old man and the child with him, and Tuvia gently lays the child down near the warmth of the fire. With a rifle in hand, Zus watches vigilantly as other people arrive, and he and Tuvia exchange glances of mute surprise as the old man weeps and tenderly strokes the little girl's glossy dark hair."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Aron, sitting with his legs drawn up in front of him, takes a moment of contemplation before he gradually rises to his feet. He slowly lifts himself up, taking care to steady himself, and throws the cloth bundle over his shoulder with a practiced motion. In the distance, the dark green conifers stretch endlessly as far as the eye can see, creating a vast, verdant tapestry that seems to have no end. Meanwhile, a man strides purposefully through the dense undergrowth, making his way through the thick foliage, and eventually comes across Asael, who is lying asleep by a tree with Aron cradled protectively in his arms. The stone-faced man, appearing to be in his late thirties, is dressed in a traditional cloth cap and a rugged brown leather jacket that he wears over his heavy wool trousers. He bends down with a deliberate motion, picks up a stone, and deliberately tosses it onto the ground. The noise causes Asael to wake with a start, who then gets to his feet quickly, and Tuvia, the man who picked up the stone, grabs him roughly yet familiarly. Despite the roughness of the encounter, the two brothers embrace fiercely and warmly, a testament to their unbreakable bond, and Tuvia waves over their youngest brother, and all three siblings stand united in a strong, locked hug. Zus then appears, carrying a bundle of kindling, and Tuvia acknowledges him with a bitter nod that carries an unspoken meaning as Zus reaches into his pocket, pulls out a mezuzah, and throws it to Tuvia before letting the kindling drop to the ground. As Zus begins to snap the twigs methodically, Tuvia examines the Hebrew markings on the mezuzah with a thoughtful gaze and hugs Aron even more tightly, feeling a profound and deep connection. Zus then offers Tuvia some vodka, and the four of them huddle together closely in the pouring rain, with Aron sitting quietly, a coat draped protectively over his head. A small fire flickers softly nearby, close to a bubbling stream. Tuvia crouches down beside Zus, who stands as the tallest among the three adults, while elsewhere in the expansive forest, ants scurry busily over a mound of twigs. Resembling a curious scholar engrossed in his studies, Aron pushes a stick into the mud with a look of intense interest and watches as several ants climb onto it, bringing the stick closer to his face to study their movements up close. Suddenly, he turns around and notices a female figure dashing through the trees in the distance. Quickly and without hesitation, he gets to his feet and begins to run in pursuit of her. He comes to a halt between two silver birch trees, watching intently as the teenage girl runs towards a gray-bearded man wearing a Homburg hat, smart shirt, waistcoat, and suit trousers, sitting on a log with a little girl held tenderly in his arms. Aron then shifts his gaze in another direction and sees a young man assisting an elderly woman, offering her support. From behind additional trees, there stands a man in a black hat and black overcoat alongside a smartly dressed woman. Clutching his stick with determination, Aron steps hesitantly towards a mud ditch in the middle of a clearing, where the long, winding ditch is filled with the harrowing and ghastly sight of dead bodies piled on top of each other, and his eyes reflect the horror and shock he feels deep inside. Back at the campsite, his brothers are seated around the fire, and Zus and Tuvia exchange meaningful glances with each other, as if communicating silently. Aron has now brought the old man and the child with him, and Tuvia gently lays the child down near the comforting warmth of the fire. With a rifle in hand, Zus watches vigilantly and intently as other people begin to arrive, and he and Tuvia exchange glances of mute surprise and disbelief as the old man weeps softly and tenderly strokes the little girl's glossy dark hair with a gentle touch."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Aron, sitting with his legs drawn up in front of him, slowly shifts his weight forward and pushes himself up to his feet, feeling the ground beneath him as he stands. He then reaches for the cloth bundle, carefully throwing it over his shoulder while the vast stretch of dark green conifers extends endlessly around him. Meanwhile, a man strides purposefully through the undergrowth, his steps deliberate and firm, until he comes across Asael, who lies asleep by a tree with Aron nestled in his arms. The man, with a stone-faced demeanor that belies his late thirties, wears a cloth cap and a brown leather jacket over his heavy wool trousers. He bends down, selects a stone, and tosses it decisively onto the ground, creating a small thud that stirs Asael awake. Asael rises to his feet, blinking away sleep, as Tuvia approaches him with a rough urgency, grabbing him firmly. Despite the abruptness, the two brothers collapse into a fierce hug, a mix of relief and unspoken emotion passing between them. Tuvia then gestures towards their youngest brother, beckoning him into their embrace, and the three brothers stand tightly locked in each other's arms, sharing a moment of unity. Zus soon appears, carrying kindling in his arms, his expression bitter as he approaches. With a quick, decisive motion, he fishes in his pocket, retrieves the mezuzah, and tosses it to Tuvia, before letting the kindling fall to the ground. As Zus begins snapping the collected twigs, the sound of breaking wood fills the air while Tuvia, glancing briefly at the Hebrew markings on the mezuzah, pulls Aron into an even tighter hug, the gravity of the moment not lost on him. Zus then hands Tuvia some vodka, and the four gather closely together, seeking warmth and comfort from each other amidst the pouring rain. Aron is now sitting quietly, a coat draped over his head, absorbing the murmurs and the pitter-patter of rain, near a little fire that flickers beside a stream. Tuvia crouches down next to Zus, who towers over the three adults, their presence marked by the silent camaraderie shared between them. Elsewhere in the forest, ants are seen scurrying industriously over a mound of twigs, oblivious to the human drama nearby. Aron, with curiosity piqued, uses a stick to probe into the mud, watching intently as several ants climb onto it. He then brings the stick closer, studying their tiny movements with fascination. Suddenly, he turns sharply as he spots a female figure darting through the trees some distance away. Driven by a sudden impulse, Aron rises to his feet and begins to run after her, his feet pounding against the earth. He halts between two silver birch trees, watching the teen girl run towards a gray-bearded man dressed in a Homburg hat, shirt, waistcoat, and suit trousers, who sits calmly on a log with a little girl cradled in his arms. Aron shifts his gaze in another direction, noticing a young man accompanying an elderly woman. From behind additional trees, a man wearing a black hat and a black overcoat stands alongside a smartly dressed woman. Clutching his stick with determination, Aron steps cautiously towards the center of a clearing, where he is confronted by the sight of a mud ditch filled with dead bodies, piled haphazardly on top of each other, a chilling tableau that fills his eyes with horror. Back at the fire, Aron's brothers sit in silent vigil, with Zus and Tuvia exchanging a knowing glance. Aron has brought the old man and child to their gathering, and with gentle care, Tuvia lays the child beside the warm fire. Zus, gripping a rifle with a vigilant gaze, watches as more people arrive, and a silent acknowledgment passes between him and Tuvia, their surprise muted yet palpable, as the old man weeps softly, tenderly stroking the little girl's glossy dark hair."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Aron rises from sitting with his legs drawn up, throws a cloth bundle over his shoulder, and surveys the vast stretch of dark green conifers. Meanwhile, a stone-faced man in his late thirties, wearing a cloth cap and a brown leather jacket over wool trousers, discovers Asael asleep by a tree with Aron. After tossing a stone to wake Asael, Tuvia roughly grabs him, leading to a fierce hug between the two brothers. Tuvia calls over their youngest brother, uniting all three in a heartfelt embrace. Zus appears, carrying kindling, and after exchanging a bitter nod with Tuvia, hands him a mezuzah and drops the kindling. As Zus snaps twigs, Tuvia inspects the mezuzah's Hebrew markings and hugs Aron tightly. Zus offers Tuvia some vodka, and the four brothers huddle in the rain, Aron listening quietly with a coat over his head as they sit near a fire by a stream. Tuvia crouches beside Zus, the tallest brother, while elsewhere ants scurry over a twig mound. Aron, curiously probing the mud with a stick, observes ants climbing it and studies them before spotting a female figure running through the trees. He chases after her but stops to watch as she approaches an elderly man with a gray beard, dressed formally, who holds a little girl. Aron glances elsewhere, noticing a young man with an older woman and a couple standing behind more trees. Clutching his stick, Aron steps towards a mud ditch in a clearing, discovering it filled with dead bodies, which horrify him. Back at the fire, Zus and Tuvia exchange looks as Aron returns with the old man and child. Tuvia places the child near the fire, while Zus, armed with a rifle, observes the survivors' arrival, sharing a silent look of surprise with Tuvia as the old man weeps, stroking the little girl's hair."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Aron, sitting with his legs drawn up in front of him, slowly gets up to his feet, and throws the cloth bundle over his shoulder as dark green conifers of the vast Białowieża Forest, one of the last primeval forests in Europe, stretch as far as the eye can see. A man strides through the undergrowth—dense with ferns and wild plants typical of Eastern European woodlands—and comes across Asael lying asleep by a tree with Aron in his arms. The stone-faced man in his late thirties, in a cloth cap and a brown leather jacket over heavy wool trousers worn by many Eastern European peasants of the era, picks up a stone and tosses it onto the ground. Asael wakes up, gets to his feet, and Tuvia grabs him roughly. The two brothers hug fiercely, an embrace full of the hardships they've endured, and Tuvia beckons to their youngest brother, and all three stand locked in a hug. Zus appears carrying kindling, essential for survival in the wilderness, and Tuvia nods bitterly as Zus fishes in his pocket, brings out the mezuzah, a small case containing Hebrew scriptures traditionally mounted on Jewish doorways, and tosses it to Tuvia, then drops the kindling to the ground. As Zus starts snapping the twigs—carefully selected to ensure a quick fire—Tuvia glances at the Hebrew markings on the mezuzah, a reminder of their faith amid adversity, and hugs Aron even more tightly. Zus hands Tuvia some vodka, a shared solace in challenging times, and the four of them huddle together in the pouring rain, with Aron sitting with a coat on his head listening quietly to the rain's rhythmic patter. They have a little fire near to a stream that provides them with fresh water. Tuvia crouches down next to Zus, who is the tallest of the three adults and has always been the most protective, while elsewhere in the forest, ants scurry over a mound of twigs, oblivious to human struggles. Aron pushes a stick into the mud with a curious expression and watches several ants climb onto it, brings the stick closer to him, and studies their movements, finding a momentary distraction in nature. He reels around and spots a female figure running through the trees some distance away, gets to his feet, and starts to run after her, driven by a mix of curiosity and urgency. He stops between two silver birch trees, known for their distinctive white bark, and watches the teen girl run towards a gray-bearded man, whose Homburg hat signifies a man of some standing, shirt and waistcoat, and suit trousers sitting on a log with a little girl in his arms. Aron looks in another direction and sees a young man accompanying an old woman, both likely seeking refuge in these woods. From behind more trees, a man in a black hat and black overcoat with a smartly dressed woman are standing, perhaps having fled from nearby towns. Clutching his stick, Aron steps towards a mud ditch in the middle of a clearing, where the long winding ditch is full of dead bodies piled on top of each other, a stark reminder of the brutality of war, and Aron's eyes fill with horror. His brothers are sitting around the fire, and Zus and Tuvia look at each other, sharing a silent vow to protect those who have taken refuge with them. Aron has brought the old man and the child, and Tuvia lays the child down near the fire to keep her warm. Zus, armed with a rifle—essential for defense in these dangerous times—watches the other people arrive, and he and Tuvia glance at each other in mute surprise as the old man weeps and strokes the little girl's glossy dark hair, a tender gesture amidst the chaos."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Aron sitting with his legs drawn up in front of him slowly gets up to his feet and throws the cloth bundle over his shoulder as dark green conifers stretch as far as the eye can see. A man strides through the undergrowth and comes across. Asael lying asleep by a tree with Aron in his arms. The stonefaced man in his late thirties in a cloth cap and a brown leather jacket over heavy wool trousers picks up a stone and tosses it onto the ground. Asael wakes up gets to his feet and Tuvia grabs him roughly. The two brothers hug fiercely and Tuvia beckons to their youngest brother and all three stand locked in a hug. Zus appears carrying kindling and Tuvia nods bitterly as Zus fishes in his pocket brings out the mezuzah and tosses it to Tuvia then drops the kindling to the ground. As Zus starts snapping the twigs Tuvia glances at the Hebrew markings on the mezuzah and hugs Aron even more tightly. Zus hands Tuvia some vodka and the four of them huddle together in the pouring rain with Aron sitting with a coat on his head listening quietly. They have a little fire near to a stream. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Tuvia crouches down next to Zus who is the tallest of the three adults while elsewhere in the forest ants scurry over a mound of twigs. Aron pushes a stick into the mud with a curious expression and watches several ants climb onto it brings the stick closer to him and studies their movements. He reels around and spots a female figure running through the trees some distance away gets to his feet and starts to run after her. He stops between two silver birch trees and watches the teen girl run towards a graybearded man in a Homburg hat shirt and waistcoat and suit trousers sitting on a log with a little girl in his arms. Aron looks in another direction and sees a young man accompanying an old woman. From behind more trees a man in a black hat and black overcoat with a smartly dressed woman are standing. Clutching his stick. Aron steps towards a mud ditch in the middle of a clearing where the long winding ditch is full of dead bodies piled on top of each other and Aron's eyes fill with horror. His brothers are sitting around the fire and Zus and Tuvia look at each other. Aron has brought the old man and the child and Tuvia lays the child down near the fire. Zus armed with a rifle watches the other people arrive and he and Tuvia glance at each other in mute surprise as the old man weeps and strokes the little girl's glossy dark hair."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Aron sitting with his legs drawn up in front of him slowly gets up to his feet and throws the cloth bundle over his shoulder as dark green conifers stretch as far as the eye can see. A man strides through the undergrowth and comes across. Asael lying asleep by a tree with Aron in his arms. The stonefaced man in his late thirties in a cloth cap and a brown leather jacket over heavy wool trousers picks up a stone and tosses it onto the ground. Asael wakes up gets to his feet and Tuvia grabs him roughly. The two brothers hug fiercely and Tuvia beckons to their youngest brother and all three stand locked in a hug. Zus appears carrying kindling and Tuvia nods bitterly as Zus fishes in his pocket brings out the mezuzah and tosses it to Tuvia then drops the kindling to the ground. As Zus starts snapping the twigs Tuvia glances at the Hebrew markings on the mezuzah and hugs Aron even more tightly. Zus hands Tuvia some vodka and the four of them huddle together in the pouring rain with Aron sitting with a coat on his head listening quietly. They have a little fire near to a stream. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Tuvia crouches down next to Zus who is the tallest of the three adults while elsewhere in the forest ants scurry over a mound of twigs. Aron pushes a stick into the mud with a curious expression and watches several ants climb onto it brings the stick closer to him and studies their movements. He reels around and spots a female figure running through the trees some distance away gets to his feet and starts to run after her. He stops between two silver birch trees and watches the teen girl run towards a graybearded man in a Homburg hat shirt and waistcoat and suit trousers sitting on a log with a little girl in his arms. Aron looks in another direction and sees a young man accompanying an old woman. From behind more trees a man in a black hat and black overcoat with a smartly dressed woman are standing. Clutching his stick. Aron steps towards a mud ditch in the middle of a clearing where the long winding ditch is full of dead bodies piled on top of each other and Aron's eyes fill with horror. His brothers are sitting around the fire and Zus and Tuvia look at each other. Aron has brought the old man and the child and Tuvia lays the child down near the fire. Zus armed with a rifle watches the other people arrive and he and Tuvia glance at each other in mute surprise as the old man weeps and strokes the little girl's glossy dark hair."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Aron sitting with his legs drawn up in front of him slowly gets up to his feet and throws the cloth bundle over his shoulder as dark green conifers stretch as far as the eye can see. A man strides through the undergrowth and comes across. Asael lying asleep by a tree with Aron in his arms. The stonefaced man in his late thirties in a cloth cap and a brown leather jacket over heavy wool trousers picks up a stone and tosses it onto the ground. Asael wakes up gets to his feet and Tuvia grabs him roughly. From behind more trees a man in a black hat and black overcoat with a smartly dressed woman are standing. Clutching his stick. Aron steps towards a mud ditch in the middle of a clearing where the long winding ditch is full of dead bodies piled on top of each other and Aron's eyes fill with horror. His brothers are sitting around the fire and Zus and Tuvia look at each other. Aron has brought the old man and the child and Tuvia lays the child down near the fire. Zus armed with a rifle watches the other people arrive and he and Tuvia glance at each other in mute surprise as the old man weeps and strokes the little girl's glossy dark hair."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Aron sitting with his legs drawn up in front of him slowly gets up to his feet and throws the cloth bundle over his shoulder as dark green conifers stretch as far as the eye can see. A man strides through the undergrowth and comes across. His brothers are sitting around the fire and Zus and Tuvia look at each other. Aron has brought the old man and the child and Tuvia lays the child down near the fire. Zus armed with a rifle watches the other people arrive and he and Tuvia glance at each other in mute surprise as the old man weeps and strokes the little girl's glossy dark hair."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Barney, lounging with his elbows propped up behind him, swiftly rises to his toes, and slings the woolen sack around his neck as bright red tulips bloom as far as the ear can hear. A cat meanders through the sand dunes and spots Brice lounging awake by a rock with Barney on his lap. The cheerful woman in her early twenties, in a straw hat and a blue denim jacket over light cotton leggings, grabs a twig and hurls it into the sky. Brice springs up, leaps to his toes, and Teddy shakes him gently. The two uncles high-five joyfully, and Teddy signals to their oldest aunt, and all three stand locked in a dance. Cara arrives brandishing a lantern, and Teddy shakes his head sadly as Cara searches in her shoe, retrieves the compass, and hands it to Teddy before placing the lantern on the ground. As Cara begins stacking the branches, Teddy peers at the German symbols on the compass and pats Barney even more softly. Cara offers Teddy some lemonade, and the four of them gather together under the clear skies, with Barney reclining with a blanket on his back listening loudly. They have a tiny garden next to a pond. Teddy kneels beside Cara, who is the shortest of the three elders, while at another spot in the meadow, bees hover over a cluster of flowers. Barney pokes a pencil into the grass with a puzzled look and observes several bees land upon it, brings the pencil closer to him, and examines their dances. He spins around and notices a male shadow leaping through the bushes some distance afar, jumps to his toes, and starts to dash after him. He pauses between two broad oak trees and watches the teen boy run towards a bald-headed woman in a beanie cap, blouse and cardigan, and jeans resting on a bench with a little boy in her arms. Barney glances in another direction and sees an old lady escorting a young girl. From behind more bushes, a boy in a white cap and white sweater with a casually dressed gentleman are wandering. Gripping his pencil, Barney stumbles towards a sand pit in the middle of a meadow, where the deep swirling pit is full of dusty bicycles stacked on top of each other, and Barney's eyes brim with confusion. His uncles are lounging in the garden, and Cara and Teddy glance at one another. Barney has brought the elderly lady and the toddler, and Teddy rests the toddler near the garden. Cara, equipped with a slingshot, observes the other animals arrive, and she and Teddy gaze at one another in silent amazement as the elderly lady laughs and brushes the toddler’s shiny light hair."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Aron rises and slings a cloth bundle over his shoulder as he observes the expansive dark green conifers. Tuvia, a stone-faced man in his late thirties, finds Asael asleep by a tree holding Aron and wakes Asael by tossing a stone. Recognizing each other, the brothers Tuvia, Asael, and Aron embrace tightly. Zus appears with kindling, throws a mezuzah to Tuvia, and drops the kindling. Tuvia inspects the mezuzah and hugs Aron tighter. Zus offers Tuvia vodka, and the brothers huddle in the rain near a fire by a stream. Aron, curious, studies ants on a stick, then sees a female figure and pursues her. He witnesses the figure join a gray-bearded man holding a girl. Aron is horrified upon discovering a ditch filled with dead bodies. Tuvia and Zus are joined by Aron, who brings an old man and a child to the fire, where the old man weeps and strokes the girl's hair, while Zus vigilantly watches the arrivals."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Zus armed with a rifle watches the other people arrive and he and Tuvia glance at each other in mute surprise as the old man weeps and strokes the little girl's glossy dark hair Aron has brought the old man and the child and Tuvia lays the child down near the fire His brothers are sitting around the fire and Zus and Tuvia look at each other Aron steps towards a mud ditch in the middle of a clearing where the long winding ditch is full of dead bodies piled on top of each other and Aron's eyes fill with horror Clutching his stick From behind more trees a man in a black hat and black overcoat with a smartly dressed woman are standing Aron looks in another direction and sees a young man accompanying an old woman He stops between two silver birch trees and watches the teen girl run towards a graybearded man in a Homburg hat shirt and waistcoat and suit trousers sitting on a log with a little girl in his arms He reels around and spots a female figure running through the trees some distance away gets to his feet and starts to run after her Aron pushes a stick into the mud with a curious expression and watches several ants climb onto it brings the stick closer to him and studies their movements Tuvia crouches down next to Zus who is the tallest of the three adults while elsewhere in the forest ants scurry over a mound of twigs They have a little fire near to a stream Zus hands Tuvia some vodka and the four of them huddle together in the pouring rain with Aron sitting with a coat on his head listening quietly As Zus starts snapping the twigs Tuvia glances at the Hebrew markings on the mezuzah and hugs Aron even more tightly Zus appears carrying kindling and Tuvia nods bitterly as Zus fishes in his pocket brings out the mezuzah and tosses it to Tuvia then drops the kindling to the ground The two brothers hug fiercely and Tuvia beckons to their youngest brother and all three stand locked in a hug Asael wakes up gets to his feet and Tuvia grabs him roughly The stonefaced man in his late thirties in a cloth cap and a brown leather jacket over heavy wool trousers picks up a stone and tosses it onto the ground Asael lying asleep by a tree with Aron in his arms A man strides through the undergrowth and comes across Aron sitting with his legs drawn up in front of him slowly gets up to his feet and throws the cloth bundle over his shoulder as dark green conifers stretch as far as the eye can see"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "A man strides through the undergrowth and comes across Aron sitting with his legs drawn up in front of him slowly gets up to his feet and throws the cloth bundle over his shoulder as dark green conifers stretch as far as the eye can see The stonefaced man in his late thirties in a cloth cap and a brown leather jacket over heavy wool trousers picks up a stone and tosses it onto the ground Asael lying asleep by a tree with Aron in his arms The two brothers hug fiercely and Tuvia beckons to their youngest brother and all three stand locked in a hug Asael wakes up gets to his feet and Tuvia grabs him roughly As Zus starts snapping the twigs Tuvia glances at the Hebrew markings on the mezuzah and hugs Aron even more tightly Zus appears carrying kindling and Tuvia nods bitterly as Zus fishes in his pocket brings out the mezuzah and tosses it to Tuvia then drops the kindling to the ground They have a little fire near to a stream Zus hands Tuvia some vodka and the four of them huddle together in the pouring rain with Aron sitting with a coat on his head listening quietly Aron pushes a stick into the mud with a curious expression and watches several ants climb onto it brings the stick closer to him and studies their movements Tuvia crouches down next to Zus who is the tallest of the three adults while elsewhere in the forest ants scurry over a mound of twigs He stops between two silver birch trees and watches the teen girl run towards a graybearded man in a Homburg hat shirt and waistcoat and suit trousers sitting on a log with a little girl in his arms He reels around and spots a female figure running through the trees some distance away gets to his feet and starts to run after her From behind more trees a man in a black hat and black overcoat with a smartly dressed woman are standing Aron looks in another direction and sees a young man accompanying an old woman Aron steps towards a mud ditch in the middle of a clearing where the long winding ditch is full of dead bodies piled on top of each other and Aron's eyes fill with horror Clutching his stick Aron has brought the old man and the child and Tuvia lays the child down near the fire His brothers are sitting around the fire and Zus and Tuvia look at each other Zus armed with a rifle watches the other people arrive and he and Tuvia glance at each other in mute surprise as the old man weeps and strokes the little girl's glossy dark hair"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Aron pushes a stick into the mud with a curious expression and watches several ants climb onto it brings the stick closer to him and studies their movements He reels around and spots a female figure running through the trees some distance away gets to his feet and starts to run after her He stops between two silver birch trees and watches the teen girl run towards a graybearded man in a Homburg hat shirt and waistcoat and suit trousers sitting on a log with a little girl in his arms Aron looks in another direction and sees a young man accompanying an old woman From behind more trees a man in a black hat and black overcoat with a smartly dressed woman are standing Clutching his stick Aron steps towards a mud ditch in the middle of a clearing where the long winding ditch is full of dead bodies piled on top of each other and Aron's eyes fill with horror His brothers are sitting around the fire and Zus and Tuvia look at each other Aron has brought the old man and the child and Tuvia lays the child down near the fire Zus armed with a rifle watches the other people arrive and he and Tuvia glance at each other in mute surprise as the old man weeps and strokes the little girl's glossy dark hair Aron sitting with his legs drawn up in front of him slowly gets up to his feet and throws the cloth bundle over his shoulder as dark green conifers stretch as far as the eye can see A man strides through the undergrowth and comes across Asael lying asleep by a tree with Aron in his arms The stonefaced man in his late thirties in a cloth cap and a brown leather jacket over heavy wool trousers picks up a stone and tosses it onto the ground Asael wakes up gets to his feet and Tuvia grabs him roughly The two brothers hug fiercely and Tuvia beckons to their youngest brother and all three stand locked in a hug Zus appears carrying kindling and Tuvia nods bitterly as Zus fishes in his pocket brings out the mezuzah and tosses it to Tuvia then drops the kindling to the ground As Zus starts snapping the twigs Tuvia glances at the Hebrew markings on the mezuzah and hugs Aron even more tightly Zus hands Tuvia some vodka and the four of them huddle together in the pouring rain with Aron sitting with a coat on his head listening quietly They have a little fire near to a stream Tuvia crouches down next to Zus who is the tallest of the three adults while elsewhere in the forest ants scurry over a mound of twigs"
        }
      ]
    }
  ]
}