{
  "ground_truth": "A thin hollowed cheek man wanders towards them. Both Zus and Tuvia scramble to their feet and point their weapons. Zus runs after Lazar. Tuvia leaves Zus on the ground where he pushed him. The tall stranger addresses him. All eyes are on Tuvia. With his machine gun over his shoulder, he takes a step backwards and surveys the group, his face angry and dismayed. He glances across at Zus, who is skulking by a tree. Everyone turns to young Aron. Tuvia's tough expression weakens, and his thin lips tremble. Zus looks from Aron to Tuvia, waiting for a response. Tuvia tries to compose his face. He steps towards Aron and cradles his head in his arms. Aron wraps his arms around his big brother. Later hiding in some woodland with Zus and Benzion by his side, Tuvia appears through binoculars at Koscik's farmhouse. The three of them step towards it. Koscik's wife is in the garden hanging up washing. The three partisans armed with rifles come past a flock of geese on their way to the barn. Nearing the door, they stop as a pair of legs comes into view. Koscik is hanging from a rafter, with a wooden sign around his neck. Zus bangs a cross into the ground. Tuvia, holding a shovel, steps away from Koscik's newly dug grave. Her long, black skirt trailing on the ground, she leads the three men to a haystack where Tuvia and Zus open the trapdoor. They peer down into a shelter and smile. The brothers help Asael out into the sunshine. Zus gives him a bear hug. Rifles. Two women climbed, one a teenager, the other in her 30s. Zus leads Bella and Chaya away. Tuvia thanks Koscik's widow. He runs after the others. At the camp, Shimon and Malvin are shoving earth. The intellectuals shrug and get on with their digging. Asael is intently looking at the blond teenager. Tuvia gives Chaya a friendly wave. Asael strolls down to Chaya and Tuvia cracks a rare smile. An elderly Russian in a horse-drawn cart trundles along the dirt track. Zus with his machine gun steps out in front of him. Asael and Ben Zion step out. Zus smiles doubtfully. Later, wearing the man's coat and carrying two churns, Zus leads the way back through the woods. A man approaches Chaya. At dusk, Benzion comes up to Tuvia who is sitting by a fire, reading. Tuvia's rugged face stiffens. Benzion nods respectfully and leaves Tuvia alone. A young boy plays the violin. People in the camp sit quietly, sadness and loss etched on their faces. Asael watches Chaya from a distance. At the bottom of a leaf-strewn slope, Tuvia stands alone by a stream, grieving.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A slender sunken-cheeked man roams toward them. Both Zus and Tuvia scramble to their feet and aim their arms. Zus chases after Lazar. Tuvia leaves Zus on the ground where he shoved him. The tall stranger addresses him. All gazes are on Tuvia. With his submachine gun over his shoulder, he takes a step backward and inspects the group, his visage furious and disheartened. He glances across at Zus, who is lurking by a tree. Everyone turns to young Aron. Tuvia's stern expression softens, and his thin lips quiver. Zus looks from Aron to Tuvia, waiting for a reply. Tuvia tries to compose his visage. He steps toward Aron and embraces his head in his arms. Aron wraps his arms around his elder brother. Later, hiding in some forest with Zus and Benzion by his side, Tuvia peers through binoculars at Koscik's farmhouse. The trio steps toward it. Koscik's wife is in the garden hanging up laundry. The three partisans armed with rifles pass a flock of geese on their route to the barn. Nearing the door, they halt as a pair of legs comes into view. Koscik is suspended from a rafter, with a wooden placard around his neck. Zus hammers a cross into the ground. Tuvia, holding a spade, steps away from Koscik's freshly dug burial site. Her long, black skirt trailing on the ground, she directs the three men to a haystack where Tuvia and Zus open the trapdoor. They peer down into a shelter and grin. The brothers help Asael out into the daylight. Zus gives him a bear embrace. Rifles. Two women ascended, one an adolescent, the other in her 30s. Zus leads Bella and Chaya away. Tuvia thanks Koscik's widow. He runs after the others. At the camp, Shimon and Malvin are shoveling dirt. The intellectuals shrug and continue with their digging. Asael is keenly observing the blonde adolescent. Tuvia gives Chaya a cordial wave. Asael strolls down to Chaya and Tuvia cracks a rare grin. An elderly Russian in a horse-drawn carriage trundles along the dirt path. Zus with his submachine gun steps out in front of him. Asael and Ben Zion step out. Zus smiles hesitantly. Later, wearing the man's coat and carrying two churns, Zus leads the way back through the forest. A man approaches Chaya. At twilight, Benzion comes up to Tuvia who is sitting by a fire, reading. Tuvia's rugged visage stiffens. Benzion nods respectfully and leaves Tuvia alone. A young boy plays the violin. People in the camp sit quietly, sorrow and grief etched on their faces. Asael watches Chaya from a distance. At the bottom of a leaf-covered slope, Tuvia stands alone by a stream, mourning."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A thin hollowed cheek man is wandered towards by them. Zus and Tuvia are scrambled to their feet and their weapons are pointed. Lazar is run after by Zus. Zus is left on the ground where he is pushed by Tuvia. He is addressed by the tall stranger. Tuvia is looked at by all eyes. With his machine gun over his shoulder, a step backwards is taken by him and the group is surveyed by him, his face angry and dismayed. Zus is glanced across at by him, who skulks by a tree. Young Aron is turned to by everyone. Tuvia's tough expression is weakened, and his thin lips are trembled. Aron and Tuvia are looked at by Zus, waiting for a response. Tuvia's face is tried to be composed by him. Aron is stepped towards and his head is cradled in Tuvia's arms. His big brother is wrapped around by Aron. Later, they are hidden in some woodland with Zus and Benzion by his side, and Koscik's farmhouse is appeared through binoculars by Tuvia. It is stepped towards by the three of them. Koscik's wife hangs up washing in the garden. A flock of geese is come past by the three partisans armed with rifles on their way to the barn. Nearing the door, they are stopped as a pair of legs comes into view. Koscik hangs from a rafter, with a wooden sign carried around his neck. A cross is banged into the ground by Zus. Koscik's newly dug grave is stepped away from by Tuvia, holding a shovel. Her long, black skirt trailing on the ground, the three men are led to a haystack where the trapdoor is opened by Tuvia and Zus. It is peered down into a shelter by them, and smiles are given. Asael is helped out into the sunshine by the brothers. A bear hug is given to him by Zus. Rifles. Two women are climbed by, one a teenager, the other in her 30s. Bella and Chaya are led away by Zus. Koscik's widow is thanked by Tuvia. The others are run after by him. At the camp, earth is shoved by Shimon and Malvin. The intellectuals shrug and the digging is gotten on with by them. The blond teenager is looked at intently by Asael. A friendly wave is given to Chaya by Tuvia. Chaya is strolled down to by Asael and a rare smile is cracked by Tuvia. An elderly Russian in a horse-drawn cart is trundled along the dirt track. Zus with his machine gun is stepped out in front of by him. Asael and Ben Zion are stepped out by. A doubtful smile is given by Zus. Later, the man's coat is worn and two churns are carried by Zus as the way back through the woods is led by him. Chaya is approached by a man. At dusk, Tuvia is come up to by Benzion who is sitting by a fire, reading. Tuvia's rugged face is stiffened by him. A respectful nod is given and Tuvia is left alone by Benzion. A violin is played by a young boy. The camp is sat in quietly, with sadness and loss etched on their faces by the people. Chaya is watched from a distance by Asael. At the bottom of a leaf-strewn slope, a stream is stood alone by Tuvia, grieving."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A thin, hollow-cheeked man approaches, prompting Zus and Tuvia to scramble and point their weapons. Zus chases Lazar, leaving Tuvia alone. The tall stranger addresses Tuvia, who's visibly angry and dismayed with his machine gun slung over his shoulder. He exchanges a glance with Zus, lurking by a tree, then softens when looking at young Aron. Tuvia embraces Aron, who hugs him back. Later, hidden in the woods with Zus and Benzion, Tuvia uses binoculars to view Koscik's farmhouse. They approach it, passing geese, and discover Koscik hanging from a rafter with a sign around his neck. Zus plants a cross, while Tuvia steps away from the new grave. Koscik's widow leads them to a shelter in a haystack, where Zus and Tuvia help Asael out, who receives a bear hug from Zus. Zus leads Bella and Chaya away as Tuvia thanks the widow. Back at camp, Shimon and Malvin are digging, while intellectuals work. Asael and a blond teenager catch each other's eyes, and Tuvia waves to Chaya, cracking a rare smile. An elderly Russian in a cart meets Zus, Asael, and Ben Zion. Zus dons the man's coat and leads them back through the woods. In the evening, Benzion approaches Tuvia by a fire, leaving respectfully. A young boy plays the violin as camp members sit quietly, reflecting on their grief and losses. Asael watches Chaya from afar, while Tuvia stands alone by a stream, mourning."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A thin, hollow-cheeked man approaches. Zus and Tuvia rise and point their weapons. Zus chases Lazar while Tuvia leaves Zus on the ground. The tall stranger speaks. Tuvia, angry and dismayed, with a machine gun, steps back, surveys the group, and looks at Zus by a tree. Eyes shift to Aron. Tuvia’s tough expression softens, and he holds Aron, who embraces his brother. Later, hiding in the woods with Zus and Benzion, Tuvia observes Koscik’s farmhouse through binoculars. They approach as Koscik’s wife hangs laundry. Armed, they pass geese towards the barn, where Koscik, hanging from a rafter, has a wooden sign around his neck. Zus plants a cross. Tuvia steps from Koscik’s grave. Koscik’s wife leads them to a haystack. Tuvia and Zus open a trapdoor, smiling as they help Asael into the sunshine. Zus hugs Asael. Rifles. Two women emerge, one a teenager, the other in her 30s. Zus escorts Bella and Chaya as Tuvia thanks Koscik’s widow and follows. At camp, Shimon and Malvin dig as intellectuals shrug and dig too. Asael notices the blond teenager. Tuvia waves to Chaya, then smiles. An elderly Russian in a cart approaches. Zus, Asael, and Ben Zion step out, Zus doubtful. Later, wearing a coat and carrying churns, Zus leads back through woods. At dusk, Benzion approaches Tuvia, reading by a fire, then respectfully leaves. A boy plays violin as camp members sit in silent sorrow. Asael watches Chaya. By a stream, Tuvia grieves alone at the slope's base."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A slender man with hollowed cheeks, appearing quite frail, ambles slowly towards them. In a sudden, instinctual reaction, both Zus and Tuvia hastily scramble up to their feet, immediately pointing their weapons in readiness. Without hesitation, Zus swiftly takes off in pursuit of Lazar. Meanwhile, Tuvia leaves Zus lying on the ground where he had forcefully pushed him. The tall, enigmatic stranger directs his attention towards Tuvia, who is now the focal point of everyone's gaze. With his machine gun slung over his shoulder, he cautiously takes a step backward, casting a scrutinizing look over the assembled group. His expression is one of anger mingled with dismay. His eyes momentarily lock onto Zus, who is lurking slyly by the cover of a nearby tree. The group’s attention then shifts to the young Aron. Tuvia's previously stern and tough demeanor shows signs of softening, as his thin lips begin to tremble slightly. Zus glances between Aron and Tuvia, clearly waiting expectantly for some kind of response. In an effort to regain his composure, Tuvia endeavors to steady his expression. He approaches Aron tenderly, enveloping his head within his arms in a gesture of comfort. Aron eagerly wraps his arms around his big brother, seeking solace. \n\nLater, concealed in the depths of a dense woodland, with Zus and Benzion flanking him, Tuvia peers through binoculars, focusing intently on Koscik’s farmhouse in the distance. The trio of men, armed and ready, begin to move cautiously towards their objective. In the garden, Koscik’s wife can be seen methodically hanging up a line of washing. As the three partisans, each brandishing a rifle, venture past a flock of geese in their path to the barn, they come to a sudden halt. Emerging into view, precariously hanging from a rafter, is Koscik, a wooden sign ominously draped around his neck. In a poignant, solemn act, Zus drives a cross decisively into the ground. Tuvia, gripping a shovel firmly, steps away from the freshly dug grave of Koscik. Her long, flowing black skirt trailing on the ground, Koscik’s widow leads the three men quietly to a haystack, where Tuvia and Zus together pull open a hidden trapdoor. They peer down into a concealed shelter below and share a momentary smile. With a sense of relief, the brothers assist Asael up into the welcoming sunshine. Zus greets him with a hearty bear hug. Rifles at the ready, two women, one a teenager and the other appearing to be in her 30s, make their way up. Zus takes charge, guiding Bella and Chaya away to safety. Tuvia expresses his gratitude to Koscik's widow before sprinting to catch up with the others.\n\nBack at the camp, Shimon and Malvin can be seen energetically shoveling earth. The group of intellectuals, after a brief shrug of their shoulders, continue diligently with their digging tasks. Standing apart, Asael observes the blond teenager with keen interest. Tuvia acknowledges Chaya with a friendly wave. Asael strolls down towards Chaya, and Tuvia allows himself the rare indulgence of a smile. An elderly Russian man, guiding a horse-drawn cart, slowly trundles along the dirt track leading to the camp. Zus, with his machine gun at the ready, steps boldly out in front of him to intercept. Asael and Ben Zion follow suit, stepping out as well. Zus offers a dubious smile. Later on, now clad in the man's coat and lugging two churns, Zus expertly leads the way back through the dense forest. As dusk settles in, a man approaches Chaya with intentions unclear. Benzion quietly approaches Tuvia, who is seated by a crackling fire, his attention absorbed in reading. Tuvia's rugged, stoic face tightens as he listens. Benzion nods with respect and departures, leaving Tuvia alone with his thoughts. A young boy plays the violin, the melancholic music casting a somber atmosphere over the camp, as people sit in silent reflection, loss deeply etched on their faces. Asael, silent and thoughtful, watches Chaya from afar. At the bottom of a slope strewn with leaves, Tuvia stands alone by a gently flowing stream, engulfed in his grief."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A slender man, whose appearance is marked by hollowed cheeks and an overall frailty, ambles slowly and with some difficulty towards the duo. In a sudden, instinctual reaction, both Zus and Tuvia hastily scramble to their feet, immediately pointing their weapons in readiness. Without a moment's hesitation, Zus swiftly takes off in pursuit of Lazar. Meanwhile, Tuvia leaves Zus lying on the ground where he had forcefully pushed him. The tall, enigmatic stranger directs his attention towards Tuvia, who is now the focal point of everyone's gaze. With his machine gun slung over one shoulder, he carefully takes a step backward, casting a scrutinizing look over the assembled group. His expression is a complex mixture of anger mingled with dismay. His eyes momentarily lock onto Zus, who is lurking slyly by the cover of a nearby tree. The group’s attention then shifts to the young Aron. Tuvia's previously stern and tough demeanor shows signs of softening, as his thin lips begin to tremble slightly. Zus glances back and forth between Aron and Tuvia, clearly waiting expectantly for some kind of response. In a determined effort to regain his composure, Tuvia endeavors to steady his expression. He approaches Aron tenderly, enveloping his head within his arms in a gesture of comfort and reassurance. Aron eagerly wraps his arms around his big brother, seeking solace and security in his embrace.\n\nLater on, concealed in the depths of a dense and shadowy woodland, with Zus and Benzion flanking him closely, Tuvia peers through binoculars, focusing intently on Koscik’s farmhouse that lies in the distance. The trio of men, well-armed and ready for action, begin to move cautiously and deliberately towards their objective. In the garden, Koscik’s wife can be seen methodically hanging up a line of washing, her movements practiced and steady. As the three partisans, each brandishing a rifle, venture past a noisy flock of geese in their path to the barn, they come to a sudden halt. Emerging into view, precariously hanging from a rafter, is Koscik, a wooden sign ominously draped around his neck. In a poignant, solemn act, Zus drives a cross decisively into the ground. Tuvia, holding a shovel with a firm grip, steps away from the freshly dug grave of Koscik. Her long, flowing black skirt trailing on the dust-covered ground, Koscik’s widow leads the three men quietly to a haystack, where Tuvia and Zus together pull open a hidden trapdoor. They peer down into a concealed shelter below and share a momentary smile filled with relief. With a sense of profound relief, the brothers assist Asael up into the welcoming sunshine. Zus greets him with a hearty and enthusiastic bear hug. Rifles at the ready, two women, one a teenager and the other appearing to be in her 30s, make their way up. Zus takes charge of the situation, guiding Bella and Chaya away to safety. Tuvia expresses his deep gratitude to Koscik's widow before sprinting to catch up with the others.\n\nBack at the camp, Shimon and Malvin can be seen energetically shoveling earth, their movements vigorous and determined. The group of intellectuals, after a brief shrug of their shoulders, continue diligently with their assigned digging tasks. Standing apart from the others, Asael observes the blond teenager with keen and discerning interest. Tuvia acknowledges Chaya with a friendly, welcoming wave. Asael strolls down towards Chaya, and Tuvia allows himself the rare indulgence of a genuine smile. An elderly Russian man, guiding a horse-drawn cart laden with supplies, slowly trundles along the dirt track leading to the camp. Zus, with his machine gun at the ready, boldly steps out in front of him to intercept his progress. Asael and Ben Zion follow suit, stepping out confidently as well. Zus offers a dubious and uncertain smile. Later on, now clad in the man's coat and lugging two heavy churns, Zus expertly leads the way back through the dense and shadow-filled forest. As dusk settles in, casting long shadows on the ground, a man approaches Chaya with intentions unclear and uncertain. Benzion quietly approaches Tuvia, who is seated by a crackling fire, his attention absorbed in reading. Tuvia's rugged, stoic face tightens as he listens intently. Benzion nods with respect and departs, leaving Tuvia alone with his thoughts. A young boy plays the violin, the melancholic music casting a somber and reflective atmosphere over the camp, as people sit in silent reflection, the weight of loss deeply etched on their faces. Asael, silent and thoughtful, watches Chaya from afar, his expression contemplative. At the bottom of a slope strewn with fallen leaves, Tuvia stands alone by a gently flowing stream, engulfed in his deep and overwhelming grief."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A thin hollow-cheeked man slowly makes his way toward them, prompting Zus and Tuvia to quickly jump to their feet, both instinctively reaching for their weapons in a defensive stance. As tensions rise, Zus darts off in pursuit of Lazar, leaving Tuvia behind. Tuvia, in his haste, shoves Zus to the ground before being confronted by the tall stranger, drawing everyone's attention to him. With his machine gun slung over his shoulder, Tuvia cautiously takes a step back, casting a careful gaze over the group, his expression a mix of anger and dismay. Glancing towards Zus, who is lurking by a tree, Tuvia senses all eyes shifting to young Aron. The tough exterior on Tuvia's face starts to falter as his thin lips begin to tremble. Zus observes the exchange, looking from Aron to Tuvia and waiting for a reaction. Tuvia struggles to regain composure, stepping forward to cradle Aron's head gently in his arms. Aron, finding comfort, wraps his arms tightly around his big brother. The scene transitions to a secluded woodland where Tuvia, alongside Zus and Benzion, uses binoculars to scrutinize Koscik's farmhouse in the distance. The trio cautiously moves toward it, catching sight of Koscik's wife in the garden, methodically hanging up the washing. The armed partisans, rifles in hand, navigate carefully past a flock of geese on their way to the barn. As they approach the door, a chilling sight stops them in their tracks—a pair of legs comes into view, revealing Koscik hanging from a rafter, a wooden sign ominously hanging from his neck. Zus solemnly hammers a cross into the ground nearby while Tuvia, holding a shovel, steps solemnly away from Koscik's freshly dug grave. Trailing her long, black skirt on the ground, Koscik's wife leads the three men to a haystack where Tuvia and Zus open a trapdoor, peering down into a hidden shelter, a rare smile breaking across their faces. Together, they assist Asael, guiding him out into the warm embrace of the sunshine. Zus envelops him in a bear hug, demonstrating deep camaraderie. As rifles stand in the backdrop, two women, one a teenager and the other in her 30s, climb out, and Zus escorts Bella and Chaya away. Tuvia turns to Koscik's widow, offering heartfelt thanks before sprinting to catch up with the others. Back at camp, Shimon and Malvin are engaged in the arduous task of shoveling earth, while the intellectuals, with a resigned shrug, continue with their digging. Asael's attention remains focused on the blonde teenager, casting looks her way, while Tuvia acknowledges Chaya with a friendly wave. Asael makes his way casually down to Chaya, coaxing a rare smile from Tuvia. Meanwhile, an elderly Russian man in a horse-drawn cart leisurely makes his way along the dirt track, prompting Zus, brandishing his machine gun, to step in front of him with authority. Asael and Ben Zion also emerge, and Zus manages a doubtful smile. Later, dressed in the man's coat and burdened with two churns, Zus leads the way back through the woods. As dusk settles, Benzion approaches Tuvia, who is seated by a crackling fire, absorbed in reading. Tuvia's rugged face hardens momentarily before Benzion offers a respectful nod and retreats, leaving Tuvia to his solitude. Nearby, the melancholic strains of a young boy playing the violin fill the camp, where people sit quietly, their faces etched with sadness and loss. Asael observes Chaya from afar, deep in thought, while, at the base of a leaf-strewn slope, Tuvia stands alone by a stream, lost in his grief."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A thin man with hollow cheeks approaches, prompting Zus and Tuvia to scramble to their feet and aim their weapons. After a brief scuffle that leaves Zus on the ground, the stranger addresses Tuvia, who steps back, angrily surveying the group. His expression softens when all eyes turn to young Aron, leading Tuvia to approach and embrace him. Later, Tuvia, Zus, and Benzion observe Koscik's farmhouse through binoculars and then cautiously approach it. They find Koscik hanging from a rafter with a sign around his neck. After burying Koscik, they follow his widow to a haystack. Tuvia and Zus open a trapdoor, find Asael, and help him out into the sunlight, where Zus embraces him warmly. The brothers are joined by two women, Bella and Chaya, whom Zus escorts away. Tuvia thanks Koscik's widow before rejoining the others at the camp, where Shimon, Malvin, and other intellectuals are digging. Asael is captivated by Chaya, and Tuvia greets her with a friendly wave while showing a rare smile. Later, an elderly Russian drives a cart along a dirt path, and Zus, now wearing the man's coat and carrying two churns, leads Asael and Ben Zion back through the woods. As dusk falls, Benzion approaches Tuvia, who sits reading by a fire, offering a respectful nod before leaving him alone. A young boy plays the violin, and camp residents sit quietly, their faces marked by sadness and loss. Asael watches Chaya from afar, while Tuvia grieves alone by a stream."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A thin hollowed cheek man, reminiscent of those who have endured significant hardship, wanders towards them. Both Zus and Tuvia, who are part of a group of Jewish resistance fighters known as the Bielski partisans during World War II, scramble to their feet and point their weapons, a critical measure for survival in the occupied territories. Zus runs after Lazar, who has been a valuable lookout for the group. Tuvia leaves Zus on the ground where he pushed him, illustrating the tension and pressure of their dire circumstances. The tall stranger, with an air of urgency, addresses him. All eyes are on Tuvia, the leader of the partisans, as he bears the burden of responsibility. With his machine gun, a crucial tool for their defense, slung over his shoulder, he takes a step backwards and surveys the group, his face angry and dismayed, reflecting the weight of his leadership. He glances across at Zus, who is skulking by a tree, a reminder of their fraught journey through the dense Belarusian forests. Everyone turns to young Aron, the youngest member of the group, representing innocence amidst the chaos. Tuvia's tough expression weakens, and his thin lips tremble, showing his emotional struggle. Zus looks from Aron to Tuvia, waiting for a response that could dictate their next move. Tuvia tries to compose his face, taking on the role of protector. He steps towards Aron and cradles his head in his arms, offering comfort in a moment of vulnerability. Aron wraps his arms around his big brother, seeking solace. Later hiding in some woodland, a key tactic for avoiding detection, with Zus and Benzion by his side, Tuvia appears through binoculars at Koscik's farmhouse, previously a safe haven for the partisans. The three of them step towards it, their mission fraught with tension. Koscik's wife is in the garden hanging up washing, a sign of normalcy amid the turmoil of war. The three partisans armed with rifles come past a flock of geese, which scatter noisily, on their way to the barn. Nearing the door, they stop as a pair of legs comes into view. Koscik is hanging from a rafter, with a wooden sign, a grim symbol of Nazi retribution, around his neck. Zus bangs a cross into the ground, marking the grave of a brave ally. Tuvia, holding a shovel, steps away from Koscik's newly dug grave, feeling the weight of another loss. Her long, black skirt trailing on the ground, she leads the three men to a haystack where Tuvia and Zus open the trapdoor, revealing a secret hideout they had used before. They peer down into a shelter and smile, relieved to see Asael. The brothers help Asael out into the sunshine, a brief moment of joy. Zus gives him a bear hug, grateful for his safety. Rifles. Two women climbed, one a teenager who had joined the resistance after losing her family, the other in her 30s with stories of survival etched in her eyes. Zus leads Bella and Chaya away, ensuring their protection. Tuvia thanks Koscik's widow, acknowledging her bravery and sacrifice. He runs after the others, eager to regroup at the camp. At the camp, Shimon and Malvin are shoving earth, working tirelessly to fortify their defenses. The intellectuals shrug and get on with their digging, having adapted to the harsh realities of their new life. Asael is intently looking at the blond teenager, curious about her resolve. Tuvia gives Chaya a friendly wave, encouraging camaraderie. Asael strolls down to Chaya, and Tuvia cracks a rare smile, momentarily lightening the somber mood. An elderly Russian in a horse-drawn cart, a common mode of rural transport, trundles along the dirt track. Zus with his machine gun steps out in front of him, cautious of potential threats. Asael and Ben Zion step out, ready to assist. Zus smiles doubtfully, aware of the precariousness of their situation. Later, wearing the man's coat and carrying two churns, Zus leads the way back through the woods, blending with the local populace. A man approaches Chaya, indicating the interconnected web of allies they rely on. At dusk, Benzion comes up to Tuvia who is sitting by a fire, reading, finding solace in words amidst chaos. Tuvia's rugged face stiffens, reflecting on the many losses they've endured. Benzion nods respectfully and leaves Tuvia alone, understanding the need for solitude. A young boy plays the violin, his haunting melody echoing the collective grief of those gathered. People in the camp sit quietly, sadness and loss etched on their faces, each carrying their own burdens. Asael watches Chaya from a distance, drawn to her strength. At the bottom of a leaf-strewn slope, Tuvia stands alone by a stream, grieving the immense cost of their struggle for survival."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Both Zus and Tuvia scramble to their feet and point their weapons A thin hollowed cheek man wanders towards them Both Zus and Tuvia scramble to their feet and point their weapons Zus runs after Lazar Tuvia leaves Zus on the ground where he pushed him An elderly Russian in a horsedrawn cart trundles along the dirt track The tall stranger addresses him All eyes are on Tuvia With his machine gun over his shoulder he takes a step backwards and surveys the group his face angry and dismayed He glances across at Zus who is skulking by a tree The three partisans armed with rifles come past a flock of geese on their way to the barn Everyone turns to young Aron Tuvia appears through binoculars at Koscik's farmhouse Zus runs after Lazar Later wearing the man's coat and carrying two churns Tuvia's tough expression weakens and his thin lips tremble At the bottom of a leafstrewn slope Zus looks from Aron to Tuvia waiting for a response Zus gives him a bear hug Tuvia tries to compose his face He steps towards Aron and cradles his head in his arms Aron wraps his arms around his big brother Later hiding in some woodland with Zus and Benzion by his side Tuvia appears through binoculars at Koscik's farmhouse The three of them step towards it The intellectuals shrug and get on with their digging Koscik's wife is in the garden hanging up washing The three partisans armed with rifles come past a flock of geese on their way to the barn With his machine gun over his shoulder he takes a step backwards and surveys the group his face angry and dismayed Nearing the door they stop as a pair of legs comes into view Koscik is hanging from a rafter with a wooden sign around his neck Zus bangs a cross into the ground Tuvia holding a shovel steps away from Koscik's newly dug grave All eyes are on Tuvia Her long black skirt trailing on the ground she leads the three men to a haystack where Tuvia and Zus open the trapdoor He runs after the others Everyone turns to young Aron They peer down into a shelter and smile The brothers help Asael out into the sunshine Zus gives him a bear hug Rifles Two women climbed one a teenager the other in her 30s Zus leads Bella and Chaya away Zus leads the way back through the woods Tuvia thanks Koscik's widow He runs after the others At the camp Shimon and Malvin are shoving earth sadness and loss etched on their faces Asael is intently looking at the blond teenager The intellectuals shrug and get on with their digging Aron wraps his arms around his big brother Asael is intently looking at the blond teenager Asael strolls down to Chaya and Tuvia cracks a rare smile Tuvia gives Chaya a friendly wave Asael strolls down to Chaya and Tuvia cracks a rare smile Asael watches Chaya from a distance An elderly Russian in a horsedrawn cart trundles along the dirt track Zus with his machine gun steps out in front of him Asael and Ben Zion step out Zus smiles doubtfully He steps towards Aron and cradles his head in his arms Later hiding in some woodland with Zus and Benzion by his side Later wearing the man's coat and carrying two churns Zus leads the way back through the woods A man approaches Chaya At dusk Benzion comes up to Tuvia who is sitting by a fire reading Tuvia's rugged face stiffens Benzion nods respectfully and leaves Tuvia alone Benzion nods respectfully and leaves Tuvia alone Tuvia's rugged face stiffens A young boy plays the violin The brothers help Asael out into the sunshine Koscik's wife is in the garden hanging up washing People in the camp sit quietly sadness and loss etched on their faces Asael and Ben Zion step out Asael watches Chaya from a distance At the bottom of a leafstrewn slope Tuvia stands alone by a stream grieving He glances across at Zus who is skulking by a tree"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "A thin hollowed cheek man wanders towards them. Both Zus and Tuvia scramble to their feet and point their weapons. Zus runs after Lazar. Tuvia leaves Zus on the ground where he pushed him. The tall stranger addresses him. All eyes are on Tuvia. With his machine gun over his shoulder he takes a step backwards and surveys the group his face angry and dismayed. He glances across at Zus who is skulking by a tree. Everyone turns to young Aron. Tuvia's tough expression weakens and his thin lips tremble. Zus looks from Aron to Tuvia waiting for a response. Tuvia tries to compose his face. He steps towards Aron and cradles his head in his arms. Aron wraps his arms around his big brother. Later hiding in some woodland with Zus and Benzion by his side. Tuvia appears through binoculars at Koscik's farmhouse. The three of them step towards it. Koscik's wife is in the garden hanging up washing. The three partisans armed with rifles come past a flock of geese on their way to the barn. Nearing the door they stop as a pair of legs comes into view. Koscik is hanging from a rafter with a wooden sign around his neck. Zus bangs a cross into the ground. Tuvia holding a shovel steps away from Koscik's newly dug grave. Her long black skirt trailing on the ground. she leads the three men to a haystack where Tuvia and Zus open the trapdoor. They peer down into a shelter and smile. The brothers help Asael out into the sunshine. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. Zus gives him a bear hug. Rifles. Two women climbed one a teenager the other in her 30s. Zus leads Bella and Chaya away. Tuvia thanks Koscik's widow. He runs after the others. At the camp Shimon and Malvin are shoving earth. The intellectuals shrug and get on with their digging. Asael is intently looking at the blond teenager. Tuvia gives Chaya a friendly wave. Asael strolls down to Chaya and Tuvia cracks a rare smile. An elderly Russian in a horsedrawn cart trundles along the dirt track. Zus with his machine gun steps out in front of him. Asael and Ben Zion step out. Zus smiles doubtfully. Later wearing the man's coat and carrying two churns. Zus leads the way back through the woods. A man approaches Chaya. At dusk Benzion comes up to Tuvia who is sitting by a fire reading. Tuvia's rugged face stiffens. Benzion nods respectfully and leaves Tuvia alone. A young boy plays the violin. People in the camp sit quietly. sadness and loss etched on their faces. Asael watches Chaya from a distance. At the bottom of a leafstrewn slope. Tuvia stands alone by a stream grieving."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "A thin hollowed cheek man wanders towards them. Both Zus and Tuvia scramble to their feet and point their weapons. Zus runs after Lazar. Tuvia leaves Zus on the ground where he pushed him. The tall stranger addresses him. All eyes are on Tuvia. With his machine gun over his shoulder he takes a step backwards and surveys the group his face angry and dismayed. He glances across at Zus who is skulking by a tree. Everyone turns to young Aron. Tuvia's tough expression weakens and his thin lips tremble. Zus looks from Aron to Tuvia waiting for a response. Tuvia tries to compose his face. He steps towards Aron and cradles his head in his arms. Aron wraps his arms around his big brother. Later hiding in some woodland with Zus and Benzion by his side. Tuvia appears through binoculars at Koscik's farmhouse. The three of them step towards it. Koscik's wife is in the garden hanging up washing. The three partisans armed with rifles come past a flock of geese on their way to the barn. Nearing the door they stop as a pair of legs comes into view. Koscik is hanging from a rafter with a wooden sign around his neck. Zus bangs a cross into the ground. Tuvia holding a shovel steps away from Koscik's newly dug grave. Her long black skirt trailing on the ground. she leads the three men to a haystack where Tuvia and Zus open the trapdoor. They peer down into a shelter and smile. The brothers help Asael out into the sunshine. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Zus gives him a bear hug. Rifles. Two women climbed one a teenager the other in her 30s. Zus leads Bella and Chaya away. Tuvia thanks Koscik's widow. He runs after the others. At the camp Shimon and Malvin are shoving earth. The intellectuals shrug and get on with their digging. Asael is intently looking at the blond teenager. Tuvia gives Chaya a friendly wave. Asael strolls down to Chaya and Tuvia cracks a rare smile. An elderly Russian in a horsedrawn cart trundles along the dirt track. Zus with his machine gun steps out in front of him. Asael and Ben Zion step out. Zus smiles doubtfully. Later wearing the man's coat and carrying two churns. Zus leads the way back through the woods. A man approaches Chaya. At dusk Benzion comes up to Tuvia who is sitting by a fire reading. Tuvia's rugged face stiffens. Benzion nods respectfully and leaves Tuvia alone. A young boy plays the violin. People in the camp sit quietly. sadness and loss etched on their faces. Asael watches Chaya from a distance. At the bottom of a leafstrewn slope. Tuvia stands alone by a stream grieving."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "A thin hollowed cheek man wanders towards them. Both Zus and Tuvia scramble to their feet and point their weapons. Zus runs after Lazar. Tuvia leaves Zus on the ground where he pushed him. The tall stranger addresses him. All eyes are on Tuvia. With his machine gun over his shoulder he takes a step backwards and surveys the group his face angry and dismayed. He glances across at Zus who is skulking by a tree. Everyone turns to young Aron. Tuvia's tough expression weakens and his thin lips tremble. Zus looks from Aron to Tuvia waiting for a response. Tuvia tries to compose his face. He steps towards Aron and cradles his head in his arms. Aron wraps his arms around his big brother. Zus smiles doubtfully. Later wearing the man's coat and carrying two churns. Zus leads the way back through the woods. A man approaches Chaya. At dusk Benzion comes up to Tuvia who is sitting by a fire reading. Tuvia's rugged face stiffens. Benzion nods respectfully and leaves Tuvia alone. A young boy plays the violin. People in the camp sit quietly. sadness and loss etched on their faces. Asael watches Chaya from a distance. At the bottom of a leafstrewn slope. Tuvia stands alone by a stream grieving."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "A thin hollowed cheek man wanders towards them. Both Zus and Tuvia scramble to their feet and point their weapons. Zus runs after Lazar. Tuvia leaves Zus on the ground where he pushed him. The tall stranger addresses him. All eyes are on Tuvia. People in the camp sit quietly. sadness and loss etched on their faces. Asael watches Chaya from a distance. At the bottom of a leafstrewn slope. Tuvia stands alone by a stream grieving."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A squirrel wanders towards them. Both the cat and the penguin scramble to their feet and point their weapons. The cat runs after the rabbit. The penguin leaves the cat on the ground where it pushed the cat. The tall elephant addresses it. All eyes are on the penguin. With its machine gun over its shoulder, it takes a step backwards and surveys the group, its face angry and dismayed. It glances across at the cat, who is skulking by a tree. Everyone turns to the young giraffe. The penguin's tough expression weakens, and its thin lips tremble. The cat looks from the giraffe to the penguin, waiting for a response. The penguin tries to compose its face. It steps towards the giraffe and cradles its head in its arms. The giraffe wraps its arms around its big brother. Later hiding in some woodland with the cat and the dog by its side, the penguin appears through binoculars at the kangaroo's farmhouse. The three of them step towards it. The kangaroo's wife is in the garden hanging up washing. The three partisans armed with rifles come past a flock of geese on their way to the barn. Nearing the door, they stop as a pair of legs comes into view. The kangaroo is hanging from a rafter, with a wooden sign around its neck. The cat bangs a cross into the ground. The penguin, holding a shovel, steps away from the kangaroo's newly dug grave. Her long, black skirt trailing on the ground, she leads the three men to a haystack where the penguin and the cat open the trapdoor. They peer down into a shelter and smile. The brothers help the mouse out into the sunshine. The cat gives it a bear hug. Rifles. Two women climbed, one a teenager, the other in her 30s. The cat leads the bird and the frog away. The penguin thanks the kangaroo's widow. It runs after the others. At the camp, the fish and the otter are shoving earth. The intellectuals shrug and get on with their digging. The mouse is intently looking at the blond teenager. The penguin gives the frog a friendly wave. The mouse strolls down to the frog and the penguin cracks a rare smile. An elderly donkey in a horse-drawn cart trundles along the dirt track. The cat with its machine gun steps out in front of it. The mouse and the cow step out. The cat smiles doubtfully. Later, wearing the donkey's coat and carrying two churns, the cat leads the way back through the woods. A raccoon approaches the frog. At dusk, the dog comes up to the penguin who is sitting by a fire, reading. The penguin's rugged face stiffens. The dog nods respectfully and leaves the penguin alone. A young alligator plays the violin. People in the camp sit quietly, sadness and loss etched on their faces. The mouse watches the frog from a distance. At the bottom of a leaf-strewn slope, the penguin stands alone by a stream, grieving."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "A thin hollowed cheek man wanders towards them. Both Zus and Tuvia scramble to their feet and point their tools. Zus runs after Lazar. Tuvia leaves Zus on the pavement where he pushed him. The tall stranger addresses him. All eyes are on Tuvia. With his fishing pole over his shoulder, he takes a step backwards and surveys the group, his face angry and dismayed. He glances across at Zus, who is skulking by a lamppost. Everyone turns to young Aron. Tuvia's tough expression weakens, and his thin lips tremble. Zus looks from Aron to Tuvia, waiting for a response. Tuvia tries to compose his face. He steps towards Aron and cradles his head in his arms. Aron wraps his arms around his big brother. Later hiding in some orchard with Zus and Benzion by his side, Tuvia appears through binoculars at Koscik's cabin. The three of them step towards it. Koscik's wife is in the orchard hanging up lanterns. The three wanderers armed with bows come past a flock of sheep on their way to the shed. Nearing the door, they stop as a pair of boots comes into view. Koscik is hanging from a beam, with a metal sign around his neck. Zus bangs a stone into the ground. Tuvia, holding a rake, steps away from Koscik's newly dug hole. Her long, red cloak trailing on the ground, she leads the three men to a pile of leaves where Tuvia and Zus open the trapdoor. They peer down into a burrow and smile. The brothers help Asael out into the sunlight. Zus gives him a bear hug. Bows. Two women climbed, one a teenager, the other in her 30s. Zus leads Bella and Chaya away. Tuvia thanks Koscik's widow. He runs after the others. At the area, Shimon and Malvin are shoving sand. The intellectuals shrug and get on with their digging. Asael is intently looking at the brunette teenager. Tuvia gives Chaya a friendly wave. Asael strolls down to Chaya and Tuvia cracks a rare smile. An elderly Russian in a wagon trundles along the dirt path. Zus with his fishing pole steps out in front of him. Asael and Ben Zion step out. Zus smiles doubtfully. Later, wearing the man's coat and carrying two baskets, Zus leads the way back through the orchard. A man approaches Chaya. At dusk, Benzion comes up to Tuvia who is sitting by a fire, reading. Tuvia's rugged face stiffens. Benzion nods respectfully and leaves Tuvia alone. A young boy plays the flute. People in the area sit quietly, sadness and loss etched on their faces. Asael watches Chaya from a distance. At the bottom of a leaf-strewn path, Tuvia stands alone by a fountain, grieving."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "A thin hollowed cheek man strolls towards them. Both Zus and Tuvia leap to their feet and wave their weapons. Zus ambles after Lazar. Tuvia drops Zus on the ground where he nudged him. The tall stranger questions him. All eyes focus on Tuvia. With his machine gun slung over his shoulder, he takes a step forward and inspects the group, his face surprised and puzzled. He gazes across at Zus, who is hiding by a tree. Everyone glances at young Aron. Tuvia's stern expression wavers, and his thin lips quiver. Zus looks from Aron to Tuvia, anticipating a response. Tuvia attempts to relax his face. He approaches Aron and pats his head gently. Aron grips his big brother tightly. Later concealed in some woodland with Zus and Benzion at his side, Tuvia peers through binoculars at Koscik's farmhouse. The three of them wander towards it. Koscik's wife is in the garden watering plants. The three partisans armed with rifles walk past a flock of geese on their route to the barn. Nearing the door, they pause as a pair of legs emerges into view. Koscik is dangling from a rafter, with a wooden sign around his neck. Zus taps a cross into the ground. Tuvia, holding a shovel, steps towards Koscik's newly dug grave. Her long, black skirt trailing on the ground, she guides the three men to a haystack where Tuvia and Zus lift the trapdoor. They gaze down into a shelter and grin. The brothers pull Asael out into the sunshine. Zus gives him a hearty handshake. Rifles. Two women scrambled, one a teenager, the other in her 30s. Zus ushers Bella and Chaya away. Tuvia acknowledges Koscik's widow. He walks after the others. At the camp, Shimon and Malvin are tossing earth. The intellectuals nod and continue with their digging. Asael is quietly observing the blond teenager. Tuvia offers Chaya a friendly nod. Asael saunters down to Chaya and Tuvia flashes a rare grin. An elderly Russian in a horse-drawn cart meanders along the dirt track. Zus with his machine gun steps back in front of him. Asael and Ben Zion step in. Zus chuckles uneasily. Later, wearing the man's coat and balancing two churns, Zus navigates the way back through the woods. A man greets Chaya. At dusk, Benzion approaches Tuvia who is sitting by a fire, writing. Tuvia's rugged face tightens. Benzion nods respectfully and leaves Tuvia to himself. A young boy strums the violin. People in the camp sit quietly, sadness and loss etched on their faces. Asael observes Chaya from afar. At the bottom of a leaf-strewn slope, Tuvia stands alone by a stream, reflecting."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A slim hollowed cheek giraffe wanders towards them. Both the mailbox and the bookshelf scramble to their feet and point their parachutes. The mailbox runs after the teacup. The bookshelf leaves the mailbox on the ground where it pushed it. The tall pillow addresses it. All eyes are on the bookshelf. With its bicycle over its shoulder, it takes a step backwards and surveys the herd, its face angry and dismayed. It glances across at the mailbox, which is skulking by a lamp. Everyone turns to the young envelope. The bookshelf's tough expression weakens, and its thin lips tremble. The mailbox looks from the envelope to the bookshelf, waiting for a response. The bookshelf tries to compose its face. It steps towards the envelope and cradles its corner in its arms. The envelope wraps its arms around its big blender. Later hiding in some attic with the mailbox and the spatula by its side, the bookshelf appears through binoculars at the dragon's lighthouse. The three of them step towards it. The dragon's cloud is in the meadow hanging up scarves. The three astronauts armed with umbrellas come past a flock of bicycles on their way to the vault. Nearing the window, they stop as a pair of sunglasses comes into view. The dragon is hanging from a chandelier, with a velvet ribbon around its neck. The mailbox bangs a pillow into the ground. The bookshelf, holding a yo-yo, steps away from the dragon's newly dug tunnel. Its long, blue scarf trailing on the ground, it leads the three dolphins to a shoebox where the bookshelf and the mailbox open the trapdoor. They peer down into a basement and smile. The toasters help the balloon out into the moonlight. The mailbox gives it a bear hug. Umbrellas. Two bicycles climbed, one a postcard, the other in its 30s. The mailbox leads the truck and the kite away. The bookshelf thanks the dragon's cloud. It runs after the others. At the orchard, the blender and the cactus are shoving water. The giraffes shrug and get on with their digging. The balloon is intently looking at the blond postcard. The bookshelf gives the kite a friendly wave. The balloon strolls down to the kite and the bookshelf cracks a rare smile. An elderly violin in a hot-air balloon trundles along the cobblestone path. The mailbox with its bicycle steps out in front of it. The balloon and the lamp shade step out. The mailbox smiles doubtfully. Later, wearing the popcorn's coat and carrying two suitcases, the mailbox leads the way back through the caves. A camera approaches the kite. At dusk, the spatula comes up to the bookshelf, which is sitting by a puddle, reading. The bookshelf's rugged face stiffens. The spatula nods respectfully and leaves the bookshelf alone. A young sandwich plays the banjo. Animals in the festival sit quietly, sadness and loss etched on their faces. The balloon watches the kite from a distance. At the bottom of a snow-covered ladder, the bookshelf stands alone by a fountain, grieving."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "A plump rosy-cheeked cat meanders towards them. Both Larry and Mo scramble to their feet and raise their flashlights. Larry dances after Jerry. Mo abandons Larry on the ground where he tripped him. The short penguin interrupts him. All eyes are on Mo. With his backpack over his shoulder, he takes a step forward and examines the group, his face amused and relieved. He peers across at Larry, who is loitering by a rock. Everyone turns to young Ben. Mo's stern expression mellows, and his full lips quiver. Larry looks from Ben to Mo, awaiting a remark. Mo tries to rearrange his face. He sidles up to Ben and pats his head gently. Ben hugs his large cousin. Later hiding in some cabin with Larry and Jake by his side, Mo gazes through binoculars at Timmy's silo. The three of them stroll towards it. Timmy's daughter is in the garden gathering flowers. The three explorers clutching fishing rods head past a herd of sheep on their way to the river. Approaching the stream, they pause as a pair of boots comes into view. Timmy is dangling from a tree, with a cardboard sign around his waist. Larry drives a stake into the earth. Mo, holding a rake, stands away from Timmy's newly filled pit. Her red, plaid scarf trailing on the grass, she directs the three adventurers to a log where Mo and Larry uncover the hatch. They gaze down into an alcove and grin. The cousins pull Mickey out into the daylight. Larry gives him a high five. Hats. Two queens galloped, one a knight, the other in her 40s. Larry allows Ella and Sarah away. Mo praises Timmy's daughter. He dances after the group. At the station, Max and Hugh are shifting crates. The artists stretch and continue with their painting. Mickey is keenly gazing at the red-haired knight. Mo throws Sarah a friendly glance. Mickey wanders over to Sarah and Mo flashes a rare grin. A young German in a bicycle-drawn wagon rolls along the dusty trail. Larry with his hatchet jumps out in front of her. Mickey and Tom Alvin emerge. Larry grins awkwardly. Later, wearing the woman's scarf and carrying two baskets, Larry guides the path back through the meadow. A dove flies towards Sarah. At dawn, Jake moves up to Mo who is sitting by a lantern, writing. Mo's gentle face hardens. Jake smiles politely and leaves Mo alone. A young girl strums the guitar. People in the settlement sit quietly, nostalgia and hope etched on their faces. Mickey observes Sarah from afar. At the top of a pebble-strewn hill, Mo stands alone by a river, contemplating."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "A thin hollowed cheek man meanders away from them. Both Zus and Tuvia jump to their feet and raise their shields. Zus skips away from Lazar. Tuvia deserts Zus on the roof where he tossed him. The tall stranger confronts him. All eyes are on Tuvia. With his guitar over his shoulder, he takes a step sideways and inspects the crew, his face furious and confused. He peers apart at Zus, who is loitering by a rock. Everyone shifts to young Aron. Tuvia's stern expression softens, and his thin lips quiver. Zus glances from Aron to Tuvia, anticipating a reply. Tuvia tries to steady his face. He steps towards Aron and embraces his head with his hands. Aron wraps his arms around his big brother. Later hiding in some meadow with Zus and Benzion by his side, Tuvia gazes through a telescope at Koscik's windmill. The three of them march towards it. Koscik's wife is in the orchard arranging flowers. The three partisans armed with slingshots come past a herd of sheep on their path to the shack. Nearing the entrance, they pause as a pair of boots appears. Koscik is swinging from a beam, with a paper hat around his neck. Zus drives a stake into the dirt. Tuvia, holding a rake, steps away from Koscik's freshly planted garden. Her long, black coat flowing on the earth, she escorts the three men to a pile of hay where Tuvia and Zus lift the panel. They gaze down into a bunker and grin. The brothers assist Asael out into the daylight. Zus gives him a pat on the back. Trumpets. Two women descended, one a toddler, the other in her 70s. Zus guides Bella and Chaya aside. Tuvia appreciates Koscik's widow. He strolls after the others. At the camp, Shimon and Malvin are tossing stones. The thinkers shrug and proceed with their raking. Asael is keenly watching the redheaded toddler. Tuvia sends Chaya a friendly nod. Asael saunters up to Chaya and Tuvia breaks into a rare grin. An elderly Russian in a bicycle-drawn cart rolls along the gravel path. Zus with his guitar steps in front of him. Asael and Ben Zion emerge. Zus grins uncertainly. Later, wearing the man's hat and carrying two baskets, Zus paves the way back through the meadow. A woman approaches Chaya. At dawn, Benzion approaches Tuvia who is sitting by an oven, knitting. Tuvia's hardened face relaxes. Benzion bows respectfully and leaves Tuvia alone. A young girl juggles. People in the camp rest quietly, silence and nostalgia etched on their faces. Asael gazes at Chaya from afar. At the bottom of a sand-strewn hill, Tuvia stands alone by a pond, reflecting."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A slender wax-faced astronaut meanders away from them. Both Irma and Mervin leap to their knees and toss their sandwiches. Irma skips after Quentin. Mervin forgets Irma on the fence where he hurled her. The short visitor greets her. All plates are on Mervin. With his fishing rod under his elbow, he hops a step forwards and examines the herd, his voice cheerful and amused. He peers across at Irma, who is hovering by a bush. Everyone pivots to young Marvin. Mervin's amused demeanor dissolves, and his thick cheeks quiver. Irma gazes from Marvin to Mervin, expecting a gesture. Mervin attempts to adjust his posture. He marches away from Marvin and tickles his shoe with his toes. Marvin kicks his boots against his little sister. Later napping in some cave with Irma and Cyrus by his back, Mervin squints through magnifying glasses at Barney's schoolhouse. The three of them glide away from it. Barney's child is in the attic folding clothes. The three botanists clenching periscopes hop past a herd of cows on their way to the attic. Nearing the gate, they sprint as a pair of elbows vanishes into view. Barney is swinging from a pole, with a metal bowl around his wrist. Irma stomps a rope into the bench. Mervin, clutching a mug, saunters towards Barney's newly-built mansion. Her short, white shoe gliding on the carpet, she follows the five sailors to a tractor where Mervin and Irma close the fence. They gaze up at a window and laugh. The sisters drop Asael into the moonlight. Irma gives her a cat pat. Spoon. Two children sprinted, one a toddler, the other in her 80s. Irma follows Donna and Eliza near. Mervin praises Barney's uncle. He bounces away from the cousins. At the store, Clive and Gordon are lifting bricks. The gardeners scoff and ponder with their baking. Asael is absent-mindedly frowning at the brunette toddler. Mervin sends Eliza an unfriendly nod. Asael trudges up to Eliza and Mervin frowns a wide grin. A teenage American in a bicycle-powered boat paddles across the waterway. Irma with her fishing rod jumps behind him. Asael and Sylvester float away. Irma frowns angrily. Earlier, wearing the woman's hat and tugging two anchors, Irma skips the line ahead from the field. A girl dances away from Eliza. At dawn, Cyrus crawls up to Mervin who is lying by a tent, snoring. Mervin's polished feet relax. Cyrus waves lazily and leaves Mervin surrounded. An old girl strums the piano. Animals on the shore dance loudly, joy and freedom sketched on their hands. Asael glimpses Eliza from an angle. At the top of a flower-covered hill, Mervin lies crowded by a bush, laughing."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A thin, hollow-cheeked man approaches, causing Zus and Tuvia to jump up with their weapons. Zus chases after Lazar, while Tuvia confronts the stranger alone, observing the group angrily. Tuvia's expression softens when looking at young Aron and embraces him. Later, Tuvia, Zus, and Benzion head towards Koscik's farmhouse, where they find Koscik hanging with a sign around his neck. They dig his grave, and Tuvia and Zus open a trapdoor to a hidden shelter, smiling as they help Asael into the sunlight. Zus warmly embraces Asael, then leads Bella and Chaya away. Tuvia thanks Koscik's widow and joins the others. At camp, Shimon and Malvin dig while Asael watches the blond teenager. Tuvia smiles at Chaya, and Asael walks over to her. An elderly Russian in a cart approaches; Zus stops him with Asael and Ben Zion. Later, Zus, in the man's coat, leads the way through the woods. Benzion joins Tuvia by a fire, nods, and leaves him alone. A young boy plays the violin, and the camp, filled with sadness, listens quietly. Asael observes Chaya, while Tuvia stands grieving by a stream."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Tuvia stands alone by a stream grieving At the bottom of a leafstrewn slope Asael watches Chaya from a distance sadness and loss etched on their faces People in the camp sit quietly A young boy plays the violin Benzion nods respectfully and leaves Tuvia alone Tuvia's rugged face stiffens At dusk Benzion comes up to Tuvia who is sitting by a fire reading A man approaches Chaya Zus leads the way back through the woods Later wearing the man's coat and carrying two churns Zus smiles doubtfully Asael and Ben Zion step out Zus with his machine gun steps out in front of him An elderly Russian in a horsedrawn cart trundles along the dirt track Asael strolls down to Chaya and Tuvia cracks a rare smile Tuvia gives Chaya a friendly wave Asael is intently looking at the blond teenager The intellectuals shrug and get on with their digging At the camp Shimon and Malvin are shoving earth He runs after the others Tuvia thanks Koscik's widow Zus leads Bella and Chaya away Two women climbed one a teenager the other in her 30s Rifles Zus gives him a bear hug The brothers help Asael out into the sunshine They peer down into a shelter and smile she leads the three men to a haystack where Tuvia and Zus open the trapdoor Her long black skirt trailing on the ground Tuvia holding a shovel steps away from Koscik's newly dug grave Zus bangs a cross into the ground Koscik is hanging from a rafter with a wooden sign around his neck Nearing the door they stop as a pair of legs comes into view The three partisans armed with rifles come past a flock of geese on their way to the barn Koscik's wife is in the garden hanging up washing The three of them step towards it Tuvia appears through binoculars at Koscik's farmhouse Later hiding in some woodland with Zus and Benzion by his side Aron wraps his arms around his big brother He steps towards Aron and cradles his head in his arms Tuvia tries to compose his face Zus looks from Aron to Tuvia waiting for a response Tuvia's tough expression weakens and his thin lips tremble Everyone turns to young Aron He glances across at Zus who is skulking by a tree With his machine gun over his shoulder he takes a step backwards and surveys the group his face angry and dismayed All eyes are on Tuvia The tall stranger addresses him Tuvia leaves Zus on the ground where he pushed him Zus runs after Lazar Both Zus and Tuvia scramble to their feet and point their weapons A thin hollowed cheek man wanders towards them"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Zus with his machine gun steps out in front of him Zus bangs a cross into the ground A man approaches Chaya Zus leads Bella and Chaya away Nearing the door they stop as a pair of legs comes into view A young boy plays the violin The three of them step towards it Tuvia thanks Koscik's widow Rifles Tuvia's tough expression weakens and his thin lips tremble Tuvia tries to compose his face Her long black skirt trailing on the ground Two women climbed one a teenager the other in her 30s People in the camp sit quietly At the camp Shimon and Malvin are shoving earth Tuvia leaves Zus on the ground where he pushed him Koscik is hanging from a rafter with a wooden sign around his neck At dusk Benzion comes up to Tuvia who is sitting by a fire reading The tall stranger addresses him Tuvia stands alone by a stream grieving Zus looks from Aron to Tuvia waiting for a response Tuvia gives Chaya a friendly wave Tuvia holding a shovel steps away from Koscik's newly dug grave Zus smiles doubtfully she leads the three men to a haystack where Tuvia and Zus open the trapdoor A thin hollowed cheek man wanders towards them They peer down into a shelter and smile Tuvia's rugged face stiffens The three partisans armed with rifles come past a flock of geese on their way to the barn Asael is intently looking at the blond teenager At the bottom of a leafstrewn slope The brothers help Asael out into the sunshine He steps towards Aron and cradles his head in his arms An elderly Russian in a horsedrawn cart trundles along the dirt track He runs after the others sadness and loss etched on their faces Aron wraps his arms around his big brother Later wearing the man's coat and carrying two churns Asael watches Chaya from a distance Zus runs after Lazar Zus gives him a bear hug Asael strolls down to Chaya and Tuvia cracks a rare smile All eyes are on Tuvia The intellectuals shrug and get on with their digging Zus leads the way back through the woods With his machine gun over his shoulder he takes a step backwards and surveys the group his face angry and dismayed Everyone turns to young Aron Later hiding in some woodland with Zus and Benzion by his side Tuvia appears through binoculars at Koscik's farmhouse Koscik's wife is in the garden hanging up washing Benzion nods respectfully and leaves Tuvia alone Both Zus and Tuvia scramble to their feet and point their weapons He glances across at Zus who is skulking by a tree Asael and Ben Zion step out"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Zus gives him a bear hug Rifles Two women climbed one a teenager the other in her 30s Zus leads Bella and Chaya away Tuvia thanks Koscik's widow He runs after the others At the camp Shimon and Malvin are shoving earth The intellectuals shrug and get on with their digging Asael is intently looking at the blond teenager Tuvia gives Chaya a friendly wave Asael strolls down to Chaya and Tuvia cracks a rare smile An elderly Russian in a horsedrawn cart trundles along the dirt track Zus with his machine gun steps out in front of him Asael and Ben Zion step out Zus smiles doubtfully Later wearing the man's coat and carrying two churns Zus leads the way back through the woods A man approaches Chaya At dusk Benzion comes up to Tuvia who is sitting by a fire reading Tuvia's rugged face stiffens Benzion nods respectfully and leaves Tuvia alone A young boy plays the violin People in the camp sit quietly sadness and loss etched on their faces Asael watches Chaya from a distance At the bottom of a leafstrewn slope Tuvia stands alone by a stream grieving A thin hollowed cheek man wanders towards them Both Zus and Tuvia scramble to their feet and point their weapons Zus runs after Lazar Tuvia leaves Zus on the ground where he pushed him The tall stranger addresses him All eyes are on Tuvia With his machine gun over his shoulder he takes a step backwards and surveys the group his face angry and dismayed He glances across at Zus who is skulking by a tree Everyone turns to young Aron Tuvia's tough expression weakens and his thin lips tremble Zus looks from Aron to Tuvia waiting for a response Tuvia tries to compose his face He steps towards Aron and cradles his head in his arms Aron wraps his arms around his big brother Later hiding in some woodland with Zus and Benzion by his side Tuvia appears through binoculars at Koscik's farmhouse The three of them step towards it Koscik's wife is in the garden hanging up washing The three partisans armed with rifles come past a flock of geese on their way to the barn Nearing the door they stop as a pair of legs comes into view Koscik is hanging from a rafter with a wooden sign around his neck Zus bangs a cross into the ground Tuvia holding a shovel steps away from Koscik's newly dug grave Her long black skirt trailing on the ground she leads the three men to a haystack where Tuvia and Zus open the trapdoor They peer down into a shelter and smile The brothers help Asael out into the sunshine"
        }
      ]
    }
  ]
}