{
  "ground_truth": "Bella walks up to Zus who is sitting on a log. Her dark hair cut short and wearing a grey wool coat, she sits down on the log, and they exchange a brief smile. Zus offers her a sip from his hip flask. She meets his playful expression with a shrug, and then a smile. She takes the flask and drinks from it. He looks, then lowers his eyes. His dark eyes hold her in his gaze, and she nods faintly. This time, she looks Zus straight in the eye. Tentatively, he raises his hand and touches her cheek with his fingers, gently pulling at her bottom lip with his thumb. She takes hold of his hand with her hand and places it on her right breast, discretely covering his hand with a coat and holding his gaze. Elsewhere, Aron and his friend, Rachel, tramp through the spindly birch trees. In the distance, they spot Kissely the milkman running ahead of a unit of armed men in black uniforms. The two youngsters dive behind a rock. Zus and Tuvia, their guns up and ready, urge the men and women to flee. And Benzion in a fur hat leads them across a shallow stream. Kissely and the policemen with guns arrive at the camp. One of the Bielski group carries a goat across the stream. A woman stumbles and falls into the water. Zus helps her up. Carrying bags and baskets, the people scramble up a slope. Tuvia and other men with guns scoot back down the hill to take up positions behind trees. The Russian policemen and helmeted soldiers come into view below them. Zus, Tuvia, and the others fire. One wounded soldier is helped away from the stream. The bearded milkman cowers behind a tree. Zus stops to reload. The policeman looks back at his half a dozen men. Zus hits the milkman's arm. Tuvia unleashes a salvo of bullets. The policeman skulking behind a tree calls to his men to go. Tuvia watches them retreating through the trees. He and the others stride forward in a line, and Zus reloads. Tuvia's cheeks tighten as he ponders his brother's words, but he runs off after the others. The displaced community of men, women, and children clutching their bundles of possessions, some in hats and coats, others in flat caps and jackets, many of the women with shawls on their heads tramp through the forest, dwarfed by the tall, thin, bare trees. They come out onto a meadow of tall grasses wafting in the breeze, walking almost in single file, like black shadows moving across the landscape. Tuvia and Ben Zion, behind them Zus with Bella by his side, lead the way out of the wood.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Bella strolls up to Zus who is seated on a log. Her dark locks trimmed short and attired in a grey woolen coat, she seats herself down on the log, and they swap a brief grin. Zus proffers her a sip from his hip flask. She encounters his playful look with a shrug, and then a grin. She takes the flask and sips from it. He gazes, then lowers his eyes. His dark eyes hold her in his stare, and she nods faintly. This time, she gazes Zus straight in the eye. Cautiously, he raises his hand and caresses her cheek with his fingers, softly tugging at her bottom lip with his thumb. She grasps his hand with her hand and places it on her right breast, discreetly covering his hand with a coat and holding his gaze. Elsewhere, Aron and his companion, Rachel, tramp through the spindly birch trees. In the distance, they spot Kissely the milkman running ahead of a unit of armed men in black uniforms. The two youngsters leap behind a rock. Zus and Tuvia, their rifles up and prepared, urge the men and women to escape. And Benzion in a fur hat guides them across a shallow brook. Kissely and the policemen with firearms arrive at the camp. One of the Bielski group transports a goat across the brook. A woman trips and falls into the water. Zus assists her up. Carrying bags and baskets, the people scramble up a slope. Tuvia and other men with rifles scoot back down the hill to assume positions behind trees. The Russian policemen and helmeted soldiers come into view below them. Zus, Tuvia, and the others fire. One injured soldier is assisted away from the brook. The bearded milkman cringes behind a tree. Zus pauses to reload. The policeman looks back at his half a dozen men. Zus strikes the milkman's arm. Tuvia releases a barrage of bullets. The policeman lurking behind a tree calls to his men to depart. Tuvia observes them retreating through the trees. He and the others stride forward in a line, and Zus reloads. Tuvia's cheeks tighten as he contemplates his sibling's words, but he dashes off after the others. The displaced community of men, women, and children clutching their bundles of possessions, some in hats and coats, others in flat caps and jackets, many of the women with shawls on their heads trudge through the forest, dwarfed by the tall, thin, bare trees. They emerge onto a meadow of tall grasses wafting in the breeze, walking almost in single file, like black shadows moving across the landscape. Tuvia and Ben Zion, behind them Zus with Bella by his side, lead the way out of the wood."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Bella walks up to Zus, who is sitting on a log. Her dark hair cut short and wearing a grey wool coat, the log is sat on by her, and a brief smile is exchanged by them. A sip from his hip flask is offered to her by Zus. His playful expression is met with a shrug and then a smile by her. The flask is taken by her, and it is drunk from. He looks, then lowers his eyes. She is held in his gaze by his dark eyes, and a faint nod is made by her. This time, Zus is looked straight in the eye by her. Tentatively, his hand is raised by him, and her cheek is touched with his fingers, her bottom lip gently pulled at with his thumb. His hand is taken hold of by her, and it is placed on her right breast, discretely covered with a coat and her gaze held. Elsewhere, Aron and his friend, Rachel, tramp through the spindly birch trees. In the distance, Kissely the milkman is spotted running ahead of a unit of armed men in black uniforms. A dive behind a rock is made by the two youngsters. Zus and Tuvia, their guns up and ready, urge the men and women to flee. And Benzion in a fur hat leads them across a shallow stream. Kissely and the policemen with guns arrive at the camp. A goat is carried across the stream by one of the Bielski group. A woman stumbles and falls into the water. She is helped up by Zus. Carrying bags and baskets, a scramble up a slope is made by the people. Tuvia and other men with guns scoot back down the hill to take up positions behind trees. The Russian policemen and helmeted soldiers come into view below them. Zus, Tuvia, and the others fire. They help one wounded soldier away from the stream. The bearded milkman cowers behind a tree. Reloading is done by Zus. The policeman looks back at his half a dozen men. The milkman's arm is hit by Zus. Tuvia unleashes a salvo of bullets. The policeman skulking behind a tree calls to his men to go. Tuvia watches them retreat through the trees. A stride forward in a line is made by him and the others, and a reload is done by Zus. Tuvia's cheeks tighten as his brother's words are pondered, but the others are run after by him. The displaced community of men, women, and children clutching their bundles of possessions, some in hats and coats, others in flat caps and jackets, many of the women with shawls on their heads, is tramped through the forest by them, dwarfed by the tall, thin, bare trees. They come out onto a meadow of tall grasses wafting in the breeze, walking almost in single file, like black shadows moving across the landscape. The way out of the wood is led by Tuvia and Ben Zion, behind whom Zus with Bella by his side follows."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Bella approaches Zus, who is seated on a log. With short dark hair and a grey wool coat, she sits beside him, exchanging a brief smile. Zus offers her his hip flask, and she accepts with a smile. She drinks, meeting his gaze, and nods faintly. Tentatively, he touches her cheek and pulls at her lip. She places his hand on her breast, concealing it with her coat. Elsewhere, Aron and Rachel move through birch trees and see Kissely the milkman pursued by armed men in black. The youths hide behind a rock. Zus and Tuvia, armed, urge others to flee. Benzion leads them across a shallow stream. As Kissely and police arrive, Bielski group members, carrying a goat, scramble up a slope. Zus helps a woman who falls. Tuvia and others take positions behind trees, firing as Russian policemen and soldiers appear. A wounded soldier retreats. Zus reloads and hits the milkman's arm. Tuvia fires a barrage, and the police withdraw. A community, with bundles, exits the forest—a line of shadows across a tall grass meadow. Tuvia and Ben Zion lead, followed by Zus and Bella."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Bella approaches Zus, seated on a log, her short dark hair peeking from a grey wool coat. They smile briefly. Zus offers her his hip flask. She smiles, takes a sip, and they share a gaze. He touches her cheek, then places her hand on her right breast, discreetly covered by her coat. Elsewhere, Aron and Rachel see Kissely the milkman pursued by armed men in black uniforms and hide behind a rock. Zus, Tuvia, and others urge people to flee, led by Benzion across a stream. As Kissely and the policemen arrive at the camp, a woman falls, but Zus helps her up. People carrying bags scramble up a slope. Tuvia and armed men take positions behind trees as soldiers approach. They engage in a gunfight, and as the enemy retreats, Tuvia considers his brother's words and follows others. The displaced group, clutching bundles, some in hats and coats, others in caps and jackets, pass through tall, bare trees into a breezy meadow, walking in single file, like shadows. Tuvia and Ben Zion, with Zus and Bella, lead them out of the wood."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Bella gracefully walks up to where Zus is comfortably sitting on a rustic log. Her dark hair, which is stylishly cut short, frames her face, and she wears a grey wool coat that enhances her look. She settles herself down on the log beside him, and the two exchange a warm, brief smile. Zus, with a hint of camaraderie, offers her a sip from his trusty hip flask. She meets his playful expression with a nonchalant shrug, then rewards him with a smile. Taking the flask in hand, she drinks from it. Zus observes her intently before lowering his gaze. His dark eyes capture hers, and she acknowledges his look with a faint nod. On this occasion, she confidently meets Zus's eyes. With tentative care, he raises his hand and caresses her cheek with his fingers, softly pulling at her bottom lip using his thumb. She gently takes hold of his hand with hers and places it on her right breast, subtly concealing his hand beneath her coat and maintaining his gaze. Meanwhile, elsewhere in the forest, Aron and his friend, Rachel, are making their way through the sparse birch trees. In the distance, they spot Kissely the milkman hurriedly running ahead of a unit of armed men clad in ominous black uniforms. The two youngsters quickly dive behind a protective rock. Zus and Tuvia, both with guns at the ready, urgently encourage the men and women to flee. Benzion, wearing a fur hat, takes the lead in guiding them across a shallow stream. Kissely and the policemen, now brandishing guns, arrive ominously at the camp. Among the Bielski group, someone struggles to carry a goat across the water. A woman stumbles, falling into the stream, and Zus rushes to help her back on her feet. Burdened with bags and baskets, the people scramble frantically up a slope. Tuvia and other armed men quickly move back down the hill, strategically taking up positions behind the trees. The Russian policemen and helmeted soldiers come ominously into view below them. Zus, Tuvia, and the others commence firing. A wounded soldier is assisted away from the stream, while the bearded milkman cowers defensively behind a tree. Zus pauses momentarily to reload. The policeman glances back at his small contingent of men. Zus takes aim and hits the milkman in the arm. Tuvia unleashes a rapid salvo of bullets. The policeman, still hiding behind a tree, calls his men to retreat. Tuvia intently watches them as they make their way back through the trees. He and the others advance confidently in a line, while Zus reloads. Tuvia's cheeks tighten with tension as he considers his brother's words, but he quickly runs off after the others. The displaced community of men, women, and children, all clutching their bundles of possessions, some wearing hats and coats, others in flat caps and jackets, with many women donning shawls on their heads, make their way through the forest. They are dwarfed by the tall, thin, bare trees that surround them. Eventually, they emerge onto a meadow filled with tall grasses gently swaying in the breeze, moving almost in single file, like black shadows crossing the landscape. Tuvia and Ben Zion lead the procession out of the woods, with Zus and Bella walking side by side behind them."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Bella, with an air of elegance and grace, approaches the spot where Zus is comfortably seated on a worn, rustic log. Her dark hair, which is cut stylishly short, frames her face in a flattering way, enhancing her appearance. She is dressed in a grey wool coat that further accentuates her look. Settling herself down beside him on the log, they exchange a warm and brief smile filled with familiarity. Zus, with a gesture that reflects camaraderie and friendship, offers her a sip from his reliable hip flask. She meets his playful expression with a nonchalant shrug, rewarding him with a smile of her own. Taking the flask confidently in hand, she drinks from it. Zus watches intently, observing her actions before lowering his gaze. His deep, dark eyes capture hers, and she acknowledges his look with a faint nod in return. On this particular occasion, she confidently locks eyes with Zus. With tentative care and affection, he raises his hand to gently caress her cheek with his fingers, softly pulling at her bottom lip using his thumb. She gently takes hold of his hand with hers, placing it over her right breast and subtly concealing his hand beneath her coat while maintaining his gaze.\n\nMeanwhile, elsewhere within the forest, Aron and his friend Rachel are making their way through the sparse and scattered birch trees. In the distance, they spot Kissely, the local milkman, hurriedly running just ahead of a unit of ominous armed men clad in threatening black uniforms. The two youngsters, acting quickly, dive behind a protective rock for safety. Zus and Tuvia, both equipped with guns at the ready, urgently encourage the men and women to flee for their lives. Benzion, distinguished by his fur hat, takes the lead role in guiding them across a shallow stream. Kissely and the policemen, now brandishing their guns menacingly, arrive at the camp in a foreboding manner. Among the Bielski group, someone struggles with the cumbersome task of carrying a goat across the water. A woman stumbles and falls into the stream, and Zus rushes over to help her get back on her feet. Burdened with bags and baskets, the people scramble frantically up a nearby slope in desperation. Tuvia, along with other armed men, quickly moves back down the hill, strategically taking up positions behind the trees for cover. The Russian policemen and helmeted soldiers come ominously into view below them. Zus, Tuvia, and the others commence firing, unleashing a barrage of bullets. A wounded soldier is assisted away from the stream, while the bearded milkman cowers defensively behind a tree, seeking protection. Zus pauses momentarily to reload his weapon. The policeman glances back at his small contingent of men, assessing their situation. Zus takes aim and successfully hits the milkman in the arm. Tuvia unleashes a rapid salvo of bullets, maintaining the pressure. The policeman, still hiding defensively behind a tree, calls his men to retreat. Tuvia watches them with intense focus as they make their way back through the trees. He and the others advance confidently in a line, reassured by their tactics, while Zus reloads his weapon. Tuvia's cheeks tighten with tension as he reflects on his brother's words but quickly runs off after the others. The displaced community of men, women, and children, holding tightly to their bundles of possessions, with some wearing hats and coats, others donned in flat caps and jackets, and many women with shawls on their heads, make their way through the dense forest. They are dwarfed by the tall, thin, bare trees that surround them, emphasizing their vulnerability. Eventually, they emerge onto a meadow filled with tall grasses swaying gently in the breeze, moving almost in single file like black shadows crossing the landscape. Tuvia and Ben Zion lead the procession out of the woods, with Zus and Bella walking side by side just behind them."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Bella approaches Zus, who is comfortably seated on a rough log, his posture relaxed. Her short, dark hair frames her face, contrasting sharply with her grey wool coat. She lowers herself onto the log beside him, the wood slightly rough beneath her, and for a brief moment, their eyes meet, exchanging a gentle smile. Zus, with a playful twinkle in his eyes, extends his hip flask toward her. She responds to his lighthearted gesture with a casual shrug followed by a soft smile, accepting the offer. Taking the flask in hand, she raises it to her lips and takes a sip. He observes her intently before momentarily casting his gaze downward. His deep, dark eyes find hers again, holding them meaningfully as she gives him a slight nod, a silent understanding passing between them. Her gaze grows more resolute as she looks directly into Zus's eyes. In a tentative manner, his hand rises, fingers brushing her cheek before gently tugging at her lower lip with his thumb. She responds by grasping his hand and guiding it to her right breast, strategically concealing it under her coat to maintain discretion, all the while holding his gaze steadily with a sense of boldness. Meanwhile, in another part of the forest, Aron and his companion, Rachel, navigate their way through the sparse array of slender birch trees. From afar, they catch sight of Kissely, the milkman, sprinting ahead of a unit of men dressed in ominous black uniforms. The pair of young ones act quickly, diving for cover behind a large rock. Nearby, Zus and Tuvia are on high alert, guns raised and ready, urgently signaling the surrounding men and women to escape. Benzion, his head warm under a fur hat, leads a group as they hurriedly cross a shallow stream. As Kissely and the armed policemen arrive at the camp, one member of the Bielski group is seen laboriously carrying a goat across the stream. A woman falters and splashes into the water, but Zus is there to offer her a helping hand. Laden with bags and baskets, the group struggles up a sloping hill, while Tuvia and other armed men retreat strategically down the hill to position themselves behind trees for cover. The Russian policemen, accompanied by helmeted soldiers, emerge into view below them. A tense moment unfolds as Zus, Tuvia, and others open fire. One soldier, injured, is assisted away from the stream. Meanwhile, the bearded milkman, trembling, hides behind a tree. As Zus pauses to reload his weapon, the policeman glances back at his small group of half a dozen men. In the confusion, Zus successfully targets the milkman's arm. Tuvia unleashes a barrage of gunfire, his shots echoing through the trees. The policeman, crouched behind a tree, orders his men to retreat. Tuvia observes their withdrawal as they disappear into the forest, then advances confidently alongside his comrades, with Zus reloading his weapon. Tuvia's face momentarily tightens with contemplation over his brother's words, but then he sprints to join the others. Meanwhile, the displaced community, a mixture of men, women, and children gripping their meager belongings, some adorned in hats and coats, others in flat caps and jackets, numerous women with shawls covering their heads, tread heavily through the dense forest, dwarfed by the towering, slender, barren trees around them. They finally emerge onto a meadow filled with tall grasses dancing in the wind, proceeding almost in single file, like dark silhouettes against the landscape. Leading them out of the woods are Tuvia and Ben Zion, with Zus and Bella following closely, side by side."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Bella approaches Zus, who is seated on a log, and sits beside him wearing a grey wool coat. They share a brief smile before Zus offers her his hip flask with a playful expression, which she accepts with a shrug and a smile. After taking a sip, their eyes meet, and she nods faintly. Zus tentatively touches her cheek and pulls at her bottom lip with his thumb. She guides his hand to her right breast, discreetly covering it with her coat while maintaining eye contact. Meanwhile, Aron and Rachel move through the birch trees and spot Kissely the milkman running from a unit of armed men. They hide behind a rock. Zus and Tuvia, alert with their guns ready, urge the group to flee as Benzion leads them across a stream. As the armed men arrive at the camp, a woman stumbles, and Zus helps her up. The group scrambles up a slope while Tuvia and others, taking positions behind trees, prepare to defend. The armed men approach, and Zus, Tuvia, and their companions open fire, wounding a soldier. The milkman cowers, and Zus hits his arm. Tuvia's salvo forces the policemen to retreat, and as they do, he and the others advance. With determination etched on his face, Tuvia, after a moment of reflection, pursues his group. The displaced community, clutching their belongings and adorned with hats, coats, and shawls, make their way through the towering trees. Emerging onto a meadow, they form a line across the landscape, with Tuvia, Ben Zion, Zus, and Bella leading them out of the woods."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Bella walks up to Zus, a member of the Bielski partisan group during World War II, who is sitting on a log in the forest that served as a refuge for Jewish resistance fighters in Eastern Europe. Her dark hair cut short and wearing a grey wool coat, she sits down on the log, and they exchange a brief smile. Zus offers her a sip from his hip flask that contains spirits to warm them in the cold woods. She meets his playful expression with a shrug, and then a smile. She takes the flask and drinks from it. He looks, then lowers his eyes, aware of the constant danger surrounding them. His dark eyes hold her in his gaze, and she nods faintly. This time, she looks Zus straight in the eye. Tentatively, he raises his hand and touches her cheek with his fingers, gently pulling at her bottom lip with his thumb, a gesture of affection amidst the turmoil. She takes hold of his hand with her hand and places it on her right breast, discretely covering his hand with a coat and holding his gaze, a moment of intimacy as they share their fears and hopes. Elsewhere, Aron and his friend, Rachel, tramp through the spindly birch trees that characterize the dense forests of the region. In the distance, they spot Kissely the milkman running ahead of a unit of armed men in black uniforms, likely collaborators or Nazi soldiers tasked with hunting down Jewish escapees. The two youngsters dive behind a rock for safety. Zus and Tuvia, leaders of the Bielski detachment committed to saving Jewish lives, their guns up and ready, urge the men and women to flee. And Benzion in a fur hat, a common garment for warmth, leads them across a shallow stream. Kissely and the policemen with guns arrive at the camp, causing panic. One of the Bielski group carries a goat, a precious source of milk and cheese, across the stream. A woman stumbles and falls into the water amidst the chaos. Zus helps her up, demonstrating their solidarity. Carrying bags and baskets filled with their meager belongings, the people scramble up a slope. Tuvia and other men with guns scoot back down the hill to take up positions behind trees, preparing to defend their community. The Russian policemen and helmeted soldiers come into view below them, representing the constant threat of capture. Zus, Tuvia, and the others fire, the sounds echoing through the forest. One wounded soldier is helped away from the stream. The bearded milkman cowers behind a tree, now caught in the crossfire of his own making. Zus stops to reload his weapon. The policeman looks back at his half a dozen men, reconsidering their advance. Zus hits the milkman's arm with a precise shot. Tuvia unleashes a salvo of bullets, determined to protect his people. The policeman skulking behind a tree calls to his men to go, signaling a retreat. Tuvia watches them retreating through the trees, knowing they have bought some time. He and the others stride forward in a line, their determination unyielding, and Zus reloads. Tuvia's cheeks tighten as he ponders his brother's words of resilience and survival, but he runs off after the others. The displaced community of men, women, and children clutching their bundles of possessions, some in hats and coats, others in flat caps and jackets, many of the women with shawls on their heads to protect against the elements, tramp through the forest, dwarfed by the tall, thin, bare trees that provide their cover. They come out onto a meadow of tall grasses wafting in the breeze, walking almost in single file, like black shadows moving across the landscape, a testament to their perseverance. Tuvia and Ben Zion, behind them Zus with Bella by his side, lead the way out of the wood, continuing their journey towards safety and freedom."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Zus helps her up Bella walks up to Zus who is sitting on a log A woman stumbles and falls into the water Her dark hair cut short and wearing a grey wool coat she sits down on the log and they exchange a brief smile Zus offers her a sip from his hip flask She meets his playful expression with a shrug and then a smile She takes the flask and drinks from it He looks then lowers his eyes His dark eyes hold her in his gaze and she nods faintly This time she looks Zus straight in the eye Bella walks up to Zus who is sitting on a log Tentatively he raises his hand and touches her cheek with his fingers gently pulling at her bottom lip with his thumb She takes hold of his hand with her hand and places it on her right breast discretely covering his hand with a coat and holding his gaze Elsewhere Aron and his friend Rachel tramp through the spindly birch trees And Benzion in a fur hat leads them across a shallow stream In the distance they spot Kissely the milkman running ahead of a unit of armed men in black uniforms The Russian policemen and helmeted soldiers come into view below them The two youngsters dive behind a rock Zus and Tuvia their guns up and ready urge the men and women to flee Zus offers her a sip from his hip flask And Benzion in a fur hat leads them across a shallow stream Zus with Bella by his side lead the way out of the wood Kissely and the policemen with guns arrive at the camp One of the Bielski group carries a goat across the stream A woman stumbles and falls into the water Zus helps her up Carrying bags and baskets the people scramble up a slope Tuvia and other men with guns scoot back down the hill to take up positions behind trees His dark eyes hold her in his gaze and she nods faintly The Russian policemen and helmeted soldiers come into view below them Zus Tuvia and the others fire One wounded soldier is helped away from the stream She meets his playful expression with a shrug and then a smile Tuvia watches them retreating through the trees The bearded milkman cowers behind a tree Zus stops to reload The policeman looks back at his half a dozen men Zus hits the milkman's arm Tuvia unleashes a salvo of bullets The policeman skulking behind a tree calls to his men to go Tuvia watches them retreating through the trees He and the others stride forward in a line and Zus reloads Tuvia's cheeks tighten as he ponders his brother's words but he runs off after the others They come out onto a meadow of tall grasses wafting in the breeze walking almost in single file like black shadows moving across the landscape One wounded soldier is helped away from the stream This time she looks Zus straight in the eye The displaced community of men women and children clutching their bundles of possessions some in hats and coats others in flat caps and jackets Zus stops to reload Kissely and the policemen with guns arrive at the camp many of the women with shawls on their heads tramp through the forest dwarfed by the tall thin bare trees They come out onto a meadow of tall grasses wafting in the breeze walking almost in single file like black shadows moving across the landscape Tuvia and Ben Zion behind them Zus with Bella by his side lead the way out of the wood Zus and Tuvia their guns up and ready urge the men and women to flee Tentatively he raises his hand and touches her cheek with his fingers gently pulling at her bottom lip with his thumb Her dark hair cut short and wearing a grey wool coat she sits down on the log and they exchange a brief smile Tuvia and Ben Zion behind them"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Bella walks up to Zus who is sitting on a log. Her dark hair cut short and wearing a grey wool coat she sits down on the log and they exchange a brief smile. Zus offers her a sip from his hip flask. She meets his playful expression with a shrug and then a smile. She takes the flask and drinks from it. He looks then lowers his eyes. His dark eyes hold her in his gaze and she nods faintly. This time she looks Zus straight in the eye. Tentatively he raises his hand and touches her cheek with his fingers gently pulling at her bottom lip with his thumb. She takes hold of his hand with her hand and places it on her right breast discretely covering his hand with a coat and holding his gaze. Elsewhere Aron and his friend Rachel tramp through the spindly birch trees. In the distance they spot Kissely the milkman running ahead of a unit of armed men in black uniforms. The two youngsters dive behind a rock. Zus and Tuvia their guns up and ready urge the men and women to flee. And Benzion in a fur hat leads them across a shallow stream. Kissely and the policemen with guns arrive at the camp. One of the Bielski group carries a goat across the stream. A woman stumbles and falls into the water. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Zus helps her up. Carrying bags and baskets the people scramble up a slope. Tuvia and other men with guns scoot back down the hill to take up positions behind trees. The Russian policemen and helmeted soldiers come into view below them. Zus Tuvia and the others fire. One wounded soldier is helped away from the stream. The bearded milkman cowers behind a tree. Zus stops to reload. The policeman looks back at his half a dozen men. Zus hits the milkman's arm. Tuvia unleashes a salvo of bullets. The policeman skulking behind a tree calls to his men to go. Tuvia watches them retreating through the trees. He and the others stride forward in a line and Zus reloads Tuvia's cheeks tighten as he ponders his brother's words but he runs off after the others. The displaced community of men women and children clutching their bundles of possessions some in hats and coats others in flat caps and jackets. many of the women with shawls on their heads tramp through the forest dwarfed by the tall thin bare trees. They come out onto a meadow of tall grasses wafting in the breeze walking almost in single file like black shadows moving across the landscape. Tuvia and Ben Zion behind them. Zus with Bella by his side lead the way out of the wood."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Bella walks up to Zus who is sitting on a log. Her dark hair cut short and wearing a grey wool coat she sits down on the log and they exchange a brief smile. Zus offers her a sip from his hip flask. She meets his playful expression with a shrug and then a smile. She takes the flask and drinks from it. He looks then lowers his eyes. His dark eyes hold her in his gaze and she nods faintly. This time she looks Zus straight in the eye. Tentatively he raises his hand and touches her cheek with his fingers gently pulling at her bottom lip with his thumb. She takes hold of his hand with her hand and places it on her right breast discretely covering his hand with a coat and holding his gaze. Elsewhere Aron and his friend Rachel tramp through the spindly birch trees. In the distance they spot Kissely the milkman running ahead of a unit of armed men in black uniforms. The two youngsters dive behind a rock. Zus and Tuvia their guns up and ready urge the men and women to flee. And Benzion in a fur hat leads them across a shallow stream. Kissely and the policemen with guns arrive at the camp. One of the Bielski group carries a goat across the stream. A woman stumbles and falls into the water. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Zus helps her up. Carrying bags and baskets the people scramble up a slope. Tuvia and other men with guns scoot back down the hill to take up positions behind trees. The Russian policemen and helmeted soldiers come into view below them. Zus Tuvia and the others fire. One wounded soldier is helped away from the stream. The bearded milkman cowers behind a tree. Zus stops to reload. The policeman looks back at his half a dozen men. Zus hits the milkman's arm. Tuvia unleashes a salvo of bullets. The policeman skulking behind a tree calls to his men to go. Tuvia watches them retreating through the trees. He and the others stride forward in a line and Zus reloads Tuvia's cheeks tighten as he ponders his brother's words but he runs off after the others. The displaced community of men women and children clutching their bundles of possessions some in hats and coats others in flat caps and jackets. many of the women with shawls on their heads tramp through the forest dwarfed by the tall thin bare trees. They come out onto a meadow of tall grasses wafting in the breeze walking almost in single file like black shadows moving across the landscape. Tuvia and Ben Zion behind them. Zus with Bella by his side lead the way out of the wood."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Bella walks up to Zus who is sitting on a log. Her dark hair cut short and wearing a grey wool coat she sits down on the log and they exchange a brief smile. Zus offers her a sip from his hip flask. She meets his playful expression with a shrug and then a smile. She takes the flask and drinks from it. He looks then lowers his eyes. His dark eyes hold her in his gaze and she nods faintly. This time she looks Zus straight in the eye. Tentatively he raises his hand and touches her cheek with his fingers gently pulling at her bottom lip with his thumb. Zus hits the milkman's arm. Tuvia unleashes a salvo of bullets. The policeman skulking behind a tree calls to his men to go. Tuvia watches them retreating through the trees. He and the others stride forward in a line and Zus reloads Tuvia's cheeks tighten as he ponders his brother's words but he runs off after the others. The displaced community of men women and children clutching their bundles of possessions some in hats and coats others in flat caps and jackets. many of the women with shawls on their heads tramp through the forest dwarfed by the tall thin bare trees. They come out onto a meadow of tall grasses wafting in the breeze walking almost in single file like black shadows moving across the landscape. Tuvia and Ben Zion behind them. Zus with Bella by his side lead the way out of the wood."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Bella walks up to Zus who is sitting on a log. Her dark hair cut short and wearing a grey wool coat she sits down on the log and they exchange a brief smile. Zus offers her a sip from his hip flask. She meets his playful expression with a shrug and then a smile. many of the women with shawls on their heads tramp through the forest dwarfed by the tall thin bare trees. They come out onto a meadow of tall grasses wafting in the breeze walking almost in single file like black shadows moving across the landscape. Tuvia and Ben Zion behind them. Zus with Bella by his side lead the way out of the wood."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Sophia walks up to Max who is sitting on a log. His dark hair cut short and wearing a grey wool coat, he sits down on the log, and they exchange a brief smile. Max offers him a sip from his hip flask. He meets his playful expression with a shrug, and then a smile. He takes the flask and drinks from it. She looks, then lowers her eyes. Her dark eyes hold him in her gaze, and he nods faintly. This time, he looks Max straight in the eye. Tentatively, she raises her hand and touches his cheek with her fingers, gently pulling at his bottom lip with her thumb. He takes hold of her hand with his hand and places it on his right breast, discretely covering her hand with a coat and holding his gaze. Elsewhere, Naomi and her friend, Oliver, tramp through the spindly birch trees. In the distance, they spot Jasper the milkman running ahead of a unit of armed men in black uniforms. The two youngsters dive behind a rock. Max and Lucas, their guns up and ready, urge the men and women to flee. And David in a fur hat leads them across a shallow stream. Jasper and the policemen with guns arrive at the camp. One of the Meyer group carries a goat across the stream. A man stumbles and falls into the water. Max helps him up. Carrying bags and baskets, the people scramble up a slope. Lucas and other women with guns scoot back down the hill to take up positions behind trees. The German policemen and helmeted soldiers come into view below them. Max, Lucas, and the others fire. One wounded soldier is helped away from the stream. The bearded milkman cowers behind a tree. Max stops to reload. The soldier looks back at his half a dozen men. Max hits the milkman's arm. Lucas unleashes a salvo of bullets. The soldier skulking behind a tree calls to his men to go. Lucas watches them retreating through the trees. She and the others stride forward in a line, and Max reloads. Lucas's cheeks tighten as she ponders her sister's words, but she runs off after the others. The displaced community of women, men, and children clutching their bundles of possessions, some in hats and coats, others in flat caps and jackets, many of the men with shawls on their heads tramp through the forest, dwarfed by the tall, thin, bare trees. They come out onto a meadow of tall grasses wafting in the breeze, walking almost in single file, like black shadows moving across the landscape. Lucas and Sarah, behind them Max with Sophia by his side, lead the way out of the wood."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Bella walks up to Zus who is sitting on a boulder. Her dark hair cut short and wearing a denim jacket, she sits down on the boulder, and they exchange a brief smile. Zus offers her a sip from his thermos. She meets his playful expression with a shrug, and then a smile. She takes the thermos and drinks from it. He looks, then lowers his eyes. His dark eyes hold her in his gaze, and she nods faintly. This time, she looks Zus straight in the eye. Tentatively, he raises his hand and touches her cheek with his fingers, gently pulling at her bottom lip with his thumb. She takes hold of his hand with her hand and places it on her right shoulder, discretely covering his hand with a jacket and holding his gaze. Elsewhere, Aron and his friend, Rachel, tramp through the spindly pine trees. In the distance, they spot Kissely the gardener running ahead of a unit of armed men in brown uniforms. The two youngsters dive behind a shrub. Zus and Tuvia, their slingshots up and ready, urge the men and women to flee. And Benzion in a leather cap leads them across a shallow ditch. Kissely and the policemen with slingshots arrive at the camp. One of the Bielski group carries a cat across the ditch. A woman stumbles and falls into the mud. Zus helps her up. Carrying backpacks and satchels, the people scramble up a slope. Tuvia and other men with slingshots scoot back down the hill to take up positions behind rocks. The Russian policemen and helmeted firefighters come into view below them. Zus, Tuvia, and the others fire. One wounded firefighter is helped away from the ditch. The bearded gardener cowers behind a bush. Zus stops to reload. The policeman looks back at his half a dozen men. Zus hits the gardener's arm. Tuvia unleashes a salvo of stones. The policeman skulking behind a bush calls to his men to go. Tuvia watches them retreating through the trees. He and the others stride forward in a line, and Zus reloads. Tuvia's cheeks tighten as he ponders his brother's words, but he runs off after the others. The displaced community of men, women, and children clutching their bundles of possessions, some in hats and cloaks, others in flat caps and sweaters, many of the women with scarves on their heads tramp through the forest, dwarfed by the tall, thin, bare bushes. They come out onto a meadow of tall wildflowers wafting in the breeze, walking almost in single file, like black shadows moving across the landscape. Tuvia and Ben Zion, behind them Zus with Bella by his side, lead the way out of the grove."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Bella jogs over to Zus who is lounging on a log. Her dark hair styled in a short cut and wearing a grey wool coat, she perches on the log, and they share a brief grin. Zus passes her a morsel from his hip flask. She greets his playful expression with a shrug, and then a grin. She takes the flask and swigs from it. He glances, then averts his eyes. His dark eyes captivate her in his gaze, and she nods slightly. This time, she stares Zus straight in the eye. Cautiously, he extends his hand and grazes her cheek with his fingers, gently tapping her bottom lip with his thumb. She grasps his hand with her hand and places it on her right breast, carefully draping his hand with a coat and maintaining his gaze. Elsewhere, Aron and his friend, Rachel, march through the spindly birch trees. In the distance, they observe Kissely the milkman strolling ahead of a unit of armed men in black uniforms. The two youths leap behind a rock. Zus and Tuvia, their guns poised and ready, signal the men and women to hide. And Benzion in a fur hat guides them across a shallow stream. Kissely and the policemen with guns show up at the camp. One of the Bielski group drags a goat through the stream. A woman trips and tumbles into the water. Zus pulls her up. Hauling bags and baskets, the people scuttle up a slope. Tuvia and other men with guns dash back down the hill to take cover behind trees. The Russian policemen and helmeted soldiers appear below them. Zus, Tuvia, and the others shoot. One wounded soldier is carried away from the stream. The bearded milkman hides behind a tree. Zus halts to reload. The policeman glances back at his half a dozen men. Zus taps the milkman's arm. Tuvia releases a volley of bullets. The policeman lurking behind a tree calls to his men to depart. Tuvia observes them retreating through the trees. He and the others advance forward in a line, and Zus reloads. Tuvia's cheeks tighten as he considers his brother's words, but he dashes off after the others. The uprooted community of men, women, and children clutching their bundles of possessions, some in hats and coats, others in flat caps and jackets, many of the women with shawls on their heads trek through the forest, overshadowed by the tall, thin, bare trees. They emerge onto a meadow of tall grasses swaying in the breeze, walking almost in single file, like black shadows traversing the landscape. Tuvia and Ben Zion, behind them Zus with Bella by his side, lead the way out of the wood."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Olive strolls up to Jupiter who is lounging on a bench. His long beard braided and sporting a red velvet cape, he relaxes on the sand, and they trade a brief nod. Jupiter gives Olive a glance at her teacup. He meets her curious glance with a shrug, followed by a nod. He takes the cup and sips from it. She grins, then lowers her eyes. Her blue eyes lock him in her stare, and he gestures slightly. This moment, he watches Olive directly in the face. Cautiously, she raises her arm and strokes his ear with her palm, softly brushing his forehead with her knuckle. He grasps his arm with his hand and presses it to his left knee, subtly hiding his arm with a scarf and returning his glance. Elsewhere, Titan and his accomplice, Luna, march through the spindly willow bushes. In the distance, they notice Clarion the grocer jogging ahead of a squad of armored figures in white capes. The two elders duck behind a bench. Jupiter and Mars, their bags up and eager, urge the figures to rush. And Orion with a pipe helmet directs them across a narrow valley. Clarion and the guards with ropes reach the site. One of the Orion crew drags a cat over the valley. A child slips and tumbles into the mud. Jupiter pulls him free. Hauling cases and crates, the figures scurry up a path. Mars and other elders with ropes scamper down the slope to set up positions behind bushes. The Martian guards and cloaked knights come into focus above them. Jupiter, Mars, and the rest advance. One injured knight is led away from the valley. The mustachioed grocer shrinks behind a bush. Jupiter pauses to refill. The guard glances back at his trio of figures. Jupiter grazes the grocer's shoulder. Mars unleashes a barrage of whistles. The guard hidden behind a bush signals to his figures to retreat. Mars observes them withdrawing among the bushes. He and the rest march ahead in formation, as Jupiter refills. Mars's fists clench as he considers his sibling's phrases, but he dashes after the rest. The displaced assembly of elders, figures, and juveniles clutching their heaps of belongings, some in hoods and robes, others in caps and tunics, many of the figures with mantles on their shoulders march across the clearing, overshadowed by the towering, skinny, empty bushes. They emerge onto a glade of towering reeds fluttering in the wind, treading almost in a single row, like white shadows drifting across the scene. Mars and Orion, trailing them Jupiter with Olive beside his stride, lead the procession from the bush."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Chloe glides up to Max, who is reclining on a bench. Her auburn hair tied in a ponytail and wearing a blue denim jacket, she perches on the bench, and they share a quick grin. Max hands her a bite from his sandwich. She matches his amused glance with a shrug and then a laugh. She grabs the sandwich and takes a bite. He peeks, then averts his gaze. His hazel eyes lock onto hers, and she nods slightly. This time, she stares Max directly in the eye. Gently, he lifts his hand and brushes her shoulder with his fingers, softly tracing her collarbone with his thumb. She grabs his hand with her hand and moves it to her left shoulder, discreetly adjusting his hand with a scarf and maintaining eye contact. Meanwhile, Ezra and his companion, Sarah, march through the towering pine trees. In the distance, they notice Jacob the baker sprinting ahead of a squad of stealthy scouts in green fatigues. The pair of hikers duck behind a boulder. Max and Levi, their binoculars up and ready, coax the group to retreat. And Avi in a beanie guides them across a narrow bridge. Jacob and the scouts with radios converge on the clearing. One of the Bielski band drags a cart across the bridge. A child trips and splashes into the water. Max assists her out. Carrying lanterns and blankets, the group hustles up a rise. Levi and others with map cases dash back down the slope to find cover behind shrubs. The group of scouts and helmeted riders appear beneath them. Max, Levi, and the others shoot. One injured scout is assisted away from the bridge. The bearded baker shields himself behind a shrub. Max pauses to reload. The scout glances back at his dozen troops. Max strikes the baker's leg. Levi releases a burst of shots. The scout hiding behind a shrub signals his troops to retreat. Levi observes them withdrawing through the undergrowth. He and the others advance in formation, and Max reloads. Levi's mouth tightens as he reflects on his friend's advice, but he dashes off after the others. The uprooted gathering of men, women, and children clutching their bundles of belongings, some in hats and coats, others in flat caps and scarves, many of the men with shawls over their shoulders march through the wilderness, overshadowed by the tall, slender, leafless trees. They spill out onto a field of wildflowers rippling in the wind, moving almost in a line, like dark figures gliding across the terrain. Levi and Ben Avi, behind them Max with Chloe by his side, lead the path out of the forest."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Bella strides up to Zus who is perched on a boulder. Her dark hair styled in a pixie cut and wearing a green leather jacket, she perches down on the boulder, and they share a quick wink. Zus offers her a nibble from his chocolate bar. She meets his teasing expression with a pout, and then a grin. She takes the chocolate and nibbles on it. He stares, then averts his eyes. His dark eyes capture hers, and she nods slightly. This time, she gazes Zus straight in the eye. Hesitantly, he lifts his hand and brushes her cheek with his fingers, gently tapping at her chin with his thumb. She grasps his hand with her hand and places it on her left shoulder, discreetly covering his hand with a jacket and holding his gaze. Elsewhere, Aron and his friend, Rachel, tiptoe through the dense pine trees. In the distance, they spot Kissely the baker jogging ahead of a squad of uniformed women in red dresses. The two youngsters duck behind a bush. Zus and Tuvia, their bows raised and ready, urge the men and women to scatter. And Benzion in a feathered cap leads them across a dry ditch. Kissely and the marchers with bows arrive at the clearing. One of the Bielski group carries a sheep across the ditch. A man trips and lands in the dirt. Zus assists him up. Carrying suitcases and crates, the people hurry up a slope. Tuvia and other men with bows rush back down the hill to take up positions behind bushes. The Russian marchers and helmeted agents come into view below them. Zus, Tuvia, and the others launch arrows. One injured agent is helped away from the ditch. The bearded baker hides behind a bush. Zus pauses to reload. The agent glances back at his handful of women. Zus strikes the baker's elbow. Tuvia releases a barrage of arrows. The agent lurking behind a bush calls to his women to retreat. Tuvia watches them disappearing through the bushes. He and the others march forward in a line, and Zus reloads. Tuvia's lips tighten as he reflects on his brother's remarks, but he jogs off after the others. The wandering group of men, women, and children clutching their parcels of possessions, some in scarves and capes, others in berets and vests, many of the women with headscarves on their heads march through the woods, dwarfed by the wide, sprawling, leafless trees. They emerge onto a field of short flowers fluttering in the breeze, walking almost side by side, like grey figures gliding across the landscape. Tuvia and Ben Zion, behind them Zus with Bella by his side, lead the way out of the thicket."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Harold rolls up to Molly who is perched on a bench. His blonde mane styled long and sporting a red leather jacket, he jumps down from the bench, and they trade a quick chuckle. Molly presents him with a bite from her sandwich. He returns her curious glance with a grin, and then a chuckle. He grabs the sandwich and nibbles on it. She observes, then averts her gaze. Her blue eyes embrace him in her view, and he waves gently. This time, he gazes Molly directly in the face. Hesitantly, she lifts her foot and taps his shoulder with her toes, softly nudging at his elbow with her heel. He captures her foot with his foot and places it on his left knee, subtly wrapping her foot with a scarf and holding her view. Meanwhile, Eugene and his cousin, Hannah, march through the towering oak grove. In the distance, they notice Morton the painter dashing ahead of a group of armored knights in red cloaks. The two cousins duck behind a boulder. Molly and Gregor, their slingshots poised and steady, implore the knights and squires to disperse. And Vladimir in a wool cap guides them across a murky pond. Morton and the painters with brushes arrive at the base. One of the Bielski crew drags a sheep across the pond. A girl trips and splashes into the puddle. Molly aids her up. Bearing sacks and crates, the crowd scales a bluff. Gregor and other knights with sabers glide back down the ridge to set up spots behind shrubs. The French painters and plumed warriors appear in sight above them. Molly, Gregor, and the rest launch stones. One injured warrior is carried away from the pond. The whiskered painter shivers behind a shrub. Molly pauses to refill. The painter surveys his trio of artists. Molly nicks the painter's leg. Gregor hurls a barrage of pebbles. The artist sneaking behind a shrub beckons his artists to flee. Gregor observes them vanishing through the grove. He and the others charge forth in a cluster, and Molly refills. Gregor's lips twitch as he contemplates his sister's advice, but he dashes off after the others. The relocated community of knights, squires, and pages grasping their heaps of belongings, some in cloaks and gloves, others in helmets and vests, many of the squires with helmets on their heads march through the grove, overshadowed by the towering, broad, leafy trees. They emerge onto a clearing of low bushes drifting in the wind, moving nearly in a winding line, like white silhouettes sweeping across the terrain. Gregor and Vladimir, trailing them Molly with Harold beside her, steer the way out of the thicket."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Bella approaches Zus, sitting on a log, and they exchange smiles. She accepts his hip flask, and their connection deepens as he touches her cheek and she places his hand discreetly on her breast. Meanwhile, Aron and Rachel notice Kissely the milkman running from armed men, prompting them to hide. Zus and Tuvia urge the camp to flee as armed soldiers approach. In the ensuing chaos, they help people cross a stream and engage in a firefight with the soldiers. Tuvia and his group eventually repel the attackers. The community, carrying their possessions, traverses a forest and emerges into a meadow, led by Tuvia, Ben Zion, Zus, and Bella."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Zus with Bella by his side lead the way out of the wood Tuvia and Ben Zion behind them They come out onto a meadow of tall grasses wafting in the breeze walking almost in single file like black shadows moving across the landscape many of the women with shawls on their heads tramp through the forest dwarfed by the tall thin bare trees The displaced community of men women and children clutching their bundles of possessions some in hats and coats others in flat caps and jackets He and the others stride forward in a line and Zus reloads Tuvia's cheeks tighten as he ponders his brother's words but he runs off after the others Tuvia watches them retreating through the trees The policeman skulking behind a tree calls to his men to go Tuvia unleashes a salvo of bullets Zus hits the milkman's arm The policeman looks back at his half a dozen men Zus stops to reload The bearded milkman cowers behind a tree One wounded soldier is helped away from the stream Zus Tuvia and the others fire The Russian policemen and helmeted soldiers come into view below them Tuvia and other men with guns scoot back down the hill to take up positions behind trees Carrying bags and baskets the people scramble up a slope Zus helps her up A woman stumbles and falls into the water One of the Bielski group carries a goat across the stream Kissely and the policemen with guns arrive at the camp And Benzion in a fur hat leads them across a shallow stream Zus and Tuvia their guns up and ready urge the men and women to flee The two youngsters dive behind a rock In the distance they spot Kissely the milkman running ahead of a unit of armed men in black uniforms Elsewhere Aron and his friend Rachel tramp through the spindly birch trees She takes hold of his hand with her hand and places it on her right breast discretely covering his hand with a coat and holding his gaze Tentatively he raises his hand and touches her cheek with his fingers gently pulling at her bottom lip with his thumb This time she looks Zus straight in the eye His dark eyes hold her in his gaze and she nods faintly He looks then lowers his eyes She takes the flask and drinks from it She meets his playful expression with a shrug and then a smile Zus offers her a sip from his hip flask Her dark hair cut short and wearing a grey wool coat she sits down on the log and they exchange a brief smile Bella walks up to Zus who is sitting on a log"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He looks then lowers his eyes Tuvia and other men with guns scoot back down the hill to take up positions behind trees The two youngsters dive behind a rock She takes hold of his hand with her hand and places it on her right breast discretely covering his hand with a coat and holding his gaze Zus Tuvia and the others fire The policeman looks back at his half a dozen men Zus hits the milkman's arm She takes the flask and drinks from it The bearded milkman cowers behind a tree The policeman skulking behind a tree calls to his men to go many of the women with shawls on their heads tramp through the forest dwarfed by the tall thin bare trees He and the others stride forward in a line and Zus reloads Tuvia's cheeks tighten as he ponders his brother's words but he runs off after the others The displaced community of men women and children clutching their bundles of possessions some in hats and coats others in flat caps and jackets Elsewhere Aron and his friend Rachel tramp through the spindly birch trees In the distance they spot Kissely the milkman running ahead of a unit of armed men in black uniforms Carrying bags and baskets the people scramble up a slope Tuvia unleashes a salvo of bullets One of the Bielski group carries a goat across the stream Zus with Bella by his side lead the way out of the wood His dark eyes hold her in his gaze and she nods faintly Zus stops to reload Bella walks up to Zus who is sitting on a log Tuvia and Ben Zion behind them Zus and Tuvia their guns up and ready urge the men and women to flee Zus helps her up Zus offers her a sip from his hip flask They come out onto a meadow of tall grasses wafting in the breeze walking almost in single file like black shadows moving across the landscape Tuvia watches them retreating through the trees The Russian policemen and helmeted soldiers come into view below them She meets his playful expression with a shrug and then a smile One wounded soldier is helped away from the stream Tentatively he raises his hand and touches her cheek with his fingers gently pulling at her bottom lip with his thumb And Benzion in a fur hat leads them across a shallow stream Kissely and the policemen with guns arrive at the camp A woman stumbles and falls into the water Her dark hair cut short and wearing a grey wool coat she sits down on the log and they exchange a brief smile This time she looks Zus straight in the eye"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Carrying bags and baskets the people scramble up a slope Tuvia and other men with guns scoot back down the hill to take up positions behind trees The Russian policemen and helmeted soldiers come into view below them Zus Tuvia and the others fire One wounded soldier is helped away from the stream The bearded milkman cowers behind a tree Zus stops to reload The policeman looks back at his half a dozen men Zus hits the milkman's arm Tuvia unleashes a salvo of bullets The policeman skulking behind a tree calls to his men to go Tuvia watches them retreating through the trees He and the others stride forward in a line and Zus reloads Tuvia's cheeks tighten as he ponders his brother's words but he runs off after the others The displaced community of men women and children clutching their bundles of possessions some in hats and coats others in flat caps and jackets many of the women with shawls on their heads tramp through the forest dwarfed by the tall thin bare trees They come out onto a meadow of tall grasses wafting in the breeze walking almost in single file like black shadows moving across the landscape Tuvia and Ben Zion behind them Zus with Bella by his side lead the way out of the wood Bella walks up to Zus who is sitting on a log Her dark hair cut short and wearing a grey wool coat she sits down on the log and they exchange a brief smile Zus offers her a sip from his hip flask She meets his playful expression with a shrug and then a smile She takes the flask and drinks from it He looks then lowers his eyes His dark eyes hold her in his gaze and she nods faintly This time she looks Zus straight in the eye Tentatively he raises his hand and touches her cheek with his fingers gently pulling at her bottom lip with his thumb She takes hold of his hand with her hand and places it on her right breast discretely covering his hand with a coat and holding his gaze Elsewhere Aron and his friend Rachel tramp through the spindly birch trees In the distance they spot Kissely the milkman running ahead of a unit of armed men in black uniforms The two youngsters dive behind a rock Zus and Tuvia their guns up and ready urge the men and women to flee And Benzion in a fur hat leads them across a shallow stream Kissely and the policemen with guns arrive at the camp One of the Bielski group carries a goat across the stream A woman stumbles and falls into the water Zus helps her up"
        }
      ]
    }
  ]
}