{
  "ground_truth": "In Walt's house, Sue goes to the mesh door of the basement, and then he runs out of the back door, with Sue following him. It's night as Walt walks up outside Smokie's house and looks up at it, his face partly hidden in shadow. One of the gangsters looks out of the window and spots Walt. Smokie and Spider come out to confront him, more gangsters appear, and Spider pulls a gun. Neighbors watch. Walt points his index finger gun-like at the gangsters and mimes shooting them. He holds up a cigarette, puts it in his mouth, and slowly reaches inside his jacket, then whips his hand out again. The gangsters open fire, bullets riddle Walt's body, and he collapses backward onto the ground. His hand falls open, revealing his 1st Cavalry lighter, as blood trickles down his sleeve into his palm and some runs from his mouth. The cigarette lies unlit beside Walt's dead body, which lies in a cruciform. The lights of a police car flash in the darkness. Walt's Gran Torino pulls up outside Smokie's house, and Thao and Sue step out of it. They hurry over to a police officer as Sue, Thao, and Father Janovich watch a body bag being loaded into an ambulance. Father Janovich looks over to a patch of grass where the police have the handcuffed gangsters on their knees, and Thao bites his lip as a police captain looms over them. Sue and Thao watch bitterly as an officer leads Spider in handcuffs to a squad car, while another officer leads Smokie to a cruiser. Smokie's face is still bruised from where Walt whacked him, and he glares defiantly at Sue and Thao as the officer shoves him into the car. Thao breathes hard, with emotion welling up inside him, and Walt's Silver Star is still pinned to his T-shirt. Thao, Sue, and their mother leave their house, with Sue and Thao wearing traditional Hmong dress of lavishly embroidered clothing, and Sue also wearing a turban-like headdress, and get in a taxi. Grandma remains on the porch and watches as the taxi drives away, looking over at Daisy, who lies forlornly on the porch at the top of the steps. At the church, a large number of mourners have gathered for the funeral service. Wearing his new suit, Walt lies in an open casket in front of the altar as Mitch and Karen take a seat in the front pew aside Steve. Mitch looks across the aisle at Sue and Thao as Father Janovich steps forward. Mitch glares across the aisle at Thao. The family are gathered for the reading of the will, and Mitch and his brother Steve exchange a look as Ashley smiles in anticipation.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "In Walt's abode, Sue proceeds to the wire door of the cellar, and then he rushes out of the rear exit, with Sue trailing him. It's nighttime as Walt strides up outside Smokie's dwelling and gazes up at it, his visage partially concealed in shadow. One of the mobsters peers out of the casement and notices Walt. Smokie and Spider emerge to challenge him, more mobsters appear, and Spider brandishes a pistol. Residents observe. Walt gestures his forefinger gun-like at the mobsters and imitates shooting them. He holds up a cigarette, inserts it in his mouth, and gradually reaches inside his coat, then snaps his hand out again. The mobsters discharge shots, projectiles perforate Walt's form, and he topples backward onto the earth. His hand falls open, disclosing his 1st Cavalry lighter, as blood drips down his sleeve into his palm and some flows from his mouth. The cigarette rests unlit beside Walt's deceased form, which lies in a cruciform. The lights of a squad car flicker in the gloom. Walt's Gran Torino arrives outside Smokie's dwelling, and Thao and Sue disembark from it. They rush over to a constable as Sue, Thao, and Father Janovich observe a body bag being loaded into a medical vehicle. Father Janovich glances over to a patch of lawn where the constables have the shackled mobsters on their knees, and Thao bites his lip as a constable captain looms over them. Sue and Thao watch bitterly as an officer escorts Spider in shackles to a patrol car, while another officer escorts Smokie to a squad vehicle. Smokie's countenance is still bruised from where Walt struck him, and he glares defiantly at Sue and Thao as the officer forces him into the vehicle. Thao breathes hard, with sentiment welling up inside him, and Walt's Silver Star remains affixed to his T-shirt. Thao, Sue, and their mother exit their abode, with Sue and Thao wearing customary Hmong attire of lavishly embroidered garments, and Sue also wearing a turban-like headdress, and enter a taxi. Grandma stays on the veranda and observes as the taxi departs, looking over at Daisy, who lies despondently on the veranda at the top of the steps. At the church, a large number of mourners have assembled for the funeral service. Wearing his new attire, Walt lies in an open coffin in front of the altar as Mitch and Karen take a seat in the front pew beside Steve. Mitch looks across the aisle at Sue and Thao as Father Janovich steps forward. Mitch glowers across the aisle at Thao. The family are gathered for the reading of the will, and Mitch and his sibling Steve trade a look as Ashley beams in anticipation."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "In Walt's house, the mesh door of the basement is approached by Sue, and then the back door is run out of by him, with her following him. It's night as Smokie's house is walked up to by Walt, and it is looked up at by him, his face partly hidden in shadow. One of the gangsters looks out of the window and spots Walt. Smokie and Spider come out to confront him, more gangsters appear, and a gun is pulled by Spider. Neighbors watch. The gangsters are aimed at by Walt, who points his index finger gun-like at them and mimes shooting. A cigarette is held up by him, put in his mouth, and his jacket is slowly reached inside by him, then his hand is whipped out again. Fire is opened on Walt by the gangsters, bullets riddle his body, and the ground is collapsed onto backward by him. His 1st Cavalry lighter is revealed by his hand falling open, as blood trickles down his sleeve into his palm and some runs from his mouth. Beside Walt's dead body, the cigarette lies unlit, which is in a cruciform. In the darkness, the lights of a police car flash. Outside Smokie's house, Walt's Gran Torino pulls up, and Thao and Sue step out of it. A police officer is hurried over to by them as a body bag is watched being loaded into an ambulance by Sue, Thao, and Father Janovich. Father Janovich looks over to a patch of grass where the police have handcuffed the gangsters on their knees, and Thao bites his lip as a police captain looms over them. Sue and Thao watch bitterly as Spider is led in handcuffs to a squad car by an officer, while Smokie is led to a cruiser by another officer. From where he was whacked by Walt, Smokie's face is still bruised, and Sue and Thao are glared at defiantly by him as into the car he is shoved by the officer. Thao breathes hard, with emotion welling up inside him, and Walt's Silver Star remains pinned to his T-shirt. Their house is left by Thao, Sue, and their mother, with traditional Hmong dress of lavishly embroidered clothing worn by Sue and Thao, and Sue also wearing a turban-like headdress, and a taxi is gotten into by them. The porch is remained on by Grandma, and she watches as the taxi is driven away, looking over at Daisy, who lies forlornly on the porch at the top of the steps. At the church, a large number of mourners gather for the funeral service. Wearing his new suit, Walt lies in an open casket in front of the altar as a seat in the front pew is taken by Mitch and Karen alongside Steve. Mitch looks across the aisle at Sue and Thao as forward steps Father Janovich. Mitch glares across the aisle at Thao. The reading of the will is gathered for by the family, and Mitch and his brother Steve exchange a look as Ashley smiles in anticipation."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "In Walt's house, Sue goes to the basement mesh door, then he exits through the back door with Sue following. At night, Walt approaches Smokie's house, partly hidden in shadow. A gangster spots him, and Smokie and Spider confront him. More gangsters appear, and Spider draws a gun. Neighbors watch as Walt mimics shooting with his finger. He holds a cigarette, puts it in his mouth, and reaches inside his jacket, then quickly pulls his hand out. The gangsters fire, riddling Walt's body with bullets, and he collapses. His hand reveals a 1st Cavalry lighter as blood trickles down his sleeve and from his mouth. The unlit cigarette lies beside Walt's cruciform body. Police car lights flash. Walt's Gran Torino arrives, and Thao and Sue hurry to a police officer as they watch a body bag being loaded into an ambulance. Father Janovich observes the handcuffed gangsters on their knees, and Thao bites his lip as a police captain looms over them. Sue and Thao watch bitterly as officers lead Spider and Smokie, still bruised from Walt's hit, to squad cars. Thao breathes hard, emotion welling up, with Walt's Silver Star pinned to his T-shirt. Thao, Sue, and their mother leave their house in traditional Hmong dress and get in a taxi. Grandma watches from the porch as the taxi departs, glancing at Daisy, who lies forlornly on the steps. At the church, many mourners gather for the funeral. Walt lies in an open casket as Mitch and Karen sit in the front pew with Steve. Mitch glares at Thao across the aisle as Father Janovich steps forward. The family gathers for the will reading, and Mitch and Steve exchange a look as Ashley smiles in anticipation."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "In Walt's house, Sue goes to the basement door, then follows Walt out the back. At night, Walt approaches Smokie's house, partly in shadow. A gangster spots him, and Smokie and Spider confront him. More gangsters appear, and Spider draws a gun. Neighbors watch as Walt mimics shooting with his finger, then reaches inside his jacket. The gangsters fire, riddling Walt's body. He collapses, revealing his 1st Cavalry lighter as blood trickles down. The unlit cigarette lies beside his cruciform body. Police lights flash. Walt's Gran Torino arrives, and Thao and Sue approach a police officer. They watch a body bag loaded into an ambulance. Father Janovich observes handcuffed gangsters on their knees, and Thao bites his lip. Sue and Thao watch as officers lead Spider and Smokie, who glares defiantly, to squad cars. Thao breathes hard, wearing Walt's Silver Star. Thao, Sue, and their mother leave in traditional Hmong dress, taking a taxi as Grandma watches from the porch. At the church, mourners gather for Walt's funeral. In a new suit, Walt lies in an open casket. Mitch and Karen sit with Steve, glaring at Thao across the aisle as Father Janovich steps forward. The family gathers for the will reading, and Ashley smiles in anticipation."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In the dimly lit confines of Walt's house, Sue makes her way to the mesh door leading to the basement. Suddenly, Walt dashes out through the back door, with Sue quickly following in his footsteps. The scene shifts to the nighttime setting outside Smokie's house, where Walt approaches and gazes up at the structure, his face partially obscured by the shadows cast by the night. Inside, one of the gangsters peers out of the window and catches sight of Walt. Smokie and Spider emerge to confront him, and soon more gangsters appear, creating a tense standoff. Spider brandishes a gun, and the neighbors become silent witnesses to the unfolding drama. In a bold gesture, Walt points his index finger, mimicking a gun aimed at the gangsters, and pretends to shoot them. He then holds up a cigarette, places it in his mouth, and slowly reaches inside his jacket, only to swiftly whip his hand out again. In response, the gangsters unleash a barrage of gunfire, and bullets pierce Walt's body, causing him to collapse backward onto the ground. As his hand falls open, it reveals his 1st Cavalry lighter, while blood trickles down his sleeve into his palm and some drips from his mouth. The cigarette, now unlit, lies beside Walt's lifeless body, which is sprawled in a cruciform position. The flashing lights of a police car illuminate the darkness. Walt's Gran Torino arrives outside Smokie's house, and Thao and Sue step out of the vehicle. They rush over to a police officer as they, along with Father Janovich, watch solemnly as a body bag is loaded into an ambulance. Father Janovich glances over to a patch of grass where the police have the handcuffed gangsters kneeling, and Thao bites his lip as a police captain stands over them. Sue and Thao watch with bitterness as an officer leads Spider, now in handcuffs, to a squad car, while another officer escorts Smokie to a cruiser. Smokie's face, still bruised from where Walt struck him, glares defiantly at Sue and Thao as the officer forcefully shoves him into the car. Thao breathes heavily, emotions surging within him, and Walt's Silver Star remains pinned to his T-shirt. Thao, Sue, and their mother leave their house, with Sue and Thao adorned in traditional Hmong attire, featuring lavishly embroidered clothing, and Sue also wearing a turban-like headdress. They get into a taxi, while Grandma stays on the porch, watching as the taxi drives away. She glances over at Daisy, who lies forlornly on the porch at the top of the steps. At the church, a large gathering of mourners has assembled for the funeral service. Walt, dressed in his new suit, lies in an open casket positioned in front of the altar. Mitch and Karen take their seats in the front pew beside Steve. Mitch casts a glance across the aisle at Sue and Thao as Father Janovich steps forward to begin the service. Mitch glares across the aisle at Thao. The family gathers for the reading of the will, and Mitch and his brother Steve exchange a knowing look as Ashley smiles in eager anticipation."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Within the dimly lit, shadowy confines of Walt's modest house, Sue cautiously makes her way toward the mesh door that leads to the basement. Suddenly, without warning, Walt bursts out through the house's back door, prompting Sue to quickly follow in his hurried footsteps. The scene transitions to a nighttime setting outside Smokie's residence, where Walt approaches the house and gazes upward at the imposing structure, his face slightly obscured and hidden by the eerie shadows cast by the night. Meanwhile, inside, one of the gangsters peers out from the window, catching sight of Walt standing outside. Smokie and Spider emerge to confront him directly, and soon, more gangsters appear, creating a tense and precarious standoff. Spider menacingly brandishes a gun, and the neighbors become silent, anxious witnesses to the unfolding, dramatic scene. In a bold, unexpected gesture, Walt points his index finger, mimicking the action of a gun aimed at the gangsters, and theatrically pretends to shoot them. He then holds up a cigarette, places it firmly in his mouth, and slowly reaches inside his jacket, only to swiftly whip his hand out again. In response, the gangsters unleash a deafening barrage of gunfire, and bullets pierce Walt's body, causing him to collapse backward brutally onto the ground. As his hand falls open, it reveals a significant personal item—his 1st Cavalry lighter—while blood trickles steadily down his sleeve into his palm, accompanied by some dripping from his mouth. The cigarette, now unlit, lies beside Walt's lifeless body, which is sprawled on the ground in a cruciform position. The flashing lights of a police car intermittently illuminate the darkness around. Walt's Gran Torino arrives dramatically outside Smokie's house, and Thao and Sue step out of the vehicle with urgency. They rush purposefully over to a nearby police officer as they, along with Father Janovich, watch solemnly as a body bag is methodically loaded into an ambulance. Father Janovich steals a glance over to a patch of grass where the police have the handcuffed gangsters kneeling, and Thao bites his lip in restrained anger and frustration as a police captain watches over them. Sue and Thao look on with palpable bitterness as an officer leads Spider, now restrained in handcuffs, to a waiting squad car, while another officer similarly escorts Smokie to a cruiser. Smokie's face, still bruised from where Walt had previously struck him, glares defiantly at Sue and Thao as the officer forcefully shoves him into the car. Thao breathes heavily, a torrent of emotions surging within him, and Walt's Silver Star remains conspicuously pinned to his T-shirt. Thao, Sue, and their mother leave their house, with both Sue and Thao adorned in traditional, beautifully embroidered Hmong attire, with Sue also wearing a distinctive turban-like headdress. They get into a taxi as Grandma stays behind on the porch, watching intently as the taxi drives away. She glances over at Daisy, who lies forlornly and quietly on the porch at the top of the steps. At the church, a large gathering of mourners has assembled silently for the funeral service. Walt, dressed impeccably in his new suit, lies in an open casket positioned reverently in front of the altar. Mitch and Karen quietly take their seats in the front pew, beside Steve. Mitch casts a glance across the aisle at Sue and Thao as Father Janovich solemnly steps forward to begin the service. Mitch continues to glare across the aisle at Thao. Later, the family gathers for the reading of the will, and Mitch and his brother Steve exchange a knowing look as Ashley smiles in eager anticipation, waiting to hear its contents."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Inside Walt's house, Sue approaches the mesh door leading to the basement, her movements deliberate and cautious. Suddenly, Walt makes a swift decision to run, darting out of the back door with urgency, prompting Sue to quickly follow in his footsteps. The night envelops them as Walt strides purposefully up to Smokie's house, his face partially obscured by the shadows cast by the dim light. He pauses to gaze up at the house, his expression unreadable. Inside, one of the gangsters peers out of the window, his eyes scanning the darkness until they land on Walt. Recognizing the potential threat, Smokie and Spider emerge from the house to confront him, their presence soon bolstered by more gangsters who appear from the shadows. Tension escalates as Spider brandishes a gun, the metallic glint catching the light. Neighbors, drawn by the commotion, begin to watch the unfolding scene with a mix of curiosity and fear. In a bold and defiant gesture, Walt raises his hand, forming his index finger into a gun-like shape, and mimes shooting at the gangsters, a silent challenge. He then produces a cigarette, placing it between his lips with a calm demeanor, and slowly reaches inside his jacket, creating a moment of suspense. In a flash, he whips his hand out again, prompting the gangsters to react with a barrage of gunfire. The bullets pierce Walt's body, and he collapses backward, his form hitting the ground with a finality. As his hand falls open, it reveals his 1st Cavalry lighter, a symbol of his past, while blood trickles down his sleeve into his palm and some escapes from his mouth. The cigarette, now a poignant symbol of what could have been, lies unlit beside Walt's lifeless body, which rests in a cruciform position. The scene is punctuated by the flashing lights of a police car cutting through the darkness. Walt's Gran Torino arrives outside Smokie's house, and Thao and Sue step out, their faces etched with urgency and concern. They make their way quickly to a police officer, seeking answers and solace. Together with Father Janovich, they watch as a body bag is carefully loaded into an ambulance, the weight of the moment heavy on their hearts. Father Janovich's gaze shifts to a nearby patch of grass where the police have subdued the handcuffed gangsters, forcing them to their knees. Thao, overwhelmed by emotion, bites his lip as a police captain stands authoritatively over the subdued criminals. Sue and Thao's expressions harden with bitterness as they witness an officer leading Spider, now in handcuffs, to a squad car, while another officer escorts Smokie to a cruiser. Smokie's face, still marked by the bruises from his encounter with Walt, is a mask of defiance as he glares at Sue and Thao, even as the officer forcefully shoves him into the car. Thao's breath comes in heavy, emotional waves, his chest rising and falling as he struggles to contain his feelings, the Silver Star pinned to his T-shirt a silent testament to Walt's legacy. Later, Thao, Sue, and their mother leave their house, their attire a reflection of their heritage, with Sue and Thao adorned in traditional Hmong dress, the lavish embroidery a vibrant contrast to the somber occasion. Sue's turban-like headdress adds an air of dignity as they step into a waiting taxi. Grandma remains on the porch, her eyes following the taxi as it drives away, her gaze lingering on Daisy, who lies forlornly at the top of the steps, a silent witness to the family's departure. At the church, a large gathering of mourners fills the space for the funeral service, their presence a testament to the impact of Walt's life. Walt, dressed in a new suit, lies in an open casket positioned in front of the altar, his stillness a stark contrast to the life he once led. Mitch and Karen take their seats in the front pew, joining Steve in silent contemplation. Mitch's eyes drift across the aisle, landing on Sue and Thao as Father Janovich steps forward to lead the service. Mitch's gaze hardens into a glare directed at Thao, a silent communication of unresolved tension. The family later gathers for the reading of the will, the atmosphere charged with anticipation. Mitch and his brother Steve exchange a knowing look, their expressions a mix of expectation and uncertainty, while Ashley's face lights up with a smile, her anticipation palpable."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "In Walt's house, Sue follows him as he runs out the back door. At night, Walt approaches Smokie's house, partially hidden in shadow. A gangster spots him, prompting Smokie, Spider, and more gangsters to confront him. As neighbors watch, Walt mimics shooting them with his finger, then reaches inside his jacket, prompting the gangsters to open fire. Walt collapses, revealing his 1st Cavalry lighter as blood trickles down his sleeve and mouth, with an unlit cigarette beside his cruciform body. Police lights flash as Walt's Gran Torino arrives, and Thao and Sue rush to a police officer. They watch as a body bag is loaded into an ambulance, while Father Janovich observes the handcuffed gangsters on the grass. Thao bites his lip as a police captain oversees the scene. Sue and Thao watch bitterly as officers lead Spider and Smokie, still bruised from Walt's earlier attack, to squad cars. Thao, emotional and wearing Walt's Silver Star, leaves with Sue and their mother in traditional Hmong dress, taking a taxi as Grandma watches from the porch. At the church, mourners gather for Walt's funeral. In a new suit, Walt lies in an open casket as Mitch, Karen, and Steve sit in the front pew. Mitch glares at Thao across the aisle as Father Janovich steps forward. During the will reading, Mitch and Steve exchange a look while Ashley smiles in anticipation."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "In Walt's house, Sue goes to the mesh door of the basement, a common feature in Midwestern homes for ventilation, and then he runs out of the back door, with Sue following him. It's night as Walt walks up outside Smokie's house, situated in a neighborhood plagued by gang violence, and looks up at it, his face partly hidden in shadow. One of the gangsters looks out of the window and spots Walt. Smokie and Spider come out to confront him, and more gangsters appear, teenagers drawn into the gang life early due to socio-economic challenges, and Spider pulls a gun. Neighbors watch, their faces tense with the quiet desperation of those accustomed to such sights. Walt points his index finger, gun-like, at the gangsters and mimes shooting them. He holds up a cigarette, a small defiance in the face of danger, puts it in his mouth, and slowly reaches inside his jacket, then whips his hand out again. The gangsters open fire, bullets riddle Walt's body, a tragic echo of his military past, and he collapses backward onto the ground. His hand falls open, revealing his 1st Cavalry lighter, a memento from his service in Vietnam, as blood trickles down his sleeve into his palm and some runs from his mouth. The cigarette lies unlit beside Walt's dead body, which lies in a cruciform, symbolizing a sacrificial offering. The lights of a police car flash in the darkness, illuminating the chaos. Walt's Gran Torino, a classic car from the 1970s embodying American automotive muscle, pulls up outside Smokie's house, and Thao and Sue step out of it. They hurry over to a police officer as Sue, Thao, and Father Janovich, the local priest who had tried to guide Walt toward redemption, watch a body bag being loaded into an ambulance. Father Janovich looks over to a patch of grass where the police have the handcuffed gangsters on their knees, relics of a failed system, and Thao bites his lip as a police captain looms over them. Sue and Thao watch bitterly as an officer leads Spider in handcuffs to a squad car, while another officer leads Smokie to a cruiser. Smokie's face is still bruised from where Walt whacked him, a reminder of their violent confrontation, and he glares defiantly at Sue and Thao as the officer shoves him into the car. Thao breathes hard, with emotion welling up inside him, and Walt's Silver Star, awarded for gallantry in action as a soldier, is still pinned to his T-shirt. Thao, Sue, and their mother leave their house, with Sue and Thao wearing traditional Hmong dress of lavishly embroidered clothing, vibrant expressions of cultural identity and pride, and Sue also wearing a turban-like headdress, and get in a taxi. Grandma remains on the porch and watches as the taxi drives away, looking over at Daisy, Walt's loyal dog who lies forlornly on the porch at the top of the steps. At the church, a large number of mourners have gathered for the funeral service, their presence a testament to Walt's impact on the community. Wearing his new suit, Walt lies in an open casket in front of the altar as Mitch and Karen take a seat in the front pew aside Steve. Mitch looks across the aisle at Sue and Thao as Father Janovich steps forward, preparing to deliver a eulogy that underscores Walt's complex legacy. Mitch glares across the aisle at Thao, the tension between them reflecting unresolved grievances. The family are gathered for the reading of the will, a moment of revelation and finality, and Mitch and his brother Steve exchange a look as Ashley smiles in anticipation, hoping for unexpected windfalls."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "In Walt's house Sue goes to the mesh door of the basement and then he runs out of the back door with Sue following him. It is night as Walt walks up outside Smokie's house and looks up at it his face partly hidden in shadow. One of the gangsters looks out of the window and spots Walt. Smokie and Spider come out to confront him. more gangsters appear and Spider pulls a gun. Neighbors watch. Walt points his index finger gunlike at the gangsters and mimes shooting them. He holds up a cigarette puts it in his mouth and slowly reaches inside his jacket then whips his hand out again. The gangsters open fire bullets riddle Walt's body and he collapses backward onto the ground. His hand falls open revealing his 1st Cavalry lighter as blood trickles down his sleeve into his palm and some runs from his mouth. The cigarette lies unlit beside Walt's dead body which lies in a cruciform. The lights of a police car flash in the darkness. Walt's Gran Torino pulls up outside Smokie's house and Thao and Sue step out of it. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. They hurry over to a police officer as Sue Thao and Father Janovich watch a body bag being loaded into an ambulance. Father Janovich looks over to a patch of grass where the police have the handcuffed gangsters on their knees and Thao bites his lip as a police captain looms over them. Sue and Thao watch bitterly as an officer leads Spider in handcuffs to a squad car while another officer leads Smokie to a cruiser. Smokie's face is still bruised from where Walt whacked him and he glares defiantly at Sue and Thao as the officer shoves him into the car. Thao breathes hard with emotion welling up inside him and Walt's Silver Star is still pinned to his Tshirt. Thao Sue and their mother leave their house with Sue and Thao wearing traditional Hmong dress of lavishly embroidered clothing and Sue also wearing a turbanlike headdress and get in a taxi. Grandma remains on the porch and watches as the taxi drives away looking over at Daisy who lies forlornly on the porch at the top of the steps. At the church a large number of mourners have gathered for the funeral service. Wearing his new suit Walt lies in an open casket in front of the altar. as Mitch and Karen take a seat in the front pew aside. Steve. Mitch looks across the aisle at Sue and Thao as Father Janovich steps forward. Mitch glares across the aisle at Thao. The family are gathered for the reading of the will and Mitch and his brother Steve exchange a look as Ashley smiles in anticipation."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "In Walt's house Sue goes to the mesh door of the basement and then he runs out of the back door with Sue following him. It is night as Walt walks up outside Smokie's house and looks up at it his face partly hidden in shadow. One of the gangsters looks out of the window and spots Walt. Smokie and Spider come out to confront him. more gangsters appear and Spider pulls a gun. Neighbors watch. Walt points his index finger gunlike at the gangsters and mimes shooting them. He holds up a cigarette puts it in his mouth and slowly reaches inside his jacket then whips his hand out again. The gangsters open fire bullets riddle Walt's body and he collapses backward onto the ground. His hand falls open revealing his 1st Cavalry lighter as blood trickles down his sleeve into his palm and some runs from his mouth. The cigarette lies unlit beside Walt's dead body which lies in a cruciform. The lights of a police car flash in the darkness. Walt's Gran Torino pulls up outside Smokie's house and Thao and Sue step out of it. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. They hurry over to a police officer as Sue Thao and Father Janovich watch a body bag being loaded into an ambulance. Father Janovich looks over to a patch of grass where the police have the handcuffed gangsters on their knees and Thao bites his lip as a police captain looms over them. Sue and Thao watch bitterly as an officer leads Spider in handcuffs to a squad car while another officer leads Smokie to a cruiser. Smokie's face is still bruised from where Walt whacked him and he glares defiantly at Sue and Thao as the officer shoves him into the car. Thao breathes hard with emotion welling up inside him and Walt's Silver Star is still pinned to his Tshirt. Thao Sue and their mother leave their house with Sue and Thao wearing traditional Hmong dress of lavishly embroidered clothing and Sue also wearing a turbanlike headdress and get in a taxi. Grandma remains on the porch and watches as the taxi drives away looking over at Daisy who lies forlornly on the porch at the top of the steps. At the church a large number of mourners have gathered for the funeral service. Wearing his new suit Walt lies in an open casket in front of the altar. as Mitch and Karen take a seat in the front pew aside. Steve. Mitch looks across the aisle at Sue and Thao as Father Janovich steps forward. Mitch glares across the aisle at Thao. The family are gathered for the reading of the will and Mitch and his brother Steve exchange a look as Ashley smiles in anticipation."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "In Walt's house Sue goes to the mesh door of the basement and then he runs out of the back door with Sue following him. It is night as Walt walks up outside Smokie's house and looks up at it his face partly hidden in shadow. One of the gangsters looks out of the window and spots Walt. Smokie and Spider come out to confront him. more gangsters appear and Spider pulls a gun. Neighbors watch. Walt points his index finger gunlike at the gangsters and mimes shooting them. At the church a large number of mourners have gathered for the funeral service. Wearing his new suit Walt lies in an open casket in front of the altar. as Mitch and Karen take a seat in the front pew aside. Steve. Mitch looks across the aisle at Sue and Thao as Father Janovich steps forward. Mitch glares across the aisle at Thao. The family are gathered for the reading of the will and Mitch and his brother Steve exchange a look as Ashley smiles in anticipation."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "In Walt's house Sue goes to the mesh door of the basement and then he runs out of the back door with Sue following him. It is night as Walt walks up outside Smokie's house and looks up at it his face partly hidden in shadow. One of the gangsters looks out of the window and spots Walt. Mitch looks across the aisle at Sue and Thao as Father Janovich steps forward. Mitch glares across the aisle at Thao. The family are gathered for the reading of the will and Mitch and his brother Steve exchange a look as Ashley smiles in anticipation."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "In Gregor's barn, Lucy strolls to the glass gate of the attic, and then she dances out of the side entrance, with Lucy gliding behind her. It's dawn as Gregor skips up to Muffin's barn and stares up at it, his hat partly hidden in mist. One of the cowboys peeks out of the barn door and notices Gregor. Muffin and Cricket glide out to greet her, more cowboys pop out, and Cricket swings a broom. Cats cheer. Gregor gestures with his thumbs guitar-like at the cowboys and pretends strumming them. She lifts up a harmonica, places it on her lips, and gently reaches inside her vest, then whips her arm out once more. The cowboys unleash arrows, feathers pierce Gregor's suit, and she tumbles forward onto the lawn. Her fingers spill open, showing her Lucky Horseshoe coin, as juice drips down her sleeve onto her fingers and some spills from her nostrils. The harmonica rests unplayed beside Gregor's silent form, which lies in a star pattern. The headlights of an ice cream truck twinkle in the dawn. Gregor's Model T rolls up beside Muffin's barn, and Vinh and Lucy hop out of it. They rush over to an ice cream vendor as Lucy, Vinh, and Pastor Davidson observe a flower basket being carried into a cart. Pastor Davidson glances over to a patch of daisies where the vendors have the broom-wielding cowboys on pogo sticks, and Vinh pinches his arm as a parade marshal towers above them. Lucy and Vinh observe sourly as a vendor guides Cricket on pogo sticks to a scooter, while another vendor guides Muffin to a wagon. Muffin's cheek is still scratched from where Gregor poked her, and she stares boldly at Lucy and Vinh as the vendor nudges her into the wagon. Vinh inhales deeply, with excitement bubbling up within him, and Gregor's Bronze Badge is still fastened to his sweater. Vinh, Lucy, and their aunt exit their hut, with Lucy and Vinh donning classic Tibetan garments of richly patterned fabric, and Lucy also sporting a hat-like turban, and hop in a wagon. Grandpa stays on the stoop and observes as the wagon rolls away, gazing over at Oliver, who sprawls sadly on the stoop at the base of the railing. At the circus, a large assembly of jugglers have convened for the juggling contest. Donning her new gown, Gregor lies in an open suitcase at the edge of the ring as Maxine and Laura take a spot in the first row beside Andy. Maxine peers across the tent at Lucy and Vinh as Pastor Davidson steps forward. Maxine frowns across the tent at Vinh. The relatives are huddled for the recital of the ode, and Maxine and his cousin Andy exchange a glance as Jasmine grins in eagerness."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In Walt's house, Sue follows Walt out the back door. At night, Walt approaches Smokie's house, partly in shadow. A gangster spots him, leading Smokie and others to confront him. Walt mimics shooting them, then reaches inside his jacket, prompting the gangsters to open fire, mortally wounding him. Walt's lighter falls from his hand as he dies, his body in a cruciform. Police lights flash, and Walt's Gran Torino arrives with Thao and Sue. They speak to a police officer and witness a body bag being loaded into an ambulance. Father Janovich observes as the handcuffed gangsters kneel before a police captain, while Sue and Thao watch Spider and Smokie being led to squad cars. Thao, emotional, wears Walt's Silver Star. Sue, Thao, and their mother, in traditional Hmong attire, leave in a taxi, with Grandma watching from the porch. At the funeral, mourners gather around Walt's open casket. Mitch and Karen sit in the front pew, with Mitch glaring at Thao across the aisle. During the will reading, Mitch and Steve exchange glances as Ashley anticipates."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The family are gathered for the reading of the will and Mitch and his brother Steve exchange a look as Ashley smiles in anticipation Mitch glares across the aisle at Thao  Mitch looks across the aisle at Sue and Thao as Father Janovich steps forward  Steve  as Mitch and Karen take a seat in the front pew aside  Wearing his new suit Walt lies in an open casket in front of the altar  At the church a large number of mourners have gathered for the funeral service  Grandma remains on the porch and watches as the taxi drives away looking over at Daisy who lies forlornly on the porch at the top of the steps  Thao Sue and their mother leave their house with Sue and Thao wearing traditional Hmong dress of lavishly embroidered clothing and Sue also wearing a turbanlike headdress and get in a taxi  Thao breathes hard with emotion welling up inside him and Walt's Silver Star is still pinned to his Tshirt  Smokie's face is still bruised from where Walt whacked him and he glares defiantly at Sue and Thao as the officer shoves him into the car  Sue and Thao watch bitterly as an officer leads Spider in handcuffs to a squad car while another officer leads Smokie to a cruiser  Father Janovich looks over to a patch of grass where the police have the handcuffed gangsters on their knees and Thao bites his lip as a police captain looms over them  They hurry over to a police officer as Sue Thao and Father Janovich watch a body bag being loaded into an ambulance  Walt's Gran Torino pulls up outside Smokie's house and Thao and Sue step out of it  The lights of a police car flash in the darkness  The cigarette lies unlit beside Walt's dead body which lies in a cruciform  His hand falls open revealing his 1st Cavalry lighter as blood trickles down his sleeve into his palm and some runs from his mouth  The gangsters open fire bullets riddle Walt's body and he collapses backward onto the ground  He holds up a cigarette puts it in his mouth and slowly reaches inside his jacket then whips his hand out again  Walt points his index finger gunlike at the gangsters and mimes shooting them  Neighbors watch  more gangsters appear and Spider pulls a gun  Smokie and Spider come out to confront him  One of the gangsters looks out of the window and spots Walt  It's night as Walt walks up outside Smokie's house and looks up at it his face partly hidden in shadow  In Walt's house Sue goes to the mesh door of the basement and then he runs out of the back door with Sue following him "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "It is night as Walt walks up outside Smokie's house and looks up at it his face partly hidden in shadow In Walt's house Sue goes to the mesh door of the basement and then he runs out of the back door with Sue following him Smokie and Spider come out to confront him One of the gangsters looks out of the window and spots Walt Neighbors watch more gangsters appear and Spider pulls a gun He holds up a cigarette puts it in his mouth and slowly reaches inside his jacket then whips his hand out again Walt points his index finger gunlike at the gangsters and mimes shooting them His hand falls open revealing his 1st Cavalry lighter as blood trickles down his sleeve into his palm and some runs from his mouth The gangsters open fire bullets riddle Walt's body and he collapses backward onto the ground The lights of a police car flash in the darkness The cigarette lies unlit beside Walt's dead body which lies in a cruciform They hurry over to a police officer as Sue Thao and Father Janovich watch a body bag being loaded into an ambulance Walt's Gran Torino pulls up outside Smokie's house and Thao and Sue step out of it Sue and Thao watch bitterly as an officer leads Spider in handcuffs to a squad car while another officer leads Smokie to a cruiser Father Janovich looks over to a patch of grass where the police have the handcuffed gangsters on their knees and Thao bites his lip as a police captain looms over them Thao breathes hard with emotion welling up inside him and Walt's Silver Star is still pinned to his Tshirt Smokie's face is still bruised from where Walt whacked him and he glares defiantly at Sue and Thao as the officer shoves him into the car Grandma remains on the porch and watches as the taxi drives away looking over at Daisy who lies forlornly on the porch at the top of the steps Thao Sue and their mother leave their house with Sue and Thao wearing traditional Hmong dress of lavishly embroidered clothing and Sue also wearing a turbanlike headdress and get in a taxi Wearing his new suit Walt lies in an open casket in front of the altar At the church a large number of mourners have gathered for the funeral service Steve as Mitch and Karen take a seat in the front pew aside Mitch glares across the aisle at Thao Mitch looks across the aisle at Sue and Thao as Father Janovich steps forward The family are gathered for the reading of the will and Mitch and his brother Steve exchange a look as Ashley smiles in anticipation"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Father Janovich looks over to a patch of grass where the police have the handcuffed gangsters on their knees and Thao bites his lip as a police captain looms over them  Sue and Thao watch bitterly as an officer leads Spider in handcuffs to a squad car while another officer leads Smokie to a cruiser  Smokie's face is still bruised from where Walt whacked him and he glares defiantly at Sue and Thao as the officer shoves him into the car  Thao breathes hard with emotion welling up inside him and Walt's Silver Star is still pinned to his Tshirt  Thao Sue and their mother leave their house with Sue and Thao wearing traditional Hmong dress of lavishly embroidered clothing and Sue also wearing a turbanlike headdress and get in a taxi  Grandma remains on the porch and watches as the taxi drives away looking over at Daisy who lies forlornly on the porch at the top of the steps  At the church a large number of mourners have gathered for the funeral service  Wearing his new suit Walt lies in an open casket in front of the altar  as Mitch and Karen take a seat in the front pew aside  Steve  Mitch looks across the aisle at Sue and Thao as Father Janovich steps forward  Mitch glares across the aisle at Thao  The family are gathered for the reading of the will and Mitch and his brother Steve exchange a look as Ashley smiles in anticipation In Walt's house Sue goes to the mesh door of the basement and then he runs out of the back door with Sue following him  It's night as Walt walks up outside Smokie's house and looks up at it his face partly hidden in shadow  One of the gangsters looks out of the window and spots Walt  Smokie and Spider come out to confront him  more gangsters appear and Spider pulls a gun  Neighbors watch  Walt points his index finger gunlike at the gangsters and mimes shooting them  He holds up a cigarette puts it in his mouth and slowly reaches inside his jacket then whips his hand out again  The gangsters open fire bullets riddle Walt's body and he collapses backward onto the ground  His hand falls open revealing his 1st Cavalry lighter as blood trickles down his sleeve into his palm and some runs from his mouth  The cigarette lies unlit beside Walt's dead body which lies in a cruciform  The lights of a police car flash in the darkness  Walt's Gran Torino pulls up outside Smokie's house and Thao and Sue step out of it  They hurry over to a police officer as Sue Thao and Father Janovich watch a body bag being loaded into an ambulance "
        }
      ]
    }
  ]
}