{
  "ground_truth": "He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager, Thao. Walt slams the door and turns to the priest. Walt shoves past the fresh-faced priest, Father Janovich. Next door, a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs. Walt puts his jump leads on a garden table, and walks up onto the back porch. Looks across at his neighbor and their friends gathered in the garden. Walt snarls. An elder in ceremonial dress prepares to slaughter a chicken. Next door, a grandmother talks to a middle-aged man. The extended family gather before the elder, Kor Khue. He shakes a hoop with metal rings on it. Beside him is a young woman holding a baby, which is wrapped in a brightly embroidered papoose. He lays the hoop on the carpet and throws a horn split in two into it. Thao walks out of the back door. With cupped hands, Kor Khue gestures to the mother and child. Beside them, the father raises his hands. Next door, Walt sweeps his drive with a broom. His Labrador Daisy scampers down the front steps. Walt looks at next door's garden as Thao walks up his front steps. The grass is thin and parched. Grandma sits on the porch and watches Walt. Grandma mutters to herself. Glaring at her, Walt spits. Grandma spits copiously. Walt grimaces. Inside, he leans down to Daisy by the front door. Walt opens the door to Father Janovich. Walt shuts the door. Thao wanders along by a high chain link fence, browsing through a book. A large black sedan with side exhaust pipes rolls up. Two heavy-duty Latino guys lean out of the window. Thao keeps walking. Thao smiles. A white car with five South Asian guys in it stops up ahead. The driver, Spider, has long black hair and wears a bandanna. He sees Thao. Spider drives down the road and stops beside the black sedan. He and the guy he was talking to, Smokie, lean out of the window. A Latino guy has a revolver. Smokie wields a machine pistol. The Latino guys speed off. Spider reverses up beside Thao. Thao walks on, and Spider gets out. They drive off and Thao keeps walking. Later, Thao's gardening. His sister Sue is sitting on the front steps, reading.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He treads on the cigarette. Having just tugged the lid over the automobile, he gapes at Ashley incredulously, and strides over to the entrance. He spits and ambles out. Ashley rolls her eyes. Walt unlocks his front entrance to a youth, Thao. Walt bangs the entrance and pivots to the clergyman. Walt pushes past the fresh-faced clergyman, Father Janovich. Next door, a constant flow of Southeast Asian Hmong people march up to the front entrance. Most tote platters or dishes of cuisine. As mourners exit, Walt utilizes jumper cables to get a woman's automobile going. Mitch cruises up in a Toyota Land Cruiser. Walt straightens up and gazes at the silver four-by-four as it leaves. Walt places his jumper cables on a garden table, and strides up onto the back porch. Observes across at his neighbor and their companions assembled in the yard. Walt growls. An elder in ceremonial attire readies to butcher a chicken. Next door, a grandmother converses to a middle-aged male. The extended clan congregates before the elder, Kor Khue. He shakes a hoop with metal circles on it. Beside him is a young woman clutching a baby, which is wrapped in a brightly embroidered papoose. He places the hoop on the carpet and tosses a horn split in two into it. Thao strolls out of the back entrance. With cupped hands, Kor Khue signals to the mother and infant. Beside them, the father elevates his hands. Next door, Walt sweeps his drive with a broom. His Labrador Daisy frolics down the front steps. Walt glances at next door's yard as Thao strolls up his front steps. The grass is sparse and arid. Grandma perches on the porch and observes Walt. Grandma whispers to herself. Glowering at her, Walt spits. Grandma spits profusely. Walt grimaces. Inside, he bends down to Daisy by the front entrance. Walt unfastens the entrance to Father Janovich. Walt shuts the entrance. Thao roams along by a high chain-link fence, browsing through a tome. A large black sedan with side exhaust pipes glides up. Two robust Latino guys lean out of the window. Thao continues strolling. Thao grins. A white automobile with five South Asian guys in it halts up ahead. The driver, Spider, has long black hair and dons a bandanna. He notices Thao. Spider cruises down the road and halts beside the black sedan. He and the individual he was dialoguing with, Smokie, lean out of the window. A Latino guy possesses a revolver. Smokie brandishes a machine pistol. The Latino guys accelerate away. Spider reverses up beside Thao. Thao continues strolling, and Spider steps out. They drive away and Thao continues strolling. Later, Thao's gardening. His sister Sue is sitting on the front steps, reading."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The cigarette is stepped on by him. Having just pulled the cover over the car, Ashley is stared at incredulously by him, and the door is stepped over to by him. He spits and walks out. Her eyes are rolled by Ashley. A teenager, Thao, is opened the front door by Walt. The door is slammed by Walt, who turns to the priest. The fresh-faced priest, Father Janovich, is shoved past by Walt. Next door, the front door is walked up to by a steady stream of Southeast Asian Hmong people. Plates or bowls of food are carried by most. As mourners leave, jump leads are used by Walt to get a woman's car started. A Toyota Land Cruiser is driven up by Mitch. The silver four-by-four is stared at by Walt as it departs. The jump leads are put on a garden table by Walt, and the back porch is walked up onto by him. He looks across at his neighbor and their friends gathered in the garden. A snarl is given by Walt. A chicken is prepared for slaughter by an elder in ceremonial dress. Next door, a middle-aged man is talked to by a grandmother. The elder, Kor Khue, gathers the extended family before him. A hoop with metal rings on it is shaken by him. Beside him is a young woman holding a baby, which is wrapped in a brightly embroidered papoose. The hoop is laid on the carpet by him and a horn split in two is thrown into it. The back door is walked out of by Thao. With cupped hands, the mother and child are gestured to by Kor Khue. The father raises his hands beside them. Next door, the drive is swept with a broom by Walt. His Labrador Daisy scampers down the front steps. Next door's garden is looked at by Walt as his front steps are walked up by Thao. The grass is thin and parched. Walt is watched by Grandma as she sits on the porch. She mutters to herself. Walt glares at her and spits. Copious spitting is done by Grandma. His face grimaces by Walt. Inside, Daisy is leaned down to by him by the front door. Father Janovich is opened the door by Walt. The door is shut by Walt. Thao wanders along by a high chain link fence, browsing through a book. A large black sedan with side exhaust pipes rolls up. The window is leaned out of by two heavy-duty Latino guys. The walking is kept up by Thao. A smile is given by him. A white car with five South Asian guys in it stops up ahead. The driver, Spider, who has long black hair and wears a bandanna, sees Thao. Spider drives down the road and stops beside the black sedan. He and Smokie, the guy he was talking to, lean out of the window. A revolver is had by a Latino guy. A machine pistol is wielded by Smokie. The Latino guys speed off. Spider reverses up beside Thao. Thao keeps walking on, and Spider gets out. They drive off and walking is kept up by Thao. Later, gardening is done by Thao. The front steps are sat on by his sister Sue, who is reading."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He steps on the cigarette, having just covered the car, and stares at Ashley before walking to the door. He spits and exits. Ashley rolls her eyes. Walt opens the door to teenager Thao, slams it, then pushes past young priest Father Janovich. Next door, a stream of Southeast Asian Hmong mourners arrive, many with food. Walt jump-starts a woman’s car as Mitch arrives in a silver Toyota Land Cruiser. Walt watches it leave, puts the jump leads on a garden table, and heads to his back porch, looking at his neighbor’s gathering. Walt snarls. An elder in ceremonial dress prepares to slaughter a chicken. A grandmother chats with a middle-aged man. The extended family assembles before the elder, Kor Khue, who shakes a metal-ringed hoop. Beside him, a young woman holds a baby in a colorful papoose. Kor Khue sets the hoop down and tosses in a split horn. Thao exits the back door. Kor Khue gestures to the mother and child, the father raises his hands. Walt sweeps his driveway as his Labrador, Daisy, bounds down the steps. He eyes the dry grass next door as Thao approaches. Grandma watches Walt from her porch, muttering. Walt glares and spits. Grandma spits back. Walt grimaces, then leans near Daisy by the door. He opens the door to Father Janovich, then shuts it. Thao walks by a tall chain-link fence, reading a book. A black sedan with side exhausts pulls up—two tough Latino men lean out. Thao keeps walking, smiling. A white car with five South Asian men pulls up. Spider, the long-haired driver, sees Thao and drives beside the black sedan. Spider and Smokie lean out. One Latino has a revolver; Smokie shows a machine pistol. The Latinos speed off. Spider reverses to Thao, then drives off as Thao continues walking. Later, Thao gardens while his sister Sue reads on the steps."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He crushes the cigarette and, after covering the car, stares at Ashley, then heads to the door. He spits and exits. Ashley rolls her eyes. Walt opens his door to Thao, then slams it and brushes past Father Janovich. Next door, Hmong mourners arrive carrying food. Walt helps a woman start her car with jump leads. Mitch arrives in a Toyota Land Cruiser. Walt watches it leave, places the leads on a garden table, and walks to the back porch, eyeing his neighbor's gathering. Walt snarls. An elder in ceremonial wear readies to slaughter a chicken. A grandmother speaks with a man as family gathers before Kor Khue, who shakes a metal-ringed hoop. A woman holds a baby in embroidered cloth. Kor Khue lays the hoop down, tossing in a split horn. Thao exits. Kor Khue gestures to the mother and child; the father raises his hands. Walt sweeps his drive; Daisy scampers out. Walt eyes the neighbor's garden as Thao climbs his steps. The grass is sparse. Grandma watches Walt and mutters. He spits at her; she spits back. He grimaces, then kneels to Daisy. Walt opens and closes the door on Father Janovich. Thao walks by a chain-link fence, reading. A black sedan arrives. Two Latino men lean out. Thao keeps walking, smiling. A white car with five South Asian men appears. Spider, the driver, with long hair and a bandanna, sees Thao and pulls beside the sedan. Spider and Smokie lean out. One Latino holds a revolver, the other a machine pistol. The Latinos drive off. Spider reverses beside Thao, who keeps walking. Spider drives off. Later, Thao gardens while Sue reads on the steps."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He firmly presses his foot down on the cigarette, extinguishing it with a decisive motion. Having just finished the task of pulling the protective cover over the car, he stands still for a moment, staring at Ashley with an expression of disbelief and incredulity. He then strides over to the door, spits on the ground, and exits the scene. Ashley, in response, rolls her eyes in exasperation. Meanwhile, Walt opens his front door to find a teenager named Thao standing there. Without hesitation, Walt slams the door shut and turns his attention to the priest, Father Janovich, who is fresh-faced and eager. Walt brusquely shoves past the young priest. Next door, a continuous stream of Southeast Asian Hmong people make their way up to the front door, most of them carrying plates or bowls filled with food. As the mourners begin to leave, Walt helps a woman by using jump leads to get her car started. Mitch arrives in a Toyota Land Cruiser, and Walt straightens up, watching intently as the silver four-by-four vehicle departs. He places his jump leads on a garden table and walks up onto the back porch, casting a glance across at his neighbor and their friends gathered in the garden. Walt snarls in disapproval. An elder, dressed in ceremonial attire, is preparing to slaughter a chicken. Next door, a grandmother engages in conversation with a middle-aged man. The extended family gathers before the elder, Kor Khue, who shakes a hoop adorned with metal rings. Beside him stands a young woman holding a baby, wrapped snugly in a brightly embroidered papoose. Kor Khue lays the hoop on the carpet and throws a horn split in two into it. Thao emerges from the back door. With cupped hands, Kor Khue gestures towards the mother and child, while beside them, the father raises his hands in acknowledgment. Next door, Walt is busy sweeping his driveway with a broom. His Labrador, Daisy, scampers energetically down the front steps. Walt glances over at the garden next door as Thao ascends his front steps. The grass there is thin and parched, showing signs of neglect. Grandma sits on the porch, watching Walt intently. She mutters to herself, and Walt, glaring at her, spits in her direction. Grandma responds by spitting copiously. Walt grimaces in distaste. Inside, he leans down to Daisy by the front door. Walt opens the door to find Father Janovich standing there once again. He promptly shuts the door. Thao wanders along by a high chain-link fence, engrossed in a book. A large black sedan with side exhaust pipes rolls up, and two heavy-duty Latino guys lean out of the window. Thao continues walking, unfazed, and even smiles. A white car carrying five South Asian guys stops up ahead. The driver, Spider, with long black hair and a bandanna, spots Thao. Spider drives down the road and stops beside the black sedan. He and the guy he was conversing with, Smokie, lean out of the window. One of the Latino guys brandishes a revolver, while Smokie wields a machine pistol. The Latino guys speed off, and Spider reverses up beside Thao. Thao keeps walking, and Spider gets out. They drive off, and Thao continues on his way. Later, Thao is busy with gardening tasks, while his sister Sue sits on the front steps, absorbed in her reading."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He firmly presses his foot down onto the smoldering cigarette, extinguishing it with a decisive and deliberate motion. Having just completed the task of pulling the protective cover over the car, he stands still for a brief moment, staring at Ashley with an expression filled with disbelief and incredulity. With a resolute stride, he makes his way over to the door, spits on the ground as if to emphasize his disdain, and exits the scene, leaving Ashley behind. Ashley, in response to his departure, rolls her eyes in exasperation, clearly unimpressed. Meanwhile, Walt opens his front door and finds a teenager named Thao standing there expectantly. Without a moment's hesitation, Walt forcefully slams the door shut and turns his attention toward the priest, Father Janovich, who stands nearby looking fresh-faced and eager. Walt brusquely shoves past the young, well-meaning priest, clearly uninterested in engaging. Next door, a continuous stream of Southeast Asian Hmong people steadily make their way up to the front door, with most of them carrying plates or bowls filled with food. As the mourners begin to leave, Walt takes it upon himself to help a woman by using jump leads to get her car started. Soon after, Mitch arrives in a robust Toyota Land Cruiser, and Walt straightens up, watching intently as the silver four-by-four vehicle departs down the road. He places his jump leads on a nearby garden table and walks up onto the back porch, casting a glance across at his neighbor's house and their friends gathered in the garden. Walt snarls in disapproval, his features tightening. An elder, dressed in ceremonial attire, is preparing to slaughter a chicken as part of a ritual. Next door, a grandmother engages in a lively conversation with a middle-aged man. The extended family gathers closely before the elder, Kor Khue, who shakes a hoop adorned with intricate metal rings. Beside him stands a young woman gently holding a baby, wrapped snugly in a brightly embroidered papoose. Kor Khue carefully lays the hoop on the carpet and dramatically throws a horn, split into two, into it. Thao quietly emerges from the back door. With cupped hands raised, Kor Khue gestures toward the mother and child, while beside them, the father raises his hands in acknowledgment, showing respect. Next door, Walt is occupied with the mundane task of sweeping his driveway with a broom. His lively Labrador, Daisy, scampers down the front steps with boundless energy. Walt glances over at the garden next door as Thao ascends his front steps. The grass there is thin and parched, showing clear signs of neglect. Grandma sits on the porch, watching Walt intently. She mutters to herself, and Walt, glaring at her with obvious irritation, spits in her direction. Grandma responds in kind by spitting copiously. Walt grimaces, his face contorted in distaste. Inside, he leans down to Daisy, who is sitting by the front door. Walt opens the door to find Father Janovich standing there once again, persistent in his visit. He promptly shuts the door, uninterested in engaging. Meanwhile, Thao wanders along by a high chain-link fence, deeply engrossed in a book. A large black sedan with side exhaust pipes rolls up beside him, and two heavy-duty Latino guys lean out of the window, observing. Yet, Thao continues walking, unfazed, and even manages to smile. A white car carrying five South Asian guys stops up ahead. The driver, named Spider, with long black hair and a bandanna, spots Thao. Spider drives down the road and stops alongside the black sedan. He and the guy he was conversing with, Smokie, lean out of the window for a better view. One of the Latino guys brandishes a revolver, while Smokie wields a menacing machine pistol. The Latino guys speed off quickly, and Spider reverses up beside Thao. Thao simply keeps walking, undeterred, as Spider gets out. Eventually, they drive off, and Thao continues on his way with determination. Later that day, Thao is busy with gardening tasks, diligently attending to the plants, while his sister Sue sits comfortably on the front steps, absorbed in her reading."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He firmly presses his foot down on the cigarette, extinguishing it completely. Having just finished pulling the cover snugly over the car, he fixes his gaze on Ashley with an expression of disbelief, his eyes wide and brows raised, before decisively stepping over to the door. With a quick, dismissive motion, he spits and strides out, leaving Ashley behind to roll her eyes in exasperation. Walt then opens his front door to find a teenager, Thao, standing there, and without a word, he forcefully slams the door shut, turning his attention to the fresh-faced priest, Father Janovich, who stands nearby. Walt brusquely shoves past Father Janovich, ignoring any attempt at conversation. Meanwhile, next door, a continuous stream of Southeast Asian Hmong people make their way up to the front door, each carrying plates or bowls filled with food, contributing to the gathering. As the mourners begin to leave, Walt takes it upon himself to assist a woman by using jump leads to get her car started, connecting the cables with practiced efficiency. Just then, Mitch arrives, driving up in a Toyota Land Cruiser, prompting Walt to straighten up and fix his gaze on the departing silver four-by-four, watching it until it disappears from view. Walt then places his jump leads on a garden table and walks up onto the back porch, where he looks across at his neighbor's garden, observing the friends and family gathered there. With a disdainful expression, Walt snarls as he watches an elder in ceremonial dress preparing to slaughter a chicken. Next door, a grandmother engages in conversation with a middle-aged man, while the extended family gathers before the elder, Kor Khue, who shakes a hoop adorned with metal rings. Beside him stands a young woman holding a baby, wrapped in a brightly embroidered papoose. Kor Khue carefully lays the hoop on the carpet and throws a horn split in two into it, performing a ritual. Thao emerges from the back door, and with cupped hands, Kor Khue gestures to the mother and child, while the father beside them raises his hands in a gesture of participation. Meanwhile, next door, Walt is busy sweeping his drive with a broom, his Labrador Daisy playfully scampering down the front steps. Walt pauses to glance at the neighbor's garden as Thao walks up his front steps, noting the thin and parched grass. Grandma sits on the porch, her eyes fixed on Walt as she mutters to herself. Walt, catching her gaze, glares back and spits defiantly. In response, Grandma spits copiously, and Walt grimaces in distaste. Inside his house, he leans down to Daisy by the front door, offering a moment of affection before opening the door to Father Janovich once more. Without a word, Walt shuts the door again, leaving the priest outside. Meanwhile, Thao wanders along a high chain-link fence, his attention absorbed in a book he is browsing through. A large black sedan with side exhaust pipes rolls up beside him, and two heavy-duty Latino guys lean out of the window, eyeing Thao. Unfazed, Thao continues walking, a smile playing on his lips. Up ahead, a white car with five South Asian guys in it comes to a stop, the driver, Spider, sporting long black hair and a bandanna, notices Thao. Spider drives down the road and stops beside the black sedan, where he and the guy he was talking to, Smokie, lean out of the window, exchanging words. One of the Latino guys brandishes a revolver, while Smokie wields a machine pistol, creating a tense moment before the Latino guys speed off. Spider then reverses up beside Thao, who continues walking, unfazed by the encounter, and Spider eventually gets out. They drive off, leaving Thao to continue on his way. Later, Thao is seen tending to the garden, diligently working, while his sister Sue sits on the front steps, absorbed in her reading."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He extinguishes his cigarette and, after covering the car, incredulously stares at Ashley before exiting the room. Ashley rolls her eyes as Walt opens his front door to Thao, a teenager, and then slams it shut, brushing past Father Janovich, a fresh-faced priest. Next door, a steady stream of Southeast Asian Hmong mourners arrive, carrying food. As they leave, Walt helps a woman start her car with jump leads. Mitch arrives in a Toyota Land Cruiser, prompting Walt to watch the vehicle depart before placing the jump leads on a garden table and heading to the back porch. He observes his neighbor's gathering, where an elder, Kor Khue, prepares for a ceremony involving a chicken and a hoop with metal rings. Thao exits the house as Kor Khue gestures to a mother and child, while the father raises his hands. Meanwhile, Walt sweeps his drive, his Labrador Daisy scampering nearby. He notices the parched grass in the neighbor's garden as Thao approaches his front steps. Grandma watches Walt from her porch, muttering to herself, leading to a mutual exchange of glares and spitting. Inside, Walt tends to Daisy before opening and then shutting the door on Father Janovich. Thao walks along a chain-link fence, engrossed in a book, when a black sedan with Latino men approaches. Thao continues walking, smiling, as a white car with South Asian men, including Spider, stops ahead. Spider and Smokie, armed with weapons, converse before the Latino men speed off. Spider reverses beside Thao, who continues walking as they drive away. Later, Thao is gardening while his sister Sue reads on the front steps."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He steps on the cigarette, the ember hissing out beneath his shoe. Having just pulled the cover over the car, a classic 1972 Gran Torino, he stares at Ashley incredulously, and steps over to the door. He spits with the impatience of a man who’s grown weary of everyone, and walks out. Ashley rolls her eyes in a gesture of long-suffering exasperation. Walt opens his front door to a teenager, Thao, who lives next door with his large family. Walt slams the door and turns to the priest. Walt shoves past the fresh-faced priest, Father Janovich, a young man who has recently taken over the local parish. Next door, a steady stream of Southeast Asian Hmong people, who were resettled in the US after the Vietnam War due to their alliance with American forces, walk up to the front door. Most carry plates or bowls of food, traditional symbols of hospitality in their culture. As mourners leave, Walt uses jump leads to get a woman's car started, a neighborly act that contrasts with his gruff demeanor. Mitch drives up in a Toyota Land Cruiser, a reliable SUV that symbolizes durability and adventure. Walt straightens up and stares at the silver four-by-four as it departs, contemplating its imposing presence. Walt puts his jump leads on a garden table, a weathered piece of furniture that's seen countless seasons, and walks up onto the back porch. He looks across at his neighbor and their friends gathered in the garden, celebrating a cultural rite. Walt snarls, a habitual expression of his innate skepticism. An elder in ceremonial dress, likely a shaman based on his attire, prepares to slaughter a chicken, a ritual meant to honor ancestors. Next door, a grandmother talks to a middle-aged man, perhaps her son, discussing family matters. The extended family gathers before the elder, Kor Khue, a respected member within their community. He shakes a hoop with metal rings on it, used in a spiritual ritual to ward off evil spirits. Beside him is a young woman holding a baby, which is wrapped in a brightly embroidered papoose, a traditional Hmong baby carrier. He lays the hoop on the carpet and throws a horn split in two into it, a divination practice. Thao walks out of the back door, curiosity piquing at the elder's actions. With cupped hands, Kor Khue gestures to the mother and child, possibly invoking a blessing. Beside them, the father raises his hands in respect. Next door, Walt sweeps his drive with a broom, an old routine that brings him fleeting peace. His Labrador Daisy, loyal and ever-enthusiastic, scampers down the front steps. Walt looks at next door's garden as Thao walks up his front steps, noting its neglected state. The grass is thin and parched, a testament to the relentless summer heat. Grandma sits on the porch and watches Walt with a mixture of amusement and disdain. Grandma mutters to herself, perhaps commenting on Walt's peculiarities. Glaring at her, Walt spits again, a sign of his stubborn defiance. Grandma spits copiously, calling back to a custom of warding off evils. Walt grimaces, retreating into his solitary world. Inside, he leans down to Daisy by the front door, finding comfort in her unwavering presence. Walt opens the door to Father Janovich, who is persistent in his attempts to connect with him. Walt shuts the door, preferring his own company. Thao wanders along by a high chain link fence, browsing through a book on automotive mechanics loaned to him by a vocational teacher. A large black sedan with side exhaust pipes rolls up, a stark symbol of power and intimidation. Two heavy-duty Latino guys lean out of the window, part of a gang notorious in the area. Thao keeps walking, undeterred by their scrutiny. Thao smiles with the resilience taught by life's adversities. A white car with five South Asian guys in it stops up ahead, members of a nearby community who often feel the pressure of being outsiders. The driver, Spider, has long black hair and wears a bandanna, a look that resonates with rebellion. He sees Thao and their familiarity is evident. Spider drives down the road and stops beside the black sedan. He and the guy he was talking to, Smokie, known for his volatile temper, lean out of the window. A Latino guy has a revolver, an unmistakable threat. Smokie wields a machine pistol, the menace clear. The Latino guys speed off, the tension defused momentarily. Spider reverses up beside Thao, offering a chance to retreat. Thao walks on, choosing to avoid conflict. Spider gets out, a gesture of confrontation, but they drive off and Thao keeps walking, determination in his stride. Later, Thao's gardening, tending to the patch of earth that connects him to the rhythms of life. His sister Sue is sitting on the front steps, reading a novel about resilience and identity."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He steps on the cigarette. Having just pulled the cover over the car he stares at Ashley incredulously and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager Thao. Walt slams the door and turns to the priest. Walt shoves past the freshfaced priest Father Janovich. Next door a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver fourbyfour as it departs. Walt puts his jump leads on a garden table and walks up onto the back porch. Looks across at his neighbor and their friends gathered in the garden. Walt snarls. An elder in ceremonial dress prepares to slaughter a chicken. Next door a grandmother talks to a middleaged man. The extended family gather before the elder Kor Khue. He shakes a hoop with metal rings on it. Beside him is a young woman holding a baby which is wrapped in a brightly embroidered papoose. He lays the hoop on the carpet and throws a horn split in two into it. Thao walks out of the back door. With cupped hands Kor Khue gestures to the mother and child. Beside them the father raises his hands. Next door Walt sweeps his drive with a broom. His Labrador Daisy scampers down the front steps. Walt looks at next door's garden as Thao walks up his front steps. The grass is thin and parched. Grandma sits on the porch and watches Walt. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Grandma mutters to herself. Glaring at her. Walt spits. Grandma spits copiously. Walt grimaces. Inside. he leans down to Daisy by the front door. Walt opens the door to Father Janovich. Walt shuts the door. Thao wanders along by a high chain link fence browsing through a book. A large black sedan with side exhaust pipes rolls up. Two heavyduty Latino guys lean out of the window. Thao keeps walking. Thao smiles. A white car with five South Asian guys in it stops up ahead. The driver Spider has long black hair and wears a bandanna. He sees Thao. Spider drives down the road and stops beside the black sedan. He and the guy he was talking to. Smokie lean out of the window. A Latino guy has a revolver. Smokie wields a machine pistol. The Latino guys speed off. Spider reverses up beside Thao. Thao walks on and Spider gets out. They drive off and Thao keeps walking. Later. Thao's gardening. His sister Sue is sitting on the front steps reading."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He steps on the cigarette. Having just pulled the cover over the car he stares at Ashley incredulously and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager Thao. Walt slams the door and turns to the priest. Walt shoves past the freshfaced priest Father Janovich. Next door a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver fourbyfour as it departs. Walt puts his jump leads on a garden table and walks up onto the back porch. Looks across at his neighbor and their friends gathered in the garden. Walt snarls. An elder in ceremonial dress prepares to slaughter a chicken. Next door a grandmother talks to a middleaged man. The extended family gather before the elder Kor Khue. He shakes a hoop with metal rings on it. Beside him is a young woman holding a baby which is wrapped in a brightly embroidered papoose. He lays the hoop on the carpet and throws a horn split in two into it. Thao walks out of the back door. With cupped hands Kor Khue gestures to the mother and child. Beside them the father raises his hands. Next door Walt sweeps his drive with a broom. His Labrador Daisy scampers down the front steps. Walt looks at next door's garden as Thao walks up his front steps. The grass is thin and parched. Grandma sits on the porch and watches Walt. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. Grandma mutters to herself. Glaring at her. Walt spits. Grandma spits copiously. Walt grimaces. Inside. he leans down to Daisy by the front door. Walt opens the door to Father Janovich. Walt shuts the door. Thao wanders along by a high chain link fence browsing through a book. A large black sedan with side exhaust pipes rolls up. Two heavyduty Latino guys lean out of the window. Thao keeps walking. Thao smiles. A white car with five South Asian guys in it stops up ahead. The driver Spider has long black hair and wears a bandanna. He sees Thao. Spider drives down the road and stops beside the black sedan. He and the guy he was talking to. Smokie lean out of the window. A Latino guy has a revolver. Smokie wields a machine pistol. The Latino guys speed off. Spider reverses up beside Thao. Thao walks on and Spider gets out. They drive off and Thao keeps walking. Later. Thao's gardening. His sister Sue is sitting on the front steps reading."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He steps on the cigarette. Having just pulled the cover over the car he stares at Ashley incredulously and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager Thao. Walt slams the door and turns to the priest. Walt shoves past the freshfaced priest Father Janovich. Next door a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver fourbyfour as it departs. Walt puts his jump leads on a garden table and walks up onto the back porch. Looks across at his neighbor and their friends gathered in the garden. Walt snarls. The driver Spider has long black hair and wears a bandanna. He sees Thao. Spider drives down the road and stops beside the black sedan. He and the guy he was talking to. Smokie lean out of the window. A Latino guy has a revolver. Smokie wields a machine pistol. The Latino guys speed off. Spider reverses up beside Thao. Thao walks on and Spider gets out. They drive off and Thao keeps walking. Later. Thao's gardening. His sister Sue is sitting on the front steps reading."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He steps on the cigarette. Having just pulled the cover over the car he stares at Ashley incredulously and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager Thao. Walt slams the door and turns to the priest. Spider reverses up beside Thao. Thao walks on and Spider gets out. They drive off and Thao keeps walking. Later. Thao's gardening. His sister Sue is sitting on the front steps reading."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "He bounces on the trampoline. Having just tossed the blanket over the bicycle, he glances at Jessica confusingly, and waltzes over to the window. He sneezes and leaps through. Jessica pouts her lips. Bob flings open his cellar hatch to a penguin, Zoe. Bob shuts the hatch and struts toward the astronaut. Bob dances past the bewildered astronaut, Commander Lewis. Nearby, a constant trickle of Eastern European Russian dolls skip up to the back gate. Most hold guitars or violins. As jugglers vanish, Bob uses fishing nets to get a boy’s drone launched. Kevin drifts over in a Toyota Prius. Bob springs up and gawks at the golden skateboard as it zooms away. Bob drops his fishing nets on a stone bench and skips up onto the treehouse roof. Glances across at his acquaintance and their cats assembled in the meadow. Bob hisses. A wizard in magical robes prepares to bake a cake. Next door, an aunt converses with a young boy. The sprawling community clumps before the wizard, Merwin. He jiggles a maraca with feathers on it. Beside him is a young lass holding a kitten, which is wrapped in a vividly patterned scarf. He stretches the maraca on the ladder and tosses a stone cut in two into it. Zoe saunters out of the attic window. With cupped hands, Merwin signals to the owner and kitten. Beside them, the uncle lifts his elbows. Nearby, Bob rakes his roof with a toothbrush. His Beagle Rufus prances up the back steps. Bob peers at the neighboring yard as Zoe hops up his back steps. The soil is shiny and damp. Auntie lounges on the balcony and observes Bob. Auntie hums to herself. Squinting at her, Bob sneezes. Auntie sneezes flamboyantly. Bob winces. Outside, he stands up to Rufus by the back door. Bob flings the door to Commander Lewis. Bob latches the door. Zoe wanders along by a towering hedge, browsing through a magazine. A large orange hot rod with tail fins zooms up. Two lightweight French chefs lean out of the porthole. Zoe keeps dancing. Zoe frowns. A green motorcycle with three Australian surfers on it halts up ahead. The captain, Lizard, has short blue hair and wears a helmet. He spots Zoe. Lizard zips across the yard and halts beside the orange hot rod. He and the teammate he was chatting with, Smokie, lean out of the porthole. A chef has a megaphone. Smokie waves a garden shear. The French chefs cruise away. Lizard reverses up beside Zoe. Zoe continues skipping, and Lizard dismounts. They drive away and Zoe keeps dancing. Later, Zoe's knitting. Her cousin Lily is perched on the back steps, sketching."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Walt steps on his cigarette, covers his car, and incredulously stares at Ashley before walking out. Ashley rolls her eyes. Walt opens his door to a teenager, Thao, then slams it shut to face Father Janovich, whom he pushes past. Next door, a stream of Hmong people, carrying food, gather for a ceremony led by elder Kor Khue. Walt, after jump-starting a woman's car, observes the ceremony next door. He snarls as Kor Khue prepares to slaughter a chicken. Thao walks out, and the family continues their ritual. Walt sweeps his driveway, eyeing the thin grass. Grandma watches and mutters, leading to mutual spitting with Walt. Walt grimaces, interacts with his dog Daisy, and shuts the door on Father Janovich. Thao, wandering by a fence with a book, encounters a black sedan with Latino guys inside. He keeps walking when a white car with South Asian guys, led by Spider, stops. Spider and Smokie interact with the Latino guys, both brandishing weapons. The Latino car speeds off, and Thao walks on as Spider drives away. Later, Thao gardens while his sister Sue reads on the steps."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "His sister Sue is sitting on the front steps reading Thao's gardening  Later  They drive off and Thao keeps walking  Thao walks on and Spider gets out  Spider reverses up beside Thao  The Latino guys speed off  Smokie wields a machine pistol  A Latino guy has a revolver  Smokie lean out of the window  He and the guy he was talking to  Spider drives down the road and stops beside the black sedan  He sees Thao  The driver Spider has long black hair and wears a bandanna  A white car with five South Asian guys in it stops up ahead  Thao smiles  Thao keeps walking  Two heavyduty Latino guys lean out of the window  A large black sedan with side exhaust pipes rolls up  Thao wanders along by a high chain link fence browsing through a book  Walt shuts the door  Walt opens the door to Father Janovich  he leans down to Daisy by the front door  Inside  Walt grimaces  Grandma spits copiously  Walt spits  Glaring at her  Grandma mutters to herself  Grandma sits on the porch and watches Walt  The grass is thin and parched  Walt looks at next door's garden as Thao walks up his front steps  His Labrador Daisy scampers down the front steps  Next door Walt sweeps his drive with a broom  Beside them the father raises his hands  With cupped hands Kor Khue gestures to the mother and child  Thao walks out of the back door  He lays the hoop on the carpet and throws a horn split in two into it  Beside him is a young woman holding a baby which is wrapped in a brightly embroidered papoose  He shakes a hoop with metal rings on it  The extended family gather before the elder Kor Khue  Next door a grandmother talks to a middleaged man  An elder in ceremonial dress prepares to slaughter a chicken  Walt snarls  Looks across at his neighbor and their friends gathered in the garden  Walt puts his jump leads on a garden table and walks up onto the back porch  Walt straightens up and stares at the silver fourbyfour as it departs  Mitch drives up in a Toyota Land Cruiser  As mourners leave Walt uses jump leads to get a woman's car started  Most carry plates or bowls of food  Next door a steady stream of Southeast Asian Hmong people walk up to the front door  Walt shoves past the freshfaced priest Father Janovich  Walt slams the door and turns to the priest  Walt opens his front door to a teenager Thao  Ashley rolls her eyes  He spits and walks out  Having just pulled the cover over the car he stares at Ashley incredulously and steps over to the door  He steps on the cigarette "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Having just pulled the cover over the car he stares at Ashley incredulously and steps over to the door He steps on the cigarette Ashley rolls her eyes He spits and walks out Walt slams the door and turns to the priest Walt opens his front door to a teenager Thao Next door a steady stream of Southeast Asian Hmong people walk up to the front door Walt shoves past the freshfaced priest Father Janovich As mourners leave Walt uses jump leads to get a woman's car started Most carry plates or bowls of food Walt straightens up and stares at the silver fourbyfour as it departs Mitch drives up in a Toyota Land Cruiser Looks across at his neighbor and their friends gathered in the garden Walt puts his jump leads on a garden table and walks up onto the back porch An elder in ceremonial dress prepares to slaughter a chicken Walt snarls The extended family gather before the elder Kor Khue Next door a grandmother talks to a middleaged man Beside him is a young woman holding a baby which is wrapped in a brightly embroidered papoose He shakes a hoop with metal rings on it Thao walks out of the back door He lays the hoop on the carpet and throws a horn split in two into it Beside them the father raises his hands With cupped hands Kor Khue gestures to the mother and child His Labrador Daisy scampers down the front steps Next door Walt sweeps his drive with a broom The grass is thin and parched Walt looks at next door's garden as Thao walks up his front steps Grandma mutters to herself Grandma sits on the porch and watches Walt Walt spits Glaring at her Walt grimaces Grandma spits copiously he leans down to Daisy by the front door Inside Walt shuts the door Walt opens the door to Father Janovich A large black sedan with side exhaust pipes rolls up Thao wanders along by a high chain link fence browsing through a book Thao keeps walking Two heavyduty Latino guys lean out of the window A white car with five South Asian guys in it stops up ahead Thao smiles He sees Thao The driver Spider has long black hair and wears a bandanna He and the guy he was talking to Spider drives down the road and stops beside the black sedan A Latino guy has a revolver Smokie lean out of the window The Latino guys speed off Smokie wields a machine pistol Thao walks on and Spider gets out Spider reverses up beside Thao Later They drive off and Thao keeps walking His sister Sue is sitting on the front steps reading Thao's gardening"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Grandma mutters to herself  Glaring at her  Walt spits  Grandma spits copiously  Walt grimaces  Inside  he leans down to Daisy by the front door  Walt opens the door to Father Janovich  Walt shuts the door  Thao wanders along by a high chain link fence browsing through a book  A large black sedan with side exhaust pipes rolls up  Two heavyduty Latino guys lean out of the window  Thao keeps walking  Thao smiles  A white car with five South Asian guys in it stops up ahead  The driver Spider has long black hair and wears a bandanna  He sees Thao  Spider drives down the road and stops beside the black sedan  He and the guy he was talking to  Smokie lean out of the window  A Latino guy has a revolver  Smokie wields a machine pistol  The Latino guys speed off  Spider reverses up beside Thao  Thao walks on and Spider gets out  They drive off and Thao keeps walking  Later  Thao's gardening  His sister Sue is sitting on the front steps reading He steps on the cigarette  Having just pulled the cover over the car he stares at Ashley incredulously and steps over to the door  He spits and walks out  Ashley rolls her eyes  Walt opens his front door to a teenager Thao  Walt slams the door and turns to the priest  Walt shoves past the freshfaced priest Father Janovich  Next door a steady stream of Southeast Asian Hmong people walk up to the front door  Most carry plates or bowls of food  As mourners leave Walt uses jump leads to get a woman's car started  Mitch drives up in a Toyota Land Cruiser  Walt straightens up and stares at the silver fourbyfour as it departs  Walt puts his jump leads on a garden table and walks up onto the back porch  Looks across at his neighbor and their friends gathered in the garden  Walt snarls  An elder in ceremonial dress prepares to slaughter a chicken  Next door a grandmother talks to a middleaged man  The extended family gather before the elder Kor Khue  He shakes a hoop with metal rings on it  Beside him is a young woman holding a baby which is wrapped in a brightly embroidered papoose  He lays the hoop on the carpet and throws a horn split in two into it  Thao walks out of the back door  With cupped hands Kor Khue gestures to the mother and child  Beside them the father raises his hands  Next door Walt sweeps his drive with a broom  His Labrador Daisy scampers down the front steps  Walt looks at next door's garden as Thao walks up his front steps  The grass is thin and parched  Grandma sits on the porch and watches Walt "
        }
      ]
    }
  ]
}