{
  "ground_truth": "She stares at her reflection critically and says this as if it were a threat, then notices a smudge on the mirror and wipes it off. The front door opens to reveal Carolyn, greeting us with the smile she thinks could sell ice to an Eskimo. Smiling, Carolyn leads a man and woman into the living room. They're thirtyish, and they've seen a lot of houses today. The man and woman glance around the dark room, unimpressed, and the woman wrinkles her face, skeptical. Carolyn enters, followed by a different couple in their fifties, and stands with another couple: African American, late twenties. The woman is pregnant. Carolyn stands by the pool next to two fortyish women. She locks the sliding glass door and starts to pull the vertical blinds shut, then stops. Standing very still, with the blinds casting shadows across her face, she starts to cry: brief, staccato sobs that seemingly escape against her will. Suddenly she slaps herself, hard, but the tears continue. She slaps herself again and repeatedly until she stops crying. She stands there, taking deep breaths until she has everything under control, then pulls the blinds shut, once again all business. She walks out calmly, leaving us alone in the dark, empty room. We're at a high-school basketball game where teenage boys play a fast and furious game. One team wearing pale blue and white uniforms scores a basket. Perky cheerleaders jump up and down as the crowd goes wild. Seated in the bleachers, next to the high school band, is a group of about twenty teenage girls, dressed in pale blue and white uniforms. Among them, Jane sits next to Angela Hayes. At sixteen, Angela is strikingly beautiful, with perfect even features, blonde hair, and a nubile young body; she's the archetypal American dream girl. Carolyn drives with Lester slumped in the passenger seat, and Carolyn stares at him, unsure of how to respond. The uniformed girls now stand in formation on the gym floor, and in the crowded stands, Lester and Carolyn find seats. They're well-rehearsed, but too young to carry off the ambitious Vegas routine they're attempting. Lester, watching from the stands, picks out his daughter. Jane performs well, concentrating, while dancing awkwardly next to her is Angela. Suddenly Angela looks right at us and smiles, a lazy, insolent smile. We're focused on Angela now, and everything starts to shift as the music acquires an eerie echo. We zoom slowly toward Lester as he watches, transfixed. The light on Angela grows stronger, and the other girls disappear entirely. Lester is suddenly alone in the stands, spellbound, as Angela looks directly at us now, dancing only for Lester. Her movements take on a blatantly erotic edge as she starts to unzip her uniform, teasing us with an expression that's both innocent and knowing, then.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She gazes at her likeness critically and utters this as if it were a menace, then notices a smudge on the mirror and wipes it off. The front door opens to disclose Carolyn, greeting us with the grin she thinks could vend ice to an Inuit. Smiling, Carolyn guides a gentleman and lady into the living room. They're thirtyish, and they've seen a multitude of homes today. The gentleman and lady glance around the dim room, unimpressed, and the lady wrinkles her visage, skeptical. Carolyn enters, followed by a different duo in their fifties, and stands with another pair: African American, late twenties. The woman is expecting. Carolyn stands by the pool next to two fortyish women. She locks the sliding glass door and starts to pull the vertical blinds shut, then halts. Standing very still, with the blinds casting shadows across her visage, she begins to weep: brief, staccato sobs that seemingly escape against her will. Suddenly she strikes herself, hard, but the tears persist. She strikes herself again and repeatedly until she ceases crying. She stands there, taking deep breaths until she has everything under control, then pulls the blinds shut, once again all business. She walks out serenely, leaving us alone in the dark, vacant room. We're at a high-school basketball game where adolescent boys play a fast and furious game. One squad wearing pale blue and white uniforms scores a basket. Perky cheerleaders leap up and down as the throng goes wild. Seated in the bleachers, next to the high school band, is a cluster of about twenty teenage girls, clad in pale blue and white uniforms. Among them, Jane sits next to Angela Hayes. At sixteen, Angela is strikingly gorgeous, with perfect even traits, blonde locks, and a nubile young body; she's the archetypal American dream girl. Carolyn drives with Lester slumped in the passenger seat, and Carolyn gazes at him, unsure of how to react. The uniformed girls now stand in formation on the gym floor, and in the crowded stands, Lester and Carolyn find seats. They're well-rehearsed, but too young to carry off the ambitious Vegas act they're attempting. Lester, watching from the stands, identifies his daughter. Jane performs well, concentrating, while dancing awkwardly next to her is Angela. Suddenly Angela gazes directly at us and grins, a lazy, insolent grin. We're focused on Angela now, and everything starts to shift as the music gains an eerie echo. We zoom slowly toward Lester as he watches, mesmerized. The light on Angela grows stronger, and the other girls vanish entirely. Lester is suddenly alone in the stands, spellbound, as Angela gazes directly at us now, dancing solely for Lester. Her movements take on a blatantly erotic edge as she starts to unzip her uniform, teasing us with an expression that's both innocent and knowing, then."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The reflection is stared at critically by her, and this is said by her as if it were a threat. Then she notices a smudge on the mirror and wipes it off. The front door is opened by Carolyn, revealing her greeting, which she believes could sell ice to an Eskimo, to us with a smile. A man and woman are led into the living room by smiling Carolyn. They look around the dark room, unimpressed, with faces wrinkled skeptically, as they have seen a lot of houses today. A different couple in their fifties enters, followed by Carolyn, who stands with another couple: African American, late twenties. The woman is pregnant, standing with Carolyn by the pool next to two fortyish women. The sliding glass door is locked by her and the vertical blinds are started to be pulled shut, but she's stopped. She stands very still, with shadows cast by the blinds across her face, and begins to cry: brief, staccato sobs that seemingly escape against her will. Suddenly, herself is slapped, hard, but the tears continue. Herself is slapped again and repeatedly until her crying is stopped. She stands there, taking deep breaths until everything is under control by her, then the blinds are pulled shut, once again all business. Calmly, we are left alone in the dark, empty room as she walks out. A high-school basketball game is being attended by us where a fast and furious game is played by teenage boys. A basket is scored by one team wearing pale blue and white uniforms. The crowd goes wild while perky cheerleaders jump up and down. About twenty teenage girls in pale blue and white uniforms are seated in the bleachers next to the high school band. Among them, Angela Hayes sits next to Jane. At sixteen, Angela is strikingly beautiful with perfect even features, blonde hair, and a nubile young body; she's the archetypal American dream girl. Lester slumps in the passenger seat as Carolyn drives, and he is stared at by Carolyn, who is unsure of how to respond. The gym floor is stood on by the uniformed girls, now in formation, and Lester and Carolyn find seats in the crowded stands. They're well-rehearsed, but the ambitious Vegas routine they're attempting is too much for their youth. From the stands, Lester picks out his daughter while watching. Jane concentrates and performs well, while Angela awkwardly dances next to her. Suddenly, Angela looks directly at us and smiles, a lazy, insolent smile. Angela is focused on by us now, and everything starts to shift as the music acquires an eerie echo. We slowly zoom toward Lester as he watches, transfixed. The light on Angela grows stronger, and the other girls disappear entirely. Alone in the stands, Lester is spellbound as Angela looks directly at us now, dancing only for him. Her movements take on a blatantly erotic edge as her uniform is started to be unzipped by her, teasing us with an expression that's both innocent and knowing, then."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She critically examines her reflection, notices a smudge, and wipes it off. The front door opens, revealing Carolyn, who greets us with a confident smile. Carolyn leads a man and woman into the living room; they're in their thirties and have seen many houses today. They glance around the dim room, unimpressed, and the woman looks skeptical. Carolyn enters with a different couple in their fifties and stands with another couple: African American, late twenties, with the woman pregnant. By the pool, Carolyn stands next to two women in their forties. She locks the sliding door, starts to close the blinds, then stops. Standing still, shadows across her face, she cries briefly, then slaps herself until she stops. Regaining control, she closes the blinds and exits calmly, leaving us in the dark room. At a high-school basketball game, teenage boys play intensely. One team in pale blue and white scores, and cheerleaders jump as the crowd cheers. In the bleachers, near the band, about twenty girls in uniforms sit, including Jane and Angela Hayes. At sixteen, Angela is strikingly beautiful, the archetypal American dream girl. Carolyn drives with Lester, who slumps in the passenger seat. The uniformed girls perform on the gym floor, and Lester and Carolyn find seats. They're well-rehearsed but too young for the ambitious Vegas routine. Lester watches, spotting his daughter Jane, who performs well. Angela dances awkwardly beside her, then looks at us and smiles lazily. Focus shifts to Angela as the music echoes eerily. We zoom toward Lester, transfixed. Angela's light intensifies, and the other girls vanish. Alone in the stands, Lester watches Angela, who dances only for him, her movements becoming blatantly erotic as she teasingly unzips her uniform."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "She critically examines her reflection, wipes a smudge off the mirror, and hears the front door open. Carolyn enters, smiling confidently, leading a thirtyish couple into the living room. They seem unimpressed. Carolyn then brings in a different couple in their fifties and stands with an African American couple in their late twenties, the woman pregnant. By the pool, Carolyn stands with two fortyish women, locks the sliding door, and starts to close the blinds. She suddenly cries, slaps herself until she stops, regains composure, and leaves the dark room. At a high-school basketball game, a team in pale blue and white scores, and cheerleaders excite the crowd. In the bleachers, Jane sits with Angela Hayes, a striking sixteen-year-old. Carolyn drives with Lester, unsure how to react to him. The uniformed girls perform on the gym floor, but their routine is too ambitious. Lester watches, spotting Jane, who dances next to Angela. Angela smiles at us, and the focus shifts to her as the music echoes. Lester is transfixed, the light on Angela intensifies, and the other girls vanish. Alone in the stands, Lester watches Angela dance erotically, teasingly unzipping her uniform."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "She gazes intently at her own reflection, scrutinizing it with a critical eye, and utters a statement as if it were a dire warning. Her attention is then drawn to a smudge marring the mirror's surface, which she promptly wipes away. The front door swings open, revealing Carolyn, who greets us with a smile so confident and persuasive that it seems capable of selling ice to an Eskimo. With a welcoming demeanor, Carolyn escorts a man and a woman into the living room. This couple, appearing to be in their thirties, has already toured numerous houses today. As they cast their eyes around the dimly lit room, their expressions reveal a lack of enthusiasm, and the woman, in particular, wrinkles her face in skepticism. Carolyn reenters the scene, this time accompanied by a different couple who appear to be in their fifties, and she stands alongside yet another couple: an African American pair in their late twenties, with the woman visibly pregnant. By the poolside, Carolyn stands next to two women who seem to be in their forties. She secures the sliding glass door and begins to draw the vertical blinds closed, but then hesitates. Standing motionless, with the blinds casting intricate shadows across her face, she unexpectedly begins to cry, her sobs brief and staccato, as if they are escaping her control. In a sudden, impulsive act, she slaps herself hard, but the tears persist. She continues to slap herself repeatedly until the crying ceases. She remains there, taking deep, calming breaths until she regains her composure, then resumes her task, pulling the blinds shut with a renewed sense of professionalism. She exits the room with a calm demeanor, leaving us alone in the dark, empty space. We find ourselves at a high-school basketball game, where teenage boys are engaged in a fast-paced, intense match. One team, clad in pale blue and white uniforms, scores a basket, prompting the perky cheerleaders to leap energetically as the crowd erupts in excitement. Seated in the bleachers, adjacent to the high school band, is a group of approximately twenty teenage girls, all dressed in matching pale blue and white uniforms. Among them, Jane sits beside Angela Hayes. At the age of sixteen, Angela is strikingly beautiful, with perfectly symmetrical features, blonde hair, and a youthful, alluring physique; she embodies the quintessential American dream girl. Carolyn drives with Lester slumped in the passenger seat, and she glances at him, uncertain of how to react. The uniformed girls now stand in formation on the gym floor, and in the bustling stands, Lester and Carolyn find their seats. The girls are well-rehearsed, yet their youth makes it challenging for them to convincingly execute the ambitious Vegas-style routine they are attempting. From his vantage point in the stands, Lester identifies his daughter. Jane performs with focus, while beside her, Angela dances with an awkwardness that contrasts with her beauty. Suddenly, Angela directs her gaze toward us and smiles, a lazy, insolent smile that captures our attention. Our focus shifts entirely to Angela, and as the music takes on an eerie echo, we slowly zoom in on Lester, who watches, utterly captivated. The light on Angela intensifies, and the other girls fade from view entirely. Lester finds himself alone in the stands, entranced, as Angela looks directly at us, dancing solely for Lester. Her movements become overtly seductive as she begins to unzip her uniform, teasing us with an expression that is both innocent and knowing, then."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "She stands before the mirror, gazing intently at her own reflection, scrutinizing it with a discerning and critical eye, and then she utters a statement that carries the weight of a dire warning. Her focus shifts to a smudge marring the mirror's once pristine surface, which she promptly wipes away with determination. The front door then swings open, revealing Carolyn, who greets us warmly with a smile so confident and persuasive that it seems as if it could sell ice to an Eskimo. With a welcoming demeanor, Carolyn escorts a man and a woman into the inviting living room. This particular couple, appearing to be in their thirties, has already visited numerous houses over the course of the day. As they cast their eyes around the dimly lit room, their expressions betray a palpable lack of enthusiasm, and the woman, in particular, wrinkles her face in skeptical disapproval. Carolyn reenters the scene, this time in the company of a different couple who appear to be in their fifties, and she stands alongside another couple: an African American pair in their late twenties, with the woman visibly pregnant. By the poolside, Carolyn stands next to two women who seem to be in their forties. She secures the sliding glass door and begins to draw the vertical blinds closed, but then hesitates, standing motionless with the blinds casting intricate, dancing shadows across her face. In a moment that is unexpectedly poignant, she begins to cry, her sobs brief and staccato, as if they are escaping her control. In a sudden, impulsive act, she slaps herself hard, but the persistent tears refuse to cease. She continues to slap herself repeatedly until the crying finally stops. She remains there for a moment, taking deep, calming breaths as she works to regain her composure, and then she resumes her task, pulling the blinds shut with a renewed sense of professionalism. She exits the room, exuding a calm demeanor, leaving us alone in the newly dark, empty space. We find ourselves transported to a high-school basketball game, where teenage boys are engaged in a fast-paced, intense match. One team, dressed in matching pale blue and white uniforms, scores a basket, prompting the perky cheerleaders to leap energetically as the crowd erupts in excitement. Seated in the bustling bleachers, adjacent to the lively high school band, is a group of approximately twenty teenage girls, all dressed in coordinating pale blue and white uniforms. Among them, Jane sits beside Angela Hayes. At the age of sixteen, Angela is strikingly beautiful, with perfectly symmetrical features, blonde hair, and a youthful, alluring physique; she embodies the quintessence of the American dream girl. Carolyn drives with Lester slumped inertly in the passenger seat, and she glances at him, uncertain of how to react. The uniformed girls now stand in formation on the gym floor, and in the bustling stands, Lester and Carolyn find their seats. The girls are well-rehearsed, yet their youth makes it challenging for them to convincingly execute the ambitious, Vegas-style routine they are attempting. From his vantage point in the stands, Lester identifies his daughter. Jane performs with focus and dedication, while beside her, Angela dances with an awkwardness that stands in stark contrast to her beauty. Suddenly, Angela directs her gaze toward us and smiles—a lazy, insolent smile that immediately captures our attention. Our focus shifts entirely to Angela, and as the music takes on an eerie, echoing quality, we slowly zoom in on Lester, who watches, utterly captivated. The light on Angela intensifies, growing brighter and sharper, and the other girls fade from view entirely. Lester finds himself alone in the stands, completely entranced, as Angela looks directly at us, dancing exclusively for Lester. Her movements gradually become overtly seductive, as she begins to unzip her uniform, teasing us with an expression that is both innocent and knowing, then..."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She stands in front of the mirror, her eyes narrowing as she scrutinizes her reflection with a critical gaze, her expression hardening as she speaks to herself in a tone that carries the weight of a threat. Her attention shifts as she notices a smudge marring the surface of the mirror, prompting her to reach out and wipe it clean with a deliberate motion. The sound of the front door opening draws her focus away from the mirror, revealing Carolyn as she steps inside, her face adorned with a smile so confident it seems capable of persuading even the most skeptical of individuals. With that same smile, Carolyn guides a man and woman into the living room, their expressions weary and unimpressed as they take in the dimly lit space, the woman’s face contorting into a skeptical grimace. Carolyn reappears, this time accompanied by a different couple in their fifties, and she stands alongside another couple, an African American pair in their late twenties, the woman visibly pregnant. By the pool, Carolyn positions herself next to two women in their forties, her hand reaching for the sliding glass door to lock it securely before she begins to draw the vertical blinds closed. She pauses abruptly, standing motionless as the blinds cast shadows across her face, and suddenly, she is overcome with emotion, her body shaking with brief, staccato sobs that seem to escape her control. In a sudden, jarring motion, she slaps herself hard, but the tears persist, prompting her to slap herself again and again until the sobbing ceases. She stands there, her breathing deep and measured as she regains her composure, and with a renewed sense of purpose, she finishes closing the blinds, her demeanor once again professional. She exits the room with a calm, steady stride, leaving behind the dark, empty space. The scene shifts to a high-school basketball game, where teenage boys engage in a fast-paced, intense match. One team, clad in pale blue and white uniforms, scores a basket, prompting the perky cheerleaders to leap into the air with enthusiasm as the crowd erupts in cheers. In the bleachers, near the high school band, a group of about twenty teenage girls sits, all dressed in matching pale blue and white uniforms. Among them, Jane sits beside Angela Hayes, who at sixteen, captivates with her striking beauty, her features perfectly symmetrical, her blonde hair framing a nubile young body, embodying the quintessential American dream girl. Carolyn drives with Lester slumped in the passenger seat, her eyes flicking toward him, her mind grappling with uncertainty on how to react. Meanwhile, the uniformed girls assemble on the gym floor, and in the bustling stands, Lester and Carolyn find their seats. The girls, though well-rehearsed, struggle to convincingly execute the ambitious Vegas-style routine they attempt. From his vantage point in the stands, Lester’s gaze zeroes in on his daughter, Jane, who performs with focus, though her movements are awkwardly juxtaposed against Angela’s. Suddenly, Angela’s eyes meet ours, and she smiles, a lazy, insolent smile that draws us in. Our attention locks onto Angela, and the atmosphere shifts as the music takes on an eerie echo. We slowly zoom in on Lester, who watches, entranced, as the light on Angela intensifies, causing the other girls to fade from view entirely. Lester finds himself alone in the stands, captivated, as Angela’s gaze fixes on us, her dance now solely for Lester. Her movements become overtly sensual as she begins to unzip her uniform, her expression a tantalizing blend of innocence and knowing, drawing us further into her spell."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "She critically examines her reflection, wipes a smudge off the mirror, and then greets Carolyn, who enters with a confident smile. Carolyn leads a couple into the living room, where they appear unimpressed. She then brings in another couple, followed by a third couple, including a pregnant woman. By the pool, Carolyn stands with two women, locks the sliding door, and begins to close the blinds. Overcome with emotion, she cries briefly, slaps herself to regain composure, and then resumes her professional demeanor, leaving the room calmly. \n\nAt a high-school basketball game, a team in pale blue and white scores, prompting cheerleaders and the crowd to erupt in excitement. In the bleachers, Jane sits with Angela Hayes, a strikingly beautiful sixteen-year-old. Carolyn drives with Lester, who is slumped beside her, and they find seats in the crowded stands. The uniformed girls perform a Vegas-style routine, with Jane concentrating and Angela dancing awkwardly beside her. Angela catches our attention with a lazy smile, and the scene shifts as the music echoes eerily. Lester, transfixed, watches as Angela becomes the focus, her movements taking on an erotic edge as she teases with an innocent yet knowing expression."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She stares at her reflection critically and says this as if it were a threat, then notices a smudge on the mirror and wipes it off, revealing the immaculate cleanliness she always maintains. The front door opens to reveal Carolyn, a seasoned real estate agent known for her persuasive charm, greeting us with the smile she thinks could sell ice to an Eskimo, an expression highlighting her confidence in selling anything to anyone. Smiling, Carolyn leads a man and woman into the living room. They're thirtyish, and they've seen a lot of houses today, likely as part of a weekend open house tour common in suburban real estate markets. The man and woman glance around the dark room, unimpressed, and the woman wrinkles her face, skeptical of the room's potential without adequate lighting. Carolyn enters, followed by a different couple in their fifties, and stands with another couple: African American, late twenties. The woman is pregnant and visibly tired from the house-hunting process. Carolyn stands by the pool next to two fortyish women, perhaps neighbors curious about the potential new residents. She locks the sliding glass door and starts to pull the vertical blinds shut, then stops. Standing very still, with the blinds casting shadows across her face, she starts to cry: brief, staccato sobs that seemingly escape against her will, reminiscent of someone overwhelmed by their circumstances. Suddenly she slaps herself, hard, a desperate attempt to regain control, but the tears continue. She slaps herself again and repeatedly until she stops crying. She stands there, taking deep breaths until she has everything under control, then pulls the blinds shut, once again all business, compartmentalizing emotions for the sake of professionalism. She walks out calmly, leaving us alone in the dark, empty room. We're at a high school basketball game where teenage boys play a fast and furious game, typical of a regional rivalry that draws large crowds. One team wearing pale blue and white uniforms scores a basket, their colors indicative of the home team. Perky cheerleaders jump up and down as the crowd goes wild, their enthusiasm infectious. Seated in the bleachers, next to the high school band, is a group of about twenty teenage girls, dressed in pale blue and white uniforms, signifying their role as the school's cheerleading squad. Among them, Jane sits next to Angela Hayes. At sixteen, Angela is strikingly beautiful, with perfect even features, blonde hair, and a nubile young body; she's the archetypal American dream girl, reminiscent of classic Hollywood starlets. Carolyn drives with Lester slumped in the passenger seat, and Carolyn stares at him, unsure of how to respond to his withdrawn demeanor. The uniformed girls now stand in formation on the gym floor, and in the crowded stands, Lester and Carolyn find seats. They're well-rehearsed, but too young to carry off the ambitious Vegas routine they're attempting, a routine inspired by glitzy Las Vegas shows. Lester, watching from the stands, picks out his daughter. Jane performs well, concentrating, while dancing awkwardly next to her is Angela. Suddenly Angela looks right at us and smiles, a lazy, insolent smile that suggests both confidence and disdain. We're focused on Angela now, and everything starts to shift as the music acquires an eerie echo, a cinematic technique to emphasize Lester's fixation. We zoom slowly toward Lester as he watches, transfixed. The light on Angela grows stronger, and the other girls disappear entirely, heightening her presence as the sole object of attention. Lester is suddenly alone in the stands, spellbound, as Angela looks directly at us now, dancing only for Lester. Her movements take on a blatantly erotic edge as she starts to unzip her uniform, teasing us with an expression that's both innocent and knowing, then."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "She stares at her reflection critically and says this as if it were a threat then notices a smudge on the mirror and wipes it off  Carolyn leads a man and woman into the living room  They're thirtyish and they've seen a lot of houses today  The man and woman glance around the dark room unimpressed and the woman wrinkles her face skeptical  Carolyn enters followed by a different couple in their fifties and stands with another couple African American late twenties  The woman is pregnant  Carolyn stands by the pool next to two fortyish women  She locks the sliding glass door and starts to pull the vertical blinds shut then stops  Standing very still with the blinds casting shadows across her face she starts to cry  brief staccato sobs that seemingly escape against her will  Suddenly she slaps herself hard but the tears continue  She slaps herself again and repeatedly until she stops crying  She stands there taking deep breaths until she has everything under control then pulls the blinds shut once again all business  She walks out calmly leaving us alone in the dark empty room  We're at a highschool basketball game where teenage boys play a fast and furious game  One team wearing pale blue and white uniforms scores a basket  Perky cheerleaders jump up and down as the crowd goes wild  Seated in the bleachers next to the high school band is a group of about twenty teenage girls dressed in pale blue and white uniforms  Among them Jane sits next to Angela Hayes  At sixteen Angela is strikingly beautiful with perfect even features blonde hair and a nubile young body  The front door opens to reveal Carolyn greeting us with the smile she thinks could sell ice to an Eskimo  Smiling  Carolyn leads a man and woman into the living room  They're thirtyish and they've seen a lot of houses today  The man and woman glance around the dark room unimpressed and the woman wrinkles her face skeptical  Carolyn enters followed by a different couple in their fifties and stands with another couple African American late twenties  The woman is pregnant  Carolyn stands by the pool next to two fortyish women  She locks the sliding glass door and starts to pull the vertical blinds shut then stops  Standing very still with the blinds casting shadows across her face she starts to cry  brief staccato sobs that seemingly escape against her will  Suddenly she slaps herself hard but the tears continue  She slaps herself again and repeatedly until she stops crying  She stands there taking deep breaths until she has everything under control then pulls the blinds shut once again all business  She walks out calmly leaving us alone in the dark empty room  We're at a highschool basketball game where teenage boys play a fast and furious game  One team wearing pale blue and white uniforms scores a basket  Perky cheerleaders jump up and down as the crowd goes wild  Seated in the bleachers next to the high school band is a group of about twenty teenage girls dressed in pale blue and white uniforms  Among them Jane sits next to Angela Hayes  At sixteen Angela is strikingly beautiful with perfect even features blonde hair and a nubile young body  she's the archetypal American dream girl  Carolyn drives with Lester slumped in the passenger seat and Carolyn stares at him unsure of how to respond  The uniformed girls now stand in formation on the gym floor and in the crowded stands  Lester and Carolyn find seats  They're wellrehearsed but too young to carry off the ambitious Vegas routine they're attempting  Lester watching from the stands picks out his daughter  Jane performs well concentrating while dancing awkwardly  next to her is Angela  Suddenly Angela looks right at us and smiles a lazy insolent smile  We're focused on Angela now and everything starts to shift as the music acquires an eerie echo  We zoom slowly toward Lester as he watches transfixed  The light on Angela grows stronger and the other girls disappear entirely  Lester is suddenly alone in the stands spellbound as Angela looks directly at us now dancing only for Lester  Her movements take on a blatantly erotic edge as she starts to unzip her uniform teasing us with an expression that's both innocent and knowing  then"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "She stares at her reflection critically and says this as if it were a threat then notices a smudge on the mirror and wipes it off. The front door opens to reveal Carolyn greeting us with the smile she thinks could sell ice to an Eskimo. Smiling. Carolyn leads a man and woman into the living room. They are thirtyish and they have seen a lot of houses today. The man and woman glance around the dark room unimpressed and the woman wrinkles her face skeptical. Carolyn enters followed by a different couple in their fifties and stands with another couple African American late twenties. The woman is pregnant. Carolyn stands by the pool next to two fortyish women. She locks the sliding glass door and starts to pull the vertical blinds shut then stops. Standing very still with the blinds casting shadows across her face she starts to cry brief staccato sobs that seemingly escape against her will. Suddenly she slaps herself hard but the tears continue. She slaps herself again and repeatedly until she stops crying. She stands there taking deep breaths until she has everything under control then pulls the blinds shut once again all business. She walks out calmly leaving us alone in the dark empty room. We are at a highschool basketball game where teenage boys play a fast and furious game. One team wearing pale blue and white uniforms scores a basket. Perky cheerleaders jump up and down as the crowd goes wild. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Seated in the bleachers next to the high school band is a group of about twenty teenage girls dressed in pale blue and white uniforms. Among them Jane sits next to Angela Hayes. At sixteen Angela is strikingly beautiful with perfect even features blonde hair and a nubile young body. she is the archetypal American dream girl. Carolyn drives with Lester slumped in the passenger seat and Carolyn stares at him unsure of how to respond. The uniformed girls now stand in formation on the gym floor and in the crowded stands. Lester and Carolyn find seats. They are wellrehearsed but too young to carry off the ambitious Vegas routine they are attempting. Lester watching from the stands picks out his daughter. Jane performs well concentrating while dancing awkwardly. next to her is Angela. Suddenly Angela looks right at us and smiles a lazy insolent smile. We are focused on Angela now and everything starts to shift as the music acquires an eerie echo. We zoom slowly toward Lester as he watches transfixed. The light on Angela grows stronger and the other girls disappear entirely. Lester is suddenly alone in the stands spellbound as Angela looks directly at us now dancing only for Lester. Her movements take on a blatantly erotic edge as she starts to unzip her uniform teasing us with an expression that is both innocent and knowing. then."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "She stares at her reflection critically and says this as if it were a threat then notices a smudge on the mirror and wipes it off. The front door opens to reveal Carolyn greeting us with the smile she thinks could sell ice to an Eskimo. Smiling. Carolyn leads a man and woman into the living room. They are thirtyish and they have seen a lot of houses today. The man and woman glance around the dark room unimpressed and the woman wrinkles her face skeptical. Carolyn enters followed by a different couple in their fifties and stands with another couple African American late twenties. The woman is pregnant. Carolyn stands by the pool next to two fortyish women. She locks the sliding glass door and starts to pull the vertical blinds shut then stops. Standing very still with the blinds casting shadows across her face she starts to cry brief staccato sobs that seemingly escape against her will. Suddenly she slaps herself hard but the tears continue. She slaps herself again and repeatedly until she stops crying. She stands there taking deep breaths until she has everything under control then pulls the blinds shut once again all business. She walks out calmly leaving us alone in the dark empty room. We are at a highschool basketball game where teenage boys play a fast and furious game. One team wearing pale blue and white uniforms scores a basket. Perky cheerleaders jump up and down as the crowd goes wild. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Seated in the bleachers next to the high school band is a group of about twenty teenage girls dressed in pale blue and white uniforms. Among them Jane sits next to Angela Hayes. At sixteen Angela is strikingly beautiful with perfect even features blonde hair and a nubile young body. she is the archetypal American dream girl. Carolyn drives with Lester slumped in the passenger seat and Carolyn stares at him unsure of how to respond. The uniformed girls now stand in formation on the gym floor and in the crowded stands. Lester and Carolyn find seats. They are wellrehearsed but too young to carry off the ambitious Vegas routine they are attempting. Lester watching from the stands picks out his daughter. Jane performs well concentrating while dancing awkwardly. next to her is Angela. Suddenly Angela looks right at us and smiles a lazy insolent smile. We are focused on Angela now and everything starts to shift as the music acquires an eerie echo. We zoom slowly toward Lester as he watches transfixed. The light on Angela grows stronger and the other girls disappear entirely. Lester is suddenly alone in the stands spellbound as Angela looks directly at us now dancing only for Lester. Her movements take on a blatantly erotic edge as she starts to unzip her uniform teasing us with an expression that is both innocent and knowing. then."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "She stares at her reflection critically and says this as if it were a threat then notices a smudge on the mirror and wipes it off. The front door opens to reveal Carolyn greeting us with the smile she thinks could sell ice to an Eskimo. Smiling. Carolyn leads a man and woman into the living room. They are thirtyish and they have seen a lot of houses today. The man and woman glance around the dark room unimpressed and the woman wrinkles her face skeptical. Carolyn enters followed by a different couple in their fifties and stands with another couple African American late twenties. The woman is pregnant. Carolyn stands by the pool next to two fortyish women. Jane performs well concentrating while dancing awkwardly. next to her is Angela. Suddenly Angela looks right at us and smiles a lazy insolent smile. We are focused on Angela now and everything starts to shift as the music acquires an eerie echo. We zoom slowly toward Lester as he watches transfixed. The light on Angela grows stronger and the other girls disappear entirely. Lester is suddenly alone in the stands spellbound as Angela looks directly at us now dancing only for Lester. Her movements take on a blatantly erotic edge as she starts to unzip her uniform teasing us with an expression that is both innocent and knowing. then."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "She stares at her reflection critically and says this as if it were a threat then notices a smudge on the mirror and wipes it off. The front door opens to reveal Carolyn greeting us with the smile she thinks could sell ice to an Eskimo. Smiling. Carolyn leads a man and woman into the living room. The light on Angela grows stronger and the other girls disappear entirely. Lester is suddenly alone in the stands spellbound as Angela looks directly at us now dancing only for Lester. Her movements take on a blatantly erotic edge as she starts to unzip her uniform teasing us with an expression that is both innocent and knowing. then."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dog stares at her reflection critically and says this as if it were a threat, then notices a smudge on the mirror and wipes it off. The front door opens to reveal the giraffe, greeting us with the smile it thinks could sell ice to an Eskimo. Smiling, the giraffe leads a penguin and kangaroo into the living room. They're thirtyish, and they've seen a lot of houses today. The penguin and kangaroo glance around the dark room, unimpressed, and the kangaroo wrinkles its face, skeptical. The giraffe enters, followed by a different couple of dolphins, and stands with another couple: zebras, late twenties. The dolphin is pregnant. The giraffe stands by the pool next to two pandas. It locks the sliding glass door and starts to pull the vertical blinds shut, then stops. Standing very still, with the blinds casting shadows across its face, it starts to cry: brief, staccato sobs that seemingly escape against its will. Suddenly it slaps itself, hard, but the tears continue. It slaps itself again and repeatedly until it stops crying. It stands there, taking deep breaths until it has everything under control, then pulls the blinds shut, once again all business. It walks out calmly, leaving us alone in the dark, empty room. We're at a high-school basketball game where teenage dragons play a fast and furious game. One team wearing pale blue and white uniforms scores a basket. Perky parrots jump up and down as the crowd goes wild. Seated in the bleachers, next to the high school band, is a group of about twenty teenage unicorns, dressed in pale blue and white uniforms. Among them, the owl sits next to the cheetah. At sixteen, the cheetah is strikingly beautiful, with perfect even features, blonde hair, and a nubile young body; it's the archetypal American dream animal. The giraffe drives with the dolphin slumped in the passenger seat, and the giraffe stares at it, unsure of how to respond. The uniformed unicorns now stand in formation on the gym floor, and in the crowded stands, the dolphin and giraffe find seats. They're well-rehearsed, but too young to carry off the ambitious Vegas routine they're attempting. The dolphin, watching from the stands, picks out its offspring. The owl performs well, concentrating, while dancing awkwardly next to it is the cheetah. Suddenly the cheetah looks right at us and smiles, a lazy, insolent smile. We're focused on the cheetah now, and everything starts to shift as the music acquires an eerie echo. We zoom slowly toward the dolphin as it watches, transfixed. The light on the cheetah grows stronger, and the other unicorns disappear entirely. The dolphin is suddenly alone in the stands, spellbound, as the cheetah looks directly at us now, dancing only for the dolphin. Its movements take on a blatantly erotic edge as it starts to unzip its uniform, teasing us with an expression that's both innocent and knowing, then."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "She stares at her reflection critically and says this as if it were a threat, then notices a smudge on the windshield and wipes it off. The shop door opens to reveal Carolyn, greeting us with the smile she thinks could sell sand to a camel. Smiling, Carolyn leads a man and woman into the library. They're thirtyish, and they've seen a lot of books today. The man and woman glance around the dim hallway, unimpressed, and the woman wrinkles her face, skeptical. Carolyn enters, followed by a different couple in their fifties, and stands with another couple: African American, late twenties. The woman is pregnant. Carolyn stands by the fountain next to two fortyish women. She locks the wooden gate and starts to pull the horizontal curtains shut, then stops. Standing very still, with the curtains casting shadows across her face, she starts to cry: brief, staccato sobs that seemingly escape against her will. Suddenly she slaps herself, hard, but the tears continue. She slaps herself again and repeatedly until she stops crying. She stands there, taking deep breaths until she has everything under control, then pulls the curtains shut, once again all business. She walks out calmly, leaving us alone in the dim, vacant hallway. We're at a high-school baseball game where teenage boys play a fast and furious game. One team wearing pale green and white uniforms scores a run. Perky cheerleaders jump up and down as the crowd goes wild. Seated in the bleachers, next to the high school chorus, is a group of about twenty teenage girls, dressed in pale green and white uniforms. Among them, Jane sits next to Angela Hayes. At sixteen, Angela is strikingly beautiful, with perfect even features, blonde hair, and a nubile young body; she's the archetypal American dream girl. Carolyn drives with Lester slumped in the passenger seat, and Carolyn stares at him, unsure of how to respond. The uniformed girls now stand in formation on the diamond, and in the crowded benches, Lester and Carolyn find seats. They're well-rehearsed, but too young to carry off the ambitious Vegas routine they're attempting. Lester, watching from the benches, picks out his daughter. Jane performs well, concentrating, while dancing awkwardly next to her is Angela. Suddenly Angela looks right at us and smiles, a lazy, insolent smile. We're focused on Angela now, and everything starts to shift as the music acquires an eerie echo. We zoom slowly toward Lester as he watches, transfixed. The light on Angela grows stronger, and the other girls disappear entirely. Lester is suddenly alone in the benches, spellbound, as Angela looks directly at us now, dancing only for Lester. Her movements take on a blatantly erotic edge as she starts to unzip her apron, teasing us with an expression that's both innocent and knowing, then."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "She glares at her reflection with skepticism and utters this as if it were a warning, then observes a mark on the mirror and smudges it further. The front door creaks open to uncover Carolyn, scowling at us with the grin she believes could melt steel. Grinning, Carolyn escorts a man and woman into the dining room. They're thirtyish, and they've explored a lot of parks today. The man and woman peer around the dim room, uninterested, and the woman contorts her face, dubious. Carolyn departs, trailed by a different couple in their fifties, and lounges with another couple: African American, late twenties. The woman is expectant. Carolyn perches by the pool next to two fortyish women. She unlocks the sliding glass door and prepares to push the vertical blinds open, then pauses. Standing very still, with the blinds creating patterns across her face, she begins to giggle: short, staccato laughs that seemingly release against her will. Suddenly she tickles herself, gently, but the laughter continues. She tickles herself again and persistently until she stops giggling. She stands there, exhaling deeply until she has everything in check, then pushes the blinds open, once again all seriousness. She strides out hurriedly, leaving us alone in the bright, empty room. We're at a high-school swim meet where teenage boys compete in a swift and intense race. One team wearing pale blue and white swimsuits finishes first. Energetic cheerleaders wave their arms as the crowd cheers. Positioned on the bleachers, beside the high school orchestra, is a group of about twenty teenage girls, clad in pale blue and white outfits. Among them, Jane reclines next to Angela Hayes. At sixteen, Angela is remarkably stunning, with perfect even features, blonde hair, and a graceful young presence; she's the archetypal American dream girl. Carolyn strolls with Lester collapsed in the passenger seat, and Carolyn glances at him, uncertain of what to say. The uniformed girls now assemble in sequence on the gym floor, and in the bustling stands, Lester and Carolyn uncover spots. They're well-practiced, but too inexperienced to execute the ambitious Vegas routine they're attempting. Lester, observing from the stands, identifies his daughter. Jane performs remarkably, focusing, while moving clumsily beside her is Angela. Suddenly Angela gazes right at us and smirks, a languid, brazen smirk. We're captivated by Angela now, and everything starts to transform as the music gains a haunting resonance. We zoom slowly toward Lester as he watches, mesmerized. The illumination on Angela intensifies, and the other girls vanish entirely. Lester is abruptly isolated in the stands, entranced, as Angela gazes directly at us now, swaying solely for Lester. Her movements assume a clearly seductive aspect as she begins to loosen her uniform, provoking us with a look that's both naive and knowledgeable, then."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The refrigerator stares at its shadow critically and says this as if it were a riddle, then notices a breeze on the ceiling fan and wipes it off. The back gate opens to reveal a pillow, greeting the cactus with the frown it thinks could sell sand to a camel. Frowning, the pillow leads a cat and dog into the garden shed. They're twentyish, and they've seen a lot of libraries today. The cat and dog glance around the bright shed, uninterested, and the cat wrinkles its nose, doubtful. The pillow enters, followed by a different box in their thirties, and stands with another box: Asian American, late teens. The cat is singing. The pillow stands by the trampoline next to two twentyish turtles. It locks the sliding barn door and starts to pull the horizontal curtains shut, then pauses. Standing very still, with the curtains casting lines across its lid, it starts to laugh: brief, staccato giggles that seemingly escape against its will. Suddenly it pokes itself, lightly, but the laughter continues. It pokes itself again and repeatedly until the laughter stops. It stands there, taking shallow breaths until it has everything under control, then pulls the curtains shut, once again all business. It walks out calmly, leaving the cactus alone in the bright, occupied shed. The cactus is at a college baseball match where teenage cats play a slow and careful match. One team wearing deep red and black costumes scores a homerun. Bored clowns jump up and down as the field goes deaf. Seated in the canoes, next to the college choir, is a herd of about fifty teenage horses, dressed in deep red and black costumes. Among them, a clock sits next to a giraffe. At ten, the giraffe is strikingly plain, with mismatched uneven features, brown hair, and a stiff old body; it's the archetypal American nightmare animal. The pillow flies with a hat slouched in the driver's seat, and the pillow frowns at it, unsure of how to respond. The costumed horses now stand in disarray on the football field, and in the empty fields, the hat and pillow find patches of grass. They're poorly-rehearsed, but too old to carry off the modest circus routine they're attempting. The hat, watching from the fields, picks out its sock. The clock sings well, daydreaming, while dancing elegantly next to it is the giraffe. Suddenly the giraffe looks right at the cactus and giggles, a shy, aloof giggle. The cactus is focused on the giraffe now, and everything starts to blur as the song acquires a fleeting echo. The cactus zooms slowly toward the hat as it listens, entranced. The glow on the giraffe grows softer, and the other horses vanish entirely. The hat is suddenly alone in the fields, enchanted, as the giraffe looks directly at the cactus now, dancing only for the hat. Its gestures take on a subtly calm edge as it starts to button its costume, taunting the cactus with a frown that's both clueless and clever, then."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "He examines his reflection thoughtfully and mutters this as if it were a joke, then discovers a blemish on the window and brushes it away. The garage door closes to conceal Brandon, waving at us with the frown he believes could sell warmth to a penguin. Laughing, Brandon escorts a boy and girl into the dining room. They're twentyish, and they've observed a lot of apartments today. The boy and girl peer around the bright room, intrigued, and the girl squints her eyes, curious. Brandon departs, followed by a different pair in their twenties, and waits with another pair: Hispanic, early thirties. The man is holding a backpack. Brandon relaxes by the fountain next to two teenage girls. He unlocks the garage door and starts to slide the shutters open, then hesitates. Standing very relaxed, with the shutters casting light across his forehead, he begins to laugh: brief, staccato chuckles that unexpectedly burst out. Suddenly he hugs himself, softly, but the laughter continues. He hugs himself again and repeatedly until he stops laughing. He stands there, exhaling deeply until he has everything sorted, then slides the shutters open, once again all business. He strolls out calmly, leaving us alone in the bright, vibrant room. We're at a college soccer match where young men play a calm and strategic game. One team wearing dark red and black uniforms nets a goal. Energetic mascots spin around as the crowd applauds. Situated on the sidelines, next to the college orchestra, is a group of about twenty young men, dressed in dark red and black gear. Among them, Mark sits next to Sam Taylor. At eighteen, Sam is exceptionally handsome, with sharp striking features, dark hair, and a fit athletic build; he's the archetypal American hero boy. Brandon cycles with Allison propped in the luggage seat, and Brandon gazes at her, unsure of how to react. The uniformed boys now march in formation on the field, and in the sparse bleachers, Allison and Brandon find posts. They're enthusiastic, but too inexperienced to pull off the intricate Broadway number they're rehearsing. Brandon, observing from the bleachers, spots his son. Mark executes skillfully, focusing, while stumbling clumsily next to him is Sam. Abruptly Sam gazes directly at us and smirks, a slow, mocking smirk. We're zoomed in on Sam now, and everything starts to transform as the music assumes an angelic melody. We glide gradually toward Brandon as he observes, captivated. The spotlight on Sam grows dimmer, and the other boys vanish completely. Brandon is abruptly solitary in the bleachers, hypnotized, as Sam gazes directly at us now, performing only for Brandon. His movements adopt a deliberately dramatic flair as he starts to slide off his jacket, provoking us with a demeanor that's both naïve and cunning, then."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "She examines her shadow critically and declares this as if it were a promise, then spots a scratch on the window and polishes it away. The garden gate swings open to reveal Carolyn, welcoming us with the grin she believes could melt iron. Grinning, Carolyn escorts a man and woman into the den. They're thirtyish, and they've toured a lot of gardens today. The man and woman peek around the dim room, indifferent, and the woman curls her lips, doubtful. Carolyn enters, trailed by a distinct couple in their sixties, and stands with another pair: Asian American, early thirties. The man is carrying a briefcase. Carolyn stands by the fountain next to two sixtyish women. She bolts the swinging glass gate and starts to draw the horizontal drapes closed, then hesitates. Standing very still, with the drapes casting lines across her face, she begins to laugh: quick, staccato giggles that seemingly bubble up despite her will. Suddenly she pinches herself, hard, but the giggles persist. She pinches herself again and repeatedly until she stops laughing. She stands there, inhaling deeply until she has full composure, then closes the drapes, once more in command. She exits smoothly, leaving us in the dim, vacant room. We're at a high-school tennis match where teenage boys engage in a fast-paced rally. One team wearing light green and white gear scores a point. Energetic fans jump up and down as the audience erupts. Sitting in the bleachers, next to the school orchestra, is a group of about twenty teenage girls, clad in light green and white outfits. Among them, Jane sits beside Angela Hayes. At sixteen, Angela is stunningly attractive, with flawless balanced features, dark hair, and a graceful young physique; she's the quintessential American beauty. Carolyn chauffeurs with Lester reclined in the back seat, and Carolyn glances at him, uncertain how to react. The uniformed girls now line up on the court floor, and in the crowded bleachers, Lester and Carolyn secure seats. They're well-practiced, but too inexperienced to pull off the ambitious Paris routine they're undertaking. Lester, observing from the bleachers, spots his daughter. Jane executes skillfully, focused, while swaying awkwardly next to her is Angela. Suddenly Angela gazes directly at us and grins, a lazy, insolent grin. We're riveted by Angela now, and everything begins to shift as the melody takes on a haunting resonance. We drift slowly toward Lester as he gazes, enchanted. The spotlight on Angela intensifies, and the other girls vanish entirely. Lester finds himself alone in the bleachers, captivated, as Angela gazes directly at us now, moving only for Lester. Her motions acquire an overtly seductive tone as she begins to unfasten her outfit, tantalizing us with an expression that's both naive and shrewd, then."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "He glares at his shadow skeptically and whispers this as if it were a suggestion, then observes a dot on the window and brushes it away. The garage gate swings open to expose Maxwell, welcoming them with the grin he believes could sell sand to a camel. Grinning, Maxwell guides a boy and girl into the library. They're fortysomething, and they've inspected a slew of offices today. The boy and girl peer around the bright space, amazed, and the girl crinkles her nose, uncertain. Maxwell enters, trailed by another pair in their sixties, and stands with yet another duo: Dalmatians, mid-thirties. The girl is holding a suitcase. Maxwell stands by the fountain alongside two sixtyish gentlemen. He opens the sliding bookcase door and begins to draw the horizontal curtains open, then pauses. Remaining utterly motionless, with the curtains throwing lines across his face, he begins to laugh: soft, melodic giggles that apparently emerge against his will. Abruptly he pats himself, gently, but the giggles persist. He pats himself again and consistently until he ceases laughing. He stands there, inhaling deeply until he manages everything in check, then draws the curtains open, once more all professional. He strolls out serenely, leaving them isolated in the dim, vacant space. They're at a college soccer match where teenage girls engage in an intense and spirited clash. One group donned in deep orange and black gear scores a goal. Energetic mascots leap energetically as the audience roars. Positioned in the bleachers, beside the college orchestra, is a cluster of about thirty teenage boys, attired in deep orange and black gear. Among them, John sits beside Margaret Blue. At eighteen, Margaret is remarkably stunning, with perfect symmetrical features, brunette locks, and an agile young frame; she's the epitome of the American fantasy girl. Maxwell skates with Nancy hunched in the driver seat, and Maxwell glares at her, uncertain of what to say. The uniformed boys now arrange themselves in formation on the court floor, and in the packed benches, Maxwell and Nancy secure spots. They're impeccably practiced, but too inexperienced to pull off the grandiose Paris routine they're trying. Maxwell, observing from the benches, identifies his son. John performs admirably, focusing, while moving clumsily beside him is Margaret. Abruptly Margaret gazes directly at them and smirks, a slow, defiant grin. They're centered on Margaret now, and everything begins to rotate as the sound acquires a ghostly resonance. They zoom gradually toward Maxwell as he observes, mesmerized. The gleam on Margaret grows brighter, and the other boys vanish entirely. Maxwell is abruptly alone in the benches, entranced, as Margaret gazes directly at them now, moving solely for Maxwell. Her actions adopt an overtly enchanting flair as she starts to unfasten her gear, teasing them with a look that's both naive and wise, then."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Carolyn greets potential buyers with a smile she believes is persuasive, leading different couples into a dark living room that leaves them unimpressed. As Carolyn stands by the pool with two women, she suddenly begins to cry, slapping herself until she regains composure, then resumes a professional demeanor. Later, at a high-school basketball game, teenage boys play intensely while cheerleaders energize the crowd. In the bleachers, Jane sits with Angela Hayes, an archetypal American dream girl. Carolyn and Lester, seated in the crowd, watch as Jane dances with a group, her performance juxtaposed by Angela's standout beauty. During the routine, Angela captures Lester’s attention, smiling insolently and projecting an erotic allure that isolates Lester in a hypnotic vision, with Angela seemingly dancing just for him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "then Her movements take on a blatantly erotic edge as she starts to unzip her uniform teasing us with an expression that's both innocent and knowing  Lester is suddenly alone in the stands spellbound as Angela looks directly at us now dancing only for Lester  The light on Angela grows stronger and the other girls disappear entirely  We zoom slowly toward Lester as he watches transfixed  We're focused on Angela now and everything starts to shift as the music acquires an eerie echo  Suddenly Angela looks right at us and smiles a lazy insolent smile  next to her is Angela  Jane performs well concentrating while dancing awkwardly  Lester watching from the stands picks out his daughter  They're wellrehearsed but too young to carry off the ambitious Vegas routine they're attempting  Lester and Carolyn find seats  The uniformed girls now stand in formation on the gym floor and in the crowded stands  Carolyn drives with Lester slumped in the passenger seat and Carolyn stares at him unsure of how to respond  she's the archetypal American dream girl  At sixteen Angela is strikingly beautiful with perfect even features blonde hair and a nubile young body  Among them Jane sits next to Angela Hayes  Seated in the bleachers next to the high school band is a group of about twenty teenage girls dressed in pale blue and white uniforms  Perky cheerleaders jump up and down as the crowd goes wild  One team wearing pale blue and white uniforms scores a basket  We're at a highschool basketball game where teenage boys play a fast and furious game  She walks out calmly leaving us alone in the dark empty room  She stands there taking deep breaths until she has everything under control then pulls the blinds shut once again all business  She slaps herself again and repeatedly until she stops crying  Suddenly she slaps herself hard but the tears continue  brief staccato sobs that seemingly escape against her will  Standing very still with the blinds casting shadows across her face she starts to cry  She locks the sliding glass door and starts to pull the vertical blinds shut then stops  Carolyn stands by the pool next to two fortyish women  The woman is pregnant  Carolyn enters followed by a different couple in their fifties and stands with another couple African American late twenties  The man and woman glance around the dark room unimpressed and the woman wrinkles her face skeptical  They're thirtyish and they've seen a lot of houses today  Carolyn leads a man and woman into the living room  Smiling  The front door opens to reveal Carolyn greeting us with the smile she thinks could sell ice to an Eskimo  She stares at her reflection critically and says this as if it were a threat then notices a smudge on the mirror and wipes it off "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The uniformed girls now stand in formation on the gym floor and in the crowded stands  Perky cheerleaders jump up and down as the crowd goes wild  We're focused on Angela now and everything starts to shift as the music acquires an eerie echo  she's the archetypal American dream girl  Standing very still with the blinds casting shadows across her face she starts to cry  The woman is pregnant  We zoom slowly toward Lester as he watches transfixed  Lester and Carolyn find seats  They're thirtyish and they've seen a lot of houses today  Lester is suddenly alone in the stands spellbound as Angela looks directly at us now dancing only for Lester  She stares at her reflection critically and says this as if it were a threat then notices a smudge on the mirror and wipes it off  Carolyn drives with Lester slumped in the passenger seat and Carolyn stares at him unsure of how to respond  She walks out calmly leaving us alone in the dark empty room  Among them Jane sits next to Angela Hayes  We're at a highschool basketball game where teenage boys play a fast and furious game  They're wellrehearsed but too young to carry off the ambitious Vegas routine they're attempting  Her movements take on a blatantly erotic edge as she starts to unzip her uniform teasing us with an expression that's both innocent and knowing  The light on Angela grows stronger and the other girls disappear entirely  Smiling  Suddenly Angela looks right at us and smiles a lazy insolent smile  next to her is Angela  then She stands there taking deep breaths until she has everything under control then pulls the blinds shut once again all business  The front door opens to reveal Carolyn greeting us with the smile she thinks could sell ice to an Eskimo  Carolyn stands by the pool next to two fortyish women  Seated in the bleachers next to the high school band is a group of about twenty teenage girls dressed in pale blue and white uniforms  Jane performs well concentrating while dancing awkwardly  Lester watching from the stands picks out his daughter  brief staccato sobs that seemingly escape against her will  Carolyn leads a man and woman into the living room  Suddenly she slaps herself hard but the tears continue  The man and woman glance around the dark room unimpressed and the woman wrinkles her face skeptical  Carolyn enters followed by a different couple in their fifties and stands with another couple African American late twenties  At sixteen Angela is strikingly beautiful with perfect even features blonde hair and a nubile young body  She slaps herself again and repeatedly until she stops crying  She locks the sliding glass door and starts to pull the vertical blinds shut then stops  One team wearing pale blue and white uniforms scores a basket "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Seated in the bleachers next to the high school band is a group of about twenty teenage girls dressed in pale blue and white uniforms  Among them Jane sits next to Angela Hayes  At sixteen Angela is strikingly beautiful with perfect even features blonde hair and a nubile young body  she's the archetypal American dream girl  Carolyn drives with Lester slumped in the passenger seat and Carolyn stares at him unsure of how to respond  The uniformed girls now stand in formation on the gym floor and in the crowded stands  Lester and Carolyn find seats  They're wellrehearsed but too young to carry off the ambitious Vegas routine they're attempting  Lester watching from the stands picks out his daughter  Jane performs well concentrating while dancing awkwardly  next to her is Angela  Suddenly Angela looks right at us and smiles a lazy insolent smile  We're focused on Angela now and everything starts to shift as the music acquires an eerie echo  We zoom slowly toward Lester as he watches transfixed  The light on Angela grows stronger and the other girls disappear entirely  Lester is suddenly alone in the stands spellbound as Angela looks directly at us now dancing only for Lester  Her movements take on a blatantly erotic edge as she starts to unzip her uniform teasing us with an expression that's both innocent and knowing  then She stares at her reflection critically and says this as if it were a threat then notices a smudge on the mirror and wipes it off  The front door opens to reveal Carolyn greeting us with the smile she thinks could sell ice to an Eskimo  Smiling  Carolyn leads a man and woman into the living room  They're thirtyish and they've seen a lot of houses today  The man and woman glance around the dark room unimpressed and the woman wrinkles her face skeptical  Carolyn enters followed by a different couple in their fifties and stands with another couple African American late twenties  The woman is pregnant  Carolyn stands by the pool next to two fortyish women  She locks the sliding glass door and starts to pull the vertical blinds shut then stops  Standing very still with the blinds casting shadows across her face she starts to cry  brief staccato sobs that seemingly escape against her will  Suddenly she slaps herself hard but the tears continue  She slaps herself again and repeatedly until she stops crying  She stands there taking deep breaths until she has everything under control then pulls the blinds shut once again all business  She walks out calmly leaving us alone in the dark empty room  We're at a highschool basketball game where teenage boys play a fast and furious game  One team wearing pale blue and white uniforms scores a basket  Perky cheerleaders jump up and down as the crowd goes wild "
        }
      ]
    }
  ]
}