{
  "ground_truth": "A large black recruit with a strange look on his face, much like Forrest's, looks up from his seat, and Bubba moves his case over, making room for Forrest to sit down. Bubba hands Forrest a handkerchief, and they shake hands. Bubba's mother, a robust woman in a cook's uniform, carries a bowl of shrimp into a dining room and sets it down on a table in front of a wealthy white man. Bubba's grandmother also carries a bowl of shrimp into a dining room and sets it down on a table in front of a wealthy white man. The Drill Sergeant moves down the line to the next man while the recruits sit at the base of their bunks assembling their rifles. Bubba speaks to Forrest as Forrest finishes assembling his rifle while the other recruits are still working on theirs. The Drill Sergeant rushes up to Forrest, looks at his stopwatch, and then walks away as Forrest begins to disassemble his rifle. Bubba continues talking about shrimp in his slow southern drawl as Bubba and Forrest shine their boots. They are on their hands and knees scrubbing the floor with toothbrushes. Later, Bubba lies in his bunk and looks up quietly, and Forrest also lies in his bunk and looks up. A young private tosses a Playboy magazine onto Forrest, who picks it up and turns the page, revealing Jenny as she poses with a school sweater on, and that's all. Forrest looks up with shock, cranes his head up for a closer look, then in his army uniform, steps into the foyer of the club. The EMCEE steps out onto the stage, and the men laugh. Jenny kicks a man's hand, and he yells angrily as he sits back down, then tosses his drink on her. Forrest walks up to the man and grabs him, tossing him to the ground. Another man tries to grab Forrest, but Forrest shoves him down too. Forrest climbs up onto the stage, picks Jenny up, guitar and all, and carries her, but Jenny struggles and frees herself. Forrest steps back in surprise, and Jenny shoves the guitar at him. Jenny walks off as Forrest holds the guitar and follows after her. Forrest follows Jenny over a bridge outside the nightclub, and Jenny turns and looks over the bridge, then at the light of an approaching vehicle. She steps into the street, runs, and flags down the approaching vehicle. A pickup truck pulls over as Jenny looks at the driver, walks toward Forrest, looks at the driver again, and then walks up to Forrest. Jenny takes a last look at Forrest and then climbs into the truck.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A big ebony rookie with a peculiar expression on his visage, much like Forrest's, glances up from his chair, and Bubba shifts his bag over, creating space for Forrest to perch. Bubba offers Forrest a kerchief, and they exchange greetings. Bubba's mother, a sturdy female in a chef's attire, bears a bowl of prawns into an eating area and places it down on a table before a affluent Caucasian male. Bubba's grandmother likewise bears a bowl of prawns into an eating area and places it down on a table before a affluent Caucasian male. The Drill Sergeant advances down the row to the subsequent male while the rookies rest at the foundation of their cots assembling their weapons. Bubba converses with Forrest as Forrest completes assembling his weapon while the other rookies are still laboring on theirs. The Drill Sergeant dashes up to Forrest, glances at his chronometer, and then strides away as Forrest begins to dismantle his weapon. Bubba persists talking about prawns in his sluggish southern accent as Bubba and Forrest polish their footwear. They are on their palms and knees scrubbing the ground with toothbrushes. Later, Bubba reclines in his cot and gazes up quietly, and Forrest also reclines in his cot and gazes up. A young soldier flings a Playboy periodical onto Forrest, who picks it up and flips the sheet, disclosing Jenny as she poses with a school sweater on, and that's all. Forrest glances up with astonishment, stretches his head up for a nearer look, then in his military attire, steps into the entrance of the establishment. The EMCEE strides out onto the platform, and the men chortle. Jenny kicks a male's hand, and he shouts angrily as he reclines again, then throws his beverage on her. Forrest strides up to the male and seizes him, hurling him to the earth. Another male attempts to seize Forrest, but Forrest pushes him down too. Forrest ascends onto the platform, picks Jenny up, guitar and all, and bears her, but Jenny struggles and liberates herself. Forrest steps back in astonishment, and Jenny thrusts the guitar at him. Jenny strides off as Forrest holds the guitar and trails after her. Forrest trails Jenny over a span outside the nightclub, and Jenny turns and gazes over the span, then at the illumination of an nearing vehicle. She steps into the avenue, runs, and gestures down the nearing vehicle. A pickup vehicle pulls over as Jenny glances at the operator, walks toward Forrest, glances at the operator again, and then strides up to Forrest. Jenny takes a final glance at Forrest and then climbs into the vehicle."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A large black recruit with a strange look on his face, much like Forrest's, is looked up by from his seat, and the case is moved over by Bubba, making room for Forrest to sit down. A handkerchief is handed by Bubba to Forrest, and they shake hands. A bowl of shrimp is carried by Bubba's mother, a robust woman in a cook's uniform, into a dining room and set down on a table in front of a wealthy white man. A bowl of shrimp is also carried by Bubba's grandmother into a dining room and set down on a table in front of a wealthy white man. The line is moved down by the Drill Sergeant to the next man while the recruits assemble their rifles at the base of their bunks. Forrest is spoken to by Bubba as his rifle is finished being assembled by Forrest while the other recruits are still working on theirs. Forrest is rushed up to by the Drill Sergeant, who looks at his stopwatch, and then walks away as the rifle is begun to be disassembled by Forrest. Shrimp is continued to be talked about by Bubba in his slow southern drawl as their boots are shined by Bubba and Forrest. They scrub the floor with toothbrushes on their hands and knees. Later, a bunk is lied in by Bubba, who looks up quietly, and a bunk is also lied in by Forrest, who looks up. A Playboy magazine is tossed onto Forrest by a young private, who picks it up and turns the page, revealing Jenny posed with a school sweater on, and that's all. Shock is looked up with by Forrest, who cranes his head up for a closer look, then in his army uniform, steps into the foyer of the club. The stage is stepped out onto by the EMCEE, and the men laugh. A man's hand is kicked by Jenny, and he yells angrily as he sits back down, then tosses his drink on her. The man is walked up to by Forrest and grabbed, tossing him to the ground. Another man tries to grab Forrest, but he is shoved down too by Forrest. The stage is climbed up onto by Forrest, who picks Jenny up, guitar and all, and carries her, but she struggles and frees herself. Surprise is stepped back in by Forrest, and the guitar is shoved at him by Jenny. The guitar is held by Forrest as Jenny walks off and is followed after her by Forrest. Jenny is followed by Forrest over a bridge outside the nightclub, and the bridge is looked over by Jenny, then at the light of an approaching vehicle. The street is stepped into by her, and the approaching vehicle is run and flagged down. A pickup truck pulls over as the driver is looked at by Jenny, who walks toward Forrest, looks at the driver again, and then walks up to Forrest. A last look is taken by Jenny at Forrest and then she climbs into the truck."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A large black recruit with a peculiar expression, like Forrest's, looks up, and Bubba shifts his case, allowing Forrest to sit. Bubba hands Forrest a handkerchief, and they shake hands. Bubba's mother, in a cook's uniform, and his grandmother both serve shrimp to a wealthy white man. The Drill Sergeant inspects the recruits assembling rifles. Bubba talks to Forrest as he finishes his rifle while others lag behind. The Sergeant checks his stopwatch and leaves as Forrest disassembles his rifle. Bubba discusses shrimp in a slow southern drawl while they shine boots and scrub the floor with toothbrushes. Later, Bubba and Forrest lie quietly in their bunks. A private tosses a Playboy to Forrest, who discovers Jenny posing in it and is shocked. In his army uniform, Forrest enters a club foyer. The EMCEE appears, and men laugh. Jenny kicks a man's hand, and he angrily throws his drink on her. Forrest approaches and throws the man to the ground, shoving another man too. Forrest climbs the stage, picks up Jenny with her guitar, but Jenny escapes and shoves the guitar at him. Jenny leaves, and Forrest follows her across a nightclub bridge. She flags down a pickup truck, takes a final look at Forrest, and gets in."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A large black recruit resembling Forrest looks up from his seat, and Bubba makes room for Forrest to sit. Bubba hands Forrest a handkerchief, and they shake hands. Bubba's mother and grandmother, both in cook uniforms, carry bowls of shrimp to a table in front of a wealthy white man. The Drill Sergeant moves down the line while recruits assemble their rifles. Bubba talks to Forrest as he finishes his rifle. The Drill Sergeant checks his stopwatch and leaves as Forrest disassembles his rifle. Bubba continues discussing shrimp while they shine boots and scrub floors with toothbrushes. Later, both lie in their bunks quietly. A young private tosses a Playboy magazine to Forrest, revealing Jenny posing in a school sweater. Shocked, Forrest dons his army uniform and enters a club. The EMCEE appears, and men laugh as Jenny kicks a man, who throws his drink at her. Forrest intervenes, tossing the men down, then carries Jenny offstage, but she struggles free, leaving Forrest surprised. Jenny shoves her guitar at him and leaves. Forrest follows Jenny outside to a bridge, where she flags down a pickup. Jenny takes a final look at Forrest before climbing into the truck."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A large, imposing recruit with a peculiar expression adorning his face, reminiscent of Forrest's own distinctive look, glances up from his position seated among the others. Bubba, noticing Forrest, courteously shifts his case to the side, creating adequate space for Forrest to settle down comfortably beside him. In a friendly gesture, Bubba extends a handkerchief to Forrest, and they engage in a warm handshake. Meanwhile, Bubba's mother, a sturdy woman adorned in a cook's uniform, makes her way into the dining room, carrying a bowl brimming with shrimp. She places it down on the table in front of a distinguished, affluent white man. Bubba's grandmother follows suit, carrying another bowl of shrimp, which she also places in front of the same wealthy individual. At this moment, the Drill Sergeant is making his way down the line to address the next soldier as the recruits remain seated at the base of their bunks, diligently assembling their rifles. Bubba directs some comments to Forrest while Forrest efficiently completes the assembly of his rifle, even as the rest of the recruits are still working through the task. The Drill Sergeant swiftly approaches Forrest, checks his stopwatch with a scrutinizing gaze, and subsequently walks away as Forrest begins methodically disassembling his rifle. All the while, Bubba continues his conversation about shrimp, his slow southern drawl painting vivid imagery as they both meticulously shine their boots. They find themselves on their hands and knees, thoroughly scrubbing the floor with toothbrushes. Later on, both Bubba and Forrest lie in their respective bunks, gazing quietly upward. A young private, with a casual flick, tosses a Playboy magazine onto Forrest, who picks it up with curiosity and flips through the pages. To his surprise, he finds Jenny, posing boldly with nothing but a school sweater. Shocked, Forrest looks up in astonishment, craning his neck for a more focused look. Clad in his army uniform, Forrest is next seen stepping into the bustling foyer of a club. The EMCEE makes a dramatic entrance onto the stage, eliciting laughter from the gathered men. Jenny, amidst the crowd, kicks a man's hand away, prompting him to shout angrily and retaliate by tossing his drink in her direction. At this, Forrest strides up to the man, seizes him, and forcefully throws him to the floor. Another attempt is made by a second man to subdue Forrest, but with a firm shove, he too is knocked down. With determined resolve, Forrest ascends the stage, carefully lifting Jenny, along with her guitar, intending to carry her away, but Jenny resists and manages to free herself. Startled, Forrest steps back in surprise, holding the guitar awkwardly as Jenny pushes it at him. Jenny then exits the stage, and Forrest trails behind her, carrying the guitar in tow. They make their way over a bridge just outside the nightclub, where Jenny pauses, glancing over the edge at the water below, then turns toward the lights of an oncoming vehicle. With determination, she steps into the street, running to flag down the approaching car. The pickup truck comes to a halt as Jenny assesses the driver, briefly walks toward Forrest, then returns to face the driver once more. After a final, lingering look at Forrest, Jenny climbs into the truck and departs."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "An impressively large and imposing recruit with a peculiar expression adorning his face, reminiscent of Forrest's own distinctive look, lifts his gaze from his position where he is seated among the other recruits. Bubba, upon noticing Forrest's presence, courteously shifts his case aside, thus creating adequate space for Forrest to settle down comfortably right next to him. In an act of friendly camaraderie, Bubba thoughtfully extends a handkerchief to Forrest, initiating a warm handshake between them. Meanwhile, Bubba's mother, a sturdy woman attired in a cook's uniform, makes her entrance into the dining room while carrying a generously filled bowl brimming with shrimp. She places this bowl down on the table right in front of a distinguished and affluent white man. Following her lead, Bubba's grandmother also enters shortly after, carrying yet another bowl of shrimp, which she similarly places in front of the same wealthy individual. \n\nAt this moment, the Drill Sergeant is making his way down the line, preparing to address the next soldier as all the recruits remain seated at the base of their bunks, diligently engaged in assembling their rifles. Bubba directs some conversation towards Forrest, who, with remarkable efficiency, completes the assembly of his rifle, even as the rest of the recruits are still laboring over the task. The Drill Sergeant swiftly approaches Forrest, checks his stopwatch with a scrutinizing gaze, and subsequently walks away as Forrest begins methodically disassembling his rifle. Throughout this time, Bubba continues his engrossing conversation about shrimp, his slow southern drawl painting vivid imagery as they both meticulously and diligently shine their boots. They find themselves on their hands and knees, thoroughly scrubbing the floor with toothbrushes. Later on, both Bubba and Forrest lie in their respective bunks, looking upward quietly. A young private, with a casual flick, tosses a Playboy magazine onto Forrest. Curiously, Forrest picks it up and flips through the pages, only to his utter surprise, he discovers Jenny, boldly posing with nothing but a school sweater. Shock courses through him as he looks up in astonishment, craning his neck for a more focused look.\n\nClad in his army uniform, Forrest is next seen stepping into the bustling, lively foyer of a club. The EMCEE makes a dramatic entrance onto the stage, eliciting laughter and applause from the gathered men. During this, Jenny, amidst the crowd, kicks a man's hand away, prompting him to shout angrily and retaliate by tossing his drink angrily in her direction. Witnessing this, Forrest strides up to the man, seizes him firmly, and forcefully throws him to the floor. Another attempt is made by a second man to subdue Forrest, but with a firm shove, he too is knocked down. With determined resolve burning within him, Forrest ascends the stage, carefully lifting Jenny, along with her guitar, with the intention of carrying her away, yet Jenny resists and manages to free herself from his grasp. Startled, Forrest steps back in surprise, holding the guitar awkwardly as Jenny pushes it at him. Jenny then exits the stage, and Forrest trails closely behind her, carrying the guitar in tow. They make their way over a bridge just outside the nightclub, where Jenny pauses, casting a glance over the edge at the water below, then turns her gaze toward the lights of an oncoming vehicle. With determination, she steps into the street, running to flag down the approaching car. The pickup truck comes to a halt as Jenny assesses the driver, briefly walks toward Forrest, then returns to face the driver once more. After a final, lingering look at Forrest, Jenny climbs into the truck, and with a sense of resolve, she departs."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A large black recruit with a peculiar expression on his face, reminiscent of Forrest's own, who is seated, glances upwards. Bubba, sitting next to him, shifts his belongings to the side, thereby creating an open space on the seat beside him, making it possible for Forrest to settle down next to him. As Forrest settles into the newly available seat, Bubba extends his hand and offers a handkerchief to him, cementing their acquaintance with a handshake. In a different scene, Bubba's mother, who is a sturdy woman dressed in a cook's uniform, enters a dining room while carrying a bowl filled with shrimp. She approaches the table where a wealthy white man is seated and gently places the bowl in front of him. Following her, Bubba's grandmother also enters the dining room in a similar manner, carrying another bowl of shrimp, which she places carefully on the same table before another wealthy white man. Meanwhile, back at the training grounds, the Drill Sergeant methodically proceeds down the line, moving from one recruit to the next, even as the recruits are seated at the foot of their bunks, focused intently on assembling their rifles. Amidst the concentrated effort, Bubba starts a conversation with Forrest, who has just completed assembling his rifle, a task that the other recruits are still in the process of finishing. At this moment, the Drill Sergeant hastens towards Forrest, his eyes fixed on his stopwatch, observing and then departing as Forrest begins the process of disassembling his rifle. During this, Bubba continues his conversation with Forrest, speaking in his distinctive slow southern drawl about shrimp as they together polish their boots to a shine. In a subsequent scene, both Bubba and Forrest are positioned on their hands and knees, diligently scrubbing the floor using toothbrushes. Later, Bubba lies silently in his bunk, gazing upwards at the ceiling, while Forrest, also reclining in his bunk, does the same. Their quiet is interrupted when a young private casually tosses a Playboy magazine onto Forrest, who reaches to pick it up, curiously flips through the pages, and his eyes widen in shock upon seeing a photograph of Jenny, who poses wearing nothing but a school sweater. Overcome with surprise, Forrest lifts his head, seeking a clearer view. In the following scene, Forrest, now dressed in his army uniform, strides into the foyer of a club. From the stage, the EMCEE makes his entrance, eliciting laughter among the men present. The atmosphere shifts as Jenny, who is on stage, kicks a man's hand, prompting him to shout angrily while slumped back into his seat, and in retaliation, he hurls his drink at her. Witnessing this, Forrest approaches the man, seizes him, and forcefully throws him to the ground. Another man attempts to grab Forrest, but Forrest effortlessly pushes him down as well. Without hesitation, Forrest then climbs up onto the stage, scoops Jenny up, still holding her guitar, and begins to carry her away. Jenny, however, struggles against his grasp and successfully frees herself from his hold. Forrest steps back, taken aback by her resistance as Jenny pushes the guitar towards him. She walks off stage while Forrest, still holding the guitar, trails after her. As Forrest follows Jenny across a bridge outside the nightclub, Jenny pauses, turning to gaze out over the bridge before catching sight of the approaching headlights of a vehicle. Determined, she steps into the street, running and signaling at the vehicle to stop. A pickup truck pulls over, and Jenny, after briefly looking towards the driver, approaches Forrest, then turns back to the driver and finally walks up to Forrest once more. With a last, lingering look at Forrest, Jenny makes her decision and climbs into the truck, leaving Forrest standing in the dim light of the street."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A large black recruit with a strange look, much like Forrest's, makes room for him as he takes a seat. Bubba hands Forrest a handkerchief, and they shake hands. Bubba's mother and grandmother, both in a cook's uniform, serve bowls of shrimp to a wealthy white man. Meanwhile, the recruits, including Forrest, assemble their rifles at the base of their bunks. As Forrest finishes, the Drill Sergeant acknowledges his speed and moves on while Bubba continues discussing shrimp. Together, Bubba and Forrest polish their boots and scrub the floor with toothbrushes. Later, they lie quietly in their bunks. A private tosses a Playboy magazine onto Forrest, who is startled to find Jenny posing inside. In his army uniform, Forrest enters a club's foyer. As Jenny performs on stage, a man tosses his drink on her after being kicked. Forrest intervenes, tossing the man to the ground and shoving another away. He then climbs on stage, picks up Jenny and her guitar, but she breaks free and walks off, leaving Forrest holding the guitar. He follows her outside, over a bridge, where Jenny flags down a pickup truck. She exchanges looks with Forrest before climbing into the truck and departing."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A large black recruit with a strange look on his face, much like Forrest's, looks up from his seat, and Bubba, whose real name is Benjamin Buford Blue and who hails from Bayou La Batre, Alabama, moves his case over, making room for Forrest to sit down. Bubba hands Forrest a handkerchief, an item often used by soldiers to wipe sweat or clean their hands in the field, and they shake hands. Bubba's mother, a robust woman in a cook's uniform, carries a bowl of shrimp, a staple of Southern cuisine especially prominent in Gulf regions, into a dining room and sets it down on a table in front of a wealthy white man. Bubba's grandmother also carries a bowl of shrimp into a dining room, reflecting a family tradition, and sets it down on a table in front of a wealthy white man. The Drill Sergeant, a figure who embodies discipline and authority in military training, moves down the line to the next man while the recruits sit at the base of their bunks assembling their rifles, a standard practice in boot camp to ensure proficiency with their weapons. Bubba speaks to Forrest as Forrest finishes assembling his rifle with remarkable speed while the other recruits are still working on theirs. The Drill Sergeant rushes up to Forrest, looks at his stopwatch, impressed by Forrest's quick completion, and then walks away as Forrest begins to disassemble his rifle, showcasing his aptitude. Bubba continues talking about shrimp, listing all the ways to cook and serve it, in his slow southern drawl as Bubba and Forrest shine their boots, a task emphasizing discipline and attention to detail in the army. They are on their hands and knees scrubbing the floor with toothbrushes, a method used in the military to teach thoroughness and humility. Later, Bubba lies in his bunk and looks up quietly, dreaming perhaps of his future shrimping business, and Forrest also lies in his bunk and looks up. A young private tosses a Playboy magazine onto Forrest, an item often popular among soldiers for its entertainment, who picks it up and turns the page, revealing Jenny, the girl from Forrest's past, as she poses with a school sweater on, and that's all. Forrest looks up with shock, cranes his head up for a closer look, then in his army uniform, displaying his transition into military life, steps into the foyer of the club. The EMCEE steps out onto the stage, and the men laugh, creating an atmosphere of leisure and entertainment. Jenny kicks a man's hand, and he yells angrily as he sits back down, then tosses his drink on her, a disrespectful act reflecting the challenges she faces. Forrest walks up to the man and grabs him, displaying his protective nature, tossing him to the ground. Another man tries to grab Forrest, but Forrest shoves him down too, demonstrating his physical strength. Forrest climbs up onto the stage, picks Jenny up, guitar and all, determined to rescue her, and carries her, but Jenny struggles and frees herself, asserting her independence. Forrest steps back in surprise, and Jenny shoves the guitar at him, a symbol of her life as a performer. Jenny walks off as Forrest holds the guitar and follows after her, still wanting to help. Forrest follows Jenny over a bridge outside the nightclub, a symbolic crossing from one stage of life to another, and Jenny turns and looks over the bridge, then at the light of an approaching vehicle. She steps into the street, runs, and flags down the approaching vehicle, seeking an escape. A pickup truck, a common sight in rural America, pulls over as Jenny looks at the driver, walks toward Forrest, looks at the driver again, evaluating her options, and then walks up to Forrest. Jenny takes a last look at Forrest, filled with the weight of their history, and then climbs into the truck, moving toward an uncertain future."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "A large black recruit with a strange look on his face much like Forrest's looks up from his seat and Bubba moves his case over making room for Forrest to sit down. Bubba hands Forrest a handkerchief and they shake hands. Bubba's mother a robust woman in a cook's uniform carries a bowl of shrimp into a dining room and sets it down on a table in front of a wealthy white man. Bubba's grandmother also carries a bowl of shrimp into a dining room and sets it down on a table in front of a wealthy white man. The Drill Sergeant moves down the line to the next man while the recruits sit at the base of their bunks assembling their rifles. Bubba speaks to Forrest as Forrest finishes assembling his rifle while the other recruits are still working on theirs. The Drill Sergeant rushes up to Forrest looks at his stopwatch and then walks away as Forrest begins to disassemble his rifle. Bubba continues talking about shrimp in his slow southern drawl as Bubba and Forrest shine their boots. They are on their hands and knees scrubbing the floor with toothbrushes. Later Bubba lies in his bunk and looks up quietly and Forrest also lies in his bunk and looks up. A young private tosses a Playboy magazine onto Forrest who picks it up and turns the page revealing Jenny as she poses with a school sweater on and that is all. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Forrest looks up with shock cranes his head up for a closer look then in his army uniform steps into the foyer of the club. The EMCEE steps out onto the stage and the men laugh. Jenny kicks a man's hand and he yells angrily as he sits back down then tosses his drink on her. Forrest walks up to the man and grabs him tossing him to the ground. Another man tries to grab Forrest but Forrest shoves him down too. Forrest climbs up onto the stage picks Jenny up guitar and all and carries her but Jenny struggles and frees herself. Forrest steps back in surprise and Jenny shoves the guitar at him. Jenny walks off as Forrest holds the guitar and follows after her. Forrest follows Jenny over a bridge outside the nightclub and Jenny turns and looks over the bridge then at the light of an approaching vehicle. She steps into the street runs and flags down the approaching vehicle. A pickup truck pulls over as Jenny looks at the driver walks toward Forrest looks at the driver again and then walks up to Forrest. Jenny takes a last look at Forrest and then climbs into the truck."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "A large black recruit with a strange look on his face much like Forrest's looks up from his seat and Bubba moves his case over making room for Forrest to sit down. Bubba hands Forrest a handkerchief and they shake hands. Bubba's mother a robust woman in a cook's uniform carries a bowl of shrimp into a dining room and sets it down on a table in front of a wealthy white man. Bubba's grandmother also carries a bowl of shrimp into a dining room and sets it down on a table in front of a wealthy white man. The Drill Sergeant moves down the line to the next man while the recruits sit at the base of their bunks assembling their rifles. Bubba speaks to Forrest as Forrest finishes assembling his rifle while the other recruits are still working on theirs. The Drill Sergeant rushes up to Forrest looks at his stopwatch and then walks away as Forrest begins to disassemble his rifle. Bubba continues talking about shrimp in his slow southern drawl as Bubba and Forrest shine their boots. They are on their hands and knees scrubbing the floor with toothbrushes. Later Bubba lies in his bunk and looks up quietly and Forrest also lies in his bunk and looks up. A young private tosses a Playboy magazine onto Forrest who picks it up and turns the page revealing Jenny as she poses with a school sweater on and that is all. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Forrest looks up with shock cranes his head up for a closer look then in his army uniform steps into the foyer of the club. The EMCEE steps out onto the stage and the men laugh. Jenny kicks a man's hand and he yells angrily as he sits back down then tosses his drink on her. Forrest walks up to the man and grabs him tossing him to the ground. Another man tries to grab Forrest but Forrest shoves him down too. Forrest climbs up onto the stage picks Jenny up guitar and all and carries her but Jenny struggles and frees herself. Forrest steps back in surprise and Jenny shoves the guitar at him. Jenny walks off as Forrest holds the guitar and follows after her. Forrest follows Jenny over a bridge outside the nightclub and Jenny turns and looks over the bridge then at the light of an approaching vehicle. She steps into the street runs and flags down the approaching vehicle. A pickup truck pulls over as Jenny looks at the driver walks toward Forrest looks at the driver again and then walks up to Forrest. Jenny takes a last look at Forrest and then climbs into the truck."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "A large black recruit with a strange look on his face much like Forrest's looks up from his seat and Bubba moves his case over making room for Forrest to sit down. Bubba hands Forrest a handkerchief and they shake hands. Bubba's mother a robust woman in a cook's uniform carries a bowl of shrimp into a dining room and sets it down on a table in front of a wealthy white man. Bubba's grandmother also carries a bowl of shrimp into a dining room and sets it down on a table in front of a wealthy white man. The Drill Sergeant moves down the line to the next man while the recruits sit at the base of their bunks assembling their rifles. Bubba speaks to Forrest as Forrest finishes assembling his rifle while the other recruits are still working on theirs. Forrest steps back in surprise and Jenny shoves the guitar at him. Jenny walks off as Forrest holds the guitar and follows after her. Forrest follows Jenny over a bridge outside the nightclub and Jenny turns and looks over the bridge then at the light of an approaching vehicle. She steps into the street runs and flags down the approaching vehicle. A pickup truck pulls over as Jenny looks at the driver walks toward Forrest looks at the driver again and then walks up to Forrest. Jenny takes a last look at Forrest and then climbs into the truck."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "A large black recruit with a strange look on his face much like Forrest's looks up from his seat and Bubba moves his case over making room for Forrest to sit down. Bubba hands Forrest a handkerchief and they shake hands. She steps into the street runs and flags down the approaching vehicle. A pickup truck pulls over as Jenny looks at the driver walks toward Forrest looks at the driver again and then walks up to Forrest. Jenny takes a last look at Forrest and then climbs into the truck."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "A gigantic orange feline with an odd grin on its snout, much like Gerald's, glances over from its perch, and Luna nudges her basket aside, carving out space for Gerald to settle in. Luna tosses Gerald a feather, and they bump paws. Luna's uncle, a slender man in a gardener's gear, wheels a cart of apples into a garage and parks it beside a curious young girl. Luna's aunt likewise wheels a cart of apples into a garage and parks it beside a curious young girl. The Fireman strolls down the aisle to the next person while the felines lounge at the foot of their baskets, assembling their puzzles. Luna chats with Gerald as Gerald concludes assembling his puzzle while the other felines continue working on theirs. The Fireman jogs up to Gerald, glances at his compass, and then strolls away as Gerald begins to dismantle his puzzle. Luna keeps chatting about apples in her slow northern accent as Luna and Gerald polish their helmets. They are on their paws and knees shampooing the carpet with mops. Later, Luna snoozes in her basket and gazes up silently, and Gerald also snoozes in his basket and gazes up. A youthful owl tosses a comic book onto Gerald, who lifts it and flips the page, revealing Daisy as she strikes a pose with a garden apron on, and that's all. Gerald glances up with awe, cranes his neck for a better view, then in his sailor outfit, saunters into the hallway of the barn. The CLOWN struts out onto the podium, and the creatures chuckle. Daisy jabs a creature's paw, and it screeches indignantly as it slouches back, then splashes its juice on her. Gerald strides up to the creature and snatches it, flinging it into the hay. Another creature attempts to clutch Gerald, but Gerald shoves it aside too. Gerald clambers up onto the podium, scoops Daisy up, ukulele and all, and hoists her, but Daisy squirms and breaks free. Gerald stumbles back in shock, and Daisy shoves the ukulele at him. Daisy strides off as Gerald clutches the ukulele and trails after her. Gerald trails Daisy across a pier outside the theater, and Daisy twirls and gazes across the pier, then at the glow of a nearing bicycle. She strides into the lane, dashes, and waves down the nearing bicycle. A sedan pauses as Daisy glances at the rider, strides toward Gerald, glances at the rider again, and then strides up to Gerald. Daisy takes a final glimpse at Gerald and then climbs onto the sedan."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Forrest sits down next to Bubba, a fellow recruit with a peculiar expression, and they exchange handshakes. Bubba's family, portrayed as cooks, serve shrimp to wealthy men. During training, Forrest skillfully assembles his rifle faster than others, impressing the Drill Sergeant. Bubba discusses shrimp with Forrest while they clean boots and floors. In their bunks, a Playboy magazine reveals Jenny posing, shocking Forrest. Later, at a club, Jenny is harassed by men, prompting Forrest to intervene and carry her offstage, though she resists. Outside, Jenny flags down a truck, says a final goodbye to Forrest, and departs."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Jenny takes a last look at Forrest and then climbs into the truck A pickup truck pulls over as Jenny looks at the driver walks toward Forrest looks at the driver again and then walks up to Forrest She steps into the street runs and flags down the approaching vehicle Forrest follows Jenny over a bridge outside the nightclub and Jenny turns and looks over the bridge then at the light of an approaching vehicle Jenny walks off as Forrest holds the guitar and follows after her Forrest steps back in surprise and Jenny shoves the guitar at him Forrest climbs up onto the stage picks Jenny up guitar and all and carries her but Jenny struggles and frees herself Another man tries to grab Forrest but Forrest shoves him down too Forrest walks up to the man and grabs him tossing him to the ground Jenny kicks a man's hand and he yells angrily as he sits back down then tosses his drink on her The EMCEE steps out onto the stage and the men laugh Forrest looks up with shock cranes his head up for a closer look then in his army uniform steps into the foyer of the club A young private tosses a Playboy magazine onto Forrest who picks it up and turns the page revealing Jenny as she poses with a school sweater on and that is all Later Bubba lies in his bunk and looks up quietly and Forrest also lies in his bunk and looks up They are on their hands and knees scrubbing the floor with toothbrushes Bubba continues talking about shrimp in his slow southern drawl as Bubba and Forrest shine their boots The Drill Sergeant rushes up to Forrest looks at his stopwatch and then walks away as Forrest begins to disassemble his rifle Bubba speaks to Forrest as Forrest finishes assembling his rifle while the other recruits are still working on theirs The Drill Sergeant moves down the line to the next man while the recruits sit at the base of their bunks assembling their rifles Bubba's grandmother also carries a bowl of shrimp into a dining room and sets it down on a table in front of a wealthy white man Bubba's mother a robust woman in a cook's uniform carries a bowl of shrimp into a dining room and sets it down on a table in front of a wealthy white man Bubba hands Forrest a handkerchief and they shake hands A large black recruit with a strange look on his face much like Forrest's looks up from his seat and Bubba moves his case over making room for Forrest to sit down"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Bubba hands Forrest a handkerchief and they shake hands A large black recruit with a strange look on his face much like Forrest's looks up from his seat and Bubba moves his case over making room for Forrest to sit down Bubba's grandmother also carries a bowl of shrimp into a dining room and sets it down on a table in front of a wealthy white man Bubba's mother a robust woman in a cook's uniform carries a bowl of shrimp into a dining room and sets it down on a table in front of a wealthy white man Bubba speaks to Forrest as Forrest finishes assembling his rifle while the other recruits are still working on theirs The Drill Sergeant moves down the line to the next man while the recruits sit at the base of their bunks assembling their rifles Bubba continues talking about shrimp in his slow southern drawl as Bubba and Forrest shine their boots The Drill Sergeant rushes up to Forrest looks at his stopwatch and then walks away as Forrest begins to disassemble his rifle Later Bubba lies in his bunk and looks up quietly and Forrest also lies in his bunk and looks up They are on their hands and knees scrubbing the floor with toothbrushes Forrest looks up with shock cranes his head up for a closer look then in his army uniform steps into the foyer of the club A young private tosses a Playboy magazine onto Forrest who picks it up and turns the page revealing Jenny as she poses with a school sweater on and that is all Jenny kicks a man's hand and he yells angrily as he sits back down then tosses his drink on her The EMCEE steps out onto the stage and the men laugh Another man tries to grab Forrest but Forrest shoves him down too Forrest walks up to the man and grabs him tossing him to the ground Forrest steps back in surprise and Jenny shoves the guitar at him Forrest climbs up onto the stage picks Jenny up guitar and all and carries her but Jenny struggles and frees herself Forrest follows Jenny over a bridge outside the nightclub and Jenny turns and looks over the bridge then at the light of an approaching vehicle Jenny walks off as Forrest holds the guitar and follows after her A pickup truck pulls over as Jenny looks at the driver walks toward Forrest looks at the driver again and then walks up to Forrest She steps into the street runs and flags down the approaching vehicle Jenny takes a last look at Forrest and then climbs into the truck"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The EMCEE steps out onto the stage and the men laugh Jenny kicks a man's hand and he yells angrily as he sits back down then tosses his drink on her Forrest walks up to the man and grabs him tossing him to the ground Another man tries to grab Forrest but Forrest shoves him down too Forrest climbs up onto the stage picks Jenny up guitar and all and carries her but Jenny struggles and frees herself Forrest steps back in surprise and Jenny shoves the guitar at him Jenny walks off as Forrest holds the guitar and follows after her Forrest follows Jenny over a bridge outside the nightclub and Jenny turns and looks over the bridge then at the light of an approaching vehicle She steps into the street runs and flags down the approaching vehicle A pickup truck pulls over as Jenny looks at the driver walks toward Forrest looks at the driver again and then walks up to Forrest Jenny takes a last look at Forrest and then climbs into the truck A large black recruit with a strange look on his face much like Forrest's looks up from his seat and Bubba moves his case over making room for Forrest to sit down Bubba hands Forrest a handkerchief and they shake hands Bubba's mother a robust woman in a cook's uniform carries a bowl of shrimp into a dining room and sets it down on a table in front of a wealthy white man Bubba's grandmother also carries a bowl of shrimp into a dining room and sets it down on a table in front of a wealthy white man The Drill Sergeant moves down the line to the next man while the recruits sit at the base of their bunks assembling their rifles Bubba speaks to Forrest as Forrest finishes assembling his rifle while the other recruits are still working on theirs The Drill Sergeant rushes up to Forrest looks at his stopwatch and then walks away as Forrest begins to disassemble his rifle Bubba continues talking about shrimp in his slow southern drawl as Bubba and Forrest shine their boots They are on their hands and knees scrubbing the floor with toothbrushes Later Bubba lies in his bunk and looks up quietly and Forrest also lies in his bunk and looks up A young private tosses a Playboy magazine onto Forrest who picks it up and turns the page revealing Jenny as she poses with a school sweater on and that is all Forrest looks up with shock cranes his head up for a closer look then in his army uniform steps into the foyer of the club"
        }
      ]
    }
  ]
}