{
  "ground_truth": "Karen hands Mitch the phone, and reluctantly, Mitch answers it. As Mitch hangs up, he looks troubled. Walt stares into the distance with a frown and looks down at some hospital admission forms and test results. During the day, Thao carries a bundle of garden waste out to the front of his house while Walt watches from his porch as Spider's car comes slowly down the street. Thao sees it and goes back into the garden. Walt lights a cigarette as the modified Honda cruises slowly by. Smokie stares out of the car, and Walt mimes shooting him, to which Smokie responds by giving him the finger. Thao watches the exchange of gestures. Later, Walt opens his front door to Thao, and Walt is working under the sink in Thao's kitchen as the ceiling fan gyrates unsteadily. In his garage, Walt works on the fan with Thao, who folds his arms. Walt doubles up, and Thao sees he's coughed up blood. Thao nods at the Gran Torino, and Walt follows his gaze to the green V8 muscle car. Thao nods, and Walt grins. Down in his basement, Walt is busy moving an old freezer on a sack truck, attempts to get it up the stairs, but finds it hard going, and tugs away, then gives it up as a bad job. Thao opens his door to Walt, and they go down to Walt's basement, where they heave the freezer up the steps and get it outside. Thao rubs his neck. Sue finds Walt on his back porch as Thao washes the Gran Torino on the drive. She shrugs, then glances at Thao and goes to get one. Walt looks over at Thao. Later, he watches Thao working in the garden, gets a cigarette, and a lighter. Thao and Walt get out of his pickup truck and go in the barber shop. Thao goes out and comes straight back in. A gun. Martin takes a seat, and Thao comes back in. Walt and Thao drive up to a building site in Walt's old white Ford pickup, park up, and wear work gloves. They leave Tim's portacabin, and Tim sits back down at his desk. Walt's pickup truck pulls up outside C.M. Young Hardware and Lumber Store. Walt and Thao get out, go inside, and look around. Walt makes his way over to a shelf with what he's looking for, a tape measure, and a tool bag. Walt holds his hand out, and Thao shakes it. As they head off, Walt winces slightly, and carrying his new stuff, Thao gets off a bus and jogs down a back alley heading home. As he trots along, he sees Spider's Honda coming the other way. The car pulls up, and Spider and his four cronies get out, with Smokie stubbing a cigarette out on Thao's cheek.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Karen hands Mitch the telephone, and reluctantly, Mitch answers it. As Mitch hangs up, he appears troubled. Walt gazes into the distance with a scowl and looks down at some hospital admission documents and exam results. During the day, Thao carries a bundle of garden refuse out to the front of his dwelling while Walt watches from his porch as Spider's automobile comes slowly down the street. Thao sees it and goes back into the garden. Walt lights a cigarette as the modified Honda glides slowly by. Smokie stares out of the car, and Walt mimes shooting him, to which Smokie responds by giving him the finger. Thao observes the exchange of gestures. Later, Walt opens his front door to Thao, and Walt is working under the sink in Thao's kitchen as the ceiling fan rotates unsteadily. In his garage, Walt works on the fan with Thao, who crosses his arms. Walt doubles up, and Thao sees he's coughed up blood. Thao nods at the Gran Torino, and Walt follows his gaze to the green V8 muscle vehicle. Thao nods, and Walt grins. Down in his basement, Walt is busy moving an old freezer on a sack truck, attempts to get it up the stairs, but finds it hard going, and pulls away, then gives it up as a bad job. Thao opens his door to Walt, and they go down to Walt's basement, where they hoist the freezer up the steps and get it outside. Thao rubs his neck. Sue finds Walt on his back porch as Thao washes the Gran Torino on the drive. She shrugs, then glances at Thao and goes to get one. Walt looks over at Thao. Later, he watches Thao working in the garden, gets a cigarette, and a lighter. Thao and Walt get out of his pickup truck and enter the barbershop. Thao goes out and comes straight back in. A weapon. Martin takes a seat, and Thao comes back in. Walt and Thao drive up to a construction site in Walt's old white Ford pickup, park up, and wear work gloves. They leave Tim's portacabin, and Tim sits back down at his desk. Walt's pickup truck pulls up outside C.M. Young Hardware and Lumber Store. Walt and Thao get out, go inside, and look around. Walt makes his way over to a shelf with what he's looking for, a tape measure, and a tool bag. Walt holds his hand out, and Thao shakes it. As they head away, Walt winces slightly, and carrying his new stuff, Thao gets off a bus and jogs down a back alley heading home. As he trots along, he sees Spider's Honda coming the other way. The car pulls up, and Spider and his four cronies get out, with Smokie stubbing a cigarette out on Thao's cheek."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Karen hands the phone to Mitch, and reluctantly, it is answered by him. After the phone call, Mitch looks troubled as he hangs up. The distance is stared into by Walt with a frown, and some hospital admission forms and test results are looked down at by him. During the day, a bundle of garden waste is carried by Thao out to the front of his house while Walt watches from his porch as Spider's car slowly comes down the street. It is seen by Thao, and he goes back into the garden. A cigarette is lit by Walt as the modified Honda cruises slowly by. Smokie stares out of the car, and a shooting mime is performed by Walt towards him, to which Smokie responds by giving him the finger. The exchange of gestures is watched by Thao. Later, Thao opens his front door to Walt, and under the sink in Thao's kitchen, Walt works as the ceiling fan unsteadily gyrates. In his garage, the fan is worked on by Walt with Thao, who folds his arms. Walt doubles up, and blood that he's coughed up is seen by Thao. A nod is given by Thao at the Gran Torino, and Walt's gaze follows to the green V8 muscle car. A nod is given by Thao, and a grin is given by Walt. Down in his basement, an old freezer on a sack truck is moved by Walt, and an attempt is made to get it up the stairs, but it is found hard going, and after tugging away, it is given up as a bad job by him. Thao opens his door to Walt, and they go down to Walt's basement, where the freezer is heaved up the steps by them and gets outside. Thao rubs his neck. Walt is found on his back porch by Sue as the Gran Torino is washed by Thao on the drive. A shrug is given by her, then she glances at Thao and goes to get one. Thao is looked over at by Walt. Later, Thao is watched working in the garden by him, he gets a cigarette and a lighter. Thao and Walt get out of his pickup truck and go in the barber shop. Out goes Thao and straight back in he comes. A gun is seen. A seat is taken by Martin, and Thao comes back in. Up to a building site drive Walt and Thao in Walt's old white Ford pickup, they park up, and work gloves are worn. Tim's portacabin is left by them, and Tim sits back down at his desk. Outside C.M. Young Hardware and Lumber Store, Walt's pickup truck pulls up. Inside go Walt and Thao, and they look around. A shelf with what he's looking for, a tape measure, and a tool bag is made his way over to by Walt. His hand is held out by Walt, and a handshake is given by Thao. As they head off, a slight wince is given by Walt, and carrying his new stuff, Thao gets off a bus and jogs down a back alley heading home. As he trots along, Spider's Honda is seen coming the other way by him. The car pulls up, and Spider and his four cronies get out, with a cigarette being stubbed out on Thao's cheek by Smokie."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Karen hands Mitch the phone, and Mitch reluctantly answers. After hanging up, he looks troubled. Walt frowns at hospital admission forms and test results. Thao takes garden waste to the front of his house while Walt watches from his porch, seeing Spider's car approach. Thao retreats to the garden. Walt lights a cigarette as the Honda cruises by, and mimes shooting Smokie, who responds with a rude gesture. Thao observes. Walt later opens his door to Thao and works under the sink in Thao's kitchen as the ceiling fan wobbles. In his garage, Walt repairs the fan with Thao, then doubles over, revealing he's coughed up blood. Thao motions to the Gran Torino, and Walt grins. In his basement, Walt struggles to move an old freezer up the stairs. Thao helps, and they manage to get it outside. Sue finds Walt on his porch as Thao washes the Gran Torino. She shrugs, looks at Thao, and goes to get something. Walt later watches Thao in the garden and lights a cigarette. Thao and Walt visit a barber shop, and Thao briefly exits, then returns. Walt and Thao drive to a building site in Walt's old pickup, wearing work gloves. They leave Tim's portacabin, and Walt's truck arrives at a hardware store. Inside, Walt finds a tape measure and tool bag. He shakes Thao's hand, winces slightly, and Thao heads home with the new items. On his way, he encounters Spider's Honda, and Smokie extinguishes a cigarette on Thao's cheek."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Karen passes the phone to Mitch, who reluctantly answers. After hanging up, Mitch looks troubled. Walt frowns at hospital admission forms and test results. Thao carries garden waste to the front of his house, observed by Walt from his porch as Spider's car slowly passes. Thao returns to the garden. Walt lights a cigarette, mimics shooting at Smokie, who responds with a rude gesture while Thao watches. Later, Thao lets Walt into his house, where Walt works on a fan in Thao's kitchen. Walt then coughs up blood, which catches Thao's attention. Noticing the Gran Torino, Thao nods, and Walt grins. Walt struggles to move a freezer upstairs in his basement, but Thao helps, and they get it outside. Sue finds Walt on his porch as Thao washes the Gran Torino. Walt gets a cigarette and a lighter while watching Thao in the garden. Together, they visit a barbershop and a building site, and then stop at C.M. Young Hardware and Lumber Store, where Walt buys tools. Thao shakes Walt's hand; carrying new tools, Thao jogs home, seeing Spider's Honda. Spider and his cronies exit, with Smokie stubbing a cigarette on Thao's cheek."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Karen, with a hint of hesitation, hands Mitch the phone, and, though reluctant, Mitch accepts the call and answers it. As the call concludes and Mitch hangs up, a look of concern settles on his face, indicating something troubling. Meanwhile, Walt stands nearby, staring off into the distance with a thoughtful frown etched on his face. He then gazes down at a stack of hospital admission forms and test results, which seem to weigh heavily on his mind. \n\nDuring the bright and active day, Thao is busy carrying a hefty bundle of garden waste out to the front area of his house. Walt observes from the comfort of his porch, watching intently as Spider’s car slowly makes its way down the street. Upon noticing the car, Thao promptly retreats back into his garden. Walt, standing calmly, lights a cigarette as the modified Honda cruises leisurely by. From inside the car, Smokie stares out, and in a bold gesture, Walt pretends to shoot at him with his fingers. Smokie, unfazed, responds by giving Walt the finger. Thao, observing this subtle yet charged exchange of gestures, takes it all in.\n\nLater on, Walt opens his front door to Thao, and soon, Walt is diligently working under the sink in Thao’s kitchen. Above, the ceiling fan spins unsteadily. In the garage, Walt is busy working on the fan, with Thao standing nearby, arms folded. Suddenly, Walt doubles over, and Thao notices he has coughed up blood. Thao gives a nod towards the Gran Torino, and Walt, following Thao's gaze, looks at the striking green V8 muscle car. Thao nods again, prompting Walt to grin in response.\n\nDown in his cluttered basement, Walt is hard at work moving an old, cumbersome freezer on a sack truck. He attempts to maneuver it up the stairs, but the task proves difficult and exhausting. Despite his efforts, he eventually admits defeat and decides to abandon the task as a lost cause. Thao then opens his door to Walt, and together they venture down to Walt’s basement, where they manage to hoist the freezer up the steps and successfully get it outside. As they finish, Thao rubs his neck, feeling the strain.\n\nLater, Sue finds Walt relaxing on his back porch while Thao diligently washes the Gran Torino in the driveway. She shrugs nonchalantly, glances over at Thao, and goes off to get something. Walt continues to watch Thao, and a bit later, sees Thao working industriously in the garden. Feeling the need for a break, Walt reaches for a cigarette and a lighter. \n\nAfter some time, Thao and Walt climb out of his pickup truck and enter a local barbershop. Thao briefly steps outside but quickly returns, holding a gun, leaving a palpable tension in the air. Martin, already inside, takes a seat, and Thao reenters. Walt and Thao then drive to a construction site in Walt’s old white Ford pickup truck, park, and put on their work gloves, signaling it's time for some hard work. After leaving Tim’s portacabin, with Tim settling back down at his desk, Walt’s pickup truck pulls up outside C.M. Young Hardware and Lumber Store. Walt and Thao exit the vehicle, go inside, and begin to look around. Walt makes his way to a particular shelf, finding exactly what he’s after: a tape measure and a tool bag. Walt extends his hand, and Thao shakes it as a gesture of agreement or understanding. As they leave, Walt winces slightly, but manages to brush it off. Carrying his new supplies, Thao gets off a bus and jogs down a back alley, heading towards home. While he trots along, he notices Spider’s Honda approaching from the opposite direction. The car comes to a stop, and Spider, along with his four cronies, step out. Smokie, with a menacing air, extinguishes a cigarette on Thao’s cheek, leaving an unforgettably painful mark."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Karen, with a slight hint of hesitation in her demeanor, cautiously hands Mitch the phone. Though clearly reluctant, Mitch accepts the incoming call and proceeds to answer it. As the call reaches its conclusion and Mitch hangs up, a look of deep concern gradually settles on his face, indicating something troubling has transpired during the conversation. Meanwhile, Walt is positioned nearby, standing in silence, and he stares into the distance with a thoughtful frown etched deeply on his face. He then directs his gaze down at a stack of hospital admission forms and test results, which appear to weigh heavily on his mind and thoughts. \n\nDuring the bright and active day, Thao is occupied with the task of carrying a hefty and unwieldy bundle of garden waste out to the front area of his house. Walt, observing from the comfort of his porch, watches intently as Spider’s car slowly makes its way down the street. Upon noticing the approaching car, Thao promptly retreats back into the safety of his garden. Walt, standing calmly with a composed demeanor, lights a cigarette as the modified Honda cruises leisurely by. From inside the car, Smokie stares out, and in a bold gesture, Walt pretends to shoot at him with his fingers. Smokie, unfazed and undeterred, responds by giving Walt the finger. Thao, observing this subtle yet charged exchange of gestures, takes it all in and reflects on the tense interaction.\n\nLater on, Walt opens his front door to Thao, inviting him inside, and soon after, Walt is diligently working under the sink in Thao’s kitchen. Above him, the ceiling fan spins unsteadily in a wobbly and unpredictable manner. In the garage, Walt is busy and focused on working on the fan, with Thao standing nearby, arms folded across his chest. Suddenly, Walt bends over, doubling over in discomfort, and Thao notices with alarm that Walt has coughed up blood. Thao gives a nod towards the Gran Torino, and Walt, following Thao's gaze, looks at the striking green V8 muscle car. Thao nods again, prompting Walt to grin in response, sharing a moment of understanding.\n\nDown in his cluttered basement, Walt is hard at work with the arduous task of moving an old, cumbersome freezer on a sack truck. He attempts to maneuver it up the narrow stairs, but the task proves to be difficult and exhausting. Despite his determined efforts, he eventually admits defeat and decides to abandon the task as a lost cause. Thao then opens his door to Walt, and together they venture down to Walt’s basement. Working in unison, they manage to hoist the freezer up the steps and successfully get it outside, completing the challenging endeavor. As they finish, Thao rubs his neck, feeling the strain from the effort.\n\nLater, Sue finds Walt relaxing and enjoying a moment of peace on his back porch while Thao is diligently washing the Gran Torino in the driveway. She shrugs nonchalantly, glances over at Thao, and then goes off to retrieve something. Walt continues to watch Thao, and a bit later, he sees Thao working industriously in the garden. Feeling the need for a brief rest, Walt reaches for a cigarette and a lighter, taking a much-needed break.\n\nAfter some time has passed, Thao and Walt climb out of his trusty pickup truck and enter a local barbershop. Thao briefly steps outside but quickly returns, holding a gun, which leaves a palpable tension hanging in the air. Martin, who is already inside, takes a seat, and Thao reenters just moments later. Walt and Thao then drive to a construction site in Walt’s old white Ford pickup truck, park the vehicle, and put on their work gloves, signaling that it's time to engage in some hard work. After leaving Tim’s portacabin, with Tim settling back down comfortably at his desk, Walt’s pickup truck pulls up outside C.M. Young Hardware and Lumber Store. Walt and Thao exit the vehicle, go inside, and begin to look around the store. Walt makes his way to a particular shelf, finding exactly what he’s after: a tape measure and a tool bag. Walt then extends his hand, and Thao shakes it as a gesture of agreement or understanding. As they leave, Walt winces slightly, but he manages to brush it off. Carrying his new supplies, Thao gets off a bus and jogs down a back alley, heading towards his home. While he trots along, he notices Spider’s Honda approaching from the opposite direction. The car comes to a stop, and Spider, along with his four cronies, step out of the vehicle. Smokie, with a menacing air, extinguishes a cigarette on Thao’s cheek, leaving an unforgettably painful mark and a lasting impression."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Karen extends her hand, offering the phone to Mitch, who hesitates momentarily before reluctantly accepting it. As soon as Mitch concludes the phone conversation, he gently places the phone back down and his expression becomes visibly troubled. Meanwhile, Walt, who is nearby, stares pensively into the distance, his brow furrowing as he contemplates, before shifting his gaze down to peruse the hospital admission forms and test results spread out before him. As the sun moves across the sky, indicating the progression of the day, Thao emerges from his house, carefully balancing a bundle of garden waste in his arms as he makes his way to the front yard. Walt, seated comfortably on his porch, watches with a keen eye as Spider's car slowly meanders down the street. Thao notices the approaching vehicle and retreats swiftly back into the garden. Walt, observing the scene unfold, casually retrieves a cigarette and lights it as the modified Honda creeps past his line of sight. Inside the car, Smokie peers out the window, locking eyes with Walt, who playfully mimics shooting at him with his fingers. Smokie, unfazed, retaliates with a crude hand gesture. Thao stands nearby, witnessing the entire exchange of signals between the two men. As the day progresses, the scene shifts to Walt opening his front door to find Thao standing there. They proceed together into Thao's kitchen, where Walt crouches beneath the sink, engrossed in some repairs, while above, an unstable ceiling fan gyrates noisily. Later, inside Walt's garage, he focuses on fixing the fan, with Thao standing by, his arms folded across his chest. In a moment of weakness, Walt doubles over in a coughing fit, and Thao notices the alarming presence of blood. Thao glances meaningfully at the Gran Torino, leading Walt's eyes to follow and land on the gleaming green V8 muscle car. Thao's subtle nod prompts a grin to spread across Walt's face. Down in the dim confines of his basement, Walt busies himself maneuvering an antiquated freezer onto a sack truck, attempting to haul it up the stairs, but the task proves too strenuous, and after several attempts, he concedes defeat. Thao, later, opens his door to Walt's arrival, and together they descend into Walt's basement. They combine their efforts, bracing themselves as they laboriously heft the freezer up the steps and out into the sunlight. Thao pauses for a moment to rub the tension from his neck. Elsewhere, on Walt's back porch, Sue discovers him while Thao diligently washes the Gran Torino parked in the driveway. She offers a nonchalant shrug, casts a glance at Thao, and decisively sets off to fetch something. Walt briefly looks over at Thao. In a later scene, Walt observes Thao as he industriously tends to the garden, prompting him to retrieve a cigarette and lighter. In a subsequent outing, Thao and Walt alight from his pickup truck, making their way to a barbershop. Thao momentarily steps outside before promptly returning indoors. A gun. Martin, another patron, takes a seat as Thao re-enters. Shifting locations once more, Walt and Thao arrive at a construction site in Walt's aging white Ford pickup. They park the vehicle, don their work gloves, and depart from Tim's portacabin, leaving Tim to settle himself back down at his desk. The pickup truck then halts outside C.M. Young Hardware and Lumber Store, where Walt and Thao disembark, step inside, and begin to explore the aisles. Walt navigates toward a specific shelf, pinpointing and retrieving a tape measure along with a tool bag. Upon completing his purchase, Walt extends his hand towards Thao, who reaches out to shake it. As they prepare to leave, Walt experiences a fleeting wince of discomfort. Subsequently, Thao, now carrying his newly acquired items, disembarks from a bus and jogs briskly down a secluded back alley, heading towards home. As he maintains his pace, his attention is drawn to Spider's Honda approaching from the opposite direction. The car halts, and Spider emerges alongside his four cronies, with Smokie callously extinguishing a cigarette on Thao's cheek."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Karen hands Mitch the phone, and he reluctantly answers it. After hanging up, Mitch appears troubled while Walt stares distantly and reviews hospital forms and test results. During the day, Thao carries garden waste to the front of his house as Walt watches from his porch. Spider’s car cruises slowly down the street, prompting Thao to retreat into the garden. Walt lights a cigarette and makes a shooting gesture at Smokie in the car, who responds with a rude gesture. Thao observes this exchange. Later, Walt visits Thao’s house, fixing the kitchen sink with him while the ceiling fan wobbles above. In the garage, Walt, working with Thao, starts to cough up blood and looks at the Gran Torino. Thao nods, understanding its significance, and Walt grins in response. In his basement, Walt struggles to move an old freezer up the stairs, eventually giving up. Later, Thao helps Walt maneuver the freezer outside. Sue finds Walt on his back porch, where Thao is washing the Gran Torino. She glances at him and goes inside. Walt then watches Thao working in the garden, fetching a cigarette and lighter. Walt and Thao enter a barber shop after exiting a pickup truck. They leave, visit a building site, and later pull up at C.M. Young Hardware and Lumber Store. Inside, they find the tape measure and tool bag Walt needs. Walt extends his hand to Thao for a handshake, signaling their growing camaraderie. As Thao heads home carrying his new tools, he sees Spider's Honda approaching. The car stops, and Spider along with his cronies, including Smokie, get out, with Smokie extinguishing a cigarette on Thao's cheek."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Karen hands Mitch the phone, and reluctantly, Mitch, who has been anxiously awaiting news from the hospital, answers it. As Mitch hangs up, he looks troubled, likely receiving unsettling information. Walt stares into the distance with a frown, his mind preoccupied with his diagnosis, and looks down at some hospital admission forms and test results detailing his condition. During the day, Thao carries a bundle of garden waste, typical of the community's efforts to maintain their neighborhood, out to the front of his house while Walt watches from his porch as Spider's car, a notorious vehicle known for its loud engine and tinted windows, comes slowly down the street. Thao sees it, recognizing the potential for trouble, and goes back into the garden. Walt lights a cigarette, a habit from his days working at the Ford plant, as the modified Honda cruises slowly by. Smokie stares out of the car, and Walt mimes shooting him, a gesture from his military past, to which Smokie responds by giving him the finger. Thao watches the exchange of gestures, understanding the tension between them. Later, Walt opens his front door to Thao, and Walt is working under the sink in Thao's kitchen, repairing a persistent leak, as the ceiling fan gyrates unsteadily, a relic from a bygone era. In his garage, Walt works on the fan with Thao, who folds his arms, learning how to fix things. Walt doubles up, and Thao sees he's coughed up blood, a painful reminder of Walt’s deteriorating health. Thao nods at the Gran Torino, the prized possession and a source of pride for Walt, and Walt follows his gaze to the green V8 muscle car. Thao nods, and Walt grins, appreciating the shared admiration. Down in his basement, Walt is busy moving an old freezer, a holdover from his family’s past, on a sack truck, attempts to get it up the stairs, but finds it hard going, and tugs away, then gives it up as a bad job. Thao opens his door to Walt, and they go down to Walt's basement, where they heave the freezer up the steps and get it outside, both feeling a sense of accomplishment. Thao rubs his neck, a gesture of weariness. Sue finds Walt on his back porch as Thao washes the Gran Torino on the drive, a task he takes great care in. She shrugs, then glances at Thao and goes to get one of the beers Walt keeps stocked in his fridge. Walt looks over at Thao, seeing the young man growing more responsible. Later, he watches Thao working in the garden, gets a cigarette, and a lighter, finding solace in the routine. Thao and Walt get out of his pickup truck, a reliable Ford from the 1970s, and go into the barber shop, where old friends gather. Thao goes out and comes straight back in, startled by something outside. A gun, visible in someone's waistband, causes alarm. Martin, the barber who knows everyone’s business, takes a seat, and Thao comes back in, looking shaken. Walt and Thao drive up to a building site in Walt's old white Ford pickup, park up, and wear work gloves, prepared to lend a hand. They leave Tim's portacabin, a temporary office at the site, and Tim sits back down at his desk, exhausted from managing the project. Walt's pickup truck pulls up outside C.M. Young Hardware and Lumber Store, a local business known for its wide selection and knowledgeable staff. Walt and Thao get out, go inside, and look around. Walt makes his way over to a shelf with what he's looking for, a tape measure, and a tool bag, essential items for the repairs he plans at home. Walt holds his hand out, and Thao shakes it, a gesture of mutual respect. As they head off, Walt winces slightly, concealing the pain he carries daily, and carrying his new stuff, Thao gets off a bus and jogs down a back alley heading home, following the quickest route he knows. As he trots along, he sees Spider's Honda, identifiable by its distinctive modifications, coming the other way. The car pulls up, and Spider and his four cronies get out, with Smokie stubbing a cigarette out on Thao's cheek, an act of intimidation in their ongoing conflict."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "As he trots along he sees Spider's Honda coming the other way Karen hands Mitch the phone and reluctantly Mitch answers it Thao rubs his neck As Mitch hangs up he looks troubled Walt stares into the distance with a frown and looks down at some hospital admission forms and test results During the day Thao carries a bundle of garden waste out to the front of his house while Walt watches from his porch as Spider's car comes slowly down the street Thao sees it and goes back into the garden Walt lights a cigarette as the modified Honda cruises slowly by Smokie stares out of the car and Walt mimes shooting him to which Smokie responds by giving him the finger Walt makes his way over to a shelf with what he is looking for Thao watches the exchange of gestures Later Walt opens his front door to Thao and Walt is working under the sink in Thao's kitchen as the ceiling fan gyrates unsteadily In his garage Walt works on the fan with Thao who folds his arms Down in his basement Walt doubles up and Thao sees he is coughed up blood Walt's pickup truck pulls up outside Thao nods at the Gran Torino and Walt follows his gaze to the green V8 muscle car Thao nods and Walt grins Sue finds Walt on his back porch as Thao washes the Gran Torino on the drive Down in his basement Walt is busy moving an old freezer on a sack truck attempts to get it up the stairs but finds it hard going and tugs away then gives it up as a bad job Thao opens his door to Walt and they go down to Walt's basement where they heave the freezer up the steps and get it outside Thao rubs his neck Sue finds Walt on his back porch as Thao washes the Gran Torino on the drive She shrugs then glances at Thao and goes to get one Walt looks over at Thao Later he watches Thao working in the garden gets a cigarette and a lighter Thao and Walt get out of his pickup truck and go in the barber shop Thao goes out and comes straight back in Thao goes out and comes straight back in Thao gets off a bus and jogs down a back alley heading home A gun Martin takes a seat and Thao comes back in Walt and Thao drive up to a building site in Walt's old white Ford pickup park up and wear work gloves They leave Tim's portacabin and Tim sits back down at his desk Walt's pickup truck pulls up outside CM Young Hardware and Lumber Store Walt and Thao get out go inside and look around Walt makes his way over to a shelf with what he is looking for Walt stares into the distance with a frown and looks down at some hospital admission forms and test results Later he watches Thao working in the garden gets a cigarette and a lighter Smokie stares out of the car and Walt mimes shooting him to which Smokie responds by giving him the finger a tape measure and a tool bag The car pulls up and Spider and his four cronies get out with Smokie stubbing a cigarette out on Thao's cheek Walt is busy moving an old freezer on a sack truck attempts to get it up the stairs but finds it hard going and tugs away then gives it up as a bad job Walt holds his hand out and Thao shakes it As they head off Walt winces slightly and carrying his new stuff Thao gets off a bus and jogs down a back alley heading home As he trots along he sees Spider's Honda coming the other way Karen hands Mitch the phone and reluctantly Mitch answers it Thao watches the exchange of gestures As Mitch hangs up he looks troubled Walt and Thao drive up to a building site in Walt's old white Ford pickup park up and wear work gloves The car pulls up and Spider and his four cronies get out with Smokie stubbing a cigarette out on Thao's cheek Walt lights a cigarette as the modified Honda cruises slowly by Thao nods and Walt grins"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Karen hands Mitch the phone and reluctantly Mitch answers it. As Mitch hangs up he looks troubled. Walt stares into the distance with a frown and looks down at some hospital admission forms and test results. During the day Thao carries a bundle of garden waste out to the front of his house while Walt watches from his porch. as Spider's car comes slowly down the street. Thao sees it and goes back into the garden. Walt lights a cigarette as the modified Honda cruises slowly by. Smokie stares out of the car and Walt mimes shooting him to which Smokie responds by giving him the finger. Thao watches the exchange of gestures. Later Walt opens his front door to Thao and Walt is working under the sink in Thao's kitchen as the ceiling fan gyrates unsteadily. In his garage Walt works on the fan with Thao who folds his arms. Walt doubles up and Thao sees he is coughed up blood. Thao nods at the Gran Torino and Walt follows his gaze to the green V8 muscle car. Thao nods and Walt grins. Down in his basement. Walt is busy moving an old freezer on a sack truck attempts to get it up the stairs but finds it hard going and tugs away then gives it up as a bad job. Thao opens his door to Walt and they go down to Walt's basement where they heave the freezer up the steps and get it outside. Thao rubs his neck. Sue finds Walt on his back porch as Thao washes the Gran Torino on the drive. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. She shrugs then glances at Thao and goes to get one. Walt looks over at Thao. Later he watches Thao working in the garden gets a cigarette and a lighter. Thao and Walt get out of his pickup truck and go in the barber shop. Thao goes out and comes straight back in. A gun. Martin takes a seat and Thao comes back in. Walt and Thao drive up to a building site in Walt's old white Ford pickup park up and wear work gloves. They leave Tim's portacabin and Tim sits back down at his desk. Walt's pickup truck pulls up outside. CM Young Hardware and Lumber Store. Walt and Thao get out go inside and look around. Walt makes his way over to a shelf with what he is looking for. a tape measure and a tool bag. Walt holds his hand out and Thao shakes it. As they head off Walt winces slightly and carrying his new stuff. Thao gets off a bus and jogs down a back alley heading home. As he trots along he sees Spider's Honda coming the other way. The car pulls up and Spider and his four cronies get out with Smokie stubbing a cigarette out on Thao's cheek."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Karen hands Mitch the phone and reluctantly Mitch answers it. As Mitch hangs up he looks troubled. Walt stares into the distance with a frown and looks down at some hospital admission forms and test results. During the day Thao carries a bundle of garden waste out to the front of his house while Walt watches from his porch. as Spider's car comes slowly down the street. Thao sees it and goes back into the garden. Walt lights a cigarette as the modified Honda cruises slowly by. Smokie stares out of the car and Walt mimes shooting him to which Smokie responds by giving him the finger. Thao watches the exchange of gestures. Later Walt opens his front door to Thao and Walt is working under the sink in Thao's kitchen as the ceiling fan gyrates unsteadily. In his garage Walt works on the fan with Thao who folds his arms. Walt doubles up and Thao sees he is coughed up blood. Thao nods at the Gran Torino and Walt follows his gaze to the green V8 muscle car. Thao nods and Walt grins. Down in his basement. Walt is busy moving an old freezer on a sack truck attempts to get it up the stairs but finds it hard going and tugs away then gives it up as a bad job. Thao opens his door to Walt and they go down to Walt's basement where they heave the freezer up the steps and get it outside. Thao rubs his neck. Sue finds Walt on his back porch as Thao washes the Gran Torino on the drive. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. She shrugs then glances at Thao and goes to get one. Walt looks over at Thao. Later he watches Thao working in the garden gets a cigarette and a lighter. Thao and Walt get out of his pickup truck and go in the barber shop. Thao goes out and comes straight back in. A gun. Martin takes a seat and Thao comes back in. Walt and Thao drive up to a building site in Walt's old white Ford pickup park up and wear work gloves. They leave Tim's portacabin and Tim sits back down at his desk. Walt's pickup truck pulls up outside. CM Young Hardware and Lumber Store. Walt and Thao get out go inside and look around. Walt makes his way over to a shelf with what he is looking for. a tape measure and a tool bag. Walt holds his hand out and Thao shakes it. As they head off Walt winces slightly and carrying his new stuff. Thao gets off a bus and jogs down a back alley heading home. As he trots along he sees Spider's Honda coming the other way. The car pulls up and Spider and his four cronies get out with Smokie stubbing a cigarette out on Thao's cheek."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Karen hands Mitch the phone and reluctantly Mitch answers it. As Mitch hangs up he looks troubled. Walt stares into the distance with a frown and looks down at some hospital admission forms and test results. During the day Thao carries a bundle of garden waste out to the front of his house while Walt watches from his porch. as Spider's car comes slowly down the street. Thao sees it and goes back into the garden. Walt lights a cigarette as the modified Honda cruises slowly by. Smokie stares out of the car and Walt mimes shooting him to which Smokie responds by giving him the finger. Thao watches the exchange of gestures. Later Walt opens his front door to Thao and Walt is working under the sink in Thao's kitchen as the ceiling fan gyrates unsteadily. CM Young Hardware and Lumber Store. Walt and Thao get out go inside and look around. Walt makes his way over to a shelf with what he is looking for. a tape measure and a tool bag. Walt holds his hand out and Thao shakes it. As they head off Walt winces slightly and carrying his new stuff. Thao gets off a bus and jogs down a back alley heading home. As he trots along he sees Spider's Honda coming the other way. The car pulls up and Spider and his four cronies get out with Smokie stubbing a cigarette out on Thao's cheek."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Karen hands Mitch the phone and reluctantly Mitch answers it. As Mitch hangs up he looks troubled. Walt stares into the distance with a frown and looks down at some hospital admission forms and test results. During the day Thao carries a bundle of garden waste out to the front of his house while Walt watches from his porch. As they head off Walt winces slightly and carrying his new stuff. Thao gets off a bus and jogs down a back alley heading home. As he trots along he sees Spider's Honda coming the other way. The car pulls up and Spider and his four cronies get out with Smokie stubbing a cigarette out on Thao's cheek."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Jasper hands Lucy the phone, and reluctantly, Lucy answers it. As Lucy hangs up, she looks troubled. Brenda stares into the distance with a frown and looks down at some hospital admission forms and test results. During the day, Felix carries a bundle of garden waste out to the front of his house while Brenda watches from her porch as Leo's car comes slowly down the street. Felix sees it and goes back into the garden. Brenda lights a cigarette as the modified Honda cruises slowly by. Max stares out of the car, and Brenda mimes shooting him, to which Max responds by giving her the finger. Felix watches the exchange of gestures. Later, Brenda opens her front door to Felix, and Brenda is working under the sink in Felix's kitchen as the ceiling fan gyrates unsteadily. In her garage, Brenda works on the fan with Felix, who folds his arms. Brenda doubles up, and Felix sees she's coughed up blood. Felix nods at the Gran Torino, and Brenda follows his gaze to the green V8 muscle car. Felix nods, and Brenda grins. Down in her basement, Brenda is busy moving an old freezer on a sack truck, attempts to get it up the stairs, but finds it hard going, and tugs away, then gives it up as a bad job. Felix opens his door to Brenda, and they go down to Brenda's basement, where they heave the freezer up the steps and get it outside. Felix rubs his neck. Anna finds Brenda on her back porch as Felix washes the Gran Torino on the drive. She shrugs, then glances at Felix and goes to get one. Brenda looks over at Felix. Later, she watches Felix working in the garden, gets a cigarette, and a lighter. Felix and Brenda get out of her pickup truck and go in the barber shop. Felix goes out and comes straight back in. A gun. Kevin takes a seat, and Felix comes back in. Brenda and Felix drive up to a building site in Brenda's old white Ford pickup, park up, and wear work gloves. They leave Sarah's portacabin, and Sarah sits back down at her desk. Brenda's pickup truck pulls up outside E.M. Young Hardware and Lumber Store. Brenda and Felix get out, go inside, and look around. Brenda makes her way over to a shelf with what she's looking for, a tape measure, and a tool bag. Brenda holds her hand out, and Felix shakes it. As they head off, Brenda winces slightly, and carrying her new stuff, Felix gets off a bus and jogs down a back alley heading home. As he trots along, he sees Leo's Honda coming the other way. The car pulls up, and Leo and his four cronies get out, with Max stubbing a cigarette out on Felix's cheek."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Karen hands Mitch the remote, and reluctantly, Mitch answers it. As Mitch hangs up, he looks troubled. Walt stares into the distance with a frown and looks down at some library membership forms and homework assignments. During the day, Thao carries a bundle of firewood out to the front of his house while Walt watches from his hammock as Spider's motorcycle comes slowly down the street. Thao sees it and goes back into the forest. Walt lights a match as the modified scooter cruises slowly by. Smokie stares out of the sidecar, and Walt mimes shooting him, to which Smokie responds by giving him the finger. Thao watches the exchange of gestures. Later, Walt opens his front door to Thao, and Walt is working under the lamp in Thao's study as the table fan gyrates unsteadily. In his garage, Walt works on the fan with Thao, who folds his arms. Walt doubles up, and Thao sees he's coughed up blood. Thao nods at the red tricycle, and Walt follows his gaze to the yellow convertible sports car. Thao nods, and Walt grins. Down in his basement, Walt is busy moving an old bookshelf on a hand truck, attempts to get it up the stairs, but finds it hard going, and tugs away, then gives it up as a bad job. Thao opens his door to Walt, and they go down to Walt's basement, where they heave the bookshelf up the steps and get it outside. Thao rubs his ankle. Sue finds Walt on his back porch as Thao waters the convertible on the drive. She shrugs, then glances at Thao and goes to get one. Walt looks over at Thao. Later, he watches Thao working in the flowerbed, gets a flashlight, and a matchbook. Thao and Walt get out of his scooter and go in the café. Thao goes out and comes straight back in. A newspaper. Martin takes a seat, and Thao comes back in. Walt and Thao drive up to a playground in Walt's old white station wagon, park up, and wear baseball caps. They leave Tim's treehouse, and Tim sits back down at his desk. Walt's station wagon pulls up outside C.M. Young Toy and Game Store. Walt and Thao get out, go inside, and look around. Walt makes his way over to a shelf with what he's looking for, a compass, and a backpack. Walt holds his hand out, and Thao shakes it. As they head off, Walt winces slightly, and carrying his new stuff, Thao gets off a trolley and jogs down a dirt path heading home. As he trots along, he sees Spider's scooter coming the other way. The scooter pulls up, and Spider and his four cronies get out, with Smokie stubbing a marshmallow out on Thao's cheek."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Karen tosses Mitch the phone, and reluctantly, Mitch ignores it. As Mitch throws it down, he looks relieved. Walt squints into the distance with a grin and glances down at some hospital admission forms and test results. During the day, Thao waves a bundle of garden waste out to the side of his house while Walt listens from his porch as Spider's car races down the street. Thao hears it and runs into the garden. Walt flicks a cigarette as the modified Honda speeds quickly by. Smokie peers out of the car, and Walt pretends to salute him, to which Smokie responds by blowing him a kiss. Thao observes the exchange of gestures. Later, Walt slams his front door to Thao, and Walt is sitting under the sink in Thao's kitchen as the ceiling fan sways unsteadily. In his garage, Walt disassembles the fan with Thao, who rubs his chin. Walt bends over, and Thao notices he's coughed up blood. Thao points at the Gran Torino, and Walt follows his gaze to the green V8 muscle car. Thao smirks, and Walt chuckles. Down in his basement, Walt is busy kicking an old freezer on a sack truck, tries to push it up the stairs, but finds it impossible, and pulls away, then leaves it as a bad job. Thao slams his door to Walt, and they head up to Walt's basement, where they roll the freezer up the steps and get it outside. Thao scratches his head. Sue finds Walt on his back porch as Thao polishes the Gran Torino on the drive. She nods, then winks at Thao and goes to fetch one. Walt glances over at Thao. Later, he watches Thao lounging in the garden, grabs a cigarette, and a lighter. Thao and Walt hop out of his pickup truck and stroll into the barber shop. Thao rushes out and comes straight back in. A camera. Martin leans back, and Thao walks back in. Walt and Thao roll up to a building site in Walt's old white Ford pickup, park up, and put on work gloves. They exit Tim's portacabin, and Tim stretches back down at his desk. Walt's pickup truck arrives outside C.M. Young Hardware and Lumber Store. Walt and Thao leap out, wander inside, and glance around. Walt makes his way over to a shelf with what he's looking for, a flashlight, and a tool bag. Walt gives his hand out, and Thao gestures it. As they stroll off, Walt laughs slightly, and carrying his new stuff, Thao hops off a bus and skips down a back alley heading home. As he dashes along, he spots Spider's Honda coming the other way. The car halts, and Spider and his four cronies leap out, with Smokie blowing a bubble with gum on Thao's cheek."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Melody hands Jordan the remote, and reluctantly, Jordan presses it. As Jordan places the remote down, he looks puzzled. Devin gazes into the horizon with a grimace and looks down at some grocery lists and recipes. During the day, Irene carries a bundle of art supplies out to the front of her apartment while Devin watches from his balcony as Max's bicycle comes slowly down the road. Irene notices it and goes back into the workshop. Devin lights a candle as the red Ferrari glides slowly by. Baxter peeks out of the vehicle, and Devin mimes throwing a snowball at him, to which Baxter responds by rolling his eyes. Irene observes the exchange of signals. Later, Devin opens his back gate to Irene, and Devin is tinkering under the desk in Irene's study as the chandelier oscillates unsteadily. In his shed, Devin works on the chandelier with Irene, who rubs her chin. Devin bends over, and Irene sees he's dropped a tool. Irene glances at the Mustang, and Devin follows her gaze to the blue V6 sports car. Irene nods, and Devin chuckles. Down in his cellar, Devin is busy shifting an old wardrobe on a dolly, attempts to get it up the ramp, but finds it tough going, and strains away, then abandons it as a lost cause. Irene opens her window to Devin, and they go down to Devin's cellar, where they hoist the wardrobe up the steps and get it outside. Irene scratches her head. Hannah finds Devin on his side porch as Irene polishes the Mustang on the lane. She sighs, then looks at Irene and goes to get one. Devin glances over at Irene. Later, he watches Irene tending the flowers, gets a matchbook, and a cigar. Irene and Devin get out of his van and go in the post office. Irene goes out and comes straight back in. A book. Sylvia settles into a couch, and Irene returns. Devin and Irene drive up to a factory site in Devin's old blue Chevy van, park, and put on hard hats. They leave Frank's office trailer, and Frank leans back in his chair. Devin's van pulls up outside M.C. Moon Grocery and Appliance Store. Devin and Irene get out, go inside, and browse around. Devin makes his way over to a display with what he's searching for, a notebook, and a paintbrush. Devin extends his hand, and Irene high-fives it. As they head off, Devin grimaces slightly, and carrying her new items, Irene gets off a train and jogs down a back street heading home. As she jogs along, she sees Max's Ferrari coming the opposite direction. The vehicle pulls up, and Max and his four cronies get out, with Baxter flicking a match on Irene's shoulder."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Linda hands Roger the book, and reluctantly, Roger opens it. As Roger closes it, he looks confused. Greta gazes into the distance with a sigh and glances down at some restaurant menus and receipts. During the day, Ling drags a pile of laundry out to the front of her house while Greta observes from her balcony as Jasper's van creeps slowly down the street. Ling notices it and retreats into the basement. Greta sips a cup of tea as the customized BMW rolls slowly by. Max peers out of the van, and Greta mimics throwing a pie, to which Max responds by nodding at her. Ling observes the exchange of signals. Later, Greta opens her garage door to Ling, and Greta is tinkering under the car in Ling's garage as the ceiling light flickers unsteadily. In his shed, Greta tinkers with the light with Ling, who taps her foot. Greta stands up, and Ling notices she's dropped some tools. Ling glances at the Camaro, and Greta follows her gaze to the red V6 sports car. Ling glances, and Greta chuckles. Down in her storeroom, Greta is occupied shifting an old bicycle on a trolley, tries to get it up the ramp, but struggles, and pulls persistently, then gives it up as a lost cause. Ling opens her window to Greta, and they head down to Greta's storeroom, where they haul the bicycle up the ramp and get it outside. Ling scratches her head. Mia finds Greta on her front yard as Ling polishes the Camaro on the driveway. She shrugs, then glances at Ling and goes to grab one. Greta looks over at Ling. Later, she observes Ling digging in the flowerbed, grabs a soda, and a straw. Ling and Greta hop out of her SUV and enter the grocery store. Ling steps out and comes right back in. A book. Susan takes a chair, and Ling returns. Greta and Ling pull up to a construction site in Greta's old blue Chevrolet pickup, park, and don safety goggles. They exit Paul's trailer, and Paul leans back at his workstation. Greta's pickup stops outside Smith's Hardware and Lumber Store. Greta and Ling step out, go inside, and browse. Greta strides over to a rack with what she's seeking, a hammer, and a nail pouch. Greta extends her hand, and Ling grips it. As they depart, Greta grimaces slightly, and clutching her new items, Ling hops off a tram and strides down a side street heading home. As she jogs along, she notices Jasper's BMW coming her way. The van stops, and Jasper and his four companions exit, with Max stubbing a cigarette out on Ling's shoulder."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Karen passes Mitch a banana, and reluctantly, Mitch tastes it. As Mitch puts it down, he looks perplexed. Walt squints at the horizon with a grimace and glances down at some recipe cards and grocery lists. During the day, Thao drags a stack of paint cans to the front of his house while Walt observes from his hammock as Spider's bicycle glides leisurely down the road. Thao notices it and retreats into the shed. Walt ignites a matchstick as the modified scooter rolls slowly by. Smokie gazes out of the vehicle, and Walt pretends to toss him a pie, to which Smokie responds by sticking out his tongue. Thao observes the exchange of expressions. Later, Walt opens his garage door to Thao, and Walt is tinkering under the bed in Thao's living room as the chandelier swings erratically. In his attic, Walt tinkers with the chandelier with Thao, who crosses his legs. Walt straightens up, and Thao notices he’s dropped some ink. Thao gestures at the Gran Torino, and Walt follows his gaze to the orange sedan. Thao gestures again, and Walt chuckles. Down in his cellar, Walt is bustling around rearranging an old typewriter on a dolly, attempts to push it up the ladder, but encounters difficulty, and nudges it gently, then gives up as a pointless task. Thao opens his gate to Walt, and they proceed down to Walt's cellar, where they hoist the typewriter up the ladder and get it outside. Thao scratches his elbow. Sue finds Walt on his front lawn as Thao polishes the Gran Torino on the curb. She shrugs, then glances at Thao and heads to fetch one. Walt glances over at Thao. Later, he observes Thao painting the fence, retrieves a chocolate bar, and a matchbook. Thao and Walt hop out of his van and stroll into the florist shop. Thao steps out and immediately returns in. A wrench. Martin takes a stand, and Thao returns inside. Walt and Thao drive up to a farmhouse in Walt's old blue Chevrolet van, park alongside, and don garden hats. They leave Tim's garden shed, and Tim leans back into his lounge chair. Walt's van parks next to C.M. Young Groceries and Apparel Store. Walt and Thao exit, enter, and peruse the aisles. Walt makes his way over to a display with what he's seeking, a compass, and a fishing net. Walt extends his palm, and Thao high-fives it. As they depart, Walt grimaces slightly, and carrying his new gear, Thao hops off a train and strolls down a narrow lane heading home. As he saunters along, he notices Spider's tricycle coming the other way. The tricycle halts, and Spider and his four companions hop out, with Smokie extinguishing a candle on Thao's shoulder."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Jenna tosses Jason the balloon, and hesitantly, Jason catches it. As Jason releases it, he feels uneasy. Hugo squints into the horizon with a grimace and glances down at some grocery catalogs and shopping lists. During the afternoon, Tom lifts a stack of newspapers out to the edge of his garden while Hugo observes from his balcony as Buster's motorcycle cruises slowly down the walkway. Tom notices it and retreats into the greenhouse. Hugo strikes a matchstick as the altered scooter glides slowly past. Shadow peers out of the vehicle, and Hugo mimics painting him, to which Shadow replies by sticking out his tongue. Tom observes the exchange of motions. Later, Hugo opens his garage door to Tom, and Hugo is tinkering under the motorbike in Tom's garage as the ceiling lamp flickers erratically. In his studio, Hugo fiddles with the lamp with Tom, who crosses his legs. Hugo bends over, and Tom notices he's dropped some nails. Tom gestures at the Ford Mustang, and Hugo follows his glance to the blue sports convertible. Tom gestures, and Hugo chuckles. Down in his workshop, Hugo is busy shifting an old cabinet on a dolly, attempts to roll it up the ramp, but finds it challenging, and pushes away, then abandons it as a lost cause. Tom opens his gate to Hugo, and they head down to Hugo's workshop, where they drag the cabinet up the incline and get it outside. Tom scratches his temple. Audrey discovers Hugo on his side veranda as Tom polishes the Ford Mustang on the patio. She sighs, then peeks at Tom and goes to fetch another. Hugo glances over at Tom. Later, he observes Tom digging in the flowerbed, grabs a mug and a spoon. Tom and Hugo climb out of his delivery van and enter the tailor's shop. Tom steps out and comes right back in. A wrench. Thomas takes a position, and Tom returns. Hugo and Tom drive up to a construction zone in Hugo's rusty blue Chevy van, park up, and don hard hats. They leave Sam's trailer, and Sam leans back in his chair. Hugo's delivery van halts outside G.K. Green Tools and Equipment Store. Hugo and Tom exit, walk inside, and browse around. Hugo navigates over to a bin with what he's searching for, a level, and a tool belt. Hugo stretches his arm out, and Tom clasps it. As they depart, Hugo grimaces slightly, and clutching his new gear, Tom steps off a horse and trots down a side street heading home. As he saunters along, he notices Buster's scooter approaching from the opposite direction. The vehicle stops, and Buster and his three sidekicks step out, with Shadow flicking a toothpick onto Tom's shoulder."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Karen gives Mitch the phone, and he answers reluctantly, looking troubled afterward. Walt, frowning, glances at hospital forms and test results. Thao carries garden waste outside, while Walt observes Spider's car cruising by. Smokie and Walt exchange hostile gestures as Thao watches. Later, Walt helps Thao with repairs in his kitchen and garage, but coughs up blood, hinting at his health issues. They work together to move an old freezer from Walt's basement. Sue finds them as Thao washes the Gran Torino. Walt reflects on Thao's work. They visit a barber shop, and Walt buys tools from a hardware store, shaking Thao's hand afterward. Thao walks home, but encounters Spider and his gang, with Smokie burning Thao's cheek with a cigarette."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The car pulls up and Spider and his four cronies get out with Smokie stubbing a cigarette out on Thao's cheek As he trots along he sees Spider's Honda coming the other way Thao gets off a bus and jogs down a back alley heading home As they head off Walt winces slightly and carrying his new stuff Walt holds his hand out and Thao shakes it a tape measure and a tool bag Walt makes his way over to a shelf with what he is looking for Walt and Thao get out go inside and look around CM Young Hardware and Lumber Store Walt's pickup truck pulls up outside They leave Tim's portacabin and Tim sits back down at his desk Walt and Thao drive up to a building site in Walt's old white Ford pickup park up and wear work gloves Martin takes a seat and Thao comes back in A gun Thao goes out and comes straight back in Thao and Walt get out of his pickup truck and go in the barber shop Later he watches Thao working in the garden gets a cigarette and a lighter Walt looks over at Thao She shrugs then glances at Thao and goes to get one Sue finds Walt on his back porch as Thao washes the Gran Torino on the drive Thao rubs his neck Thao opens his door to Walt and they go down to Walt's basement where they heave the freezer up the steps and get it outside Walt is busy moving an old freezer on a sack truck attempts to get it up the stairs but finds it hard going and tugs away then gives it up as a bad job Down in his basement Thao nods and Walt grins Thao nods at the Gran Torino and Walt follows his gaze to the green V8 muscle car Walt doubles up and Thao sees he is coughed up blood In his garage Walt works on the fan with Thao who folds his arms Later Walt opens his front door to Thao and Walt is working under the sink in Thao's kitchen as the ceiling fan gyrates unsteadily Thao watches the exchange of gestures Smokie stares out of the car and Walt mimes shooting him to which Smokie responds by giving him the finger Walt lights a cigarette as the modified Honda cruises slowly by Thao sees it and goes back into the garden as Spider's car comes slowly down the street During the day Thao carries a bundle of garden waste out to the front of his house while Walt watches from his porch Walt stares into the distance with a frown and looks down at some hospital admission forms and test results As Mitch hangs up he looks troubled Karen hands Mitch the phone and reluctantly Mitch answers it"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Walt doubles up and Thao sees he is coughed up blood Walt holds his hand out and Thao shakes it In his garage Walt works on the fan with Thao who folds his arms a tape measure and a tool bag As they head off Walt winces slightly and carrying his new stuff CM Young Hardware and Lumber Store Thao nods at the Gran Torino and Walt follows his gaze to the green V8 muscle car Thao sees it and goes back into the garden Martin takes a seat and Thao comes back in Walt and Thao get out go inside and look around They leave Tim's portacabin and Tim sits back down at his desk as Spider's car comes slowly down the street Later Walt opens his front door to Thao and Walt is working under the sink in Thao's kitchen as the ceiling fan gyrates unsteadily She shrugs then glances at Thao and goes to get one During the day Thao carries a bundle of garden waste out to the front of his house while Walt watches from his porch A gun Walt looks over at Thao Thao and Walt get out of his pickup truck and go in the barber shop Thao opens his door to Walt and they go down to Walt's basement where they heave the freezer up the steps and get it outside The car pulls up and Spider and his four cronies get out with Smokie stubbing a cigarette out on Thao's cheek Walt makes his way over to a shelf with what he is looking for Walt and Thao drive up to a building site in Walt's old white Ford pickup park up and wear work gloves Karen hands Mitch the phone and reluctantly Mitch answers it As he trots along he sees Spider's Honda coming the other way Thao nods and Walt grins Sue finds Walt on his back porch as Thao washes the Gran Torino on the drive Walt stares into the distance with a frown and looks down at some hospital admission forms and test results Thao gets off a bus and jogs down a back alley heading home Walt's pickup truck pulls up outside Thao goes out and comes straight back in Later he watches Thao working in the garden gets a cigarette and a lighter Walt lights a cigarette as the modified Honda cruises slowly by Thao watches the exchange of gestures Down in his basement Walt is busy moving an old freezer on a sack truck attempts to get it up the stairs but finds it hard going and tugs away then gives it up as a bad job Thao rubs his neck As Mitch hangs up he looks troubled Smokie stares out of the car and Walt mimes shooting him to which Smokie responds by giving him the finger"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She shrugs then glances at Thao and goes to get one Walt looks over at Thao Later he watches Thao working in the garden gets a cigarette and a lighter Thao and Walt get out of his pickup truck and go in the barber shop Thao goes out and comes straight back in A gun Martin takes a seat and Thao comes back in Walt and Thao drive up to a building site in Walt's old white Ford pickup park up and wear work gloves They leave Tim's portacabin and Tim sits back down at his desk Walt's pickup truck pulls up outside CM Young Hardware and Lumber Store Walt and Thao get out go inside and look around Walt makes his way over to a shelf with what he is looking for a tape measure and a tool bag Walt holds his hand out and Thao shakes it As they head off Walt winces slightly and carrying his new stuff Thao gets off a bus and jogs down a back alley heading home As he trots along he sees Spider's Honda coming the other way The car pulls up and Spider and his four cronies get out with Smokie stubbing a cigarette out on Thao's cheek Karen hands Mitch the phone and reluctantly Mitch answers it As Mitch hangs up he looks troubled Walt stares into the distance with a frown and looks down at some hospital admission forms and test results During the day Thao carries a bundle of garden waste out to the front of his house while Walt watches from his porch as Spider's car comes slowly down the street Thao sees it and goes back into the garden Walt lights a cigarette as the modified Honda cruises slowly by Smokie stares out of the car and Walt mimes shooting him to which Smokie responds by giving him the finger Thao watches the exchange of gestures Later Walt opens his front door to Thao and Walt is working under the sink in Thao's kitchen as the ceiling fan gyrates unsteadily In his garage Walt works on the fan with Thao who folds his arms Walt doubles up and Thao sees he is coughed up blood Thao nods at the Gran Torino and Walt follows his gaze to the green V8 muscle car Thao nods and Walt grins Down in his basement Walt is busy moving an old freezer on a sack truck attempts to get it up the stairs but finds it hard going and tugs away then gives it up as a bad job Thao opens his door to Walt and they go down to Walt's basement where they heave the freezer up the steps and get it outside Thao rubs his neck Sue finds Walt on his back porch as Thao washes the Gran Torino on the drive"
        }
      ]
    }
  ]
}