{
  "ground_truth": "Thao meets Walt near the house, and Walt grabs his arm. Thao starts to walk away, stops and looks back, then goes. Walt wanders off, frowning. Spider and one of his sidekicks come out of a house and walk over to a Honda parked by the curb. They get in, watched from across the road by Walt, parked in his pickup truck, who grim-facedly watches the Honda drive off. Walt picks up his Colt .45 automatic and cocks it, then talks to Daisy. He gets out of the pickup truck. As Smokie comes out of the house, Walt grabs him, throws him onto the lawn, and kicks him repeatedly in the face, following up with a few punches. A cat scampers past, and Walt draws his gun. In the evening, it's raining as Walt drives his pickup truck back to his house. He parks on his drive, gets out with Daisy, walks up the steps onto the porch, and Daisy crosses his path. He bends down, picks up a key from under an ornament, winces as he straightens up, and unlocks the door. He and Daisy go inside. Walt cooks a barbeque for Sue, Thao, their mother, and Youa. Youa and Thao grin and nod. Walt points at the Gran Torino. Walt sits in his living room with Daisy, sipping a beer and watching a ball game on TV. Spider's car cruises down the street outside, and as it passes Thao's house, gang members discharge a couple of MAC-10 machine guns into the building. Hearing the noise, Walt leaps up and takes his Colt out of a drawer as bullets rip through Thao's house. Walt runs out onto his porch as the Honda speeds away, watches it go, then runs down off the porch and dashes into Thao's house. He runs into the living room where Thao is picking himself up, having a minor neck injury. She comes downstairs, and Thao makes a call, turns to a grim-faced Walt, and shakes his head, then begins to sob. Walt sits with Thao and his mother in their kitchen, sipping a rice liquor. Grandma sees a car go by outside and hurries to the door as everyone follows. Sue comes in with her face a bleeding mass of contusions. Watching, Walt drops his glass. Sue is helped to a chair by her mother and Grandma, blood running down her face and legs. Thao clings to his mother and sobs. Appalled, Walt stares at Sue, his mouth hanging open. He walks away from Thao's house, pushing the Colt into his belt, and walks into his kitchen, leaning against a worktop.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Thao encounters Walt beside the dwelling, and Walt seizes his limb. Thao begins to stride away, halts and gazes back, then departs. Walt strolls off, scowling. Spider and one of his accomplices emerge from a residence and proceed over to a Honda stationed by the verge. They enter, observed from across the street by Walt, situated in his pickup vehicle, who sternly watches the Honda roll away. Walt lifts his Colt .45 automatic and primes it, then converses with Daisy. He exits the pickup vehicle. As Smokie emerges from the dwelling, Walt grabs him, flings him onto the grass, and strikes him repeatedly in the visage, following up with a few punches. A feline scurries past, and Walt draws his firearm. In the evening, it's pouring as Walt drives his pickup vehicle back to his dwelling. He parks on his drive, exits with Daisy, ascends the steps onto the veranda, and Daisy crosses his path. He bends down, lifts a key from beneath an ornament, winces as he straightens up, and unlocks the portal. He and Daisy proceed inside. Walt prepares a barbecue for Sue, Thao, their mother, and Youa. Youa and Thao beam and nod. Walt indicates at the Gran Torino. Walt reclines in his living room with Daisy, sipping a brew and observing a ball game on TV. Spider's automobile glides down the road outside, and as it passes Thao's dwelling, gang affiliates discharge a couple of MAC-10 machine pistols into the structure. Hearing the clamor, Walt springs up and retrieves his Colt out of a drawer as bullets tear through Thao's dwelling. Walt rushes out onto his veranda as the Honda accelerates away, observes it depart, then runs down off the veranda and dashes into Thao's dwelling. He rushes into the living room where Thao is lifting himself up, having a minor neck injury. She descends the stairs, and Thao makes a call, turns to a grim-faced Walt, and shakes his head, then begins to weep. Walt sits with Thao and his mother in their kitchen, sipping a rice spirit. Grandma detects an automobile go by outside and hurries to the portal as everyone follows. Sue enters with her face a bleeding mass of bruises. Watching, Walt drops his glass. Sue is assisted to a seat by her mother and Grandma, blood streaming down her countenance and legs. Thao clings to his mother and weeps. Horrified, Walt stares at Sue, his mouth hanging open. He strolls away from Thao's dwelling, pushing the Colt into his waistband, and walks into his kitchen, leaning against a countertop."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Thao is met by Walt near the house, and his arm is grabbed by Walt. Thao starts to walk away, stops and looks back, then goes. Walt wanders off, frowning. Spider and one of his sidekicks come out of a house and walk over to a Honda parked by the curb. They get in, and Walt watches them from across the road, parked in his pickup truck, grim-facedly watching the Honda drive off. The Colt .45 automatic is picked up and cocked by Walt, then he talks to Daisy. He gets out of the pickup truck. As Smokie comes out of the house, he is grabbed by Walt, thrown onto the lawn, and repeatedly kicked in the face by him, followed up with a few punches. A cat scampers past, and the gun is drawn by Walt. In the evening, while it’s raining, the pickup truck is driven by Walt back to his house. On his drive, he parks, gets out with Daisy, walks up the steps onto the porch, and Daisy crosses his path. A key is picked up by him from under an ornament, and as he straightens up, he winces, then unlocks the door. He and Daisy go inside. A barbecue is cooked by Walt for Sue, Thao, their mother, and Youa. Grinning and nodding, are Youa and Thao. The Gran Torino is pointed at by Walt. Walt sits in his living room with Daisy, sipping a beer and watching a ball game on TV. Spider's car cruises down the street outside, and as it passes Thao's house, a couple of MAC-10 machine guns are discharged into the building by gang members. Hearing the noise, Walt leaps up and takes his Colt out of a drawer as bullets rip through Thao's house. The porch is run onto by Walt as the Honda speeds away; he watches it go, then runs down off the porch and dashes into Thao's house. In the living room, he runs where Thao is picking himself up, having a minor neck injury. She comes downstairs, and a call is made by Thao, who turns to a grim-faced Walt and shakes his head, then begins to sob. In their kitchen, Walt sits with Thao and his mother, sipping a rice liquor. A car is seen going by outside by Grandma, and she hurries to the door as everyone follows. Sue comes in with her face a bleeding mass of contusions. Watching, Walt drops his glass. Sue is helped to a chair by her mother and Grandma, with blood running down her face and legs. To his mother, Thao clings and sobs. Appalled, Sue is stared at by Walt, his mouth hanging open. Thao's house is walked away from by him, pushing the Colt into his belt, and his kitchen is walked into by him, leaning against a worktop."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Thao meets Walt near the house, but as Thao walks away, Walt frowns and wanders off. Spider and his sidekick enter a Honda, watched grimly by Walt from his pickup truck. Walt grabs his Colt .45, speaks to Daisy, then exits the truck. As Smokie emerges, Walt violently confronts him, drawing his gun as a cat scampers by. That rainy evening, Walt returns home with Daisy, retrieves a key from under an ornament, and enters. He cooks a barbeque for Sue, Thao, their mother, and Youa, gesturing at the Gran Torino. Walt later sits with Daisy, drinking beer while watching TV. Spider's car cruises by, and gang members fire MAC-10s at Thao's house. Alerted, Walt grabs his Colt and runs outside as the Honda flees, then rushes into Thao's house. In the living room, Thao, with a minor neck injury, calls someone and sobs in front of a grim Walt. Walt drinks rice liquor with Thao and his mother as Grandma rushes to the door. Sue enters, her face a mass of contusions, and Walt, shocked, drops his glass. As Sue is helped to a chair, Thao sobs, and Walt, appalled, walks away, tucking the Colt into his belt and heading into his kitchen."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Thao meets Walt near the house; Walt grabs him. Thao stops, looks back, and leaves as Walt frowns. Spider and a sidekick get into a Honda watched by Walt from his truck. Walt cocks his Colt .45, talks to Daisy, then exits. Walt grabs Smokie, throws him on the lawn, kicks, and punches him. A cat passes, and Walt draws his gun. In the rain, Walt drives home, parks, picks up a key, winces, unlocks the door, and enters with Daisy. He cooks a barbecue for Sue, Thao, their mother, and Youa. Walt points at the Gran Torino, then watches TV with Daisy. Spider's car cruises by, and gang members fire at Thao's house. Walt grabs his Colt, runs out, and watches the Honda speed away. Walt rushes into Thao's house as Thao, injured, calls, then sobs. Walt sits with Thao and his mother. Grandma sees a car, rushes to the door, and Sue enters with bleeding contusions. Walt drops his glass, and Sue is helped to a chair. Thao sobs, and Walt stares, appalled, then walks home, pushing the Colt into his belt."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Thao approaches Walt near the house, and Walt firmly grabs his arm in a grip that stops Thao in his tracks. Thao initially begins to walk away but hesitates, stopping momentarily to look back at Walt before he finally continues on his way. Walt, left standing there, frowns deeply as he wanders off, lost in his own thoughts. Nearby, Spider and one of his sidekicks step out from a house and make their way to a Honda parked right by the curb. They enter the vehicle, fully aware that they are under the watchful eye of Walt, who is observing them intently from across the road, parked in his pickup truck with a grim expression. As the Honda drives off down the street, Walt remains watchful, then picks up his Colt .45 automatic, cocks it with a determined flick of his hand, and has a word with Daisy. He then exits his pickup truck. As Smokie emerges from the house, Walt doesn't hesitate; he seizes Smokie, forcefully throwing him onto the lawn, where he proceeds to kick him repeatedly in the face, adding a few powerful punches as a finishing touch. Amidst this chaos, a cat darts past, prompting Walt to draw his gun. Later in the evening, as rain starts to fall, Walt drives his pickup truck back to the familiar comfort of his home. Parking in the driveway, he steps out with Daisy by his side, climbs up the steps to the porch, and Daisy crosses in front of him. Taking a moment, he bends down, retrieves a key from its hiding spot under an ornament, and winces slightly as he straightens up before unlocking the door. Together, he and Daisy step inside. Inside, Walt prepares a barbecue for Sue, Thao, their mother, and Youa. Youa and Thao exchange grins and nod in appreciation. Walt gestures towards the Gran Torino as a point of interest. Later, he relaxes in his living room with Daisy, sipping a cold beer and watching a ball game on the TV. Meanwhile, outside, Spider’s car slowly cruises down the street. As it passes in front of Thao’s house, gang members mercilessly fire a barrage of bullets from a couple of MAC-10 machine guns into the building. Hearing the alarming noise, Walt springs into action, grabbing his Colt from a drawer as bullets indiscriminately tear through Thao’s house. Walt rushes out onto his porch just as the Honda speeds away, watching it vanish down the road, then races down off the porch and makes a beeline for Thao’s house. Inside, he finds Thao in the living room, picking himself up and dealing with a minor neck injury. She comes downstairs, and Thao makes a call, turns to a grim-faced Walt, and shakes his head in dismay, then starts to sob. Walt sits with Thao and his mother in their kitchen, sipping on some rice liquor. Grandma spots a car passing by outside and quickly heads to the door, with everyone else following her lead. Sue enters, her face a bleeding mass of contusions. As Walt watches in shock, he drops his glass in disbelief. Sue is gently helped to a chair by her mother and Grandma, with blood streaming down her face and legs. Thao clings tightly to his mother, tears streaming down his face. Overcome with shock, Walt stares at Sue, his jaw hanging open in disbelief. He eventually walks away from Thao’s house, pushing his Colt into his belt, and makes his way into his own kitchen, where he leans wearily against a worktop, reflecting on the devastating events."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As Thao makes his approach toward Walt near the house, Walt decisively seizes Thao's arm with a firm grip, effectively halting Thao in his tracks. Initially, Thao begins to turn away, setting off to leave, but he pauses in his stride, momentarily hesitating to cast a glance back at Walt before he ultimately resumes his path forward. Left standing there in contemplation, Walt frowns deeply, his expression shadowed by a wandering journey into his own thoughts as he drifts off. Meanwhile, not far away, Spider and one of his loyal sidekicks emerge from a nearby house and proceed toward a Honda vehicle that is parked conspicuously by the curb. They climb into the car, fully conscious of the fact that Walt is observing them with sharp intensity from his vantage point across the road, where he sits, parked in his pickup truck, his face marked by a grim and resolute expression. As the Honda departs, driving smoothly down the street, Walt remains vigilant, his eyes following them, then decisively picks up his Colt .45 automatic, cocks it with a determined and precise flick of his hand, and has a brief word with Daisy. He then exits his pickup truck without a moment's hesitation. As Smokie emerges from the house, there's no hesitation in Walt's actions; he swiftly seizes Smokie, hurling him forcefully onto the lawn, where he proceeds to administer a series of repeated kicks to his face, finishing with a few powerful punches as a final touch. Amidst this turmoil, a cat darts past, prompting Walt to instinctively draw his gun. Later, as the evening unfolds and rain begins to descend, Walt drives his pickup truck back to the familiar and comforting presence of his home. After parking in the driveway, he steps out with Daisy loyally by his side, climbs up the familiar steps to his porch, and Daisy crosses in front of him. Taking a moment to prepare, he bends down, retrieves a key from its cleverly concealed hiding spot beneath an ornament, and winces slightly as he straightens up before proceeding to unlock the door. Together, he and Daisy step inside the inviting warmth of his home. Inside, Walt takes on the task of preparing a barbecue for Sue, Thao, their mother, and Youa, who exchange grins and nods of appreciation in response to his gesture of hospitality. Walt gestures toward the Gran Torino, offering it as a point of interest. Later, he finds a moment to relax in the comfort of his living room with Daisy, enjoying a cold beer as he watches a ball game unfold on the television screen. Meanwhile, outside, Spider's car slowly cruises down the street, and as it passes in front of Thao’s house, gang members unleash a merciless barrage of bullets from a couple of MAC-10 machine guns into the building. Upon hearing the alarming and terrifying noise, Walt springs into action, grabbing his Colt from a drawer as bullets indiscriminately tear through Thao’s house. Walt rushes out onto his porch just as the Honda speeds away, observing it as it vanishes down the road, then hurriedly races off the porch, making a beeline for Thao’s house. Inside, he discovers Thao in the living room, attempting to recover and dealing with a minor neck injury. She descends the stairs, and Thao makes a phone call, then turns to face Walt, whose expression is grim and filled with dismay, and begins to sob. Walt finds himself sitting with Thao and his mother in their kitchen, sipping on some rice liquor in an effort to find solace. Grandma catches sight of a car passing by outside and promptly heads to the door, with everyone else following her lead. Sue enters, and her face is a bleeding mass of contusions. As Walt stands there, watching in shock and disbelief, his glass slips from his grasp. Sue is gently helped to a chair by her mother and Grandma, blood streaming down her face and legs. Thao clings tightly to his mother, tears flowing freely down his face. Overcome with shock, Walt stares at Sue, his jaw hanging open in a state of disbelief. Eventually, he walks away from Thao’s house, tucking his Colt into his belt, and makes his way into his own kitchen, where he leans wearily against a countertop, reflecting deeply on the devastating events that have unfolded."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Thao approaches Walt near the house, where Walt firmly grabs his arm. Thao begins to walk away, hesitates for a moment, turns to glance back, and then continues to leave. Walt, with a furrowed brow, wanders off in a different direction. Meanwhile, Spider emerges from a house along with one of his sidekicks, and they casually walk over to a Honda parked by the curb. They both get into the vehicle as Walt, seated in his pickup truck across the road, grimly observes them and watches the Honda as it drives away. With determination, Walt picks up his Colt .45 automatic, methodically cocks it, and engages in a brief conversation with Daisy. He then steps out of the pickup truck, and at that moment, Smokie exits the house. Walt swiftly seizes Smokie, forcefully throws him onto the lawn, and repeatedly delivers kicks to his face, punctuating the assault with a few sharp punches. As a cat scurries by, Walt instinctively draws his gun. Later, as evening falls and rain begins to pour, Walt drives his pickup truck back to his house, steers it carefully into the driveway, and brings it to a stop. Exiting the vehicle with Daisy, he goes up the steps leading to the porch. Daisy crosses his path, prompting him to bend down, pick up a key hidden beneath an ornament, wince slightly as he straightens up, and use the key to unlock the door. Both he and Daisy step inside. Inside, Walt takes the time to prepare a barbecue meal for Sue, Thao, their mother, and Youa, who respond with grins and nods of appreciation. Walt gestures towards the Gran Torino, indicating it with a sense of pride. Later, he settles into his living room with Daisy, enjoying a beer while watching a ball game on TV. Suddenly, Spider's car glides down the street outside, and as it nears Thao's house, gang members inside the car unleash a torrent of bullets from a couple of MAC-10 machine guns into the building. Startled by the gunfire, Walt quickly springs up, retrieves his Colt from a drawer as bullets violently perforate Thao's house, and charges out onto his porch. He observes the Honda speeding away, then races down the steps, dashes across to Thao's house, and rushes into the living room, where Thao is struggling to get to his feet, slightly injured in the neck. As Thao’s sister comes downstairs, Thao makes an urgent phone call, turns towards a grim-looking Walt, shakes his head in despair, and then begins to weep. Walt joins Thao and his mother in their kitchen, sipping rice liquor thoughtfully. Suddenly, Grandma notices a car pass by outside, prompting her to hurry to the door, with everyone following closely. Sue enters, her face battered and bloody with contusions, causing Walt to drop his glass in shock. Sue, in distress, is guided to a chair by her mother and Grandma, blood seeping from her face and legs. Thao clings to his mother and sobs uncontrollably. Overwhelmed, Walt stares at Sue, mouth agape in horror. He then turns away from Thao's house, discreetly tucks the Colt into his belt, and makes his way back into his kitchen, where he leans heavily against a worktop, processing the evening's traumatic events."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Thao meets Walt near the house, where Walt holds his arm briefly before Thao leaves. Walt, frowning, watches Spider and a sidekick exit a house, enter a Honda, and drive off while observing from his parked pickup truck. He then readies his Colt .45 and talks to Daisy. Confronting Smokie as he exits the house, Walt physically attacks him on the lawn, culminating by drawing his gun. Later, in the rain, Walt returns home with Daisy, retrieves a key from under an ornament on the porch, and unlocks the door, wincing as he stands. Inside, Walt cooks a barbecue for Sue, Thao, their mother, and Youa, gesturing toward the Gran Torino as Youa and Thao smile. In the evening, Walt sits with Daisy, watching a ball game and drinking beer, when outside, Spider's car drives by, and gang members shoot at Thao's house. Reacting to the gunfire, Walt retrieves his Colt and runs outside to see the Honda speeding away. He quickly enters Thao's house, finding Thao slightly injured, sobbing after a call. Walt then sits in the kitchen with Thao and his mother, drinking rice liquor, when a car is seen passing by, prompting Grandma to rush to the door. Sue arrives, severely beaten, and is helped to a chair by her mother and Grandma as Walt drops his glass, shocked. Walt, appalled by the scene, secures his Colt and retreats to his kitchen, leaning against a worktop."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Thao meets Walt near the house, an old Craftsman-style dwelling on a quiet residential street, and Walt grabs his arm with a firm grip. Thao, feeling the tension in the air, starts to walk away, stops and looks back, then goes, his figure disappearing into the fading afternoon light. Walt wanders off into his backyard, frowning, his mind a turbulent mix of concern and resolve. Spider, a known gang member in the neighborhood, and one of his sidekicks come out of a house that is rumored to be a gang hideout and walk over to a Honda parked by the curb, its engine idling with a low rumble. They get in, watched from across the road by Walt, parked in his pickup truck, who grim-facedly watches the Honda drive off, the vehicle known for being fast and nimble on the streets. Walt picks up his Colt .45 automatic, a reliable sidearm designed and used by the US military in past conflicts, and cocks it with a practiced ease, then talks to Daisy, his Golden Retriever who senses his unease. He gets out of the pickup truck, his boots making a crunching sound on the gravel driveway. As Smokie, another gang affiliate infamous in the area, comes out of the house, Walt grabs him, throws him onto the lawn fiercely, and kicks him repeatedly in the face, his anger boiling over, following up with a few punches. A stray cat, startled by the commotion, scampers past, and Walt draws his gun instinctively, his eyes scanning the area. In the evening, it's raining as Walt drives his pickup truck back to his house, the rain pattering softly on the roof. He parks on his drive, a narrow strip of concrete leading to his garage, gets out with Daisy, walks up the steps onto the porch, and Daisy crosses his path, her tail wagging gently. He bends down, picks up a key from under an ornament shaped like an owl, wincing as he straightens up, and unlocks the door. He and Daisy, both a little wet from the drizzle, go inside. Walt cooks a barbeque for Sue, Thao, their mother, and Youa, the savory aroma mingling with the cool evening air. Youa and Thao grin and nod, appreciative of the feast. Walt points at the Gran Torino, his prized 1972 muscle car that gleams in the driveway. Walt sits in his living room with Daisy, sipping a beer from a local brewery and watching a ball game on TV, the screen flickering with the action of his favorite team. Spider's car, the notorious Honda, cruises down the street outside, and as it passes Thao's house, gang members discharge a couple of MAC-10 machine guns, a weapon often favored for its compactness and rapid fire, into the building. Hearing the noise, Walt leaps up and takes his Colt out of a drawer, a deep sense of urgency driving him as bullets rip through Thao's house. Walt runs out onto his porch as the Honda speeds away, its taillights vanishing into the night, watches it go, then runs down off the porch and dashes into Thao's house, his heart pounding. He runs into the living room where Thao is picking himself up, having a minor neck injury, wincing in pain but determined. She comes downstairs, and Thao makes a call to emergency services, turns to a grim-faced Walt, and shakes his head, then begins to sob, the realization of the attack setting in. Walt sits with Thao and his mother in their kitchen, sipping a rice liquor, a traditional drink that briefly warms them in the somber atmosphere. Grandma sees a suspicious-looking car go by outside and hurries to the door as everyone follows, anxious and alert. Sue comes in with her face a bleeding mass of contusions, a result of the brutal attack she endured. Watching, Walt drops his glass, the sound of it shattering on the floor underscoring the shock. Sue is helped to a chair by her mother and Grandma, blood running down her face and legs, a testament to the night's violence. Thao clings to his mother and sobs, his young frame shaking with emotion. Appalled, Walt stares at Sue, his mouth hanging open, unable to find the words. He walks away from Thao's house, pushing the Colt into his belt, the weight both a comfort and a burden, and walks into his kitchen, leaning against a worktop, his mind heavy with thoughts and plans."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Thao starts to walk away stops and looks back then goes Thao meets Walt near the house and Walt grabs his arm A cat scampers past and Walt draws his gun Thao starts to walk away stops and looks back then goes He runs into the living room where Thao is picking himself up having a minor neck injury Walt wanders off frowning Spider and one of his sidekicks come out of a house and walk over to a Honda parked by the curb They get in watched from across the road by Walt parked in his pickup truck who grimfacedly watches the Honda drive off Walt picks up his Colt 45 automatic and cocks it then talks to Daisy He gets out of the pickup truck Thao clings to his mother and sobs As Smokie comes out of the house Walt grabs him throws him onto the lawn and kicks him repeatedly in the face following up with a few punches A cat scampers past and Walt draws his gun In the evening it is raining as Walt drives his pickup truck back to his house Sue comes in with her face a bleeding mass of contusions He parks on his drive gets out with Daisy walks up the steps onto the porch and Daisy crosses his path Spider's car cruises down the street outside and as it passes Thao's house gang members discharge a couple of MAC10 machine guns into the building He bends down picks up a key from under an ornament winces as he straightens up and unlocks the door Spider and one of his sidekicks come out of a house and walk over to a Honda parked by the curb Walt cooks a barbeque for Sue Thao their mother and Youa Thao meets Walt near the house and Walt grabs his arm He and Daisy go inside Walt cooks a barbeque for Sue Thao their mother and Youa Youa and Thao grin and nod Walt points at the Gran Torino Walt sits in his living room with Daisy sipping a beer and watching a ball game on TV Spider's car cruises down the street outside and as it passes Thao's house gang members discharge a couple of MAC10 machine guns into the building Hearing the noise Walt leaps up and takes his Colt out of a drawer as bullets rip through Thao's house Walt runs out onto his porch as the Honda speeds away watches it go then runs down off the porch and dashes into Thao's house He runs into the living room where Thao is picking himself up having a minor neck injury Appalled Walt stares at Sue his mouth hanging open Walt wanders off frowning She comes downstairs and Thao makes a call turns to a grimfaced Walt and shakes his head then begins to sob Walt sits with Thao and his mother in their kitchen sipping a rice liquor Grandma sees a car go by outside and hurries to the door as everyone follows Sue comes in with her face a bleeding mass of contusions Watching Walt drops his glass Sue is helped to a chair by her mother and Grandma blood running down her face and legs Thao clings to his mother and sobs Appalled Walt stares at Sue his mouth hanging open Hearing the noise Walt leaps up and takes his Colt out of a drawer as bullets rip through Thao's house They get in watched from across the road by Walt parked in his pickup truck who grimfacedly watches the Honda drive off Grandma sees a car go by outside and hurries to the door as everyone follows He walks away from Thao's house pushing the Colt into his belt and walks into his kitchen leaning against a worktop As Smokie comes out of the house Walt grabs him throws him onto the lawn and kicks him repeatedly in the face following up with a few punches"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Thao meets Walt near the house and Walt grabs his arm. Thao starts to walk away stops and looks back then goes. Walt wanders off frowning. Spider and one of his sidekicks come out of a house and walk over to a Honda parked by the curb. They get in watched from across the road by Walt parked in his pickup truck who grimfacedly watches the Honda drive off. Walt picks up his Colt 45 automatic and cocks it then talks to Daisy. He gets out of the pickup truck. As Smokie comes out of the house Walt grabs him throws him onto the lawn and kicks him repeatedly in the face following up with a few punches. A cat scampers past and Walt draws his gun. In the evening it is raining as Walt drives his pickup truck back to his house. He parks on his drive gets out with Daisy walks up the steps onto the porch and Daisy crosses his path. He bends down picks up a key from under an ornament winces as he straightens up and unlocks the door. He and Daisy go inside. Walt cooks a barbeque for Sue Thao their mother and Youa. Youa and Thao grin and nod. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Walt points at the Gran Torino. Walt sits in his living room with Daisy sipping a beer and watching a ball game on TV. Spider's car cruises down the street outside and as it passes Thao's house gang members discharge a couple of MAC10 machine guns into the building. Hearing the noise Walt leaps up and takes his Colt out of a drawer as bullets rip through Thao's house. Walt runs out onto his porch as the Honda speeds away watches it go then runs down off the porch and dashes into Thao's house. He runs into the living room where Thao is picking himself up having a minor neck injury. She comes downstairs and Thao makes a call turns to a grimfaced Walt and shakes his head then begins to sob. Walt sits with Thao and his mother in their kitchen sipping a rice liquor. Grandma sees a car go by outside and hurries to the door as everyone follows. Sue comes in with her face a bleeding mass of contusions. Watching Walt drops his glass. Sue is helped to a chair by her mother and Grandma blood running down her face and legs. Thao clings to his mother and sobs. Appalled Walt stares at Sue his mouth hanging open. He walks away from Thao's house pushing the Colt into his belt and walks into his kitchen leaning against a worktop."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Thao meets Walt near the house and Walt grabs his arm. Thao starts to walk away stops and looks back then goes. Walt wanders off frowning. Spider and one of his sidekicks come out of a house and walk over to a Honda parked by the curb. They get in watched from across the road by Walt parked in his pickup truck who grimfacedly watches the Honda drive off. Walt picks up his Colt 45 automatic and cocks it then talks to Daisy. He gets out of the pickup truck. As Smokie comes out of the house Walt grabs him throws him onto the lawn and kicks him repeatedly in the face following up with a few punches. A cat scampers past and Walt draws his gun. In the evening it is raining as Walt drives his pickup truck back to his house. He parks on his drive gets out with Daisy walks up the steps onto the porch and Daisy crosses his path. He bends down picks up a key from under an ornament winces as he straightens up and unlocks the door. He and Daisy go inside. Walt cooks a barbeque for Sue Thao their mother and Youa. Youa and Thao grin and nod. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Walt points at the Gran Torino. Walt sits in his living room with Daisy sipping a beer and watching a ball game on TV. Spider's car cruises down the street outside and as it passes Thao's house gang members discharge a couple of MAC10 machine guns into the building. Hearing the noise Walt leaps up and takes his Colt out of a drawer as bullets rip through Thao's house. Walt runs out onto his porch as the Honda speeds away watches it go then runs down off the porch and dashes into Thao's house. He runs into the living room where Thao is picking himself up having a minor neck injury. She comes downstairs and Thao makes a call turns to a grimfaced Walt and shakes his head then begins to sob. Walt sits with Thao and his mother in their kitchen sipping a rice liquor. Grandma sees a car go by outside and hurries to the door as everyone follows. Sue comes in with her face a bleeding mass of contusions. Watching Walt drops his glass. Sue is helped to a chair by her mother and Grandma blood running down her face and legs. Thao clings to his mother and sobs. Appalled Walt stares at Sue his mouth hanging open. He walks away from Thao's house pushing the Colt into his belt and walks into his kitchen leaning against a worktop."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Thao meets Walt near the house and Walt grabs his arm. Thao starts to walk away stops and looks back then goes. Walt wanders off frowning. Spider and one of his sidekicks come out of a house and walk over to a Honda parked by the curb. They get in watched from across the road by Walt parked in his pickup truck who grimfacedly watches the Honda drive off. Walt picks up his Colt 45 automatic and cocks it then talks to Daisy. He gets out of the pickup truck. As Smokie comes out of the house Walt grabs him throws him onto the lawn and kicks him repeatedly in the face following up with a few punches. Grandma sees a car go by outside and hurries to the door as everyone follows. Sue comes in with her face a bleeding mass of contusions. Watching Walt drops his glass. Sue is helped to a chair by her mother and Grandma blood running down her face and legs. Thao clings to his mother and sobs. Appalled Walt stares at Sue his mouth hanging open. He walks away from Thao's house pushing the Colt into his belt and walks into his kitchen leaning against a worktop."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Thao meets Walt near the house and Walt grabs his arm. Thao starts to walk away stops and looks back then goes. Walt wanders off frowning. Thao clings to his mother and sobs. Appalled Walt stares at Sue his mouth hanging open. He walks away from Thao's house pushing the Colt into his belt and walks into his kitchen leaning against a worktop."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Spider meets a dog near the house, and the dog grabs his arm. Spider starts to walk away, stops and looks back, then goes. The dog wanders off, frowning. A tree and one of its branches come out of a house and walk over to a Honda parked by the curb. They get in, watched from across the road by the dog, parked in its pickup truck, who grim-facedly watches the Honda drive off. The dog picks up its Colt .45 automatic and cocks it, then talks to a lamp. It gets out of the pickup truck. As a shadow comes out of the house, the dog grabs it, throws it onto the lawn, and kicks it repeatedly in the face, following up with a few punches. A mouse scampers past, and the dog draws its gun. In the evening, it's raining as the dog drives its pickup truck back to its house. It parks on its drive, gets out with the lamp, walks up the steps onto the porch, and the lamp crosses its path. It bends down, picks up a key from under an ornament, winces as it straightens up, and unlocks the door. It and the lamp go inside. The dog cooks a barbeque for a book, a shadow, their mother, and a chair. A chair and a shadow grin and nod. The dog points at the Gran Torino. The dog sits in its living room with the lamp, sipping a beer and watching a ball game on TV. A tree's car cruises down the street outside, and as it passes a shadow's house, gang members discharge a couple of MAC-10 machine guns into the building. Hearing the noise, the dog leaps up and takes its Colt out of a drawer as bullets rip through a shadow's house. The dog runs out onto its porch as the Honda speeds away, watches it go, then runs down off the porch and dashes into a shadow's house. It runs into the living room where a shadow is picking itself up, having a minor neck injury. He comes downstairs, and a shadow makes a call, turns to a grim-faced dog, and shakes its head, then begins to sob. The dog sits with a shadow and its mother in their kitchen, sipping a rice liquor. A table sees a car go by outside and hurries to the door as everyone follows. A lamp comes in with its face a bleeding mass of contusions. Watching, the dog drops its glass. The lamp is helped to a chair by its mother and a table, blood running down its face and legs. A shadow clings to its mother and sobs. Appalled, the dog stares at the lamp, its mouth hanging open. It walks away from a shadow's house, pushing the Colt into its belt, and walks into its kitchen, leaning against a worktop."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Thao meets Walt near the library, and Walt grabs his arm. Thao starts to walk away, stops and looks back, then goes. Walt wanders off, frowning. Spider and one of his sidekicks come out of a bakery and walk over to a Toyota parked by the curb. They get in, watched from across the road by Walt, parked in his convertible, who grim-facedly watches the Toyota drive off. Walt picks up his Smith & Wesson revolver and cocks it, then talks to Bella. He gets out of the convertible. As Smokie comes out of the bakery, Walt grabs him, throws him onto the playground, and kicks him repeatedly in the shoulder, following up with a few punches. A squirrel scampers past, and Walt draws his sword. In the evening, it's snowing as Walt drives his convertible back to his apartment. He parks on his drive, gets out with Bella, walks up the steps onto the porch, and Bella crosses his path. He bends down, picks up a book from under a sculpture, winces as he straightens up, and unlocks the gate. He and Bella go inside. Walt prepares a stir-fry for Sue, Thao, their mother, and Youa. Youa and Thao grin and nod. Walt points at the Buick Skylark. Walt sits in his living room with Bella, sipping a lemonade and watching a cooking show on TV. Spider's minivan cruises down the street outside, and as it passes Thao's apartment, gang members discharge a couple of AK-47 rifles into the building. Hearing the noise, Walt leaps up and takes his Smith & Wesson out of a cabinet as bullets rip through Thao's apartment. Walt runs out onto his porch as the Toyota speeds away, watches it go, then runs down off the porch and dashes into Thao's apartment. He runs into the living room where Thao is picking himself up, having a minor arm injury. She comes downstairs, and Thao makes a call, turns to a grim-faced Walt, and shakes his head, then begins to sob. Walt sits with Thao and his mother in their dining room, sipping a herbal tea. Grandma sees a van go by outside and hurries to the door as everyone follows. Sue comes in with her face a bruised mass of cuts. Watching, Walt drops his cup. Sue is helped to a sofa by her mother and Grandma, blood running down her arms and legs. Thao clings to his mother and sobs. Appalled, Walt stares at Sue, his mouth hanging open. He walks away from Thao's apartment, pushing the Smith & Wesson into his belt, and walks into his dining room, leaning against a table."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Thao encounters Walt near the house, and Walt taps his shoulder. Thao begins to jog away, halts and glances back, then continues. Walt strolls off, grimacing. Spider and one of his sidekicks emerge from a house and saunter over to a Honda parked by the curb. They settle in, observed from across the road by Walt, seated in his pickup truck, who expressionlessly watches the Honda roll away. Walt reaches for his Colt .45 automatic and polishes it, then whispers to Daisy. He steps out of the pickup truck. As Smokie exits the house, Walt approaches him, nudges him onto the lawn, and nudges him repeatedly in the side, following up with a few shoves. A cat prances past, and Walt waves his gun. In the evening, it's drizzling as Walt maneuvers his pickup truck back to his house. He idles on his drive, steps out with Daisy, strolls up the steps onto the porch, and Daisy skips by him. He kneels down, retrieves a key from under an ornament, groans as he straightens up, and opens the door. He and Daisy step inside. Walt prepares a salad for Sue, Thao, their mother, and Youa. Youa and Thao chuckle and wave. Walt gestures at the Gran Torino. Walt relaxes in his living room with Daisy, sipping a beer and listening to a jazz record. Spider's car rolls down the street outside, and as it passes Thao's house, gang members toss a couple of rocks at the building. Hearing the commotion, Walt rises and retrieves his Colt from a drawer as stones crack against Thao's house. Walt rushes out onto his porch as the Honda zooms away, watches it leave, then dashes down off the porch and races into Thao's house. He rushes into the living room where Thao is pulling himself up, having a light shoulder injury. She descends the stairs, and Thao sends a text, turns to a grim-faced Walt, and shrugs, then begins to weep. Walt sits with Thao and his mother in their kitchen, sipping a warm tea. Grandma notices a bird fly by outside and rushes to the window as everyone watches. Sue appears with her face a swollen mass of bruises. Watching, Walt drops his pen. Sue is guided to a couch by her mother and Grandma, bruising down her face and arms. Thao clutches his mother and cries. Shocked, Walt gapes at Sue, his mouth agape. He strolls away from Thao's house, tucking the Colt into his belt, and ambles into his kitchen, leaning against a cabinet."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Milo meets Carl near the barn, and Carl grabs its knee. Milo starts to hop away, stops and glances back, then hops along. Carl ambles off, grumbling. Falcon and one of its assistants emerge from a barn and stroll over to a bicycle parked by the hedge. They hop on, watched from across the meadow by Carl, parked in its unicycle, who sternly watches the bicycle roll away. Carl picks up its spatula and adjusts it, then talks to Mabel. It hops out of the unicycle. As Dusty emerges from the barn, Carl grabs it, flings it onto the meadow, and nudges it repeatedly in the nose, following up with a few jabs. A turtle scampers past, and Carl brandishes its spatula. In the evening, it's hailing as Carl pedals its unicycle back to its barn. It parks on its path, hops out with Mabel, hops up the ladder onto the balcony, and Mabel crosses its trail. It crouches down, picks up a pin from under a sculpture, grimaces as it stands up, and unlocks the gate. It and Mabel hop inside. Carl prepares a sandwich for Zoe, Milo, their aunt, and Aria. Aria and Milo beam and wave. Carl gestures at the Mustang. Carl sits in its den with Mabel, sipping lemonade and watching a chess match on a laptop. Falcon's scooter glides down the path outside, and as it passes Milo's barn, band members release a couple of water pistols into the structure. Hearing the commotion, Carl jumps up and takes its spatula out of a basket as water splashes through Milo's barn. Carl bounds out onto its balcony as the bicycle zooms away, watches it depart, then bounds down off the balcony and dashes into Milo's barn. It hops into the den where Milo is lifting itself up, having a minor paw injury. She descends the ladder, and Milo makes a call, turns to a stern-faced Carl, and shakes its elbow, then begins to wail. Carl sits with Milo and its aunt in their pantry, sipping a herbal tea. Auntie sees a scooter roll by outside and rushes to the portal as everyone follows. Zoe enters with her snout a dripping mass of scrapes. Watching, Carl drops its mug. Zoe is assisted to a bench by her aunt and Auntie, water trickling down her snout and toes. Milo clings to its aunt and wails. Horrified, Carl gapes at Zoe, its jaw hanging slack. It hops away from Milo's barn, tucking the spatula into its apron, and hops into its pantry, slumping against a countertop."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Marcy encounters Frank near the cabin, and Frank shakes her hand. Marcy begins to jog away, pauses and glances back, then continues. Frank ambles off, scowling. Rat and one of his companions emerge from a trailer and stroll over to a Ford parked by the sidewalk. They hop in, observed from down the street by Frank, parked in his sedan, who sternly observes the Ford roll away. Frank retrieves his Beretta and loads it, then chats with Bella. He steps out of the sedan. As Shadow emerges from the trailer, Frank seizes her, flings her onto the grass, and stomps her repeatedly in the chest, following up with a few slaps. A rabbit darts past, and Frank raises his weapon. At nightfall, it's drizzling as Frank guides his sedan back to his cabin. He stops on his drive, exits with Bella, trots up the steps onto the veranda, and Bella skirts around him. He kneels down, retrieves a coin from beneath a sculpture, grimaces as he rises, and opens the entrance. He and Bella step inside. Frank prepares a cookout for Leo, Marcy, their father, and Lou. Lou and Marcy chuckle and wave. Frank gestures at the Mustang. Frank lounges in his den with Bella, sipping a cider and observing a horse race on TV. Rat's vehicle glides down the avenue outside, and as it edges past Marcy's cabin, gang members unload a couple of Uzi guns into the structure. Hearing the commotion, Frank springs up and retrieves his Beretta from a cabinet as bullets tear through Marcy's cabin. Frank bolts onto his veranda as the Ford races away, observes it leave, then sprints off the veranda and darts into Marcy's cabin. He rushes into the lounge where Marcy is rising, bearing a slight shoulder injury. He descends the stairs, and Marcy sends a message, turns to a stern Frank, and nods his head, then starts to weep. Frank sits with Marcy and her father in their dining room, sipping a herbal tea. Auntie spots a bike cruise past outside and dashes to the window as everyone trails behind. Leo enters with his face a bruised and swollen mess. Gazing, Frank drops his mug. Leo is aided to a sofa by his father and Auntie, blood streaking down his face and arms. Marcy clutches her father and cries. Horrified, Frank gazes at Leo, his jaw agape. He strides away from Marcy's cabin, tucking the Beretta into his waistband, and ambles into his dining room, leaning against a table."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Thao meets Walt near the tree, and Walt taps his shoulder. Thao begins to dance away, halts and gazes back, then continues. Walt strolls away, grinning. Spider and one of his sidekicks emerge from a barn and saunter over to a bicycle parked by the mailbox. They hop on, observed from across the field by Walt, leaning against his motorcycle, who grim-facedly watches the bicycle pedal away. Walt picks up his slingshot and loads it, then converses with Daisy. He dismounts the motorcycle. As Smokie exits the barn, Walt hugs him, rolls him onto the garden, and nudges him repeatedly in the knee, following up with a few tickles. A dog bounds past, and Walt swings his sword. In the evening, it's snowing as Walt cycles his motorcycle back to his barn. He parks on his path, dismounts with Daisy, jogs up the stairs onto the deck, and Daisy circles his legs. He crouches down, lifts a pebble from under a sprite, groans as he straightens up, and locks the gate. He and Daisy step inside. Walt grills a pizza for Sue, Thao, their sister, and Youa. Youa and Thao giggle and wink. Walt gestures at the motorcycle. Walt reclines in his hallway with Daisy, savoring a soda and observing a puppet show on TV. Spider's scooter coasts down the lane outside, and as it passes Thao's barn, gang members unleash a couple of water balloons into the structure. Hearing the ruckus, Walt hops up and retrieves his slingshot from a basket as streams of water cascade through Thao's barn. Walt dashes out onto his deck as the bicycle accelerates away, observes it depart, then sprints down off the deck and races into Thao's barn. He bursts into the hallway where Thao is dusting himself off, having a minor shoulder injury. She descends the staircase, and Thao sends a message, turns to a stoic Walt, and nods, then begins to chuckle. Walt relaxes with Thao and his sister in their lounge, sipping a herbal tea. Grandma notices a kite glide by outside and rushes to the window as everyone follows. Sue enters with her expression a bruised mask of surprise. Watching, Walt drops his cupcake. Sue is led to a hammock by her sister and Grandma, rain trickling down her cheeks and arms. Thao grips his sister and chuckles. Astonished, Walt gapes at Sue, his eyes wide. He wanders away from Thao's barn, tucking the slingshot into his waistband, and strolls into his lounge, leaning against a counter."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Miles encounters Fern beside the lighthouse, and Fern pulls her sleeve. Miles attempts to fly over, pauses and turns around, then flutters away. Fern drifts off, scowling. Chipmunk and one of her colleagues tumble out of a cabin and glide over to a bicycle stationed by the hedges. They hop on, observed from across the meadow by Fern, perched in her rowboat, who sternly observes the bicycle float away. Fern retrieves her slingshot and loads it, then sings to Muffin. She steps out of the rowboat. As Hurricane tumbles out of the cabin, Fern seizes him, hurls him onto the sand, and stomps him repeatedly in the elbow, following up with a few nods. A bird flutters past, and Fern raises her wand. In the night, it's snowing as Fern sails her rowboat back to her lighthouse. She anchors on her bay, steps out with Muffin, strolls up the ramp onto the terrace, and Muffin skips across her trail. She kneels down, lifts a feather from beneath a pebble, winces as she rises, and locks the gate. She and Muffin enter the lighthouse. Fern prepares a pie for Tara, Miles, their aunt, and Tia. Tia and Miles beam and shake their heads. Fern gestures at the Model A. Fern reclines in her dining room with Muffin, sipping lemonade and watching a puppet show on TV. Chipmunk's boat floats down the canal outside, and as it glides past Miles's lighthouse, pack members release a couple of harpoons into the structure. Hearing the commotion, Fern springs up and fishes her slingshot out of a basket as arrows tear through Miles's lighthouse. Fern dashes out onto her terrace as the bicycle zooms away, watches it vanish, then leaps off the terrace and rushes into Miles's lighthouse. She races into the dining room where Miles is hoisting himself up, having a slight toe injury. He descends the staircase, and Miles sends a smoke signal, turns to a stern-faced Fern, and nods his head, then begins to snicker. Fern lounges with Miles and his aunt in their pantry, sipping a herbal tea. Auntie notices a hot air balloon float by outside and rushes to the archway as everyone follows. Tara enters with her face a bruised mosaic of blotches. Observing, Fern spills her jug. Tara is assisted to a stool by her aunt and Auntie, paint dripping down her face and arms. Miles clutches his aunt and giggles. Shocked, Fern observes Tara, her jaw agape. She tiptoes away from Miles's lighthouse, tucking the slingshot into her scarf, and wanders into her pantry, resting against a bench."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Walt encounters Thao and grabs his arm before Thao leaves. Spider and his associate enter a Honda and drive off, observed by Walt from his pickup truck. Walt retrieves his Colt .45 and confronts Smokie, violently attacking him. Later, Walt returns home with Daisy, enters his house, and hosts a barbeque for Sue, Thao, their mother, and Youa, pointing at his Gran Torino. While Walt watches TV, Spider's car passes and gang members shoot into Thao's house. Alarmed, Walt grabs his Colt and rushes to Thao's. He finds Thao with a minor injury and, after learning of the attack, comforts Thao and his family. Sue arrives, severely injured, and Walt, shocked, drops his glass. Sue is cared for by her family as Walt, appalled, leaves, tucking his Colt into his belt before retreating to his kitchen."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He walks away from Thao's house pushing the Colt into his belt and walks into his kitchen leaning against a worktop Appalled Walt stares at Sue his mouth hanging open Thao clings to his mother and sobs Sue is helped to a chair by her mother and Grandma blood running down her face and legs Watching Walt drops his glass Sue comes in with her face a bleeding mass of contusions Grandma sees a car go by outside and hurries to the door as everyone follows Walt sits with Thao and his mother in their kitchen sipping a rice liquor She comes downstairs and Thao makes a call turns to a grimfaced Walt and shakes his head then begins to sob He runs into the living room where Thao is picking himself up having a minor neck injury Walt runs out onto his porch as the Honda speeds away watches it go then runs down off the porch and dashes into Thao's house Hearing the noise Walt leaps up and takes his Colt out of a drawer as bullets rip through Thao's house Spider's car cruises down the street outside and as it passes Thao's house gang members discharge a couple of MAC10 machine guns into the building Walt sits in his living room with Daisy sipping a beer and watching a ball game on TV Walt points at the Gran Torino Youa and Thao grin and nod Walt cooks a barbeque for Sue Thao their mother and Youa He and Daisy go inside He bends down picks up a key from under an ornament winces as he straightens up and unlocks the door He parks on his drive gets out with Daisy walks up the steps onto the porch and Daisy crosses his path In the evening it is raining as Walt drives his pickup truck back to his house A cat scampers past and Walt draws his gun As Smokie comes out of the house Walt grabs him throws him onto the lawn and kicks him repeatedly in the face following up with a few punches He gets out of the pickup truck Walt picks up his Colt 45 automatic and cocks it then talks to Daisy They get in watched from across the road by Walt parked in his pickup truck who grimfacedly watches the Honda drive off Spider and one of his sidekicks come out of a house and walk over to a Honda parked by the curb Walt wanders off frowning Thao starts to walk away stops and looks back then goes Thao meets Walt near the house and Walt grabs his arm"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Walt runs out onto his porch as the Honda speeds away watches it go then runs down off the porch and dashes into Thao's house Youa and Thao grin and nod He parks on his drive gets out with Daisy walks up the steps onto the porch and Daisy crosses his path Sue is helped to a chair by her mother and Grandma blood running down her face and legs Walt sits with Thao and his mother in their kitchen sipping a rice liquor He gets out of the pickup truck Walt picks up his Colt 45 automatic and cocks it then talks to Daisy He and Daisy go inside He bends down picks up a key from under an ornament winces as he straightens up and unlocks the door Walt points at the Gran Torino In the evening it is raining as Walt drives his pickup truck back to his house Watching Walt drops his glass He walks away from Thao's house pushing the Colt into his belt and walks into his kitchen leaning against a worktop She comes downstairs and Thao makes a call turns to a grimfaced Walt and shakes his head then begins to sob Walt sits in his living room with Daisy sipping a beer and watching a ball game on TV Thao clings to his mother and sobs Thao starts to walk away stops and looks back then goes Walt cooks a barbeque for Sue Thao their mother and Youa Hearing the noise Walt leaps up and takes his Colt out of a drawer as bullets rip through Thao's house Walt wanders off frowning Spider's car cruises down the street outside and as it passes Thao's house gang members discharge a couple of MAC10 machine guns into the building Appalled Walt stares at Sue his mouth hanging open They get in watched from across the road by Walt parked in his pickup truck who grimfacedly watches the Honda drive off Sue comes in with her face a bleeding mass of contusions As Smokie comes out of the house Walt grabs him throws him onto the lawn and kicks him repeatedly in the face following up with a few punches A cat scampers past and Walt draws his gun Grandma sees a car go by outside and hurries to the door as everyone follows Thao meets Walt near the house and Walt grabs his arm Spider and one of his sidekicks come out of a house and walk over to a Honda parked by the curb He runs into the living room where Thao is picking himself up having a minor neck injury"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Walt points at the Gran Torino Walt sits in his living room with Daisy sipping a beer and watching a ball game on TV Spider's car cruises down the street outside and as it passes Thao's house gang members discharge a couple of MAC10 machine guns into the building Hearing the noise Walt leaps up and takes his Colt out of a drawer as bullets rip through Thao's house Walt runs out onto his porch as the Honda speeds away watches it go then runs down off the porch and dashes into Thao's house He runs into the living room where Thao is picking himself up having a minor neck injury She comes downstairs and Thao makes a call turns to a grimfaced Walt and shakes his head then begins to sob Walt sits with Thao and his mother in their kitchen sipping a rice liquor Grandma sees a car go by outside and hurries to the door as everyone follows Sue comes in with her face a bleeding mass of contusions Watching Walt drops his glass Sue is helped to a chair by her mother and Grandma blood running down her face and legs Thao clings to his mother and sobs Appalled Walt stares at Sue his mouth hanging open He walks away from Thao's house pushing the Colt into his belt and walks into his kitchen leaning against a worktop Thao meets Walt near the house and Walt grabs his arm Thao starts to walk away stops and looks back then goes Walt wanders off frowning Spider and one of his sidekicks come out of a house and walk over to a Honda parked by the curb They get in watched from across the road by Walt parked in his pickup truck who grimfacedly watches the Honda drive off Walt picks up his Colt 45 automatic and cocks it then talks to Daisy He gets out of the pickup truck As Smokie comes out of the house Walt grabs him throws him onto the lawn and kicks him repeatedly in the face following up with a few punches A cat scampers past and Walt draws his gun In the evening it is raining as Walt drives his pickup truck back to his house He parks on his drive gets out with Daisy walks up the steps onto the porch and Daisy crosses his path He bends down picks up a key from under an ornament winces as he straightens up and unlocks the door He and Daisy go inside Walt cooks a barbeque for Sue Thao their mother and Youa Youa and Thao grin and nod"
        }
      ]
    }
  ]
}