{
  "ground_truth": "Ron's hair is turning red, and they turn and run out of the common room. Back in the girls' lavatory, Myrtle floats past. Still in uniform, Hermione has become a cat. Outside, the lightning flashes, and inside, Ron and Harry walk upstairs where they stop as they find a pool of water on the landing. They run through it, and in the girls' lavatory, all the taps are running. Harry and Ron look around at the overflowing sinks and spot Myrtle sitting high up on a curved stone windowsill. Ron flinches as she floats past, and Harry notices a book with a limp, black leather cover lying on the stone floor. He picks it up and shakes off the water, but the book is soaking wet. Later, he sits at his desk and flicks through the dried-out pages, which are all blank. He flicks through the book again and sees a name stamped in gold letters on the back. He puts the book down, picks up a quill, and dips it into the inkwell. As he goes to write on the first empty page, a drop of ink falls from the quill, hits the paper, and slowly disappears. Harry turns over the page, but the ink blot has vanished. He dips his quill again and starts to write. His words fade into the paper, but other words appear. Harry writes again, and the answer appears on the page. Harry leans back, disappointed, but more words appear. The blank pages turn themselves over quickly, and he picks up the book with both hands and stares at it. A bright light shines out of the pages, dazzling Harry. As he disappears, the book on his desk closes. Stepping back into the past, Harry reappears in a school corridor and warily approaches the foot of a wide staircase. A teenage boy in Hogwarts uniform is standing at the bend of the stairs, staring at the landing above. Harry slowly goes up the stairs towards him, follows his gaze, and sees four people carrying down a stretcher covered with a sheet. As they pass Harry, he sees a limp arm sticking out from under the sheet. A man with a long, brown beard appears at the top of the stairs, and Harry looks up in surprise as Dumbledore gives him a searching look. Riddle leaves, turns into a wide corridor licked by flaming torches, and hurries along until he reaches the top of a narrow flight of stone steps. Harry follows him down the steps into a gloomy corridor with rough stone walls. Riddle approaches a heavy wooden door, takes out his wand, and looks around warily before throwing open the door to reveal a shadowy figure bending over a large wooden box.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Ron's tresses are changing scarlet, and they spin and dash out of the shared chamber. Back in the girls' restroom, Myrtle drifts by. Still in attire, Hermione has turned into a feline. Outside, the lightning blazes, and inside, Ron and Harry stroll upstairs where they halt as they discover a puddle of liquid on the landing. They dash through it, and in the girls' restroom, all the faucets are flowing. Harry and Ron glance around at the brimming basins and notice Myrtle perched high up on a curved stone windowsill. Ron recoils as she drifts by, and Harry observes a book with a limp, ebony leather cover resting on the stone ground. He lifts it and shakes off the liquid, but the book is drenched. Later, he sits at his desk and flicks through the dried-out pages, which are all void. He flicks through the book again and detects a name embossed in gold letters on the back. He places the book down, takes up a quill, and immerses it into the inkwell. As he proceeds to inscribe on the first vacant page, a droplet of ink falls from the quill, strikes the sheet, and gradually vanishes. Harry turns over the page, but the ink blot has disappeared. He dips his quill again and begins to inscribe. His words vanish into the sheet, but other words surface. Harry inscribes again, and the reply surfaces on the page. Harry reclines back, disappointed, but more words surface. The void pages turn themselves over swiftly, and he grips the book with both hands and gazes at it. A radiant light gleams out of the pages, blinding Harry. As he vanishes, the book on his desk shuts. Stepping back into the past, Harry materializes in a school corridor and cautiously approaches the base of a wide staircase. A teenage lad in Hogwarts attire is standing at the bend of the steps, gazing at the landing above. Harry slowly ascends the steps towards him, follows his gaze, and sees four individuals bearing down a stretcher draped with a sheet. As they pass Harry, he observes a limp arm protruding out from beneath the sheet. A man with a lengthy, brown beard appears at the top of the steps, and Harry glances up in astonishment as Dumbledore gives him a scrutinizing look. Riddle departs, turns into a wide passageway licked by blazing torches, and hastens along until he arrives at the top of a narrow flight of stone stairs. Harry follows him down the stairs into a dim passageway with coarse stone walls. Riddle approaches a hefty wooden door, takes out his wand, and glances around cautiously before flinging open the door to disclose a murky figure bending over a large wooden chest."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Ron's hair is being turned red, and the common room is turned and run out of by them. Back in the girls' lavatory, Myrtle is floated past by Hermione. Still in uniform, a cat has been become by Hermione. Outside, the lightning is flashed, and inside, the stairs are walked up by Ron and Harry where a pool of water is stopped at by them on the landing. It is run through by them, and in the girls' lavatory, someone is running all the taps. Around at the overflowing sinks are looked by Harry and Ron, and Myrtle is spotted sitting high up on a curved stone windowsill. Ron is flinched by her as she floats past, and a book with a limp, black leather cover is noticed lying on the stone floor by Harry. It is picked up by him, and the water is shaken off, but the book is soaking wet. Later, his desk is sat at by him, and the dried-out pages, which are all blank, are flicked through. The book is flicked through again, and a name stamped in gold letters is seen on the back. The book is put down by him, and a quill is picked up and dipped into the inkwell. As the first empty page is gone to be written on, a drop of ink is fallen from the quill, and the paper is hit by it, disappearing slowly. The page is turned over by Harry, but someone has vanished the ink blot. Again, his quill is dipped, and the writing is started by him. His words are faded into the paper, but other words are appeared. Again, something is written by Harry, and on the page, the answer appears. Disappointed, back is leaned by Harry, but more words are appeared. The blank pages are quickly turned over themselves, and the book is picked up with both hands and stared at by him. Out of the pages, a bright light is shone, dazzling Harry. As he disappears, the book on his desk is closed. Stepping back into the past, in a school corridor, Harry reappears and a wide staircase is approached warily by him at the foot. At the bend of the stairs, a teenage boy in Hogwarts uniform is standing, staring at the landing above. Up the stairs, Harry slowly goes towards him, follows his gaze, and four people are seen carrying down a stretcher covered with a sheet. As they pass Harry, a limp arm is seen sticking out from under the sheet by him. At the top of the stairs, a man with a long, brown beard appears, and in surprise, up is looked by Harry as him a searching look is given by Dumbledore. Riddle leaves, a wide corridor licked by flaming torches is turned into, and along is hurried until a narrow flight of stone steps is reached by him at the top. Down the steps, Harry follows him into a gloomy corridor with rough stone walls. A heavy wooden door is approached by Riddle, his wand is taken out, and the door is thrown open by him after around is looked warily to reveal a shadowy figure bending over a large wooden box."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Ron's hair turns red, and they run out of the common room. In the girls' lavatory, Myrtle floats by. Hermione, still in uniform, has become a cat. Lightning flashes outside as Ron and Harry head upstairs, stopping at a pool of water on the landing. They rush through it to find all the taps running in the lavatory. They see Myrtle on a windowsill, and Harry notices a soaking wet book on the floor. Later, he flicks through its dried pages, finding them blank. He writes with a quill, but the ink disappears, replaced by other words. Disappointed, he watches as more words appear, and a bright light from the pages dazzles him. Harry vanishes, and the book closes. He reappears in a school corridor, approaching a staircase where a teenage boy in a Hogwarts uniform stares at a stretcher being carried down. A limp arm protrudes from under the sheet. Dumbledore appears, giving Harry a searching look. Riddle leaves, entering a torch-lit corridor, and hurries to a narrow stone staircase. Harry follows him into a gloomy corridor, where Riddle opens a heavy wooden door to reveal a shadowy figure bending over a large wooden box."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Ron's hair turns red, and they run from the common room. In the girls' lavatory, Myrtle floats by. Hermione, still in uniform, is now a cat. Lightning flashes outside as Ron and Harry find water on the landing. They run through it to the lavatory, where taps overflow. They see Myrtle on a windowsill, and Harry notices a soaking wet book on the floor. Later, he flicks through its blank pages and sees a name in gold letters. As he writes, the ink disappears, but other words appear. Disappointed, Harry watches as a bright light from the book dazzles him, and he vanishes. Reappearing in a school corridor, he approaches a staircase where a boy in Hogwarts uniform stares at a stretcher. As it passes, Harry sees a limp arm. Dumbledore appears, giving Harry a searching look. Riddle leaves, enters a torch-lit corridor, and hurries to a narrow stone staircase. Harry follows him to a gloomy corridor, where Riddle opens a door to reveal a shadowy figure over a large box."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Ron's hair is gradually turning a vivid shade of red, prompting them to quickly turn around and dash out of the bustling common room. Back in the dimly lit girls' lavatory, the ghostly figure of Myrtle floats by, her presence as ethereal as ever. Hermione, still clad in her school uniform, has astonishingly transformed into a cat. Outside, the sky is alive with flashes of lightning, while inside, Ron and Harry make their way upstairs. They come to an abrupt halt upon discovering a pool of water spreading across the landing. Without hesitation, they sprint through the water, arriving at the girls' lavatory where all the taps are gushing uncontrollably. Harry and Ron survey the scene, taking in the sight of the overflowing sinks, and soon spot Myrtle perched high on a curved stone windowsill. Ron instinctively flinches as she drifts past, and Harry's attention is drawn to a book lying on the stone floor, its cover made of limp, black leather. He picks it up, shaking off the excess water, but the book remains thoroughly soaked. Later, seated at his desk, Harry flips through the now dried-out pages, only to find them all blank. He flips through the book once more and notices a name elegantly stamped in gold letters on the back cover. Setting the book down, he picks up a quill, dipping it into the inkwell. As he prepares to write on the first empty page, a solitary drop of ink falls from the quill, landing on the paper, and slowly vanishes. Harry turns the page, but the ink blot has mysteriously disappeared. He dips his quill again and begins to write. His words fade into the paper, but to his astonishment, other words materialize. Harry writes once more, and an answer appears on the page. Leaning back in his chair, Harry feels a pang of disappointment, but more words continue to emerge. The blank pages turn themselves over with surprising speed, and he picks up the book with both hands, staring at it in wonder. A brilliant light suddenly bursts forth from the pages, dazzling Harry. As he vanishes, the book on his desk closes with a soft thud. Transported back into the past, Harry reappears in a school corridor, cautiously approaching the base of a wide staircase. A teenage boy, dressed in a Hogwarts uniform, stands at the bend of the stairs, his gaze fixed intently on the landing above. Harry ascends the stairs slowly, following the boy's line of sight, and sees four individuals carrying a stretcher draped with a sheet. As they pass by Harry, he catches sight of a limp arm protruding from beneath the sheet. A man with a long, brown beard emerges at the top of the stairs, and Harry looks up in surprise as Dumbledore gives him a searching, penetrating look. Riddle departs, turning into a wide corridor illuminated by flickering torches, and hurries along until he reaches the top of a narrow flight of stone steps. Harry follows him down the steps into a dimly lit corridor with rough stone walls. Riddle approaches a heavy wooden door, cautiously takes out his wand, and glances around warily before dramatically throwing open the door to reveal a shadowy figure bending over a large wooden box."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Ron's hair is undergoing a slow transformation, gradually turning into a vivid shade of brilliant red, prompting them to quickly pivot on their heel and dash out of the bustling and lively common room. Back in the dimly lit and shadowy girls' lavatory, the ghostly apparition of Myrtle floats by, her presence as ethereal and otherworldly as ever. Hermione, still dressed in her customary school uniform, has astonishingly and inexplicably transformed into a cat. Outside, the sky is alive and vibrant with flashes of electrifying lightning, while inside the building, Ron and Harry make their way steadily upstairs. They come to an abrupt halt upon the unexpected discovery of a pool of water spreading across the entire landing. Without a moment's hesitation, they sprint through the water, arriving at the chaotic girls' lavatory where all the taps are gushing forth uncontrollably. Harry and Ron survey the entire chaotic scene, taking in the sight of the overflowing sinks, and soon spot Myrtle perched high on a curved stone windowsill. Ron instinctively flinches as she drifts past, and Harry's attention is drawn to a book lying on the cold stone floor, its cover made of limp, black leather. He picks it up, shaking off the excess water, but the book remains thoroughly soaked through. Later, seated quietly at his desk, Harry flips through the now dried-out pages, only to find them all completely blank. He flips through the book once more and notices a name elegantly stamped in gold letters on the back cover. Setting the book down, he picks up a quill, dipping it thoughtfully into the inkwell. As he prepares to write on the first empty page, a solitary drop of ink falls from the quill, dramatically landing on the paper, and slowly vanishes from sight. Harry turns the page, but the ink blot has mysteriously disappeared. He dips his quill again and begins to write. His words fade into the paper, but to his astonishment, other words materialize in response. Harry writes once more, and an answer appears on the page. Leaning back in his chair, Harry feels a pang of disappointment, but more words continue to emerge. The previously blank pages turn themselves over with surprising speed, and he picks up the book with both hands, staring at it in wonder and awe. A brilliant light suddenly bursts forth from the pages, dazzling Harry with its intensity. As he vanishes, the book on his desk closes with a soft thud. Transported back into the distant past, Harry reappears in a school corridor, cautiously approaching the base of a wide staircase. A teenage boy, dressed in a classic Hogwarts uniform, stands at the bend of the stairs, his gaze fixed intently on the landing above. Harry ascends the stairs slowly, following the boy's line of sight, and sees four individuals carrying a stretcher draped with a sheet. As they pass by Harry, he catches sight of a limp arm protruding from beneath the sheet. A man with a long, brown beard emerges at the top of the stairs, and Harry looks up in surprise as Dumbledore gives him a searching, penetrating look. Riddle departs, turning into a wide corridor illuminated by flickering torches, and hurries along until he reaches the top of a narrow flight of stone steps. Harry follows him down the steps into a dimly lit corridor with rough stone walls. Riddle approaches a heavy wooden door, cautiously takes out his wand, and glances around warily before dramatically throwing open the door to reveal a shadowy figure bending over a large wooden box."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Ron's hair begins to change color, turning a vivid red, prompting him to quickly pivot and sprint out of the common room with urgency. Meanwhile, back in the girls' lavatory, Myrtle, the ghost, drifts by, her ethereal form gliding effortlessly through the air. Hermione, still clad in her school uniform, has undergone a transformation and now resembles a cat, complete with feline features. Outside, a flash of lightning illuminates the sky, while inside, Ron and Harry make their way up the staircase, their footsteps echoing as they ascend. They come to an abrupt halt upon discovering a pool of water spreading across the landing. Without hesitation, they dash through the water, their shoes splashing as they go, and enter the girls' lavatory, where they are met with the sight of all the taps gushing water uncontrollably. As they survey the scene of overflowing sinks, their eyes are drawn to Myrtle, who is perched high on a curved stone windowsill. Ron involuntarily flinches as she floats past him, and Harry's attention is caught by a book lying on the stone floor, its limp, black leather cover soaked through. He bends down, picks up the book, and gives it a shake to rid it of excess water, though it remains thoroughly drenched. Later, seated at his desk, Harry carefully flicks through the pages of the now dried-out book, only to find them all blank. He flips through the book once more and notices a name embossed in gold letters on the back cover. Setting the book down, he reaches for a quill, dips it into the inkwell, and prepares to write on the first empty page. As he does so, a single drop of ink falls from the quill, lands on the paper, and mysteriously vanishes. Intrigued, Harry turns the page, but the ink blot is nowhere to be seen. Undeterred, he dips his quill again and begins to write, watching as his words fade into the paper, only to be replaced by other words that appear in response. Harry writes once more, and an answer materializes on the page. Leaning back in his chair, he feels a pang of disappointment, but more words continue to emerge. Suddenly, the blank pages start to turn themselves over rapidly, and Harry grasps the book with both hands, staring at it in astonishment. A brilliant light bursts forth from the pages, momentarily blinding Harry, and as he vanishes, the book on his desk snaps shut. Transported back in time, Harry finds himself in a school corridor, cautiously approaching the base of a wide staircase. A teenage boy, dressed in a Hogwarts uniform, stands at the bend of the stairs, his gaze fixed intently on the landing above. Harry ascends the stairs slowly, following the boy's line of sight, and observes four individuals carrying a stretcher draped with a sheet. As they pass by, Harry catches sight of a limp arm protruding from beneath the sheet. At the top of the stairs, a man with a long, brown beard appears, and Harry looks up in surprise as Dumbledore regards him with a penetrating stare. The boy, Riddle, departs, turning into a wide corridor illuminated by flickering torches, and hastens along until he reaches the top of a narrow flight of stone steps. Harry trails behind him, descending the steps into a dimly lit corridor with rough stone walls. Riddle approaches a heavy wooden door, retrieves his wand, and casts a cautious glance around before flinging the door open to reveal a shadowy figure hunched over a large wooden box."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Ron's hair turns red, prompting them to run out of the common room. In the girls' lavatory, Myrtle floats by as Hermione, still in uniform, has transformed into a cat. Outside, lightning flashes while Ron and Harry ascend the stairs, stopping at a pool of water on the landing. They rush through it to find all the taps running in the girls' lavatory, with Myrtle perched on a windowsill. As Ron flinches at her passing, Harry spots a soaking wet book on the floor, picks it up, and shakes off the water. Later, at his desk, he examines the dried-out, blank pages and notices a name in gold letters on the back. He attempts to write on the first page, but the ink disappears. As he writes again, words appear in response. Disappointed, he leans back, but more words emerge, and the pages turn rapidly. A bright light from the book dazzles Harry, and he vanishes, leaving the book to close on his desk. Reappearing in the past, Harry finds himself in a school corridor and cautiously approaches a staircase where a teenage boy in a Hogwarts uniform stands, watching a stretcher being carried down. As it passes, Harry glimpses a limp arm under the sheet. Dumbledore appears at the top of the stairs, exchanging a searching look with Harry. Riddle departs into a torch-lit corridor, hurrying to a narrow flight of stone steps. Harry follows him into a gloomy corridor, where Riddle approaches a heavy wooden door, draws his wand, and, after a wary glance, opens it to reveal a shadowy figure over a large wooden box."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Ron's hair is turning red, reflecting his family's Weasley heritage known for their fiery red locks, and they turn and run out of the common room, a bustling hub within Hogwarts Castle, the renowned school of witchcraft and wizardry. Back in the girls' lavatory, notorious for its ghostly resident, Myrtle, who haunts the area after a tragic incident during her school years, floats past. Still in uniform, Hermione has become a cat due to a mishap with a Polyjuice Potion, a complex brew that allows a person to take on the appearance of someone else. Outside, the lightning flashes in the tumultuous weather typical of the Scottish Highlands where Hogwarts is located, and inside, Ron and Harry walk upstairs where they stop as they find a pool of water on the landing, an unusual occurrence signaling a magical mishap. They run through it, and in the girls' lavatory, all the taps are running, creating a cascade of water. Harry and Ron look around at the overflowing sinks and spot Myrtle sitting high up on a curved stone windowsill, where she often retreats to sulk. Ron flinches as she floats past, and Harry notices a book with a limp, black leather cover lying on the stone floor, a mysterious tome that seems out of place. He picks it up and shakes off the water, but the book is soaking wet, its pages heavy with secrets. Later, he sits at his desk, a well-worn piece of furniture in the Gryffindor dormitory, and flicks through the dried-out pages, which are all blank, an enigma waiting to be unraveled. He flicks through the book again and sees a name stamped in gold letters on the back, hinting at ownership lost to time. He puts the book down, picks up a quill, and dips it into the inkwell, an essential tool for students at Hogwarts. As he goes to write on the first empty page, a drop of ink falls from the quill, hits the paper, and slowly disappears, revealing the book's magical properties. Harry turns over the page, but the ink blot has vanished. He dips his quill again and starts to write. His words fade into the paper, but other words appear, initiating a dialogue with the past. Harry writes again, and the answer appears on the page. Harry leans back, disappointed, but more words appear. The blank pages turn themselves over quickly, and he picks up the book with both hands and stares at it, entranced by its spellbinding nature. A bright light shines out of the pages, dazzling Harry. As he disappears, the book on his desk closes, the portal to the past now opened. Stepping back into the past, Harry reappears in a school corridor, steeped in history and the legacy of countless students, and warily approaches the foot of a wide staircase. A teenage boy in Hogwarts uniform is standing at the bend of the stairs, staring at the landing above, his posture tense with anticipation. Harry slowly goes up the stairs towards him, follows his gaze, and sees four people carrying down a stretcher covered with a sheet, a scene heavy with a sense of foreboding. As they pass Harry, he sees a limp arm sticking out from under the sheet, a chilling reminder of the dangers lurking within the castle's walls. A man with a long, brown beard appears at the top of the stairs, and Harry looks up in surprise as Dumbledore, the esteemed headmaster known for his wisdom and formidable magical prowess, gives him a searching look. Riddle, later revealed as Tom Riddle, who would grow into the dark wizard Voldemort, leaves, turns into a wide corridor licked by flaming torches, their flickering light casting ominous shadows, and hurries along until he reaches the top of a narrow flight of stone steps. Harry follows him down the steps into a gloomy corridor with rough stone walls, a place that feels ancient and secretive. Riddle approaches a heavy wooden door, takes out his wand, and looks around warily before throwing open the door to reveal a shadowy figure bending over a large wooden box, an encounter shrouded in mystery and intrigue."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Ron's hair is turning red and they turn and run out of the common room  Back in the girls' lavatory Myrtle floats past  Still in uniform Hermione has become a cat  He flicks through the book again and sees a name stamped in gold letters on the back  He puts the book down picks up a quill and dips it into the inkwell  As he goes to write on the first empty page a drop of ink falls from the quill hits the paper and slowly disappears  Harry turns over the page but the ink blot has vanished  He dips his quill again and starts to write  His words fade into the paper but other words appear  Harry writes again and the answer appears on the page  Harry leans back disappointed but more words appear  The blank pages turn themselves over quickly and he picks up the book with both hands and stares at it  A bright light shines out of the pages dazzling Harry  As he disappears the book on his desk closes  Stepping back into the past Harry reappears in a school corridor and warily approaches the foot of a wide staircase  A teenage boy in Hogwarts uniform is standing at the bend of the stairs staring at the landing above  Harry slowly goes up the stairs towards him follows his gaze and sees four people carrying down a stretcher covered with a sheet  As they pass Harry he sees a limp arm sticking out from under the sheet  Outside the lightning flashes and inside  Ron and Harry walk upstairs where they stop as they find a pool of water on the landing  They run through it and in the girls' lavatory all the taps are running  Harry and Ron look around at the overflowing sinks and spot Myrtle sitting high up on a curved stone windowsill  Ron flinches as she floats past and Harry notices a book with a limp black leather cover lying on the stone floor  He picks it up and shakes off the water but the book is soaking wet  Later he sits at his desk and flicks through the driedout pages which are all blank  He flicks through the book again and sees a name stamped in gold letters on the back  He puts the book down picks up a quill and dips it into the inkwell  As he goes to write on the first empty page a drop of ink falls from the quill hits the paper and slowly disappears  Harry turns over the page but the ink blot has vanished  He dips his quill again and starts to write  His words fade into the paper but other words appear  Harry writes again and the answer appears on the page  Harry leans back disappointed but more words appear  The blank pages turn themselves over quickly and he picks up the book with both hands and stares at it  A bright light shines out of the pages dazzling Harry  As he disappears the book on his desk closes  Stepping back into the past Harry reappears in a school corridor and warily approaches the foot of a wide staircase  A teenage boy in Hogwarts uniform is standing at the bend of the stairs staring at the landing above  Harry slowly goes up the stairs towards him follows his gaze and sees four people carrying down a stretcher covered with a sheet  As they pass Harry he sees a limp arm sticking out from under the sheet  A man with a long brown beard appears at the top of the stairs and Harry looks up in surprise as Dumbledore gives him a searching look  Riddle leaves turns into a wide corridor licked by flaming torches and hurries along until he reaches the top of a narrow flight of stone steps  Harry follows him down the steps into a gloomy corridor with rough stone walls  Riddle approaches a heavy wooden door takes out his wand and looks around warily before throwing open the door to reveal a shadowy figure bending over a large wooden box"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Ron's hair is turning red and they turn and run out of the common room. Back in the girls' lavatory Myrtle floats past. Still in uniform Hermione has become a cat. Outside the lightning flashes and inside. Ron and Harry walk upstairs where they stop as they find a pool of water on the landing. They run through it and in the girls' lavatory all the taps are running. Harry and Ron look around at the overflowing sinks and spot Myrtle sitting high up on a curved stone windowsill. Ron flinches as she floats past and Harry notices a book with a limp black leather cover lying on the stone floor. He picks it up and shakes off the water but the book is soaking wet. Later he sits at his desk and flicks through the driedout pages which are all blank. He flicks through the book again and sees a name stamped in gold letters on the back. He puts the book down picks up a quill and dips it into the inkwell. As he goes to write on the first empty page a drop of ink falls from the quill hits the paper and slowly disappears. Harry turns over the page but the ink blot has vanished. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. He dips his quill again and starts to write. His words fade into the paper but other words appear. Harry writes again and the answer appears on the page. Harry leans back disappointed but more words appear. The blank pages turn themselves over quickly and he picks up the book with both hands and stares at it. A bright light shines out of the pages dazzling Harry. As he disappears the book on his desk closes. Stepping back into the past Harry reappears in a school corridor and warily approaches the foot of a wide staircase. A teenage boy in Hogwarts uniform is standing at the bend of the stairs staring at the landing above. Harry slowly goes up the stairs towards him follows his gaze and sees four people carrying down a stretcher covered with a sheet. As they pass Harry he sees a limp arm sticking out from under the sheet. A man with a long brown beard appears at the top of the stairs and Harry looks up in surprise as Dumbledore gives him a searching look. Riddle leaves turns into a wide corridor licked by flaming torches and hurries along until he reaches the top of a narrow flight of stone steps. Harry follows him down the steps into a gloomy corridor with rough stone walls. Riddle approaches a heavy wooden door takes out his wand and looks around warily before throwing open the door to reveal a shadowy figure bending over a large wooden box."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Ron's hair is turning red and they turn and run out of the common room. Back in the girls' lavatory Myrtle floats past. Still in uniform Hermione has become a cat. Outside the lightning flashes and inside. Ron and Harry walk upstairs where they stop as they find a pool of water on the landing. They run through it and in the girls' lavatory all the taps are running. Harry and Ron look around at the overflowing sinks and spot Myrtle sitting high up on a curved stone windowsill. Ron flinches as she floats past and Harry notices a book with a limp black leather cover lying on the stone floor. He picks it up and shakes off the water but the book is soaking wet. Later he sits at his desk and flicks through the driedout pages which are all blank. He flicks through the book again and sees a name stamped in gold letters on the back. He puts the book down picks up a quill and dips it into the inkwell. As he goes to write on the first empty page a drop of ink falls from the quill hits the paper and slowly disappears. Harry turns over the page but the ink blot has vanished. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. He dips his quill again and starts to write. His words fade into the paper but other words appear. Harry writes again and the answer appears on the page. Harry leans back disappointed but more words appear. The blank pages turn themselves over quickly and he picks up the book with both hands and stares at it. A bright light shines out of the pages dazzling Harry. As he disappears the book on his desk closes. Stepping back into the past Harry reappears in a school corridor and warily approaches the foot of a wide staircase. A teenage boy in Hogwarts uniform is standing at the bend of the stairs staring at the landing above. Harry slowly goes up the stairs towards him follows his gaze and sees four people carrying down a stretcher covered with a sheet. As they pass Harry he sees a limp arm sticking out from under the sheet. A man with a long brown beard appears at the top of the stairs and Harry looks up in surprise as Dumbledore gives him a searching look. Riddle leaves turns into a wide corridor licked by flaming torches and hurries along until he reaches the top of a narrow flight of stone steps. Harry follows him down the steps into a gloomy corridor with rough stone walls. Riddle approaches a heavy wooden door takes out his wand and looks around warily before throwing open the door to reveal a shadowy figure bending over a large wooden box."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Ron's hair is turning red and they turn and run out of the common room. Back in the girls' lavatory Myrtle floats past. Still in uniform Hermione has become a cat. Outside the lightning flashes and inside. Ron and Harry walk upstairs where they stop as they find a pool of water on the landing. They run through it and in the girls' lavatory all the taps are running. Harry and Ron look around at the overflowing sinks and spot Myrtle sitting high up on a curved stone windowsill. Stepping back into the past Harry reappears in a school corridor and warily approaches the foot of a wide staircase. A teenage boy in Hogwarts uniform is standing at the bend of the stairs staring at the landing above. Harry slowly goes up the stairs towards him follows his gaze and sees four people carrying down a stretcher covered with a sheet. As they pass Harry he sees a limp arm sticking out from under the sheet. A man with a long brown beard appears at the top of the stairs and Harry looks up in surprise as Dumbledore gives him a searching look. Riddle leaves turns into a wide corridor licked by flaming torches and hurries along until he reaches the top of a narrow flight of stone steps. Harry follows him down the steps into a gloomy corridor with rough stone walls. Riddle approaches a heavy wooden door takes out his wand and looks around warily before throwing open the door to reveal a shadowy figure bending over a large wooden box."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Ron's hair is turning red and they turn and run out of the common room. Back in the girls' lavatory Myrtle floats past. Still in uniform Hermione has become a cat. Riddle leaves turns into a wide corridor licked by flaming torches and hurries along until he reaches the top of a narrow flight of stone steps. Harry follows him down the steps into a gloomy corridor with rough stone walls. Riddle approaches a heavy wooden door takes out his wand and looks around warily before throwing open the door to reveal a shadowy figure bending over a large wooden box."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Luna's hair is turning red, and the dog turns and runs out of the common room. Back in the girls' lavatory, a ghost floats past. Still in uniform, Neville has become a cat. Outside, the lightning flashes, and inside, Hermione and Draco walk upstairs where they stop as they find a pool of water on the landing. They run through it, and in the girls' lavatory, all the taps are running. Hermione and Draco look around at the overflowing sinks and spot a ghost sitting high up on a curved stone windowsill. Draco flinches as the ghost floats past, and Hermione notices a book with a limp, black leather cover lying on the stone floor. She picks it up and shakes off the water, but the book is soaking wet. Later, she sits at her desk and flicks through the dried-out pages, which are all blank. She flicks through the book again and sees a name stamped in gold letters on the back. She puts the book down, picks up a quill, and dips it into the inkwell. As she goes to write on the first empty page, a drop of ink falls from the quill, hits the paper, and slowly disappears. Hermione turns over the page, but the ink blot has vanished. She dips her quill again and starts to write. Her words fade into the paper, but other words appear. Hermione writes again, and the answer appears on the page. Hermione leans back, disappointed, but more words appear. The blank pages turn themselves over quickly, and she picks up the book with both hands and stares at it. A bright light shines out of the pages, dazzling Hermione. As she disappears, the book on her desk closes. Stepping back into the past, Hermione reappears in a school corridor and warily approaches the foot of a wide staircase. An owl in Hogwarts uniform is standing at the bend of the stairs, staring at the landing above. Hermione slowly goes up the stairs towards it, follows its gaze, and sees four people carrying down a stretcher covered with a sheet. As they pass Hermione, she sees a limp arm sticking out from under the sheet. A unicorn with a long, brown beard appears at the top of the stairs, and Hermione looks up in surprise as Dumbledore gives her a searching look. A phoenix leaves, turns into a wide corridor licked by flaming torches, and hurries along until it reaches the top of a narrow flight of stone steps. Hermione follows it down the steps into a gloomy corridor with rough stone walls. The phoenix approaches a heavy wooden door, takes out a wand, and looks around warily before throwing open the door to reveal a shadowy figure bending over a large wooden box."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Ron's hair is turning green, and they turn and run out of the art studio. Back in the boys' lounge, Myrtle glides past. Still in uniform, Hermione has become a rabbit. Outside, the thunder rumbles, and inside, Ron and Harry walk upstairs where they stop as they find a mound of sand on the landing. They run through it, and in the boys' lounge, all the faucets are running. Harry and Ron look around at the overflowing bathtubs and spot Myrtle sitting high up on a curved stone fireplace. Ron flinches as she glides past, and Harry notices a scroll with a limp, red velvet cover lying on the stone floor. He picks it up and shakes off the sand, but the scroll is gritty. Later, he sits at his table and flicks through the dried-out parchment, which are all blank. He flicks through the scroll again and sees a name stamped in silver letters on the back. He puts the scroll down, picks up a brush, and dips it into the inkpot. As he goes to write on the first empty sheet, a drop of ink falls from the brush, hits the parchment, and slowly disappears. Harry turns over the sheet, but the ink stain has vanished. He dips his brush again and starts to write. His words fade into the parchment, but other words appear. Harry writes again, and the answer appears on the parchment. Harry leans back, disappointed, but more words appear. The blank sheets turn themselves over quickly, and he picks up the scroll with both hands and stares at it. A bright light shines out of the parchment, dazzling Harry. As he disappears, the scroll on his table rolls up. Stepping back into the past, Harry reappears in a school library and warily approaches the foot of a wide archway. A teenage boy in Hogwarts uniform is standing at the bend of the archway, staring at the landing above. Harry slowly goes up the archway towards him, follows his gaze, and sees four people carrying a carpet draped with a sheet. As they pass Harry, he sees a limp arm sticking out from under the sheet. A man with a long, gray beard appears at the top of the archway, and Harry looks up in surprise as Dumbledore gives him a searching look. Riddle leaves, turns into a wide atrium lit by glowing lanterns, and hurries along until he reaches the top of a narrow flight of marble steps. Harry follows him down the steps into a dim corridor with rough stone walls. Riddle approaches a heavy iron door, takes out his wand, and looks around warily before throwing open the door to reveal a shadowy figure bending over a large metal chest."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Ron's hair is shimmering blue, and they jump and stroll out of the common room. Back in the girls' lavatory, Myrtle glides past. Still in uniform, Hermione has transformed into a dog. Outside, the thunder crashes, and inside, Ron and Harry skip upstairs where they pause as they spot a pile of leaves on the landing. They dance through it, and in the girls' lavatory, all the taps are whistling. Harry and Ron glance around at the brimming sinks and notice Myrtle perched high up on a spiraled stone windowsill. Ron cringes as she glides past, and Harry observes a scroll with a shiny, red leather cover resting on the stone floor. He grabs it and wipes off the dust, but the scroll is dusty. Later, he stands at his desk and thumbs through the crinkled pages, which are all filled. He thumbs through the scroll again and notices a symbol embossed in silver letters on the back. He sets the scroll down, takes a quill, and dips it into the ink bottle. As he prepares to draw on the first filled page, a droplet of ink drips from the quill, hits the paper, and instantly evaporates. Harry flips over the page, but the ink droplet has vanished. He dips his quill again and attempts to draw. His doodles spread across the paper, but other lines emerge. Harry doodles again, and a picture appears on the page. Harry leans forward, puzzled, but more lines materialize. The filled pages curl over quickly, and he lifts the scroll with both hands and examines it. A soft glow emanates from the pages, mesmerizing Harry. As he vanishes, the scroll on his desk rolls shut. Journeying back into the past, Harry reappears in a school corridor and cautiously nears the foot of a narrow staircase. A teenage boy in Hogwarts uniform is leaning against the bend of the stairs, peering at the landing above. Harry quietly ascends the stairs towards him, follows his stare, and views four people dragging down a trolley covered with a blanket. As they pass Harry, he observes a stiff leg protruding from under the blanket. A man with a short, white beard emerges at the top of the stairs, and Harry glances up in shock as Dumbledore casts him an inquisitive look. Riddle departs, turns into a narrow corridor caressed by flickering torches, and ambles along until he reaches the bottom of a broad flight of stone steps. Harry follows him up the steps into a bright corridor with polished stone walls. Riddle approaches a light wooden door, draws out his wand, and scans around cautiously before pushing open the door to disclose a mysterious figure crouching over a small golden box."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The curtain's fabric is turning blue, and they spin and dart out of the tea house. Back in the boys' cafeteria, Sprout drifts by. Still in costume, Luna has become a penguin. Outside, the thunder crashes, and inside, Iris and Draco stroll upstairs where they pause as they find a pond of paint on the terrace. They dash through it, and in the boys' cafeteria, all the lights are flickering. Draco and Iris glance around at the flooded tables and spot Sprout hovering high up on a spiral metal balcony. Iris recoils as she drifts by, and Draco notices a vase with a limp, white linen wrap resting on the metal floor. He lifts it and shakes off the glitter, but the vase is dripping wet. Later, he sits at his bench and flips through the dried-out scrolls, which are all blank. He flips through the vase again and sees a mark engraved in bronze letters on the back. He places the vase down, picks up a brush, and dips it into the paintpot. As he moves to scribble on the first empty scroll, a speck of paint falls from the brush, touches the parchment, and gradually dissolves. Draco flips over the scroll, but the paint speck has vanished. He dips his brush again and begins to scribble. His marks fade into the parchment, but other marks emerge. Draco scribbles again, and the reply emerges on the scroll. Draco leans back, frustrated, but additional marks emerge. The blank scrolls flip themselves over rapidly, and he grasps the vase with both hands and gawks at it. A vivid light beams out of the scrolls, blinding Draco. As he vanishes, the vase on his bench snaps shut. Retracing steps into the past, Draco reappears in an office corridor and cautiously moves toward the base of a wide stairwell. A teenage girl in Beauxbatons costume is positioned at the bend of the steps, gazing at the terrace above. Draco slowly climbs the steps towards her, follows her gaze, and sees three cats carrying up a stretcher covered with a blanket. As they pass Draco, he notices a limp tail peeking out from under the blanket. A woman with a short, golden braid appears at the foot of the steps, and Draco glances up in wonder as McGonagall gives him a penetrating look. Olive departs, turns into a narrow hallway licked by glowing lanterns, and rushes along until she reaches the foot of a broad flight of marble steps. Draco trails her down the steps into a shadowy hallway with smooth marble walls. Olive approaches a light metal archway, takes out her quill, and glances around cautiously before pushing open the archway to unveil a blurry shape leaning over a tremendous oak barrel."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Don's shoes are glowing green, and they spin and leap out of the library. Back in the boys' kitchen, Trevor swims around. Still in pajamas, Emily has transformed into a dog. Outside, the thunder roars, and inside, Don and Jacob stroll downstairs where they pause as they discover a pile of snow on the platform. They skip through it, and in the boys' kitchen, all the chairs are shaking. Jacob and Don glance around at the overflowing coffee mugs and spy Trevor hovering high up on a wooden chair's arm. Don jumps as he swims around, and Jacob notices a scroll with a rigid, red velvet cover resting on the marble counter. He picks it up and brushes off the flour, but the scroll is heavily floured. Later, he stands at his bench and flips through the powdered pages, which are all empty. He flips through the scroll again and spots a signature stamped in silver letters on the bottom. He puts the scroll down, grabs a pen, and dips it into the paint bottle. As he prepares to draw on the first blank page, a drop of paint falls from the pen, strikes the canvas, and slowly vanishes. Jacob flips over the page, but the paint spot has disappeared. He dips his pen once more and begins to sketch. His lines fade into the canvas, but other drawings emerge. Jacob sketches again, and the image materializes on the page. Jacob leans back, puzzled, but more images surface. The blank pages flip themselves over rapidly, and he clutches the scroll with both hands and observes it. A vivid glow pours out of the pages, blinding Jacob. As he vanishes, the scroll on his bench closes. Stepping forward into the future, Jacob reappears in a hospital hallway and cautiously approaches the base of a sprawling staircase. A young girl in Beauxbatons attire is standing at the curve of the stairs, observing the floor below. Jacob carefully ascends the stairs towards her, follows her gaze, and observes two individuals hauling up a cart draped with a blanket. As they pass Jacob, he notices a dangling foot protruding from beneath the blanket. A woman with a short, black ponytail appears at the bottom of the stairs, and Jacob glances down in shock as McGonagall gives him a knowing look. Riddle departs, merges into a narrow hallway adorned with flickering lanterns, and rushes onward until he arrives at the bottom of a broad flight of metal steps. Jacob follows him up the steps into a bright hallway with smooth stone walls. Riddle reaches an iron door, takes out his pen, and glances around cautiously before yanking open the door to expose a shadowy figure crouching over a massive metal crate."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Ron's hair is turning blue, and they pivot and stroll out of the dining hall. Back in the boys' cloakroom, Myrtle drifts by. Still in costume, Hermione has changed into a rabbit. Outside, the thunder booms, and inside, Ron and Harry skip downstairs where they pause as they discover a mound of sand on the platform. They hop over it, and in the boys' cloakroom, all the lights are flickering. Harry and Ron glance around at the filled bathtubs and spot Myrtle perched high up on a narrow metal bookshelf. Ron recoils as she glides past, and Harry notices a scroll with a crumpled, red parchment cover lying on the stone floor. He picks it up and dusts off the sand, but the scroll is heavily stained. Later, he stands at his bench and flips through the crumpled parchment, which is entirely empty. He flips through the scroll again and sees a name embossed in silver letters on the back. He places the scroll down, picks up a brush, and dunks it into the paint pot. As he goes to sketch on the first blank page, a splash of paint drops from the brush, hits the parchment, and quickly disperses. Harry flips over the page, but the paint spot has vanished. He dunks his brush again and starts to draw. His marks merge into the parchment, but other images emerge. Harry draws again, and the picture appears on the page. Harry leans back, confused, but more images form. The blank pages flip themselves over swiftly, and he grips the scroll with both hands and gazes at it. A dim glow emanates from the pages, blinding Harry. As he vanishes, the scroll on his bench closes. Stepping back into the past, Harry materializes in a school hallway and cautiously approaches the base of a wide ladder. A teenage boy in Hogwarts costume is standing at the curve of the ladder, gazing at the platform above. Harry slowly climbs the ladder towards him, follows his stare, and sees four individuals lifting up a basket covered with a tarp. As they pass Harry, he glimpses a limp leg protruding from under the tarp. A man with a long, blonde beard appears at the top of the ladder, and Harry glances up in shock as Dumbledore gives him a curious look. Riddle departs, turns into a narrow hallway lined with glowing lanterns, and rushes along until he reaches the bottom of a narrow flight of brick steps. Harry trails him up the steps into an eerie hallway with smooth concrete walls. Riddle approaches a lightweight metal gate, takes out his wand, and glances around cautiously before flinging open the gate to reveal a shadowy figure leaning over a small metal crate."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Buzz's hat is glowing blue, and they twist and sprint out of the science lab. Back in the boys' pantry, Bubbles drifts by. Still in pajamas, Gretchen has turned into a rabbit. Outside, the thunder crashes, and inside, Buzz and Mike climb downstairs where they pause as they find a pile of marbles on the platform. They skip through it, and in the boys' pantry, all the lights are blinking. Mike and Buzz glance around at the flickering bulbs and spot Bubbles lounging high up on a straight iron bookshelf. Buzz winces as she glides by, and Mike spots a basket with a rigid, green silk lining lying on the metal counter. He grabs it and shakes off the flour, but the basket is entirely dusty. Later, he stands at his table and flips through the sticky pages, which are all empty. He flips through the basket again and spots a logo embossed in silver letters on the inside. He sets the basket aside, grabs a marker, and dips it into the ink pot. As he attempts to scribble on the first blank sheet, a splash of ink drips from the marker, strikes the surface, and slowly fades. Mike flips over the sheet, but the ink stain has disappeared. He dips his marker once more and begins to scribble. His scribbles dissolve into the sheet, but other scribbles materialize. Mike scribbles again, and the reply manifests on the sheet. Mike leans forward, disenchanted, but more scribbles materialize. The blank sheets flip themselves over swiftly, and he grabs the basket with both hands and squints at it. A vivid glow radiates from the sheets, blinding Mike. As he vanishes, the basket on his table shuts. Stepping back into history, Mike materializes in a museum hallway and cautiously approaches the base of a broad ladder. A young girl in a Gryffindor outfit is standing at the corner of the ladder, gazing at the platform above. Mike gradually ascends the ladder towards her, tracks her sight, and notices seven individuals carrying up a blanket covered with a tarp. As they pass Mike, he notices a dangling foot protruding from beneath the tarp. A woman with a short, blonde ponytail emerges at the bottom of the ladder, and Mike glances down in shock as Longbeard gives him a penetrating glance. Twiddle departs, morphs into a narrow hallway bathed by glowing lanterns, and speeds along until he arrives at the base of a wide set of marble stairs. Mike tails him up the stairs into a bright hallway with smooth marble walls. Twiddle advances towards a light wooden gate, pulls out his brush, and glances around suspiciously before swinging open the gate to unveil a luminous figure crouching over a small plastic crate."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Ron's hair turns red, prompting him to flee the common room. Back in the girls' lavatory, Myrtle floats by, and Hermione has transformed into a cat. During a storm, Ron and Harry find a pool of water on the landing and discover all the taps running in the lavatory. They see a book with a limp, black leather cover, soaking wet, which Harry takes. As he flicks through the pages, he notices they are blank until he writes on them, and his words vanish but are replaced with other writing. A bright light from the pages dazzles Harry, and he is transported into the past to a school corridor, encountering a teenage boy in a Hogwarts uniform, Riddle, who is focused on a stretcher with a covered figure being carried down the stairs. Harry is surprised to see Dumbledore, who gives him a searching look. Riddle then proceeds through a corridor, down stone steps, and opens a door to find a shadowy figure bending over a large wooden box."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Riddle approaches a heavy wooden door takes out his wand and looks around warily before throwing open the door to reveal a shadowy figure bending over a large wooden box Harry follows him down the steps into a gloomy corridor with rough stone walls  Riddle leaves turns into a wide corridor licked by flaming torches and hurries along until he reaches the top of a narrow flight of stone steps  A man with a long brown beard appears at the top of the stairs and Harry looks up in surprise as Dumbledore gives him a searching look  As they pass Harry he sees a limp arm sticking out from under the sheet  Harry slowly goes up the stairs towards him follows his gaze and sees four people carrying down a stretcher covered with a sheet  A teenage boy in Hogwarts uniform is standing at the bend of the stairs staring at the landing above  Stepping back into the past Harry reappears in a school corridor and warily approaches the foot of a wide staircase  As he disappears the book on his desk closes  A bright light shines out of the pages dazzling Harry  The blank pages turn themselves over quickly and he picks up the book with both hands and stares at it  Harry leans back disappointed but more words appear  Harry writes again and the answer appears on the page  His words fade into the paper but other words appear  He dips his quill again and starts to write  Harry turns over the page but the ink blot has vanished  As he goes to write on the first empty page a drop of ink falls from the quill hits the paper and slowly disappears  He puts the book down picks up a quill and dips it into the inkwell  He flicks through the book again and sees a name stamped in gold letters on the back  Later he sits at his desk and flicks through the driedout pages which are all blank  He picks it up and shakes off the water but the book is soaking wet  Ron flinches as she floats past and Harry notices a book with a limp black leather cover lying on the stone floor  Harry and Ron look around at the overflowing sinks and spot Myrtle sitting high up on a curved stone windowsill  They run through it and in the girls' lavatory all the taps are running  Ron and Harry walk upstairs where they stop as they find a pool of water on the landing  Outside the lightning flashes and inside  Still in uniform Hermione has become a cat  Back in the girls' lavatory Myrtle floats past  Ron's hair is turning red and they turn and run out of the common room "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "His words fade into the paper but other words appear  Harry turns over the page but the ink blot has vanished  Harry and Ron look around at the overflowing sinks and spot Myrtle sitting high up on a curved stone windowsill  A man with a long brown beard appears at the top of the stairs and Harry looks up in surprise as Dumbledore gives him a searching look  Ron flinches as she floats past and Harry notices a book with a limp black leather cover lying on the stone floor  Stepping back into the past Harry reappears in a school corridor and warily approaches the foot of a wide staircase  Ron's hair is turning red and they turn and run out of the common room  Harry leans back disappointed but more words appear  Harry writes again and the answer appears on the page  They run through it and in the girls' lavatory all the taps are running  Later he sits at his desk and flicks through the driedout pages which are all blank  Harry follows him down the steps into a gloomy corridor with rough stone walls  Ron and Harry walk upstairs where they stop as they find a pool of water on the landing  As he disappears the book on his desk closes  The blank pages turn themselves over quickly and he picks up the book with both hands and stares at it  Riddle approaches a heavy wooden door takes out his wand and looks around warily before throwing open the door to reveal a shadowy figure bending over a large wooden box Harry slowly goes up the stairs towards him follows his gaze and sees four people carrying down a stretcher covered with a sheet  He dips his quill again and starts to write  Back in the girls' lavatory Myrtle floats past  He picks it up and shakes off the water but the book is soaking wet  A bright light shines out of the pages dazzling Harry  A teenage boy in Hogwarts uniform is standing at the bend of the stairs staring at the landing above  He puts the book down picks up a quill and dips it into the inkwell  Riddle leaves turns into a wide corridor licked by flaming torches and hurries along until he reaches the top of a narrow flight of stone steps  As he goes to write on the first empty page a drop of ink falls from the quill hits the paper and slowly disappears  Still in uniform Hermione has become a cat  Outside the lightning flashes and inside  He flicks through the book again and sees a name stamped in gold letters on the back  As they pass Harry he sees a limp arm sticking out from under the sheet "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "His words fade into the paper but other words appear  Harry writes again and the answer appears on the page  Harry leans back disappointed but more words appear  The blank pages turn themselves over quickly and he picks up the book with both hands and stares at it  A bright light shines out of the pages dazzling Harry  As he disappears the book on his desk closes  Stepping back into the past Harry reappears in a school corridor and warily approaches the foot of a wide staircase  A teenage boy in Hogwarts uniform is standing at the bend of the stairs staring at the landing above  Harry slowly goes up the stairs towards him follows his gaze and sees four people carrying down a stretcher covered with a sheet  As they pass Harry he sees a limp arm sticking out from under the sheet  A man with a long brown beard appears at the top of the stairs and Harry looks up in surprise as Dumbledore gives him a searching look  Riddle leaves turns into a wide corridor licked by flaming torches and hurries along until he reaches the top of a narrow flight of stone steps  Harry follows him down the steps into a gloomy corridor with rough stone walls  Riddle approaches a heavy wooden door takes out his wand and looks around warily before throwing open the door to reveal a shadowy figure bending over a large wooden box Ron's hair is turning red and they turn and run out of the common room  Back in the girls' lavatory Myrtle floats past  Still in uniform Hermione has become a cat  Outside the lightning flashes and inside  Ron and Harry walk upstairs where they stop as they find a pool of water on the landing  They run through it and in the girls' lavatory all the taps are running  Harry and Ron look around at the overflowing sinks and spot Myrtle sitting high up on a curved stone windowsill  Ron flinches as she floats past and Harry notices a book with a limp black leather cover lying on the stone floor  He picks it up and shakes off the water but the book is soaking wet  Later he sits at his desk and flicks through the driedout pages which are all blank  He flicks through the book again and sees a name stamped in gold letters on the back  He puts the book down picks up a quill and dips it into the inkwell  As he goes to write on the first empty page a drop of ink falls from the quill hits the paper and slowly disappears  Harry turns over the page but the ink blot has vanished  He dips his quill again and starts to write "
        }
      ]
    }
  ]
}