{
  "ground_truth": "Forrest watches Jenny in the pickup as it drives away. Forrest, dressed in his uniform, sits on a log and looks out at a river. Mrs. Gump walks toward Forrest and sits down next to him on the log. Forrest leans down, placing his head on his mother's shoulder. The shadow of a helicopter is over the rice field below as a soldier mans a gun from inside the helicopter. The soldier looks left as Forrest and Bubba ride in the helicopter, which circles overhead and lands at the firebase. Bubba and Forrest jump out with their gear and walk, looking around oddly. A soldier places a case of beer on a large stack of cases, takes two beers out, and walks away, while in the background soldiers are barbecuing steaks and drinking beer. Lieutenant Dan Taylor steps out of a tent, shirtless, holding a roll of toilet paper in his hand, and looks at Bubba. Forrest and Bubba look at each other oddly, not getting the joke, as Lt. Dan starts to walk. Bubba and Forrest grab their gear and follow him. Lt. Dan stops and looks at the boys, then steps over to a large black soldier named Sergeant. A distant relative of Lt. Dan, wearing a revolutionary war uniform, falls dead in the snow. Another relative, in a civil war uniform, resembling Lt. Dan, falls dead, and another, in a World War II uniform, falls dead on the beach at Normandy. Lt. Dan steps back to Bubba and Forrest, walks along the walkway with them following, and steps inside the latrine, still holding the toilet paper. He sits down out of sight, stands up looking at the boys, then sits back down out of sight. Bubba and Forrest look at each other. Forrest, Bubba, and other soldiers in the Fourth Platoon walk across the rice field as Vietnamese rice farmers work nearby. Forrest's unit walks along a dirt road when suddenly Lt. Dan holds up his fist, signaling them to stop. He motions for them to get down, and Forrest complies, looking around. Lt. Dan motions for the lead soldier to get down, crouches, looks at the soldiers, and points to his eyes before lying down on the dirt road and crawling. Tex holds up his hand, motioning that he doesn't know. Forrest stands up and begins to walk with the platoon. Lt. Dan walks away as Forrest rushes over, aims two pistols in the hole, and then climbs inside.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Forrest observes Jenny in the truck as it travels away. Forrest, attired in his outfit, perches on a log and gazes out at a river. Mrs. Gump strides toward Forrest and sits down next to him on the log. Forrest bends down, resting his head on his mother's shoulder. The silhouette of a helicopter is over the rice field below as a trooper operates a firearm from inside the helicopter. The trooper glances left as Forrest and Bubba ride in the helicopter, which circles overhead and lands at the firebase. Bubba and Forrest leap out with their equipment and stroll, looking around strangely. A trooper sets a crate of beer on a large pile of crates, takes two beers out, and walks away, while in the background troopers are grilling steaks and consuming beer. Lieutenant Dan Taylor emerges from a tent, shirtless, holding a roll of toilet paper in his hand, and glances at Bubba. Forrest and Bubba glance at each other strangely, not understanding the joke, as Lt. Dan starts to stride. Bubba and Forrest grab their equipment and follow him. Lt. Dan halts and gazes at the boys, then steps over to a large black trooper named Sergeant. A distant relative of Lt. Dan, clad in a revolutionary war outfit, falls lifeless in the snow. Another relative, in a civil war outfit, resembling Lt. Dan, falls lifeless, and another, in a World War II outfit, falls lifeless on the beach at Normandy. Lt. Dan steps back to Bubba and Forrest, strides along the walkway with them following, and steps inside the latrine, still holding the toilet paper. He sits down out of sight, stands up glancing at the boys, then sits back down out of sight. Bubba and Forrest glance at each other. Forrest, Bubba, and other troopers in the Fourth Platoon stroll across the rice field as Vietnamese rice cultivators work nearby. Forrest's unit strides along a dirt path when suddenly Lt. Dan raises his fist, indicating them to cease. He gestures for them to get down, and Forrest complies, looking around. Lt. Dan gestures for the leading trooper to get down, crouches, glances at the troopers, and points to his eyes before lying down on the dirt path and crawling. Tex raises his hand, indicating that he doesn't know. Forrest stands up and begins to stride with the platoon. Lt. Dan strides away as Forrest rushes over, aims two handguns in the hole, and then climbs inside."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Jenny is watched by Forrest in the pickup as it is driven away. Forrest, dressed in his uniform, sits on a log and the river is looked out at by him. Mrs. Gump walks toward Forrest and sits down next to him on the log. Forrest leans down, placing his head on his mother's shoulder. Over the rice field below, the shadow of a helicopter is cast as a soldier manning a gun looks left from inside the helicopter. Forrest and Bubba ride in the helicopter, which is circled overhead and landed at the firebase by it. With their gear, Bubba and Forrest jump out and look around oddly. A case of beer is placed by a soldier on a large stack of cases, who takes two beers out and walks away, while steaks are barbecued and beer is drunk by soldiers in the background. Lieutenant Dan Taylor steps out of a tent, shirtless, holds a roll of toilet paper in his hand, and looks at Bubba. Forrest and Bubba look at each other oddly, not getting the joke, as Lt. Dan starts to walk. Their gear is grabbed by Bubba and Forrest, and he is followed. The boys are looked at by Lt. Dan who stops, then steps over to a large black soldier named Sergeant. A distant relative of Lt. Dan, wearing a revolutionary war uniform, falls dead in the snow. Another relative, in a civil war uniform, resembling Lt. Dan, falls dead, and another, in a World War II uniform, falls dead on the beach at Normandy. Lt. Dan steps back to Bubba and Forrest, walks along the walkway with them following, and steps inside the latrine, still holding the toilet paper. He sits down out of sight, stands up looking at the boys, then sits back down out of sight. Bubba and Forrest look at each other. The rice field is walked across by Forrest, Bubba, and other soldiers in the Fourth Platoon as Vietnamese rice farmers work nearby. When Forrest's unit walks along a dirt road, suddenly Lt. Dan holds up his fist, signaling them to stop. They are motioned by him to get down, and Forrest complies, looking around. The lead soldier is motioned by Lt. Dan to get down; he crouches, looks at the soldiers, and points to his eyes before lying down on the dirt road and crawling. Tex holds up his hand, motioning that he doesn't know. Standing up, Forrest begins to walk with the platoon. Away walks Lt. Dan as Forrest rushes over, aims two pistols in the hole, and then climbs inside."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Forrest watches Jenny leave in the pickup. In uniform, he sits on a log by the river. Mrs. Gump joins him, and he rests his head on her shoulder. The shadow of a helicopter passes over the rice field, and a soldier mans a gun as Forrest and Bubba fly overhead to the firebase. They exit with their gear, observing the surroundings. A soldier adds a case of beer to a stack, takes two, and leaves while others barbecue and drink. Lieutenant Dan emerges from a tent, shirtless, with toilet paper, looking at Bubba. Forrest and Bubba exchange puzzled glances and follow him. Lt. Dan pauses, then steps to a large black soldier named Sergeant. Relatives resembling Lt. Dan fall dead in various war uniforms. Lt. Dan returns to Forrest and Bubba, leads them to the latrine, and sits out of sight. Bubba and Forrest look at each other. Forrest's unit walks through the rice field as farmers work. On a dirt road, Lt. Dan signals them to stop and crouch. Forrest obeys and looks around. Lt. Dan signals, then lies down and crawls. Tex gestures uncertainty. Forrest stands and walks with the platoon. Lt. Dan leaves as Forrest aims pistols into a hole and climbs inside."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Forrest watches Jenny leave in the pickup. Dressed in his uniform, he sits on a log by the river. Mrs. Gump joins him, and Forrest rests his head on her shoulder. A helicopter casts a shadow over a rice field as a soldier mans a gun. Forrest and Bubba ride the helicopter, landing at the firebase. They jump out, gear in hand, and observe soldiers barbecuing and drinking beer. Lieutenant Dan exits a tent, shirtless, with toilet paper, and looks at Bubba. Forrest and Bubba follow him, still puzzled by his joke. Lt. Dan approaches a black soldier named Sergeant, as images of his relatives falling in past wars flash. He leads Bubba and Forrest to the latrine and sits. Bubba and Forrest exchange looks, then accompany the Fourth Platoon across a rice field. When Lt. Dan signals them to stop, Forrest complies but eventually stands and walks. Lt. Dan moves away as Forrest rushes over, aims into a hole with two pistols, and climbs inside."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Forrest stands attentively, watching with a heavy heart as Jenny rides away in the pickup truck. Clad in his distinctive uniform, Forrest finds himself seated on a log, gazing thoughtfully at the tranquil river flowing before him. As he sits there, Mrs. Gump approaches her son with a gentle demeanor and takes a seat beside him on the log. With affection and comfort, Forrest leans down, resting his head tenderly on his mother's shoulder. In the distance, the shadow of a helicopter glides over the rice field below, with a vigilant soldier inside, manning a gun. The soldier casts a glance to the left as Forrest and Bubba accompany him inside the helicopter, which circles around skillfully before landing at the busy firebase. Bubba and Forrest, packed with their gear, leap out of the helicopter and proceed to walk, their eyes scanning their surroundings with curiosity. Meanwhile, a soldier places a case of beer atop a towering stack of similar cases, retrieves two bottles, and leisurely walks away, as other soldiers in the background are busy barbecuing steaks and enjoying refreshing beers. With a casual air, Lieutenant Dan Taylor emerges from a tent, shirtless and holding a roll of toilet paper, casting a look toward Bubba. Forrest and Bubba exchange puzzled glances, not quite understanding the humor, as Lt. Dan begins to walk. Dutifully, Bubba and Forrest gather their gear and trail behind him. Lt. Dan pauses to scrutinize the boys before he steps over to a commanding, large black soldier known as Sergeant. In a fleeting parallel scene, a distant relative of Lt. Dan, clad in a revolutionary war uniform, tragically falls dead in the snow. Another relative, bearing a striking resemblance to Lt. Dan and dressed in a civil war uniform, also meets a similar fate. Yet another, in a World War II uniform, falls dead on the beaches of Normandy. Returning to the present, Lt. Dan steps back to Bubba and Forrest, continuing to walk along the pathway with them faithfully following, eventually entering the latrine while still holding onto the toilet paper. He briefly sits down out of sight, rises to glance at the boys, and then sits back down, hidden from view once more. Bubba and Forrest share another glance, perplexed. Alongside Forrest, Bubba, and other soldiers in the Fourth Platoon, they tread carefully across the rice field where Vietnamese rice farmers industriously work nearby. As Forrest's unit advances along a dirt road, Lt. Dan suddenly raises his fist in a commanding gesture, signaling everyone to halt. With precise movements, he instructs them to get down, prompting Forrest to comply while he scans the area intently. Lt. Dan motions to the lead soldier to crouch, inspects the soldiers, and points to his eyes before he lowers himself onto the dusty road, crawling strategically. Tex raises his hand in a motion that clearly indicates uncertainty. Forrest then stands up and begins to move onward with the platoon. As Lt. Dan departs from the scene, Forrest hastens over, skillfully aims two pistols into the hole, and courageously climbs inside."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Forrest stands there, filled with a sense of attentiveness, as he watches with a heavy heart while Jenny rides away in the nearby pickup truck. He is dressed in his distinctive uniform, and he finds himself positioned on a log, where he gazes thoughtfully at the tranquil river that flows peacefully before his eyes. As he sits quietly in this reflective state, Mrs. Gump gently approaches her son with a warm demeanor and takes a seat beside him on the log. With an expression of affection and comfort, Forrest leans down, resting his head tenderly on his mother's shoulder. In the distance, the shadow of a helicopter glides silently over the rice field below, where a vigilant soldier is seated inside, manning a gun with careful precision. The soldier casts a glance to the left as Forrest and Bubba accompany him inside the helicopter, which circles skillfully before landing at the busy firebase. Bubba and Forrest, packed with their essential gear, leap energetically out of the helicopter and proceed to walk forward, their eyes scanning their surroundings with curiosity and wonder. Meanwhile, a soldier carefully places a case of beer atop a towering stack of similar cases, retrieves two bottles, and leisurely walks away, as other soldiers in the background are busily barbecuing steaks and enjoying refreshing beers. With a casual air, Lieutenant Dan Taylor emerges from a nearby tent, shirtless and holding a roll of toilet paper, casting a look toward Bubba. Forrest and Bubba exchange puzzled glances, not quite grasping the humor, as Lt. Dan begins to walk forward. Dutifully, Bubba and Forrest gather their gear and trail closely behind him. Lt. Dan pauses to scrutinize the boys before he steps over to a commanding, large black soldier known as Sergeant. In a fleeting parallel scene, a distant relative of Lt. Dan, clad in a revolutionary war uniform, tragically falls dead in the cold snow. Another relative, bearing a striking resemblance to Lt. Dan and dressed in a civil war uniform, also meets a similar fate. Yet another, in a World War II uniform, falls dead on the historic beaches of Normandy. Returning to the present, Lt. Dan steps back to Bubba and Forrest, continuing to walk along the pathway with them faithfully following, eventually entering the latrine while still holding onto the toilet paper. He briefly sits down out of sight, rises to glance at the boys, and then sits back down, hidden from view once more. Bubba and Forrest share another glance, perplexed. Alongside Forrest, Bubba, and other soldiers in the Fourth Platoon, they tread carefully across the rice field where Vietnamese rice farmers are industriously working nearby. As Forrest's unit advances along a dusty dirt road, Lt. Dan suddenly raises his fist in a commanding gesture, signaling everyone to halt. With precise movements, he instructs them to get down, prompting Forrest to comply while he scans the area intently. Lt. Dan motions to the lead soldier to crouch, inspects the soldiers, and points to his eyes before he lowers himself onto the dusty road, crawling strategically. Tex raises his hand in a motion that clearly indicates uncertainty and confusion. Forrest then stands up and begins to move onward with the platoon. As Lt. Dan departs from the scene, Forrest hastens over with determination, skillfully aims two pistols into the hole, and courageously climbs inside."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Forrest watches intently as the pickup truck carries Jenny away into the distance, maintaining his gaze until it's a mere speck on the horizon. Clad in his uniform, he sits pensively on a log, allowing his eyes to wander over the gentle flow of the river before him. The tranquility is momentarily disrupted as Mrs. Gump approaches, her footsteps soft yet steady, and she lowers herself beside him on the log, offering silent companionship. Forrest leans in, finding comfort in resting his head on his mother's shoulder as if seeking solace. Meanwhile, the shadow of a helicopter glides ominously over the expansive rice field below, where a soldier stationed inside the chopper mans a gun with a vigilant leftward glance. As the helicopter performs a sweeping circle in the sky, Forrest and Bubba are seen seated within, each silent in their thoughts while the aircraft descends to the firebase, landing with a purposeful thud. Once the doors open, Bubba and Forrest leap out, shouldering their gear, casting curious glances around at the unfamiliar surroundings. Nearby, a soldier casually adds a case of beer to an already towering stack, deftly pulls out two bottles, and meanders away, set against the backdrop of fellow soldiers immersed in grilling steaks and enjoying their drinks. Suddenly, Lieutenant Dan Taylor emerges from a tent, noticeably shirtless, holding a roll of toilet paper in one hand, and directs a pointed look at Bubba. Forrest and Bubba exchange bemused glances, failing to grasp the humor as Lt. Dan strides purposefully. The two friends, compelled by duty, grab their gear and follow his lead. Lt. Dan pauses, his gaze settling on them momentarily, before he steps aside to confer with a large black soldier known as Sergeant. In a poignant sequence, a distant ancestor of Lt. Dan, garbed in a revolutionary war uniform, collapses lifelessly in the snow. This grim legacy continues with another relative in a civil war uniform, eerily similar to Lt. Dan, who meets the same fate, and yet another in a World War II uniform who falls tragically on the beaches of Normandy. Returning to the present, Lt. Dan steps back alongside Bubba and Forrest, strolling the walkway with them trailing closely, before he enters the latrine, still clutching the toilet paper. Within the privacy of the latrine, he briefly vanishes from view, only to rise momentarily, casting a glance at the boys, before retreating from sight once more. Bubba and Forrest share a look of mutual understanding, a silent conversation passing between them. Later, Forrest, Bubba, and their comrades from the Fourth Platoon traverse a rice field, diligently observed by Vietnamese farmers tending to their crops. Their journey takes them onto a dirt road, where Lt. Dan suddenly raises his fist—a signal for them to halt abruptly. He gestures emphatically for them to get down, a command Forrest obeys instantly, scanning their surroundings with heightened awareness. Lt. Dan, expressing urgency, signals the lead soldier to crouch, scrutinizing the line of men before indicating his eyes—a silent command to stay vigilant—before he lies flat on the road and begins to crawl stealthily. In the midst of this tension, Tex raises his hand, a gesture of uncertainty, conveying his lack of understanding. Seizing the moment, Forrest rises, resolute, and joins the platoon in their advance. As Lt. Dan moves away, there is a sudden urgency in Forrest's actions; he dashes forward, his focus narrowing as he aims two pistols into a concealed hole before deftly climbing inside, ready for whatever follows."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Forrest watches Jenny depart in the pickup and then sits on a log by a river, contemplating in his uniform. Mrs. Gump joins him, and he rests his head on her shoulder. Meanwhile, a helicopter casts its shadow over a rice field as a soldier mans a gun. The helicopter lands at the firebase with Forrest and Bubba aboard. They disembark with their gear and observe soldiers barbecuing and drinking beer nearby. Lieutenant Dan Taylor emerges from a tent, holding a roll of toilet paper, and exchanges a look with Bubba and Forrest, who do not understand the humor. They follow Lt. Dan as he interacts briefly with Sergeant before leading them to the latrine. Lt. Dan enters, sits, stands briefly to look at the boys, and then sits back down. Later, Forrest, Bubba, and their platoon traverse a rice field while Vietnamese farmers work. On a dirt road, Lt. Dan signals the unit to halt and take cover, prompting Forrest to comply and observe the surroundings. Lt. Dan instructs them to be vigilant, then crawls on the dirt road. Amid uncertainty from Tex, Forrest rises and moves with the platoon. He promptly goes to Lt. Dan, takes aim with two pistols, and climbs into a hole."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Forrest watches Jenny, who is seated in the pickup truck that she often uses to visit nearby towns, as it drives away. Forrest, dressed in his military uniform from serving in the Vietnam War, sits on a log and looks out at a river that winds through the lush landscape. Mrs. Gump, his devoted mother, walks toward Forrest and sits down next to him on the log, offering silent support. Forrest leans down, placing his head on his mother's shoulder, seeking comfort. The shadow of a helicopter, a common sight in war zones, passes over the rice field below as a soldier mans a gun from inside the helicopter, alert to potential threats. The soldier looks left as Forrest and Bubba, his close friend from training, ride in the helicopter, which circles overhead and lands at the firebase, a temporary military encampment. Bubba and Forrest jump out with their gear, feeling the intensity of their surroundings, and walk, looking around oddly at the bustling activity. A soldier, trying to lighten the mood, places a case of beer on a large stack of cases, takes two beers out, and walks away, while in the background soldiers are barbecuing steaks and drinking beer to celebrate a brief respite from duty. Lieutenant Dan Taylor, a hardened officer with a complex family history of military service, steps out of a tent, shirtless, holding a roll of toilet paper in his hand, and looks at Bubba. Forrest and Bubba look at each other oddly, not getting the joke that Lt. Dan is known for his sarcastic sense of humor, as he starts to walk. Bubba and Forrest grab their gear and follow him. Lt. Dan stops and looks at the boys, who are still adjusting to the harsh realities of war, then steps over to a large black soldier named Sergeant, a respected figure in their unit. A distant relative of Lt. Dan, who comes from a long line of soldiers, wearing a revolutionary war uniform, falls dead in the snow, symbolizing the family tradition of sacrifice. Another relative, in a civil war uniform, resembling Lt. Dan, falls dead, and another, in a World War II uniform, falls dead on the beach at Normandy, marking the lineage of military service. Lt. Dan steps back to Bubba and Forrest, walks along the walkway with them following, and steps inside the latrine, still holding the toilet paper, an item in short supply. He sits down out of sight, stands up looking at the boys, then sits back down out of sight, a routine gesture to ensure privacy. Bubba and Forrest look at each other, silently communicating their shared confusion. Forrest, Bubba, and other soldiers in the Fourth Platoon, a group known for its diversity and camaraderie, walk across the rice field as Vietnamese rice farmers work nearby, illustrating the intersection of war and civilian life. Forrest's unit walks along a dirt road when suddenly Lt. Dan holds up his fist, a military hand signal for them to stop. He motions for them to get down, and Forrest complies, looking around for signs of danger. Lt. Dan motions for the lead soldier to get down, crouches, looks at the soldiers, and points to his eyes as a warning to stay alert before lying down on the dirt road and crawling to scout ahead. Tex holds up his hand, motioning that he doesn't know what's ahead. Forrest stands up and begins to walk with the platoon, prepared for whatever comes next. Lt. Dan walks away as Forrest, taking initiative, rushes over, aims two pistols in the hole to ensure it is safe, and then climbs inside, demonstrating his growing courage and initiative in the field."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Forrest watches Jenny in the pickup as it drives away. Forrest dressed in his uniform sits on a log and looks out at a river. Mrs Gump walks toward Forrest and sits down next to him on the log. Forrest leans down placing his head on his mother's shoulder. The shadow of a helicopter is over the rice field below as a soldier mans a gun from inside the helicopter. The soldier looks left as Forrest and Bubba ride in the helicopter which circles overhead and lands at the firebase. Bubba and Forrest jump out with their gear and walk looking around oddly. A soldier places a case of beer on a large stack of cases takes two beers out and walks away while in the background soldiers are barbecuing steaks and drinking beer. Lieutenant Dan Taylor steps out of a tent shirtless holding a roll of toilet paper in his hand and looks at Bubba. Forrest and Bubba look at each other oddly not getting the joke as Lt Dan starts to walk. Bubba and Forrest grab their gear and follow him. Lt Dan stops and looks at the boys then steps over to a large black soldier named Sergeant. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. A distant relative of Lt Dan wearing a revolutionary war uniform falls dead in the snow. Another relative in a civil war uniform resembling Lt Dan falls dead and another in a World War II uniform falls dead on the beach at Normandy. Lt Dan steps back to Bubba and Forrest walks along the walkway with them following and steps inside the latrine still holding the toilet paper. He sits down out of sight stands up looking at the boys then sits back down out of sight. Bubba and Forrest look at each other. Forrest Bubba and other soldiers in the Fourth Platoon walk across the rice field as Vietnamese rice farmers work nearby. Forrest's unit walks along a dirt road when suddenly Lt Dan holds up his fist signaling them to stop. He motions for them to get down and Forrest complies looking around. Lt Dan motions for the lead soldier to get down. crouches looks at the soldiers and points to his eyes before lying down on the dirt road and crawling. Tex holds up his hand motioning that he does not know. Forrest stands up and begins to walk with the platoon. Lt Dan walks away as Forrest rushes over aims two pistols in the hole and then climbs inside."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Forrest watches Jenny in the pickup as it drives away. Forrest dressed in his uniform sits on a log and looks out at a river. Mrs Gump walks toward Forrest and sits down next to him on the log. Forrest leans down placing his head on his mother's shoulder. The shadow of a helicopter is over the rice field below as a soldier mans a gun from inside the helicopter. The soldier looks left as Forrest and Bubba ride in the helicopter which circles overhead and lands at the firebase. Bubba and Forrest jump out with their gear and walk looking around oddly. A soldier places a case of beer on a large stack of cases takes two beers out and walks away while in the background soldiers are barbecuing steaks and drinking beer. Lieutenant Dan Taylor steps out of a tent shirtless holding a roll of toilet paper in his hand and looks at Bubba. Forrest and Bubba look at each other oddly not getting the joke as Lt Dan starts to walk. Bubba and Forrest grab their gear and follow him. Lt Dan stops and looks at the boys then steps over to a large black soldier named Sergeant. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. A distant relative of Lt Dan wearing a revolutionary war uniform falls dead in the snow. Another relative in a civil war uniform resembling Lt Dan falls dead and another in a World War II uniform falls dead on the beach at Normandy. Lt Dan steps back to Bubba and Forrest walks along the walkway with them following and steps inside the latrine still holding the toilet paper. He sits down out of sight stands up looking at the boys then sits back down out of sight. Bubba and Forrest look at each other. Forrest Bubba and other soldiers in the Fourth Platoon walk across the rice field as Vietnamese rice farmers work nearby. Forrest's unit walks along a dirt road when suddenly Lt Dan holds up his fist signaling them to stop. He motions for them to get down and Forrest complies looking around. Lt Dan motions for the lead soldier to get down. crouches looks at the soldiers and points to his eyes before lying down on the dirt road and crawling. Tex holds up his hand motioning that he does not know. Forrest stands up and begins to walk with the platoon. Lt Dan walks away as Forrest rushes over aims two pistols in the hole and then climbs inside."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Forrest watches Jenny in the pickup as it drives away. Forrest dressed in his uniform sits on a log and looks out at a river. Mrs Gump walks toward Forrest and sits down next to him on the log. Forrest leans down placing his head on his mother's shoulder. The shadow of a helicopter is over the rice field below as a soldier mans a gun from inside the helicopter. The soldier looks left as Forrest and Bubba ride in the helicopter which circles overhead and lands at the firebase. Forrest's unit walks along a dirt road when suddenly Lt Dan holds up his fist signaling them to stop. He motions for them to get down and Forrest complies looking around. Lt Dan motions for the lead soldier to get down. crouches looks at the soldiers and points to his eyes before lying down on the dirt road and crawling. Tex holds up his hand motioning that he does not know. Forrest stands up and begins to walk with the platoon. Lt Dan walks away as Forrest rushes over aims two pistols in the hole and then climbs inside."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Forrest watches Jenny in the pickup as it drives away. Forrest dressed in his uniform sits on a log and looks out at a river. Tex holds up his hand motioning that he does not know. Forrest stands up and begins to walk with the platoon. Lt Dan walks away as Forrest rushes over aims two pistols in the hole and then climbs inside."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Walter observes Sarah in the carriage as it floats off. Walter, clad in his costume, perches on a boulder and peers out at a fountain. Mrs. Finch strides toward Walter and crouches beside him on the boulder. Walter bends over, resting his chin on his aunt's elbow. The silhouette of a blimp is over the meadow below as a farmer wields a rake from inside the blimp. The farmer glances right as Walter and Larry glide in the blimp, which hovers above and lands at the outpost. Larry and Walter leap out with their suitcases and stroll, glancing about curiously. A farmer sets a crate of apples on a massive pile of crates, extracts two apples, and strolls off, while in the distance farmers are grilling vegetables and sipping lemonade. Captain Dave Johnson exits a shack, barefoot, clutching a newspaper in his grip, and stares at Larry. Walter and Larry glance at each other curiously, not understanding the humor, as Capt. Dave commences to meander. Larry and Walter seize their suitcases and trail him. Capt. Dave pauses and glares at the girls, then saunters over to a hefty white farmer known as Corporal. A distant kin of Capt. Dave, clad in a medieval armor, collapses frozen in the sand. Another kin, in a renaissance outfit, resembling Capt. Dave, collapses lifeless, and another, in a Napoleonic attire, collapses lifeless on the plains of Waterloo. Capt. Dave meanders back to Larry and Walter, strides along the boardwalk with them trailing, and enters the lavatory, still clutching the newspaper. He squats unseen, rises peering at the girls, then squats back unseen. Larry and Walter glance at each other. Walter, Larry, and other farmers in the Third Group trudge across the meadow as Japanese rice planters toil nearby. Walter's squad trudges along a gravel path when abruptly Capt. Dave raises his palm, signalling them to pause. He gestures for them to lie down, and Walter obeys, surveying the surroundings. Capt. Dave gestures for the front farmer to lie down, squats, surveys the farmers, and gestures to his ears before reclining on the gravel path and slithering. Joe raises his arm, signaling perplexity. Walter rises and starts to stroll with the group. Capt. Dave strolls off as Walter dashes over, aims two water guns in the trench, and then clambers inside."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Forrest watches Jenny leave in a pickup truck. Dressed in his uniform, Forrest sits on a log by the river with his mother, Mrs. Gump. The scene shifts to Vietnam, where helicopters fly over rice fields. Forrest and Bubba arrive at a firebase, witnessing soldiers drinking and barbecuing. Lieutenant Dan Taylor, shirtless and holding toilet paper, emerges from a tent. He jokes with a large black soldier named Sergeant, but Forrest and Bubba don't understand. Dan, a descendant of fallen soldiers, joins Forrest and Bubba, leading them to the latrine. Later, the platoon, including Forrest and Bubba, crosses a rice field. Lt. Dan signals them to stop and crouch. Tex signals confusion, but Forrest stands and walks with the platoon, while Lt. Dan departs. Forrest aims pistols into a hole and climbs inside."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Lt Dan walks away as Forrest rushes over aims two pistols in the hole and then climbs inside Forrest stands up and begins to walk with the platoon Tex holds up his hand motioning that he does not know crouches looks at the soldiers and points to his eyes before lying down on the dirt road and crawling Lt Dan motions for the lead soldier to get down He motions for them to get down and Forrest complies looking around Forrest's unit walks along a dirt road when suddenly Lt Dan holds up his fist signaling them to stop Forrest Bubba and other soldiers in the Fourth Platoon walk across the rice field as Vietnamese rice farmers work nearby Bubba and Forrest look at each other He sits down out of sight stands up looking at the boys then sits back down out of sight Lt Dan steps back to Bubba and Forrest walks along the walkway with them following and steps inside the latrine still holding the toilet paper Another relative in a civil war uniform resembling Lt Dan falls dead and another in a World War II uniform falls dead on the beach at Normandy A distant relative of Lt Dan wearing a revolutionary war uniform falls dead in the snow Lt Dan stops and looks at the boys then steps over to a large black soldier named Sergeant Bubba and Forrest grab their gear and follow him Forrest and Bubba look at each other oddly not getting the joke as Lt Dan starts to walk Lieutenant Dan Taylor steps out of a tent shirtless holding a roll of toilet paper in his hand and looks at Bubba A soldier places a case of beer on a large stack of cases takes two beers out and walks away while in the background soldiers are barbecuing steaks and drinking beer Bubba and Forrest jump out with their gear and walk looking around oddly The soldier looks left as Forrest and Bubba ride in the helicopter which circles overhead and lands at the firebase The shadow of a helicopter is over the rice field below as a soldier mans a gun from inside the helicopter Forrest leans down placing his head on his mother's shoulder Mrs Gump walks toward Forrest and sits down next to him on the log Forrest dressed in his uniform sits on a log and looks out at a river Forrest watches Jenny in the pickup as it drives away"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Forrest dressed in his uniform sits on a log and looks out at a river Forrest watches Jenny in the pickup as it drives away Forrest leans down placing his head on his mother's shoulder Mrs Gump walks toward Forrest and sits down next to him on the log The soldier looks left as Forrest and Bubba ride in the helicopter which circles overhead and lands at the firebase The shadow of a helicopter is over the rice field below as a soldier mans a gun from inside the helicopter A soldier places a case of beer on a large stack of cases takes two beers out and walks away while in the background soldiers are barbecuing steaks and drinking beer Bubba and Forrest jump out with their gear and walk looking around oddly Forrest and Bubba look at each other oddly not getting the joke as Lt Dan starts to walk Lieutenant Dan Taylor steps out of a tent shirtless holding a roll of toilet paper in his hand and looks at Bubba Lt Dan stops and looks at the boys then steps over to a large black soldier named Sergeant Bubba and Forrest grab their gear and follow him Another relative in a civil war uniform resembling Lt Dan falls dead and another in a World War II uniform falls dead on the beach at Normandy A distant relative of Lt Dan wearing a revolutionary war uniform falls dead in the snow He sits down out of sight stands up looking at the boys then sits back down out of sight Lt Dan steps back to Bubba and Forrest walks along the walkway with them following and steps inside the latrine still holding the toilet paper Forrest Bubba and other soldiers in the Fourth Platoon walk across the rice field as Vietnamese rice farmers work nearby Bubba and Forrest look at each other He motions for them to get down and Forrest complies looking around Forrest's unit walks along a dirt road when suddenly Lt Dan holds up his fist signaling them to stop crouches looks at the soldiers and points to his eyes before lying down on the dirt road and crawling Lt Dan motions for the lead soldier to get down Forrest stands up and begins to walk with the platoon Tex holds up his hand motioning that he does not know Lt Dan walks away as Forrest rushes over aims two pistols in the hole and then climbs inside"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Another relative in a civil war uniform resembling Lt Dan falls dead and another in a World War II uniform falls dead on the beach at Normandy Lt Dan steps back to Bubba and Forrest walks along the walkway with them following and steps inside the latrine still holding the toilet paper He sits down out of sight stands up looking at the boys then sits back down out of sight Bubba and Forrest look at each other Forrest Bubba and other soldiers in the Fourth Platoon walk across the rice field as Vietnamese rice farmers work nearby Forrest's unit walks along a dirt road when suddenly Lt Dan holds up his fist signaling them to stop He motions for them to get down and Forrest complies looking around Lt Dan motions for the lead soldier to get down crouches looks at the soldiers and points to his eyes before lying down on the dirt road and crawling Tex holds up his hand motioning that he does not know Forrest stands up and begins to walk with the platoon Lt Dan walks away as Forrest rushes over aims two pistols in the hole and then climbs inside Forrest watches Jenny in the pickup as it drives away Forrest dressed in his uniform sits on a log and looks out at a river Mrs Gump walks toward Forrest and sits down next to him on the log Forrest leans down placing his head on his mother's shoulder The shadow of a helicopter is over the rice field below as a soldier mans a gun from inside the helicopter The soldier looks left as Forrest and Bubba ride in the helicopter which circles overhead and lands at the firebase Bubba and Forrest jump out with their gear and walk looking around oddly A soldier places a case of beer on a large stack of cases takes two beers out and walks away while in the background soldiers are barbecuing steaks and drinking beer Lieutenant Dan Taylor steps out of a tent shirtless holding a roll of toilet paper in his hand and looks at Bubba Forrest and Bubba look at each other oddly not getting the joke as Lt Dan starts to walk Bubba and Forrest grab their gear and follow him Lt Dan stops and looks at the boys then steps over to a large black soldier named Sergeant A distant relative of Lt Dan wearing a revolutionary war uniform falls dead in the snow"
        }
      ]
    }
  ]
}