{
  "ground_truth": "A spider, bigger than a man's hand, jumps out of the box and scuttles past Harry and off down the corridor. Harry stretches out his hand, but a wind seems to draw him away as the door slams shut. Back on Harry's desk, the book opens and glows with light. Harry lands back in his chair in the school courtyard where they look at each other guiltily. As Hagrid walks towards the school, a boy rushes out past him, and they all run to the boys' dormitory, stopping in the doorway. The floor is covered with scattered books and papers, broken picture frames, and feathers. The mattress and pillows of Harry's four-poster bed have been slashed, and drawers have been emptied out. Hedwig the Snowy Owl sits on the desk as Harry searches through a pile of books on the floor. The Gryffindor team heads for the pitch, and in the hospital wing, Madam Pomfrey is standing next to a bed where a petrified girl is lying. Harry and Ron stare with horror at the stiff figure and a hand mirror. Hermione's eyes are wide open and staring as Harry gently strokes her outstretched hand in the Gryffindor common room. She sweeps out, and concerned, the students look at each other as Harry turns to Ron. In Hagrid's cottage at the edge of the dark forest, his dog Fang raises his head, and Hagrid picks up his crossbow, kicking open the door. Harry and Ron hide under the invisibility cloak as Lucius Malfoy opens the door and steps inside, stopping near the boys under the cloak. Fudge goes to take it, but Dumbledore stops him, taking the scroll and staring straight at Harry and Ron. Lucius Malfoy looks around suspiciously, crosses to the door, and giving the boys one last look, Dumbledore follows him. Fudge looks confused and stares at the huge dog as they leave, and the boys reappear. Lines of spiders are following each other up the wall and out of the window as Harry lifts down a heavy lantern, and the huge hound follows them outside. They look up at the light from the cottage window while the spiders crawl down the wall and on to the ground. Ron watches the spiders nervously as they scuttle after each other away into the forest. Harry starts walking and Ron follows Harry reluctantly, with Fang dropping ahead as they make their way through the dark night into the gloomy forest. Fang sniffs the ground as they are led deeper into the shadowy forest, terrified of spiders. Ron walks on his toes trying not to tread on them, while Harry ignores him and keeps on walking. Harry stops and holds up the lantern, revealing that the spiders have led them to the mouth of a large tunnel dug into the sandy soil under the roots of a tree.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A arachnid, larger than a man's palm, leaps out of the crate and scuttles past Harry and off down the passageway. Harry extends out his hand, but a breeze seems to pull him away as the portal slams closed. Back on Harry's table, the tome opens and glows with illumination. Harry lands back in his seat in the school courtyard where they gaze at each other guiltily. As Hagrid strides towards the school, a lad dashes out past him, and they all sprint to the boys' dormitory, halting in the entryway. The flooring is covered with strewn tomes and documents, shattered picture frames, and plumes. The mattress and cushions of Harry's four-poster bed have been slashed, and drawers have been emptied out. Hedwig the Snowy Owl perches on the table as Harry searches through a heap of tomes on the flooring. The Gryffindor squad heads for the field, and in the infirmary, Madam Pomfrey is standing next to a bed where a petrified girl is lying. Harry and Ron gaze with dread at the rigid figure and a hand mirror. Hermione's eyes are wide open and staring as Harry gently strokes her extended hand in the Gryffindor common room. She sweeps out, and concerned, the students look at each other as Harry turns to Ron. In Hagrid's cabin at the edge of the dark woodland, his canine Fang raises his head, and Hagrid picks up his crossbow, kicking open the portal. Harry and Ron conceal under the invisibility cloak as Lucius Malfoy opens the portal and steps inside, halting near the lads under the cloak. Fudge goes to take it, but Dumbledore interrupts him, taking the scroll and staring directly at Harry and Ron. Lucius Malfoy glances around suspiciously, crosses to the portal, and giving the lads one last look, Dumbledore follows him. Fudge looks perplexed and stares at the massive canine as they depart, and the lads reappear. Lines of arachnids are following each other up the partition and out of the casement as Harry lifts down a hefty lantern, and the massive hound follows them outside. They look up at the illumination from the cabin casement while the arachnids crawl down the partition and onto the ground. Ron watches the arachnids nervously as they scuttle after each other away into the woodland. Harry starts walking and Ron follows Harry reluctantly, with Fang dropping ahead as they make their way through the dark night into the gloomy woodland. Fang sniffs the ground as they are led deeper into the shadowy woodland, terrified of arachnids. Ron walks on his toes trying not to tread on them, while Harry ignores him and keeps on walking. Harry halts and holds up the lantern, revealing that the arachnids have led them to the mouth of a large tunnel dug into the sandy ground under the roots of a tree."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A spider, which is bigger than a man's hand, is jumped out of by the box and is scuttled past by it, heading off down the corridor. Harry stretches out his hand, but the wind seems to draw him away as the door is slammed shut. Back on Harry's desk, the book is opened and is glowing with light. Harry is landed back in his chair in the school courtyard where each other is looked at guiltily by them. As Hagrid walks towards the school, a boy rushes out past him, and the boys' dormitory is run to by them, stopping in the doorway. The floor is covered with scattered books and papers, broken picture frames, and feathers. The mattress and pillows of Harry's four-poster bed have been slashed, and drawers have been emptied out. Hedwig the Snowy Owl is sitting on the desk as a pile of books on the floor is searched through by Harry. The Gryffindor team is headed for the pitch, and in the hospital wing, Madam Pomfrey stands next to a bed where a petrified girl lies. The stiff figure and a hand mirror are stared at by Harry and Ron with horror. Hermione's eyes are wide open and staring as her outstretched hand is gently stroked by Harry in the Gryffindor common room. She sweeps out, and concerned, each other is looked at by the students as Ron is turned to by Harry. In Hagrid's cottage at the edge of the dark forest, Fang's head is raised by his dog, and Hagrid picks up his crossbow, kicking open the door. Harry and Ron hide under the invisibility cloak as Lucius Malfoy opens the door, stepping inside and stopping near the boys under the cloak. Fudge goes to take it, but the scroll is taken by Dumbledore, who stops him and stares straight at Harry and Ron. Lucius Malfoy looks around suspiciously, crosses to the door, and the boys are given one last look by him as Dumbledore follows him. Fudge looks confused and stares at the huge dog as they leave, and the boys reappear. Lines of spiders follow each other up the wall and out of the window as down a heavy lantern is lifted by Harry, and they are followed outside by the huge hound. They look up at the light from the cottage window while the wall is crawled down by the spiders and on to the ground. The spiders are watched nervously by Ron as they scuttle after each other away into the forest. Walking is started by Harry and Ron follows him reluctantly, with Fang dropping ahead as their way through the dark night into the gloomy forest is made. The ground is sniffed by Fang as they are led deeper into the shadowy forest, terrified of spiders. Ron walks on his toes trying not to tread on them, while Harry ignores him and keeps on walking. Harry stops and holds up the lantern, revealing that they have been led by the spiders to the mouth of a large tunnel dug into the sandy soil under the roots of a tree."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A spider, larger than a man's hand, leaps from the box, scuttling past Harry down the corridor. Harry reaches out, but a gust pulls him away as the door slams shut. Back at Harry's desk, the book opens, glowing. Harry finds himself back in his chair as they exchange guilty looks. Hagrid approaches the school as a boy rushes past him, and they all run to the boys' dormitory, pausing at the doorway. The floor is littered with books, papers, broken frames, and feathers. The mattress and pillows of Harry's bed are slashed, and drawers emptied. Hedwig the Snowy Owl sits on the desk as Harry searches among the books on the floor. The Gryffindor team heads to the pitch, and in the hospital wing, Madam Pomfrey stands by a bed with a petrified girl. Harry and Ron stare at her still form and a hand mirror. Hermione's eyes are wide open in the common room as Harry strokes her hand. Concerned, students glance at each other as Harry turns to Ron. In Hagrid's forest cottage, his dog Fang lifts his head as Hagrid grabs his crossbow, kicking the door open. Harry and Ron hide under the invisibility cloak as Lucius Malfoy enters, stopping near them. Fudge goes to take something, but Dumbledore intervenes, taking the scroll and looking at Harry and Ron. Lucius Malfoy suspiciously glances around, exits, and Dumbledore follows. Fudge, puzzled, stares at the dog as they leave, then the boys reappear. Spiders crawl up the wall and out the window as Harry lifts a lantern, the hound following outside. They see light from the cottage window while spiders crawl down the wall. Nervous, Ron watches the spiders scuttle into the forest. Harry leads, with Ron reluctantly following and Fang ahead, into the dark forest. Fang sniffs as they venture deeper, terrified of spiders. Ron walks gingerly, avoiding them, while Harry presses on. Harry halts and raises the lantern, revealing spiders leading to a large tunnel beneath a tree's roots."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A spider, larger than a man's hand, leaps from a box past Harry, disappearing down the corridor as the door slams. Back on Harry's desk, a book glows. Harry lands in a school courtyard, exchanging guilty looks with others. As Hagrid approaches, a boy rushes past, and they hurry to the boys' dormitory, finding it in disarray with slashed bedding. Hedwig, the Snowy Owl, perches as Harry searches fallen books. The Gryffindor team heads for the pitch; in the hospital wing, Madam Pomfrey stands by a petrified girl. Harry and Ron, horrified, see Hermione's stiff figure and hand mirror. In the Gryffindor common room, Harry gently touches her hand as she leaves. In Hagrid's cottage, Fang raises his head; Hagrid grabs his crossbow, opens the door, and Harry and Ron hide under the invisibility cloak. Lucius Malfoy enters, stops, and Dumbledore takes a scroll, looking at Harry and Ron. Malfoy glances around before leaving with Dumbledore. Fudge looks puzzled at Fang as they exit, and the boys reappear. Spiders climb the wall out the window, and Harry lifts a lantern, with Fang following outside. They watch spiders crawl away into the forest. Ron nervously watches as Harry leads, followed by a reluctant Ron, deep into the dark forest. Fang sniffs as they go, terrified of spiders. Ron tiptoes, while Harry presses on, stopping to reveal a tunnel entrance under a tree."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A spider, larger than an average man's hand, suddenly leaps out from inside the box, swiftly scuttling past Harry and disappearing down the long corridor. As Harry instinctively reaches out his hand in response, a mysterious wind seems to pull him back just as the door abruptly slams shut, sealing him inside. Meanwhile, on Harry's desk, the book lying there opens by itself and begins to emit a glowing light. Harry finds himself landing back in his chair situated in the bustling school courtyard, where they exchange guilty glances. Hagrid is seen walking purposefully towards the school, while a boy urgently rushes past him, causing them all to sprint towards the boys' dormitory, halting when they reach the doorway. Inside, the floor is a chaotic mess, littered with scattered books and papers, broken picture frames, and stray feathers. The mattress and pillows of Harry's four-poster bed have been viciously slashed, and the drawers have been completely emptied out. Seated on the desk, Hedwig, Harry's loyal Snowy Owl, observes as Harry frantically searches through the pile of books strewn across the floor. Meanwhile, the dedicated Gryffindor team makes its way to the pitch, and in the hospital wing, Madam Pomfrey is standing solemnly next to a bed where a petrified girl lies motionless. Filled with horror, Harry and Ron can only stare at the rigid figure, with a hand mirror beside it. Hermione’s eyes are wide open and staring as Harry tenderly strokes her outstretched hand in the cozy Gryffindor common room. She then sweeps out, leaving the concerned students to exchange worried looks as Harry turns to Ron for reassurance. Over at Hagrid's cottage, located right on the edge of the ominous dark forest, his faithful dog Fang lifts his head, while Hagrid reaches for his crossbow and forcefully kicks the door open. Beneath the protection of the invisibility cloak, Harry and Ron hide as Lucius Malfoy enters, pausing near them under the cloak. Fudge moves to take it, but Dumbledore intervenes, taking hold of the scroll and staring intently at Harry and Ron. Lucius Malfoy glances around suspiciously, crosses to the door, and after giving the boys one final scrutinizing look, Dumbledore follows him out. Fudge appears bewildered and gazes at the enormous dog as they exit, prompting the boys to reappear. In the meantime, lines of spiders are seen following one another up the wall and through the open window as Harry carefully retrieves a heavy lantern. The enormous hound trails them outside, and they glance up at the light shining from the cottage window as the spiders crawl down the wall and onto the ground. With nervous anxiety, Ron watches the spiders, who scuttle after each other, heading into the depths of the forest. Harry begins to walk, and although apprehensive, Ron follows after him reluctantly, with Fang trotting ahead as they navigate their way through the dark and ominous night into the gloomy, shadowy forest. Sniffing the ground, Fang leads them deeper into the creepy forest, both terrified of the spiders all around. Ron tiptoes, gingerly trying not to step on any of the spiders, while Harry disregards him and continues on his determined walk. Harry eventually halts, raising the lantern high, revealing that the trail of spiders has guided them to the entrance of a large tunnel, which appears to have been dug into the sandy soil beneath the tangled roots of a tree."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Emerging unexpectedly from the depths within the box, an enormous spider, significantly larger than the average man’s hand, suddenly springs forth with alarming agility. It swiftly scuttles across the floor, passing Harry in a flash before disappearing down the seemingly endless long corridor. In the midst of this surprising encounter, Harry, acting on sheer instinct, reaches out his hand as if to catch or ward off the creature. However, a peculiar and mysterious gust of wind unexpectedly pulls him backward just as the door slams shut with a loud bang, trapping him inside the room. At this very same moment, on Harry’s desk, a book that had been lying there suddenly flips open on its own accord. It begins to emit an otherworldly glowing light that fills the room.\n\nIn a blink, Harry finds himself back in his chair, now positioned in the lively and bustling school courtyard where he exchanges guilty glances with others around him. Hagrid is seen ahead, striding purposefully towards the school, his large frame impossible to miss. Meanwhile, a boy sprints past Hagrid with urgency, an action that propels everyone into a race towards the boys’ dormitory, only to come to a sudden halt upon reaching the doorway. Inside the dormitory, chaos reigns supreme. The floor is a tangled mess, littered with scattered books, loose papers, and shattered picture frames. Stray feathers from a pillow are strewn everywhere, and Harry's four-poster bed shows visible signs of destruction, as its mattress and pillows have been viciously slashed open, while the drawers have been completely emptied, leaving their contents disarrayed.\n\nOn the desk, Hedwig, Harry’s loyal Snowy Owl, perches and watches intently as Harry frantically searches through the disordered pile of books scattered across the floor. Meanwhile, over at the Quidditch pitch, the determined Gryffindor team makes its way, preparing for whatever challenge lies ahead. In stark contrast, the atmosphere in the hospital wing is somber, where Madam Pomfrey stands with a serious expression beside a bed that holds a petrified girl, lying motionless in a state of suspended horror. Harry and Ron, filled with horror and disbelief, can only stand and stare at the rigid figure with a hand mirror beside it. Hermione’s eyes are wide open yet unseeing as Harry gently strokes her outstretched hand in the cozy confines of the Gryffindor common room. She then sweeps out with an air of determination, leaving the concerned students behind to share worried, uncertain looks. Harry turns to Ron, seeking reassurance and comfort.\n\nOver at Hagrid’s cottage, which sits right at the edge of the ominous, dense dark forest, his faithful dog Fang raises his head attentively. Hagrid, sensing something amiss, reaches for his trusty crossbow and kicks the door open forcefully. Meanwhile, under the protective cover of the invisibility cloak, Harry and Ron hide as Lucius Malfoy makes his entrance, pausing dangerously close to where they shadow themselves under the cloak. Fudge inches forward with an intention to take it, but Dumbledore intervenes, grasping the scroll and directing an intense gaze at Harry and Ron. Lucius Malfoy, filled with suspicion, surveys the room before crossing to the door. After casting the boys one final scrutinizing look, he exits, with Dumbledore following closely behind. Fudge appears utterly bewildered by the events and briefly gazes at the enormous dog as they exit, which prompts Harry and Ron to emerge from hiding.\n\nDuring this time, lines of spiders, seemingly marching with purpose, follow one another in a single-file up the wall and through the open window. Watching this, Harry carefully retrieves a heavy lantern, his movements deliberate and cautious. The massive hound, Fang, trails closely behind them as they head outside. They glance up to see the light radiating warmly from the cottage window while the spiders crawl down the wall and onto the ground below. With nervous anxiety building up, Ron watches the arachnids as they scuttle after one another, heading determinedly into the ominous depths of the forest. Despite his apprehension, Harry leads the way, beginning to walk forward into the night, with Ron reluctantly following, albeit with hesitation, while Fang trots assuredly ahead. Together, they navigate their way through the dark and foreboding night, into the murky, shadow-laden forest. Fang, sniffing the ground for clues, leads them deeper into the creepy woodland, both Harry and Ron on edge due to the presence of spiders surrounding them. Ron tiptoes cautiously, desperately trying not to step on any of the spiders, while Harry, singular in focus, disregards these concerns and presses on. Eventually, Harry comes to a stop, raising the lantern high in the air, revealing that the path of spiders has led them to the entrance of a large tunnel. This tunnel appears to have been laboriously dug into the sandy soil, nestled beneath the tangled roots of an aged and towering tree."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A spider, enormous and menacing in size, unexpectedly springs out from within the box, its legs unfurling swiftly as it propels itself past Harry. It scuttles quickly, its movements a blur, as it darts away down the corridor. Harry instinctively reaches out his hand, intent on grasping or perhaps halting the creature, but a sudden, inexplicable gust seems to pull him back, disrupting his balance, as the door abruptly swings shut with a resolute clang. Meanwhile, back on Harry's desk, the book silently springs open by some unseen force and begins to emit an otherworldly glow that bathes the surroundings in light. In a disorienting instant, Harry finds himself landing back with a slight thud onto his chair, which is positioned in the familiar expansiveness of the school courtyard, where he exchanges guilty, acknowledging glances with his companions. As Hagrid approaches the imposing silhouette of the school building, his large frame casting shadows in the sunlight, a boy suddenly bursts out, sprinting past him with urgency etched on his face. Spurred by an unspoken agreement, they all immediately take off in a hurried run towards the boys' dormitory, skidding to a halt as they reach the threshold. Their eyes widen as they take in the scene before them: the floor is a chaotic mess, strewn with a haphazard collection of books and papers, interspersed with shards of broken picture frames and feathers floating gently to rest. The once pristine mattress and pillows of Harry's four-poster bed now lie slashed, their insides exposed, and drawers hang open, their contents emptied and scattered. Amidst the disarray, Hedwig the Snowy Owl perches calmly on the desk, her serene presence contrasting starkly with the disorder, as Harry searches through the tangled heap of books on the floor with growing frustration. Switching scenes, the Gryffindor team, determined and focused, makes their way to the pitch, while within the quiet confines of the hospital wing, Madam Pomfrey stands solemnly beside a bed. On it lies a girl, petrified in stillness, her presence a chilling reminder of the dark events unfolding. Harry and Ron fix unblinking gazes on her rigid form, their minds racing in horror, finally noticing the hand mirror that lies ominously beside her. Hermione's eyes stare unseeing, wide open and fixed, as Harry, seated in the warmth of the Gryffindor common room, gently brushes his hand over her outstretched one, absorbed in thought and concern. Abruptly, she sweeps out with purpose, and the students, now anxious, share troubled looks among themselves as Harry turns to Ron, his expression mirroring their collective worry. In the rustic interior of Hagrid's cottage, nestled at the edge of the foreboding dark forest, the loyal dog Fang perks up, sensing something amiss, as Hagrid decisively retrieves his crossbow and forcefully kicks open the door. In the shadows, Harry and Ron conceal themselves beneath the invisibility cloak just as Lucius Malfoy pushes open the door, stepping inside with an air of authority, coming to a halt perilously close to the space occupied by the hidden boys. Fudge, tempted to reveal them, moves to seize the cloak, but Dumbledore intervenes, taking possession of the scroll while his eyes fix pointedly on Harry and Ron's hidden forms. Lucius Malfoy casts a shrewd, suspicious gaze around the room, his eyes lingering as he crosses towards the door, delivering one final scrutinizing glance before Dumbledore, unflinching, follows him out. Fudge, visibly bewildered, glances back, his eyes momentarily locked on the large dog as they make their exit, allowing the hidden boys to re-emerge into view. Outside the cottage, a disciplined line of spiders is seen, following one another in an endless procession up the wall and out through the open window as Harry carefully reaches up to bring down a heavy lantern, its weight reassuring in his grasp. With an air of determination, the enormous hound trots outside, ambling alongside them as they glance upwards to the tranquil glow spilling from the cottage window, while the spiders, undeterred, descend the vertical surface and skitter across the ground. Ron, his nerves frayed, watches the spiders with unease as they continue their seemingly purposeful journey into the depths of the forest. Harry, resolute, begins to walk, and with a resigned sigh, Ron reluctantly trails behind him, with Fang taking the lead, his nose brushing the earth as they venture deeper into the darkening night that cloaks the gloomy forest. The shadows seem to press in around them, and despite his trepidation of spiders, Ron continues forward, gingerly stepping to avoid the creatures scuttling beneath him, while Harry remains steadfast, his focus unwavering as he presses on. At length, Harry pauses, lifting the lantern high with a steady hand, its beam casting light to reveal that the persistent trail of spiders has led them to the entrance of a formidable tunnel, its wide mouth cutting into the sandy soil beneath the protective roots of a towering tree."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A large spider leaps from the box, bypasses Harry, and quickly scuttles down the corridor as the door slams shut and Harry is drawn away. Meanwhile, the book on Harry's desk opens, glowing with light, and Harry finds himself back in his chair at the school courtyard, exchanging guilty glances with others. When Hagrid approaches the school, they all rush to the boys' dormitory, halting at the entrance to find it in disarray: scattered books, papers, broken picture frames, feathers, and slashed beddings strewn across the floor. Hedwig, the Snowy Owl, is on the desk as Harry sifts through a pile of books. The Gryffindor team heads to the pitch, while in the hospital wing, Madam Pomfrey tends to a petrified girl. Harry and Ron are horrified by Hermione's stiff figure and hand mirror, and Harry gently strokes her hand in the common room. Concerned, students exchange glances as Harry turns to Ron. At the forest's edge, Hagrid's dog Fang reacts as Hagrid, armed with a crossbow, opens the door. Harry and Ron, concealed by the invisibility cloak, watch Lucius Malfoy enter, stopping near them. Dumbledore intercepts Fudge from taking an item, and Lucius, suspicious, exits with Dumbledore following. Fudge departs with confusion as the boys reappear. Spiders line the walls, exiting through the window; Harry lifts a lantern, and the massive hound follows them outside. They observe the cottage's light as spiders descend and scurry into the forest. Ron watches nervously, and despite his reluctance, follows Harry and Fang into the dark forest, trying to avoid the spiders. Fang sniffs the ground, leading them deeper into the forest's shadows. Eventually, Harry stops and raises the lantern, revealing the spiders' trail to a large tunnel beneath a tree's roots."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A spider, larger than a man's hand and resembling the giant tarantulas found in South America's rainforests, jumps out of the box and scuttles past Harry and off down the dimly lit corridor. Harry stretches out his hand, but a mysterious wind, reminiscent of the magical drafts known to haunt old castles, seems to draw him away as the door slams shut with a resounding echo. Back on Harry's desk, the enchanted book, a rare tome from the Restricted Section of the Hogwarts library, opens and glows with an eerie light. Harry lands back in his chair in the school courtyard, a central gathering place at Hogwarts, where they look at each other guiltily. As Hagrid, the school's Keeper of Keys and Grounds, walks towards the school, a boy rushes out past him, and they all run to the boys' dormitory, stopping in the doorway. The floor is covered with scattered books and papers, broken picture frames, and feathers from what seems to be a frenzied attack. The mattress and pillows of Harry's four-poster bed, reminiscent of those used in medieval times, have been slashed, and drawers have been ransacked. Hedwig the Snowy Owl, Harry's loyal companion since his first year at Hogwarts, sits on the desk as Harry searches through a pile of books on the floor. The Gryffindor Quidditch team heads for the pitch, the legendary field where many historic matches have been played, and in the hospital wing, Madam Pomfrey, known for her healing prowess, is standing next to a bed where a petrified girl is lying. Harry and Ron stare with horror at the stiff figure and a hand mirror, a common tool used to detect basilisk gaze effects. Hermione's eyes are wide open and staring as Harry gently strokes her outstretched hand in the cozy Gryffindor common room, a frequent refuge for students. She sweeps out, and concerned, the students look at each other as Harry turns to Ron. In Hagrid's rustic cottage at the edge of the Forbidden Forest, his dog Fang, a boarhound with a gentle demeanor, raises his head, and Hagrid picks up his crossbow, a relic from his days at Hogwarts, kicking open the door. Harry and Ron hide under the invisibility cloak, a rare magical artifact inherited from Harry's father, as Lucius Malfoy, a prominent and infamous figure in the wizarding world, opens the door and steps inside, stopping near the boys under the cloak. Fudge, the Minister of Magic, goes to take it, but Dumbledore, the esteemed headmaster known for his wisdom, stops him, taking the scroll and staring straight at Harry and Ron. Lucius Malfoy looks around suspiciously, crosses to the door, and giving the boys one last look, Dumbledore follows him. Fudge looks confused and stares at the huge dog as they leave, and the boys reappear. Lines of spiders, behaving as if under an unseen directive, are following each other up the wall and out of the window as Harry lifts down a heavy lantern, an old oil-based one used for exploring dark areas, and the huge hound follows them outside. They look up at the light from the cottage window while the spiders crawl down the wall and on to the damp ground. Ron watches the spiders nervously, recalling tales of acromantulas in the forest, as they scuttle after each other away into the forest. Harry starts walking with determined steps and Ron follows Harry reluctantly, with Fang dropping ahead as they make their way through the dark night into the gloomy forest. Fang sniffs the ground as they are led deeper into the shadowy forest, infamous for its dangerous creatures, terrified of spiders. Ron walks on his toes trying not to tread on them, while Harry ignores him and keeps on walking. Harry stops and holds up the lantern, revealing that the spiders have led them to the mouth of a large tunnel dug into the sandy soil under the massive roots of an ancient tree."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Back on Harry's desk the book opens and glows with light A spider bigger than a man's hand jumps out of the box and scuttles past Harry and off down the corridor The Gryffindor team heads for the pitch and in the hospital wing Harry stretches out his hand but a wind seems to draw him away as the door slams shut Lines of spiders are following each other up the wall and out of the window as Harry lifts down a heavy lantern and the huge hound follows them outside Back on Harry's desk the book opens and glows with light Harry lands back in his chair in the school courtyard where they look at each other guiltily As Hagrid walks towards the school a boy rushes out past him and they all run to the boys' dormitory stopping in the doorway Harry lands back in his chair in the school courtyard where they look at each other guiltily A spider bigger than a man's hand jumps out of the box and scuttles past Harry and off down the corridor the students look at each other as Harry turns to Ron The floor is covered with scattered books and papers broken picture frames and feathers The mattress and pillows of Harry's fourposter bed have been slashed and drawers have been emptied out Hedwig the Snowy Owl sits on the desk as Harry searches through a pile of books on the floor Hedwig the Snowy Owl sits on the desk as Harry searches through a pile of books on the floor The Gryffindor team heads for the pitch and in the hospital wing As Hagrid walks towards the school a boy rushes out past him and they all run to the boys' dormitory stopping in the doorway Madam Pomfrey is standing next to a bed where a petrified girl is lying Harry and Ron stare with horror at the stiff figure and a hand mirror Lucius Malfoy looks around suspiciously crosses to the door and giving the boys one last look Hermione's eyes are wide open and staring as Harry gently strokes her outstretched hand in the Gryffindor common room In Hagrid's cottage at the edge of the dark forest his dog Fang raises his head and Hagrid picks up his crossbow kicking open the door She sweeps out and concerned Harry starts walking and Ron follows Harry reluctantly with Fang dropping ahead as they make their way through the dark night into the gloomy forest the students look at each other as Harry turns to Ron In Hagrid's cottage at the edge of the dark forest his dog Fang raises his head and Hagrid picks up his crossbow kicking open the door Harry and Ron hide under the invisibility cloak as Lucius Malfoy opens the door and steps inside stopping near the boys under the cloak Fudge goes to take it but Dumbledore stops him taking the scroll and staring straight at Harry and Ron Fang sniffs the ground as they are led deeper into the shadowy forest Lucius Malfoy looks around suspiciously crosses to the door and giving the boys one last look Dumbledore follows him Fudge looks confused and stares at the huge dog as they leave and the boys reappear They look up at the light from the cottage window while the spiders crawl down the wall and on to the ground terrified of spiders Ron walks on his toes trying not to tread on them while Harry ignores him and keeps on walking Lines of spiders are following each other up the wall and out of the window as Harry lifts down a heavy lantern and the huge hound follows them outside They look up at the light from the cottage window while the spiders crawl down the wall and on to the ground Ron watches the spiders nervously as they scuttle after each other away into the forest Harry starts walking and Ron follows Harry reluctantly with Fang dropping ahead as they make their way through the dark night into the gloomy forest Fang sniffs the ground as they are led deeper into the shadowy forest terrified of spiders Ron walks on his toes trying not to tread on them while Harry ignores him and keeps on walking Harry stops and holds up the lantern revealing that the spiders have led them to the mouth of a large tunnel dug into the sandy soil under the roots of a tree"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "A spider bigger than a man's hand jumps out of the box and scuttles past Harry and off down the corridor. Harry stretches out his hand but a wind seems to draw him away as the door slams shut. Back on Harry's desk the book opens and glows with light. Harry lands back in his chair in the school courtyard where they look at each other guiltily. As Hagrid walks towards the school a boy rushes out past him and they all run to the boys' dormitory stopping in the doorway. The floor is covered with scattered books and papers broken picture frames and feathers. The mattress and pillows of Harry's fourposter bed have been slashed and drawers have been emptied out. Hedwig the Snowy Owl sits on the desk as Harry searches through a pile of books on the floor. The Gryffindor team heads for the pitch and in the hospital wing. Madam Pomfrey is standing next to a bed where a petrified girl is lying. Harry and Ron stare with horror at the stiff figure and a hand mirror. Hermione's eyes are wide open and staring as Harry gently strokes her outstretched hand in the Gryffindor common room. She sweeps out and concerned. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. the students look at each other as Harry turns to Ron. In Hagrid's cottage at the edge of the dark forest his dog Fang raises his head and Hagrid picks up his crossbow kicking open the door. Harry and Ron hide under the invisibility cloak as Lucius Malfoy opens the door and steps inside stopping near the boys under the cloak. Fudge goes to take it but Dumbledore stops him taking the scroll and staring straight at Harry and Ron. Lucius Malfoy looks around suspiciously crosses to the door and giving the boys one last look. Dumbledore follows him. Fudge looks confused and stares at the huge dog as they leave and the boys reappear. Lines of spiders are following each other up the wall and out of the window as Harry lifts down a heavy lantern and the huge hound follows them outside. They look up at the light from the cottage window while the spiders crawl down the wall and on to the ground. Ron watches the spiders nervously as they scuttle after each other away into the forest. Harry starts walking and Ron follows Harry reluctantly with Fang dropping ahead as they make their way through the dark night into the gloomy forest. Fang sniffs the ground as they are led deeper into the shadowy forest. terrified of spiders Ron walks on his toes trying not to tread on them while Harry ignores him and keeps on walking. Harry stops and holds up the lantern revealing that the spiders have led them to the mouth of a large tunnel dug into the sandy soil under the roots of a tree."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "A spider bigger than a man's hand jumps out of the box and scuttles past Harry and off down the corridor. Harry stretches out his hand but a wind seems to draw him away as the door slams shut. Back on Harry's desk the book opens and glows with light. Harry lands back in his chair in the school courtyard where they look at each other guiltily. As Hagrid walks towards the school a boy rushes out past him and they all run to the boys' dormitory stopping in the doorway. The floor is covered with scattered books and papers broken picture frames and feathers. The mattress and pillows of Harry's fourposter bed have been slashed and drawers have been emptied out. Hedwig the Snowy Owl sits on the desk as Harry searches through a pile of books on the floor. The Gryffindor team heads for the pitch and in the hospital wing. Madam Pomfrey is standing next to a bed where a petrified girl is lying. Harry and Ron stare with horror at the stiff figure and a hand mirror. Hermione's eyes are wide open and staring as Harry gently strokes her outstretched hand in the Gryffindor common room. She sweeps out and concerned. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. the students look at each other as Harry turns to Ron. In Hagrid's cottage at the edge of the dark forest his dog Fang raises his head and Hagrid picks up his crossbow kicking open the door. Harry and Ron hide under the invisibility cloak as Lucius Malfoy opens the door and steps inside stopping near the boys under the cloak. Fudge goes to take it but Dumbledore stops him taking the scroll and staring straight at Harry and Ron. Lucius Malfoy looks around suspiciously crosses to the door and giving the boys one last look. Dumbledore follows him. Fudge looks confused and stares at the huge dog as they leave and the boys reappear. Lines of spiders are following each other up the wall and out of the window as Harry lifts down a heavy lantern and the huge hound follows them outside. They look up at the light from the cottage window while the spiders crawl down the wall and on to the ground. Ron watches the spiders nervously as they scuttle after each other away into the forest. Harry starts walking and Ron follows Harry reluctantly with Fang dropping ahead as they make their way through the dark night into the gloomy forest. Fang sniffs the ground as they are led deeper into the shadowy forest. terrified of spiders Ron walks on his toes trying not to tread on them while Harry ignores him and keeps on walking. Harry stops and holds up the lantern revealing that the spiders have led them to the mouth of a large tunnel dug into the sandy soil under the roots of a tree."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "A spider bigger than a man's hand jumps out of the box and scuttles past Harry and off down the corridor. Harry stretches out his hand but a wind seems to draw him away as the door slams shut. Back on Harry's desk the book opens and glows with light. Harry lands back in his chair in the school courtyard where they look at each other guiltily. As Hagrid walks towards the school a boy rushes out past him and they all run to the boys' dormitory stopping in the doorway. The floor is covered with scattered books and papers broken picture frames and feathers. The mattress and pillows of Harry's fourposter bed have been slashed and drawers have been emptied out. Lines of spiders are following each other up the wall and out of the window as Harry lifts down a heavy lantern and the huge hound follows them outside. They look up at the light from the cottage window while the spiders crawl down the wall and on to the ground. Ron watches the spiders nervously as they scuttle after each other away into the forest. Harry starts walking and Ron follows Harry reluctantly with Fang dropping ahead as they make their way through the dark night into the gloomy forest. Fang sniffs the ground as they are led deeper into the shadowy forest. terrified of spiders Ron walks on his toes trying not to tread on them while Harry ignores him and keeps on walking. Harry stops and holds up the lantern revealing that the spiders have led them to the mouth of a large tunnel dug into the sandy soil under the roots of a tree."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "A spider bigger than a man's hand jumps out of the box and scuttles past Harry and off down the corridor. Harry stretches out his hand but a wind seems to draw him away as the door slams shut. Back on Harry's desk the book opens and glows with light. Fang sniffs the ground as they are led deeper into the shadowy forest. terrified of spiders Ron walks on his toes trying not to tread on them while Harry ignores him and keeps on walking. Harry stops and holds up the lantern revealing that the spiders have led them to the mouth of a large tunnel dug into the sandy soil under the roots of a tree."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A rabbit, bigger than a man's hand, jumps out of the box and scuttles past Neville and off down the corridor. Neville stretches out his hand, but a wind seems to draw him away as the door slams shut. Back on Neville's desk, the book opens and glows with light. Neville lands back in his chair in the school courtyard where they look at each other guiltily. As McGonagall walks towards the school, a girl rushes out past her, and they all run to the boys' dormitory, stopping in the doorway. The floor is covered with scattered books and papers, broken picture frames, and feathers. The mattress and pillows of Neville's four-poster bed have been slashed, and drawers have been emptied out. Hedwig the Snowy Owl sits on the desk as Neville searches through a pile of books on the floor. The Ravenclaw team heads for the pitch, and in the hospital wing, Madam Hooch is standing next to a bed where a petrified boy is lying. Neville and Seamus stare with horror at the stiff figure and a hand mirror. Luna's eyes are wide open and staring as Neville gently strokes her outstretched hand in the Gryffindor common room. She sweeps out, and concerned, the students look at each other as Neville turns to Seamus. In McGonagall's cottage at the edge of the dark forest, her cat Mrs. Norris raises her head, and McGonagall picks up her crossbow, kicking open the door. Neville and Seamus hide under the invisibility cloak as Bellatrix Lestrange opens the door and steps inside, stopping near the boys under the cloak. Scrimgeour goes to take it, but Snape stops him, taking the scroll and staring straight at Neville and Seamus. Bellatrix Lestrange looks around suspiciously, crosses to the door, and giving the boys one last look, Snape follows her. Scrimgeour looks confused and stares at the huge cat as they leave, and the boys reappear. Lines of ants are following each other up the wall and out of the window as Neville lifts down a heavy lantern, and the huge cat follows them outside. They look up at the light from the cottage window while the ants crawl down the wall and on to the ground. Seamus watches the ants nervously as they scuttle after each other away into the forest. Neville starts walking and Seamus follows Neville reluctantly, with Mrs. Norris dropping ahead as they make their way through the dark night into the gloomy forest. Mrs. Norris sniffs the ground as they are led deeper into the shadowy forest, terrified of ants. Seamus walks on his toes trying not to tread on them, while Neville ignores him and keeps on walking. Neville stops and holds up the lantern, revealing that the ants have led them to the mouth of a large tunnel dug into the sandy soil under the roots of a tree."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "A spider, bigger than a man's shoe, jumps out of the suitcase and scuttles past Harry and off down the hallway. Harry stretches out his arm, but a breeze seems to draw him away as the window slams shut. Back on Harry's table, the journal opens and glows with light. Harry lands back in his chair in the school garden where they look at each other guiltily. As Hagrid walks towards the library, a student rushes out past him, and they all run to the boys' lounge, stopping in the doorway. The ground is covered with scattered sweaters and notebooks, broken trophies, and leaves. The blanket and cushions of Harry's four-poster couch have been slashed, and shelves have been emptied out. Hedwig the Snowy Owl sits on the dresser as Harry searches through a pile of journals on the ground. The Gryffindor team heads for the court, and in the infirmary, Madam Pomfrey is standing next to a cradle where a petrified girl is lying. Harry and Ron stare with horror at the stiff figure and a pocket watch. Hermione's eyes are wide open and staring as Harry gently strokes her outstretched arm in the Gryffindor common room. She sweeps out, and concerned, the students look at each other as Harry turns to Ron. In Hagrid's hut at the edge of the misty meadow, his dog Fang raises his head, and Hagrid picks up his lantern, kicking open the gate. Harry and Ron hide under the invisibility cloak as Lucius Malfoy opens the gate and steps inside, stopping near the boys under the cloak. Fudge goes to take it, but Dumbledore stops him, taking the letter and staring straight at Harry and Ron. Lucius Malfoy looks around suspiciously, crosses to the window, and giving the boys one last look, Dumbledore follows him. Fudge looks confused and stares at the huge cat as they leave, and the boys reappear. Lines of ants are following each other up the railing and out of the door as Harry lifts down a heavy lantern, and the huge hound follows them outside. They look up at the light from the hut window while the ants crawl down the railing and onto the path. Ron watches the ants nervously as they scuttle after each other away into the meadow. Harry starts walking and Ron follows Harry reluctantly, with Fang dropping ahead as they make their way through the dark evening into the foggy meadow. Fang sniffs the path as they are led deeper into the shadowy meadow, terrified of ants. Ron walks on his toes trying not to tread on them, while Harry ignores him and keeps on walking. Harry stops and holds up the lantern, revealing that the ants have led them to the mouth of a large tunnel dug into the gravelly earth under the roots of a bush."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "A spider, bigger than a man's hand, flips out of the box and dances past Harry and off down the corridor. Harry waves his hand, but a breeze seems to sweep him away as the door quietly closes. Back on Harry's desk, the book flips and flickers with light. Harry floats back in his chair in the school courtyard where they glance at each other guiltily. As Hagrid strolls towards the school, a boy saunters out past him, and they all meander to the boys' dormitory, hesitating in the doorway. The floor is littered with strewn books and papers, shattered picture frames, and feathers. The mattress and pillows of Harry's four-poster bed have been splattered, and drawers have been scattered out. Hedwig the Snowy Owl perches on the desk as Harry rummages through a pile of books on the floor. The Gryffindor team saunters toward the pitch, and in the hospital wing, Madam Pomfrey is lounging next to a bed where a petrified girl is resting. Harry and Ron blink with horror at the rigid figure and a hand mirror. Hermione's eyes are wide open and staring as Harry gently pats her outstretched hand in the Gryffindor common room. She glides out, and concerned, the students glance at each other as Harry nods to Ron. In Hagrid's cottage at the edge of the dark forest, his dog Fang lifts his head, and Hagrid grasps his crossbow, nudging open the door. Harry and Ron crouch under the invisibility cloak as Lucius Malfoy swings the door and navigates inside, halting near the boys under the cloak. Fudge reaches to grasp it, but Dumbledore nudges him, retrieving the scroll and gazing directly at Harry and Ron. Lucius Malfoy scrutinizes around suspiciously, marches to the door, and giving the boys one last glance, Dumbledore trails after him. Fudge appears puzzled and gazes at the huge dog as they exit, and the boys materialize. Lines of spiders are trailing each other up the wall and out of the window as Harry lowers a heavy lantern, and the huge hound trots outside with them. They glance up at the glow from the cottage window while the spiders slink down the wall and onto the ground. Ron observes the spiders anxiously as they hustle after each other away into the forest. Harry begins strolling and Ron trails Harry reluctantly, with Fang pacing ahead as they move through the dark night into the murky forest. Fang snuffles the ground as they are guided deeper into the shadowy forest, uneasy of spiders. Ron tiptoes trying not to step on them, while Harry disregards him and keeps on strolling. Harry pauses and raises the lantern, revealing that the spiders have directed them to the entrance of a large tunnel dug into the sandy soil beneath the roots of a tree."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A giraffe, larger than a waffle iron, leaps out of the shoe and scuttles past a mailbox and off down the staircase. The mailbox stretches out its leg, but a gust seems to pull it away as the curtain slams shut. Back on the mailbox's shelf, the notebook opens and glows with electricity. The mailbox lands back in its hammock in the library garden where they glance at each other shamefully. As a penguin waddles towards the library, a fish darts out past it, and they all sprint to the dolphin's aviary, pausing in the entryway. The carpet is covered with scattered teacups and envelopes, shattered mirrors, and ribbons. The sofa and cushions of the mailbox's four-poster couch have been slashed, and cabinets have been emptied out. Polka Dots the Calico Cat sits on the shelf as the mailbox sifts through a heap of teacups on the carpet. The Pebble Snorkeling Squad heads for the rink, and in the greenhouse, Madam Parsley is standing next to a sofa where a frozen dolphin is lying. The mailbox and a clock stare with horror at the rigid figurine and a comb. Tulip's eyes are wide open and staring as the mailbox gently strokes its outstretched foot in the Pebble Snorkeling Clubhouse. It sweeps out, and worried, the otters gaze at each other as the mailbox turns to the clock. In the penguin's bungalow at the edge of the bright meadow, its cat Mittens lifts its paw, and the penguin grabs its net, kicking open the curtain. The mailbox and the clock hide under the invisibility blanket as Jarvis Toadstool opens the curtain and steps inside, pausing near the creatures under the blanket. Clouds go to grab it, but Marigold prevents them, taking the napkin and staring straight at the mailbox and the clock. Jarvis Toadstool glances around suspiciously, crosses to the curtain, and giving the creatures one last glance, Marigold follows him. Clouds look baffled and stare at the giant cat as they leave, and the creatures reappear. Rows of giraffes are trailing each other up the tree and out of the canopy as a mailbox lifts down a bulky lantern, and the enormous kitten follows them outside. They gaze up at the glow from the bungalow canopy while the giraffes scurry down the tree and onto the soil. The clock watches the giraffes anxiously as they skitter after each other away into the meadow. A mailbox starts walking and the clock follows the mailbox reluctantly, with Mittens dropping ahead as they traverse the bright dawn into the vibrant meadow. Mittens sniffs the tree as they are guided deeper into the lively meadow, fearful of giraffes. The clock tiptoes trying not to step on them, while the mailbox ignores it and continues on strolling. The mailbox halts and holds up the lantern, revealing that the giraffes have led them to the entrance of a vast burrow dug into the sandy ground under the roots of a shrub."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "A cat, bigger than a man's head, leaps out of the box and dances past Sally and off down the corridor. Sally extends her arm, but a breeze seems to push her away as the door closes quietly. Back on Sally's desk, the lamp flickers and sparkles with light. Sally settles back in her chair in the school courtyard where they glance at each other nervously. As Neville ambles towards the school, a girl dashes out past him, and they all wander to the girls' dormitory, pausing in the doorway. The floor is strewn with scattered notebooks and papers, broken vases, and feathers. The mattress and pillows of Sally's four-poster bed have been shredded, and drawers have been spilled out. Snowy the Barn Owl perches on the desk as Sally rummages through a pile of notes on the floor. The Ravenclaw team heads for the field, and in the hospital wing, Madam Sprout is sitting next to a bed where a sleeping girl is resting. Sally and Ron glance with dismay at the rigid figure and a compact mirror. Ginny's eyes are wide open and observing as Sally gently pats her outstretched arm in the Ravenclaw common room. She strides out, and concerned, the students glance at each other as Sally turns to Ron. In Neville's cabin at the edge of the sunny meadow, his cat Whiskers raises his tail, and Neville grabs his walking stick, swinging open the door. Sally and Ron crouch under the invisibility cloak as Draco Malfoy pushes the door and steps inside, pausing near the kids under the cloak. McGonagall goes to grasp it, but Snape restrains her, grasping the parchment and gazing straight at Sally and Ron. Draco Malfoy peers around cautiously, strides to the door, and giving the kids one last glance, Snape follows him. McGonagall looks puzzled and peers at the huge cat as they exit, and the kids reappear. Rows of ants are pursuing each other up the wall and out of the window as Sally lowers a heavy torch, and the large cat follows them outside. They gaze up at the glow from the cabin window while the ants scurry down the wall and onto the ground. Ron observes the ants anxiously as they chase after each other away into the meadow. Sally begins strolling and Ron trails Sally hesitantly, with Whiskers bounding ahead as they navigate through the moonlit night into the dim meadow. Whiskers sniffs the ground as they are guided deeper into the shadowy meadow, panicked by ants. Ron tiptoes trying not to step on them, while Sally disregards him and continues strolling. Sally pauses and raises the torch, revealing that the ants have guided them to the mouth of a large tunnel burrowed into the earthy soil under the roots of a bush."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "A butterfly, larger than a cat's ear, flutters out of the crate and glides past Harry and down the hallway. Harry reaches out his arm, but a gust seems to pull him away as the window swings open. Back on Harry's bench, the scroll unfurls and sparkles with flame. Harry floats back onto his bench in the playground where they glance at each other sheepishly. As Hagrid strolls toward the playground, a girl sprints past him, and they all dash to the girls' dormitory, pausing in the archway. The ceiling is strewn with scattered newspapers and cards, shattered glass vases, and twigs. The cushions and blankets of Harry's four-poster sofa have been ripped, and shelves have been overturned. Hedwig the Snowy Owl perches on the table as Harry rummages through a stack of scrolls on the stairs. The Gryffindor team heads for the stadium, and in the medical ward, Madam Pomfrey is standing beside a cot where a frozen boy is lying. Harry and Ron gaze with shock at the rigid form and a pocket watch. Hermione's eyes are widely shut and peering as Harry gently pats her clenched fist in the Gryffindor common room. She sweeps away, and concerned, the students glance at each other as Harry turns to Ron. In Hagrid's cabin at the edge of the misty meadow, his cat Fang perks up his ears, and Hagrid grabs his lantern, smashing open the gate. Harry and Ron crouch under the invisibility cloak as Lucius Malfoy opens the gate and strides inside, pausing beside the boys under the cloak. Fudge reaches to pick it up, but Dumbledore interrupts him, grabbing the parchment and peering directly at Harry and Ron. Lucius Malfoy peers around suspiciously, walks to the gate, and giving the boys one last glance, Dumbledore trails after him. Fudge looks puzzled and glances at the giant cat as they exit, and the boys reappear. Lines of ants are trailing each other up the ceiling and out of the door as Harry reaches down a heavy torch, and the enormous feline follows them outdoors. They gaze up at the flicker from the cabin door while the ants scurry down the ceiling and onto the earth. Ron watches the ants anxiously as they dash after each other away into the meadow. Harry begins ambling and Ron trails Harry hesitantly, with Fang bounding ahead as they make their way through the dim dusk into the shadowy meadow. Fang sniffs the earth as they are pulled deeper into the murky meadow, wary of ants. Ron tiptoes cautiously trying not to step on them, while Harry disregards him and continues ambling. Harry pauses and hoists up the torch, revealing that the ants have guided them to the entrance of a vast burrow carved into the rocky earth beneath the roots of a shrub."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A drone, larger than a cat's paw, *leaps out of the jar* and *swoops past Carlos* and *zooms down the hallway.* Carlos *waves his foot*, but a breeze *appears to push him aside* as the window *closes firmly.* Back on Carlos's table, the scroll *unfolds and shines with sparks.* Carlos *drops back onto his bench* in the garden courtyard where they *glance at each other sheepishly.* As Gregor *marches towards the building,* a girl *sprints out past him*, and they all *dash to the girls' conservatory, pausing at the threshold.* The carpet is *strewn with scattered scrolls and ribbons, shattered glass vases, and leaves.* The blanket and cushions of Carlos’s hammock *have been ripped open*, and cabinets *have been overturned.* Sully the Green Parrot *perches on the table* as Carlos *digs through a heap of scrolls* on the carpet. The Ravenclaw squad *heads for the rink*, and in the infirmary, Nurse Whelan *is standing beside a couch where a frozen boy is lying.* Carlos and Tim *gawk with dread at the rigid form* and a wristwatch. Flora's eyes are wide open and *staring as Carlos gently pats her extended foot* in the Ravenclaw lounge. She *glides out*, and worried, the pupils *glance at each other* as Carlos *turns to Tim.* In Gregor's cabin at the fringe of the misty swamp, his cat Claw *lifts his ear*, and Gregor *grabs his slingshot, kicking wide the window.* Carlos and Tim *crouch under the magic shawl* as Felix Dursley *pushes the window open and steps inside, pausing near the lads under the shawl.* Mayor *moves to grab it*, but Headmaster *halts him, grabbing the parchment and gazing directly at Carlos and Tim.* Felix Dursley *glances around distrustfully, walks to the window*, and *casting the lads a final glance, Headmaster trails him.* Mayor *looks puzzled and gazes at the giant cat* as they *depart*, and the lads *reappear.* Trails of ants *are trailing each other up the column* and out of the skylight as Carlos *pulls down a weighty torch*, and the giant feline *pads behind them outdoors.* They *gaze up at the glow from the cabin skylight* while the ants *creep down the column* and onto the terrain. Tim *observes the ants anxiously* as they *scurry after one another away into the marsh.* Carlos *begins strolling* and Tim *follows Carlos unwillingly*, with Claw *prancing ahead* as they *navigate their route* through the dim dusk into the murky swamp. Claw *sniffs the terrain* as they are *guided deeper into the shadowy marsh, terrified of ants.* Tim *tiptoes trying not to step on them*, while Carlos *pays him no mind and keeps on strolling.* Carlos *pauses and raises the torch*, *revealing that the ants have brought them to the entrance of a vast burrow carved into the gritty earth beneath the roots of a shrub.*"
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A large spider leaps from a box, escaping past Harry. As the door slams, a book illuminates Harry's desk, and he finds himself in a courtyard with friends. They rush to a ransacked boys' dormitory. Hedwig perches while Harry searches for clues. The Gryffindor team heads to the pitch. In the hospital wing, a petrified Hermione lies with a mirror; Harry comforts her. Hagrid, armed with a crossbow, encounters Lucius Malfoy in his cottage. Under an invisibility cloak, Harry and Ron observe Dumbledore confronting Malfoy. Spiders stream out, leading Harry, Ron, and Fang into the dark forest. They are guided to a tunnel beneath a tree, with Ron nervously avoiding the spiders."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Harry stops and holds up the lantern revealing that the spiders have led them to the mouth of a large tunnel dug into the sandy soil under the roots of a tree terrified of spiders Ron walks on his toes trying not to tread on them while Harry ignores him and keeps on walking Fang sniffs the ground as they are led deeper into the shadowy forest Harry starts walking and Ron follows Harry reluctantly with Fang dropping ahead as they make their way through the dark night into the gloomy forest Ron watches the spiders nervously as they scuttle after each other away into the forest They look up at the light from the cottage window while the spiders crawl down the wall and on to the ground Lines of spiders are following each other up the wall and out of the window as Harry lifts down a heavy lantern and the huge hound follows them outside Fudge looks confused and stares at the huge dog as they leave and the boys reappear Dumbledore follows him Lucius Malfoy looks around suspiciously crosses to the door and giving the boys one last look Fudge goes to take it but Dumbledore stops him taking the scroll and staring straight at Harry and Ron Harry and Ron hide under the invisibility cloak as Lucius Malfoy opens the door and steps inside stopping near the boys under the cloak In Hagrid's cottage at the edge of the dark forest his dog Fang raises his head and Hagrid picks up his crossbow kicking open the door the students look at each other as Harry turns to Ron She sweeps out and concerned Hermione's eyes are wide open and staring as Harry gently strokes her outstretched hand in the Gryffindor common room Harry and Ron stare with horror at the stiff figure and a hand mirror Madam Pomfrey is standing next to a bed where a petrified girl is lying The Gryffindor team heads for the pitch and in the hospital wing Hedwig the Snowy Owl sits on the desk as Harry searches through a pile of books on the floor The mattress and pillows of Harry's fourposter bed have been slashed and drawers have been emptied out The floor is covered with scattered books and papers broken picture frames and feathers As Hagrid walks towards the school a boy rushes out past him and they all run to the boys' dormitory stopping in the doorway Harry lands back in his chair in the school courtyard where they look at each other guiltily Back on Harry's desk the book opens and glows with light Harry stretches out his hand but a wind seems to draw him away as the door slams shut A spider bigger than a man's hand jumps out of the box and scuttles past Harry and off down the corridor"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Fudge goes to take it but Dumbledore stops him taking the scroll and staring straight at Harry and Ron She sweeps out and concerned Madam Pomfrey is standing next to a bed where a petrified girl is lying Harry stops and holds up the lantern revealing that the spiders have led them to the mouth of a large tunnel dug into the sandy soil under the roots of a tree Fudge looks confused and stares at the huge dog as they leave and the boys reappear The mattress and pillows of Harry's fourposter bed have been slashed and drawers have been emptied out The floor is covered with scattered books and papers broken picture frames and feathers Harry and Ron stare with horror at the stiff figure and a hand mirror Harry and Ron hide under the invisibility cloak as Lucius Malfoy opens the door and steps inside stopping near the boys under the cloak Ron watches the spiders nervously as they scuttle after each other away into the forest Hermione's eyes are wide open and staring as Harry gently strokes her outstretched hand in the Gryffindor common room Dumbledore follows him Harry stretches out his hand but a wind seems to draw him away as the door slams shut In Hagrid's cottage at the edge of the dark forest his dog Fang raises his head and Hagrid picks up his crossbow kicking open the door Fang sniffs the ground as they are led deeper into the shadowy forest the students look at each other as Harry turns to Ron Back on Harry's desk the book opens and glows with light Lucius Malfoy looks around suspiciously crosses to the door and giving the boys one last look terrified of spiders Ron walks on his toes trying not to tread on them while Harry ignores him and keeps on walking As Hagrid walks towards the school a boy rushes out past him and they all run to the boys' dormitory stopping in the doorway They look up at the light from the cottage window while the spiders crawl down the wall and on to the ground Hedwig the Snowy Owl sits on the desk as Harry searches through a pile of books on the floor The Gryffindor team heads for the pitch and in the hospital wing Harry starts walking and Ron follows Harry reluctantly with Fang dropping ahead as they make their way through the dark night into the gloomy forest A spider bigger than a man's hand jumps out of the box and scuttles past Harry and off down the corridor Harry lands back in his chair in the school courtyard where they look at each other guiltily Lines of spiders are following each other up the wall and out of the window as Harry lifts down a heavy lantern and the huge hound follows them outside"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "In Hagrid's cottage at the edge of the dark forest his dog Fang raises his head and Hagrid picks up his crossbow kicking open the door Harry and Ron hide under the invisibility cloak as Lucius Malfoy opens the door and steps inside stopping near the boys under the cloak Fudge goes to take it but Dumbledore stops him taking the scroll and staring straight at Harry and Ron Lucius Malfoy looks around suspiciously crosses to the door and giving the boys one last look Dumbledore follows him Fudge looks confused and stares at the huge dog as they leave and the boys reappear Lines of spiders are following each other up the wall and out of the window as Harry lifts down a heavy lantern and the huge hound follows them outside They look up at the light from the cottage window while the spiders crawl down the wall and on to the ground Ron watches the spiders nervously as they scuttle after each other away into the forest Harry starts walking and Ron follows Harry reluctantly with Fang dropping ahead as they make their way through the dark night into the gloomy forest Fang sniffs the ground as they are led deeper into the shadowy forest terrified of spiders Ron walks on his toes trying not to tread on them while Harry ignores him and keeps on walking Harry stops and holds up the lantern revealing that the spiders have led them to the mouth of a large tunnel dug into the sandy soil under the roots of a tree A spider bigger than a man's hand jumps out of the box and scuttles past Harry and off down the corridor Harry stretches out his hand but a wind seems to draw him away as the door slams shut Back on Harry's desk the book opens and glows with light Harry lands back in his chair in the school courtyard where they look at each other guiltily As Hagrid walks towards the school a boy rushes out past him and they all run to the boys' dormitory stopping in the doorway The floor is covered with scattered books and papers broken picture frames and feathers The mattress and pillows of Harry's fourposter bed have been slashed and drawers have been emptied out Hedwig the Snowy Owl sits on the desk as Harry searches through a pile of books on the floor The Gryffindor team heads for the pitch and in the hospital wing Madam Pomfrey is standing next to a bed where a petrified girl is lying Harry and Ron stare with horror at the stiff figure and a hand mirror Hermione's eyes are wide open and staring as Harry gently strokes her outstretched hand in the Gryffindor common room She sweeps out and concerned the students look at each other as Harry turns to Ron"
        }
      ]
    }
  ]
}