{
  "ground_truth": "The car flies high over the tops of the tall trees, zooms over the forest, and lands heavily on the grass beside Hagrid's cottage. They stagger out as the battered car starts itself, reverses, changes direction, and drives away past Hagrid's cottage, disappearing into the trees at the edge of the dark forest. The sun rises behind the towers and turrets of Hogwarts School. In the hospital wing, Harry puts some fresh flowers on the table by Hermione's bed, and he and Ron sit sadly beside their petrified friend. Harry gently strokes her hand and notices something clutched in her clenched fingers—a crumpled piece of paper, a page from a book. Harry looks puzzled for a moment, then spots his reflection in the window and reads from the page again. Harry and Ron hide in the second-floor corridor where the teachers are gathering. Lockhart swaggers up, swallows nervously, and hurries away. Harry and Ron look horrified as the worried teachers leave and Ron reads out the message written in blood on the wall. They run to Lockhart's room, where Lockhart is packing, grabbing his wand. The boys point their wands at him, and he drops his. In the girls' lavatory, Myrtle spots the three of them coming in, points across the room, and floats away. Harry crosses to the ring of sinks set around the base of an ornate marble structure, looks up, runs his hand along the ledge above, twists the tap, and notices a raised decoration on the side of it—a copper snake. Running his finger over it, Lockhart looks aghast. Staring at the tiny snake, Harry concentrates hard, opens his mouth, and speaks. They all step back as the heavy top of the structure rises into the air, the sinks around the base divide and move away from each other, and the sink decorated with the snake slowly disappears downwards. As it reaches the ground, a heavy metal grill slides over it, uncovering a deep shaft. Lockhart looks down into it, then backs away, but they grab him, and he almost falls down the shaft. He stares down it as Ron gives him a push and Lockhart disappears. They stare down after him as Harry jumps, quickly followed by Ron. The shaft becomes a smooth pipe, and they slide down it and fall onto a floor covered with animal bones. They point their wands at Lockhart, who is covered in dirt. Ron notices the bones on the ground and makes Lockhart follow Harry through a huge pipe. The pipe leads to a low cave where something scaly is lying on the ground, and Lockhart faints. Leaping up, Lockhart grabs Ron's wand.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The automobile soars lofty above the crests of the tall woods, speeds over the woodland, and arrives heavily on the turf beside Hagrid's cabin. They stumble out as the battered automobile starts itself, retreats, shifts direction, and drives away past Hagrid's cabin, vanishing into the woods at the margin of the dim forest. The sun ascends behind the spires and turrets of Hogwarts School. In the infirmary wing, Harry places some fresh blossoms on the table by Hermione's bed, and he and Ron sit sorrowfully beside their petrified companion. Harry gently caresses her hand and notices something grasped in her clenched fingers—a crumpled piece of parchment, a page from a tome. Harry appears perplexed for a moment, then spots his reflection in the glass and reads from the page again. Harry and Ron conceal themselves in the second-floor corridor where the educators are assembling. Lockhart struts up, swallows anxiously, and rushes away. Harry and Ron appear horrified as the concerned educators depart and Ron reads aloud the message inscribed in blood on the wall. They sprint to Lockhart's chamber, where Lockhart is packing, seizing his wand. The boys aim their wands at him, and he drops his. In the girls' restroom, Myrtle notices the three of them entering, points across the room, and floats away. Harry crosses to the ring of basins set around the base of an ornate marble structure, gazes up, runs his hand along the ledge above, twists the faucet, and notices a raised embellishment on the side of it—a copper serpent. Running his finger over it, Lockhart looks appalled. Staring at the tiny serpent, Harry concentrates hard, opens his mouth, and speaks. They all step back as the heavy top of the structure ascends into the air, the basins around the base part and move away from each other, and the basin adorned with the serpent slowly vanishes downwards. As it reaches the ground, a heavy metal grate slides over it, uncovering a deep shaft. Lockhart looks down into it, then retreats, but they seize him, and he almost tumbles down the shaft. He gazes down it as Ron gives him a shove and Lockhart vanishes. They gaze down after him as Harry leaps, swiftly followed by Ron. The shaft becomes a sleek conduit, and they slide down it and fall onto a floor covered with creature bones. They aim their wands at Lockhart, who is covered in soil. Ron notices the bones on the ground and makes Lockhart follow Harry through a massive conduit. The conduit leads to a low cavern where something scaly is lying on the ground, and Lockhart swoons. Springing up, Lockhart seizes Ron's wand."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The tops of the tall trees are flown high over by the car, the forest is zoomed over, and a heavy landing is made by it on the grass beside Hagrid's cottage. As the battered car starts itself, reverses, changes direction, and drives away past Hagrid's cottage, disappearing into the trees at the edge of the dark forest, they stagger out. Behind the towers and turrets of Hogwarts School, the sun is risen. In the hospital wing, some fresh flowers are put on the table by Hermione's bed by Harry, and beside their petrified friend, he and Ron sit sadly. Hermione's hand is gently stroked by Harry, and something clutched in her clenched fingers is noticed by him—a crumpled piece of paper, a page from a book. Puzzled for a moment, Harry looks, then his reflection is spotted in the window by him and reads from the page again. In the second-floor corridor, Harry and Ron hide where the teachers are gathering. Lockhart swaggers up, swallows nervously, and hurries away. Horrified looks are exchanged by Harry and Ron as the worried teachers leave, and Ron reads the message written in blood on the wall. To Lockhart's room, they run, where packing is done by Lockhart, and his wand is grabbed. At him, the boys point their wands, and it is dropped by him. The three of them are spotted coming in by Myrtle in the girls' lavatory, across the room she points, and away she floats. To the ring of sinks set around the base of an ornate marble structure, Harry crosses, up he looks, his hand is run along the ledge above, the tap is twisted by him, and a raised decoration on the side of it is noticed—a copper snake. Over it, his finger is run, and Lockhart looks aghast. At the tiny snake, Harry stares, hard he concentrates, his mouth is opened, and speaking is done by him. As the heavy top of the structure is risen into the air, back they all step, the sinks around the base are divided and moved away from each other, and the sink decorated with the snake is slowly made to disappear downwards. As the ground is reached by it, a heavy metal grill slides over it, uncovering is done to a deep shaft. Lockhart looks down into it, backs away, but he is grabbed by them, and almost falling down the shaft happens to him. Down it, Ron gives him a push as he stares, and Lockhart disappears. After him, they stare down as Harry jumps, quickly by Ron followed. A smooth pipe is become by the shaft, and down it, they slide and fall onto a floor covered with animal bones. At Lockhart, who is covered in dirt, their wands are pointed by them. The bones on the ground are noticed by Ron, and Harry is made to be followed by him through a huge pipe. To a low cave, the pipe leads where something scaly is lying on the ground, and Lockhart faints. Leaping up, Ron's wand is grabbed by Lockhart."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The car soars over the tall trees, zooming above the forest before landing beside Hagrid's cottage. As they stumble out, the battered car reverses, changes direction, and disappears into the forest. The sun rises over Hogwarts. In the hospital wing, Harry places fresh flowers near Hermione's bed, and he and Ron sit by their petrified friend. Harry gently strokes her hand and discovers a crumpled page clutched in her fingers. Puzzled, he catches his reflection, reads the page, and joins Ron in hiding in the corridor where teachers gather. Lockhart nervously approaches, then hurries away. Horrified by the message in blood, Harry and Ron rush to Lockhart's room as he packs. The boys point wands at him, causing him to drop his. In the girls' lavatory, Myrtle spots them, points, and floats away. Harry examines the sinks around a marble structure, noticing a raised copper snake. He speaks to it, and the structure rises, revealing a deep shaft. Lockhart peers down but is pushed by Ron. Harry and Ron jump after him. Sliding down a smooth pipe, they land on a bone-covered floor and make Lockhart follow them through a large pipe to a cave, where he faints after spotting something scaly. Jumping up, Lockhart grabs Ron's wand."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The car soars over tall trees, lands by Hagrid's cottage, and drives away into the forest. The sun rises over Hogwarts. In the hospital wing, Harry places flowers by Hermione's bed and finds a crumpled book page in her hand. Puzzled, he reads it. Harry and Ron hide as teachers gather and scatter; a nervous Lockhart hurries away. They read a blood-written message and rush to Lockhart's room, catching him packing. He drops his wand. In the girls' lavatory, Myrtle points them to sinks; Harry finds a copper snake decoration, speaks, and the structure opens to reveal a shaft. They push Lockhart down it and follow, sliding to a bone-covered floor. With wands on Lockhart, they push him to follow Harry through a pipe leading to a cave, where he faints upon seeing a scaly form. Lockhart jumps up and grabs Ron's wand."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The car, as if defying gravity, soars magnificently high above the tops of the towering trees, zooming rapidly over the expansive forest below. With a thud, it lands heavily on the grass next to Hagrid's rustic cottage. The occupants stagger out as the battered car, as if possessed with a mind of its own, starts itself, reverses, shifts direction, and drives away past Hagrid's humble abode, eventually vanishing into the dense trees at the edge of the mysterious, dark forest. The sun begins to rise, casting a warm glow behind the majestic towers and intricate turrets of the renowned Hogwarts School. Within the quiet confines of the hospital wing, Harry gently places a bouquet of fresh flowers on the table beside Hermione's bed, and he and Ron sit dejectedly next to their petrified friend. With tenderness, Harry gently strokes her hand and suddenly notices something clasped tightly in her clenched fingers—a crumpled piece of paper, seemingly torn from a book. Harry's face reflects puzzlement for a moment, but then he catches his reflection in the nearby window and reads from the page once more. Harry and Ron find themselves hiding in the second-floor corridor where the professors are gathering. Lockhart, with an exaggerated swagger, makes his entrance, nervously swallowing before hurriedly making his exit. Harry and Ron look on in horror as the anxious teachers disperse, and Ron reads aloud the ominous message written in blood on the wall. They hurry to Lockhart's quarters, where they find him packing hastily, reaching for his wand. The boys quickly point their wands at him, prompting him to drop his. In the girls' lavatory, Myrtle observes the trio entering, gestures across the room, and floats away languidly. Harry crosses over to the ring of sinks, which are set around the base of a grand, ornate marble structure, and looks upward. He runs his hand along the ledge above, twists the tap, and notices a raised design on its side—a copper snake. As he runs his finger over it, Lockhart looks utterly aghast. Fixated on the tiny snake, Harry concentrates intensely, opens his mouth, and speaks. They all take a step back as the heavy top of the structure begins to rise into the air, and the sinks arrayed around its base divide and move apart from each other, while the sink adorned with the snake slowly descends. When it reaches the ground level, a heavy metal grill slides over it, revealing a deep shaft. Lockhart peers down into it, then retreats, but they seize him, causing him to nearly tumble down the shaft. He gazes down into it as Ron gives him a push, and Lockhart vanishes. They peer down after him as Harry courageously leaps, followed swiftly by Ron. The shaft transforms into a smooth pipe, and they slide down it, landing on a floor strewn with animal bones. They point their wands at Lockhart, now covered in grime and dirt. Ron notices the scattered bones on the ground and instructs Lockhart to follow Harry through a massive pipe. The pipe takes them to a low-ceilinged cave where something scaly rests on the ground, and Lockhart faints. In a sudden movement, Lockhart leaps up and grabs Ron's wand."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The car, as if defying the laws of gravity, soars magnificently and astonishingly high above the tops of the towering trees, zooming rapidly and effortlessly across the expansive forest stretched out below. With a thud that echoes in the silence, it lands heavily on the soft grass next to Hagrid's rustic cottage. The occupants stagger out in disarray as the battered car, acting as if possessed with a mind of its own, mysteriously starts itself, reverses, shifts direction, and drives away past Hagrid's humble and quaint abode. Eventually, it vanishes into the dense, looming trees at the edge of the mysterious and dark forest. As the dawn breaks, the sun begins to rise, casting a warm glow that illuminates the majestic towers and intricate turrets of the renowned Hogwarts School of Witchcraft and Wizardry. Within the quiet confines of the hospital wing, Harry gently places a bouquet of fresh, vibrant flowers on the table beside Hermione's bed, and he and Ron sit dejectedly next to their petrified friend. With tenderness, Harry gently strokes her hand and suddenly notices something clasped tightly in her clenched fingers—a crumpled piece of paper, seemingly torn from an old book. Harry's face reflects puzzlement for a moment, but then he catches his reflection in the nearby window and reads from the page once more. Harry and Ron find themselves hiding in the second-floor corridor where the professors are gathering. Lockhart, with an exaggerated swagger, makes his entrance, nervously swallowing before hurriedly making his exit. Harry and Ron look on in horror as the anxious teachers disperse, and Ron reads aloud the ominous message written in blood on the wall. They hurry to Lockhart's quarters, where they find him packing hastily, reaching for his wand. The boys quickly point their wands at him, prompting him to drop his. In the girls' lavatory, Myrtle observes the trio entering, gestures across the room, and floats away languidly. Harry crosses over to the ring of sinks, which are set around the base of a grand, ornate marble structure, and looks upward. He runs his hand along the ledge above, twists the tap, and notices a raised design on its side—a copper snake. As he runs his finger over it, Lockhart looks utterly aghast. Fixated on the tiny snake, Harry concentrates intensely, opens his mouth, and speaks. They all take a cautious step back as the heavy top of the structure begins to rise into the air, and the sinks arrayed around its base divide and move apart from each other, while the sink adorned with the snake slowly descends. When it reaches the ground level, a heavy metal grill slides over it, revealing a deep and dark shaft. Lockhart peers down into it, then retreats hastily, but they seize him, causing him to nearly tumble down the seemingly endless shaft. He gazes down into it as Ron gives him a push, and Lockhart vanishes into the abyss. They peer down after him as Harry courageously leaps, followed swiftly by Ron. The shaft transforms into a smooth and slippery pipe, and they slide down it, landing on a floor strewn with animal bones. They point their wands at Lockhart, now covered in grime and dirt. Ron notices the scattered bones lying on the ground and instructs Lockhart to follow Harry through a massive, gaping pipe. The pipe takes them to a low-ceilinged cave where something scaly rests ominously on the ground, and Lockhart faints from the shock. In a sudden movement, Lockhart leaps up and grabs Ron's wand."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The car, appearing almost weightless, soars high into the air, effortlessly clearing the tops of the tall trees below, then swiftly zooms over the dense forest canopy before descending with a heavy thud onto the soft grass beside the familiar structure of Hagrid's rustic cottage. As the dust settles, they clumsily stagger out of the vehicle, their balance momentarily thrown off by the abrupt landing. Meanwhile, the battered car, seemingly with a will of its own, sputters to life once more, engaging in a reverse maneuver to change its direction, then it drives away, past the weathered facade of Hagrid's cottage, progressing towards the dim edge of the dark forest until it vanishes into the thick cluster of trees. As this unfolds, the first light of dawn begins to illuminate the landscape, casting a golden glow behind the majestic towers and turrets of Hogwarts School. Inside the hushed tranquility of the hospital wing, Harry tenderly places a bouquet of fresh flowers on the table beside Hermione's bed, while he and Ron settle into the seats adjacent to their petrified friend, their expressions marked by sadness. Harry gently strokes her hand, his fingers brushing against her skin, and he notices something firmly clutched in her clenched fingers—a crumpled piece of paper that reveals itself to be a page torn from a book. A puzzled look crosses Harry's face momentarily until he catches sight of his reflection in the window and reads the text from the page once more. Later, Harry and Ron discreetly hide in the second-floor corridor, observing as teachers gather with concern etched on their faces. Lockhart then makes an entrance, swaggering with a forced bravado that quickly dissolves into nervous swallowing before he hurries away from the gathering. With the worried teachers now departing, Harry and Ron, horror-stricken, take in the chilling message inscribed in blood on the wall as Ron recites it aloud. Reacting swiftly, they dash to Lockhart's quarters, finding him frantically packing and grabbing his wand. Acting decisively, the boys aim their wands at him, compelling him to drop his own. Inside the dimly lit girls' lavatory, Myrtle's ghostly figure spots the trio entering, gestures across the room, and then floats away into the ether. Harry makes his way to the center of the room, where a ring of sinks encircles the base of an elaborate marble structure, his gaze traveling upward as he runs his hand along the ledge above. With a precise twist, he manipulates the tap and notices the raised decoration on its side—an intricately crafted copper snake. As Lockhart looks on in disbelief, Harry, focusing intently on the tiny snake, opens his mouth and speaks, channeling his energy into the words. The group collectively steps back as the weighty top of the structure begins to ascend into the air, the sinks surrounding the base splitting apart and moving away from one another, while the sink adorned with the snake descends slowly downward. As it reaches the floor, a heavy metal grill slides away to reveal a deep, shadowy shaft. Lockhart peers into the depths below, then hesitantly backs away, but Harry and Ron quickly grab him, causing him to teeter dangerously near the edge before he stares into the abyss once more. In a swift motion, Ron gives him a push, and Lockhart vanishes down into the darkness. Harry and Ron exchange a glance before they, too, leap into the shaft, with Ron closely following Harry's lead. The shaft transforms into a smooth pipe, allowing them to slide rapidly downward until they land on a floor littered with ancient animal bones. With their wands pointed at Lockhart, who is now smeared with dirt from the fall, Ron notices the bones scattered across the ground and directs Lockhart to follow Harry through an enormous, echoing pipe. This passageway leads them into a low, dimly lit cave where the outline of something scaly lies ominously on the ground, causing Lockhart to faint from shock. In a swift recovery, Lockhart leaps up, seizes Ron's wand, and the scene crescendos with tension."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The car flies high over the treetops, zooming across the forest before landing heavily on the grass next to Hagrid's cottage. As they stagger out, the battered car autonomously drives away into the forest. At sunrise, Harry leaves fresh flowers by Hermione's bed in the hospital wing, and he and Ron sit by their petrified friend. Harry gently strokes Hermione's hand, discovering a crumpled page clutched in her fingers. Puzzled, he reads the page again, while spotting his reflection in the window. Meanwhile, Harry and Ron hide in the second-floor corridor, observing the teachers gather. Lockhart nervously arrives and departs quickly, leaving Harry and Ron horrified by the blood-written message on the wall. They rush to Lockhart's room, catching him mid-escape and disarming him. In the girls' lavatory, Myrtle points them to a spot before floating away. Harry approaches the ring of sinks, discovering a copper snake decoration on a tap. Concentrating hard, he speaks to it, causing the structure to rise and the sinks to move aside, revealing a deep shaft. Lockhart attempts to flee, but they pull him back, and Ron pushes him down the shaft. Harry swiftly follows, with Ron behind him, sliding down a pipe and landing among animal bones. They confront a dirt-covered Lockhart, who reluctantly follows Harry into a cave where something scaly lies, causing Lockhart to faint. He suddenly leaps up, seizing Ron's wand."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The enchanted car, which was bewitched by Arthur Weasley to fly, flies high over the tops of the tall trees, zooms over the Forbidden Forest—an ancient and mysterious woodland filled with magical creatures—and lands heavily on the grass beside Hagrid's cottage. Hagrid, the Keeper of Keys and Grounds at Hogwarts, is known for his love of magical creatures. They stagger out as the battered car starts itself, reverses, changes direction, and drives away past Hagrid's cottage, disappearing into the trees at the edge of the dark forest known for its dense canopy that blocks out most sunlight. The sun rises behind the towers and turrets of Hogwarts School, a renowned institution for witchcraft and wizardry founded over a thousand years ago by four powerful wizards. In the hospital wing, Harry puts some fresh flowers on the table by Hermione's bed, and he and Ron sit sadly beside their petrified friend. The petrification is a result of contact with a Basilisk, a legendary serpent known for its deadly gaze. Harry gently strokes her hand and notices something clutched in her clenched fingers—a crumpled piece of paper, a page from a book from the Hogwarts library. Harry looks puzzled for a moment, then spots his reflection in the window and reads from the page again. Harry and Ron hide in the second-floor corridor where the teachers, concerned about the recent attacks, are gathering. Lockhart, a celebrity Defense Against the Dark Arts teacher known more for his self-promotion than his abilities, swaggers up, swallows nervously, and hurries away. Harry and Ron look horrified as the worried teachers leave, and Ron reads out the message written in blood on the wall, signaling another attack. They run to Lockhart's room, where Lockhart is packing, grabbing his wand. The boys point their wands at him, and he drops his. In the girls' lavatory, Myrtle, a ghost who haunts the bathroom due to her tragic death many years ago, spots the three of them coming in, points across the room, and floats away. Harry crosses to the ring of sinks set around the base of an ornate marble structure, a focal point rumored to be a hidden entrance, looks up, runs his hand along the ledge above, twists the tap, and notices a raised decoration on the side of it—a copper snake, a symbol of Salazar Slytherin, one of the Hogwarts founders. Running his finger over it, Lockhart looks aghast. Staring at the tiny snake, Harry concentrates hard, opens his mouth, and speaks in Parseltongue, the language of snakes. They all step back as the heavy top of the structure rises into the air, the sinks around the base divide and move away from each other, and the sink decorated with the snake slowly disappears downwards, revealing the entrance to the Chamber of Secrets. As it reaches the ground, a heavy metal grill slides over it, uncovering a deep shaft leading into darkness. Lockhart looks down into it, then backs away, but they grab him, and he almost falls down the shaft. He stares down it as Ron gives him a push, and Lockhart disappears. They stare down after him as Harry jumps, quickly followed by Ron. The shaft becomes a smooth pipe, and they slide down it and fall onto a floor covered with animal bones, remnants of the basilisk's meals. They point their wands at Lockhart, who is covered in dirt and confusion. Ron notices the bones on the ground and makes Lockhart follow Harry through a huge pipe. The pipe leads to a low cave where something scaly, the shed skin of the Basilisk, is lying on the ground, and Lockhart faints. Leaping up, Lockhart grabs Ron's wand, intending to perform a memory charm."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The car flies high over the tops of the tall trees zooms over the forest and lands heavily on the grass beside Hagrid's cottage. They stagger out as the battered car starts itself reverses changes direction and drives away past Hagrid's cottage disappearing into the trees at the edge of the dark forest. The sun rises behind the towers and turrets of Hogwarts School. In the hospital wing Harry puts some fresh flowers on the table by Hermione's bed and he and Ron sit sadly beside their petrified friend. Harry gently strokes her hand and notices something clutched in her clenched fingers—a crumpled piece of paper. a page from a book. Harry looks puzzled for a moment then spots his reflection in the window and reads from the page again. Harry and Ron hide in the secondfloor corridor where the teachers are gathering. Lockhart swaggers up swallows nervously and hurries away. Harry and Ron look horrified as the worried teachers leave and Ron reads out the message written in blood on the wall. They run to Lockhart's room where Lockhart is packing grabbing his wand. The boys point their wands at him and he drops his. In the girls' lavatory Myrtle spots the three of them coming in points across the room and floats away. Harry crosses to the ring of sinks set around the base of an ornate marble structure looks up runs his hand along the ledge above twists the tap and notices a raised decoration on the side of it—a copper snake. Running his finger over it. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Lockhart looks aghast. Staring at the tiny snake. Harry concentrates hard opens his mouth and speaks. They all step back as the heavy top of the structure rises into the air. the sinks around the base divide and move away from each other and the sink decorated with the snake slowly disappears downwards. As it reaches the ground a heavy metal grill slides over it uncovering a deep shaft. Lockhart looks down into it then backs away but they grab him and he almost falls down the shaft. He stares down it as Ron gives him a push and Lockhart disappears. They stare down after him as Harry jumps quickly followed by Ron. The shaft becomes a smooth pipe and they slide down it and fall onto a floor covered with animal bones. They point their wands at Lockhart who is covered in dirt. Ron notices the bones on the ground and makes Lockhart follow Harry through a huge pipe. The pipe leads to a low cave where something scaly is lying on the ground and Lockhart faints. Leaping up. Lockhart grabs Ron's wand."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The car flies high over the tops of the tall trees zooms over the forest and lands heavily on the grass beside Hagrid's cottage. They stagger out as the battered car starts itself reverses changes direction and drives away past Hagrid's cottage disappearing into the trees at the edge of the dark forest. The sun rises behind the towers and turrets of Hogwarts School. In the hospital wing Harry puts some fresh flowers on the table by Hermione's bed and he and Ron sit sadly beside their petrified friend. Harry gently strokes her hand and notices something clutched in her clenched fingers—a crumpled piece of paper. a page from a book. Harry looks puzzled for a moment then spots his reflection in the window and reads from the page again. Harry and Ron hide in the secondfloor corridor where the teachers are gathering. Lockhart swaggers up swallows nervously and hurries away. Harry and Ron look horrified as the worried teachers leave and Ron reads out the message written in blood on the wall. They run to Lockhart's room where Lockhart is packing grabbing his wand. The boys point their wands at him and he drops his. In the girls' lavatory Myrtle spots the three of them coming in points across the room and floats away. Harry crosses to the ring of sinks set around the base of an ornate marble structure looks up runs his hand along the ledge above twists the tap and notices a raised decoration on the side of it—a copper snake. Running his finger over it. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Lockhart looks aghast. Staring at the tiny snake. Harry concentrates hard opens his mouth and speaks. They all step back as the heavy top of the structure rises into the air. the sinks around the base divide and move away from each other and the sink decorated with the snake slowly disappears downwards. As it reaches the ground a heavy metal grill slides over it uncovering a deep shaft. Lockhart looks down into it then backs away but they grab him and he almost falls down the shaft. He stares down it as Ron gives him a push and Lockhart disappears. They stare down after him as Harry jumps quickly followed by Ron. The shaft becomes a smooth pipe and they slide down it and fall onto a floor covered with animal bones. They point their wands at Lockhart who is covered in dirt. Ron notices the bones on the ground and makes Lockhart follow Harry through a huge pipe. The pipe leads to a low cave where something scaly is lying on the ground and Lockhart faints. Leaping up. Lockhart grabs Ron's wand."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The car flies high over the tops of the tall trees zooms over the forest and lands heavily on the grass beside Hagrid's cottage. They stagger out as the battered car starts itself reverses changes direction and drives away past Hagrid's cottage disappearing into the trees at the edge of the dark forest. The sun rises behind the towers and turrets of Hogwarts School. In the hospital wing Harry puts some fresh flowers on the table by Hermione's bed and he and Ron sit sadly beside their petrified friend. Harry gently strokes her hand and notices something clutched in her clenched fingers—a crumpled piece of paper. a page from a book. Harry looks puzzled for a moment then spots his reflection in the window and reads from the page again. Harry and Ron hide in the secondfloor corridor where the teachers are gathering. They stare down after him as Harry jumps quickly followed by Ron. The shaft becomes a smooth pipe and they slide down it and fall onto a floor covered with animal bones. They point their wands at Lockhart who is covered in dirt. Ron notices the bones on the ground and makes Lockhart follow Harry through a huge pipe. The pipe leads to a low cave where something scaly is lying on the ground and Lockhart faints. Leaping up. Lockhart grabs Ron's wand."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The car flies high over the tops of the tall trees zooms over the forest and lands heavily on the grass beside Hagrid's cottage. They stagger out as the battered car starts itself reverses changes direction and drives away past Hagrid's cottage disappearing into the trees at the edge of the dark forest. The sun rises behind the towers and turrets of Hogwarts School. The pipe leads to a low cave where something scaly is lying on the ground and Lockhart faints. Leaping up. Lockhart grabs Ron's wand."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The eagle glides low under the surface of the short shrubs, flutters under the desert, and perches lightly on the sand near Merlin's hut. They hop in as the pristine eagle halts itself, accelerates, switches path, and sprints away past Merlin's hut, vanishing into the shrubs at the start of the bright desert. The moon sets in front of the cliffs and canyons of Atlantis Academy. In the infirmary, Sam places some wilted herbs on the chair by Alice's hammock, and he and Tom stand cheerfully beside their sleeping companion. Sam lightly pats her foot and spots something hidden in her open toes—a pristine strip of cloth, a fragment from a scroll. Sam glances intrigued for a second, then catches his silhouette in the mirror and recites from the strip once more. Sam and Tom creep in the fourth-floor hall where the students are dispersing. Dumbledore struts over, gulps confidently, and marches forward. Sam and Tom appear delighted as the anxious students arrive and Tom recites the poem scribbled in paint on the ceiling. They stroll to Dumbledore's office, where Dumbledore is relaxing, holding his staff. The kids wave their staff at him, and he lifts his. In the boys' library, Luna spots the two of them exiting, gestures toward the doorway, and glides closer. Sam walks toward the stack of tables placed around the rim of an unadorned granite column, glances down, slides his foot beneath the groove below, turns the faucet, and detects an indented marking on the bottom of it—a silver dragon. Tracing his toe over it, Dumbledore appears ecstatic. Gazing at the tiny dragon, Sam focuses intently, closes his eyes, and sings. They all leap forward as the light bottom of the column sinks into the ground, the tables around the rim connect and close against one another, and the table adorned with the dragon swiftly appears upwards. As it leaves the ceiling, a light wooden panel covers above it, revealing a shallow cave. Dumbledore peers up over it, then steps forward, but they release him, and he barely climbs above the cave. He glances above it as Tom gives him a tug and Dumbledore appears. They glance above before him as Sam crawls, slowly followed by Tom. The cave becomes a narrow tunnel, and they ascend through it and float onto a ceiling covered with paintbrushes. They wave their staff at Dumbledore, who is covered in flowers. Tom notices the paintbrushes on the ceiling and lets Dumbledore trail Sam over a narrow tunnel. The tunnel leads to a towering chamber where something furry is hanging from the ceiling, and Dumbledore dances. Spinning down, Dumbledore holds Tom's staff."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The car glides over the forest and lands near Hagrid's cottage. After the battered car drives away, Harry places flowers by Hermione's bed in the hospital wing, noticing a crumpled book page in her hand. Harry and Ron hide as teachers discuss a message written in blood. They confront Lockhart, who nervously packs to leave. In the girls’ lavatory, Myrtle points the way, leading Harry to discover a snake decoration on a tap. Speaking to it, a structure rises, revealing a deep shaft. Lockhart panics, and they push him down the shaft. Harry and Ron follow, sliding into a bone-covered floor. Lockhart, covered in dirt, faints upon seeing a scaly object in the cave, and grabs Ron's wand."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Lockhart grabs Ron's wand Leaping up The pipe leads to a low cave where something scaly is lying on the ground and Lockhart faints Ron notices the bones on the ground and makes Lockhart follow Harry through a huge pipe They point their wands at Lockhart who is covered in dirt The shaft becomes a smooth pipe and they slide down it and fall onto a floor covered with animal bones They stare down after him as Harry jumps quickly followed by Ron He stares down it as Ron gives him a push and Lockhart disappears Lockhart looks down into it then backs away but they grab him and he almost falls down the shaft As it reaches the ground a heavy metal grill slides over it uncovering a deep shaft the sinks around the base divide and move away from each other and the sink decorated with the snake slowly disappears downwards They all step back as the heavy top of the structure rises into the air Harry concentrates hard opens his mouth and speaks Staring at the tiny snake Lockhart looks aghast Running his finger over it Harry crosses to the ring of sinks set around the base of an ornate marble structure looks up runs his hand along the ledge above twists the tap and notices a raised decoration on the side of it—a copper snake In the girls' lavatory Myrtle spots the three of them coming in points across the room and floats away The boys point their wands at him and he drops his They run to Lockhart's room where Lockhart is packing grabbing his wand Harry and Ron look horrified as the worried teachers leave and Ron reads out the message written in blood on the wall Lockhart swaggers up swallows nervously and hurries away Harry and Ron hide in the secondfloor corridor where the teachers are gathering Harry looks puzzled for a moment then spots his reflection in the window and reads from the page again a page from a book Harry gently strokes her hand and notices something clutched in her clenched fingers—a crumpled piece of paper In the hospital wing Harry puts some fresh flowers on the table by Hermione's bed and he and Ron sit sadly beside their petrified friend The sun rises behind the towers and turrets of Hogwarts School They stagger out as the battered car starts itself reverses changes direction and drives away past Hagrid's cottage disappearing into the trees at the edge of the dark forest The car flies high over the tops of the tall trees zooms over the forest and lands heavily on the grass beside Hagrid's cottage"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "They stagger out as the battered car starts itself reverses changes direction and drives away past Hagrid's cottage disappearing into the trees at the edge of the dark forest The car flies high over the tops of the tall trees zooms over the forest and lands heavily on the grass beside Hagrid's cottage In the hospital wing Harry puts some fresh flowers on the table by Hermione's bed and he and Ron sit sadly beside their petrified friend The sun rises behind the towers and turrets of Hogwarts School a page from a book Harry gently strokes her hand and notices something clutched in her clenched fingers—a crumpled piece of paper Harry and Ron hide in the secondfloor corridor where the teachers are gathering Harry looks puzzled for a moment then spots his reflection in the window and reads from the page again Harry and Ron look horrified as the worried teachers leave and Ron reads out the message written in blood on the wall Lockhart swaggers up swallows nervously and hurries away The boys point their wands at him and he drops his They run to Lockhart's room where Lockhart is packing grabbing his wand Harry crosses to the ring of sinks set around the base of an ornate marble structure looks up runs his hand along the ledge above twists the tap and notices a raised decoration on the side of it—a copper snake In the girls' lavatory Myrtle spots the three of them coming in points across the room and floats away Lockhart looks aghast Running his finger over it Harry concentrates hard opens his mouth and speaks Staring at the tiny snake the sinks around the base divide and move away from each other and the sink decorated with the snake slowly disappears downwards They all step back as the heavy top of the structure rises into the air Lockhart looks down into it then backs away but they grab him and he almost falls down the shaft As it reaches the ground a heavy metal grill slides over it uncovering a deep shaft They stare down after him as Harry jumps quickly followed by Ron He stares down it as Ron gives him a push and Lockhart disappears They point their wands at Lockhart who is covered in dirt The shaft becomes a smooth pipe and they slide down it and fall onto a floor covered with animal bones The pipe leads to a low cave where something scaly is lying on the ground and Lockhart faints Ron notices the bones on the ground and makes Lockhart follow Harry through a huge pipe Lockhart grabs Ron's wand Leaping up"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Lockhart looks aghast Staring at the tiny snake Harry concentrates hard opens his mouth and speaks They all step back as the heavy top of the structure rises into the air the sinks around the base divide and move away from each other and the sink decorated with the snake slowly disappears downwards As it reaches the ground a heavy metal grill slides over it uncovering a deep shaft Lockhart looks down into it then backs away but they grab him and he almost falls down the shaft He stares down it as Ron gives him a push and Lockhart disappears They stare down after him as Harry jumps quickly followed by Ron The shaft becomes a smooth pipe and they slide down it and fall onto a floor covered with animal bones They point their wands at Lockhart who is covered in dirt Ron notices the bones on the ground and makes Lockhart follow Harry through a huge pipe The pipe leads to a low cave where something scaly is lying on the ground and Lockhart faints Leaping up Lockhart grabs Ron's wand The car flies high over the tops of the tall trees zooms over the forest and lands heavily on the grass beside Hagrid's cottage They stagger out as the battered car starts itself reverses changes direction and drives away past Hagrid's cottage disappearing into the trees at the edge of the dark forest The sun rises behind the towers and turrets of Hogwarts School In the hospital wing Harry puts some fresh flowers on the table by Hermione's bed and he and Ron sit sadly beside their petrified friend Harry gently strokes her hand and notices something clutched in her clenched fingers—a crumpled piece of paper a page from a book Harry looks puzzled for a moment then spots his reflection in the window and reads from the page again Harry and Ron hide in the secondfloor corridor where the teachers are gathering Lockhart swaggers up swallows nervously and hurries away Harry and Ron look horrified as the worried teachers leave and Ron reads out the message written in blood on the wall They run to Lockhart's room where Lockhart is packing grabbing his wand The boys point their wands at him and he drops his In the girls' lavatory Myrtle spots the three of them coming in points across the room and floats away Harry crosses to the ring of sinks set around the base of an ornate marble structure looks up runs his hand along the ledge above twists the tap and notices a raised decoration on the side of it—a copper snake Running his finger over it"
        }
      ]
    }
  ]
}