{
  "ground_truth": "Harry runs down a gloomy brick tunnel, disturbing rats that scuttle from under his feet. Rounding a corner, he finds the tunnel blocked by an iron gate and desperately shakes it, but it is firmly fixed. He turns to see a serpent appearing behind him, blocking the tunnel's tract. Harry backs against the gate as the gigantic mouth of the serpent opens, with dripping poisonous fangs inches from his face. His fingers find a loose piece of stone, and he throws it back along the tunnel. The distracted serpent draws back, withdrawing its head, then glides backwards and makes its way down a different tunnel. Harry follows it cautiously, watching as it slips away and disappears altogether. He breathes a sigh of relief, then quickly runs out of the dank tunnel and back to the main chamber, where he finds Tom Riddle standing next to the unconscious Ginny. Harry kneels beside her, and the serpent rises up behind him. Something glows inside the Sorting Hat—a silver sword. Harry grabs it, waiting as the serpent moves across the stone floor towards him and starts to climb. The serpent uncoils its massive body out of the water, lifting its head towards him. Balancing on an edge, Harry lashes out with the sword, keeping the creature at bay. It smashes its head blindly against the stone carving, and Harry almost loses his grip. As it continues to smash against the stone, chunks of stone fall into the water below, causing Harry to cling with one hand. He regains his footing and climbs higher, standing on the very top of the curved head. Swinging the sword wildly, Harry lands a lucky blow as the serpent aims for the sound of the slashing sword. However, Harry loses balance and drops the sword, making a grab for it as it slips over the curved stone surface. The serpent lunges, and Harry thrusts the sword up towards the loop of its escaping mouth, but a huge poisonous fang breaks off and buries itself in his arm. He quickly pulls it out as the serpent writhes in agony and ultimately crashes lifelessly to the ground. Tom Riddle stares in disbelief at the dead serpent, then looks up and narrows his eyes as Harry staggers towards him, holding the bloody sword in one hand and the poisonous fang in the other. Wincing with pain, Harry clutches the wound on his arm, takes a few steps more, and collapses to the ground after dropping the sword.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Harry sprints down a dismal brick passage, unsettling rodents that scurry from beneath his feet. Turning a bend, he discovers the passage obstructed by a steel gate and frantically rattles it, but it is securely fastened. He pivots to see a snake emerging behind him, obstructing the passage's course. Harry retreats against the gate as the enormous maw of the snake opens, with oozing venomous teeth inches from his face. His fingers locate a loose fragment of rock, and he hurls it back along the passage. The diverted snake retracts, pulling back its head, then slides backward and makes its path down a different passage. Harry trails it warily, watching as it slips away and vanishes entirely. He exhales a breath of relief, then quickly dashes out of the damp passage and back to the main chamber, where he discovers Tom Riddle standing next to the unconscious Ginny. Harry kneels beside her, and the snake rises up behind him. Something shines inside the Sorting Hat—a silver blade. Harry seizes it, waiting as the snake slithers across the rock floor towards him and begins to climb. The snake uncoils its colossal body out of the liquid, lifting its head towards him. Balancing on an edge, Harry strikes out with the blade, keeping the beast at bay. It bashes its head blindly against the rock sculpture, and Harry almost loses his grasp. As it continues to bash against the rock, chunks of rock fall into the liquid below, causing Harry to cling with one hand. He regains his footing and climbs higher, standing on the very top of the arched head. Swinging the blade wildly, Harry lands a fortunate strike as the snake targets the sound of the slashing blade. However, Harry loses equilibrium and drops the blade, making a grab for it as it slips over the arched rock surface. The snake lunges, and Harry thrusts the blade up towards the loop of its escaping maw, but a huge venomous tooth breaks off and embeds itself in his arm. He quickly extracts it as the snake writhes in torment and ultimately crashes lifelessly to the floor. Tom Riddle gazes in disbelief at the deceased snake, then looks up and narrows his eyes as Harry stumbles towards him, holding the bloody blade in one hand and the venomous tooth in the other. Wincing with pain, Harry grips the wound on his arm, takes a few steps further, and collapses to the floor after dropping the blade."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A gloomy brick tunnel is run down by Harry, and rats that are disturbed scuttle from under his feet. Rounding a corner, the tunnel is found to be blocked by an iron gate, and it is desperately shaken by him, but its fix is firm. A serpent is seen appearing behind him, blocking the tunnel's tract. The gate is backed against by Harry as the gigantic mouth of the serpent is opened, with dripping poisonous fangs inches from his face. A loose piece of stone is found by his fingers, and it is thrown back along the tunnel. The serpent, distracted, withdraws its head, glides backward, and makes its way down a different tunnel. It is cautiously followed by Harry, who watches as it slips away and disappears altogether. A sigh of relief is breathed by him, then the dank tunnel is quickly run out of and the main chamber is reached, where Tom Riddle is found standing next to the unconscious Ginny. She is knelt beside by Harry, and the serpent rises up behind him. Inside the Sorting Hat, something glows—a silver sword. It is grabbed by Harry, who waits as the serpent moves across the stone floor towards him and starts to climb. Its massive body is uncoiled out of the water by the serpent, lifting its head towards him. On an edge, balance is maintained by Harry as he lashes out with the sword, keeping the creature at bay. Its head is smashed blindly against the stone carving, and his grip is almost lost by Harry. As the stone is continuously smashed against, chunks of stone fall into the water below, causing him to cling with one hand. His footing is regained, and he climbs higher, standing on the very top of the curved head. The sword is swung wildly by him, landing a lucky blow as the sound of the slashing sword is aimed for by the serpent. However, balance is lost by Harry, and the sword is dropped, a grab made for it as it slips over the curved stone surface. The sword is thrust up by Harry towards the loop of its escaping mouth as the serpent lunges, but a huge poisonous fang breaks off and buries itself in his arm. It is quickly pulled out by him as the serpent writhes in agony and ultimately crashes lifelessly to the ground. The dead serpent is stared at in disbelief by Tom Riddle, then he looks up and narrows his eyes as Harry staggers towards him, holding the bloody sword in one hand and the poisonous fang in the other. The wound on his arm is clutched by Harry, wincing with pain; a few steps are taken more, and the ground is collapsed to after the sword is dropped by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Harry runs through a gloomy brick tunnel, disturbing scuttling rats. Turning a corner, he finds an iron gate blocking the path and shakes it desperately, but it's immovable. A serpent appears behind him, blocking his retreat. Harry backs against the gate as its gigantic mouth, with dripping fangs, inches close. He finds a loose stone and throws it, distracting the serpent, which glides away down another tunnel. Harry follows cautiously until it vanishes. Relieved, he runs back to the main chamber, where Tom Riddle stands by unconscious Ginny. Kneeling beside her, the serpent rises again. A silver sword glows inside the Sorting Hat, and Harry grabs it as the serpent advances. It uncoils from the water, lifting its head towards him. Balancing on an edge, Harry uses the sword to fend it off. The creature smashes blindly against a stone carving, nearly causing Harry to lose his grip. As stone chunks fall into the water, he regains balance, climbing higher and striking the serpent. Losing the sword momentarily, he retrieves it, and as the serpent lunges, Harry thrusts the sword upward. A huge fang breaks off and buries itself in his arm. He removes it quickly as the serpent writhes and crashes lifelessly. Tom Riddle stares at the dead serpent, then focuses on Harry, who staggers forward with the bloody sword and fang. Wincing with pain, Harry clutches his wound, takes a few steps, and collapses after dropping the sword."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Harry runs down a gloomy brick tunnel, disturbing rats. He finds the tunnel blocked by an iron gate and shakes it, but it is firmly fixed. A serpent appears, blocking the way. Harry throws a stone to distract it, and the serpent withdraws, gliding down another tunnel. Harry follows it cautiously and breathes a sigh of relief, then runs back to the main chamber, finding Tom Riddle beside the unconscious Ginny. Kneeling by her, the serpent rises. A silver sword glows inside the Sorting Hat; Harry grabs it as the serpent climbs toward him. Harry lashes out, the serpent smashing into a stone carving, almost causing him to fall. Regaining his footing, Harry lands a blow as the serpent hunts the sword's sound. Losing balance, he drops the sword but thrusts it upward as the serpent lunges, its fang breaking off in his arm. He pulls it out, and the serpent crashes lifelessly. Riddle stares at the dead serpent and narrows his eyes as Harry staggers, holding the bloody sword and the fang. Wincing with pain, Harry clutches his arm wound but collapses after dropping the sword."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Harry dashes headlong down a dim, gloomy brick tunnel, his rapid footsteps disturbing numerous rats that scuttle quickly away from under his feet. As he rounds a sharp corner, his heart sinks when he discovers the tunnel blocked by a sturdy iron gate. Desperately, he shakes the gate with all his strength, but it remains frustratingly fixed in place. Turning around swiftly, he sees with alarm a massive serpent serpentinely appearing behind him, effectively blocking the tunnel's entire tract. Pressing his back firmly against the unyielding gate, Harry watches as the serpent’s gigantic mouth opens menacingly, its dripping poisonous fangs hanging just inches from his face. In a moment of desperation, his fingers manage to find a loose piece of stone, which he throws forcefully back along the tunnel. The serpent, now distracted, withdraws its head and glides backwards before making its way down an alternate tunnel. Harry, filled with cautious curiosity, follows it, watching intently as it slips away into the darkness and ultimately disappears altogether from view. Breathing a deep sigh of relief, he quickly sprints out of the dank, claustrophobic tunnel and returns to the main chamber. There, he finds Tom Riddle standing ominously next to the unconscious Ginny. Kneeling beside her with deep concern, Harry suddenly senses the presence of the serpent rising up menacingly behind him. Inside the Sorting Hat, something begins to glow with an otherworldly light—a magnificent silver sword. Harry seizes it, preparing himself as the serpent slithers across the stone floor towards him and begins its climb. Uncoiling itself from the water, the massive serpent lifts its head ominously towards him. Balancing precariously on an edge, Harry lashes out with the sword, managing to keep the creature temporarily at bay. In its blind fury, the serpent smashes its head against the stone carving, causing Harry to almost lose his grip. As it continues its relentless assault against the stone, chunks of it fall thunderously into the water below, forcing Harry to cling desperately with one hand. With determination, he regains his footing and climbs higher, standing strategically on the very top of the serpent's curved head. Swinging the sword wildly, Harry lands a fortunate blow as the serpent aims for the clanging sound of the slashing weapon. However, Harry struggles to maintain his balance and drops the sword, fumbling to grab it as it precariously slips over the curved stone surface. The serpent lunges in for the attack, and in a swift motion, Harry thrusts the sword up towards the loop of the serpent's escaping mouth. Yet, in the struggle, a huge poisonous fang breaks off and viciously buries itself in his arm. With urgency, he quickly pulls it out as the serpent writhes in inevitable agony, ultimately crashing lifelessly to the ground. Tom Riddle, unable to hide his disbelief, stares at the now-dead serpent, then looks up to face Harry with narrowed eyes. Harry, staggering forward, holds the bloody sword in one hand and the deadly poisonous fang in the other. Wincing severely from the pain, Harry clutches the wound on his arm, takes a few shaky steps more, and collapses to the ground, releasing his grip on the sword."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Harry sprints frantically, headlong down a dimly lit and ominously gloomy brick tunnel, his rapid footsteps echoing loudly and disturbing numerous rats, which scurry away quickly, darting out from under his feet. As he navigates a sharp, sudden corner, his heart sinks in despair when he discovers the passage ahead is blocked by a stout and seemingly impenetrable iron gate. In a desperate bid for escape, he vigorously shakes the gate with all his strength, but it remains stubbornly unyielding, fixed frustratingly in its place. Whirling around swiftly, he sees with growing alarm a massive serpent emerging serpentine-like behind him, effectively blocking the entire length of the tunnel with its menacing presence. With his back pressed firmly against the unyielding gate, Harry watches in horror as the serpent’s enormous mouth opens menacingly, its glistening, dripping fangs hanging just precariously inches from his face. In a moment of sheer desperation, his fingers manage to find a loose piece of stone, which he hurls forcefully back along the tunnel's dark corridor. The serpent, momentarily distracted, retracts its head and slithers backward, choosing to glide away into an alternate path. Harry, filled with cautious curiosity and relief, follows it, his eyes watching intently as it slips away into the enveloping darkness until it ultimately disappears altogether from view. With a deep sigh of relief filling his lungs, he quickly sprints out of the dank, claustrophobic tunnel and makes his way back to the main chamber. There, he is confronted by the ominous sight of Tom Riddle standing next to the unconscious Ginny. Kneeling beside her with deep concern, Harry suddenly senses the serpent's presence rising menacingly behind him. Within the Sorting Hat, something begins to glow with an otherworldly radiance—a magnificent silver sword. Harry seizes it, preparing himself as the serpent glides across the stone floor towards him and begins its ascent. Emerging from the water, the massive serpent raises its head ominously in his direction. Balancing precariously on the edge, Harry lashes out frantically with the sword, managing to keep the creature temporarily at bay. In its blind rage, the serpent bashes its head against the stone carving, causing Harry to nearly lose his grip entirely. As it continues its relentless assault, chunks of stone cascade thunderously into the water below, forcing Harry to cling desperately with one hand. Summoning his determination, he regains his footing and climbs higher, positioning himself strategically atop the very peak of the serpent's curved head. With a wild swing of the sword, he lands a fortunate blow as the serpent lunges towards the clanging sound of the slashing weapon. Yet, Harry struggles to maintain his balance and drops the sword, desperately fumbling to catch it as it perilously slips over the smooth curved stone surface. As the serpent lunges in for the attack, Harry, in a swift motion, thrusts the sword upward into the loop of the serpent's retreating mouth. During the struggle, a massive poisonous fang breaks off, embedding itself viciously in his arm. With urgent haste, he pulls it out as the serpent writhes in inevitable agony, crashing lifelessly to the stone floor. Tom Riddle, unable to conceal his disbelief, stares in shock at the now-defeated serpent, then looks up to confront Harry with narrowed, accusing eyes. Staggering forward, Harry clutches the bloody sword in one hand and the deadly poisonous fang in the other. Wincing severely from the throbbing pain, Harry clutches the wound on his arm, takes several shaky steps forward, and collapses to the ground, his grip on the sword releasing as he succumbs to exhaustion."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Harry dashes through the dimly lit brick tunnel, causing the rats lurking underfoot to scatter frantically in all directions as he races past. As he comes to an abrupt turn in the tunnel, he spots an iron gate that blocks his path. In a frantic attempt to escape, he clasps the cold metal bars with both hands and shakes them vigorously, hoping to find some weakness. However, the gate holds firm, showing no signs of giving way. Feeling trapped, Harry whirls around just in time to see a serpent, its ominous form slithering into view behind him, effectively sealing off his retreat. Instinctively, he backs up against the gate as the serpent advances, its enormous mouth yawning open to reveal fangs glistening with venom, mere inches from his face. In a desperate bid to distract his pursuer, Harry's fingers deftly locate a loose piece of stone on the ground, and he hurls it down the tunnel with all his might. Mesmerized by the unexpected movement, the serpent momentarily withdraws its head, retracting with a serpentine grace as it begins to glide backward, eventually choosing a different path and disappearing from view. Seizing the moment, Harry breathes a deep sigh of relief, then swiftly propels himself out of the damp tunnel, retracing his steps back to the main chamber. Upon arrival, he is confronted with the scene of Tom Riddle standing ominously beside Ginny, who lies unconscious. Driven by urgency, Harry drops to his knees beside her, only to sense the looming presence of the serpent rising again behind him. His attention is drawn to a flicker within the Sorting Hat, revealing a gleaming silver sword. Harry quickly reaches out and grabs hold of the sword, bracing himself as the serpent advances across the stone floor, its massive body undulating as it begins to coil upwards. The creature emerges from the water, rearing its head menacingly towards him. Perched precariously on the ledge, Harry brandishes the sword with swift, determined motions to keep the beast at arm's length. Enraged, the serpent crashes its head forcefully against the stone, causing Harry to nearly lose his grip as his footing becomes unstable. With every fierce collision, chunks of stone are dislodged, plummeting into the water below, forcing Harry to cling desperately with one hand to maintain his balance. Regaining his stance with resolve, he climbs onto the very peak of the curved stone head, wielding the sword with wild swings. In a stroke of fortune, he delivers a critical blow just as the serpent strikes in the direction of the sword's sound. Yet, the precarious position causes Harry to falter, resulting in the sword slipping from his grasp. He lunges to retrieve it as it skids over the stone's curvature. At the height of intensity, the serpent lunges again, and Harry instinctively thrusts the sword upwards towards the descending loop of its mouth. In a simultaneous moment of triumph and agony, a massive poisonous fang snaps off, embedding itself painfully into his arm. Gritting his teeth against the pain, he yanks the fang out swiftly as the serpent writhes in excruciating torment, ultimately crashing to the ground, lifeless. Tom Riddle's expression shifts from smug confidence to shocked disbelief at the sight of the defeated serpent. His gaze shifts back to Harry, who staggers forward with determination, clutching the bloodstained sword in one hand and the venomous fang in the other. Despite the pain searing through his arm where the fang had pierced, Harry presses onward, taking several unsteady steps towards Riddle before the toll of his injuries proves too much. He finally collapses to the ground, relinquishing the sword from his grasp as unconsciousness threatens to overtake him."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Harry races through a gloomy brick tunnel, startling rats as he goes. Approaching an iron gate, he realizes it's blocked and turns to see a serpent closing in behind him. Cornered, he hurls a loose stone to distract the creature, which allows him to cautiously follow it down another tunnel until it vanishes. Relieved, he quickly returns to the main chamber, where he finds Tom Riddle by an unconscious Ginny. Kneeling beside her, Harry notices a silver sword glowing in the Sorting Hat. He grabs the sword just as the serpent emerges and advances. Balancing precariously, Harry wards off the serpent with the sword, though it thrashes violently against the stone, causing debris to fall and Harry to cling desperately. Regaining his stance atop the serpent's head, he swings the sword defensively. When the serpent lunges, Harry strikes, but loses his grip, catching the sword just as a fang embeds in his arm. He pulls it out, and the serpent collapses lifelessly. Tom Riddle, shocked, watches Harry stagger towards him, wielding the bloody sword and fang. Despite wincing in pain from his wound, Harry advances a few steps before collapsing, dropping the sword."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Harry runs down a gloomy brick tunnel, part of a network thought to have been constructed centuries ago beneath the old city, disturbing rats that scuttle from under his feet. Rounding a corner, he finds the tunnel blocked by an iron gate, once a protective measure against intruders in ancient times, and desperately shakes it, but it is firmly fixed. He turns to see a serpent, reminiscent of the mythical basilisk from folklore, appearing behind him, blocking the tunnel's tract. Harry backs against the gate as the gigantic mouth of the serpent, known for its paralyzing gaze in legend, opens with dripping poisonous fangs inches from his face. His fingers find a loose piece of stone, likely dislodged from years of neglect, and he throws it back along the tunnel. The distracted serpent draws back, withdrawing its head, then glides backwards and makes its way down a different tunnel. Harry follows it cautiously, watching as it slips away and disappears altogether into the shadows. He breathes a sigh of relief, then quickly runs out of the dank tunnel and back to the main chamber, a cold expanse echoing with past enchantments, where he finds Tom Riddle standing next to the unconscious Ginny. Harry kneels beside her, and the serpent rises up behind him. Something glows inside the Sorting Hat, an artifact renowned for its role in assessing students at the magical school of Hogwarts—a silver sword. Harry grabs it, waiting as the serpent moves across the stone floor towards him and starts to climb. The serpent uncoils its massive body out of the water, lifting its head towards him. Balancing on an edge, Harry lashes out with the sword, forged centuries ago by goblin craftsmen, keeping the creature at bay. It smashes its head blindly against the stone carving, an ancient relief depicting forgotten magical lore, and Harry almost loses his grip. As it continues to smash against the stone, chunks of stone fall into the water below, causing Harry to cling with one hand. He regains his footing and climbs higher, standing on the very top of the curved head. Swinging the sword wildly, Harry lands a lucky blow as the serpent, known in fables for its deadly precision, aims for the sound of the slashing sword. However, Harry loses balance and drops the sword, making a grab for it as it slips over the curved stone surface. The serpent lunges, and Harry thrusts the sword up towards the loop of its escaping mouth, but a huge poisonous fang, reputed in ancient texts for its lethal venom, breaks off and buries itself in his arm. He quickly pulls it out as the serpent writhes in agony and ultimately crashes lifelessly to the ground. Tom Riddle stares in disbelief at the dead serpent, a symbol of power and terror defeated, then looks up and narrows his eyes as Harry staggers towards him, holding the bloody sword in one hand and the poisonous fang in the other. Wincing with pain, Harry clutches the wound on his arm, takes a few steps more, and collapses to the ground after dropping the sword, exhaustion overtaking him."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Harry kneels beside her and the serpent rises up behind him Harry grabs it waiting as the serpent moves across the stone floor towards him and starts to climb Harry runs down a gloomy brick tunnel disturbing rats that scuttle from under his feet He breathes a sigh of relief then quickly runs out of the dank tunnel and back to the main chamber where he finds Tom Riddle standing next to the unconscious Ginny Harry runs down a gloomy brick tunnel disturbing rats that scuttle from under his feet Rounding a corner he finds the tunnel blocked by an iron gate and desperately shakes it but it is firmly fixed He turns to see a serpent appearing behind him blocking the tunnel's tract However Harry loses balance and drops the sword making a grab for it as it slips over the curved stone surface His fingers find a loose piece of stone and he throws it back along the tunnel Harry backs against the gate as the gigantic mouth of the serpent opens with dripping poisonous fangs inches from his face His fingers find a loose piece of stone and he throws it back along the tunnel The distracted serpent draws back withdrawing its head then glides backwards and makes its way down a different tunnel The serpent uncoils its massive body out of the water lifting its head towards him Harry follows it cautiously watching as it slips away and disappears altogether Rounding a corner he finds the tunnel blocked by an iron gate and desperately shakes it but it is firmly fixed He breathes a sigh of relief then quickly runs out of the dank tunnel and back to the main chamber where he finds Tom Riddle standing next to the unconscious Ginny Harry kneels beside her and the serpent rises up behind him Something glows inside the Sorting Hat—a silver sword Harry grabs it waiting as the serpent moves across the stone floor towards him and starts to climb Tom Riddle stares in disbelief at the dead serpent then looks up and narrows his eyes as Harry staggers towards him holding the bloody sword in one hand and the poisonous fang in the other The serpent uncoils its massive body out of the water lifting its head towards him Balancing on an edge Harry lashes out with the sword keeping the creature at bay Harry backs against the gate as the gigantic mouth of the serpent opens with dripping poisonous fangs inches from his face It smashes its head blindly against the stone carving and Harry almost loses his grip As it continues to smash against the stone chunks of stone fall into the water below causing Harry to cling with one hand He regains his footing and climbs higher standing on the very top of the curved head Swinging the sword wildly The serpent lunges and Harry thrusts the sword up towards the loop of its escaping mouth but a huge poisonous fang breaks off and buries itself in his arm Harry lands a lucky blow as the serpent aims for the sound of the slashing sword He quickly pulls it out as the serpent writhes in agony and ultimately crashes lifelessly to the ground However Harry loses balance and drops the sword making a grab for it as it slips over the curved stone surface The serpent lunges and Harry thrusts the sword up towards the loop of its escaping mouth but a huge poisonous fang breaks off and buries itself in his arm He quickly pulls it out as the serpent writhes in agony and ultimately crashes lifelessly to the ground Tom Riddle stares in disbelief at the dead serpent then looks up and narrows his eyes as Harry staggers towards him holding the bloody sword in one hand and the poisonous fang in the other Wincing with pain Harry clutches the wound on his arm takes a few steps more and collapses to the ground after dropping the sword"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Harry runs down a gloomy brick tunnel disturbing rats that scuttle from under his feet. Rounding a corner he finds the tunnel blocked by an iron gate and desperately shakes it but it is firmly fixed. He turns to see a serpent appearing behind him blocking the tunnel's tract. Harry backs against the gate as the gigantic mouth of the serpent opens with dripping poisonous fangs inches from his face. His fingers find a loose piece of stone and he throws it back along the tunnel. The distracted serpent draws back withdrawing its head then glides backwards and makes its way down a different tunnel. Harry follows it cautiously watching as it slips away and disappears altogether. He breathes a sigh of relief then quickly runs out of the dank tunnel and back to the main chamber where he finds Tom Riddle standing next to the unconscious Ginny. Harry kneels beside her and the serpent rises up behind him. Something glows inside the Sorting Hat—a silver sword. Harry grabs it waiting as the serpent moves across the stone floor towards him and starts to climb. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. The serpent uncoils its massive body out of the water lifting its head towards him. Balancing on an edge Harry lashes out with the sword keeping the creature at bay. It smashes its head blindly against the stone carving and Harry almost loses his grip. As it continues to smash against the stone chunks of stone fall into the water below causing Harry to cling with one hand. He regains his footing and climbs higher standing on the very top of the curved head. Swinging the sword wildly. Harry lands a lucky blow as the serpent aims for the sound of the slashing sword. However Harry loses balance and drops the sword making a grab for it as it slips over the curved stone surface. The serpent lunges and Harry thrusts the sword up towards the loop of its escaping mouth but a huge poisonous fang breaks off and buries itself in his arm. He quickly pulls it out as the serpent writhes in agony and ultimately crashes lifelessly to the ground. Tom Riddle stares in disbelief at the dead serpent then looks up and narrows his eyes as Harry staggers towards him holding the bloody sword in one hand and the poisonous fang in the other. Wincing with pain Harry clutches the wound on his arm takes a few steps more and collapses to the ground after dropping the sword."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Harry runs down a gloomy brick tunnel disturbing rats that scuttle from under his feet. Rounding a corner he finds the tunnel blocked by an iron gate and desperately shakes it but it is firmly fixed. He turns to see a serpent appearing behind him blocking the tunnel's tract. Harry backs against the gate as the gigantic mouth of the serpent opens with dripping poisonous fangs inches from his face. His fingers find a loose piece of stone and he throws it back along the tunnel. The distracted serpent draws back withdrawing its head then glides backwards and makes its way down a different tunnel. Harry follows it cautiously watching as it slips away and disappears altogether. He breathes a sigh of relief then quickly runs out of the dank tunnel and back to the main chamber where he finds Tom Riddle standing next to the unconscious Ginny. Harry kneels beside her and the serpent rises up behind him. Something glows inside the Sorting Hat—a silver sword. Harry grabs it waiting as the serpent moves across the stone floor towards him and starts to climb. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. The serpent uncoils its massive body out of the water lifting its head towards him. Balancing on an edge Harry lashes out with the sword keeping the creature at bay. It smashes its head blindly against the stone carving and Harry almost loses his grip. As it continues to smash against the stone chunks of stone fall into the water below causing Harry to cling with one hand. He regains his footing and climbs higher standing on the very top of the curved head. Swinging the sword wildly. Harry lands a lucky blow as the serpent aims for the sound of the slashing sword. However Harry loses balance and drops the sword making a grab for it as it slips over the curved stone surface. The serpent lunges and Harry thrusts the sword up towards the loop of its escaping mouth but a huge poisonous fang breaks off and buries itself in his arm. He quickly pulls it out as the serpent writhes in agony and ultimately crashes lifelessly to the ground. Tom Riddle stares in disbelief at the dead serpent then looks up and narrows his eyes as Harry staggers towards him holding the bloody sword in one hand and the poisonous fang in the other. Wincing with pain Harry clutches the wound on his arm takes a few steps more and collapses to the ground after dropping the sword."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Harry runs down a gloomy brick tunnel disturbing rats that scuttle from under his feet. Rounding a corner he finds the tunnel blocked by an iron gate and desperately shakes it but it is firmly fixed. He turns to see a serpent appearing behind him blocking the tunnel's tract. Harry backs against the gate as the gigantic mouth of the serpent opens with dripping poisonous fangs inches from his face. His fingers find a loose piece of stone and he throws it back along the tunnel. The distracted serpent draws back withdrawing its head then glides backwards and makes its way down a different tunnel. Harry lands a lucky blow as the serpent aims for the sound of the slashing sword. However Harry loses balance and drops the sword making a grab for it as it slips over the curved stone surface. The serpent lunges and Harry thrusts the sword up towards the loop of its escaping mouth but a huge poisonous fang breaks off and buries itself in his arm. He quickly pulls it out as the serpent writhes in agony and ultimately crashes lifelessly to the ground. Tom Riddle stares in disbelief at the dead serpent then looks up and narrows his eyes as Harry staggers towards him holding the bloody sword in one hand and the poisonous fang in the other. Wincing with pain Harry clutches the wound on his arm takes a few steps more and collapses to the ground after dropping the sword."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Harry runs down a gloomy brick tunnel disturbing rats that scuttle from under his feet. Rounding a corner he finds the tunnel blocked by an iron gate and desperately shakes it but it is firmly fixed. He quickly pulls it out as the serpent writhes in agony and ultimately crashes lifelessly to the ground. Tom Riddle stares in disbelief at the dead serpent then looks up and narrows his eyes as Harry staggers towards him holding the bloody sword in one hand and the poisonous fang in the other. Wincing with pain Harry clutches the wound on his arm takes a few steps more and collapses to the ground after dropping the sword."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A llama runs down a gloomy brick tunnel, disturbing rats that scuttle from under its feet. Rounding a corner, the llama finds the tunnel blocked by an iron gate and desperately shakes it, but it is firmly fixed. The llama turns to see a giraffe appearing behind it, blocking the tunnel's tract. The llama backs against the gate as the gigantic mouth of the giraffe opens, with dripping poisonous fangs inches from its face. Its fingers find a loose piece of stone, and it throws it back along the tunnel. The distracted giraffe draws back, withdrawing its head, then glides backwards and makes its way down a different tunnel. The llama follows it cautiously, watching as it slips away and disappears altogether. The llama breathes a sigh of relief, then quickly runs out of the dank tunnel and back to the main chamber, where it finds an owl standing next to the unconscious Ginny. The llama kneels beside her, and the giraffe rises up behind it. Something glows inside the Sorting Hat—a silver sword. The llama grabs it, waiting as the giraffe moves across the stone floor towards it and starts to climb. The giraffe uncoils its massive body out of the water, lifting its head towards it. Balancing on an edge, the llama lashes out with the sword, keeping the creature at bay. It smashes its head blindly against the stone carving, and the llama almost loses its grip. As it continues to smash against the stone, chunks of stone fall into the water below, causing the llama to cling with one hand. It regains its footing and climbs higher, standing on the very top of the curved head. Swinging the sword wildly, the llama lands a lucky blow as the giraffe aims for the sound of the slashing sword. However, the llama loses balance and drops the sword, making a grab for it as it slips over the curved stone surface. The giraffe lunges, and the llama thrusts the sword up towards the loop of its escaping mouth, but a huge poisonous fang breaks off and buries itself in its arm. The llama quickly pulls it out as the giraffe writhes in agony and ultimately crashes lifelessly to the ground. The owl stares in disbelief at the dead giraffe, then looks up and narrows its eyes as the llama staggers towards it, holding the bloody sword in one hand and the poisonous fang in the other. Wincing with pain, the llama clutches the wound on its arm, takes a few steps more, and collapses to the ground after dropping the sword."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Harry runs down a gloomy bamboo corridor, disturbing crickets that leap from under his feet. Rounding a corner, he finds the tunnel blocked by a wooden fence and desperately shakes it, but it is firmly fixed. He turns to see a crocodile appearing behind him, blocking the corridor's route. Harry backs against the fence as the gigantic mouth of the crocodile opens, with dripping venomous teeth inches from his face. His fingers find a loose piece of clay, and he throws it back along the corridor. The distracted crocodile draws back, withdrawing its head, then glides backwards and makes its way down a different corridor. Harry follows it cautiously, watching as it slips away and disappears altogether. He breathes a sigh of relief, then quickly runs out of the damp corridor and back to the main vault, where he finds Tom Riddle standing next to the unconscious Ginny. Harry kneels beside her, and the crocodile rises up behind him. Something glows inside the Explorer's Hat—a golden axe. Harry grabs it, waiting as the crocodile moves across the marble tiles towards him and starts to ascend. The crocodile uncoils its massive body out of the sand, lifting its head towards him. Balancing on an outcrop, Harry lashes out with the axe, keeping the creature at bay. It smashes its head blindly against the marble sculpture, and Harry almost loses his grip. As it continues to smash against the marble, chunks of marble fall into the sand below, causing Harry to cling with one hand. He regains his footing and climbs higher, standing on the very top of the jagged peak. Swinging the axe wildly, Harry lands a lucky blow as the crocodile aims for the sound of the slashing axe. However, Harry loses balance and drops the axe, making a grab for it as it slips over the jagged marble surface. The crocodile lunges, and Harry thrusts the axe up towards the loop of its retreating mouth, but a huge venomous claw breaks off and buries itself in his arm. He quickly pulls it out as the crocodile writhes in agony and ultimately crashes lifelessly to the ground. Tom Riddle stares in disbelief at the dead crocodile, then looks up and narrows his eyes as Harry staggers towards him, holding the bloody axe in one hand and the venomous claw in the other. Wincing with pain, Harry clutches the wound on his arm, takes a few steps more, and collapses to the ground after dropping the axe."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Harry skips down a gloomy brick tunnel, amusing rats that scuttle from under his feet. Rounding a corner, he discovers the tunnel blocked by an iron gate and gently taps it, but it is firmly fixed. He spins to see a serpent floating behind him, decorating the tunnel's tract. Harry leans against the gate as the gigantic mouth of the serpent yawns, with dripping poisonous fangs inches from his face. His fingers trace a loose piece of stone, and he rolls it back along the tunnel. The intrigued serpent pulls back, tucking its head, then floats backwards and slips its way down a different tunnel. Harry trails it cautiously, observing as it glimmers away and vanishes altogether. He breathes a sigh of relief, then slowly skips out of the dank tunnel and back to the main chamber, where he discovers Tom Riddle lounging next to the unconscious Ginny. Harry squats beside her, and the serpent rises up behind him. Something sparkles inside the Sorting Hat—a silver sword. Harry snatches it, waiting as the serpent swims across the stone floor towards him and starts to swirl. The serpent uncoils its massive body out of the water, lifting its head towards him. Balancing on an edge, Harry waves the sword, keeping the creature at bay. It nudges its head blindly against the stone carving, and Harry almost loses his grip. As it continues to nudge against the stone, pebbles of stone tumble into the water below, causing Harry to cling with one hand. He regains his footing and sidles higher, standing on the very top of the curved head. Waving the sword wildly, Harry lands a lucky blow as the serpent aims for the sound of the fluttering sword. However, Harry loses balance and drops the sword, making a reach for it as it skips over the curved stone surface. The serpent drifts, and Harry jabs the sword up towards the loop of its escaping mouth, but a huge poisonous fang breaks off and settles itself in his arm. He swiftly pushes it out as the serpent writhes in surprise and ultimately collapses lifelessly to the ground. Tom Riddle gapes in disbelief at the dead serpent, then glances up and narrows his eyes as Harry shuffles towards him, holding the bloody sword in one hand and the poisonous fang in the other. Wincing with pain, Harry grips the wound on his arm, takes a few steps more, and stumbles to the ground after dropping the sword."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Mortimer sprints down a dimly lit gravel corridor, disturbing squirrels that scamper out from under his knees. Turning a bend, he finds the corridor blocked by a wooden fence and frantically shakes it, but it is securely attached. He swivels to see a lion appearing behind him, blocking the corridor's passage. Mortimer presses against the fence as the enormous mouth of the lion opens, with dripping venomous claws inches from his forehead. His fingertips find a loose piece of metal, and he flings it back along the corridor. The distracted lion retracts, withdrawing its head, then slides backwards and makes its way down an alternate corridor. Mortimer follows it cautiously, observing as it slips away and vanishes entirely. He exhales a breath of relief, then swiftly dashes out of the murky corridor and back to the main hall, where he finds Alex Turner standing next to the unconscious Lucy. Mortimer crouches beside her, and the lion rises up behind him. Something beams inside the Sorting Box—a golden lance. Mortimer seizes it, waiting as the lion creeps across the wooden floor towards him and starts to ascend. The lion uncoils its massive body out of the puddle, lifting its snout towards him. Balancing on a precipice, Mortimer strikes out with the lance, keeping the animal at bay. It bangs its head blindly against the wooden sculpture, and Mortimer nearly loses his grip. As it continues to bang against the wood, pieces of wood tumble into the puddle below, causing Mortimer to hold on with one hand. He regains his stance and climbs higher, standing on the very peak of the curved snout. Swinging the lance erratically, Mortimer lands a fortunate strike as the lion targets the noise of the slicing lance. However, Mortimer loses balance and drops the lance, making a grab for it as it slips over the curved wooden surface. The lion pounces, and Mortimer thrusts the lance up towards the loop of its vanishing snout, but a massive venomous claw breaks off and embeds itself in his shoulder. He swiftly pulls it out as the lion thrashes in torment and eventually collapses lifelessly to the ground. Alex Turner gazes in amazement at the fallen lion, then looks up and narrows his gaze as Mortimer struggles towards him, clutching the golden lance in one hand and the venomous claw in the other. Grimacing with pain, Mortimer grips the injury on his shoulder, takes a few steps further, and succumbs to the ground after releasing the lance."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Emily ambles down a sunny wooden bridge, shooing butterflies that flutter from near her elbows. Glancing around a clearing, she spots the bridge blocked by a velvet curtain and gently tugs it, but it is securely anchored. She pivots to see a peacock appearing beside her, obstructing the bridge's path. Emily leans against the curtain as the vibrant tail of the peacock fans out, with colorful feathers inches from her hair. Her fingers locate a loose piece of string, and she flicks it across the bridge. The distracted peacock retracts, folding its tail, then sashays sideways and struts down a different bridge. Emily trails it cautiously, observing as it glides away and vanishes entirely. She exhales with relief, then swiftly ambles out of the lush bridge and back to the main garden, where she finds Jake Turner lounging next to the sleepy Lucy. Emily crouches beside her, and the peacock stands up beside her. Something gleams inside a top hat—a golden flute. Emily snatches it, pausing as the peacock twirls across the grassy path towards her and begins to hover. The peacock coils its elegant neck out of the air, raising its head towards her. Balancing on a ledge, Emily swings the flute, keeping the bird at a distance. It taps its beak blindly against the ornate statue, and Emily nearly loses her balance. As it persists in tapping against the statue, bits of marble tumble into the pond below, causing Emily to grip with one hand. She regains her composure and climbs higher, standing on the very tip of the wavy feather. Swinging the flute awkwardly, Emily hits a fortunate note as the peacock aims for the melody of the echoing flute. However, Emily loses stability and drops the flute, reaching for it as it slides over the wavy marble surface. The peacock dives, and Emily thrusts the flute up towards the arc of its retreating tail, but a large vibrant feather snaps off and lodges itself in her shoulder. She swiftly removes it as the peacock flaps in distress and ultimately falls gracefully to the ground. Jake Turner gawks in disbelief at the still peacock, then looks up and squints as Emily stumbles towards him, clutching the golden flute in one hand and the vibrant feather in the other. Grimacing with discomfort, Emily grips the wound on her shoulder, takes a few more steps, and sinks to the ground after setting down the flute."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Harry skips down a dim marble corridor, scattering bees that flutter from under his toes. Turning a bend, he discovers the corridor obstructed by a wooden fence and frantically taps it, but it is securely bolted. He pivots to notice a dragon emerging behind him, obstructing the corridor's passage. Harry leans against the fence as the enormous jaws of the dragon open, with drooling fiery claws inches from his face. His hands locate a loose piece of metal, and he hurls it back along the corridor. The distracted dragon retracts, pulling its head away, then glides forward and makes its way down another corridor. Harry trails it stealthily, watching as it sneaks away and vanishes completely. He exhales a breath of relief, then swiftly skips out of the wet corridor and back to the central room, where he finds Tom Riddle standing beside the unconscious Ginny. Harry crouches beside her, and the dragon rises up behind him. Something glimmers inside the Sorting Hat—a golden shield. Harry seizes it, waiting as the dragon slithers across the marble floor towards him and begins to ascend. The dragon unfurls its gigantic body out of the fog, lifting its eye towards him. Balancing on an edge, Harry lashes out with the shield, keeping the beast at bay. It bashes its eye blindly against the marble sculpture, and Harry nearly loses his balance. As it continues to bash against the marble, fragments of marble tumble into the fog below, causing Harry to cling with one foot. He regains his stance and climbs higher, standing on the very top of the curved eye. Swinging the shield erratically, Harry strikes a fortuitous blow as the dragon aims for the sound of the swinging shield. However, Harry loses balance and drops the shield, reaching for it as it slides over the curved marble surface. The dragon darts, and Harry thrusts the shield up towards the coil of its fleeing eye, but a massive fiery claw breaks off and embeds itself in his leg. He swiftly pulls it out as the dragon writhes in agony and ultimately crashes motionlessly to the floor. Tom Riddle gawks in disbelief at the defeated dragon, then looks up and narrows his eyes as Harry stumbles towards him, holding the bloody shield in one hand and the fiery claw in the other. Grimacing with pain, Harry grasps the wound on his leg, takes a few steps more, and falls to the floor after dropping the shield."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "George strolls up a sunny wooden bridge, startling birds that flutter from beneath his shoes. Skipping a bend, he discovers the bridge blocked by a velvet curtain and gently taps it, but it remains tightly pinned. He swivels to see a lizard materializing beside him, blocking the bridge's route. George rests against the curtain as the enormous beak of the lizard yawns, with oozing sugary teeth inches from his nose. His toes find a loose bit of straw, and he flicks it forward along the bridge. The distracted lizard eases away, retreating its snout, then slides sideways and makes its way up a different bridge. George tags along hesitantly, observing as it sneaks away and vanishes entirely. He exhales a puff of peace, then carefully dances out of the fragrant bridge and back to the main field, where he discovers Lewis Waddle sitting beside the sleeping Penny. George bends beside her, and the lizard rises up next to him. Something glimmers within the Wishing Cap—a golden hammer. George snatches it, pausing as the lizard glides across the wood floor towards him and prepares to ascend. The lizard spirals its tiny body out of the mist, lifting its beak near him. Balancing on a ridge, George flails around with the hammer, warding the being off. It bashes its beak blindly against the wooden sculpture, and George nearly loses his hold. As it keeps bashing against the wood, bits of wood tumble into the mist below, prompting George to cling with one toe. He regains his stance and scrambles higher, standing on the very peak of the pointed beak. Swinging the hammer haphazardly, George lands a fortunate hit as the lizard aims for the noise of the flinging hammer. However, George loses balance and drops the hammer, reaching for it as it skids over the pointed wood surface. The lizard pounces, and George jabs the hammer up towards the loop of its slipping tongue, but a massive sugary tooth breaks off and implants itself in his foot. He quickly tugs it out as the lizard thrashes in distress and eventually collapses lifelessly to the ground. Lewis Waddle gapes in astonishment at the lifeless lizard, then glances up and squints as George totters towards him, holding the sticky hammer in one hand and the sugary tooth in the other. Grimacing with discomfort, George grips the scratch on his foot, takes a few steps more, and crumples to the ground after letting go of the hammer."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Harry races down a dark tunnel, disturbing rats underfoot. He encounters a blocked path but is soon trapped by a serpent behind him. Desperately, Harry distracts the serpent with a thrown stone, allowing him to cautiously pursue and watch it vanish. Relieved, he rushes back to the main chamber and finds Tom Riddle beside the unconscious Ginny. As a serpent rises behind Harry, he discovers a silver sword in the Sorting Hat. He battles the advancing serpent, smashing against stone, nearly losing his grip but landing a lucky hit. However, he loses the sword, and a fang embeds in his arm. Pulling it out, the serpent dies. Riddle is stunned as Harry, wounded, staggers towards him with the sword and fang before collapsing."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Wincing with pain Harry clutches the wound on his arm takes a few steps more and collapses to the ground after dropping the sword Tom Riddle stares in disbelief at the dead serpent then looks up and narrows his eyes as Harry staggers towards him holding the bloody sword in one hand and the poisonous fang in the other He quickly pulls it out as the serpent writhes in agony and ultimately crashes lifelessly to the ground The serpent lunges and Harry thrusts the sword up towards the loop of its escaping mouth but a huge poisonous fang breaks off and buries itself in his arm However Harry loses balance and drops the sword making a grab for it as it slips over the curved stone surface Harry lands a lucky blow as the serpent aims for the sound of the slashing sword Swinging the sword wildly He regains his footing and climbs higher standing on the very top of the curved head As it continues to smash against the stone chunks of stone fall into the water below causing Harry to cling with one hand It smashes its head blindly against the stone carving and Harry almost loses his grip Balancing on an edge Harry lashes out with the sword keeping the creature at bay The serpent uncoils its massive body out of the water lifting its head towards him Harry grabs it waiting as the serpent moves across the stone floor towards him and starts to climb Something glows inside the Sorting Hat—a silver sword Harry kneels beside her and the serpent rises up behind him He breathes a sigh of relief then quickly runs out of the dank tunnel and back to the main chamber where he finds Tom Riddle standing next to the unconscious Ginny Harry follows it cautiously watching as it slips away and disappears altogether The distracted serpent draws back withdrawing its head then glides backwards and makes its way down a different tunnel His fingers find a loose piece of stone and he throws it back along the tunnel Harry backs against the gate as the gigantic mouth of the serpent opens with dripping poisonous fangs inches from his face He turns to see a serpent appearing behind him blocking the tunnel's tract Rounding a corner he finds the tunnel blocked by an iron gate and desperately shakes it but it is firmly fixed Harry runs down a gloomy brick tunnel disturbing rats that scuttle from under his feet"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Swinging the sword wildly He regains his footing and climbs higher standing on the very top of the curved head He turns to see a serpent appearing behind him blocking the tunnel's tract As it continues to smash against the stone chunks of stone fall into the water below causing Harry to cling with one hand The distracted serpent draws back withdrawing its head then glides backwards and makes its way down a different tunnel It smashes its head blindly against the stone carving and Harry almost loses his grip Harry lands a lucky blow as the serpent aims for the sound of the slashing sword Balancing on an edge Harry lashes out with the sword keeping the creature at bay Wincing with pain Harry clutches the wound on his arm takes a few steps more and collapses to the ground after dropping the sword Harry follows it cautiously watching as it slips away and disappears altogether Something glows inside the Sorting Hat—a silver sword Rounding a corner he finds the tunnel blocked by an iron gate and desperately shakes it but it is firmly fixed The serpent lunges and Harry thrusts the sword up towards the loop of its escaping mouth but a huge poisonous fang breaks off and buries itself in his arm The serpent uncoils its massive body out of the water lifting its head towards him Harry grabs it waiting as the serpent moves across the stone floor towards him and starts to climb Tom Riddle stares in disbelief at the dead serpent then looks up and narrows his eyes as Harry staggers towards him holding the bloody sword in one hand and the poisonous fang in the other His fingers find a loose piece of stone and he throws it back along the tunnel However Harry loses balance and drops the sword making a grab for it as it slips over the curved stone surface He breathes a sigh of relief then quickly runs out of the dank tunnel and back to the main chamber where he finds Tom Riddle standing next to the unconscious Ginny Harry kneels beside her and the serpent rises up behind him Harry runs down a gloomy brick tunnel disturbing rats that scuttle from under his feet Harry backs against the gate as the gigantic mouth of the serpent opens with dripping poisonous fangs inches from his face He quickly pulls it out as the serpent writhes in agony and ultimately crashes lifelessly to the ground"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Balancing on an edge Harry lashes out with the sword keeping the creature at bay It smashes its head blindly against the stone carving and Harry almost loses his grip As it continues to smash against the stone chunks of stone fall into the water below causing Harry to cling with one hand He regains his footing and climbs higher standing on the very top of the curved head Swinging the sword wildly Harry lands a lucky blow as the serpent aims for the sound of the slashing sword However Harry loses balance and drops the sword making a grab for it as it slips over the curved stone surface The serpent lunges and Harry thrusts the sword up towards the loop of its escaping mouth but a huge poisonous fang breaks off and buries itself in his arm He quickly pulls it out as the serpent writhes in agony and ultimately crashes lifelessly to the ground Tom Riddle stares in disbelief at the dead serpent then looks up and narrows his eyes as Harry staggers towards him holding the bloody sword in one hand and the poisonous fang in the other Wincing with pain Harry clutches the wound on his arm takes a few steps more and collapses to the ground after dropping the sword Harry runs down a gloomy brick tunnel disturbing rats that scuttle from under his feet Rounding a corner he finds the tunnel blocked by an iron gate and desperately shakes it but it is firmly fixed He turns to see a serpent appearing behind him blocking the tunnel's tract Harry backs against the gate as the gigantic mouth of the serpent opens with dripping poisonous fangs inches from his face His fingers find a loose piece of stone and he throws it back along the tunnel The distracted serpent draws back withdrawing its head then glides backwards and makes its way down a different tunnel Harry follows it cautiously watching as it slips away and disappears altogether He breathes a sigh of relief then quickly runs out of the dank tunnel and back to the main chamber where he finds Tom Riddle standing next to the unconscious Ginny Harry kneels beside her and the serpent rises up behind him Something glows inside the Sorting Hat—a silver sword Harry grabs it waiting as the serpent moves across the stone floor towards him and starts to climb The serpent uncoils its massive body out of the water lifting its head towards him"
        }
      ]
    }
  ]
}