{
  "ground_truth": "Beside the lifeless head of his enemy, the basilisk, Harry touches Ginny's hand, and she is still clutching the diary. Harry grabs the diary and opens it, then raises the basilisk's Poison Fang and stabs the diary. Riddle recoils as a light pierces the hole in his chest, and blood spreads over the page. Harry stabs again, and Riddle puts a hand to his face as the powerful light surges out of his body and lifts him off his feet. Raising the fang again, Harry closes the diary and stabs with all his might into the black leather cover. In a flash of light, Riddle completely disintegrates, leaving behind only a few faint sparks floating in the air. Ginny suddenly wakes and, looking confused, she sits up and sees Harry, who is clutching his arm in pain. Dumbledore's Phoenix swoops down and settles beside Harry, looking sadly at his face. The handsome bird lowers its head, and its huge tears fall from its eyes onto Harry's arm. Ginny watches, her eyes wide with amazement, as the Phoenix weeps. Vapor rises from the wound, and the torn flesh begins to heal. Harry looks up at Fawkes. Later, Lockhart, Ron, Harry, and Ginny cling to each other as the powerful Phoenix carries them to safety and away from the Chamber of Secrets. In Dumbledore's study, Ron and Harry look at each other in amazement, and Ron leaves. Harry nods thoughtfully at the silver sword, takes it in both hands, and reads the inscription on the blade. The door flies open, and Lucius Malfoy strides in with Dobby at his heels. Lucius walks towards Dumbledore and glares at Harry, who glances at Dumbledore and holds up Tom Riddle's diary, prompting Dumbledore to smile as he turns to Lucius. Lucius kicks Dobby down the stairs, then hits him with a stick. Harry puts the sword down on the desk and looks at the black leather diary before catching up with Lucius in the corridor. He gives him the diary, and Lucius hands it to Dobby, leaning close to Harry and giving a sneer before turning away. Dobby still holds the diary and finds the sock between the pages. Harry pulls up his trouser leg and shows Lucius his bad ankle, then Lucius pulls a wand from his stick and advances on Harry. Dobby stands between them and with a fix of his hand, Lucius is hurtled backwards. The little elf folds his arms in triumph and then turns to walk away. Harry smiles. Later, everyone is gathered in the great hall, and he floats between the tables. Filch stands by the door, stroking his cat. Sitting at the Gryffindor table, Neville looks around as Hermione stands in the doorway smiling. Ron and Harry are thrilled to see her; grinning broadly, they get to their feet as she runs down the hall to join her friends.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Beside the inert cranium of his adversary, the basilisk, Harry touches Ginny's hand, and she is still gripping the journal. Harry seizes the journal and opens it, then elevates the basilisk's Venom Fang and pierces the journal. Riddle withdraws as a radiance penetrates the gap in his torso, and gore disperses over the sheet. Harry pierces again, and Riddle places a hand to his visage as the potent radiance erupts from his form and elevates him off his feet. Elevating the fang again, Harry shuts the journal and pierces with all his force into the black leather exterior. In a flash of radiance, Riddle entirely vanishes, leaving behind merely a few faint embers floating in the atmosphere. Ginny abruptly awakens and, appearing bewildered, she sits up and views Harry, who is clutching his limb in agony. Dumbledore's Phoenix dives down and perches beside Harry, gazing sadly at his visage. The elegant bird lowers its cranium, and its huge droplets fall from its eyes onto Harry's limb. Ginny observes, her eyes wide with wonder, as the Phoenix laments. Vapor rises from the injury, and the ripped tissue starts to mend. Harry glances up at Fawkes. Later, Lockhart, Ron, Harry, and Ginny cling to each other as the potent Phoenix transports them to safety and away from the Chamber of Secrets. In Dumbledore's study, Ron and Harry gaze at each other in wonder, and Ron departs. Harry nods pensively at the silver blade, takes it in both hands, and reads the inscription on the edge. The entrance flies open, and Lucius Malfoy strides in with Dobby at his heels. Lucius walks towards Dumbledore and glowers at Harry, who glances at Dumbledore and holds up Tom Riddle's journal, prompting Dumbledore to smile as he turns to Lucius. Lucius kicks Dobby down the stairs, then strikes him with a rod. Harry places the blade down on the desk and looks at the black leather journal before catching up with Lucius in the passage. He gives him the journal, and Lucius hands it to Dobby, leaning near to Harry and giving a sneer before turning away. Dobby still holds the journal and discovers the sock between the sheets. Harry pulls up his trouser leg and shows Lucius his bad ankle, then Lucius pulls a wand from his rod and advances on Harry. Dobby stands between them and with a fix of his hand, Lucius is propelled backwards. The diminutive elf folds his arms in triumph and then turns to walk away. Harry smiles. Later, everyone is gathered in the great hall, and he floats between the tables. Filch stands by the entrance, stroking his feline. Sitting at the Gryffindor table, Neville looks around as Hermione stands in the doorway smiling. Ron and Harry are delighted to see her; grinning broadly, they rise to their feet as she runs down the hall to join her companions."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Beside the lifeless head of the basilisk, his enemy, Ginny's hand is touched by Harry, and the diary is still clutched by her. The diary is grabbed by Harry and opened, then the basilisk's Poison Fang is raised and the diary is stabbed by him. As a light pierces the hole in his chest, Riddle recoils, and the page is spread over by blood. The diary is stabbed again by Harry, and Riddle puts a hand to his face as the powerful light surges out and lifts him off his feet. The diary is closed by Harry and, raising the fang again, he stabs with all his might into the black leather cover. In a flash of light, Riddle completely disintegrates, leaving behind only a few faint sparks that float in the air. Ginny suddenly wakes, looks confused, sits up, and sees Harry, who clutches his arm in pain. Dumbledore's Phoenix swoops down and settles beside Harry, looking sadly at him. Its huge tears are lowered from its eyes onto Harry's arm by the handsome bird. Her eyes wide with amazement, Ginny watches as the Phoenix weeps. The wound rises with vapor, and the torn flesh begins to heal. Fawkes is looked up at by Harry. Later, Lockhart, Ron, Harry, and Ginny cling to each other as they are carried to safety and away from the Chamber of Secrets by the powerful Phoenix. In Dumbledore's study, each other is looked at by Ron and Harry in amazement, and Ron leaves. The silver sword is nodded at thoughtfully by Harry, taken in both hands, and the inscription on the blade is read by him. The door is flown open, and Lucius Malfoy strides in with Dobby at his heels. Dumbledore is walked towards by Lucius, and Harry is glared at by him, who glances at Dumbledore and holds up Tom Riddle's diary, prompting a smile from Dumbledore as he turns to Lucius. Dobby is kicked down the stairs by Lucius, then hit with a stick. The sword is put down on the desk by Harry, and the black leather diary is looked at before he catches up with Lucius in the corridor. The diary is given to him, and Lucius hands it to Dobby, leaning close to Harry and sneering before turning away. The diary is still held by Dobby, and he finds the sock between the pages. Harry pulls up his trouser leg and shows Lucius his bad ankle; then a wand is pulled from his stick by Lucius, who advances on Harry. Dobby stands between them, and with a fix of his hand, he hurtles Lucius backwards. His arms are folded in triumph by the little elf, who then turns to walk away. Harry smiles. Later, everyone is gathered in the great hall, and he floats between the tables. The door is stood by Filch, who strokes his cat. Sitting at the Gryffindor table, Neville looks around as Hermione stands in the doorway smiling. Ron and Harry are thrilled to see her; grinning broadly, they get to their feet as she runs down the hall to join her friends."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Beside the lifeless basilisk, Harry touches Ginny's hand, still clutching the diary. He grabs it, raises the basilisk's Poison Fang, and stabs the diary. Riddle recoils as light pierces his chest, and blood spreads over the page. Harry stabs again, and light surges from Riddle, lifting him off his feet. Harry closes the diary and stabs the black leather cover with all his might. In a flash, Riddle disintegrates, leaving faint sparks. Ginny wakes, confused, and sees Harry clutching his arm in pain. Dumbledore's Phoenix lands beside Harry, its tears healing his wound. Ginny watches in amazement. Later, Lockhart, Ron, Harry, and Ginny cling to each other as the Phoenix carries them from the Chamber of Secrets. In Dumbledore's study, Ron and Harry exchange amazed looks before Ron leaves. Harry nods at the silver sword, reading its inscription. Lucius Malfoy enters with Dobby, glaring at Harry, who holds up Tom Riddle's diary, prompting Dumbledore to smile. Lucius kicks Dobby and hits him with a stick. Harry puts the sword down and catches up with Lucius, giving him the diary. Lucius hands it to Dobby, sneering at Harry. Dobby finds a sock in the diary, and Harry shows Lucius his bad ankle. Lucius advances on Harry, but Dobby stands between them, sending Lucius backward. The elf triumphantly walks away, and Harry smiles. Later, in the great hall, Filch strokes his cat. At the Gryffindor table, Neville looks around as Hermione enters, smiling. Ron and Harry are thrilled, grinning as she runs to join them."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Beside the basilisk's lifeless head, Harry touches Ginny's hand, still clutching the diary. He grabs it, raises the basilisk's Poison Fang, and stabs the diary. Riddle recoils as light pierces his chest, blood spreading over the page. Harry stabs again, and light surges from Riddle, lifting him off his feet. Harry closes the diary, stabbing the black leather cover with all his might. Riddle disintegrates in a flash, leaving faint sparks. Ginny wakes, confused, seeing Harry clutching his arm in pain. Dumbledore's Phoenix lands beside Harry, its tears healing his wound. Ginny watches in amazement. Later, Lockhart, Ron, Harry, and Ginny cling to each other as the Phoenix carries them from the Chamber of Secrets. In Dumbledore's study, Ron and Harry exchange amazed looks before Ron leaves. Harry nods at the silver sword, reading its inscription. Lucius Malfoy enters with Dobby, glaring at Harry, who holds up Tom Riddle's diary, making Dumbledore smile. Lucius kicks Dobby, then hits him. Harry catches up with Lucius, giving him the diary. Lucius hands it to Dobby, sneering at Harry. Dobby finds a sock in the diary, and Harry shows Lucius his bad ankle. Lucius advances on Harry, but Dobby stands between them, sending Lucius backward. The elf triumphantly walks away, and Harry smiles. Later, in the great hall, Filch strokes his cat. At the Gryffindor table, Neville sees Hermione smiling in the doorway. Ron and Harry, thrilled, stand as she runs to join them."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Beside the lifeless head of his formidable enemy, the fearsome basilisk, Harry gently touches Ginny's hand, noticing that she is still tightly clutching the diary. With determination, Harry grabs the diary from her grasp and opens it, then raises the deadly basilisk's Poison Fang high and forcefully stabs the diary. Riddle recoils in shock as a brilliant light pierces through the hole in his chest, and dark blood begins to spread ominously over the page. Harry stabs once more with determination, and Riddle puts a hand to his face as the powerful, blinding light surges out of his body, lifting him off his feet. Raising the fang yet again, Harry decisively closes the diary and stabs with all his might into the black leather cover. In a sudden flash of light, Riddle completely disintegrates, leaving behind only a few faint, shimmering sparks floating gently in the air. Ginny suddenly awakens and, looking confused and disoriented, she sits up and sees Harry, who is clutching his arm in visible pain. Dumbledore's majestic Phoenix swoops down gracefully and settles beside Harry, looking sadly at his face. The handsome bird lowers its head, and its large, glistening tears fall from its eyes onto Harry's injured arm. Ginny watches in awe, her eyes wide with amazement, as the Phoenix weeps. Vapor rises from the wound, and the torn flesh miraculously begins to heal. Harry looks up gratefully at Fawkes. Later, Lockhart, Ron, Harry, and Ginny cling to each other as the powerful Phoenix carries them to safety, away from the dangerous Chamber of Secrets. In Dumbledore's study, Ron and Harry exchange looks of amazement, and Ron eventually leaves. Harry nods thoughtfully at the gleaming silver sword, takes it in both hands, and reads the inscription engraved on the blade. Suddenly, the door flies open, and Lucius Malfoy strides in with Dobby trailing at his heels. Lucius walks purposefully towards Dumbledore and glares menacingly at Harry, who glances at Dumbledore and holds up Tom Riddle's diary, prompting Dumbledore to smile as he turns to face Lucius. Lucius, in a fit of anger, kicks Dobby down the stairs, then cruelly hits him with a stick. Harry puts the sword down on the desk and looks at the black leather diary before quickly catching up with Lucius in the corridor. He gives him the diary, and Lucius hands it to Dobby, leaning close to Harry and giving a sneer before turning away. Dobby still holds the diary and finds the sock hidden between the pages. Harry pulls up his trouser leg and shows Lucius his injured ankle, then Lucius pulls a wand from his stick and advances threateningly on Harry. Dobby bravely stands between them and, with a fix of his hand, sends Lucius hurtling backwards. The little elf folds his arms in triumph and then turns to walk away. Harry smiles with satisfaction. Later, everyone is gathered in the great hall, and he floats between the tables. Filch stands by the door, gently stroking his beloved cat. Sitting at the Gryffindor table, Neville looks around as Hermione stands in the doorway, smiling brightly. Ron and Harry are thrilled to see her; grinning broadly, they get to their feet as she runs joyfully down the hall to join her friends."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Beside the lifeless, severed head of the once formidable and fearsome basilisk, Harry reaches out with tenderness and gently touches Ginny's hand. He observes that she is still gripping the diary tightly, holding onto it as if it were a lifeline. With unwavering determination, Harry deftly removes the diary from her grasp and opens it with purpose. Then, raising the venomous Poison Fang of the deadly basilisk high above his head, he forcefully drives it into the diary's cursed pages. Riddle reacts with horror, recoiling as a brilliant and piercing light erupts from the gaping hole in his chest, while dark, sinister blood ominously spreads over the page. Without hesitation, Harry stabs once more, driven by unwavering resolve, and Riddle raises a hand to his face, attempting to shield himself as the intense, blinding light surges out of his phantom body, lifting him off his feet with an incredible force. Once more, Harry raises the fang, decisively closing the diary with a resolute gesture, and stabs into the black leather cover with all his might. In an explosive burst of light, Riddle disintegrates completely, leaving behind nothing but a few faint, shimmering sparks that float gently, lingering in the air. Ginny suddenly awakens from the ordeal and, looking bewildered and disoriented, she sits up to see Harry, who is visibly clutching his arm in pain. Majestically swooping down, Dumbledore's Phoenix gracefully descends and settles beside Harry, gazing sadly at his face with compassionate eyes. The magnificent bird lowers its noble head, allowing its large, glistening tears to fall gently from its eyes onto Harry's injured arm. Ginny watches in awe, her eyes wide with amazement and disbelief, as the Phoenix's tears work their miraculous magic. Vapor rises from the wound, and miraculously, the torn flesh begins to heal itself. Harry looks up with gratitude at Fawkes, the Phoenix. Later, Lockhart, Ron, Harry, and Ginny cling tightly to each other as the powerful Phoenix carries them safely away from the perilous Chamber of Secrets. In Dumbledore's study, Ron and Harry exchange looks of wonder and amazement before Ron eventually departs. Harry, deep in thought, nods thoughtfully at the gleaming, silver sword, grasping it with both hands and reading the inscription engraved on the blade. Suddenly, the door bursts open with a loud bang, and Lucius Malfoy strides in authoritatively, with Dobby trailing at his heels. Lucius walks with purpose towards Dumbledore, glaring menacingly at Harry, who glances at Dumbledore and raises Tom Riddle's diary for all to see. Dumbledore smiles knowingly as he turns to face Lucius. In a fit of anger, Lucius kicks Dobby cruelly down the stairs, then strikes him with his stick in a display of brutality. Harry places the sword down on the desk and casts a glance at the black leather diary before quickly catching up with Lucius in the corridor. He hands the diary over to Lucius, who in turn gives it to Dobby, leaning close to Harry and sneering before turning away. Dobby clutches the diary and discovers a sock hidden between its pages. Harry pulls up his trouser leg, revealing his injured ankle to Lucius, who draws a wand from his cane and advances on Harry with a threatening air. Bravely, Dobby steps between them and, with a flick of his hand, hurls Lucius backwards with a surge of magic. The little elf folds his arms triumphantly before turning to walk away, and Harry smiles with satisfaction at this turn of events. Later, as everyone gathers in the great hall, he moves gracefully between the tables. Filch stands by the door, gently stroking the fur of his beloved cat. Sitting at the Gryffindor table, Neville gazes around as Hermione stands in the doorway, her face lit up with a bright smile. Ron and Harry are overjoyed to see her; grinning broadly, they rise to their feet, welcoming her warmly as she runs joyfully down the hall to join her cherished friends."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Beside the lifeless head of his enemy, the basilisk, Harry gently reaches out and touches Ginny's hand, noticing that she is still clutching the diary tightly. With a determined grip, Harry takes hold of the diary and carefully opens it, then raises the basilisk's Poison Fang with a steady hand and forcefully stabs the diary. As he does so, Riddle recoils in shock as a brilliant light pierces through the hole in his chest, and dark blood begins to spread ominously over the page. Without hesitation, Harry stabs the diary again, and Riddle instinctively puts a hand to his face as the powerful light surges out of his body, lifting him off his feet in a dramatic display. Determined to finish the task, Harry raises the fang once more, closes the diary with resolve, and stabs with all his might into the black leather cover. In an instant, a flash of light erupts, and Riddle completely disintegrates, leaving behind only a few faint sparks that float gently in the air. Suddenly, Ginny wakes up, looking bewildered, and sits up to see Harry, who is clutching his arm in visible pain. At that moment, Dumbledore's Phoenix swoops down gracefully and settles beside Harry, gazing sadly at his face. The majestic bird lowers its head, and its large, glistening tears fall from its eyes onto Harry's wounded arm. Ginny watches in awe, her eyes wide with amazement, as the Phoenix weeps. As the tears touch the wound, vapor rises, and the torn flesh begins to heal miraculously. Harry looks up at Fawkes with gratitude. Later, Lockhart, Ron, Harry, and Ginny cling to each other tightly as the powerful Phoenix carries them safely away from the Chamber of Secrets. In Dumbledore's study, Ron and Harry exchange looks of amazement, and Ron eventually leaves the room. Harry nods thoughtfully at the gleaming silver sword, takes it in both hands, and reads the inscription on the blade with interest. Suddenly, the door flies open, and Lucius Malfoy strides in with Dobby trailing at his heels. Lucius walks purposefully towards Dumbledore and glares at Harry, who glances at Dumbledore for reassurance and then holds up Tom Riddle's diary, prompting Dumbledore to smile knowingly as he turns to face Lucius. In a fit of anger, Lucius kicks Dobby down the stairs and then strikes him with a stick. Harry carefully places the sword down on the desk and looks at the black leather diary before quickly catching up with Lucius in the corridor. He hands the diary back to Lucius, who then gives it to Dobby, leaning close to Harry with a sneer before turning away. Dobby, still holding the diary, discovers the sock hidden between the pages. Harry pulls up his trouser leg to reveal his injured ankle to Lucius, who, in response, pulls a wand from his stick and advances menacingly on Harry. Dobby bravely stands between them and, with a decisive fix of his hand, sends Lucius hurtling backwards. The little elf folds his arms in triumph and then turns to walk away confidently. Harry smiles in appreciation. Later, everyone is gathered in the great hall, and he floats between the tables, observing the scene. Filch stands by the door, gently stroking his cat. Sitting at the Gryffindor table, Neville looks around expectantly as Hermione appears in the doorway, smiling brightly. Ron and Harry are overjoyed to see her; grinning broadly, they rise to their feet as she runs down the hall to join her friends, completing the joyful reunion."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Beside the lifeless basilisk, Harry touches Ginny's hand, retrieves the diary she clutches, and decisively stabs it with the basilisk's Poison Fang. As Riddle recoils and disintegrates in a flash of light, Ginny awakens, confused, and sees Harry in pain. Dumbledore's Phoenix, Fawkes, descends, shedding healing tears onto Harry's wound, which begins to mend. Ginny watches in amazement as Harry looks gratefully at Fawkes. Later, Lockhart, Ron, Harry, and Ginny cling to each other as Fawkes carries them safely from the Chamber of Secrets. In Dumbledore's study, Ron and Harry exchange amazed glances before Ron departs. Harry thoughtfully examines the silver sword, reading its inscription. Lucius Malfoy enters with Dobby, glaring at Harry, who holds up Tom Riddle's diary, prompting Dumbledore's smile. Lucius kicks Dobby and strikes him with a stick. Harry sets the sword down, follows Lucius, and hands him the diary, which Lucius gives to Dobby. Discovering a sock inside, Dobby is freed. Lucius, angered, advances on Harry, but Dobby intervenes, sending Lucius hurtling backward. Triumphant, Dobby walks away as Harry smiles. Later, in the great hall, everyone gathers. Filch strokes his cat by the door, while Neville looks around. Hermione enters, smiling, and Ron and Harry, thrilled, rise to greet her as she runs to join them."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Beside the lifeless head of his enemy, the basilisk, a mythical serpent reputed to cause death with a single glance, Harry touches Ginny's hand, and she is still clutching the diary that belonged to Tom Riddle, later known as Lord Voldemort. Harry grabs the diary and opens it, then raises the basilisk's Poison Fang, known for its deadly venom capable of killing with a single puncture, and stabs the diary. Riddle recoils as a light pierces the hole in his chest, and blood spreads over the enchanted page used to communicate with him. Harry stabs again, and Riddle puts a hand to his face as the powerful light surges out of his body and lifts him off his feet. Raising the fang again, Harry closes the diary and stabs with all his might into the black leather cover embossed with Riddle's initials. In a flash of light, Riddle completely disintegrates, leaving behind only a few faint sparks floating in the air. Ginny, who had been under the diary's dark influence, suddenly wakes and, looking confused, she sits up and sees Harry, who is clutching his arm in pain. Dumbledore's Phoenix, named Fawkes, swoops down and settles beside Harry, looking sadly at his face. The handsome bird lowers its head, and its huge tears fall from its eyes onto Harry's arm, known for their healing powers. Ginny watches, her eyes wide with amazement, as the Phoenix weeps. Vapor rises from the wound, and the torn flesh begins to heal. Harry looks up at Fawkes with gratitude. Later, Lockhart, Ron, Harry, and Ginny cling to each other as the powerful Phoenix carries them to safety and away from the Chamber of Secrets, a hidden area built by Salazar Slytherin. In Dumbledore's study, the headmaster's office lined with books and curious instruments, Ron and Harry look at each other in amazement, and Ron leaves. Harry nods thoughtfully at the silver sword, marked with the name of Godric Gryffindor, takes it in both hands, and reads the inscription on the blade, which proclaims its noble heritage. The door flies open, and Lucius Malfoy, a prominent and influential figure in the wizarding world, strides in with Dobby, the house-elf bound to serve him, at his heels. Lucius walks towards Dumbledore and glares at Harry, who glances at Dumbledore and holds up Tom Riddle's diary, prompting Dumbledore to smile as he turns to Lucius. Lucius kicks Dobby down the stairs, then hits him with a stick, indicative of the cruel treatment house-elves often endure. Harry puts the sword down on the desk and looks at the black leather diary before catching up with Lucius in the corridor. He gives him the diary, and Lucius hands it to Dobby, unwittingly freeing him by presenting a piece of clothing, a sock, which is the only way to release a house-elf from servitude. Leaning close to Harry and giving a sneer before turning away, Dobby still holds the diary and finds the sock slipped between the pages. Harry pulls up his trouser leg and shows Lucius his bad ankle, then Lucius pulls a wand from his stick, an accessory often used by pure-blood wizards, and advances on Harry. Dobby stands between them and with a fix of his hand, Lucius is hurtled backwards. The little elf folds his arms in triumph, having just gained his freedom, and then turns to walk away. Harry smiles. Later, everyone is gathered in the great hall, the central gathering place within Hogwarts, and he floats between the tables. Filch stands by the door, stroking his cat, Mrs. Norris, known for her keen sense to detect mischief. Sitting at the Gryffindor table, Neville looks around as Hermione stands in the doorway smiling. Ron and Harry are thrilled to see her; grinning broadly, they get to their feet as she runs down the hall to join her friends, finally reunited after being petrified by the basilisk's gaze."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Beside the lifeless head of his enemy the basilisk Harry touches Ginny's hand and she is still clutching the diary  Harry stabs again and Riddle puts a hand to his face as the powerful light surges out of his body and lifts him off his feet  Raising the fang again  Harry closes the diary and stabs with all his might into the black leather cover  In a flash of light Riddle completely disintegrates leaving behind only a few faint sparks floating in the air  Ginny suddenly wakes and looking confused  she sits up and sees Harry who is clutching his arm in pain  Dumbledore's Phoenix swoops down and settles beside Harry looking sadly at his face  The handsome bird lowers its head and its huge tears fall from its eyes onto Harry's arm  Ginny watches her eyes wide with amazement as the Phoenix weeps  Vapor rises from the wound and the torn flesh begins to heal  Harry looks up at Fawkes  Later Lockhart Ron  Harry and Ginny cling to each other as the powerful Phoenix carries them to safety and away from the Chamber of Secrets  In Dumbledore's study Ron and Harry look at each other in amazement and Ron leaves  Harry nods thoughtfully at the silver sword takes it in both hands and reads the inscription on the blade  The door flies open and Lucius Malfoy strides in with Dobby at his heels  Lucius walks towards Dumbledore and glares at Harry who glances at Dumbledore and holds up Tom Riddle's diary prompting Dumbledore to smile as he turns to Lucius  Lucius kicks Dobby down the stairs then hits him with a stick  Harry grabs the diary and opens it then raises the basilisk's Poison Fang and stabs the diary  Riddle recoils as a light pierces the hole in his chest and blood spreads over the page  Harry stabs again and Riddle puts a hand to his face as the powerful light surges out of his body and lifts him off his feet  Raising the fang again  Harry closes the diary and stabs with all his might into the black leather cover  In a flash of light Riddle completely disintegrates leaving behind only a few faint sparks floating in the air  Ginny suddenly wakes and looking confused  she sits up and sees Harry who is clutching his arm in pain  Dumbledore's Phoenix swoops down and settles beside Harry looking sadly at his face  The handsome bird lowers its head and its huge tears fall from its eyes onto Harry's arm  Ginny watches her eyes wide with amazement as the Phoenix weeps  Vapor rises from the wound and the torn flesh begins to heal  Harry looks up at Fawkes  Later Lockhart Ron  Harry and Ginny cling to each other as the powerful Phoenix carries them to safety and away from the Chamber of Secrets  In Dumbledore's study Ron and Harry look at each other in amazement and Ron leaves  Harry nods thoughtfully at the silver sword takes it in both hands and reads the inscription on the blade  The door flies open and Lucius Malfoy strides in with Dobby at his heels  Lucius walks towards Dumbledore and glares at Harry who glances at Dumbledore and holds up Tom Riddle's diary prompting Dumbledore to smile as he turns to Lucius  Lucius kicks Dobby down the stairs then hits him with a stick  Harry puts the sword down on the desk and looks at the black leather diary before catching up with Lucius in the corridor  He gives him the diary and Lucius hands it to Dobby leaning close to Harry and giving a sneer before turning away  Dobby still holds the diary and finds the sock between the pages  Harry pulls up his trouser leg and shows Lucius his bad ankle  then Lucius pulls a wand from his stick and advances on Harry  Dobby stands between them and with a fix of his hand Lucius is hurtled backwards  The little elf folds his arms in triumph and then turns to walk away  Harry smiles  Later everyone is gathered in the great hall and he floats between the tables  Filch stands by the door stroking his cat  Sitting at the Gryffindor table  Neville looks around as Hermione stands in the doorway smiling  Ron and Harry are thrilled to see her grinning broadly  they get to their feet as she runs down the hall to join her friends"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Beside the lifeless head of his enemy the basilisk Harry touches Ginny's hand and she is still clutching the diary. Harry grabs the diary and opens it then raises the basilisk's Poison Fang and stabs the diary. Riddle recoils as a light pierces the hole in his chest and blood spreads over the page. Harry stabs again and Riddle puts a hand to his face as the powerful light surges out of his body and lifts him off his feet. Raising the fang again. Harry closes the diary and stabs with all his might into the black leather cover. In a flash of light Riddle completely disintegrates leaving behind only a few faint sparks floating in the air. Ginny suddenly wakes and looking confused. she sits up and sees Harry who is clutching his arm in pain. Dumbledore's Phoenix swoops down and settles beside Harry looking sadly at his face. The handsome bird lowers its head and its huge tears fall from its eyes onto Harry's arm. Ginny watches her eyes wide with amazement as the Phoenix weeps. Vapor rises from the wound and the torn flesh begins to heal. Harry looks up at Fawkes. Later Lockhart Ron. Harry and Ginny cling to each other as the powerful Phoenix carries them to safety and away from the Chamber of Secrets. In Dumbledore's study Ron and Harry look at each other in amazement and Ron leaves. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Harry nods thoughtfully at the silver sword takes it in both hands and reads the inscription on the blade. The door flies open and Lucius Malfoy strides in with Dobby at his heels. Lucius walks towards Dumbledore and glares at Harry who glances at Dumbledore and holds up Tom Riddle's diary prompting Dumbledore to smile as he turns to Lucius. Lucius kicks Dobby down the stairs then hits him with a stick. Harry puts the sword down on the desk and looks at the black leather diary before catching up with Lucius in the corridor. He gives him the diary and Lucius hands it to Dobby leaning close to Harry and giving a sneer before turning away. Dobby still holds the diary and finds the sock between the pages. Harry pulls up his trouser leg and shows Lucius his bad ankle. then Lucius pulls a wand from his stick and advances on Harry. Dobby stands between them and with a fix of his hand Lucius is hurtled backwards. The little elf folds his arms in triumph and then turns to walk away. Harry smiles. Later everyone is gathered in the great hall and he floats between the tables. Filch stands by the door stroking his cat. Sitting at the Gryffindor table. Neville looks around as Hermione stands in the doorway smiling. Ron and Harry are thrilled to see her grinning broadly. they get to their feet as she runs down the hall to join her friends."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Beside the lifeless head of his enemy the basilisk Harry touches Ginny's hand and she is still clutching the diary. Harry grabs the diary and opens it then raises the basilisk's Poison Fang and stabs the diary. Riddle recoils as a light pierces the hole in his chest and blood spreads over the page. Harry stabs again and Riddle puts a hand to his face as the powerful light surges out of his body and lifts him off his feet. Raising the fang again. Harry closes the diary and stabs with all his might into the black leather cover. In a flash of light Riddle completely disintegrates leaving behind only a few faint sparks floating in the air. Ginny suddenly wakes and looking confused. she sits up and sees Harry who is clutching his arm in pain. Dumbledore's Phoenix swoops down and settles beside Harry looking sadly at his face. The handsome bird lowers its head and its huge tears fall from its eyes onto Harry's arm. Ginny watches her eyes wide with amazement as the Phoenix weeps. Vapor rises from the wound and the torn flesh begins to heal. Harry looks up at Fawkes. Later Lockhart Ron. Harry and Ginny cling to each other as the powerful Phoenix carries them to safety and away from the Chamber of Secrets. In Dumbledore's study Ron and Harry look at each other in amazement and Ron leaves. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Harry nods thoughtfully at the silver sword takes it in both hands and reads the inscription on the blade. The door flies open and Lucius Malfoy strides in with Dobby at his heels. Lucius walks towards Dumbledore and glares at Harry who glances at Dumbledore and holds up Tom Riddle's diary prompting Dumbledore to smile as he turns to Lucius. Lucius kicks Dobby down the stairs then hits him with a stick. Harry puts the sword down on the desk and looks at the black leather diary before catching up with Lucius in the corridor. He gives him the diary and Lucius hands it to Dobby leaning close to Harry and giving a sneer before turning away. Dobby still holds the diary and finds the sock between the pages. Harry pulls up his trouser leg and shows Lucius his bad ankle. then Lucius pulls a wand from his stick and advances on Harry. Dobby stands between them and with a fix of his hand Lucius is hurtled backwards. The little elf folds his arms in triumph and then turns to walk away. Harry smiles. Later everyone is gathered in the great hall and he floats between the tables. Filch stands by the door stroking his cat. Sitting at the Gryffindor table. Neville looks around as Hermione stands in the doorway smiling. Ron and Harry are thrilled to see her grinning broadly. they get to their feet as she runs down the hall to join her friends."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Beside the lifeless head of his enemy the basilisk Harry touches Ginny's hand and she is still clutching the diary. Harry grabs the diary and opens it then raises the basilisk's Poison Fang and stabs the diary. Riddle recoils as a light pierces the hole in his chest and blood spreads over the page. Harry stabs again and Riddle puts a hand to his face as the powerful light surges out of his body and lifts him off his feet. Raising the fang again. Harry closes the diary and stabs with all his might into the black leather cover. In a flash of light Riddle completely disintegrates leaving behind only a few faint sparks floating in the air. Ginny suddenly wakes and looking confused. she sits up and sees Harry who is clutching his arm in pain. Dobby stands between them and with a fix of his hand Lucius is hurtled backwards. The little elf folds his arms in triumph and then turns to walk away. Harry smiles. Later everyone is gathered in the great hall and he floats between the tables. Filch stands by the door stroking his cat. Sitting at the Gryffindor table. Neville looks around as Hermione stands in the doorway smiling. Ron and Harry are thrilled to see her grinning broadly. they get to their feet as she runs down the hall to join her friends."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Beside the lifeless head of his enemy the basilisk Harry touches Ginny's hand and she is still clutching the diary. Harry grabs the diary and opens it then raises the basilisk's Poison Fang and stabs the diary. Riddle recoils as a light pierces the hole in his chest and blood spreads over the page. Sitting at the Gryffindor table. Neville looks around as Hermione stands in the doorway smiling. Ron and Harry are thrilled to see her grinning broadly. they get to their feet as she runs down the hall to join her friends."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Beside the lifeless head of her enemy, the unicorn, Hermione touches Ginny's hand, and she is still clutching the diary. Hermione grabs the diary and opens it, then raises the unicorn's Poison Fang and stabs the diary. Luna recoils as a light pierces the hole in her chest, and blood spreads over the page. Hermione stabs again, and Luna puts a hand to her face as the powerful light surges out of her body and lifts her off her feet. Raising the fang again, Hermione closes the diary and stabs with all her might into the black leather cover. In a flash of light, Luna completely disintegrates, leaving behind only a few faint sparks floating in the air. Ginny suddenly wakes and, looking confused, she sits up and sees Hermione, who is clutching her arm in pain. Snape's Centaur swoops down and settles beside Hermione, looking sadly at her face. The handsome creature lowers its head, and its huge tears fall from its eyes onto Hermione's arm. Ginny watches, her eyes wide with amazement, as the Centaur weeps. Vapor rises from the wound, and the torn flesh begins to heal. Hermione looks up at Firenze. Later, Filch, Neville, Hermione, and Ginny cling to each other as the powerful Centaur carries them to safety and away from the Chamber of Secrets. In McGonagall's study, Neville and Hermione look at each other in amazement, and Neville leaves. Hermione nods thoughtfully at the silver sword, takes it in both hands, and reads the inscription on the blade. The door flies open, and Draco Malfoy strides in with Kreacher at his heels. Draco walks towards McGonagall and glares at Hermione, who glances at McGonagall and holds up Bellatrix's diary, prompting McGonagall to smile as she turns to Draco. Draco kicks Kreacher down the stairs, then hits him with a stick. Hermione puts the sword down on the desk and looks at the black leather diary before catching up with Draco in the corridor. She gives him the diary, and Draco hands it to Kreacher, leaning close to Hermione and giving a sneer before turning away. Kreacher still holds the diary and finds the sock between the pages. Hermione pulls up her trouser leg and shows Draco her bad ankle, then Draco pulls a wand from his stick and advances on Hermione. Kreacher stands between them and with a fix of his hand, Draco is hurtled backwards. The little elf folds his arms in triumph and then turns to walk away. Hermione smiles. Later, everyone is gathered in the great hall, and she floats between the tables. Filch stands by the door, stroking his owl. Sitting at the Hufflepuff table, Luna looks around as Cho stands in the doorway smiling. Neville and Hermione are thrilled to see her; grinning broadly, they get to their feet as she runs down the hall to join her friends."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Beside the lifeless head of his enemy, the griffin, Harry touches Ginny's hand, and she is still clutching the journal. Harry grabs the journal and opens it, then raises the griffin's Ice Claw and stabs the journal. Riddle recoils as a light pierces the hole in his chest, and ink spreads over the page. Harry stabs again, and Riddle puts a hand to his face as the powerful light surges out of his body and lifts him off his feet. Raising the claw again, Harry closes the journal and stabs with all his might into the crimson silk cover. In a flash of light, Riddle completely disintegrates, leaving behind only a few faint sparks floating in the air. Ginny suddenly wakes and, looking confused, she sits up and sees Harry, who is clutching his leg in pain. Dumbledore's Owl swoops down and settles beside Harry, looking sadly at his face. The majestic bird lowers its head, and its large tears fall from its eyes onto Harry's leg. Ginny watches, her eyes wide with amazement, as the Owl weeps. Vapor rises from the wound, and the torn flesh begins to heal. Harry looks up at Hedwig. Later, Lockhart, Ron, Harry, and Ginny cling to each other as the powerful Owl carries them to safety and away from the Dungeon of Mysteries. In Dumbledore's study, Ron and Harry look at each other in amazement, and Ron leaves. Harry nods thoughtfully at the golden lance, takes it in both hands, and reads the inscription on the shaft. The door flies open, and Lucius Malfoy strides in with Winky at his heels. Lucius walks towards Dumbledore and glares at Harry, who glances at Dumbledore and holds up Tom Riddle's journal, prompting Dumbledore to smile as he turns to Lucius. Lucius kicks Winky down the stairs, then hits her with a rod. Harry puts the lance down on the desk and looks at the crimson silk journal before catching up with Lucius in the corridor. He gives him the journal, and Lucius hands it to Winky, leaning close to Harry and giving a sneer before turning away. Winky still holds the journal and finds the shoe between the pages. Harry pulls up his trouser leg and shows Lucius his sore knee, then Lucius pulls a wand from his rod and advances on Harry. Winky stands between them and with a flick of her hand, Lucius is hurtled backwards. The little elf folds her arms in triumph and then turns to walk away. Harry smiles. Later, everyone is gathered in the great atrium, and he floats between the tables. Filch stands by the door, stroking his owl. Sitting at the Slytherin table, Neville looks around as Hermione stands in the doorway smiling. Ron and Harry are thrilled to see her; grinning broadly, they get to their feet as she runs down the atrium to join her friends."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Beside the lifeless head of his enemy, the basilisk, Harry pats Ginny's hand, and she is still holding the diary. Harry snatches the diary and flips through it, then waves the basilisk's Poison Fang and pokes the diary. Riddle winces as a light shines from the gap in his chest, and ink smudges over the page. Harry jabs again, and Riddle touches his cheek as the powerful light bursts out of his body and rolls him off his feet. Raising the fang once more, Harry shuts the diary and slices with all his might into the black leather cover. In a burst of light, Riddle completely evaporates, leaving behind only a few faint sparks drifting in the air. Ginny abruptly stirs and, looking bewildered, she stands up and sees Harry, who is rubbing his arm in discomfort. Dumbledore's Phoenix glides down and perches beside Harry, gazing sorrowfully at his face. The majestic bird lowers its head, and its large tears drip from its eyes onto Harry's arm. Ginny observes, her eyes wide with astonishment, as the Phoenix cries. Mist rises from the wound, and the damaged flesh begins to mend. Harry gazes up at Fawkes. Later, Lockhart, Ron, Harry, and Ginny huddle together as the powerful Phoenix transports them to safety and away from the Chamber of Secrets. In Dumbledore's study, Ron and Harry glance at each other in disbelief, and Ron exits. Harry nods thoughtfully at the silver sword, grasps it in both hands, and examines the inscription on the blade. The door bursts open, and Lucius Malfoy marches in with Dobby at his heels. Lucius approaches Dumbledore and scowls at Harry, who peeks at Dumbledore and holds up Tom Riddle's diary, prompting Dumbledore to grin as he turns to Lucius. Lucius shoves Dobby down the stairs, then taps him with a stick. Harry places the sword down on the desk and stares at the black leather diary before catching up with Lucius in the corridor. He presents him with the diary, and Lucius passes it to Dobby, leaning close to Harry and giving a smirk before retreating. Dobby still clutches the diary and discovers the sock between the pages. Harry hikes up his trouser leg and shows Lucius his swollen ankle, then Lucius extracts a wand from his stick and approaches Harry. Dobby steps between them and with a snap of his fingers, Lucius is flung backwards. The little elf crosses his arms in triumph and then turns to stroll away. Harry beams. Later, everyone is assembled in the great hall, and he glides between the tables. Filch stands by the door, petting his cat. Sitting at the Gryffindor table, Neville glances around as Hermione stands in the doorway beaming. Ron and Harry are delighted to see her; smiling widely, they rise to their feet as she dashes down the hall to join her friends."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Beside the lifeless wheel of his ally, the unicorn, George touches Luna's elbow, and she is still clutching the cookbook. George grabs the cookbook and opens it, then raises the unicorn's Venom Claw and stabs the cookbook. Quirrel recoils as a light pierces the hole in his shoulder, and ink spreads over the map. George stabs again, and Quirrel puts a hand to his chin as the powerful light surges out of his hat and lifts him off his knees. Raising the claw again, George closes the cookbook and stabs with all his might into the yellow velvet cover. In a flash of light, Quirrel completely disintegrates, leaving behind only a few faint sparks floating in the water. Luna suddenly wakes and, looking confused, she sits up and sees George, who is clutching his collar in pain. McGonagall's Griffin swoops down and settles beside George, looking sadly at his neck. The vibrant beast lowers its tail, and its tiny tears fall from its ears onto George's collar. Luna watches, her eyes wide with amazement, as the Griffin weeps. Mist rises from the bruise, and the torn cloth begins to heal. George looks up at Buckbeak. Later, Snape, Hermione, George, and Luna cling to each other as the powerful Griffin carries them to safety and away from the Garden of Shadows. In Snape's office, Hermione and George look at each other in amazement, and Hermione leaves. George nods thoughtfully at the golden dagger, takes it in both elbows, and reads the inscription on the hilt. The wall flies open, and Narcissa Black strides in with Winky at her toes. Narcissa walks towards Snape and glares at George, who glances at Snape and holds up Lord Quirrel's cookbook, prompting Snape to smile as he turns to Narcissa. Narcissa kicks Winky down the ladder, then hits her with a broom. George puts the dagger down on the chair and looks at the yellow velvet cookbook before catching up with Narcissa in the hallway. He gives her the cookbook, and Narcissa hands it to Winky, leaning close to George and giving a sneer before turning away. Winky still holds the cookbook and finds the scarf between the recipes. George pulls up his jumper and shows Narcissa his bad wrist, then Narcissa pulls a flute from her broom and advances on George. Winky stands between them and with a flick of her ear, Narcissa is hurtled backwards. The small sprite folds her toes in triumph and then turns to walk away. George smiles. Later, everyone is gathered in the broad room, and he floats between the chairs. Sprout stands by the wall, stroking her rat. Sitting at the Slytherin chair, Cedric looks around as Lavender stands in the wall smiling. Draco and George are thrilled to see her; grinning broadly, they get to their knees as she runs down the room to join her foes."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Beside the sleeping tail of its companion, the dragonfly, Luna taps Ron's shoulder, and he is still holding the photograph. Luna seizes the photograph and examines it, then elevates the dragonfly's Silver Wing and slices the photograph. Snape flinches as a shadow illuminates the gap in his arm, and ink cascades over the wall. Luna slices again, and Snape places a foot to his knee as the gentle shadow flows out of his hat and lowers him to his hands. Elevating the wing again, Luna shuts the photograph and slices with all her strength into the crimson velvet frame. In a burst of shadow, Snape utterly vanishes, leaving behind only a few dim echoes spinning in the air. Ron suddenly awakens and, looking bewildered, he stands up and sees Luna, who is holding her foot in surprise. McGonagall's Owl glides down and lands next to Luna, staring intently at her shoulder. The mesmerizing creature lifts its talon, and its large feathers drop from its wings onto Luna's foot. Ron observes, his mouth agape with awe, as the Owl preens. Smoke spirals from the limb, and the bruised skin starts to mend. Luna gazes up at Hedwig. Later, Snape, Hermione, Luna, and Ron embrace one another as the gentle Owl transports them to safety and away from the Hall of Mirrors. In McGonagall's library, Hermione and Luna glance at one another in astonishment, and Hermione departs. Luna nods pensively at the bronze shield, grasps it in both hands, and scans the engraving on the edge. The window swings open, and Draco Malfoy marches in with Kreacher at his side. Draco strides toward McGonagall and sneers at Luna, who peers at McGonagall and lifts Tom Riddle's photograph, causing McGonagall to grin as she faces Draco. Draco nudges Kreacher down the hallway, then pokes him with a branch. Luna sets the shield down on the chair and stares at the crimson velvet photograph before trailing Draco in the corridor. She offers him the photograph, and Draco passes it to Kreacher, leaning near Luna and uttering a chuckle before departing. Kreacher still holds the photograph and discovers the ribbon between the pages. Luna rolls up her sleeve and reveals Draco her injured wrist, then Draco pulls a pen from his branch and approaches Luna. Kreacher stands to the side and with a pinch of his foot, Draco is propelled forwards. The small goblin raises his head in delight and then turns to move away. Luna laughs. Later, everyone is assembled in the dining room, and she hovers above the pillows. Madam Pince stands by the arch, petting her owl. Standing at the Hufflepuff table, Seamus glances around as Lavender stands in the archway grinning. Hermione and Luna are ecstatic to see her; smiling brightly, they rise to their knees as she dashes across the room to join their circle."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Beside the motionless shoe of his adversary, the chameleon, Harry nudges Ginny's elbow, and she is still holding onto the notebook. Harry snatches the notebook and flips through it, then hoists the chameleon's Sapphire Beak and slices the notebook. Riddle flinches as a shadow pierces the gap in his leg, and ink spreads over the sheet. Harry slices again, and Riddle puts a hand to his ankle as the brilliant shadow bursts out of his clothes and pushes him off his feet. Lifting the beak once more, Harry shuts the notebook and slices with all his strength into the crimson fabric cover. In a burst of shadows, Riddle completely dissolves, leaving behind only a few flickering sparks swirling in the air. Ginny abruptly awakens and, looking bewildered, she stands up and sees Harry, who is grasping his leg in discomfort. Dumbledore's Eagle glides down and perches beside Harry, peering sadly at his knee. The elegant bird lowers its wing, and its massive droplets fall from its beak onto Harry's leg. Ginny gazes, her eyes wide with astonishment, as the Eagle cries. Mist rises from the scratch, and the broken skin starts to mend. Harry gazes up at Fawkes. Later, Lockhart, Ron, Harry, and Ginny cling to each other as the majestic Eagle carries them to safety and away from the Chamber of Whispers. In Dumbledore's chamber, Ron and Harry gaze at each other in wonder, and Ron departs. Harry nods reflectively at the golden trumpet, takes it in both hands, and examines the engraving on the bell. The window bursts open, and Lucius Malfoy marches in with Dobby at his side. Lucius strides towards Dumbledore and scowls at Harry, who glances at Dumbledore and holds up Tom Riddle's notebook, prompting Dumbledore to beam as he turns to Lucius. Lucius nudges Dobby down the stairs, then flicks him with a ribbon. Harry places the trumpet down on the table and looks at the crimson fabric notebook before catching up with Lucius in the hallway. He offers him the notebook, and Lucius passes it to Dobby, leaning close to Harry and giving a smirk before walking away. Dobby still holds the notebook and discovers the ribbon between the sheets. Harry rolls up his sleeve and shows Lucius his bruised wrist, then Lucius pulls a feather from his ribbon and advances on Harry. Dobby stands between them and with a snap of his finger, Lucius is propelled backwards. The small elf crosses his arms in triumph and then turns to saunter away. Harry grins. Later, everyone is gathered in the great chamber, and he glides between the chairs. Filch stands by the wall, petting his parrot. Sitting at the Gryffindor platform, Neville glances around as Hermione stands in the entryway smiling. Ron and Harry are elated to see her; beaming widely, they rise to their feet as she runs down the corridor to join her companions."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Next to the motionless wing of her counterpart, the griffin, Alex taps Leo's elbow, and he is still clutching the cookbook. Alex seizes the cookbook and flips it open, then lifts the griffin's Venomous Talon and jabs the cookbook. Soloman winces as a beam pierces the gap in his torso, and ink seeps over the paper. Alex jabs once more, and Soloman places a foot to his chin as the vibrant beam erupts from his form and hoists him off his toes. Hoisting the talon again, Alex shuts the cookbook and thrusts with all his strength into the dark velvet casing. In a burst of light, Soloman utterly dissolves, leaving behind only wispy embers drifting in the breeze. Leo promptly awakens and, appearing baffled, he stands up and spots Alex, who is gripping his leg in agony. Oberon's Eagle swoops down and lands beside Alex, gazing sorrowfully at his expression. The elegant creature lowers its beak, and its enormous droplets spill from its beak onto Alex's leg. Leo observes, his eyes wide with wonder, as the Eagle laments. Mist rises from the injury, and the shredded tissue starts to mend. Alex glances up at Aiden. Later, Marcus, Sam, Alex, and Leo cling to one another as the formidable Eagle transports them to safety and away from the Hall of Secrets. In Oberon's chamber, Sam and Alex glance at each other in disbelief, and Sam departs. Alex nods pensively at the golden shield, grasps it with both paws, and studies the etching on the edge. The window bursts open, and Marcus Beech storms in with Zephyr at his feet. Marcus strolls toward Oberon and scowls at Alex, who peers at Oberon and holds up Richard Soloman's cookbook, prompting Oberon to grin as he turns to Marcus. Marcus nudges Zephyr down the steps, then strikes him with a branch. Alex sets the shield down on the shelf and stares at the dark velvet cookbook before catching up with Marcus in the hallway. He hands him the cookbook, and Marcus gives it to Zephyr, leaning in close to Alex and offering a smirk before walking away. Zephyr still grips the cookbook and discovers the mitten tucked between the sheets. Alex rolls up his sleeve and shows Marcus his swollen knee, then Marcus extracts a wand from his branch and lunges at Alex. Zephyr stands between them and with a snap of his ear, Marcus is launched backwards. The tiny goblin crosses his legs in victory and then turns to stride away. Alex beams. Later, everyone gathers in the vast room, and he drifts between the benches. Grindel stands by the window, patting his parrot. Sitting at the Ravenclaw bench, Leonard scans the room as Hermione enters the doorway grinning. Sam and Alex are ecstatic to see her; beaming widely, they rise to their toes as she sprints down the room to join her companions."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Harry destroys Tom Riddle's diary using the basilisk's Poison Fang, causing Riddle to disintegrate. Ginny wakes up confused, and Harry, injured, is comforted by Dumbledore's Phoenix, Fawkes, whose tears heal his arm. Harry, Ginny, Ron, and Lockhart escape the Chamber of Secrets with Fawkes' help. In Dumbledore's study, Harry examines the silver sword, then confronts Lucius Malfoy, showing him the diary. Lucius gives the diary to Dobby, unknowingly freeing him with a hidden sock. When Lucius threatens Harry, Dobby defends him, using magic to send Lucius flying backward. Later, in the great hall, Hermione returns, and Harry and Ron joyfully reunite with her."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "they get to their feet as she runs down the hall to join her friends Ron and Harry are thrilled to see her grinning broadly  Neville looks around as Hermione stands in the doorway smiling  Sitting at the Gryffindor table  Filch stands by the door stroking his cat  Later everyone is gathered in the great hall and he floats between the tables  Harry smiles  The little elf folds his arms in triumph and then turns to walk away  Dobby stands between them and with a fix of his hand Lucius is hurtled backwards  then Lucius pulls a wand from his stick and advances on Harry  Harry pulls up his trouser leg and shows Lucius his bad ankle  Dobby still holds the diary and finds the sock between the pages  He gives him the diary and Lucius hands it to Dobby leaning close to Harry and giving a sneer before turning away  Harry puts the sword down on the desk and looks at the black leather diary before catching up with Lucius in the corridor  Lucius kicks Dobby down the stairs then hits him with a stick  Lucius walks towards Dumbledore and glares at Harry who glances at Dumbledore and holds up Tom Riddle's diary prompting Dumbledore to smile as he turns to Lucius  The door flies open and Lucius Malfoy strides in with Dobby at his heels  Harry nods thoughtfully at the silver sword takes it in both hands and reads the inscription on the blade  In Dumbledore's study Ron and Harry look at each other in amazement and Ron leaves  Harry and Ginny cling to each other as the powerful Phoenix carries them to safety and away from the Chamber of Secrets  Later Lockhart Ron  Harry looks up at Fawkes  Vapor rises from the wound and the torn flesh begins to heal  Ginny watches her eyes wide with amazement as the Phoenix weeps  The handsome bird lowers its head and its huge tears fall from its eyes onto Harry's arm  Dumbledore's Phoenix swoops down and settles beside Harry looking sadly at his face  she sits up and sees Harry who is clutching his arm in pain  Ginny suddenly wakes and looking confused  In a flash of light Riddle completely disintegrates leaving behind only a few faint sparks floating in the air  Harry closes the diary and stabs with all his might into the black leather cover  Raising the fang again  Harry stabs again and Riddle puts a hand to his face as the powerful light surges out of his body and lifts him off his feet  Riddle recoils as a light pierces the hole in his chest and blood spreads over the page  Harry grabs the diary and opens it then raises the basilisk's Poison Fang and stabs the diary  Beside the lifeless head of his enemy the basilisk Harry touches Ginny's hand and she is still clutching the diary "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Harry pulls up his trouser leg and shows Lucius his bad ankle  The door flies open and Lucius Malfoy strides in with Dobby at his heels  Sitting at the Gryffindor table  He gives him the diary and Lucius hands it to Dobby leaning close to Harry and giving a sneer before turning away  The handsome bird lowers its head and its huge tears fall from its eyes onto Harry's arm  Ginny suddenly wakes and looking confused  Neville looks around as Hermione stands in the doorway smiling  then Lucius pulls a wand from his stick and advances on Harry  Raising the fang again  they get to their feet as she runs down the hall to join her friends Beside the lifeless head of his enemy the basilisk Harry touches Ginny's hand and she is still clutching the diary  Dobby still holds the diary and finds the sock between the pages  Harry and Ginny cling to each other as the powerful Phoenix carries them to safety and away from the Chamber of Secrets  Lucius kicks Dobby down the stairs then hits him with a stick  In Dumbledore's study Ron and Harry look at each other in amazement and Ron leaves  Dobby stands between them and with a fix of his hand Lucius is hurtled backwards  Dumbledore's Phoenix swoops down and settles beside Harry looking sadly at his face  Ron and Harry are thrilled to see her grinning broadly  Riddle recoils as a light pierces the hole in his chest and blood spreads over the page  Filch stands by the door stroking his cat  Later everyone is gathered in the great hall and he floats between the tables  Harry nods thoughtfully at the silver sword takes it in both hands and reads the inscription on the blade  Later Lockhart Ron  Harry grabs the diary and opens it then raises the basilisk's Poison Fang and stabs the diary  she sits up and sees Harry who is clutching his arm in pain  Lucius walks towards Dumbledore and glares at Harry who glances at Dumbledore and holds up Tom Riddle's diary prompting Dumbledore to smile as he turns to Lucius  Harry smiles  The little elf folds his arms in triumph and then turns to walk away  Ginny watches her eyes wide with amazement as the Phoenix weeps  Harry stabs again and Riddle puts a hand to his face as the powerful light surges out of his body and lifts him off his feet  Vapor rises from the wound and the torn flesh begins to heal  Harry closes the diary and stabs with all his might into the black leather cover  In a flash of light Riddle completely disintegrates leaving behind only a few faint sparks floating in the air  Harry puts the sword down on the desk and looks at the black leather diary before catching up with Lucius in the corridor  Harry looks up at Fawkes "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The door flies open and Lucius Malfoy strides in with Dobby at his heels  Lucius walks towards Dumbledore and glares at Harry who glances at Dumbledore and holds up Tom Riddle's diary prompting Dumbledore to smile as he turns to Lucius  Lucius kicks Dobby down the stairs then hits him with a stick  Harry puts the sword down on the desk and looks at the black leather diary before catching up with Lucius in the corridor  He gives him the diary and Lucius hands it to Dobby leaning close to Harry and giving a sneer before turning away  Dobby still holds the diary and finds the sock between the pages  Harry pulls up his trouser leg and shows Lucius his bad ankle  then Lucius pulls a wand from his stick and advances on Harry  Dobby stands between them and with a fix of his hand Lucius is hurtled backwards  The little elf folds his arms in triumph and then turns to walk away  Harry smiles  Later everyone is gathered in the great hall and he floats between the tables  Filch stands by the door stroking his cat  Sitting at the Gryffindor table  Neville looks around as Hermione stands in the doorway smiling  Ron and Harry are thrilled to see her grinning broadly  they get to their feet as she runs down the hall to join her friends Beside the lifeless head of his enemy the basilisk Harry touches Ginny's hand and she is still clutching the diary  Harry grabs the diary and opens it then raises the basilisk's Poison Fang and stabs the diary  Riddle recoils as a light pierces the hole in his chest and blood spreads over the page  Harry stabs again and Riddle puts a hand to his face as the powerful light surges out of his body and lifts him off his feet  Raising the fang again  Harry closes the diary and stabs with all his might into the black leather cover  In a flash of light Riddle completely disintegrates leaving behind only a few faint sparks floating in the air  Ginny suddenly wakes and looking confused  she sits up and sees Harry who is clutching his arm in pain  Dumbledore's Phoenix swoops down and settles beside Harry looking sadly at his face  The handsome bird lowers its head and its huge tears fall from its eyes onto Harry's arm  Ginny watches her eyes wide with amazement as the Phoenix weeps  Vapor rises from the wound and the torn flesh begins to heal  Harry looks up at Fawkes  Later Lockhart Ron  Harry and Ginny cling to each other as the powerful Phoenix carries them to safety and away from the Chamber of Secrets  In Dumbledore's study Ron and Harry look at each other in amazement and Ron leaves  Harry nods thoughtfully at the silver sword takes it in both hands and reads the inscription on the blade "
        }
      ]
    }
  ]
}