{
  "ground_truth": "The car heads straight towards the ground as they both wrestle with the gear stick and Ron waves his wand desperately, but it snaps. The car heads towards an ancient willow tree standing in the school grounds and plunges onto the top branches. High in the tree, the car rocks precariously and falls backwards, getting stuck halfway down. Ron holds up his broken wand as hefty willow branches attack the car, causing the vehicle to rock and the windscreen to shatter. A branch smashes through the back window, and branches attack from all angles, showering them with broken glass. The car suddenly tips forward, bounces from branch to branch, and falls towards the ground, landing on the grass. Ron presses the accelerator and the car zooms away. The tree lunges after them, but they escape its clutching branches. Clear of the angry willow, the boys breathe a sigh of relief. Suddenly, the car doors fly open and they are hurled out onto the grass. The boot opens, throwing out their trunks and luggage. Harry catches Hedwig's cage, and Ron peers anxiously at his pet rat. The car starts, the doors shut, and the battered car drives itself across the grass towards a stone archway. Harry and Ron race after it as it rolls down a cobbled passageway and zooms away towards the forest, leaving Ron and Harry far behind. Later, they haul their luggage into school and leave it on the landing before running upstairs. Filch, the caretaker, with his cat Mrs. Norris, is standing at the top of the stairs. Hogwarts School is housed in a handsome castle surrounded by stone outbuildings and long Victorian greenhouses. In one of these, a class of students stands waiting around a long bench filled with rows of potted plants as a short, plump woman with curly, gray hair in a brown smock and a matching tall, pointed hat enters wearing a pair of earmuffs. The root looks like an ugly baby as they cover their ears. A boy collapses as they pull out the screaming roots. Showing off, Draco Malfoy pokes his finger into his Mandrake's mouth and it bites him; furious, he throws it into a pot. Later, in the corridor, the ghost of Sir Nicolas floats into the Great Hall where the students are sitting at long tables while Ron is trying unsuccessfully to mend his broken wand with sticky tape. A boy takes a photograph as a tatty gray owl flies down into the room, swooping low over the table towards Ron but colliding with a bowl and scattering crisps everywhere. Draco and his cronies snigger as Ron takes a red envelope from Errol's beak. Ron nervously breaks the seal on the red envelope, and to his embarrassment, it starts to scream at him.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The automobile moves directly towards the earth as they both grapple with the gear lever and Ron waves his staff frantically, but it breaks. The automobile moves towards an ancient willow standing in the school grounds and plunges onto the top boughs. High in the tree, the automobile sways precariously and falls backward, getting stuck midway down. Ron holds up his broken staff as hefty willow boughs attack the automobile, causing the vehicle to sway and the windshield to shatter. A bough smashes through the rear window, and boughs attack from all directions, showering them with shattered glass. The automobile suddenly tips forward, bounces from bough to bough, and falls towards the earth, landing on the grass. Ron presses the throttle and the automobile zooms away. The tree lunges after them, but they escape its clutching boughs. Clear of the angry willow, the boys breathe a sigh of relief. Suddenly, the automobile doors fly open and they are hurled out onto the grass. The trunk opens, ejecting their cases and baggage. Harry catches Hedwig's cage, and Ron peers anxiously at his pet rodent. The automobile starts, the doors shut, and the battered automobile drives itself across the grass towards a stone archway. Harry and Ron race after it as it rolls down a pebbled passageway and zooms away towards the forest, leaving Ron and Harry far behind. Later, they haul their baggage into school and leave it on the landing before running upstairs. Filch, the caretaker, with his feline Mrs. Norris, is standing at the top of the stairs. Hogwarts School is housed in a handsome fortress surrounded by stone outbuildings and long Victorian greenhouses. In one of these, a class of pupils stands waiting around a long bench filled with rows of potted flora as a short, plump woman with curly, gray hair in a brown smock and a matching tall, pointed hat enters wearing a pair of earmuffs. The root looks like an ugly infant as they cover their ears. A boy collapses as they pull out the wailing roots. Showing off, Draco Malfoy pokes his finger into his Mandrake's mouth and it bites him; furious, he throws it into a pot. Later, in the corridor, the ghost of Sir Nicolas floats into the Great Hall where the pupils are sitting at long tables while Ron is trying unsuccessfully to mend his broken staff with adhesive tape. A boy takes a photograph as a tatty gray owl flies down into the room, swooping low over the table towards Ron but colliding with a bowl and scattering crisps everywhere. Draco and his cronies snigger as Ron takes a red envelope from Errol's beak. Ron nervously breaks the seal on the red envelope, and to his embarrassment, it starts to shriek at him."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The ground is headed straight towards by the car as the gear stick is wrestled with by them both, and Ron's wand is waved desperately by him, but it snaps. An ancient willow tree standing in the school grounds is headed towards by the car, and the top branches are plunged onto. The car is rocked precariously high in the tree and halfway down it becomes stuck as Ron's broken wand is held up by him. The car is attacked by hefty willow branches, causing it to be rocked and the windscreen to shatter. The back window is smashed through by a branch, and they are showered with broken glass as branches attack from all angles. Forward, the car suddenly tips, bounces from branch to branch, and the ground is landed on by it, falling towards the grass. The accelerator is pressed by Ron, and the car is zoomed away. After them, the tree lunges, but its clutching branches are escaped. A sigh of relief is breathed by the boys, clear of the angry willow. Suddenly, they are hurled out onto the grass as the car doors fly open. Their trunks and luggage are thrown out as the boot opens. Hedwig's cage is caught by Harry, and his pet rat is peered at anxiously by Ron. The car starts itself, the doors are shut, and across the grass towards a stone archway, the battered car drives. Harry and Ron race after it as a cobbled passageway is rolled down by it, zooming away towards the forest, leaving far behind Ron and Harry. Later, their luggage is hauled into school and left on the landing by them before upstairs is run to. At the top of the stairs, Filch, the caretaker, is standing with his cat Mrs. Norris. A handsome castle houses Hogwarts School which is surrounded by stone outbuildings and long Victorian greenhouses. In one of these, a class of students stands waiting around a long bench filled with rows of potted plants as a short, plump woman with curly, gray hair in a brown smock and a matching tall, pointed hat enters wearing a pair of earmuffs. The root is looked like an ugly baby by them as their ears are covered. They pull out the screaming roots and a boy collapses. Draco Malfoy shows off and pokes his finger into his Mandrake's mouth and it bites him; furious, he throws it into a pot. Later, in the corridor, the Great Hall is floated into by the ghost of Sir Nicolas where the students are sitting at long tables, while a broken wand is unsuccessfully tried to be mended by Ron with sticky tape. As a tatty gray owl flies down into the room, a photograph is taken by a boy, with it swooping low over the table towards Ron but colliding with a bowl and scattering crisps everywhere. Draco and his cronies snigger as Errol's beak presents Ron with a red envelope. To his embarrassment, Ron nervously breaks the seal on the red envelope, and it starts to scream at him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The car plunges toward the ground as they wrestle with the gear stick and Ron waves his wand, which snaps. It heads toward an ancient willow tree in the school grounds and crashes into the top branches. The car gets stuck, and Ron shows his broken wand as heavy branches attack, shattering the windscreen. A branch smashes the back window, and glass showers them. The car bounces between branches and lands on the grass. Ron accelerates, escaping the clutches of the willow. Safely away, they breathe a sigh of relief, but the car doors fling open, hurling them onto the grass, with luggage spilling out. Harry catches Hedwig's cage, and Ron checks on his pet rat. The car starts, doors shut, and it drives toward a stone archway. Harry and Ron chase it as it rolls down a passageway and disappears into the forest. Later, they bring their luggage to school and run upstairs. Filch, the caretaker, with his cat Mrs. Norris, stands at the stair top. Hogwarts is housed in a castle with stone outbuildings and Victorian greenhouses. In one, students wait around a bench of potted plants as a short, plump woman in a brown smock and hat enters wearing earmuffs. The root resembles an ugly baby as they cover their ears. A boy collapses when they pull out the screaming roots. Showing off, Draco Malfoy pokes his Mandrake's mouth, gets bitten, and angrily throws it into a pot. Later, Sir Nicolas's ghost floats into the Great Hall where students sit at tables as Ron tries to fix his wand with tape. A boy photographs a tatty gray owl flying into the room, colliding with a bowl and scattering crisps. Draco and his friends snigger as Ron takes a red envelope from Errol's beak. Nervously, Ron breaks the seal, and it screams at him."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The car plunges toward the ground as they wrestle with the gear stick. Ron waves his wand, but it snaps. The car hits an ancient willow tree, rocking precariously before getting stuck. Ron shows his broken wand as the willow attacks, shattering the windscreen. A branch smashes the back window, and the car bounces to the ground. Ron accelerates, escaping the tree's grasp. The boys breathe in relief, but the car ejects them and their luggage. Harry catches Hedwig's cage, and Ron checks his rat. The car drives off toward the forest, leaving them behind. Later, they haul their luggage into school, where Filch and Mrs. Norris await. Hogwarts, a castle with outbuildings and greenhouses, hosts a class with a woman in earmuffs showing students screaming roots. Draco Malfoy gets bitten by his Mandrake and angrily throws it. In the corridor, Sir Nicolas enters the Great Hall as Ron fails to fix his wand. An owl collides with a bowl, scattering crisps, while Draco sniggers. Ron nervously breaks open a screaming red envelope."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The car is on a direct collision course with the ground as both individuals, with considerable urgency, grapple with the gear stick. Meanwhile, Ron frantically waves his wand in desperation, only to have it snap tragically. The vehicle heads straight towards an ancient willow tree, which stands majestically within the school grounds, and soon crashes onto the topmost branches with alarming speed. Perched high up in the tree, the car rocks precariously, teetering at a dangerous angle, and eventually tumbles backward, becoming lodged partway down. Ron helplessly holds up his broken wand as the thick, powerful branches of the willow violently assault the car, causing it to sway back and forth while the windscreen shatters dramatically. A branch smashes through the rear window, and branches assault them relentlessly from every direction, showering them with shards of broken glass. Suddenly, the car tips forward unexpectedly, bouncing erratically from one branch to the next, and plummets towards the ground below, finally landing on the grass with a thud. Ron quickly presses the accelerator pedal, and the car zooms away in a frantic retreat. The tree lunges after them with its grasping branches, but they manage to evade its clutches. As soon as they clear the reach of the furious willow, the boys breathe a huge sigh of relief. Out of nowhere, the car doors fling open violently, and they are thrown unceremoniously onto the grass. The boot of the car pops open, ejecting their trunks and assorted luggage onto the ground. Harry swiftly catches Hedwig's cage in time, and Ron anxiously checks on his pet rat. Without warning, the car starts itself up again, the doors slam shut, and the battered vehicle drives away independently, navigating across the grass towards a stone archway. Both Harry and Ron sprint after it, but the car rolls down a cobbled passageway, zooming off towards the forest, leaving them far behind. Later on, they laboriously haul their luggage into the school and abandon it temporarily on the landing before dashing upstairs. At the top of the stairs, they encounter Filch, the caretaker, who stands firmly with his ever-present cat, Mrs. Norris. Hogwarts School is magnificently housed within a grand castle, surrounded by sturdy stone outbuildings and extensive Victorian greenhouses. Inside one of these greenhouses, a class of students stands expectantly around a long bench filled with numerous rows of potted plants. A short, plump woman with curly, gray hair enters, clad in a brown smock and a matching tall, pointed hat, and is wearing a pair of earmuffs. The root resembles an ugly baby as the students quickly cover their ears. A boy faints as they pull out the screaming roots. Showing off, Draco Malfoy pokes his finger recklessly into his Mandrake's mouth, which promptly bites him; infuriated, he hurls it into a pot. Later, in the corridor, the ghost of Sir Nicolas floats serenely into the Great Hall, where students are seated at long tables, while Ron is engaged in a futile attempt to mend his broken wand using sticky tape. A boy snaps a photograph as a shabby gray owl swoops into the room, gliding low over the table towards Ron but colliding noisily with a bowl, scattering crisps everywhere. Draco and his cronies snicker as Ron receives a red envelope from Errol's beak with mounting unease. Ron hesitantly breaks the seal on the ominous red envelope, only for it to begin screaming at him, much to his profound embarrassment."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The car is careening on a direct and perilous collision course with the unforgiving ground as both individuals, filled with considerable urgency and a sense of impending doom, grapple desperately with the uncooperative gear stick. Meanwhile, Ron, in a fit of frantic determination, waves his wand with all the desperation he can muster, only to have it snap in two, tragically rendering it useless. The vehicle, inexorably, heads straight towards an ancient willow tree, a towering, majestic presence that stands with authority within the expansive school grounds, and soon crashes into the topmost branches with alarming and frightening speed. Perched precariously high up in the sturdy tree, the car rocks dangerously, teetering at a perilously unstable angle, and eventually tumbles backwards, becoming lodged insecurely partway down. Ron helplessly holds up his now broken wand as the thick, powerful branches of the willow savagely assault the car, causing it to sway chaotically from side to side while the windshield shatters dramatically. A large branch smashes forcefully through the rear window, and branches assault them relentlessly from every direction, showering them with harsh shards of broken glass. Suddenly, the car tips forward unexpectedly, bouncing erratically from one branch to the next in a wild descent, and plummets towards the ground below, finally landing with a dull thud on the grass. Ron instinctively presses the accelerator pedal with urgency, and the car zooms away in a frantic retreat. The tree lunges after them with its grasping, vengeful branches, but they miraculously manage to evade its fierce clutches. As soon as they clear the menacing reach of the furious willow, the two boys breathe a huge sigh of relief. Out of nowhere, the car doors fling open violently, and they are thrown unceremoniously down onto the grass. The boot of the car pops open with a sudden jolt, ejecting their trunks and assorted luggage onto the ground in a scattered heap. Harry swiftly catches Hedwig's cage just in time, and Ron anxiously checks on the well-being of his pet rat. Without any warning, the car starts itself up again, the doors slamming shut with finality, and the battered vehicle drives away independently, navigating across the grass towards a nearby stone archway. Both Harry and Ron sprint after it in a vain attempt to catch up, but the car rolls confidently down a cobbled passageway, zooming off into the distance towards the forest, leaving them far behind. Later on, they laboriously haul their scattered luggage all the way into the grand school and abandon it temporarily on the landing before hurriedly dashing upstairs. At the top of the stairs, they unexpectedly encounter Filch, the ever-vigilant caretaker, who stands firmly with his ever-present, watchful cat, Mrs. Norris. Hogwarts School is magnificently housed within a grand and historic castle, surrounded by sturdy stone outbuildings and extensive, sprawling Victorian greenhouses. Inside one of these fascinating greenhouses, a class of eager students stands expectantly around a long wooden bench filled with numerous rows of potted plants. A short, plump woman with curly salt-and-pepper gray hair enters, clad in a practical brown smock and a matching tall, pointed hat, and wears a pair of fluffy earmuffs. The root resembles an ugly, squalling baby as the students quickly cover their ears in anticipation. A boy faints dramatically as they pull out the obnoxiously screaming roots. Showing off recklessly, Draco Malfoy pokes his finger carelessly into his Mandrake's mouth, which promptly bites him; infuriated, he hurls it into a pot with annoyance. Later on, in the bustling corridor, the dignified ghost of Sir Nicolas floats serenely and effortlessly into the magnificent Great Hall, where students are seated at long wooden tables, while Ron is engaged in a futile attempt to mend his broken wand using sticky tape. A boy snaps a photograph as a shabby-looking gray owl swoops into the grand room, gliding low over the table towards Ron but colliding noisily with a bowl, sending crisps flying everywhere. Draco and his cronies snicker mockingly as Ron receives a foreboding red envelope from Errol's beak with mounting unease. Ron hesitantly breaks the seal on the ominous red envelope, only for it to begin screaming at him loudly, much to his profound embarrassment and dismay."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The car barrels straight towards the ground while the two passengers inside struggle with the gear stick, their hands colliding as they desperately attempt to regain control of the vehicle. Amidst the chaos, Ron frantically waves his wand, attempting to cast a spell, but to his horror, the wand snaps in two. The car, now uncontrollable, speeds directly towards an ancient willow tree that looms ominously in the school grounds. With a sudden jolt, the car crashes into the top branches of the towering tree. High above the ground, the vehicle sways dangerously and begins to tilt backward, ultimately getting stuck precariously halfway down the tree. As the car rocks, Ron holds up his broken wand in disbelief while the thick branches of the willow furiously attack the car, causing it to shudder violently. The onslaught is relentless, and a massive branch smashes through the back window, sending shards of glass raining down upon them. The branches continue their assault from every side, further showering the interior with broken glass. Without warning, the car jerks forward, slipping off the branches, and bounces from branch to branch until it finally plummets toward the ground, landing with a thud on the grass. Reacting quickly, Ron slams his foot on the accelerator, and the car speeds away, narrowly escaping the grasping branches of the infuriated willow. Now clear of the tree's reach, the boys exhale in relief. But their respite is short-lived, as the car doors suddenly burst open and they are violently ejected onto the grass. The boot pops open, expelling their trunks and luggage in a flurry. Amidst the chaos, Harry manages to catch Hedwig's cage, while Ron gazes anxiously at his pet rat. Almost as if alive, the car starts up again, snapping its doors shut with determination, and drives itself purposefully across the grass, heading toward a stone archway. In a rush, Harry and Ron sprint after the car as it rolls down a cobbled passageway, zooming away toward the forest, leaving them far behind. Later, they laboriously haul their baggage into the school and deposit it on the landing before dashing up the stairs. At the top, they are greeted by the stern figure of Filch, the caretaker, accompanied by his ever-present cat, Mrs. Norris. The majestic Hogwarts School is nestled within a grand castle surrounded by stone outbuildings and extensive Victorian greenhouses. Within one of these greenhouses, a class of students clusters around a long bench brimming with rows of potted plants as a short, plump woman with curly, gray hair makes her entrance. Clad in a brown smock and a matching tall, pointed hat, she dons a pair of earmuffs, signaling an intriguing lesson ahead. Unveiling a peculiar plant, the root reveals itself to resemble a grotesque baby, prompting everyone to cover their ears in anticipation. As they extract the wailing roots, a boy succumbs to the overwhelming sound and collapses. Meanwhile, Draco Malfoy, seeking to impress, recklessly prods his Mandrake's mouth, only to be bitten savagely. Infuriated, he hurls the creature back into its pot with disdain. Later, in the corridor, the ghost of Sir Nicolas glides elegantly into the Great Hall, where students dine at long tables. Ron, oblivious to the commotion, struggles to repair his broken wand using sticky tape. Suddenly, a tatty gray owl swoops into the room, diving low over the tables and colliding with a bowl, sending crisps scattering in all directions. As Draco and his cronies laugh mockingly, Ron retrieves a red envelope from Errol's beak, his face flushed with apprehension. With trembling hands, Ron breaks the seal on the red envelope, and to his mortification, it erupts into a loud, scolding screech."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The car plummets toward the ground as they struggle with the gear stick and Ron's wand snaps. It crashes into an ancient willow tree, lodging in its branches. As Ron displays his broken wand, the tree's branches assault the car, shattering the windscreen and back window. The car tips forward, bouncing off branches before landing on the grass. Ron accelerates, narrowly escaping the tree's grasp. Relieved, the boys are suddenly ejected from the car as it spits out their trunks and luggage. Harry catches Hedwig's cage, while Ron checks on his pet rat. The car then drives itself away, leaving them to chase after it. Later, they haul their luggage into the school and leave it on a landing before rushing upstairs. At the top of the stairs, Filch, the caretaker, stands with his cat, Mrs. Norris. Hogwarts is a grand castle with stone outbuildings and Victorian greenhouses. In one greenhouse, a class awaits beside rows of potted plants as a plump woman with earmuffs enters. They cover their ears as the Mandrakes are uprooted, looking like ugly babies, causing a boy to faint. Draco Malfoy, showing off, pokes his Mandrake, which bites him, prompting him to angrily throw it into a pot. Later, in the corridor, the ghost Sir Nicolas enters the Great Hall where students dine, and Ron tries in vain to mend his broken wand. A boy snaps a photo as a tatty gray owl swoops over the table, scattering crisps as it delivers a red envelope to Ron. Draco and his cronies snigger as Ron nervously opens it, revealing a screaming message."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The car, a magical Ford Anglia that was enchanted to fly by the boys' family, heads straight towards the ground as they both wrestle with the gear stick and Ron, who has just started his second year at Hogwarts School of Witchcraft and Wizardry, waves his wand desperately, but it snaps, rendering it useless for spells. The car heads towards an ancient willow tree known as the Whomping Willow, a notoriously aggressive plant standing in the school grounds, and plunges onto the top branches. High in the tree, which was planted to guard a secret passage, the car rocks precariously and falls backwards, getting stuck halfway down. Ron holds up his broken wand as hefty willow branches, which move with a mind of their own, attack the car, causing the vehicle to rock and the windscreen to shatter. A branch smashes through the back window, and branches attack from all angles, showering them with broken glass. The car suddenly tips forward, bounces from branch to branch, and falls towards the ground, landing on the grass in the expansive grounds of Hogwarts. Ron presses the accelerator and the car zooms away, its enchantments still intact. The tree lunges after them, but they escape its clutching branches. Clear of the angry willow which continues to thrash wildly, the boys breathe a sigh of relief. Suddenly, the car doors fly open and they are hurled out onto the grass. The boot opens, throwing out their trunks and luggage, which are filled with wizarding robes and other magical supplies. Harry, whose full name is Harry Potter and is famous in the wizarding world for surviving an attack by the dark wizard Voldemort as a baby, catches Hedwig's cage, and Ron peers anxiously at his pet rat, Scabbers, who hides nervously in his pocket. The car starts, the doors shut, and the battered car drives itself across the grass towards a stone archway leading away from the school grounds. Harry and Ron race after it as it rolls down a cobbled passageway and zooms away towards the Forbidden Forest, leaving Ron and Harry far behind to watch it disappear among the dense, enchanted trees. Later, they haul their luggage into Hogwarts School, famous for its seven floors and numerous hidden passages, and leave it on the landing before running upstairs. Filch, the caretaker known for his dislike of students, with his cat Mrs. Norris, who is remarkably perceptive, is standing at the top of the stairs. Hogwarts School is housed in a handsome castle surrounded by stone outbuildings and long Victorian greenhouses where students learn Herbology. In one of these, a class of students stands waiting around a long bench filled with rows of potted plants as a short, plump woman with curly, gray hair, Professor Sprout, the Herbology teacher, enters wearing a pair of earmuffs. The root, a Mandrake used for its restorative properties, looks like an ugly baby as they cover their ears to protect from its fatal cry. A boy collapses as they pull out the screaming roots. Showing off, Draco Malfoy, the son of a wealthy and influential family, pokes his finger into his Mandrake's mouth and it bites him; furious, he throws it into a pot. Later, in the corridor, the ghost of Sir Nicolas, who is also known as Nearly Headless Nick due to his partially severed neck, floats into the Great Hall where the students are sitting at long tables while Ron is trying unsuccessfully to mend his broken wand with sticky tape, which is not effective for magical repairs. A boy takes a photograph as a tatty gray owl flies down into the room, swooping low over the table towards Ron but colliding with a bowl and scattering crisps everywhere. Draco and his cronies, members of Slytherin House known for their rivalry with Ron's house, Gryffindor, snigger as Ron takes a red envelope known as a Howler from Errol's beak. Ron nervously breaks the seal on the red envelope, and to his embarrassment, it starts to scream at him, echoing around the hall and drawing everyone's attention."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "High in the tree the car rocks precariously and falls backwards getting stuck halfway down The car heads straight towards the ground as they both wrestle with the gear stick and Ron waves his wand desperately but it snaps Clear of the angry willow the boys breathe a sigh of relief The car heads towards an ancient willow tree standing in the school grounds and plunges onto the top branches A boy collapses as they pull out the screaming roots High in the tree the car rocks precariously and falls backwards getting stuck halfway down Ron holds up his broken wand as hefty willow branches attack the car causing the vehicle to rock and the windscreen to shatter A branch smashes through the back window and branches attack from all angles showering them with broken glass Ron holds up his broken wand as hefty willow branches attack the car causing the vehicle to rock and the windscreen to shatter The car heads straight towards the ground as they both wrestle with the gear stick and Ron waves his wand desperately but it snaps Harry and Ron race after it as it rolls down a cobbled passageway and zooms away towards the forest leaving Ron and Harry far behind The car suddenly tips forward bounces from branch to branch and falls towards the ground landing on the grass Ron presses the accelerator and the car zooms away The tree lunges after them but they escape its clutching branches The tree lunges after them but they escape its clutching branches Clear of the angry willow the boys breathe a sigh of relief A branch smashes through the back window and branches attack from all angles showering them with broken glass Suddenly the car doors fly open and they are hurled out onto the grass The boot opens throwing out their trunks and luggage Hogwarts School is housed in a handsome castle surrounded by stone outbuildings and long Victorian greenhouses Harry catches Hedwig's cage and Ron peers anxiously at his pet rat Later they haul their luggage into school and leave it on the landing before running upstairs The car starts the doors shut and the battered car drives itself across the grass towards a stone archway Later in the corridor the ghost of Sir Nicolas floats into the Great Hall where the students are sitting at long tables while Ron is trying unsuccessfully to mend his broken wand with sticky tape Harry and Ron race after it as it rolls down a cobbled passageway and zooms away towards the forest leaving Ron and Harry far behind Later they haul their luggage into school and leave it on the landing before running upstairs Filch the caretaker with his cat Mrs Norris is standing at the top of the stairs A boy takes a photograph as a tatty gray owl flies down into the room swooping low over the table towards Ron but colliding with a bowl and scattering crisps everywhere Hogwarts School is housed in a handsome castle surrounded by stone outbuildings and long Victorian greenhouses In one of these a class of students stands waiting around a long bench filled with rows of potted plants as a short plump woman with curly gray hair in a brown smock and a matching tall pointed hat enters wearing a pair of earmuffs The root looks like an ugly baby as they cover their ears Showing off Draco Malfoy pokes his finger into his Mandrake's mouth and it bites him furious Draco and his cronies snigger as Ron takes a red envelope from Errol's beak A boy collapses as they pull out the screaming roots Showing off Draco Malfoy pokes his finger into his Mandrake's mouth and it bites him furious he throws it into a pot Later in the corridor the ghost of Sir Nicolas floats into the Great Hall where the students are sitting at long tables while Ron is trying unsuccessfully to mend his broken wand with sticky tape A boy takes a photograph as a tatty gray owl flies down into the room swooping low over the table towards Ron but colliding with a bowl and scattering crisps everywhere Draco and his cronies snigger as Ron takes a red envelope from Errol's beak Ron nervously breaks the seal on the red envelope and to his embarrassment it starts to scream at him"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The car heads straight towards the ground as they both wrestle with the gear stick and Ron waves his wand desperately but it snaps. The car heads towards an ancient willow tree standing in the school grounds and plunges onto the top branches. High in the tree the car rocks precariously and falls backwards getting stuck halfway down. Ron holds up his broken wand as hefty willow branches attack the car causing the vehicle to rock and the windscreen to shatter. A branch smashes through the back window and branches attack from all angles showering them with broken glass. The car suddenly tips forward bounces from branch to branch and falls towards the ground landing on the grass. Ron presses the accelerator and the car zooms away. The tree lunges after them but they escape its clutching branches. Clear of the angry willow the boys breathe a sigh of relief. Suddenly the car doors fly open and they are hurled out onto the grass. The boot opens throwing out their trunks and luggage. Harry catches Hedwig's cage and Ron peers anxiously at his pet rat. The car starts the doors shut and the battered car drives itself across the grass towards a stone archway. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Harry and Ron race after it as it rolls down a cobbled passageway and zooms away towards the forest leaving Ron and Harry far behind. Later they haul their luggage into school and leave it on the landing before running upstairs. Filch the caretaker with his cat. Mrs Norris is standing at the top of the stairs. Hogwarts School is housed in a handsome castle surrounded by stone outbuildings and long Victorian greenhouses. In one of these a class of students stands waiting around a long bench filled with rows of potted plants as a short plump woman with curly gray hair in a brown smock and a matching tall pointed hat enters wearing a pair of earmuffs. The root looks like an ugly baby as they cover their ears. A boy collapses as they pull out the screaming roots. Showing off Draco Malfoy pokes his finger into his Mandrake's mouth and it bites him furious. he throws it into a pot. Later in the corridor the ghost of Sir Nicolas floats into the Great Hall where the students are sitting at long tables while Ron is trying unsuccessfully to mend his broken wand with sticky tape. A boy takes a photograph as a tatty gray owl flies down into the room swooping low over the table towards Ron but colliding with a bowl and scattering crisps everywhere. Draco and his cronies snigger as Ron takes a red envelope from Errol's beak. Ron nervously breaks the seal on the red envelope and to his embarrassment it starts to scream at him."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The car heads straight towards the ground as they both wrestle with the gear stick and Ron waves his wand desperately but it snaps. The car heads towards an ancient willow tree standing in the school grounds and plunges onto the top branches. High in the tree the car rocks precariously and falls backwards getting stuck halfway down. Ron holds up his broken wand as hefty willow branches attack the car causing the vehicle to rock and the windscreen to shatter. A branch smashes through the back window and branches attack from all angles showering them with broken glass. The car suddenly tips forward bounces from branch to branch and falls towards the ground landing on the grass. Ron presses the accelerator and the car zooms away. The tree lunges after them but they escape its clutching branches. Clear of the angry willow the boys breathe a sigh of relief. Suddenly the car doors fly open and they are hurled out onto the grass. The boot opens throwing out their trunks and luggage. Harry catches Hedwig's cage and Ron peers anxiously at his pet rat. The car starts the doors shut and the battered car drives itself across the grass towards a stone archway. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. Harry and Ron race after it as it rolls down a cobbled passageway and zooms away towards the forest leaving Ron and Harry far behind. Later they haul their luggage into school and leave it on the landing before running upstairs. Filch the caretaker with his cat. Mrs Norris is standing at the top of the stairs. Hogwarts School is housed in a handsome castle surrounded by stone outbuildings and long Victorian greenhouses. In one of these a class of students stands waiting around a long bench filled with rows of potted plants as a short plump woman with curly gray hair in a brown smock and a matching tall pointed hat enters wearing a pair of earmuffs. The root looks like an ugly baby as they cover their ears. A boy collapses as they pull out the screaming roots. Showing off Draco Malfoy pokes his finger into his Mandrake's mouth and it bites him furious. he throws it into a pot. Later in the corridor the ghost of Sir Nicolas floats into the Great Hall where the students are sitting at long tables while Ron is trying unsuccessfully to mend his broken wand with sticky tape. A boy takes a photograph as a tatty gray owl flies down into the room swooping low over the table towards Ron but colliding with a bowl and scattering crisps everywhere. Draco and his cronies snigger as Ron takes a red envelope from Errol's beak. Ron nervously breaks the seal on the red envelope and to his embarrassment it starts to scream at him."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The car heads straight towards the ground as they both wrestle with the gear stick and Ron waves his wand desperately but it snaps. The car heads towards an ancient willow tree standing in the school grounds and plunges onto the top branches. High in the tree the car rocks precariously and falls backwards getting stuck halfway down. Ron holds up his broken wand as hefty willow branches attack the car causing the vehicle to rock and the windscreen to shatter. A branch smashes through the back window and branches attack from all angles showering them with broken glass. The car suddenly tips forward bounces from branch to branch and falls towards the ground landing on the grass. Ron presses the accelerator and the car zooms away. A boy collapses as they pull out the screaming roots. Showing off Draco Malfoy pokes his finger into his Mandrake's mouth and it bites him furious. he throws it into a pot. Later in the corridor the ghost of Sir Nicolas floats into the Great Hall where the students are sitting at long tables while Ron is trying unsuccessfully to mend his broken wand with sticky tape. A boy takes a photograph as a tatty gray owl flies down into the room swooping low over the table towards Ron but colliding with a bowl and scattering crisps everywhere. Draco and his cronies snigger as Ron takes a red envelope from Errol's beak. Ron nervously breaks the seal on the red envelope and to his embarrassment it starts to scream at him."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The car heads straight towards the ground as they both wrestle with the gear stick and Ron waves his wand desperately but it snaps. The car heads towards an ancient willow tree standing in the school grounds and plunges onto the top branches. High in the tree the car rocks precariously and falls backwards getting stuck halfway down. A boy takes a photograph as a tatty gray owl flies down into the room swooping low over the table towards Ron but colliding with a bowl and scattering crisps everywhere. Draco and his cronies snigger as Ron takes a red envelope from Errol's beak. Ron nervously breaks the seal on the red envelope and to his embarrassment it starts to scream at him."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The bicycle heads straight towards the ground as the giraffe wrestles with the gear stick and the squirrel waves its wand desperately, but it snaps. The bicycle heads towards an ancient willow tree standing in the school grounds and plunges onto the top branches. High in the tree, the bicycle rocks precariously and falls backwards, getting stuck halfway down. The squirrel holds up its broken wand as hefty willow branches attack the bicycle, causing the vehicle to rock and the windscreen to shatter. A branch smashes through the back window, and branches attack from all angles, showering the giraffe with broken glass. The bicycle suddenly tips forward, bounces from branch to branch, and falls towards the ground, landing on the grass. The squirrel presses the accelerator and the bicycle zooms away. The tree lunges after the giraffe, but the giraffe escapes its clutching branches. Clear of the angry willow, the penguins breathe a sigh of relief. Suddenly, the bicycle doors fly open and the penguins are hurled out onto the grass. The boot opens, throwing out the penguins' trunks and luggage. The elephant catches Hedwig's cage, and the squirrel peers anxiously at its pet rat. The bicycle starts, the doors shut, and the battered bicycle drives itself across the grass towards a stone archway. The elephant and the squirrel race after it as it rolls down a cobbled passageway and zooms away towards the forest, leaving the squirrel and the elephant far behind. Later, the penguins haul their luggage into school and leave it on the landing before running upstairs. The zebra, the caretaker, with its cat Mrs. Norris, is standing at the top of the stairs. Hogwarts School is housed in a handsome castle surrounded by stone outbuildings and long Victorian greenhouses. In one of these, a class of robots stands waiting around a long bench filled with rows of potted plants as a short, plump dog with curly, gray hair in a brown smock and a matching tall, pointed hat enters wearing a pair of earmuffs. The root looks like an ugly baby as the robots cover their ears. A bear collapses as the robots pull out the screaming roots. Showing off, the fox pokes its finger into its Mandrake's mouth and it bites the fox; furious, the fox throws it into a pot. Later, in the corridor, the ghost of Sir Nicolas floats into the Great Hall where the robots are sitting at long tables while the squirrel is trying unsuccessfully to mend its broken wand with sticky tape. A mouse takes a photograph as a tatty gray owl flies down into the room, swooping low over the table towards the squirrel but colliding with a bowl and scattering crisps everywhere. The fox and its cronies snigger as the squirrel takes a red envelope from Errol's beak. The squirrel nervously breaks the seal on the red envelope, and to its embarrassment, it starts to scream at the squirrel."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The helicopter heads straight towards the hill as they both wrestle with the joystick and Ron waves his broom desperately, but it snaps. The helicopter heads towards an ancient pine tree standing in the park grounds and plunges onto the top branches. High in the tree, the helicopter rocks precariously and falls backwards, getting stuck halfway down. Ron holds up his broken broom as hefty pine branches attack the helicopter, causing the rotor to rock and the windshield to shatter. A branch smashes through the tail rotor, and branches attack from all angles, showering them with splintered glass. The helicopter suddenly tips forward, bounces from branch to branch, and falls towards the ground, landing on the sand. Ron presses the throttle and the helicopter zooms away. The tree lunges after them, but they escape its clutching branches. Clear of the angry pine, the boys breathe a sigh of relief. Suddenly, the helicopter doors fly open and they are hurled out onto the sand. The cargo hold opens, throwing out their bags and suitcases. Harry catches Hedwig's cage, and Ron peers anxiously at his pet lizard. The helicopter starts, the doors shut, and the battered helicopter flies itself across the sand towards an iron archway. Harry and Ron race after it as it rolls down a paved walkway and zooms away towards the canyon, leaving Ron and Harry far behind. Later, they haul their suitcases into school and leave it on the veranda before running upstairs. Filch, the caretaker, with his dog Mrs. Norris, is standing at the top of the stairs. Hogwarts School is housed in a grand mansion surrounded by wooden outbuildings and long Victorian gazebos. In one of these, a class of students stands waiting around a long table filled with rows of potted flowers as a short, plump woman with curly, gray hair in a green smock and a matching tall, pointed hat enters wearing a pair of goggles. The extract looks like an ugly baby as they cover their eyes. A boy collapses as they pull out the shrieking shoots. Showing off, Draco Malfoy pokes his finger into his Mandrake's nostril and it bites him; furious, he throws it into a barrel. Later, in the corridor, the ghost of Sir Nicolas floats into the Great Hall where the students are sitting at long benches while Ron is trying unsuccessfully to mend his broken broom with sticky tape. A boy takes a photograph as a tatty gray pigeon flies down into the room, swooping low over the bench towards Ron but colliding with a jug and scattering peanuts everywhere. Draco and his cronies snigger as Ron takes a red envelope from Errol's beak. Ron nervously breaks the seal on the red envelope, and to his embarrassment, it starts to scream at him."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The car drifts straight towards the sky as they both dance with the gear stick and Ron twirls his wand cautiously, but it evaporates. The car veers towards an ancient willow tree standing in the school grounds and hops onto the top branches. High in the tree, the car sways precariously and spins backwards, getting lodged halfway up. Ron brandishes his broken wand as hefty willow branches hug the car, causing the vehicle to sway and the windscreen to crumple. A branch slides through the back window, and branches hug from all angles, showering them with sparkling glass. The car suddenly leaps forward, skips from branch to branch, and drifts towards the ground, landing on the grass. Ron taps the accelerator and the car floats away. The tree dives after them, but they evade its clutching branches. Clear of the agitated willow, the boys exhale a sigh of relief. Suddenly, the car doors burst open and they are lifted out onto the grass. The boot yawns, tossing out their trunks and luggage. Harry grabs Hedwig's cage, and Ron gazes anxiously at his pet rat. The car revs, the doors snap shut, and the battered car rolls itself across the grass towards a stone archway. Harry and Ron chase after it as it slides down a cobbled passageway and glides away towards the forest, leaving Ron and Harry far behind. Later, they drag their luggage into school and leave it on the landing before running downstairs. Filch, the caretaker, with his cat Mrs. Norris, is standing at the base of the stairs. Hogwarts School is housed in a picturesque castle surrounded by stone outbuildings and long Victorian greenhouses. In one of these, a class of students sits waiting around a long bench filled with rows of potted plants as a short, plump woman with curly, gray hair in a brown smock and a matching tall, pointed hat enters juggling a pair of earmuffs. The root resembles an ugly baby as they uncover their ears. A boy laughs as they push in the giggling roots. Showing off, Draco Malfoy taps his finger against his Mandrake's mouth and it kisses him; furious, he tosses it into a pot. Later, in the corridor, the ghost of Sir Nicolas glides into the Great Hall where the students are lounging at long tables while Ron is trying unsuccessfully to mend his broken wand with string. A boy sketches a photograph as a tatty gray owl drifts into the room, floating low over the table towards Ron but tripping with a bowl and scattering crisps everywhere. Draco and his cronies chuckle as Ron takes a red envelope from Errol's beak. Ron nervously tears the seal on the red envelope, and to his embarrassment, it starts to laugh at him."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The trampoline heads straight towards the bicycle as they both wrestle with the snow globe and Alex waves his umbrella desperately, but it snaps. The trampoline heads towards an ancient sunflower standing in the museum grounds and plunges onto the top branches. High in the sunflower, the trampoline rocks precariously and falls backwards, getting stuck halfway down. Alex holds up his broken umbrella as hefty sunflower branches attack the trampoline, causing the hammock to rock and the windowpane to shatter. A branch smashes through the back window, and branches attack from all angles, showering them with broken soil. The trampoline suddenly tips forward, bounces from branch to branch, and falls towards the ground, landing on the blanket. Alex presses the balalaika and the trampoline zooms away. The sunflower lunges after them, but they escape its clutching branches. Clear of the angry sunflower, the teapots breathe a sigh of relief. Suddenly, the trampoline doors fly open and they are hurled out onto the blanket. The shoebox opens, throwing out their hats and clocks. Tom catches Luna's scarf, and Alex peers anxiously at his pet frog. The trampoline starts, the doors shut, and the battered trampoline drives itself across the blanket towards a stone monument. Tom and Alex race after it as it rolls down a cobbled passageway and zooms away towards the canyon, leaving Alex and Tom far behind. Later, they haul their clocks into museum and leave it on the landing before running upstairs. Morton, the caretaker, with his dog Mrs. Fluffy, is standing at the top of the stairs. Neverland Academy is housed in a handsome cathedral surrounded by stone outbuildings and long Victorian cottages. In one of these, a class of bakers stands waiting around a long bench filled with rows of potted candles as a short, plump gentleman with curly, red hair in a blue cloak and a matching tall, pointed helmet enters wearing a pair of spectacles. The leaf looks like an ugly bird as they cover their eyes. A girl collapses as they pull out the squealing leaves. Showing off, Draco Malfoy pokes his finger into his Cactus's mouth and it bites him; furious, he throws it into a container. Later, in the lobby, the specter of Sir Wellington floats into the Grand Ballroom where the bakers are sitting at long desks while Alex is trying unsuccessfully to mend his broken umbrella with sticky tape. A girl takes a painting as a tatty gray hawk flies down into the gallery, swooping low over the desk towards Alex but colliding with a vase and scattering marbles everywhere. Draco and his partners snigger as Alex takes a blue envelope from Errol's wing. Alex nervously breaks the seal on the blue envelope, and to his embarrassment, it starts to scream at him."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The airplane glides straight towards the ocean as they both juggle with the steering wheel and Chuck throws his backpack desperately, but it tears. The airplane flies towards an ancient oak tree standing in the park and dives onto the top branches. High in the tree, the airplane wobbles precariously and flips backwards, getting suspended halfway down. Chuck lifts up his torn backpack as hefty oak branches nudge the airplane, causing the vehicle to lurch and the windshield to crack. A branch pierces through the side window, and branches nudge from all directions, showering them with broken glass. The airplane suddenly flips forward, skips from branch to branch, and drops towards the ground, landing on the sand. Chuck taps the brake and the airplane glides away. The tree stretches after them, but they avoid its grabbing branches. Free from the furious oak, the owls breathe a sigh of relief. Suddenly, the airplane hatches open and they are tossed out onto the sand. The trunk bursts open, throwing out their backpacks and gear. Dave retrieves Pixie's cage, and Chuck glances worriedly at his pet hamster. The airplane ignites, the hatches close, and the beaten airplane flies itself across the sand towards a wooden pier. Dave and Chuck chase after it as it glides down a paved pathway and glides away towards the mountains, leaving Chuck and Dave far behind. Later, they drag their gear into town and leave it on the porch before climbing upstairs. Smith, the janitor, with his dog Mrs. Puffles, is standing at the top of the stairs. The Magic Academy is housed in a handsome manor surrounded by wooden huts and long Georgian greenhouses. In one of these, a group of teachers stands waiting around a long counter filled with rows of potted cacti as a short, stout man with curly, red locks in a green robe and a corresponding small, pointed hat enters wearing a pair of goggles. The soil looks like a rugged stone as they cover their eyes. A teacher collapses as they pull out the howling stones. Showing off, Graham Green pokes his hand into his Mandrake's mouth and it pokes him; angry, he shoves it into a basket. Later, in the corridor, the spirit of Lady Margaret drifts into the Dining Hall where the teachers are sitting at round tables while Chuck is trying unsuccessfully to repair his torn backpack with superglue. A teacher snaps a photograph as a ragged white dove flies down into the hall, gliding low over the table towards Chuck but crashing into a vase and scattering flowers everywhere. Graham and his sidekicks giggle as Chuck takes a golden envelope from Orion's beak. Chuck nervously opens the seal on the golden envelope, and to his embarrassment, it starts to sing at him."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The bicycle rolls straight towards the ocean as they both juggle with the map and Ron shakes his lantern frantically, but it crumbles. The bicycle heads towards an ancient oak statue standing in the park and rolls onto the upper branches. High in the tree, the bicycle wobbles unstably and drifts sideways, getting stuck halfway up. Ron holds up his crumbled lantern as bulky oak branches pummel the bicycle, causing the frame to wobble and the basket to disintegrate. A branch crashes through the front wheel, and branches pummel from all directions, showering them with scattered sand. The bicycle suddenly tips downward, bounces from branch to branch, and floats towards the ocean, landing on the beach. Ron presses the bell and the bicycle coasts away. The statue reaches after them, but they evade its reaching branches. Free of the irate oak, the boys exhale a sigh of relief. Suddenly, the bicycle pedals spin open and they are flung onto the beach. The basket opens, ejecting their coats and picnic. Harry catches Hedwig's cage, and Ron peers worriedly at his pet frog. The bicycle revs, the pedals close, and the battered bicycle rolls itself across the beach towards a wooden fence. Harry and Ron sprint after it as it glides down a gravel trail and coasts away towards the mountains, leaving Ron and Harry far behind. Later, they drag their picnic into school and leave it on the porch before sprinting indoors. Filch, the caretaker, with his cat Mrs. Norris, is sitting at the base of the stairs. Hogwarts School is housed in a grand mansion surrounded by wooden sheds and long Edwardian conservatories. In one of these, a class of students stands waiting around a long table filled with rows of potted cacti as a short, plump man with curly, black hair in a green coat and a matching flat, square hat enters wearing a pair of sunglasses. The cactus looks like an ugly doll as they cover their faces. A boy faints as they tug out the wailing cacti. Showing off, Draco Malfoy pokes his toe into his Mandrake's mouth and it nibbles him; angry, he drops it into a vase. Later, in the hallway, the portrait of Sir Nicolas marches into the Grand Hall where the students are sitting at long tables while Ron is trying unsuccessfully to repair his crumbled lantern with chewing gum. A boy takes a drawing as a scruffy white dove flutters into the room, gliding low over the table towards Ron but bumping into a bowl and tossing grapes everywhere. Draco and his friends chuckle as Ron takes a blue scroll from Errol's beak. Ron anxiously breaks the seal on the blue scroll, and to his embarrassment, it begins to shout at him."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The bicycle glides directly towards the ocean as they both juggle with the paintbrush and Tim tosses his shoe frantically, but it crumbles. The bicycle glides towards an ancient mushroom standing in the park and plunges onto the upper petals. High on the mushroom, the bicycle sways precariously and tumbles backward, getting snagged midway down. Tim holds up his ruined shoe as hefty mushroom caps pummel the bicycle, causing the vehicle to sway and the headlight to shatter. A cap smashes through the rear window, and caps assault from all directions, showering them with glass fragments. The bicycle suddenly flips forward, bounces from petal to petal, and descends towards the ocean, landing on the sand. Tim taps the bell and the bicycle zooms away. The mushroom lunges after them, but they dodge its grasping caps. Free from the furious mushroom, the kids breathe a sigh of relief. Abruptly, the bicycle seats eject, and they are tossed onto the sand. The basket opens, ejecting their bags and backpacks. Jack catches Snowball's kennel, and Tim examines worriedly at his pet hamster. The bicycle ignites, the seats recline, and the dented bicycle rides itself across the sand towards a wooden gazebo. Jack and Tim sprint after it as it rolls down a brick walkway and zooms away towards the grove, leaving Tim and Jack far behind. Later, they drag their backpacks into class and leave them on the desk before sprinting upstairs. Smudge, the janitor, with his parrot Mrs. Polly, is perching at the top of the ladder. Oakwoods School is situated in a majestic mansion surrounded by wooden sheds and long Victorian gardens. In one of these, a bunch of pickpockets stands waiting around a long table filled with rows of potted berries as a tall, skinny gentleman with curly, black hair in a yellow overcoat and a matching tiny, square hat enters wearing a pair of spectacles. The fruit looks like a strange toddler as they cover their eyes. A girl faints as they yank out the shrieking fruit. Boasting, Connor Maloney pokes his elbow into his Parsnip's mouth and it licks him; angry, he drops it into a jar. Later, in the alley, the spirit of Lady Caroline drifts into the Dining Hall where the pickpockets are seated at long counters while Tim is attempting unsuccessfully to fix his ruined shoe with duct tape. A girl captures a snapshot as a scruffy white bat swoops down into the hall, gliding low over the counter toward Tim but knocking into a cup and scattering candies everywhere. Connor and his lackeys giggle as Tim takes a blue package from Zeke's claw. Tim cautiously opens the seal on the blue package, and to his shame, it commences to yell at him."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The car plunges towards the ground as Ron and Harry struggle with the gear stick, and Ron's wand snaps. Crashing into an ancient willow tree, the car precariously rocks, then gets stuck and attacked by branches, shattering the windscreen. As it tips forward, the car bounces from branch to branch before landing on the grass. Ron accelerates away from the tree's grasp, but the car eventually throws them out, ejects their luggage, and drives itself away into the forest. Harry and Ron chase but lose it. Later, they drag their belongings into Hogwarts, encountering Filch and Mrs. Norris. At a greenhouse, students gather around potted plants led by a short, plump woman in earmuffs, handling roots resembling ugly babies. Draco Malfoy toys with a Mandrake, getting bitten. In the Great Hall, Ron tries to fix his wand. A tatty owl crashes, scattering crisps, and delivers a red envelope. Ron nervously opens it, and it screams at him, drawing Draco and his friends' mockery."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Ron nervously breaks the seal on the red envelope and to his embarrassment it starts to scream at him Draco and his cronies snigger as Ron takes a red envelope from Errol's beak A boy takes a photograph as a tatty gray owl flies down into the room swooping low over the table towards Ron but colliding with a bowl and scattering crisps everywhere Later in the corridor the ghost of Sir Nicolas floats into the Great Hall where the students are sitting at long tables while Ron is trying unsuccessfully to mend his broken wand with sticky tape he throws it into a pot Showing off Draco Malfoy pokes his finger into his Mandrake's mouth and it bites him furious A boy collapses as they pull out the screaming roots The root looks like an ugly baby as they cover their ears In one of these a class of students stands waiting around a long bench filled with rows of potted plants as a short plump woman with curly gray hair in a brown smock and a matching tall pointed hat enters wearing a pair of earmuffs Hogwarts School is housed in a handsome castle surrounded by stone outbuildings and long Victorian greenhouses Mrs Norris is standing at the top of the stairs Filch the caretaker with his cat Later they haul their luggage into school and leave it on the landing before running upstairs Harry and Ron race after it as it rolls down a cobbled passageway and zooms away towards the forest leaving Ron and Harry far behind The car starts the doors shut and the battered car drives itself across the grass towards a stone archway Harry catches Hedwig's cage and Ron peers anxiously at his pet rat The boot opens throwing out their trunks and luggage Suddenly the car doors fly open and they are hurled out onto the grass Clear of the angry willow the boys breathe a sigh of relief The tree lunges after them but they escape its clutching branches Ron presses the accelerator and the car zooms away The car suddenly tips forward bounces from branch to branch and falls towards the ground landing on the grass A branch smashes through the back window and branches attack from all angles showering them with broken glass Ron holds up his broken wand as hefty willow branches attack the car causing the vehicle to rock and the windscreen to shatter High in the tree the car rocks precariously and falls backwards getting stuck halfway down The car heads towards an ancient willow tree standing in the school grounds and plunges onto the top branches The car heads straight towards the ground as they both wrestle with the gear stick and Ron waves his wand desperately but it snaps"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Mrs Norris is standing at the top of the stairs The car starts the doors shut and the battered car drives itself across the grass towards a stone archway Suddenly the car doors fly open and they are hurled out onto the grass Ron nervously breaks the seal on the red envelope and to his embarrassment it starts to scream at him The root looks like an ugly baby as they cover their ears Ron presses the accelerator and the car zooms away The car suddenly tips forward bounces from branch to branch and falls towards the ground landing on the grass The boot opens throwing out their trunks and luggage Filch the caretaker with his cat he throws it into a pot Harry catches Hedwig's cage and Ron peers anxiously at his pet rat In one of these a class of students stands waiting around a long bench filled with rows of potted plants as a short plump woman with curly gray hair in a brown smock and a matching tall pointed hat enters wearing a pair of earmuffs The car heads towards an ancient willow tree standing in the school grounds and plunges onto the top branches Later they haul their luggage into school and leave it on the landing before running upstairs A boy takes a photograph as a tatty gray owl flies down into the room swooping low over the table towards Ron but colliding with a bowl and scattering crisps everywhere Harry and Ron race after it as it rolls down a cobbled passageway and zooms away towards the forest leaving Ron and Harry far behind High in the tree the car rocks precariously and falls backwards getting stuck halfway down Hogwarts School is housed in a handsome castle surrounded by stone outbuildings and long Victorian greenhouses Draco and his cronies snigger as Ron takes a red envelope from Errol's beak A branch smashes through the back window and branches attack from all angles showering them with broken glass Showing off Draco Malfoy pokes his finger into his Mandrake's mouth and it bites him furious The tree lunges after them but they escape its clutching branches Clear of the angry willow the boys breathe a sigh of relief Later in the corridor the ghost of Sir Nicolas floats into the Great Hall where the students are sitting at long tables while Ron is trying unsuccessfully to mend his broken wand with sticky tape The car heads straight towards the ground as they both wrestle with the gear stick and Ron waves his wand desperately but it snaps Ron holds up his broken wand as hefty willow branches attack the car causing the vehicle to rock and the windscreen to shatter A boy collapses as they pull out the screaming roots"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Later they haul their luggage into school and leave it on the landing before running upstairs Filch the caretaker with his cat Mrs Norris is standing at the top of the stairs Hogwarts School is housed in a handsome castle surrounded by stone outbuildings and long Victorian greenhouses In one of these a class of students stands waiting around a long bench filled with rows of potted plants as a short plump woman with curly gray hair in a brown smock and a matching tall pointed hat enters wearing a pair of earmuffs The root looks like an ugly baby as they cover their ears A boy collapses as they pull out the screaming roots Showing off Draco Malfoy pokes his finger into his Mandrake's mouth and it bites him furious he throws it into a pot Later in the corridor the ghost of Sir Nicolas floats into the Great Hall where the students are sitting at long tables while Ron is trying unsuccessfully to mend his broken wand with sticky tape A boy takes a photograph as a tatty gray owl flies down into the room swooping low over the table towards Ron but colliding with a bowl and scattering crisps everywhere Draco and his cronies snigger as Ron takes a red envelope from Errol's beak Ron nervously breaks the seal on the red envelope and to his embarrassment it starts to scream at him The car heads straight towards the ground as they both wrestle with the gear stick and Ron waves his wand desperately but it snaps The car heads towards an ancient willow tree standing in the school grounds and plunges onto the top branches High in the tree the car rocks precariously and falls backwards getting stuck halfway down Ron holds up his broken wand as hefty willow branches attack the car causing the vehicle to rock and the windscreen to shatter A branch smashes through the back window and branches attack from all angles showering them with broken glass The car suddenly tips forward bounces from branch to branch and falls towards the ground landing on the grass Ron presses the accelerator and the car zooms away The tree lunges after them but they escape its clutching branches Clear of the angry willow the boys breathe a sigh of relief Suddenly the car doors fly open and they are hurled out onto the grass The boot opens throwing out their trunks and luggage Harry catches Hedwig's cage and Ron peers anxiously at his pet rat The car starts the doors shut and the battered car drives itself across the grass towards a stone archway Harry and Ron race after it as it rolls down a cobbled passageway and zooms away towards the forest leaving Ron and Harry far behind"
        }
      ]
    }
  ]
}