{
  "ground_truth": "The envelope folds itself into a mouth and turns to Ginny, then it blows a raspberry in Ron's face before shredding itself into tiny pieces and fluttering down onto the table. Hermione looks at Ron sympathetically in a crowded classroom, where the door opens, and the girls are entranced as he flashes his teeth while the boys scowl. He taps a cage, uncovers a cage full of tiny blue creatures, and opens the door of the cage. The pixies fly out in all directions, tearing up books and lifting Neville Longbottom into the air by his ears, carrying him across the room. The students flap at the pixies ineffectually as the creatures hang Neville by the back of his cloak from the light fitting. The air is full of torn pages and flying pixies, with one pulling Hermione's hair, which Harry swipes away. Lockhart's spell has no effect as a pixie grabs his wand and a dragon skeleton falls in a clatter of bones and dust. Lockhart turns and runs up a flight of stairs, grabbing a photo of himself that a pixie has snatched from the wall, then looks down at Harry, Ron, and Hermione before running out. Hermione points her wand, and above their heads, the pixies freeze and float harmlessly in mid-air. Still hanging from the ceiling, Neville looks down at them mournfully as the Gryffindor captain, Oliver Wood, leads his team out for an early morning practice and spots the Slytherin team. Ron looks at Hermione as Draco Malfoy steps forward, and Harry stares at him and their broomsticks. Draco narrows his eyes and glares at Hermione, prompting Ron to pull out his wand in shock. Ron flies backwards, and the Slytherins laugh while Ron looks as if he's going to be sick and spits out a huge slug. Colin takes a photograph as Ron spits out another slug, and Harry and Hermione help Ron away while the laughing Slytherins watch them go. In Hagrid's cottage, he hands Ron a wooden bucket and sits down as Hermione gets up and walks away thoughtfully. Hagrid looks serious and takes Hermione's hand, and with her eyes full of tears, she gives him a faint smile. In Gilderoy Lockhart's room, Lockhart autographs a picture of himself as Harry looks up, hearing a strange voice, and Lockhart looks confused. The professor and student look around nervously before leaving Lockhart's room, where Harry stops as he hears the voice again, seeming to come from the stone wall. Following the sound, Harry bumps into Ron and Hermione, then runs off with his friends hurrying after him, Harry well ahead. He turns into a wide corridor and starts to walk along it as Ron and Hermione catch up with him. Suddenly, Harry stops them, and they look down in surprise to see a line of spiders following each other at their feet.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The packet creases itself into a maw and rotates to Ginny, then it exhales a Bronx cheer in Ron's visage before shredding itself into minute fragments and fluttering down onto the counter. Hermione glances at Ron compassionately in a crowded classroom, where the portal opens, and the damsels are captivated as he flashes his chompers while the lads scowl. He taps a cage, uncovers a cage full of minuscule azure creatures, and opens the portal of the cage. The sprites fly out in all directions, ripping up tomes and hoisting Neville Longbottom into the atmosphere by his ears, conveying him across the room. The pupils flap at the sprites ineffectually as the beings hang Neville by the back of his robe from the illumination fitting. The atmosphere is full of shredded sheets and flying sprites, with one tugging Hermione's mane, which Harry swipes away. Lockhart's charm has no influence as a sprite grabs his wand and a dragon framework falls in a clatter of bones and grime. Lockhart rotates and sprints up a flight of steps, seizing a snapshot of himself that a sprite has snatched from the partition, then gazes down at Harry, Ron, and Hermione before dashing out. Hermione points her wand, and above their pates, the sprites freeze and drift harmlessly in mid-air. Still dangling from the ceiling, Neville gazes down at them dolefully as the Gryffindor leader, Oliver Wood, leads his squad out for an early morning exercise and spots the Slytherin squad. Ron gazes at Hermione as Draco Malfoy steps forward, and Harry stares at him and their brooms. Draco narrows his eyes and glowers at Hermione, prompting Ron to pull out his wand in astonishment. Ron flies backwards, and the Slytherins chuckle while Ron appears as if he's going to be ill and expels a massive gastropod. Colin captures a photograph as Ron expels another gastropod, and Harry and Hermione assist Ron away while the chuckling Slytherins observe them depart. In Hagrid's cabin, he hands Ron a wooden pail and sits down as Hermione gets up and ambles away thoughtfully. Hagrid gazes solemn and takes Hermione's hand, and with her eyes full of weeping, she gives him a faint grin. In Gilderoy Lockhart's chamber, Lockhart autographs a portrait of himself as Harry glances up, hearing an odd voice, and Lockhart looks perplexed. The professor and pupil look around skittishly before leaving Lockhart's chamber, where Harry halts as he hears the voice again, seeming to emanate from the stone partition. Following the noise, Harry bumps into Ron and Hermione, then dashes off with his companions hurrying after him, Harry well ahead. He turns into a broad hallway and commences to stroll along it as Ron and Hermione catch up with him. Suddenly, Harry halts them, and they glance down in astonishment to see a procession of arachnids following each other at their feet."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The envelope is folded into a mouth and turned to Ginny, then a raspberry is blown in Ron's face by it before it shreds itself into tiny pieces and flutters down onto the table. Ron is looked at sympathetically by Hermione in a crowded classroom, where the door is opened, and he flashes his teeth to entrance the girls while the boys scowl. A cage is tapped by him, a cage full of tiny blue creatures is uncovered, and the door of the cage is opened by him. The pixies fly out in all directions, tearing up books and lifting Neville Longbottom into the air by his ears, carrying him across the room. The students flap at the pixies ineffectually as Neville is hung by the back of his cloak from the light fitting by the creatures. The air is filled with torn pages and flying pixies, with Hermione's hair being pulled by one, which is swiped away by Harry. A pixie grabs Lockhart's wand as his spell has no effect, and a dragon skeleton falls in a clatter of bones and dust. Lockhart turns and runs up a flight of stairs, grabbing a photo of himself that was snatched from the wall by a pixie, then he looks down at Harry, Ron, and Hermione before he runs out. A wand is pointed by Hermione, and the pixies are frozen and floated harmlessly in mid-air above their heads. Still hanging from the ceiling, Neville looks down at them mournfully as his team is led out by the Gryffindor captain, Oliver Wood, for an early morning practice, and the Slytherin team is spotted. Hermione is looked at by Ron as Draco Malfoy steps forward, and Harry stares at him and their broomsticks. Draco narrows his eyes and glares at Hermione, prompting Ron to be shocked and pull out his wand. Ron is flown backwards, and the Slytherins laugh while he looks as if he's going to be sick and spits out a huge slug. A photograph is taken by Colin as another slug is spat out by Ron, and Harry and Hermione help Ron away while they are watched by the laughing Slytherins. In Hagrid's cottage, a wooden bucket is handed to Ron by him, and he sits down as Hermione gets up and walks away thoughtfully. Hagrid looks serious and takes Hermione's hand, and with her eyes full of tears, a faint smile is given to him by her. In Gilderoy Lockhart's room, a picture of himself is autographed by Lockhart as Harry looks up, hearing a strange voice, and Lockhart looks confused. The professor and student look around nervously before they leave Lockhart's room, where Harry stops as the voice is heard again by him, seeming to come from the stone wall. Following the sound, Ron and Hermione are bumped into by Harry, then he runs off with his friends hurrying after him, well ahead of Harry. He turns into a wide corridor and starts to walk along it as he is caught up with by Ron and Hermione. Suddenly, they are stopped by Harry, and they look down in surprise to see a line of spiders following each other at their feet."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The envelope folds into a mouth, blows a raspberry at Ron, then shreds itself onto the table. In a crowded classroom, Hermione looks at Ron sympathetically as girls are entranced by him and boys scowl. He uncovers a cage of blue pixies, which fly out, tearing books and lifting Neville Longbottom by his ears. Students ineffectively flap at the pixies, who hang Neville from a light fitting. Torn pages and pixies fill the air; one pulls Hermione's hair, which Harry swipes away. Lockhart's spell fails as a pixie grabs his wand, causing a dragon skeleton to fall. Lockhart runs up stairs, grabs a photo from a pixie, and exits, leaving Harry, Ron, and Hermione. Hermione freezes the pixies mid-air. Neville hangs mournfully as Oliver Wood leads his team to practice, spotting the Slytherins. Draco Malfoy glares at Hermione, prompting Ron to pull his wand, but he flies backward, spitting slugs. Colin photographs Ron, and Harry and Hermione help him away as Slytherins laugh. In Hagrid's cottage, Hagrid gives Ron a bucket, and Hermione walks away thoughtfully. Hagrid takes her hand, and she smiles faintly through tears. In Lockhart's room, Lockhart autographs a picture as Harry hears a strange voice. They leave, and Harry hears the voice again from the stone wall. Following it, he bumps into Ron and Hermione, then runs off with them following. In a wide corridor, Harry stops them to see a line of spiders at their feet."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The envelope folds into a mouth, blows a raspberry at Ron, shreds itself, and flutters onto the table. In a crowded classroom, Hermione looks at Ron sympathetically as girls are entranced by him, and boys scowl. He uncovers a cage of blue pixies, which fly out, tearing books and lifting Neville by his ears. Students ineffectively flap at pixies as they hang Neville from a light fitting. Torn pages and pixies fill the air; one pulls Hermione's hair, which Harry swipes away. Lockhart's spell fails, a pixie grabs his wand, and a dragon skeleton crashes. Lockhart runs upstairs, grabs a photo from a pixie, and looks at Harry, Ron, and Hermione before leaving. Hermione freezes the pixies mid-air. Neville hangs mournfully as Gryffindor captain Oliver Wood leads his team out and spots Slytherin. Ron looks at Hermione as Draco Malfoy steps forward, prompting Ron to pull his wand. Ron flies backward, spits slugs, and Slytherins laugh. Colin photographs Ron, and Harry and Hermione help him away. In Hagrid's cottage, Hagrid gives Ron a bucket, and Hermione walks away thoughtfully. Hagrid takes Hermione's hand, and she smiles faintly through tears. In Lockhart's room, Lockhart autographs a picture as Harry hears a strange voice. Lockhart looks confused, and they leave the room. Harry hears the voice again from the stone wall, bumps into Ron and Hermione, and runs off with them following. In a wide corridor, Harry stops them to see a line of spiders at their feet."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The envelope, with a magical flair, elegantly folds itself into the shape of a mouth and turns its attention to Ginny. In a playful gesture, it blows a cheeky raspberry right in Ron's face before dramatically shredding itself into countless tiny pieces, which then flutter gently down onto the table below. In the midst of a crowded classroom, Hermione casts a sympathetic glance at Ron. The classroom door swings open, and the girls inside become entranced as Ron flashes a charming smile, while the boys around him scowl with envy. Ron taps on a cage, revealing a collection of tiny blue creatures, and proceeds to open the cage door. Instantly, the pixies burst out, flying in every direction, causing chaos as they tear up books and lift Neville Longbottom into the air by his ears, carrying him across the room. The students, in a futile attempt, flap their hands at the pixies, who mischievously hang Neville by the back of his cloak from the light fitting. The air becomes a whirlwind of torn pages and flying pixies, with one particularly pesky pixie pulling at Hermione's hair, which Harry quickly swipes away. Lockhart's spell proves ineffective as a pixie snatches his wand, and a dragon skeleton crashes to the ground in a clatter of bones and dust. Lockhart, in a panic, turns and dashes up a flight of stairs, grabbing a photo of himself that a pixie has snatched from the wall. He pauses momentarily to glance down at Harry, Ron, and Hermione before making his escape. Hermione, with determination, points her wand, and above their heads, the pixies freeze and float harmlessly in mid-air. Still dangling from the ceiling, Neville looks down at them with a mournful expression. Meanwhile, the Gryffindor captain, Oliver Wood, leads his team out for an early morning practice and spots the Slytherin team. Ron exchanges a look with Hermione as Draco Malfoy steps forward, and Harry fixes his gaze on Draco and their broomsticks. Draco narrows his eyes and glares at Hermione, prompting Ron to pull out his wand in shock. The result is Ron flying backwards, much to the amusement of the Slytherins, who laugh heartily as Ron appears as if he's going to be sick and spits out a huge slug. Colin captures the moment with a photograph as Ron spits out yet another slug, and Harry and Hermione rush to help Ron away while the Slytherins continue to laugh at their expense. In the cozy confines of Hagrid's cottage, Hagrid hands Ron a wooden bucket and sits down, while Hermione rises and walks away thoughtfully. Hagrid, with a serious expression, takes Hermione's hand, and with tears welling in her eyes, she offers him a faint smile. In Gilderoy Lockhart's room, Lockhart is busy autographing a picture of himself when Harry looks up, hearing a strange, mysterious voice, and Lockhart appears confused. Both professor and student look around nervously before leaving Lockhart's room. Harry pauses as he hears the voice again, seemingly emanating from the stone wall. Following the eerie sound, Harry bumps into Ron and Hermione, then takes off running, with his friends hurrying after him, Harry well ahead. He turns into a wide corridor and begins to walk along it as Ron and Hermione catch up with him. Suddenly, Harry halts them, and they look down in surprise to see a line of spiders, each following the other, scuttling along at their feet."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The envelope, imbued with a sense of magical sophistication, gracefully and with a touch of enchantment, folds itself into the whimsical shape of a mouth. With its newfound form, it directs its attention towards Ginny, and in a spirited, playful manner, it cheekily blows a raspberry right into Ron's face before theatrically ripping itself apart into a myriad of tiny bits. These remnants gently flutter downwards like confetti, landing softly on the table below. Amidst the bustling activity of a crowded classroom, Hermione glances at Ron with a look of sympathy in her eyes. Meanwhile, the classroom door swings open with a creak, drawing the attention of the girls inside, who become captivated as Ron, ever charming, flashes them a bewitching smile, much to the chagrin of the enviously scowling boys around him. \n\nWith a mischievous air, Ron taps on a cage that houses a lively collection of small, blue creatures before proceeding to open the cage door. In a flash, the pixies burst forth, darting in every direction and causing utter chaos as they rip apart books and lift Neville Longbottom into the air by his ears, effortlessly carrying him across the room. The students, in a vain attempt to regain control, flap their hands frantically at the rambunctious pixies. These mischievous creatures, in a particularly cheeky act, hang Neville by the back of his cloak from the light fitting. The room is filled with the whirlwind of torn pages and darting pixies, creating a scene of absolute pandemonium. One particularly pesky pixie goes as far as to tug at Hermione's hair, only to be swiftly swatted away by Harry.\n\nLockhart's attempt at casting a spell proves utterly ineffective, and a pixie easily snatches his wand away. In the resulting mayhem, a dragon skeleton crashes dramatically to the ground, causing a cacophony of clattering bones and a cloud of dust. In a state of panic, Lockhart turns abruptly and makes a frantic dash up a flight of stairs, snatching a photo of himself that a pixie had grabbed from the wall. He pauses momentarily, casting a quick glance down at Harry, Ron, and Hermione before making his hasty retreat. With a determined demeanor, Hermione points her wand, and above their heads, the pixies freeze mid-flight and float harmlessly in the air. Still dangling from the ceiling, Neville peers down at them with a mournful look on his face.\n\nMeanwhile, the Gryffindor captain, Oliver Wood, is leading his team out for an early morning practice when they spot the Slytherin team. Ron exchanges a significant look with Hermione as Draco Malfoy steps forward, and Harry directs his focused gaze at Draco and their gleaming broomsticks. Draco responds by narrowing his eyes into a glare aimed at Hermione, prompting Ron to dramatically pull out his wand in astonishment. This action results in Ron flying backwards, providing a hearty source of amusement for the Slytherins, who burst into laughter as Ron appears as though he might be sick and proceeds to spit out a huge slug. Colin, ever ready, captures the moment with a photograph as Ron continues to eject yet another slug, prompting Harry and Hermione to rush to Ron’s aid while the Slytherins laugh at their expense.\n\nInside the cozy, rustic confines of Hagrid's cottage, Hagrid hands Ron a wooden bucket, and then sits down with a thoughtful expression, while Hermione, appearing pensive, rises from her seat and walks away thoughtfully. Hagrid, wearing a serious expression, reaches out and takes Hermione's hand, and with tears beginning to well in her eyes, she offers him a faint, reassuring smile. In the privacy of Gilderoy Lockhart's room, Lockhart is preoccupied with the task of autographing a picture of himself when Harry, hearing a strange and mysterious voice, looks up, his curiosity piqued, and Lockhart appears perplexed. Both the professor and the student nervously survey their surroundings before exiting Lockhart's room. Harry pauses, his attention caught by the mysterious voice once more, seemingly emerging from the very stone wall itself. Following the eerie sound, Harry accidentally bumps into Ron and Hermione, then takes off running with urgency, his friends hurrying after him, though Harry maintains a lead.\n\nHe turns into a wide corridor and begins to walk along it as Ron and Hermione manage to catch up with him. Suddenly, Harry brings them to a halt, and they gaze down in surprise to see a single file of spiders, each one of them dutifully following the other, scuttling along right at their feet, creating an unexpected, eerie sight."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The envelope, resting on the table, begins to fold itself intricately until it forms the shape of a mouth, which then turns its attention to Ginny. With a sudden burst of animation, it directs a playful raspberry at Ron's face, the sound echoing briefly in the room. Without warning, the envelope starts to shred itself into countless tiny pieces, which flutter gently down onto the table like confetti. In the crowded classroom, Hermione casts a sympathetic glance at Ron, just as the door swings open. The girls in the room become captivated as Ron flashes a charming smile, revealing his teeth, while the boys around him scowl in response. Ron then reaches out to tap a cage, carefully uncovering it to reveal a collection of tiny blue creatures inside. With a deliberate motion, he opens the door of the cage, allowing the pixies to burst forth in a chaotic flurry, scattering in all directions. The mischievous creatures immediately begin to wreak havoc, tearing up books and seizing Neville Longbottom by his ears, lifting him into the air and carrying him across the room. The students, in a futile attempt to regain control, flap their hands at the pixies, but their efforts prove ineffective. Meanwhile, the pixies suspend Neville by the back of his cloak from the light fitting, leaving him dangling helplessly. The air becomes a whirlwind of torn pages and darting pixies, one of which tugs at Hermione's hair until Harry intervenes, swiping it away. Lockhart attempts a spell, but it has no effect, and a pixie snatches his wand, causing a dragon skeleton to crash to the ground in a clatter of bones and dust. In a moment of panic, Lockhart turns and dashes up a flight of stairs, snatching a photo of himself from a pixie that had taken it from the wall. He pauses briefly to glance down at Harry, Ron, and Hermione before making his escape. Hermione, with determination, points her wand, and the pixies above their heads suddenly freeze, suspended harmlessly in mid-air. Neville, still hanging from the ceiling, looks down at them with a mournful expression. Meanwhile, outside, the Gryffindor captain, Oliver Wood, leads his team out for an early morning practice and immediately spots the Slytherin team. Ron exchanges a look with Hermione as Draco Malfoy steps forward, prompting Harry to fix his gaze on Draco and their broomsticks. Draco narrows his eyes and directs a glare at Hermione, which causes Ron to react in shock, pulling out his wand. The unexpected action sends Ron flying backward, eliciting laughter from the Slytherins as Ron appears nauseous and begins to spit out a huge slug. Colin captures the moment with a photograph as Ron expels another slug, and Harry and Hermione rush to help Ron away, the Slytherins' laughter trailing after them. In the cozy confines of Hagrid's cottage, Hagrid hands Ron a wooden bucket and takes a seat, while Hermione rises and walks away, lost in thought. Hagrid, with a serious expression, takes Hermione's hand, and she, with tears in her eyes, offers him a faint smile. In Gilderoy Lockhart's room, Lockhart is busy autographing a picture of himself when Harry, hearing a strange voice, looks up in confusion. Lockhart shares in the confusion as both professor and student glance around nervously before leaving the room. Outside, Harry pauses, hearing the voice again, this time seeming to emanate from the stone wall. Driven by curiosity, Harry follows the sound, inadvertently bumping into Ron and Hermione, who quickly join him as he runs off, with his friends hurrying to keep up. Harry, well ahead, turns into a wide corridor and begins to walk along it, with Ron and Hermione catching up to him. Suddenly, Harry halts them, and they all look down in surprise to see a line of spiders, each following the other, scuttling along at their feet."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The envelope transforms into a mouth, blows a raspberry at Ron, and then shreds itself into pieces that flutter onto the table. In a crowded classroom, Hermione looks at Ron sympathetically as the door opens, drawing the girls' attention to his smile while the boys scowl. He reveals a cage of tiny blue creatures, releasing them into chaos as they tear up books and lift Neville Longbottom by his ears, hanging him from a light fitting. Students ineffectively try to swat the pixies away, while one pulls Hermione's hair, which Harry swipes at. Lockhart's spell fails, and a pixie grabs his wand, causing a dragon skeleton to crash down. Lockhart flees up the stairs, retrieving a photo from a pixie, and glances at Harry, Ron, and Hermione before escaping. Hermione freezes the pixies mid-air, and Neville hangs mournfully from the ceiling. Meanwhile, Oliver Wood leads the Gryffindor team out for practice, spotting the Slytherin team. Draco Malfoy glares at Hermione, prompting Ron to draw his wand, which backfires, causing him to spit slugs. Colin captures the moment as Harry and Hermione help Ron away, with the Slytherins laughing. In Hagrid's cottage, Ron receives a bucket, and Hermione walks away thoughtfully. Hagrid, looking serious, takes Hermione's hand, and she gives him a faint smile through tears. In Lockhart's room, he autographs a picture as Harry hears a strange voice, prompting both to look around nervously before leaving. Outside, Harry hears the voice again from the stone wall, bumps into Ron and Hermione, and runs off with them following. In a wide corridor, Harry stops them to observe a line of spiders at their feet."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The envelope, a Howler sent by Mrs. Weasley known for its ability to convey messages in a loud, scolding voice, folds itself into a mouth and turns to Ginny, then it blows a raspberry in Ron's face before shredding itself into tiny pieces and fluttering down onto the table. Hermione looks at Ron sympathetically in a crowded classroom at Hogwarts School of Witchcraft and Wizardry, where the door opens, and the girls are entranced as he flashes his teeth while the boys scowl. He taps a cage, which holds a notorious species for their mischievous behavior, uncovers a cage full of tiny blue creatures called Cornish pixies, and opens the door of the cage. The pixies, small and troublesome, fly out in all directions, tearing up books and lifting Neville Longbottom, known for his frequent mishaps, into the air by his ears, carrying him across the room. The students flap at the pixies ineffectually as the creatures hang Neville by the back of his cloak from the light fitting. The air is full of torn pages and flying pixies, with one pulling Hermione's hair, which Harry, a skilled young wizard, swipes away. Lockhart's spell, despite his fame for supposed bravery, has no effect as a pixie grabs his wand and a dragon skeleton, preserved from a magical creature class, falls in a clatter of bones and dust. Lockhart turns and runs up a flight of stairs, grabbing a photo of himself that a pixie has snatched from the wall, then looks down at Harry, Ron, and Hermione before running out. Hermione points her wand, showcasing her advanced magical skills, and above their heads, the pixies freeze and float harmlessly in mid-air. Still hanging from the ceiling, Neville looks down at them mournfully as the Gryffindor captain, Oliver Wood, leads his Quidditch team out for an early morning practice and spots the Slytherin team. Ron looks at Hermione as Draco Malfoy, a rival from a proud pure-blood family, steps forward, and Harry stares at him and their state-of-the-art broomsticks. Draco narrows his eyes and glares at Hermione, prompting Ron to pull out his wand in shock. Ron flies backwards, and the Slytherins, known for their cunning and ambition, laugh while Ron looks as if he's going to be sick and spits out a huge slug, a result of a backfired spell. Colin takes a photograph as Ron spits out another slug, and Harry and Hermione help Ron away while the laughing Slytherins watch them go. In Hagrid's cottage, a cozy dwelling on the edge of the Forbidden Forest, he hands Ron a wooden bucket and sits down as Hermione gets up and walks away thoughtfully. Hagrid, the gentle half-giant and Keeper of Keys and Grounds at Hogwarts, looks serious and takes Hermione's hand, and with her eyes full of tears, she gives him a faint smile. In Gilderoy Lockhart's opulent room, filled with his self-promoting memorabilia, Lockhart autographs a picture of himself as Harry looks up, hearing a strange voice, and Lockhart looks confused. The professor and student look around nervously before leaving Lockhart's room, where Harry stops as he hears the voice again, seeming to come from the stone wall that forms the ancient foundation of the castle. Following the sound, Harry bumps into Ron and Hermione, then runs off with his friends hurrying after him, Harry well ahead. He turns into a wide corridor, dimly lit by flickering torches, and starts to walk along it as Ron and Hermione catch up with him. Suddenly, Harry stops them, and they look down in surprise to see a line of spiders, significant for their fearful response to danger, following each other at their feet."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The envelope folds itself into a mouth and turns to Ginny. then it blows a raspberry in Ron's face before shredding itself into tiny pieces and fluttering down onto the table. Hermione looks at Ron sympathetically in a crowded classroom where the door opens and the girls are entranced as he flashes his teeth while the boys scowl. He taps a cage uncovers a cage full of tiny blue creatures and opens the door of the cage. The pixies fly out in all directions tearing up books and lifting Neville Longbottom into the air by his ears carrying him across the room. The students flap at the pixies ineffectually as the creatures hang Neville by the back of his cloak from the light fitting. The air is full of torn pages and flying pixies with one pulling Hermione's hair which Harry swipes away. Lockhart's spell has no effect as a pixie grabs his wand and a dragon skeleton falls in a clatter of bones and dust. Lockhart turns and runs up a flight of stairs grabbing a photo of himself that a pixie has snatched from the wall. then looks down at Harry Ron and Hermione before running out. Hermione points her wand and above their heads. the pixies freeze and float harmlessly in midair. Still hanging from the ceiling Neville looks down at them mournfully as the Gryffindor captain Oliver Wood leads his team out for an early morning practice and spots the Slytherin team. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Ron looks at Hermione as Draco Malfoy steps forward and Harry stares at him and their broomsticks. Draco narrows his eyes and glares at Hermione prompting Ron to pull out his wand in shock. Ron flies backwards and the Slytherins laugh while Ron looks as if he is going to be sick and spits out a huge slug. Colin takes a photograph as Ron spits out another slug and Harry and Hermione help Ron away while the laughing Slytherins watch them go. In Hagrid's cottage he hands Ron a wooden bucket and sits down as Hermione gets up and walks away thoughtfully. Hagrid looks serious and takes Hermione's hand and with her eyes full of tears she gives him a faint smile. In Gilderoy Lockhart's room. Lockhart autographs a picture of himself as Harry looks up hearing a strange voice and Lockhart looks confused. The professor and student look around nervously before leaving Lockhart's room where Harry stops as he hears the voice again seeming to come from the stone wall. Following the sound Harry bumps into Ron and Hermione then runs off with his friends hurrying after him. Harry well ahead. He turns into a wide corridor and starts to walk along it as Ron and Hermione catch up with him. Suddenly Harry stops them and they look down in surprise to see a line of spiders following each other at their feet."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The envelope folds itself into a mouth and turns to Ginny. then it blows a raspberry in Ron's face before shredding itself into tiny pieces and fluttering down onto the table. Hermione looks at Ron sympathetically in a crowded classroom where the door opens and the girls are entranced as he flashes his teeth while the boys scowl. He taps a cage uncovers a cage full of tiny blue creatures and opens the door of the cage. The pixies fly out in all directions tearing up books and lifting Neville Longbottom into the air by his ears carrying him across the room. The students flap at the pixies ineffectually as the creatures hang Neville by the back of his cloak from the light fitting. The air is full of torn pages and flying pixies with one pulling Hermione's hair which Harry swipes away. Lockhart's spell has no effect as a pixie grabs his wand and a dragon skeleton falls in a clatter of bones and dust. Lockhart turns and runs up a flight of stairs grabbing a photo of himself that a pixie has snatched from the wall. then looks down at Harry Ron and Hermione before running out. Hermione points her wand and above their heads. the pixies freeze and float harmlessly in midair. Still hanging from the ceiling Neville looks down at them mournfully as the Gryffindor captain Oliver Wood leads his team out for an early morning practice and spots the Slytherin team. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Ron looks at Hermione as Draco Malfoy steps forward and Harry stares at him and their broomsticks. Draco narrows his eyes and glares at Hermione prompting Ron to pull out his wand in shock. Ron flies backwards and the Slytherins laugh while Ron looks as if he is going to be sick and spits out a huge slug. Colin takes a photograph as Ron spits out another slug and Harry and Hermione help Ron away while the laughing Slytherins watch them go. In Hagrid's cottage he hands Ron a wooden bucket and sits down as Hermione gets up and walks away thoughtfully. Hagrid looks serious and takes Hermione's hand and with her eyes full of tears she gives him a faint smile. In Gilderoy Lockhart's room. Lockhart autographs a picture of himself as Harry looks up hearing a strange voice and Lockhart looks confused. The professor and student look around nervously before leaving Lockhart's room where Harry stops as he hears the voice again seeming to come from the stone wall. Following the sound Harry bumps into Ron and Hermione then runs off with his friends hurrying after him. Harry well ahead. He turns into a wide corridor and starts to walk along it as Ron and Hermione catch up with him. Suddenly Harry stops them and they look down in surprise to see a line of spiders following each other at their feet."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The envelope folds itself into a mouth and turns to Ginny. then it blows a raspberry in Ron's face before shredding itself into tiny pieces and fluttering down onto the table. Hermione looks at Ron sympathetically in a crowded classroom where the door opens and the girls are entranced as he flashes his teeth while the boys scowl. He taps a cage uncovers a cage full of tiny blue creatures and opens the door of the cage. The pixies fly out in all directions tearing up books and lifting Neville Longbottom into the air by his ears carrying him across the room. The students flap at the pixies ineffectually as the creatures hang Neville by the back of his cloak from the light fitting. The air is full of torn pages and flying pixies with one pulling Hermione's hair which Harry swipes away. Lockhart autographs a picture of himself as Harry looks up hearing a strange voice and Lockhart looks confused. The professor and student look around nervously before leaving Lockhart's room where Harry stops as he hears the voice again seeming to come from the stone wall. Following the sound Harry bumps into Ron and Hermione then runs off with his friends hurrying after him. Harry well ahead. He turns into a wide corridor and starts to walk along it as Ron and Hermione catch up with him. Suddenly Harry stops them and they look down in surprise to see a line of spiders following each other at their feet."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The envelope folds itself into a mouth and turns to Ginny. then it blows a raspberry in Ron's face before shredding itself into tiny pieces and fluttering down onto the table. Hermione looks at Ron sympathetically in a crowded classroom where the door opens and the girls are entranced as he flashes his teeth while the boys scowl. Harry well ahead. He turns into a wide corridor and starts to walk along it as Ron and Hermione catch up with him. Suddenly Harry stops them and they look down in surprise to see a line of spiders following each other at their feet."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The postcard curls itself into a shoe and spins to Freddy, then it whistles a tune in Jerry's ear before slicing itself into tiny threads and drifting down onto the carpet. Samantha glances at Jerry kindly in a bustling library, where the window swings open, and the children are mesmerized as he flashes his sneakers while the adults frown. He knocks a jar, unveils a jar full of little green insects, and swings open the lid of the jar. The beetles zoom out in every direction, ripping up maps and hoisting Norris Thimble into the air by his elbows, dragging him across the hall. The guests wave at the beetles helplessly as the insects dangle Norris by the back of his hoodie from the chandelier. The sky is filled with torn maps and soaring beetles, with one tugging Samantha's scarf, which Tim brushes away. Bernard's trick has zero impact as a beetle snatches his net and a whale sculpture topples in a cascade of pebbles and debris. Bernard pivots and dashes up a ladder, clutching a sketch of himself that a beetle has pinched from the shelf, then glances down at Tim, Jerry, and Samantha before sprinting out. Samantha waves her net, and above their heads, the beetles halt and hover gently in mid-air. Still swinging from the light fixture, Norris peers down at them pitifully as the Bluejay leader, Victor Stern, leads his group out for an early morning drill and notices the Raven troop. Jerry glances at Samantha as Felix Sanders steps forward, and Tim gapes at him and their bicycles. Felix squints and frowns at Samantha, causing Jerry to yank out his net in surprise. Jerry sails backwards, and the Ravens chuckle while Jerry appears nauseated and coughs up a giant beetle. Curtis snaps a snapshot as Jerry hacks up another beetle, and Tim and Samantha assist Jerry away while the chuckling Ravens observe them leave. In Agnes's cabin, she hands Jerry a tin pail and reclines as Samantha rises and strolls away pensively. Agnes appears grave and grasps Samantha's sleeve, and with her eyes brimming with raindrops, she offers him a weak grin. In Gwendolyn Skip's nook, Skip signs a sketch of herself as Tim glances up, catching a peculiar whisper, and Skip appears baffled. The librarian and apprentice peer around anxiously before stepping out of Skip's nook, where Tim pauses as he perceives the whisper again, seeming to emerge from the wooden door. Following the echo, Tim stumbles into Jerry and Samantha, then scurries off with his pals rushing after him, Tim far ahead. He veers into a spacious tunnel and begins to stride along it as Jerry and Samantha catch up with him. Suddenly, Tim halts them, and they gaze down in bewilderment to observe a trail of ants trailing one another at their shoes."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The enchanted envelope folds into a mouth, blows a raspberry at Ron, and disintegrates, as Hermione observes sympathetically in a crowded classroom. Ron reveals a cage full of pixies, which escape and wreak havoc, lifting Neville by his ears and hanging him from a light. The students struggle with the chaos, and Lockhart's spell fails, causing a dragon skeleton to crash down. Lockhart flees, while Hermione uses her wand to freeze the pixies. Neville remains suspended as Gryffindor's Oliver Wood spots the Slytherin team. Draco Malfoy glares at Hermione, provoking Ron to attempt a spell that backfires, making him spit slugs, which amuses the Slytherins. Harry and Hermione support Ron to Hagrid's cottage, where Hagrid comforts Hermione. In Lockhart's room, Harry is distracted by a strange voice in the walls. With Ron and Hermione, he follows the sound to a corridor, stopping to see a line of spiders trailing at their feet."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Suddenly Harry stops them and they look down in surprise to see a line of spiders following each other at their feet He turns into a wide corridor and starts to walk along it as Ron and Hermione catch up with him  Harry well ahead  Following the sound Harry bumps into Ron and Hermione then runs off with his friends hurrying after him  The professor and student look around nervously before leaving Lockhart's room where Harry stops as he hears the voice again seeming to come from the stone wall  Lockhart autographs a picture of himself as Harry looks up hearing a strange voice and Lockhart looks confused  In Gilderoy Lockhart's room  Hagrid looks serious and takes Hermione's hand and with her eyes full of tears she gives him a faint smile  In Hagrid's cottage he hands Ron a wooden bucket and sits down as Hermione gets up and walks away thoughtfully  Colin takes a photograph as Ron spits out another slug and Harry and Hermione help Ron away while the laughing Slytherins watch them go  Ron flies backwards and the Slytherins laugh while Ron looks as if he's going to be sick and spits out a huge slug  Draco narrows his eyes and glares at Hermione prompting Ron to pull out his wand in shock  Ron looks at Hermione as Draco Malfoy steps forward and Harry stares at him and their broomsticks  Still hanging from the ceiling Neville looks down at them mournfully as the Gryffindor captain Oliver Wood leads his team out for an early morning practice and spots the Slytherin team  Hermione points her wand and above their heads the pixies freeze and float harmlessly in midair  then looks down at Harry Ron and Hermione before running out  Lockhart turns and runs up a flight of stairs grabbing a photo of himself that a pixie has snatched from the wall  Lockhart's spell has no effect as a pixie grabs his wand and a dragon skeleton falls in a clatter of bones and dust  The air is full of torn pages and flying pixies with one pulling Hermione's hair which Harry swipes away  The students flap at the pixies ineffectually as the creatures hang Neville by the back of his cloak from the light fitting  The pixies fly out in all directions tearing up books and lifting Neville Longbottom into the air by his ears carrying him across the room  He taps a cage uncovers a cage full of tiny blue creatures and opens the door of the cage  Hermione looks at Ron sympathetically in a crowded classroom where the door opens and the girls are entranced as he flashes his teeth while the boys scowl  then it blows a raspberry in Ron's face before shredding itself into tiny pieces and fluttering down onto the table  The envelope folds itself into a mouth and turns to Ginny "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "then it blows a raspberry in Ron's face before shredding itself into tiny pieces and fluttering down onto the table The envelope folds itself into a mouth and turns to Ginny He taps a cage uncovers a cage full of tiny blue creatures and opens the door of the cage Hermione looks at Ron sympathetically in a crowded classroom where the door opens and the girls are entranced as he flashes his teeth while the boys scowl The students flap at the pixies ineffectually as the creatures hang Neville by the back of his cloak from the light fitting The pixies fly out in all directions tearing up books and lifting Neville Longbottom into the air by his ears carrying him across the room Lockhart's spell has no effect as a pixie grabs his wand and a dragon skeleton falls in a clatter of bones and dust The air is full of torn pages and flying pixies with one pulling Hermione's hair which Harry swipes away then looks down at Harry Ron and Hermione before running out Lockhart turns and runs up a flight of stairs grabbing a photo of himself that a pixie has snatched from the wall the pixies freeze and float harmlessly in midair Hermione points her wand and above their heads Ron looks at Hermione as Draco Malfoy steps forward and Harry stares at him and their broomsticks Still hanging from the ceiling Neville looks down at them mournfully as the Gryffindor captain Oliver Wood leads his team out for an early morning practice and spots the Slytherin team Ron flies backwards and the Slytherins laugh while Ron looks as if he is going to be sick and spits out a huge slug Draco narrows his eyes and glares at Hermione prompting Ron to pull out his wand in shock In Hagrid's cottage he hands Ron a wooden bucket and sits down as Hermione gets up and walks away thoughtfully Colin takes a photograph as Ron spits out another slug and Harry and Hermione help Ron away while the laughing Slytherins watch them go In Gilderoy Lockhart's room Hagrid looks serious and takes Hermione's hand and with her eyes full of tears she gives him a faint smile The professor and student look around nervously before leaving Lockhart's room where Harry stops as he hears the voice again seeming to come from the stone wall Lockhart autographs a picture of himself as Harry looks up hearing a strange voice and Lockhart looks confused Harry well ahead Following the sound Harry bumps into Ron and Hermione then runs off with his friends hurrying after him Suddenly Harry stops them and they look down in surprise to see a line of spiders following each other at their feet He turns into a wide corridor and starts to walk along it as Ron and Hermione catch up with him"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Draco narrows his eyes and glares at Hermione prompting Ron to pull out his wand in shock  Ron flies backwards and the Slytherins laugh while Ron looks as if he's going to be sick and spits out a huge slug  Colin takes a photograph as Ron spits out another slug and Harry and Hermione help Ron away while the laughing Slytherins watch them go  In Hagrid's cottage he hands Ron a wooden bucket and sits down as Hermione gets up and walks away thoughtfully  Hagrid looks serious and takes Hermione's hand and with her eyes full of tears she gives him a faint smile  In Gilderoy Lockhart's room  Lockhart autographs a picture of himself as Harry looks up hearing a strange voice and Lockhart looks confused  The professor and student look around nervously before leaving Lockhart's room where Harry stops as he hears the voice again seeming to come from the stone wall  Following the sound Harry bumps into Ron and Hermione then runs off with his friends hurrying after him  Harry well ahead  He turns into a wide corridor and starts to walk along it as Ron and Hermione catch up with him  Suddenly Harry stops them and they look down in surprise to see a line of spiders following each other at their feet The envelope folds itself into a mouth and turns to Ginny  then it blows a raspberry in Ron's face before shredding itself into tiny pieces and fluttering down onto the table  Hermione looks at Ron sympathetically in a crowded classroom where the door opens and the girls are entranced as he flashes his teeth while the boys scowl  He taps a cage uncovers a cage full of tiny blue creatures and opens the door of the cage  The pixies fly out in all directions tearing up books and lifting Neville Longbottom into the air by his ears carrying him across the room  The students flap at the pixies ineffectually as the creatures hang Neville by the back of his cloak from the light fitting  The air is full of torn pages and flying pixies with one pulling Hermione's hair which Harry swipes away  Lockhart's spell has no effect as a pixie grabs his wand and a dragon skeleton falls in a clatter of bones and dust  Lockhart turns and runs up a flight of stairs grabbing a photo of himself that a pixie has snatched from the wall  then looks down at Harry Ron and Hermione before running out  Hermione points her wand and above their heads the pixies freeze and float harmlessly in midair  Still hanging from the ceiling Neville looks down at them mournfully as the Gryffindor captain Oliver Wood leads his team out for an early morning practice and spots the Slytherin team  Ron looks at Hermione as Draco Malfoy steps forward and Harry stares at him and their broomsticks "
        }
      ]
    }
  ]
}