{
  "ground_truth": "The platoon walks through a rice paddy, waits deep in water, and then it begins to rain, pouring down on Forrest and Bubba as they sit in a foxhole. On another day, the platoon walks through the jungle with rain pouring down on them, and again, on another day, they shelter themselves while walking through the wind and rain. Forrest holds his hand up to protect his face. On yet another day, Forrest and other soldiers walk chest-deep through a river, as rain splatters back up, hitting the soldiers. The rain pours down on the men of the platoon as they sit in a camp, and Bubba sits down next to Forrest, leaning his back up against Forrest's back. On another night, some soldiers patrol the area, while Forrest lies in a pup tent and writes a letter as the rain pours down, using his flashlight to see. Meanwhile, Jenny steps out of the trailer with a backpack and a guitar, hugs a hippie guy, and jumps into the back of a Volkswagen bus with another guy. The Fourth Platoon makes their way through the jungle and rain, and Forrest looks up as the sun suddenly appears. Forrest's platoon is then attacked, a bullet kills the soldier standing next to Forrest, and bombs explode all around as the soldiers scramble to the ground. Forrest crawls over a berm with bullets flying overhead and exploding around him; he rolls over and pulls his pack off as Lt. Dan lies next to him. Two soldiers with a machine gun fire into the jungle, and Lt. Dan shouts into the radio. Forrest begins firing his weapon into the jungle as the machine gunner fires into the treeline, assisted by another soldier with ammunition, but the machine gun jams. A rocket explodes on the machine gunner and the other soldier, killing them, and Forrest looks down, covering his head as rockets explode all around him. The platoon gets up and runs toward the cover of the jungle, with rockets exploding all around the field. Forrest runs into the jungle, followed by soldiers running through it with bullets exploding around them. A soldier is blown up by a rocket as Forrest runs past him, and rockets explode as he runs out toward a clearing. Forrest turns around, runs back into the jungle, and rockets explode while he looks for Bubba. Forrest stops, aims his weapon, looks around scared, sees something move, turns, looks, and rushes over to find Tex lying on the ground, his face distorted with pain. Forrest carries Tex out of the jungle and into the clearing.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The squadron strides through a rice field, waits submerged in liquid, and then it starts to drizzle, cascading down on Forrest and Bubba as they perch in a trench. On another day, the squadron strides through the rainforest with drizzle cascading down on them, and again, on another day, they shield themselves while strolling through the gale and drizzle. Forrest raises his palm up to defend his visage. On yet another day, Forrest and other troops tramp chest-deep through a stream, as drizzle spatters back up, striking the troops. The drizzle cascades down on the men of the squadron as they perch in a camp, and Bubba settles down next to Forrest, leaning his spine up against Forrest's spine. On another night, some troops patrol the vicinity, while Forrest lies in a small tent and drafts a note as the drizzle cascades down, utilizing his flashlight to view. Meanwhile, Jenny steps out of the trailer with a backpack and a guitar, embraces a hippie guy, and leaps into the rear of a Volkswagen bus with another guy. The Fourth Squadron makes their route through the rainforest and drizzle, and Forrest gazes up as the sun suddenly emerges. Forrest's squadron is then ambushed, a projectile kills the trooper standing next to Forrest, and bombs detonate all around as the troops hustle to the terrain. Forrest creeps over a mound with projectiles soaring overhead and detonating around him; he tumbles over and tugs his pack off as Lt. Dan reclines next to him. Two troops with a machine gun discharge into the rainforest, and Lt. Dan yells into the radio. Forrest commences discharging his firearm into the rainforest as the machine gunner discharges into the treeline, assisted by another trooper with munitions, but the machine gun blocks. A missile detonates on the machine gunner and the other trooper, killing them, and Forrest glances down, shielding his head as missiles detonate all around him. The squadron rises and sprints toward the shelter of the rainforest, with missiles detonating all around the field. Forrest dashes into the rainforest, trailed by troops sprinting through it with projectiles detonating around them. A trooper is blown up by a missile as Forrest dashes past him, and missiles detonate as he dashes out toward a clearing. Forrest pivots, dashes back into the rainforest, and missiles detonate while he seeks Bubba. Forrest halts, aims his firearm, glances around frightened, perceives something shift, turns, glances, and hastens over to discover Tex sprawled on the terrain, his visage contorted with agony. Forrest transports Tex out of the rainforest and into the clearing."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The rice paddy is walked through by the platoon, deep in water they wait, and then rain begins to pour down on Forrest and Bubba as they sit in a foxhole. On another day, the jungle is walked through by the platoon with rain pouring down on them, and again, on another day, they shelter themselves while walking through the wind and rain. Forrest's hand is held up by him to protect his face. On yet another day, a river is walked chest-deep through by Forrest and other soldiers, as rain splatters back up, hitting the soldiers. The men of the platoon are rained on as they sit in a camp, and Bubba sits down next to Forrest, leaning his back up against Forrest's back. On another night, the area is patrolled by some soldiers, while a letter is written by Forrest as he lies in a pup tent and uses his flashlight to see as the rain pours down. Meanwhile, the trailer is stepped out of by Jenny with a backpack and a guitar, a hippie guy is hugged by her, and she jumps into the back of a Volkswagen bus with another guy. The jungle and rain are navigated by the Fourth Platoon, and the sun suddenly appears as Forrest looks up. Forrest's platoon is then attacked, a soldier standing next to Forrest is killed by a bullet, and bombs explode all around as the soldiers scramble to the ground. A berm is crawled over by Forrest with bullets flying overhead and exploding around him; he rolls over and his pack is pulled off by him as Lt. Dan lies next to him. Two soldiers with a machine gun fire into the jungle, and the radio is shouted into by Lt. Dan. Forrest begins firing his weapon into the jungle as the machine gunner fires into the treeline, another soldier assists with ammunition, but the machine gun jams. A rocket explodes on the machine gunner and the other soldier, killing them, and rockets explode all around Forrest as he looks down, covering his head. The cover of the jungle is run toward by the platoon, with rockets exploding all around the field. The jungle is run into by Forrest, followed by soldiers running through it with bullets exploding around them. A rocket blows up a soldier as Forrest runs past him, and as he runs out toward a clearing, rockets explode. Forrest turns around and runs back into the jungle, while he looks for Bubba, rockets explode. His weapon is aimed by Forrest, he stops, looks around scared, sees something move, turns and looks, and Tex is rushed over to by him, found lying on the ground with his face distorted with pain. Tex is carried by Forrest out of the jungle and into the clearing."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The platoon trudges through a rice paddy, waiting in water, when it starts pouring rain on Forrest and Bubba in a foxhole. On another day, they march through the jungle as rain pours, seeking shelter from wind and rain while Forrest shields his face. Yet another day, they wade chest-deep in a river as rain splatters, later sitting at camp with Bubba leaning on Forrest. One night, soldiers patrol while Forrest writes a letter by flashlight in a pup tent with rain pouring down. Jenny exits a trailer with a backpack and guitar, hugs a hippie guy, and hops into a Volkswagen bus. The Fourth Platoon struggles through the rainy jungle, and Forrest looks up as the sun appears, only for the platoon to be ambushed. A bullet kills the soldier next to Forrest as bombs explode and they scramble. Forrest crawls over a berm amidst flying bullets, shedding his pack as Lt. Dan lies beside him. Two soldiers fire a machine gun into the jungle, but it jams. A rocket kills the machine gunners, and Forrest covers his head as rockets explode. The platoon runs for cover, rockets exploding everywhere. Forrest rushes into the jungle amid bullets, passing a soldier blown up by a rocket, then runs back to find Bubba. He stops, aims, rushes over to find Tex in pain, carries him to safety out of the jungle."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The platoon traverses a rice paddy, waits in water, and rain pours on Forrest and Bubba in a foxhole. Another day, they walk through the jungle in rain, sheltering against wind. Forrest shields his face. Later, they wade chest-deep in a river as rain splashes, then sit in camp with Bubba leaning against Forrest. At night, soldiers patrol while Forrest writes in a tent using a flashlight. Meanwhile, Jenny exits a trailer, hugs a hippie, and joins a Volkswagen bus. The Fourth Platoon moves through jungle rain, then Forrest sees the sun. They get attacked, a bullet kills a soldier next to Forrest, and bombs explode around them. Forrest crawls, pulls off his pack beside Lt. Dan. Soldiers fire into the jungle, Lt. Dan shouts into the radio. Forrest fires his weapon, but the machine gun jams, then a rocket kills the machine gunner and assistant. Rockets explode, and Forrest runs for jungle cover. He returns under fire to find Bubba, then discovers Tex in pain. Forrest carries Tex to the clearing."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The platoon steadily makes its way across a seemingly endless rice paddy, wading through water that reaches up to their knees. They pause, waiting as a deluge starts to fall from the sky, drenching Forrest and Bubba as they huddle together in a foxhole, doing their best to shield themselves from the relentless downpour. On a different day, the platoon marches through the dense, overgrown jungle, once again under a sky that opens up, releasing a torrent of rain upon them. And yet again, on another day entirely, they struggle to find some semblance of shelter as they move forward through the howling wind and incessant rain. Forrest uses his hand in a futile attempt to protect his face from the stinging rain. On yet another occasion, Forrest and his fellow soldiers find themselves wading chest-deep through a river, with the rain splattering against the surface and bouncing back up, hitting them from all angles. The rain continues to pour down on the weary men of the platoon as they sit together in their camp, with Bubba settling down next to Forrest, their backs pressed together for support and comfort. On a different night, while some soldiers are on patrol, Forrest finds a moment of respite lying in a cramped pup tent. He writes a letter, illuminated by the beam of his flashlight, as the ever-present rain continues its unyielding fall. Meanwhile, Jenny emerges from a trailer, her belongings gathered in a backpack, a guitar slung over her shoulder. She shares an embrace with a hippie guy, then eagerly jumps into the back of a waiting Volkswagen bus with another companion. The Fourth Platoon persists in their journey through the oppressive jungle and unending rain, and suddenly, Forrest looks up as the sun breaks through the clouds, startling and bright. The platoon is abruptly ambushed; a bullet finds the soldier standing beside Forrest, ending his life, and chaos erupts with bombs detonating all around, forcing the soldiers to dive for cover. Forrest scrambles over a berm, with bullets whizzing past and explosions ringing out; he rolls over, tossing his pack aside, as Lt. Dan lies close by. Two soldiers manning a machine gun open fire into the jungle, while Lt. Dan communicates urgently over the radio. Forrest joins in, firing his weapon into the dense jungle; however, the machine gunner, assisted by another soldier supplying ammunition, faces a jam. A rocket suddenly strikes, obliterating the machine gunner and the other soldier, leaving Forrest to look down, instinctively protecting his head as rockets burst all around him. The platoon rises, making a desperate dash for the relative cover of the tangled jungle, with rockets erupting throughout the field. Forrest sprints into the jungle, with soldiers following, dodging the lethal explosions around them. A nearby soldier is tragically blown apart by a rocket, just as Forrest charges past, while more rockets continue to explode as he makes his way towards a clearing. Forrest then turns back, running back into the jungle, determined to find Bubba amidst the chaos. He stops, aims his weapon, and, looking around fearfully, spots movement. He rushes over to discover Tex lying on the ground, his face a mask of agony. With determination, Forrest lifts Tex, carrying him out from the hazardous jungle and into the relative safety of the clearing."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The platoon steadily and cautiously makes its way across a seemingly endless and expansive rice paddy, wading through the water that manages to reach up to their knees, making each step a challenge. They come to a halt, pausing as a deluge begins to cascade down from the sky, soaking Forrest and Bubba to the bone as they huddle together closely in a foxhole, doing their utmost to shield themselves from the relentless and unending downpour. On a different day altogether, the platoon marches through the dense and overgrown jungle, once again finding themselves under a sky that opens up, releasing a torrent of rain upon them mercilessly. And yet again, on another day entirely, they struggle to find some semblance of shelter as they press onward through howling winds and incessant rainstorms. Forrest uses his hand in a futile attempt, shielding his face from the stinging rain that pelts down on him. On yet another occasion, Forrest and his fellow soldiers find themselves wading chest-deep through a rushing river, with the rain splattering against the water’s surface and bouncing back up, hitting them from every conceivable angle. The rain continues its relentless pour upon the weary men of the platoon as they sit together in their makeshift camp, with Bubba settling down right next to Forrest, their backs pressed firmly together for support and comfort against the harsh elements. On a different night, while some soldiers are out on patrol duty, Forrest finds a rare moment of respite lying in a cramped little pup tent. He writes a letter, words illuminated by the narrow beam of his flashlight, as the ever-present rain continues its unyielding fall. Meanwhile, Jenny emerges gracefully from a trailer, her belongings carefully gathered and secured in a backpack, a guitar slung over her shoulder. She shares a warm embrace with a hippie guy, then eagerly jumps into the back of a waiting Volkswagen bus with another companion beside her. The Fourth Platoon persists in their arduous journey through the oppressive jungle and unending rain; suddenly, Forrest looks up as the sun breaks through the clouds, startlingly bright. The platoon is abruptly ambushed; a bullet finds the soldier standing right beside Forrest, tragically ending his life, and chaos erupts with bombs detonating all around, forcing the soldiers to dive desperately for cover. Forrest scrambles over a berm, with bullets whizzing past and explosions ringing out deafeningly; he rolls over, tossing his pack aside, as Lt. Dan lies close by. Two soldiers manning a machine gun open fire into the dense jungle, while Lt. Dan communicates urgently over the radio. Forrest joins in, firing his weapon into the dense jungle; however, the machine gunner, assisted by another soldier rapidly supplying ammunition, faces a jam that renders them vulnerable. A rocket suddenly strikes, obliterating the machine gunner and the other soldier, leaving Forrest to look down instinctively, protecting his head as rockets burst all around him. The platoon rises, making a desperate dash for the relative cover of the tangled jungle, with rockets erupting throughout the field. Forrest sprints into the jungle, with soldiers following suit, dodging the lethal explosions around them. A nearby soldier is tragically blown apart by a rocket, just as Forrest charges past, while more rockets continue to explode as he makes his way towards a clearing. Forrest then turns back, running back into the jungle, determined to find Bubba amidst the chaos. He stops, aims his weapon, and, looking around fearfully, spots movement. He rushes over to discover Tex lying on the ground, his face a mask of agony and pain. With determination, Forrest lifts Tex, carrying him out from the hazardous jungle and into the relative safety of the clearing awaiting them."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The platoon begins their trek by steadily advancing through a rice paddy, each soldier carefully placing one foot in front of the other in the muck, their boots submerged as they push through the waterlogged field. After some time, they halt and stand quietly, waist-deep in water, feeling the coolness seep through their fatigues as they wait. The sky suddenly opens up and it begins to rain heavily, the droplets merging with the water around them. Later, Forrest and Bubba find themselves sitting snugly in a foxhole, silently enduring the relentless downpour that drenches them and fills the trench, the sound of the rain creating a constant, rhythmic patter. On another occasion, the platoon trudges through the dense jungle, their feet sinking into the mud with each step as the rain continues to pour down in sheets, soaking their uniforms and obscuring their vision. On yet another day, as the soldiers march, they brace themselves against the fierce wind and driving rain, trying to protect themselves from the biting cold. Forrest raises his hand, holding it just inches from his face to shield his eyes from the stinging raindrops. On a separate day, Forrest and his comrades wade through a chest-deep river, the rain causing ripples and splashes to rebound onto them as they move cautiously through the current. The downpour persists as the platoon takes respite in a campsite, the men sitting restlessly under the incessant rain. Bubba lowers himself to the ground beside Forrest, leaning back to rest against his friend's sturdy frame, sharing warmth and support amid the harsh weather. One night, while some soldiers are on patrol, Forrest takes shelter in a pup tent, lying on his back as he focuses intently on writing a letter. He uses his flashlight to illuminate the paper in front of him as the rain pounds relentlessly on the fabric of the tent, creating a drumming sound that echoes his determination. Meanwhile, in another place, Jenny emerges from a trailer with a sense of purpose, carrying a backpack slung over one shoulder and a guitar in hand. She pauses briefly to embrace a fellow hippie warmly before climbing into the back of a Volkswagen bus, joining another companion already inside. Later, the Fourth Platoon advances steadily through the jungle, the oppressive rain drenching every inch of their gear, when suddenly, Forrest gazes upward in awe as the sun breaks through the clouds, momentarily illuminating the drab landscape. Suddenly, the tranquility is shattered as an attack unfolds; gunfire erupts without warning, and a fellow soldier standing near Forrest is struck down by a bullet in an instant. Chaos ensues as explosions rock the surroundings, compelling the soldiers to dive for cover. Amidst the chaos, Forrest crawls over a berm, instinctively ducking as bullets whiz overhead and explosions rumble around him. He rolls over onto the ground, hurriedly discarding his pack to gain mobility as Lt. Dan lies prone beside him, barking orders into a radio. Two soldiers, coordinated and efficient, unleash a barrage of machine gun fire into the dense jungle, while another soldier methodically feeds ammunition into their weapon. Forrest joins the fray, aiming and firing his weapon defiantly toward the vague shapes in the treeline. A sudden malfunction causes the machine gun to jam, and as they struggle to rectify it, an enemy rocket strikes, engulfing the machine gunner and his assistant in a deadly explosion. Reacting instinctively, Forrest lowers his head, his hands coming up to shield it as the sky erupts with further explosions all around him. The platoon, galvanized by urgency and desperation, rises and makes a break for the shelter offered by the jungle's undergrowth. Rockets rain down furiously, detonating amidst the fleeing soldiers. Forrest sprints into the jungle's depths, weaving through the trees as his fellow soldiers follow suit, dodging projectiles and explosions that illuminate the shadowy wilderness. As he runs, a harrowing moment occurs when a comrade nearby is violently blown apart by a rocket's force. Despite the danger, Forrest presses onward, emerging briefly into a clearing, only to pivot and rush back into the jungle, driven by concern for Bubba. He stops abruptly, aiming his weapon as his eyes dart anxiously for any sign of movement amid the chaos. His heart pounding, he spots a flicker of motion and hurries over, discovering Tex sprawled on the ground, his face contorted in agony. With unwavering resolve, Forrest hoists Tex onto his shoulders, bearing his weight as he painstakingly carries him out of the dense forest and into the relative safety of the clearing."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The platoon navigates various terrains under relentless rain, moving through rice paddies, jungles, and a river, often seeking shelter from the elements. As the rain continues, Forrest and Bubba sit in a foxhole, and later, Bubba rests against Forrest's back in camp. During another night, Forrest writes a letter by flashlight in a pup tent while some soldiers patrol. Meanwhile, Jenny leaves a trailer, hugs a hippie, and joins others in a Volkswagen bus. As the Fourth Platoon trudges through the jungle, the sun briefly breaks through the rain. Suddenly, an attack erupts. A soldier next to Forrest is killed, and bombs detonate around them. Forrest crawls over a berm with Lt. Dan nearby, removes his pack, and fights back with his weapon. Amid the chaos, a machine gun jams, and a rocket kills two soldiers. Forrest ducks for cover as rockets explode, then the platoon dashes for the jungle under fire. Forrest, pursued by explosions, runs through the jungle, passing a soldier struck by a rocket. After reaching a clearing, he turns back to search for Bubba. In his search, Forrest finds Tex in pain, lifts him, and carries him out of the jungle to safety."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The platoon, part of a U.S. Army unit stationed in Vietnam during the war known for its humid and challenging terrain, walks through a rice paddy, a flooded field used for growing rice that is prevalent in Southeast Asia. They wait deep in water, and then it begins to rain, a common occurrence in the region's monsoon season, pouring down on Forrest and Bubba as they sit in a foxhole, a small pit dug for cover from enemy fire. On another day, the platoon walks through the dense jungle, with its thick canopy and undergrowth, as rain continues pouring down on them, and again, on another day, they attempt to shelter themselves while walking through the wind and rain, the harsh climate adding to their struggle. Forrest, a native of Alabama who joined the Army during the Vietnam War, holds his hand up to protect his face from the relentless downpour. On yet another day, Forrest and other soldiers walk chest-deep through a river swollen by the rain, as raindrops splatter back up, hitting the soldiers. The rain pours down on the men of the platoon as they sit in a makeshift camp, a temporary resting place with minimal comforts, and Bubba sits down next to Forrest, leaning his back against his friend's for warmth and support. On another night, some soldiers patrol the area to safeguard against enemy attacks, while Forrest lies in a small pup tent, writing a letter as the rain pours down, using his flashlight to see clearly in the dim lighting. Meanwhile, Jenny, who has embraced the countercultural movement of the 1960s, steps out of the trailer with a backpack and a guitar, symbols of her free-spirited lifestyle, hugs a hippie guy as a gesture of their shared ideals, and jumps into the back of a Volkswagen bus, an icon of the era, with another guy. The Fourth Platoon makes their way through the jungle and rain, and Forrest looks up as the sun suddenly appears, offering a brief respite from the oppressive gloom. Forrest's platoon is then attacked by Viet Cong forces, a bullet kills the soldier standing next to Forrest, and bombs explode all around as the soldiers scramble to the ground for cover. Forrest crawls over a berm, an earthen barrier for protection, with bullets flying overhead and exploding around him; he rolls over and pulls his pack off as Lt. Dan, their commanding officer known for his strong will and leadership, lies next to him. Two soldiers with a machine gun fire into the jungle, trying to suppress enemy fire, and Lt. Dan shouts into the radio, calling for backup or air support. Forrest begins firing his weapon into the jungle as the machine gunner fires into the treeline, assisted by another soldier with ammunition, but the machine gun jams, leaving them vulnerable. A rocket explodes on the machine gunner and the other soldier, killing them instantly, and Forrest looks down, covering his head as rockets explode all around him. The platoon, trained to react quickly in such situations, gets up and runs toward the cover of the jungle, with rockets exploding all around the field, creating chaos. Forrest runs into the jungle, followed by soldiers running through it amidst bullets exploding around them. A soldier is blown up by a rocket as Forrest runs past him, and rockets explode as he runs out toward a clearing, seeking safety. Forrest turns around, runs back into the jungle, his determination to find Bubba driving him despite the danger, and rockets explode while he looks for his friend. Forrest stops, aims his weapon, looks around scared, sees something move, turns, looks, and rushes over to find Tex lying on the ground, his face distorted with pain, a fellow soldier wounded in the chaos. Forrest, embodying the camaraderie and bravery among soldiers, carries Tex out of the jungle and into the clearing, risking his life to save his comrade."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The platoon walks through a rice paddy waits deep in water and then it begins to rain pouring down on Forrest and Bubba as they sit in a foxhole. On another day the platoon walks through the jungle with rain pouring down on them and again on another day they shelter themselves while walking through the wind and rain. Forrest holds his hand up to protect his face. On yet another day Forrest and other soldiers walk chestdeep through a river as rain splatters back up hitting the soldiers. The rain pours down on the men of the platoon as they sit in a camp and Bubba sits down next to Forrest leaning his back up against Forrest's back. On another night some soldiers patrol the area while Forrest lies in a pup tent and writes a letter as the rain pours down using his flashlight to see. Meanwhile Jenny steps out of the trailer with a backpack and a guitar hugs a hippie guy and jumps into the back of a Volkswagen bus with another guy. The Fourth Platoon makes their way through the jungle and rain and Forrest looks up as the sun suddenly appears. Forrest's platoon is then attacked. a bullet kills the soldier standing next to Forrest and bombs explode all around as the soldiers scramble to the ground. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Forrest crawls over a berm with bullets flying overhead and exploding around him. he rolls over and pulls his pack off as Lt Dan lies next to him. Two soldiers with a machine gun fire into the jungle and Lt Dan shouts into the radio. Forrest begins firing his weapon into the jungle as the machine gunner fires into the treeline assisted by another soldier with ammunition but the machine gun jams. A rocket explodes on the machine gunner and the other soldier killing them and Forrest looks down covering his head as rockets explode all around him. The platoon gets up and runs toward the cover of the jungle with rockets exploding all around the field. Forrest runs into the jungle followed by soldiers running through it with bullets exploding around them. A soldier is blown up by a rocket as Forrest runs past him and rockets explode as he runs out toward a clearing. Forrest turns around runs back into the jungle and rockets explode while he looks for Bubba. Forrest stops aims his weapon looks around scared sees something move turns looks and rushes over to find Tex lying on the ground his face distorted with pain. Forrest carries Tex out of the jungle and into the clearing."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The platoon walks through a rice paddy waits deep in water and then it begins to rain pouring down on Forrest and Bubba as they sit in a foxhole. On another day the platoon walks through the jungle with rain pouring down on them and again on another day they shelter themselves while walking through the wind and rain. Forrest holds his hand up to protect his face. On yet another day Forrest and other soldiers walk chestdeep through a river as rain splatters back up hitting the soldiers. The rain pours down on the men of the platoon as they sit in a camp and Bubba sits down next to Forrest leaning his back up against Forrest's back. On another night some soldiers patrol the area while Forrest lies in a pup tent and writes a letter as the rain pours down using his flashlight to see. Meanwhile Jenny steps out of the trailer with a backpack and a guitar hugs a hippie guy and jumps into the back of a Volkswagen bus with another guy. The Fourth Platoon makes their way through the jungle and rain and Forrest looks up as the sun suddenly appears. Forrest's platoon is then attacked. a bullet kills the soldier standing next to Forrest and bombs explode all around as the soldiers scramble to the ground. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Forrest crawls over a berm with bullets flying overhead and exploding around him. he rolls over and pulls his pack off as Lt Dan lies next to him. Two soldiers with a machine gun fire into the jungle and Lt Dan shouts into the radio. Forrest begins firing his weapon into the jungle as the machine gunner fires into the treeline assisted by another soldier with ammunition but the machine gun jams. A rocket explodes on the machine gunner and the other soldier killing them and Forrest looks down covering his head as rockets explode all around him. The platoon gets up and runs toward the cover of the jungle with rockets exploding all around the field. Forrest runs into the jungle followed by soldiers running through it with bullets exploding around them. A soldier is blown up by a rocket as Forrest runs past him and rockets explode as he runs out toward a clearing. Forrest turns around runs back into the jungle and rockets explode while he looks for Bubba. Forrest stops aims his weapon looks around scared sees something move turns looks and rushes over to find Tex lying on the ground his face distorted with pain. Forrest carries Tex out of the jungle and into the clearing."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The platoon walks through a rice paddy waits deep in water and then it begins to rain pouring down on Forrest and Bubba as they sit in a foxhole. On another day the platoon walks through the jungle with rain pouring down on them and again on another day they shelter themselves while walking through the wind and rain. Forrest holds his hand up to protect his face. On yet another day Forrest and other soldiers walk chestdeep through a river as rain splatters back up hitting the soldiers. The rain pours down on the men of the platoon as they sit in a camp and Bubba sits down next to Forrest leaning his back up against Forrest's back. The platoon gets up and runs toward the cover of the jungle with rockets exploding all around the field. Forrest runs into the jungle followed by soldiers running through it with bullets exploding around them. A soldier is blown up by a rocket as Forrest runs past him and rockets explode as he runs out toward a clearing. Forrest turns around runs back into the jungle and rockets explode while he looks for Bubba. Forrest stops aims his weapon looks around scared sees something move turns looks and rushes over to find Tex lying on the ground his face distorted with pain. Forrest carries Tex out of the jungle and into the clearing."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The platoon walks through a rice paddy waits deep in water and then it begins to rain pouring down on Forrest and Bubba as they sit in a foxhole. On another day the platoon walks through the jungle with rain pouring down on them and again on another day they shelter themselves while walking through the wind and rain. Forrest turns around runs back into the jungle and rockets explode while he looks for Bubba. Forrest stops aims his weapon looks around scared sees something move turns looks and rushes over to find Tex lying on the ground his face distorted with pain. Forrest carries Tex out of the jungle and into the clearing."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The orchestra skips across a flower meadow, swims shallow in lava, and then it starts to snow, cascading down on Max and Charlie as they stand in a treehouse. On a different night, the orchestra skips across the desert with snow cascading down on them, and once more, on a different night, they cloak themselves while skipping across the tornado and snow. Max raises his foot up to shield his nose. On yet another night, Max and other travelers pedal waist-deep through a stream, as snowflakes bounce back up, striking the travelers. The snow cascades down on the women of the orchestra as they stand in a cave, and Charlie stands next to Max, leaning his elbow up against Max's elbow. On another afternoon, some travelers survey the ocean, while Max sits in a cocoon and knits a sweater as the snow cascades down, using his binoculars to view. Meanwhile, Sarah skips out of the cottage with a suitcase and a trumpet, shakes hands with a magician, and climbs into the roof of a submarine car with another magician. The Second Orchestra finds their path through the desert and snow, and Max peeks up as the moon suddenly vanishes. Max's orchestra is then surprised, a pebble startles the tourist sitting next to Max, and fireworks erupt all around as the travelers leap to the sky. Max slides under a tunnel with pebbles dancing overhead and erupting around him; he spins over and pushes his shoes off as Captain Clark sits beside him. Two travelers with a water hose spray into the desert, and Captain Clark whispers into the notebook. Max starts spraying his gadget into the desert as the water hose operator sprays into the horizon, accompanied by another traveler with batteries, but the water hose breaks. A balloon bursts on the water hose operator and the other traveler, surprising them, and Max glances up, shielding his ears as fireworks erupt all around him. The orchestra rises and skips toward the concealment of the desert, with fireworks erupting all around the meadow. Max skips into the desert, chased by travelers skipping through it with pebbles erupting around them. A traveler is lifted by a balloon as Max skips past him, and fireworks burst as he skips out toward a meadow. Max spins around, skips back into the desert, and fireworks burst while he searches for Charlie. Max halts, fires his gadget, glances around nervous, notices something shuffle, spins, glances, and dashes over to find Bob napping on the sky, his expression twisted with delight. Max drags Bob out of the desert and into the meadow."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The platoon trudges through a rain-soaked rice paddy, with Forrest and Bubba often finding themselves in a downpour. As they navigate the jungle in chest-deep water, the relentless rain beats down on them. In camp, Bubba leans back against Forrest, while Forrest writes a letter in a tent using a flashlight amidst the storm. Meanwhile, Jenny leaves with a backpack and jumps into a VW bus. Suddenly, Forrest's platoon is ambushed; a soldier beside him is killed, and bombs explode as they take cover. Forrest and Lt. Dan seek shelter, while machine gunners struggle with a jammed weapon until a rocket hits, killing them. Chaos ensues as Forrest runs into the jungle amidst flying bullets and rockets, searching for Bubba. He encounters Tex in pain, carries him to safety, and escapes the jungle."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Forrest carries Tex out of the jungle and into the clearing Forrest stops aims his weapon looks around scared sees something move turns looks and rushes over to find Tex lying on the ground his face distorted with pain Forrest turns around runs back into the jungle and rockets explode while he looks for Bubba A soldier is blown up by a rocket as Forrest runs past him and rockets explode as he runs out toward a clearing Forrest runs into the jungle followed by soldiers running through it with bullets exploding around them The platoon gets up and runs toward the cover of the jungle with rockets exploding all around the field A rocket explodes on the machine gunner and the other soldier killing them and Forrest looks down covering his head as rockets explode all around him Forrest begins firing his weapon into the jungle as the machine gunner fires into the treeline assisted by another soldier with ammunition but the machine gun jams Two soldiers with a machine gun fire into the jungle and Lt Dan shouts into the radio he rolls over and pulls his pack off as Lt Dan lies next to him Forrest crawls over a berm with bullets flying overhead and exploding around him a bullet kills the soldier standing next to Forrest and bombs explode all around as the soldiers scramble to the ground Forrest's platoon is then attacked The Fourth Platoon makes their way through the jungle and rain and Forrest looks up as the sun suddenly appears Meanwhile Jenny steps out of the trailer with a backpack and a guitar hugs a hippie guy and jumps into the back of a Volkswagen bus with another guy On another night some soldiers patrol the area while Forrest lies in a pup tent and writes a letter as the rain pours down using his flashlight to see The rain pours down on the men of the platoon as they sit in a camp and Bubba sits down next to Forrest leaning his back up against Forrest's back On yet another day Forrest and other soldiers walk chestdeep through a river as rain splatters back up hitting the soldiers Forrest holds his hand up to protect his face On another day the platoon walks through the jungle with rain pouring down on them and again on another day they shelter themselves while walking through the wind and rain The platoon walks through a rice paddy waits deep in water and then it begins to rain pouring down on Forrest and Bubba as they sit in a foxhole"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "On another day the platoon walks through the jungle with rain pouring down on them and again on another day they shelter themselves while walking through the wind and rain The platoon walks through a rice paddy waits deep in water and then it begins to rain pouring down on Forrest and Bubba as they sit in a foxhole On yet another day Forrest and other soldiers walk chestdeep through a river as rain splatters back up hitting the soldiers Forrest holds his hand up to protect his face On another night some soldiers patrol the area while Forrest lies in a pup tent and writes a letter as the rain pours down using his flashlight to see The rain pours down on the men of the platoon as they sit in a camp and Bubba sits down next to Forrest leaning his back up against Forrest's back The Fourth Platoon makes their way through the jungle and rain and Forrest looks up as the sun suddenly appears Meanwhile Jenny steps out of the trailer with a backpack and a guitar hugs a hippie guy and jumps into the back of a Volkswagen bus with another guy a bullet kills the soldier standing next to Forrest and bombs explode all around as the soldiers scramble to the ground Forrest's platoon is then attacked he rolls over and pulls his pack off as Lt Dan lies next to him Forrest crawls over a berm with bullets flying overhead and exploding around him Forrest begins firing his weapon into the jungle as the machine gunner fires into the treeline assisted by another soldier with ammunition but the machine gun jams Two soldiers with a machine gun fire into the jungle and Lt Dan shouts into the radio The platoon gets up and runs toward the cover of the jungle with rockets exploding all around the field A rocket explodes on the machine gunner and the other soldier killing them and Forrest looks down covering his head as rockets explode all around him A soldier is blown up by a rocket as Forrest runs past him and rockets explode as he runs out toward a clearing Forrest runs into the jungle followed by soldiers running through it with bullets exploding around them Forrest stops aims his weapon looks around scared sees something move turns looks and rushes over to find Tex lying on the ground his face distorted with pain Forrest turns around runs back into the jungle and rockets explode while he looks for Bubba Forrest carries Tex out of the jungle and into the clearing"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "he rolls over and pulls his pack off as Lt Dan lies next to him Two soldiers with a machine gun fire into the jungle and Lt Dan shouts into the radio Forrest begins firing his weapon into the jungle as the machine gunner fires into the treeline assisted by another soldier with ammunition but the machine gun jams A rocket explodes on the machine gunner and the other soldier killing them and Forrest looks down covering his head as rockets explode all around him The platoon gets up and runs toward the cover of the jungle with rockets exploding all around the field Forrest runs into the jungle followed by soldiers running through it with bullets exploding around them A soldier is blown up by a rocket as Forrest runs past him and rockets explode as he runs out toward a clearing Forrest turns around runs back into the jungle and rockets explode while he looks for Bubba Forrest stops aims his weapon looks around scared sees something move turns looks and rushes over to find Tex lying on the ground his face distorted with pain Forrest carries Tex out of the jungle and into the clearing The platoon walks through a rice paddy waits deep in water and then it begins to rain pouring down on Forrest and Bubba as they sit in a foxhole On another day the platoon walks through the jungle with rain pouring down on them and again on another day they shelter themselves while walking through the wind and rain Forrest holds his hand up to protect his face On yet another day Forrest and other soldiers walk chestdeep through a river as rain splatters back up hitting the soldiers The rain pours down on the men of the platoon as they sit in a camp and Bubba sits down next to Forrest leaning his back up against Forrest's back On another night some soldiers patrol the area while Forrest lies in a pup tent and writes a letter as the rain pours down using his flashlight to see Meanwhile Jenny steps out of the trailer with a backpack and a guitar hugs a hippie guy and jumps into the back of a Volkswagen bus with another guy The Fourth Platoon makes their way through the jungle and rain and Forrest looks up as the sun suddenly appears Forrest's platoon is then attacked a bullet kills the soldier standing next to Forrest and bombs explode all around as the soldiers scramble to the ground Forrest crawls over a berm with bullets flying overhead and exploding around him"
        }
      ]
    }
  ]
}