{
  "ground_truth": "They scuttle across the floor, up the wall, over the stone window sill, and out through a crack in the glass. They see something else on the floor. A pool of water reflects writing on the wall above. Harry sees something else. A cat, stiff as a board, is hanging by its tail from a lamp bracket. Students appear at each end of the corridor. Seeing the cat, they stare suspiciously at Harry, Ron, and Hermione. Colin prepares to take a photograph, but somebody stops him. Draco reads out the writing on the wall. Filch pushes his way through the gaping crowd. He sees his cat. He grabs Harry. Dumbledore sees the writing on the wall. He indicates Harry, Ron, and Hermione. Lockhart stares at the cat. Ron gives her a warning look. Snape looks unconvinced. Later, the staircases swing from side to side into different positions. As the children go upstairs, Hermione turns to Ron and Harry. A portrait on the wall nods in agreement. A classroom. A black and white bird becomes a glass goblet. Ron waves his wand. Scabbers becomes a goblet with a waving rat's tail. Professor McGonagall seems uncertain. She looks at the expectant students. Hermione is concerned. Ron turns to face a smug Draco. Outside the classroom. In the library, Hermione takes down a book from a shelf and shows it to Ron and Harry. Hung with heraldic designs, tall spectator towers surround the oval arena of the Quidditch pitch. The players swoop above the arena on their broomsticks, high over the heads of the excited crowd. The Slytherin captain hurls the Quaffle towards the goal, but the Gryffindor Keeper knocks it safely away. Ducking and diving, a Gryffindor grabs the Quaffle and flies with it. It's knocked away and passed high in the air to a Slytherin. Marking an opponent, Harry swoops around the back of a tower. He hovers watching as a well-aimed Slytherin pass sends the Quaffle flying straight through the goal. The Slytherin supporters are ecstatic as the points go up on the scoreboard. The professors applaud. The Slytherin captain encourages his team. They fly in formation, their green cloaks streaming behind them. Harry ducks as a wood bat narrowly misses his head. Lucius Malfoy and Snape are watching the match together, sitting in the professors' grandstand. Looking out for the Golden Snitch, Harry and Draco, the two Seekers, hover above the arena. A wooden Bludger almost hits Harry. His captain shouts a warning. The Bludger hurtles back. The Bludger smashes Wood's broomstick to smithereens. Then it turns and heads straight for Harry, chasing after him. Hagrid is following the game through a pair of binoculars. A new Bludger smashes through a tall tower.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "They scurry across the floor, up the wall, over the stone window ledge, and out through a fissure in the glass. They notice something else on the floor. A pool of water mirrors writing on the wall above. Harry notices something else. A feline, rigid as a plank, is hanging by its tail from a lamp support. Students materialize at each end of the passage. Seeing the feline, they gaze suspiciously at Harry, Ron, and Hermione. Colin prepares to capture a photograph, but somebody halts him. Draco recites the writing on the wall. Filch forces his way through the gawking crowd. He notices his feline. He seizes Harry. Dumbledore notices the writing on the wall. He indicates Harry, Ron, and Hermione. Lockhart gazes at the feline. Ron gives her a cautionary look. Snape appears unconvinced. Later, the staircases swing from side to side into varied positions. As the children go upstairs, Hermione turns to Ron and Harry. A portrait on the wall nods in agreement. A classroom. A monochrome bird becomes a glass chalice. Ron waves his wand. Scabbers becomes a chalice with a waving rat's tail. Professor McGonagall seems uncertain. She looks at the expectant students. Hermione is concerned. Ron turns to confront a smug Draco. Outside the classroom. In the library, Hermione takes down a tome from a shelf and shows it to Ron and Harry. Draped with heraldic designs, tall spectator towers encircle the oval arena of the Quidditch field. The players swoop above the arena on their broomsticks, high over the heads of the excited crowd. The Slytherin captain flings the Quaffle towards the goal, but the Gryffindor Keeper deflects it safely away. Ducking and diving, a Gryffindor seizes the Quaffle and flies with it. It's deflected away and passed high in the air to a Slytherin. Marking an adversary, Harry swoops around the back of a tower. He hovers observing as a well-aimed Slytherin pass sends the Quaffle flying straight through the goal. The Slytherin supporters are ecstatic as the points ascend on the scoreboard. The professors applaud. The Slytherin captain motivates his team. They fly in formation, their emerald cloaks streaming behind them. Harry ducks as a wood bat narrowly misses his head. Lucius Malfoy and Snape are observing the match together, sitting in the professors' grandstand. Watching for the Golden Snitch, Harry and Draco, the two Seekers, hover above the arena. A wooden Bludger nearly strikes Harry. His captain shouts a warning. The Bludger hurtles back. The Bludger shatters Wood's broomstick to smithereens. Then it turns and heads straight for Harry, pursuing him. Hagrid is following the game through a pair of binoculars. A new Bludger shatters through a tall tower."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Across the floor, up the wall, over the stone window sill, and out through a crack in the glass, they are scuttled. Something else on the floor is seen by them. Writing on the wall above is reflected by a pool of water. Something else is seen by Harry. Hanging by its tail from a lamp bracket is a cat, as stiff as a board. At each end of the corridor, students appear. Suspiciously staring at Harry, Ron, and Hermione, they see the cat. Colin is prepared to take a photograph, but he is stopped by somebody. The writing on the wall is read out by Draco. Through the gaping crowd, Filch pushes his way. His cat is seen by him. Harry is grabbed by him. The writing on the wall is seen by Dumbledore. Harry, Ron, and Hermione are indicated by him. The cat is stared at by Lockhart. A warning look is given by Ron to her. Snape is looked unconvinced by. Later, side to side, the staircases are swung into different positions. As the children go upstairs, Ron and Harry are turned to by Hermione. In agreement, a portrait on the wall nods. In the classroom, a black and white bird is turned into a glass goblet. His wand is waved by Ron. A goblet with a waving rat's tail is made of Scabbers. Uncertain seems Professor McGonagall. At the expectant students, she looks. Concerned is Hermione. Ron faces a smug Draco. Outside the classroom, from a shelf, a book is taken down by Hermione in the library and shown to Ron and Harry. Surrounding the oval arena of the Quidditch pitch are tall spectator towers hung with heraldic designs. Above the arena, the players are swooping on their broomsticks, high over the heads of the excited crowd. Towards the goal, the Quaffle is hurled by the Slytherin captain, but it is knocked safely away by the Gryffindor Keeper. A Gryffindor grabs the Quaffle and flies with it, ducking and diving. It is knocked away and passed high in the air to a Slytherin. Marking an opponent, Harry swoops around the back of a tower. As a well-aimed Slytherin pass sends the Quaffle flying straight through the goal, he hovers watching. The Slytherin supporters are made ecstatic as the points are put up on the scoreboard. The professors applaud them. His team is encouraged by the Slytherin captain. They are flown in formation, their green cloaks streaming behind them. Harry's head is narrowly missed by a wood bat, which he ducks. The match is watched by Lucius Malfoy and Snape together, sitting in the professors' grandstand. For the Golden Snitch, Harry and Draco, the two Seekers, are looked out by them, hovering above the arena. Harry is almost hit by a wooden Bludger. A warning is shouted by his captain. Back, the Bludger hurtles. Wood's broomstick is smashed to smithereens by the Bludger. Then it is turned and sent straight for Harry, chasing after him. The game is followed by Hagrid through a pair of binoculars. Through a tall tower, a new Bludger is smashed."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "They scuttle across the floor, up the wall, over the stone window sill, and out through a crack in the glass. They notice a pool of water reflecting writing on the wall. Harry spots a cat, stiff as a board, hanging by its tail from a lamp bracket. Students gather at both ends of the corridor, staring suspiciously at Harry, Ron, and Hermione. Colin tries to take a photo, but someone stops him. Draco reads the wall's writing. Filch pushes through the crowd, sees his cat, and grabs Harry. Dumbledore notices the writing and indicates Harry, Ron, and Hermione. Lockhart stares at the cat, while Ron gives a warning look. Snape remains unconvinced. Later, staircases swing into different positions. As the children ascend, Hermione turns to Ron and Harry. A portrait nods in agreement. In a classroom, a black and white bird becomes a glass goblet. Ron waves his wand, turning Scabbers into a goblet with a rat's tail. Professor McGonagall looks uncertain, observing the expectant students. Hermione is concerned as Ron faces a smug Draco. In the library, Hermione shows Ron and Harry a book. Tall towers with heraldic designs surround the Quidditch pitch. Players swoop on broomsticks above the excited crowd. The Slytherin captain hurls the Quaffle, but the Gryffindor Keeper deflects it. A Gryffindor grabs the Quaffle, but it's passed to a Slytherin. Harry swoops around a tower, watching a Slytherin pass send the Quaffle through the goal. Slytherin supporters cheer as points go up. Professors applaud, and the Slytherin captain encourages his team. They fly in formation, green cloaks streaming. Harry ducks a wood bat. Lucius Malfoy and Snape watch from the grandstand. Harry and Draco, the Seekers, hover for the Golden Snitch. A Bludger nearly hits Harry, and his captain warns him. The Bludger smashes Wood's broomstick and chases Harry. Hagrid follows the game with binoculars as a new Bludger smashes through a tower."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "They scuttle across the floor, up the wall, over the window sill, and out a crack in the glass. They notice a pool of water reflecting writing on the wall. Harry sees a cat hanging by its tail from a lamp bracket. Students appear, staring at Harry, Ron, and Hermione. Colin tries to photograph, but is stopped. Draco reads the wall writing. Filch pushes through the crowd, sees his cat, and grabs Harry. Dumbledore notices the writing and indicates the trio. Lockhart stares at the cat; Ron warns her. Snape is unconvinced. Later, staircases shift positions. As they ascend, Hermione turns to Ron and Harry. A portrait nods. In class, a bird becomes a goblet. Ron's wand turns Scabbers into a goblet with a rat's tail. McGonagall is uncertain, observing the students. Hermione is worried. Ron faces a smug Draco. In the library, Hermione shows Ron and Harry a book. The Quidditch pitch is surrounded by towers. Players swoop on broomsticks. The Slytherin captain throws the Quaffle, but the Gryffindor Keeper deflects it. A Gryffindor grabs the Quaffle, but it's intercepted by a Slytherin. Harry marks an opponent, watching a Slytherin score. Slytherin supporters cheer as points go up. Professors applaud. The Slytherin captain encourages his team. They fly in formation. Harry ducks a wood bat. Lucius Malfoy and Snape watch from the grandstand. Harry and Draco, the Seekers, hover for the Golden Snitch. A Bludger nearly hits Harry. His captain warns him. The Bludger smashes Wood's broomstick and chases Harry. Hagrid watches through binoculars. A new Bludger breaks a tower."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "They move quickly and scuttle across the floor, then make their way up the wall, over the cold, hard stone window sill, and finally slip out through a narrow crack in the glass. As they move, they notice something else on the floor. A shimmering pool of water reflects the mysterious writing on the wall above. Harry, however, notices something different. A cat, as stiff as a board, is hanging ominously by its tail from a lamp bracket. Students begin to appear at each end of the corridor. Upon seeing the cat, they stare with suspicion at Harry, Ron, and Hermione. Colin eagerly prepares to take a photograph, but someone intervenes and stops him. Draco, with a smirk, reads out the writing on the wall. Filch, looking distraught, pushes his way through the gaping crowd. He sees his beloved cat and immediately grabs Harry. Dumbledore arrives and sees the writing on the wall. He gestures towards Harry, Ron, and Hermione. Lockhart, with a puzzled expression, stares at the cat. Ron gives Hermione a warning look, cautioning her. Snape, however, looks unconvinced by the situation. Later on, the staircases swing from side to side, shifting into different positions. As the children make their way upstairs, Hermione turns to Ron and Harry with a concerned expression. A portrait on the wall nods in agreement with their silent conversation. In a classroom, a black and white bird transforms into a delicate glass goblet. Ron waves his wand, and Scabbers becomes a goblet with a waving rat's tail. Professor McGonagall seems uncertain and looks at the expectant students. Hermione appears concerned, while Ron turns to face a smug Draco. Outside the classroom, in the library, Hermione takes down a book from a high shelf and shows it to Ron and Harry. The Quidditch pitch is surrounded by tall spectator towers adorned with heraldic designs. The players swoop above the arena on their broomsticks, soaring high over the heads of the excited crowd. The Slytherin captain hurls the Quaffle towards the goal, but the Gryffindor Keeper skillfully knocks it safely away. Ducking and diving, a Gryffindor player grabs the Quaffle and flies with it. It's knocked away and passed high in the air to a Slytherin player. Marking an opponent, Harry swoops around the back of a tower. He hovers, watching intently as a well-aimed Slytherin pass sends the Quaffle flying straight through the goal. The Slytherin supporters are ecstatic as the points go up on the scoreboard. The professors applaud the play. The Slytherin captain encourages his team, and they fly in formation, their green cloaks streaming behind them. Harry ducks just in time as a wooden bat narrowly misses his head. Lucius Malfoy and Snape are watching the match together, sitting in the professors' grandstand. Looking out for the elusive Golden Snitch, Harry and Draco, the two Seekers, hover above the arena. A wooden Bludger almost hits Harry, and his captain shouts a warning. The Bludger hurtles back with force. The Bludger smashes Wood's broomstick to smithereens. Then it turns and heads straight for Harry, relentlessly chasing after him. Hagrid is following the game closely through a pair of binoculars. A new Bludger smashes through a tall tower, adding to the chaos."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "They move with incredible speed, scuttling swiftly across the floor like small shadows in motion. They then make their way nimbly up the wall, traversing the cold, hard surface of the stone window sill. Finally, they slip stealthily out through a narrow crack in the glass pane. As they journey onward, they notice an interesting detail on the floor. A shimmering pool of water lies there, mirroring the mysterious writing found on the wall overhead. Harry, in contrast, observes something else entirely. Suspended ominously by its tail from a lamp bracket, a cat hangs as stiff as a board. Students begin to emerge at both ends of the long corridor. Upon catching sight of the cat, they direct suspicious stares towards Harry, Ron, and Hermione. Eagerly, Colin prepares to capture the moment with his camera, but someone steps in and stops him. Draco, sporting a smirk on his face, proceeds to read aloud the writing on the wall. Filch, looking absolutely distraught, pushes his way determinedly through the crowd that has gathered, their mouths agape in shock. The moment he sees his beloved cat, he immediately seizes Harry. Dumbledore arrives on the scene, his gaze taking in the writing on the wall. He gestures subtly towards Harry, Ron, and Hermione. Lockhart, with a puzzled expression on his face, fixes his stare on the unfortunate cat. Ron exchanges a meaningful look with Hermione, cautioning her silently. Snape, however, appears unconvinced by the entirety of the situation. Later on, the staircases begin to swing dramatically from side to side, shifting into new, unexpected positions. As the children navigate their way upstairs, Hermione turns to Ron and Harry, her expression clearly conveying her concern. A portrait hanging on the wall nods in agreement with their unspoken conversation. Within the classroom, a black and white bird undergoes a magical transformation, turning into an exquisite, delicate glass goblet. Ron waves his wand energetically, resulting in Scabbers being transformed into a goblet with a rat's tail waving from its side. Professor McGonagall stands there, seeming somewhat uncertain, as she looks at the expectant students. Hermione appears visibly concerned, while Ron turns to face a smug Draco. Outside the classroom, in the expansive library, Hermione carefully takes down a heavy book from a high shelf and shows it excitedly to Ron and Harry. The Quidditch pitch is surrounded by towering spectator towers, impressively adorned with colorful heraldic designs. The players swoop gracefully above the vast arena on their broomsticks, soaring high over the heads of the eager and excited crowd. The Slytherin captain hurls the Quaffle powerfully towards the goal, but the resourceful Gryffindor Keeper skillfully knocks it safely away. Ducking and diving, a Gryffindor player seizes the Quaffle and flies with it energetically. It's knocked away in a swift motion and passed high into the air to a Slytherin player. In a strategic move, Harry swoops around the back of a towering pillar. He hovers there, watching intently as a precisely aimed Slytherin pass sends the Quaffle flying straight through the goal. The Slytherin supporters erupt in ecstatic cheers as the points are added to the scoreboard. The professors join the applause for the play. The Slytherin captain encourages his team enthusiastically, and they fly in a coordinated formation, their green cloaks streaming dramatically behind them. Harry ducks just in time as a wooden bat swings dangerously close, narrowly missing his head. Lucius Malfoy and Snape are watching the match together from the professors' grandstand, their expressions attentive. Both seeking the elusive Golden Snitch, Harry and Draco, the two determined Seekers, hover high above the arena. A threatening wooden Bludger nearly hits Harry, and his captain shouts a warning just in time. The Bludger zooms back with incredible force, smashing Wood's broomstick to smithereens. Then it suddenly changes direction, heading straight for Harry, relentlessly pursuing him. Hagrid is following the unfolding game action closely through a pair of powerful binoculars. A new Bludger smashes through one of the tall towers, adding even more chaos to the frenzied scene."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "They scuttle quickly across the floor, their tiny legs moving in a synchronized flurry, before they begin their ascent up the wall, each step carefully placed to maintain balance. Reaching the top, they navigate over the stone window sill with precision, their movements deliberate as they approach the crack in the glass. With a swift motion, they slip through the narrow opening and emerge on the other side. Their attention is drawn to something else on the floor—a pool of water that perfectly reflects the writing on the wall above, capturing their curiosity. Harry's gaze shifts, and he notices something else entirely—a cat, rigid and unmoving, hanging by its tail from a lamp bracket, an unusual and unsettling sight. As students appear at each end of the corridor, their eyes are drawn to the cat, and they fix their gaze suspiciously on Harry, Ron, and Hermione, their expressions filled with doubt. Colin, eager to capture the moment, raises his camera to take a photograph, but before he can click the shutter, someone intervenes and stops him. Draco steps forward and reads aloud the writing on the wall, his voice echoing in the corridor. Filch, determined and forceful, pushes his way through the crowd that has gathered, his eyes widening as he spots his cat. In a swift motion, he reaches out and grabs Harry, his grip firm and accusatory. Dumbledore arrives and takes in the writing on the wall, his eyes then shifting to indicate Harry, Ron, and Hermione, silently acknowledging their presence. Lockhart stands nearby, his gaze fixed on the cat, while Ron, sensing the tension, gives her a warning look. Snape, observing the scene, remains unconvinced, his skepticism evident. Later, the staircases within the castle swing from side to side, shifting into different positions as the children make their way upstairs. Hermione, walking alongside Ron and Harry, turns to them, her expression thoughtful. A portrait on the wall nods in agreement, as if understanding the unspoken conversation. In a classroom, a black and white bird undergoes a transformation, becoming a glass goblet in a display of magical prowess. Ron, eager to try his hand, waves his wand, and Scabbers, his pet rat, morphs into a goblet with a waving rat's tail, a comical yet imperfect transformation. Professor McGonagall, observing the results, seems uncertain, her eyes scanning the expectant faces of the students. Hermione, concerned by the outcome, glances at Ron, who turns to face a smug Draco, their rivalry palpable. Outside the classroom, in the library, Hermione reaches up to a shelf and carefully takes down a book, showing it to Ron and Harry, her expression one of determination. Meanwhile, the Quidditch pitch is alive with energy, its tall spectator towers adorned with heraldic designs, surrounding the oval arena. The players, mounted on their broomsticks, swoop above the arena, soaring high over the heads of the excited crowd. The Slytherin captain, with a determined throw, hurls the Quaffle towards the goal, but the Gryffindor Keeper skillfully knocks it safely away, preventing a score. In a display of agility, a Gryffindor player ducks and dives, grabbing the Quaffle and flying with it, only for it to be knocked away and passed high in the air to a Slytherin player. Harry, marking an opponent, swoops around the back of a tower, hovering as he watches a well-aimed Slytherin pass send the Quaffle flying straight through the goal, prompting ecstatic cheers from the Slytherin supporters as the points are added to the scoreboard. The professors, seated in the grandstand, applaud the play, while the Slytherin captain encourages his team, their green cloaks streaming behind them as they fly in formation. Harry, focused on the game, ducks just in time as a wood bat narrowly misses his head, a close call that leaves him momentarily shaken. Lucius Malfoy and Snape, seated together in the professors' grandstand, watch the match intently, their eyes following the action. Above the arena, Harry and Draco, the two Seekers, hover in search of the elusive Golden Snitch, their eyes scanning the field. A wooden Bludger, with a mind of its own, almost hits Harry, prompting his captain to shout a warning. The Bludger, relentless in its pursuit, hurtles back and smashes Wood's broomstick to smithereens, then turns its attention to Harry, chasing after him with unyielding determination. Hagrid, following the game through a pair of binoculars, watches as a new Bludger smashes through a tall tower, adding to the chaos of the match."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The group scuttles across the floor, up the wall, over the stone window sill, and exits through a crack in the glass, noticing a pool of water reflecting writing on the wall above. Harry spots a cat, stiff as a board, hanging by its tail from a lamp bracket. As students gather at each end of the corridor, they suspiciously eye Harry, Ron, and Hermione. Colin attempts to take a photograph, but someone stops him. Draco reads the writing on the wall aloud as Filch pushes through the crowd, sees his cat, and grabs Harry. Dumbledore observes the writing and indicates Harry, Ron, and Hermione, while Lockhart stares at the cat and Ron gives a warning look. Snape remains unconvinced. Later, as the staircases shift positions, Hermione turns to Ron and Harry while a portrait nods in agreement. In a classroom, a black and white bird transforms into a glass goblet, and Ron's wand turns Scabbers into a goblet with a waving rat's tail, leaving Professor McGonagall uncertain as she looks at the expectant students. Hermione, concerned, turns to face a smug Draco. In the library, Hermione retrieves a book from a shelf and shows it to Ron and Harry. At the Quidditch pitch, surrounded by tall spectator towers adorned with heraldic designs, players swoop above the arena on broomsticks. The Slytherin captain hurls the Quaffle towards the goal, but the Gryffindor Keeper deflects it. A Gryffindor grabs the Quaffle, but it's knocked away and passed to a Slytherin. Harry, marking an opponent, watches as a Slytherin pass sends the Quaffle through the goal, prompting ecstatic cheers from Slytherin supporters and applause from professors. The Slytherin captain rallies his team, who fly in formation with their green cloaks streaming. Harry narrowly avoids a wood bat, while Lucius Malfoy and Snape watch from the grandstand. As Harry and Draco, the Seekers, hover above the arena searching for the Golden Snitch, a Bludger nearly hits Harry. His captain shouts a warning as the Bludger smashes Wood's broomstick and then targets Harry, chasing him. Hagrid follows the game through binoculars as a new Bludger crashes through a tall tower."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "They scuttle across the floor, up the wall, over the stone window sill of the ancient castle, and out through a crack in the glass that had been there for ages. They see something else on the floor. A pool of water reflects writing on the wall above, a mysterious message that seems ominous. Harry, known for his bravery despite his youth, sees something else. A cat, stiff as a board, is hanging by its tail from a lamp bracket that juts out from the wall. Students appear at each end of the corridor. Seeing the cat, which is a frequent companion of the caretaker, they stare suspiciously at Harry, Ron, and Hermione, the trio often found at the center of school adventures. Colin, an eager young photographer known for his enthusiasm, prepares to take a photograph, but somebody stops him. Draco, always keen to cause trouble, reads out the writing on the wall. Filch, the castle's rather irritable caretaker, pushes his way through the gaping crowd. He sees his cat, Mrs. Norris, his beloved companion. He grabs Harry, assuming the worst. Dumbledore, the wise headmaster of the school, sees the writing on the wall. He indicates Harry, Ron, and Hermione, as if considering their involvement. Lockhart, a celebrity professor with questionable skills, stares at the cat. Ron gives her a warning look, aware of Hermione's tendencies to become involved in risky situations. Snape, the Potions Master known for his skepticism, looks unconvinced. Later, the magical staircases swing from side to side into different positions, as they often do, to the delight and confusion of the students. As the children go upstairs, Hermione, the smartest witch of her age, turns to Ron and Harry. A portrait on the wall nods in agreement, as portraits in this magical school often interact with students. A classroom. A black and white bird, part of a Transfiguration lesson, becomes a glass goblet. Ron waves his wand. Scabbers, his pet rat, becomes a goblet with a waving rat's tail, much to his embarrassment. Professor McGonagall, the stern but fair Transfiguration professor, seems uncertain. She looks at the expectant students. Hermione is concerned, as she often is about her studies. Ron turns to face a smug Draco, who loves to taunt him. Outside the classroom. In the library, a vast room filled with magical tomes, Hermione takes down a book from a shelf and shows it to Ron and Harry. Hung with heraldic designs, tall spectator towers surround the oval arena of the Quidditch pitch, where magical sports are played. The players swoop above the arena on their broomsticks, high over the heads of the excited crowd. The Slytherin captain, determined to win, hurls the Quaffle towards the goal, but the Gryffindor Keeper knocks it safely away, showcasing his skills. Ducking and diving, a Gryffindor grabs the Quaffle and flies with it, demonstrating agility. It's knocked away and passed high in the air to a Slytherin. Marking an opponent, Harry swoops around the back of a tower, always on the lookout for the elusive Golden Snitch. He hovers watching as a well-aimed Slytherin pass sends the Quaffle flying straight through the goal. The Slytherin supporters, draped in green and silver, are ecstatic as the points go up on the scoreboard, revealing a lead. The professors applaud, supporting their students' bravery and skill. The Slytherin captain encourages his team. They fly in formation, their green cloaks streaming behind them like banners. Harry ducks as a wood bat, swung by a Beater, narrowly misses his head in the chaotic game. Lucius Malfoy and Snape are watching the match together, sitting in the professors' grandstand, both known for their partiality towards Slytherin. Looking out for the Golden Snitch, the most sought-after ball in the game, Harry and Draco, the two Seekers, hover above the arena. A wooden Bludger, enchanted to disrupt players, almost hits Harry. His captain shouts a warning, knowing the dangers. The Bludger hurtles back. The Bludger smashes Wood's broomstick to smithereens, an unfortunate mishap. Then it turns and heads straight for Harry, chasing after him with relentless intent. Hagrid, the gentle giant and Keeper of Keys and Grounds, is following the game through a pair of binoculars, always supportive of Harry. A new Bludger smashes through a tall tower, adding to the chaos of the match."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "They scuttle across the floor up the wall over the stone window sill and out through a crack in the glass  They see something else on the floor  A pool of water reflects writing on the wall  above  Harry sees something else  A cat stiff as a board is hanging by its tail from a lamp bracket  Students appear at each end of the corridor  Later the staircases swing from side to side into different positions  As the children go upstairs Hermione turns to Ron and Harry  A portrait on the wall nods in agreement  A classroom  A black and white bird becomes a glass goblet  Ron waves his wand  Scabbers becomes a goblet with a waving rat's tail  Professor McGonagall seems uncertain  She looks at the expectant students  Hermione is concerned  Ron turns to face a smug Draco  Outside the classroom  In the library Hermione takes down a book from a shelf and shows it to Ron and Harry  Hung with heraldic designs  tall spectator towers surround the oval arena of the Quidditch pitch  The players swoop above the arena on their broomsticks high over the heads of the excited crowd  The Slytherin captain hurls the Quaffle towards the goal but the Gryffindor Keeper knocks it safely away  Ducking and diving a Gryffindor grabs the Quaffle and flies with it  It's knocked away and passed high in the air to a Slytherin  Marking an opponent Harry swoops around the back of a tower  He hovers watching as a wellaimed Slytherin pass sends the Quaffle flying straight through the goal  The Slytherin supporters are ecstatic as the points go up on the scoreboard  The professors applaud  The Slytherin captain encourages his team  They fly in formation their green cloaks streaming behind them  Harry ducks as a wood bat narrowly misses his head  Lucius Malfoy and Snape are watching the match together sitting in the professors' grandstand  Looking out for the Golden Snitch  Harry and Draco  Seeing the cat they stare suspiciously at Harry  Ron and Hermione  Colin prepares to take a photograph but somebody stops him  Draco reads out the writing on the wall  Filch pushes his way through the gaping crowd  He sees his cat  He grabs Harry  Dumbledore sees the writing on the wall  He indicates Harry  Ron and Hermione  Lockhart stares at the cat  Ron gives her a warning look  Snape looks unconvinced  Later the staircases swing from side to side into different positions  As the children go upstairs Hermione turns to Ron and Harry  A portrait on the wall nods in agreement  A classroom  A black and white bird becomes a glass goblet  Ron waves his wand  Scabbers becomes a goblet with a waving rat's tail  Professor McGonagall seems uncertain  She looks at the expectant students  Hermione is concerned  Ron turns to face a smug Draco  Outside the classroom  In the library Hermione takes down a book from a shelf and shows it to Ron and Harry  Hung with heraldic designs  tall spectator towers surround the oval arena of the Quidditch pitch  The players swoop above the arena on their broomsticks high over the heads of the excited crowd  The Slytherin captain hurls the Quaffle towards the goal but the Gryffindor Keeper knocks it safely away  Ducking and diving a Gryffindor grabs the Quaffle and flies with it  It's knocked away and passed high in the air to a Slytherin  Marking an opponent Harry swoops around the back of a tower  He hovers watching as a wellaimed Slytherin pass sends the Quaffle flying straight through the goal  The Slytherin supporters are ecstatic as the points go up on the scoreboard  The professors applaud  The Slytherin captain encourages his team  They fly in formation their green cloaks streaming behind them  Harry ducks as a wood bat narrowly misses his head  Lucius Malfoy and Snape are watching the match together sitting in the professors' grandstand  Looking out for the Golden Snitch  Harry and Draco  the two Seekers hover above the arena  A wooden Bludger almost hits Harry  His captain shouts a warning  The Bludger hurtles back  The Bludger smashes Wood's broomstick to smithereens  Then it turns and heads straight for Harry chasing after him  Hagrid is following the game through a pair of binoculars  A new Bludger smashes through a tall tower"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "They scuttle across the floor up the wall over the stone window sill and out through a crack in the glass. They see something else on the floor. A pool of water reflects writing on the wall. above. Harry sees something else. A cat stiff as a board is hanging by its tail from a lamp bracket. Students appear at each end of the corridor. Seeing the cat they stare suspiciously at Harry. Ron and Hermione. Colin prepares to take a photograph but somebody stops him. Draco reads out the writing on the wall. Filch pushes his way through the gaping crowd. He sees his cat. He grabs Harry. Dumbledore sees the writing on the wall. He indicates Harry. Ron and Hermione. Lockhart stares at the cat. Ron gives her a warning look. Snape looks unconvinced. Later the staircases swing from side to side into different positions. As the children go upstairs Hermione turns to Ron and Harry. A portrait on the wall nods in agreement. A classroom. A black and white bird becomes a glass goblet. Ron waves his wand. Scabbers becomes a goblet with a waving rat's tail. Professor McGonagall seems uncertain. She looks at the expectant students. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Hermione is concerned. Ron turns to face a smug Draco. Outside the classroom. In the library Hermione takes down a book from a shelf and shows it to Ron and Harry. Hung with heraldic designs. tall spectator towers surround the oval arena of the Quidditch pitch. The players swoop above the arena on their broomsticks high over the heads of the excited crowd. The Slytherin captain hurls the Quaffle towards the goal but the Gryffindor Keeper knocks it safely away. Ducking and diving. a Gryffindor grabs the Quaffle and flies with it. It is knocked away and passed high in the air to a Slytherin. Marking an opponent Harry swoops around the back of a tower. He hovers watching as a wellaimed Slytherin pass sends the Quaffle flying straight through the goal. The Slytherin supporters are ecstatic as the points go up on the scoreboard. The professors applaud. The Slytherin captain encourages his team. They fly in formation their green cloaks streaming behind them. Harry ducks as a wood bat narrowly misses his head. Lucius Malfoy and Snape are watching the match together sitting in the professors' grandstand. Looking out for the Golden Snitch. Harry and Draco. the two Seekers hover above the arena. A wooden Bludger almost hits Harry. His captain shouts a warning. The Bludger hurtles back. The Bludger smashes Wood's broomstick to smithereens. Then it turns and heads straight for Harry chasing after him. Hagrid is following the game through a pair of binoculars. A new Bludger smashes through a tall tower."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "They scuttle across the floor up the wall over the stone window sill and out through a crack in the glass. They see something else on the floor. A pool of water reflects writing on the wall. above. Harry sees something else. A cat stiff as a board is hanging by its tail from a lamp bracket. Students appear at each end of the corridor. Seeing the cat they stare suspiciously at Harry. Ron and Hermione. Colin prepares to take a photograph but somebody stops him. Draco reads out the writing on the wall. Filch pushes his way through the gaping crowd. He sees his cat. He grabs Harry. Dumbledore sees the writing on the wall. He indicates Harry. Ron and Hermione. Lockhart stares at the cat. Ron gives her a warning look. Snape looks unconvinced. Later the staircases swing from side to side into different positions. As the children go upstairs Hermione turns to Ron and Harry. A portrait on the wall nods in agreement. A classroom. A black and white bird becomes a glass goblet. Ron waves his wand. Scabbers becomes a goblet with a waving rat's tail. Professor McGonagall seems uncertain. She looks at the expectant students. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. Hermione is concerned. Ron turns to face a smug Draco. Outside the classroom. In the library Hermione takes down a book from a shelf and shows it to Ron and Harry. Hung with heraldic designs. tall spectator towers surround the oval arena of the Quidditch pitch. The players swoop above the arena on their broomsticks high over the heads of the excited crowd. The Slytherin captain hurls the Quaffle towards the goal but the Gryffindor Keeper knocks it safely away. Ducking and diving. a Gryffindor grabs the Quaffle and flies with it. It is knocked away and passed high in the air to a Slytherin. Marking an opponent Harry swoops around the back of a tower. He hovers watching as a wellaimed Slytherin pass sends the Quaffle flying straight through the goal. The Slytherin supporters are ecstatic as the points go up on the scoreboard. The professors applaud. The Slytherin captain encourages his team. They fly in formation their green cloaks streaming behind them. Harry ducks as a wood bat narrowly misses his head. Lucius Malfoy and Snape are watching the match together sitting in the professors' grandstand. Looking out for the Golden Snitch. Harry and Draco. the two Seekers hover above the arena. A wooden Bludger almost hits Harry. His captain shouts a warning. The Bludger hurtles back. The Bludger smashes Wood's broomstick to smithereens. Then it turns and heads straight for Harry chasing after him. Hagrid is following the game through a pair of binoculars. A new Bludger smashes through a tall tower."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "They scuttle across the floor up the wall over the stone window sill and out through a crack in the glass. They see something else on the floor. A pool of water reflects writing on the wall. above. Harry sees something else. A cat stiff as a board is hanging by its tail from a lamp bracket. Students appear at each end of the corridor. Seeing the cat they stare suspiciously at Harry. Ron and Hermione. Colin prepares to take a photograph but somebody stops him. Draco reads out the writing on the wall. Filch pushes his way through the gaping crowd. He sees his cat. He grabs Harry. Dumbledore sees the writing on the wall. The Slytherin captain encourages his team. They fly in formation their green cloaks streaming behind them. Harry ducks as a wood bat narrowly misses his head. Lucius Malfoy and Snape are watching the match together sitting in the professors' grandstand. Looking out for the Golden Snitch. Harry and Draco. the two Seekers hover above the arena. A wooden Bludger almost hits Harry. His captain shouts a warning. The Bludger hurtles back. The Bludger smashes Wood's broomstick to smithereens. Then it turns and heads straight for Harry chasing after him. Hagrid is following the game through a pair of binoculars. A new Bludger smashes through a tall tower."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "They scuttle across the floor up the wall over the stone window sill and out through a crack in the glass. They see something else on the floor. A pool of water reflects writing on the wall. above. Harry sees something else. A cat stiff as a board is hanging by its tail from a lamp bracket. His captain shouts a warning. The Bludger hurtles back. The Bludger smashes Wood's broomstick to smithereens. Then it turns and heads straight for Harry chasing after him. Hagrid is following the game through a pair of binoculars. A new Bludger smashes through a tall tower."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The geese scuttle across the floor, up the wall, over the stone window sill, and out through a crack in the glass. The squirrels see something else on the floor. A pool of water reflects writing on the wall above. Neville sees something else. A dog, stiff as a board, is hanging by its tail from a lamp bracket. Teachers appear at each end of the corridor. Seeing the dog, they stare suspiciously at Neville, Luna, and Ginny. Percy prepares to take a photograph, but somebody stops him. Seamus reads out the writing on the wall. Oliver pushes his way through the gaping crowd. He sees his dog. He grabs Neville. Sprout sees the writing on the wall. She indicates Neville, Luna, and Ginny. Trelawney stares at the dog. Luna gives her a warning look. Hagrid looks unconvinced. Later, the staircases swing from side to side into different positions. As the adults go upstairs, Ginny turns to Luna and Neville. A portrait on the wall nods in agreement. A classroom. A colorful bird becomes a glass goblet. Luna waves her wand. Trevor becomes a goblet with a waving rat's tail. Flitwick seems uncertain. He looks at the expectant teachers. Ginny is concerned. Luna turns to face a smug Seamus. Outside the classroom. In the library, Ginny takes down a book from a shelf and shows it to Luna and Neville. Hung with heraldic designs, tall spectator towers surround the oval arena of the Quidditch pitch. The spectators swoop above the arena on their broomsticks, high over the heads of the excited crowd. The Ravenclaw captain hurls the Quaffle towards the goal, but the Hufflepuff Keeper knocks it safely away. Ducking and diving, a Ravenclaw grabs the Quaffle and flies with it. It's knocked away and passed high in the air to a Hufflepuff. Marking an opponent, Neville swoops around the back of a tower. He hovers watching as a well-aimed Ravenclaw pass sends the Quaffle flying straight through the goal. The Ravenclaw supporters are ecstatic as the points go up on the scoreboard. The ghosts applaud. The Ravenclaw captain encourages his team. They fly in formation, their blue cloaks streaming behind them. Neville ducks as a wood bat narrowly misses his head. Sirius Black and Trelawney are watching the match together, sitting in the ghosts' grandstand. Looking out for the Golden Snitch, Neville and Seamus, the two Seekers, hover above the arena. A wooden Bludger almost hits Neville. Her captain shouts a warning. The Bludger hurtles back. The Bludger smashes Wood's broomstick to smithereens. Then it turns and heads straight for Neville, chasing after her. Uncle Vernon is following the game through a pair of binoculars. A new Bludger smashes through a tall tower."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "They scuttle across the carpet, up the bookshelf, over the clay flowerpot, and out through a tear in the curtain. They see something else on the carpet. A puddle of juice reflects writing on the ceiling above. Harry sees something else. A dog, stiff as a board, is hanging by its tail from a fan bracket. Students appear at each end of the hallway. Seeing the dog, they stare suspiciously at Harry, Ron, and Hermione. Colin prepares to take a photograph, but somebody stops him. Draco reads out the writing on the ceiling. Filch pushes his way through the gaping crowd. He sees his dog. He grabs Harry. Dumbledore sees the writing on the ceiling. He indicates Harry, Ron, and Hermione. Lockhart stares at the dog. Ron gives her a warning look. Snape looks unconvinced. Later, the escalators swing from side to side into different positions. As the children go upstairs, Hermione turns to Ron and Harry. A mirror on the wall nods in agreement. A laboratory. A black and white butterfly becomes a glass cup. Ron waves his wand. Scabbers becomes a cup with a waving rat's tail. Professor McGonagall seems uncertain. She looks at the expectant students. Hermione is concerned. Ron turns to face a smug Draco. Outside the laboratory. In the archive, Hermione takes down a scroll from a cubicle and shows it to Ron and Harry. Draped with celestial designs, towering observation platforms surround the circular rink of the Quidditch pitch. The players swoop above the rink on their carpets, high over the heads of the excited crowd. The Slytherin captain hurls the Quaffle towards the goal, but the Gryffindor Keeper knocks it safely away. Ducking and diving, a Gryffindor grabs the Quaffle and sails with it. It's knocked away and passed high in the air to a Slytherin. Marking an opponent, Harry swoops around the back of a platform. He hovers watching as a well-aimed Slytherin pass sends the Quaffle flying straight through the goal. The Slytherin supporters are ecstatic as the points go up on the screen. The professors applaud. The Slytherin captain encourages his team. They fly in formation, their green scarves streaming behind them. Harry ducks as a metal stick narrowly misses his head. Lucius Malfoy and Snape are watching the match together, sitting in the professors' pavilion. Looking out for the Golden Snitch, Harry and Draco, the two Seekers, hover above the rink. A metal Bludger almost hits Harry. His captain shouts a warning. The Bludger hurtles back. The Bludger smashes Wood's carpet to bits. Then it turns and heads straight for Harry, chasing after him. Hagrid is following the game through a pair of telescopes. A new Bludger smashes through a tall platform."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "They shuffle across the floor, glide up the wall, bypass the stone window sill, and squeeze through a crack in the glass. They notice something else on the floor. A pool of water distorts writing on the wall above. Harry notices something else. A cat, as still as a statue, is dangling by its tail from a lamp bracket. Students emerge at each end of the corridor. Observing the cat, they whisper cautiously at Harry, Ron, and Hermione. Colin aims to sketch a photograph, but somebody interrupts him. Draco recites the writing on the wall. Filch barges his way through the murmuring crowd. He recognizes his cat. He confronts Harry. Dumbledore examines the writing on the wall. He gestures toward Harry, Ron, and Hermione. Lockhart shrugs at the cat. Ron gives her a curious look. Snape looks skeptical. Later, the staircases twist from side to side into varying positions. As the children move upstairs, Hermione whispers to Ron and Harry. A portrait on the wall winks in agreement. A classroom. A black and white bird shifts into a glass goblet. Ron flicks his wand. Scabbers morphs into a goblet with a twitching rat's tail. Professor McGonagall appears hesitant. She glances at the eager students. Hermione seems uneasy. Ron turns to examine a smug Draco. Outside the classroom. In the library, Hermione retrieves a book from a shelf and displays it to Ron and Harry. Draped with heraldic designs, towering spectator towers enclose the oval arena of the Quidditch pitch. The players glide above the arena on their broomsticks, far above the heads of the excited crowd. The Slytherin captain tosses the Quaffle towards the goal, but the Gryffindor Keeper deflects it safely away. Twisting and turning, a Gryffindor seizes the Quaffle and zips with it. It's deflected and lobbed high in the air to a Slytherin. Trailing an opponent, Harry loops around the back of a tower. He lingers observing as a precise Slytherin pass rockets the Quaffle soaring straight through the goal. The Slytherin supporters are jubilant as the points illuminate on the scoreboard. The professors cheer. The Slytherin captain motivates his team. They soar in formation, their green cloaks billowing behind them. Harry dodges as a wood bat narrowly grazes his head. Lucius Malfoy and Snape are assessing the match together, seated in the professors' grandstand. Searching for the Golden Snitch, Harry and Draco, the two Seekers, float above the arena. A wooden Bludger almost grazes Harry. His captain issues a warning. The Bludger ricochets back. The Bludger splinters Wood's broomstick to fragments. Then it veers and charges straight for Harry, pursuing him. Hagrid is observing the game through a pair of binoculars. A fresh Bludger crashes through a towering structure."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The curtains shuffle across the ceiling, up the door, over the metal chimney top, and out through a hole in the mirror. The plants notice something else on the ceiling. A mound of sand reflects images on the door above. Alex notices something else. A bicycle, rigid as a pole, is hanging by its seat from a candle holder. Books appear at each end of the hallway. Noticing the bicycle, they glare mistrustfully at Alex, Sam, and Jamie. Mark prepares to take a sketch, but someone stops him. Max announces out the images on the door. Charlie shoves his way through the silent gathering. He notices his bicycle. He grabs Alex. Morgan notices the images on the door. Morgan indicates Alex, Sam, and Jamie. Taylor stares at the bicycle. Sam gives it a cautionary glance. Jordan seems skeptical. Later, the bridges swing from side to side into different positions. As the animals go downstairs, Jamie turns to Sam and Alex. A sculpture on the door nods in agreement. A basement. A red and blue fish becomes a metal spoon. Sam waves its brush. Gizmo becomes a spoon with a waving lizard's tongue. Dr. Brown seems hesitant. She looks at the hopeful books. Jamie is worried. Sam turns to face a pleased Max. Outside the basement. In the storeroom, Jamie takes down a scroll from a rack and shows it to Sam and Alex. Draped with floral patterns, short spectator tents surround the rectangular garden of the archery range. The competitors swoop above the garden on their kites, low over the feet of the amazed spectators. The Sunflower captain flings the Arrow towards the target, but the Rose Keeper deflects it effortlessly. Gliding and weaving, a Rose catches the Arrow and darts with it. It's repelled and tossed high in the sky to a Sunflower. Guarding a rival, Alex glides around the back of a tent. It hovers observing as a precise Sunflower throw sends the Arrow speeding directly through the target. The Sunflower fans are thrilled as the numbers light up on the tally board. The coaches cheer. The Sunflower captain motivates its squad. They glide in alignment, their blue capes trailing behind them. Alex dodges as a metal axe scarcely misses its hand. Bruce and Jordan are observing the event together, seated in the coaches' pavilion. Scanning for the Silver Coin, Alex and Max, the two Spotters, hover below the garden. A metal Hammer nearly strikes Alex. Its captain yells a caution. The Hammer speeds back. The Hammer demolishes Stone's kite to splinters. Then it swivels and zooms straight for Alex, pursuing after it. Gordon is following the event through a pair of telescopes. A new Hammer obliterates through a short tent."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "They hop across the floor, down the hallway, around the stone window sill, and in through a crack in the glass. They notice something else on the floor. A puddle of water catches reflections of writing on the wall above. Steve notices something else. A dog, rigid as a plank, is dangling by its tail from a tree branch. Teachers emerge at each end of the passage. Observing the dog, they glare suspiciously at Steve, Jack, and Emily. Brian prepares to sketch the scene, but someone halts him. Victor recites the writing on the wall. George weaves his way through the astonished gathering. He notices his dog. He yanks Steve. Victoria interprets the writing on the wall. She gestures toward Steve, Jack, and Emily. Martin examines the dog. Jack offers him a cautious glance. Paul remains doubtful. Later, the hallways rotate from side to side into various alignments. As the teenagers ascend, Emily turns to Jack and Steve. A statue on the wall shakes its head in agreement. A study room. A colorful fish becomes a crystal chalice. Jack shakes his wand. Whiskers transforms into a chalice with a flickering mouse's tail. Ms. Johnson appears unsure. She glances at the attentive teenagers. Emily is troubled. Jack turns to face a smug Victor. Outside the study room. In the archives, Emily retrieves a manuscript from a shelf and presents it to Jack and Steve. Draped with intricate patterns, towering observation platforms enclose the circular field of the Quidditch pitch. The athletes glide above the field on their broomsticks, far above the heads of the eager audience. The Ravenclaw captain launches the Quaffle towards the goal, but the Hufflepuff Keeper deflects it securely away. Swooping and soaring, a Hufflepuff seizes the Quaffle and flies with it. It's deflected and tossed high in the air to a Ravenclaw. Guarding an adversary, Steve glides around the rear of a platform. He hovers observing as an expert Ravenclaw pass sends the Quaffle soaring directly through the goal. The Ravenclaw supporters are thrilled as the score tallies on the scoreboard. The mentors commend. The Ravenclaw captain motivates his team. They soar in formation, their blue cloaks billowing behind them. Steve dodges as a wooden staff narrowly misses his head. Nathaniel and Paul are observing the match together, seated in the mentors’ pavilion. Scanning for the Golden Snitch, Steve and Victor, the two Seekers, float above the field. A metal Bludger almost strikes Steve. His captain calls out a caution. The Bludger speeds back. The Bludger fragments Tammy's broomstick into pieces. Then it turns and pursues Steve, chasing after him. Gregory is observing the game through a pair of field glasses. A different Bludger crashes through a towering stand."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "They shuffle across the carpet, down the ceiling, under the metal door frame, and into a gap in the wood. They notice something else on the table. A pile of sand highlights scribbles on the ceiling below. Harry notices something else. A dog, rigid as a statue, is dangling by its paw from a curtain rod. Students emerge at each side of the hallway. Noticing the dog, they glance suspiciously at Harry, Ron, and Hermione. Colin aims to paint a sketch, but somebody interrupts him. Draco announces the scribbles on the ceiling. Filch shoves his way through the astonished mob. He notices his dog. He seizes Harry. Dumbledore notices the scribbles on the ceiling. He gestures toward Harry, Ron, and Hermione. Lockhart glares at the dog. Ron gives her a cautionary glance. Snape looks doubtful. Later, the elevators swing from side to side into alternate spots. As the children proceed downstairs, Hermione turns to Ron and Harry. A tapestry on the ceiling nods in agreement. A classroom. A red and yellow snake transforms into a ceramic vase. Ron flicks his wand. Scabbers transforms into a vase with a flicking rat's tail. Professor McGonagall appears hesitant. She glances at the eager students. Hermione is anxious. Ron turns to glance at a smug Draco. Outside the classroom. In the library, Hermione pulls down a map from a drawer and presents it to Ron and Harry. Draped with mystical patterns, vast viewing tents surround the circular courtyard of the Quidditch field. The players glide around the field on their carpet squares, low over the heads of the enthused crowd. The Slytherin leader tosses the Quaffle towards the hoop, but the Gryffindor Guardian swats it securely aside. Swooping and diving, a Gryffindor clutches the Quaffle and glides with it. It's swatted away and passed low in the air to a Slytherin. Stalking a rival, Harry glides behind the edge of a tent. He waits observing as a precise Slytherin throw sends the Quaffle soaring directly through the hoop. The Slytherin supporters are thrilled as the scores rise on the scoreboard. The professors cheer. The Slytherin leader motivates his team. They glide in formation, their yellow sashes flowing behind them. Harry dodges as a stone ball narrowly misses his shoulder. Lucius Malfoy and Snape are observing the game together, sitting in the professors' viewing stand. Searching for the Golden Ring, Harry and Draco, the two Seekers, hover below the field. A metal Bludger nearly strikes Harry. His leader yells a caution. The Bludger careens forward. The Bludger shatters Wood's carpet square to fragments. Then it spins and veers directly toward Harry, pursuing him. Hagrid is observing the match through a pair of telescopes. An old Bludger crashes into a wide tent."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The ants drift across the ceiling, down the stair, under the metallic door hinge, and in through a tear in the curtain. They glimpse something else on the ceiling. A puddle of oil distorts carvings on the ceiling below. Sally glimpses something alternative. A squirrel, stiff as a branch, is dangling by its paw from a lantern hanger. Teachers vanish at each edge of the courtyard. Spotting the squirrel, they frown warily at Sally, Mike, and Jenny. Tom plans to draw a sketch, but someone nudges him. Lisa whispers the carvings on the ceiling. Sam elbows his route against the murmuring throng. He glimpses his squirrel. He snatches Sally. Principal sees the carvings below the ceiling. He gestures towards Sally, Mike, and Jenny. Coach gapes at the squirrel. Mike sends him a cautious glance. Jane looks skeptical. Earlier, the chairs spin up and down into alternate orientations. As the teenagers descend the ladder, Jenny twists toward Mike and Sally. A statue in the yard shrugs in disagreement. A chamber. A crimson and orange lizard transforms into a stone chalice. Mike flutters his pencil. Fluffy converts into a chalice with a fluttering rabbit's foot. Instructor seems indecisive. She frowns at the hopeful teenagers. Jenny feels confused. Mike rotates to confront a smirking Lisa. Near the chamber. In the study, Jenny pulls up a painting from a drawer and hands it to Mike and Sally. Draped with geometric patterns, short audience stands border the rectangular ring of the basketball court. The gymnasts glide over the ring on their skateboards, low above the hands of the quiet audience. The Ravens captain throws the frisbee towards the basket, but the Tigers Goalie swats it wildly away. Sliding and soaring, a Tiger seizes the frisbee and rolls with it. It's intercepted and tossed low through the air to a Raven. Avoiding a competitor, Sally loops around the front of a stand. She perches observing as a poorly tossed Raven throw sends the frisbee bouncing straight under the basket. The Raven fans are silent as the numbers drop off the signboard. The students whisper. The Raven captain cautions her squad. They jog in disarray, their red bandanas trailing ahead of them. Sally dives as a leather glove narrowly taps her shoulder. Lucy Langston and Jane are observing the show together, standing in the students' balcony. Listening for the Silver Wing, Sally and Lisa, the duo Watchers, stand below the ring. A plastic Frisbee almost grazes Sally. Her captain yells a warning. The Frisbee circles over. The Frisbee breaks Tree's skateboard to splinters. Then it spins and aims directly for Sally, trailing behind her. Oliver is studying the race through a set of glasses. A small Frisbee spins through a short stand."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Creatures scuttle across the floor and out through a crack in the glass. Harry sees a stiff cat hanging by its tail from a lamp bracket, attracting suspicious stares from students at Ron, Harry, and Hermione. Draco reads writing on the wall, as Filch, seeing his cat, accuses Harry. Dumbledore, Lockhart, and Snape observe the scene, and Filch accuses Harry. Later, moving staircases transport the students upstairs, where Hermione shares a book with Ron and Harry in the library. At the Quidditch pitch, players fly above the oval arena on broomsticks. The Slytherin captain aims for the goal, but the Gryffindor Keeper blocks it. A Gryffindor grabs the Quaffle, but Slytherin scores. Professors and supporters cheer as Slytherin players fly in formation. Lucius Malfoy and Snape watch from the grandstand. Seeking the Golden Snitch, Harry and Draco hover above until a Bludger targets Harry. Hagrid watches as it smashes Wood's broomstick and chases Harry."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "A new Bludger smashes through a tall tower Hagrid is following the game through a pair of binoculars  Then it turns and heads straight for Harry chasing after him  The Bludger smashes Wood's broomstick to smithereens  The Bludger hurtles back  His captain shouts a warning  A wooden Bludger almost hits Harry  the two Seekers hover above the arena  Harry and Draco  Looking out for the Golden Snitch  Lucius Malfoy and Snape are watching the match together sitting in the professors' grandstand  Harry ducks as a wood bat narrowly misses his head  They fly in formation their green cloaks streaming behind them  The Slytherin captain encourages his team  The professors applaud  The Slytherin supporters are ecstatic as the points go up on the scoreboard  He hovers watching as a wellaimed Slytherin pass sends the Quaffle flying straight through the goal  Marking an opponent Harry swoops around the back of a tower  It's knocked away and passed high in the air to a Slytherin  Ducking and diving a Gryffindor grabs the Quaffle and flies with it  The Slytherin captain hurls the Quaffle towards the goal but the Gryffindor Keeper knocks it safely away  The players swoop above the arena on their broomsticks high over the heads of the excited crowd  tall spectator towers surround the oval arena of the Quidditch pitch  Hung with heraldic designs  In the library Hermione takes down a book from a shelf and shows it to Ron and Harry  Outside the classroom  Ron turns to face a smug Draco  Hermione is concerned  She looks at the expectant students  Professor McGonagall seems uncertain  Scabbers becomes a goblet with a waving rat's tail  Ron waves his wand  A black and white bird becomes a glass goblet  A classroom  A portrait on the wall nods in agreement  As the children go upstairs Hermione turns to Ron and Harry  Later the staircases swing from side to side into different positions  Snape looks unconvinced  Ron gives her a warning look  Lockhart stares at the cat  Ron and Hermione  He indicates Harry  Dumbledore sees the writing on the wall  He grabs Harry  He sees his cat  Filch pushes his way through the gaping crowd  Draco reads out the writing on the wall  Colin prepares to take a photograph but somebody stops him  Ron and Hermione  Seeing the cat they stare suspiciously at Harry  Students appear at each end of the corridor  A cat stiff as a board is hanging by its tail from a lamp bracket  Harry sees something else  above  A pool of water reflects writing on the wall  They see something else on the floor  They scuttle across the floor up the wall over the stone window sill and out through a crack in the glass "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Hung with heraldic designs  Outside the classroom  They scuttle across the floor up the wall over the stone window sill and out through a crack in the glass  the two Seekers hover above the arena  He hovers watching as a wellaimed Slytherin pass sends the Quaffle flying straight through the goal  Ron and Hermione  Harry and Draco  The Slytherin captain encourages his team  Snape looks unconvinced  The players swoop above the arena on their broomsticks high over the heads of the excited crowd  Ron turns to face a smug Draco  Filch pushes his way through the gaping crowd  Colin prepares to take a photograph but somebody stops him  above  Lucius Malfoy and Snape are watching the match together sitting in the professors' grandstand  Professor McGonagall seems uncertain  She looks at the expectant students  Ron waves his wand  Scabbers becomes a goblet with a waving rat's tail  Ducking and diving a Gryffindor grabs the Quaffle and flies with it  They see something else on the floor  In the library Hermione takes down a book from a shelf and shows it to Ron and Harry  As the children go upstairs Hermione turns to Ron and Harry  Seeing the cat they stare suspiciously at Harry  tall spectator towers surround the oval arena of the Quidditch pitch  The Bludger smashes Wood's broomstick to smithereens  Later the staircases swing from side to side into different positions  Ron and Hermione  The Bludger hurtles back  They fly in formation their green cloaks streaming behind them  His captain shouts a warning  He indicates Harry  It's knocked away and passed high in the air to a Slytherin  A wooden Bludger almost hits Harry  The Slytherin supporters are ecstatic as the points go up on the scoreboard  He grabs Harry  A portrait on the wall nods in agreement  Marking an opponent Harry swoops around the back of a tower  Draco reads out the writing on the wall  Then it turns and heads straight for Harry chasing after him  Hermione is concerned  Lockhart stares at the cat  A black and white bird becomes a glass goblet  Students appear at each end of the corridor  Looking out for the Golden Snitch  A cat stiff as a board is hanging by its tail from a lamp bracket  Ron gives her a warning look  Dumbledore sees the writing on the wall  The professors applaud  A pool of water reflects writing on the wall  Harry sees something else  Harry ducks as a wood bat narrowly misses his head  He sees his cat  The Slytherin captain hurls the Quaffle towards the goal but the Gryffindor Keeper knocks it safely away  A classroom  Hagrid is following the game through a pair of binoculars  A new Bludger smashes through a tall tower"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Hermione is concerned  Ron turns to face a smug Draco  Outside the classroom  In the library Hermione takes down a book from a shelf and shows it to Ron and Harry  Hung with heraldic designs  tall spectator towers surround the oval arena of the Quidditch pitch  The players swoop above the arena on their broomsticks high over the heads of the excited crowd  The Slytherin captain hurls the Quaffle towards the goal but the Gryffindor Keeper knocks it safely away  Ducking and diving a Gryffindor grabs the Quaffle and flies with it  It's knocked away and passed high in the air to a Slytherin  Marking an opponent Harry swoops around the back of a tower  He hovers watching as a wellaimed Slytherin pass sends the Quaffle flying straight through the goal  The Slytherin supporters are ecstatic as the points go up on the scoreboard  The professors applaud  The Slytherin captain encourages his team  They fly in formation their green cloaks streaming behind them  Harry ducks as a wood bat narrowly misses his head  Lucius Malfoy and Snape are watching the match together sitting in the professors' grandstand  Looking out for the Golden Snitch  Harry and Draco  the two Seekers hover above the arena  A wooden Bludger almost hits Harry  His captain shouts a warning  The Bludger hurtles back  The Bludger smashes Wood's broomstick to smithereens  Then it turns and heads straight for Harry chasing after him  Hagrid is following the game through a pair of binoculars  A new Bludger smashes through a tall tower They scuttle across the floor up the wall over the stone window sill and out through a crack in the glass  They see something else on the floor  A pool of water reflects writing on the wall  above  Harry sees something else  A cat stiff as a board is hanging by its tail from a lamp bracket  Students appear at each end of the corridor  Seeing the cat they stare suspiciously at Harry  Ron and Hermione  Colin prepares to take a photograph but somebody stops him  Draco reads out the writing on the wall  Filch pushes his way through the gaping crowd  He sees his cat  He grabs Harry  Dumbledore sees the writing on the wall  He indicates Harry  Ron and Hermione  Lockhart stares at the cat  Ron gives her a warning look  Snape looks unconvinced  Later the staircases swing from side to side into different positions  As the children go upstairs Hermione turns to Ron and Harry  A portrait on the wall nods in agreement  A classroom  A black and white bird becomes a glass goblet  Ron waves his wand  Scabbers becomes a goblet with a waving rat's tail  Professor McGonagall seems uncertain  She looks at the expectant students "
        }
      ]
    }
  ]
}