{
  "ground_truth": "Chasing after Harry, the Bludger crashes through the towers one by one. Harry swoops lower to the grass, but the Bludger follows him closely. Draco watches with a smug expression on his face as the Bludger crashes through another tower. Harry flies back over the arena to see Draco hovering in front of him, and suddenly he sees the Golden Snitch beside Draco's head. They both duck as the Bludger hurtles past. Then Harry heads for the Snitch, closely followed by Draco, who elbows him out of the way. Draco takes the lead as the Snitch disappears under the wooden scaffolding supporting the spectators' stands. Draco flies after it, closely followed by Harry, who swerves to avoid a solid wooden beam. The Snitch is too fast for Draco's grasping fingers, and Harry is still being chased by the heavy wooden Bludger. Determined to stay ahead, Draco grits his teeth and looks around in dismay as Harry catches him up and gradually overtakes. Now, close behind Draco, the heavy Bludger crashes into the wooden beams. They weave over and under the wooden struts until Draco catches up again and bashes Harry in the ribs. They fly neck and neck, the Snitch just out of reach, as they flash past Colin with his camera, who ducks. The Bludger flies over his head and smashes through a wooden support. Harry takes the lead again, and the Bludger streaks past them both, weaving from side to side in front of them and smashing holes in the sides of the structure. Suddenly, it turns and hurtles back towards them, and Draco's broomstick catches on a wooden strut. He somersaults into the air and lands heavily on the grass of the arena while Harry continues pursuing the Golden Snitch. As Harry stretches out his hand to grasp it, a rogue Bludger smashes into his arm. Wincing with pain, he grasps his broomstick between his knees, stretches out his good hand, and grabs the Snitch. Then he overbalances, falls off, and lands on his back on the soft sand beneath the goal post, where his friends rush to join him. The Bludger hits the sand beside Harry, and Hermione's spell works, causing the Bludger to explode in mid-air. Everyone runs towards Harry, and Lockhart pushes up Harry's sleeve as Ron and Hagrid look alarmed. Harry's arm goes completely limp and floppy, and he folds the wrist back on itself. Afterward, in the hospital wing, he drinks some medicine. Late at night, while Harry is lying fast asleep, a strange noise wakes him. He opens his eyes, sits up, and looks around, but the room seems empty until he puts on his glasses and sees a figure sitting at the end of his bed. The figure's fingers are covered in bandages, and Dobby jumps down.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Pursuing after Harry, the Bludger smashes through the towers one by one. Harry dives lower to the grass, but the Bludger trails him closely. Draco observes with a smug look on his face as the Bludger smashes through another tower. Harry flies back over the arena to see Draco hovering in front of him, and suddenly he notices the Golden Snitch beside Draco's head. They both duck as the Bludger speeds past. Then Harry heads for the Snitch, closely trailed by Draco, who elbows him out of the way. Draco takes the lead as the Snitch vanishes beneath the wooden scaffolding supporting the spectators' stands. Draco flies after it, closely trailed by Harry, who swerves to evade a solid wooden beam. The Snitch is too swift for Draco's grasping fingers, and Harry is still being pursued by the heavy wooden Bludger. Determined to remain ahead, Draco clenches his teeth and looks around in dismay as Harry catches him up and gradually overtakes. Now, close behind Draco, the heavy Bludger smashes into the wooden beams. They weave over and under the wooden struts until Draco catches up again and strikes Harry in the ribs. They fly side by side, the Snitch just out of reach, as they flash past Colin with his camera, who ducks. The Bludger flies over his head and shatters through a wooden support. Harry takes the lead again, and the Bludger streaks past them both, weaving from side to side in front of them and shattering holes in the sides of the structure. Suddenly, it turns and speeds back towards them, and Draco's broomstick catches on a wooden strut. He somersaults into the air and lands heavily on the grass of the arena while Harry continues chasing the Golden Snitch. As Harry stretches out his hand to seize it, a rogue Bludger smashes into his arm. Wincing with pain, he grips his broomstick between his knees, stretches out his good hand, and snatches the Snitch. Then he overbalances, tumbles off, and lands on his back on the soft sand beneath the goal post, where his allies rush to join him. The Bludger hits the sand beside Harry, and Hermione's spell works, causing the Bludger to explode in mid-air. Everyone runs towards Harry, and Lockhart pushes up Harry's sleeve as Ron and Hagrid look alarmed. Harry's arm goes completely limp and floppy, and he folds the wrist back on itself. Afterward, in the infirmary wing, he drinks some potion. Late at night, while Harry is lying fast asleep, a strange sound wakes him. He opens his eyes, sits up, and looks around, but the room seems empty until he puts on his glasses and sees a figure sitting at the end of his bed. The figure's fingers are covered in bandages, and Dobby jumps down."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Chasing after Harry, the towers are crashed through one by one by the Bludger. The grass is swooped lower to by Harry, but he is followed closely by the Bludger. Draco, with a smug expression on his face, watches as another tower is crashed through by the Bludger. The arena is flown back over by Harry to see Draco hovering in front of him, and suddenly the Golden Snitch is seen by him beside Draco’s head. As the Bludger hurtles past, they both duck. Then, the Snitch is headed for by Harry, followed closely by Draco, who elbows him out of the way. The lead is taken by Draco as the Snitch disappears under the wooden scaffolding supporting the spectators’ stands. It is flown after by Draco, closely followed by Harry, who swerves to avoid a solid wooden beam. The Snitch is too fast for Draco’s grasping fingers, and the heavy wooden Bludger is still chasing Harry. Determined to stay ahead, Draco grits his teeth and looks around in dismay as he is caught up and gradually overtaken by Harry. Now, close behind Draco, the wooden beams are crashed into by the heavy Bludger. Over and under the wooden struts they are weaved until Harry is caught up with again by Draco, who bashes him in the ribs. Neck and neck they fly, the Snitch just out of reach, as Colin is flashed past with his camera, whom they duck. Over his head, the Bludger flies and a wooden support is smashed through. The lead is taken again by Harry, and past them both, the Bludger streaks, weaving from side to side in front of them and holes are smashed in the sides of the structure. Suddenly, it is turned and hurtled back towards them, and a wooden strut catches Draco’s broomstick. He is somersaulted into the air and lands heavily on the grass of the arena while the Golden Snitch is continued to be pursued by Harry. As his hand is stretched out by Harry to grasp it, a rogue Bludger smashes into his arm. Wincing with pain, the broomstick is grasped between his knees, a good hand is stretched out, and the Snitch is grabbed by Harry. Then, he overbalances, is fallen off, and lands on his back on the soft sand beneath the goal post, where he is rushed to by his friends to join him. The sand beside Harry is hit by the Bludger, and Hermione’s spell is worked, causing an explosion of the Bludger in mid-air. Towards Harry everyone runs, and Harry's sleeve is pushed up by Lockhart as alarmed looks are given by Ron and Hagrid. Completely limp and floppy goes Harry’s arm, and the wrist is folded back on itself by him. Afterward, in the hospital wing, some medicine is drunk by him. Late at night, while fast asleep, Harry is woken by a strange noise. His eyes are opened, he sits up, and he looks around, but the room seems empty until his glasses are put on and a figure is seen sitting at the end of his bed. The figure’s fingers are covered in bandages, and down jumps Dobby."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Chasing after Harry, the Bludger smashes through the towers. Harry swoops low to the grass, with the Bludger in close pursuit. Draco watches smugly as it hits another tower. Flying over the arena, Harry spots Draco with the Golden Snitch by his head. Both duck as the Bludger zooms past, and Harry pursues the Snitch, with Draco elbowing him aside. Draco leads as the Snitch vanishes under the wooden stands. They both follow, Harry narrowly missing a beam. The Snitch eludes Draco, while the Bludger continues to chase Harry. Determined, Draco looks around as Harry overtakes him. The Bludger crashes into beams as they weave through the struts. Draco regains ground and hits Harry's ribs. Racing side by side, the Snitch remains out of reach. They pass Colin, who ducks as the Bludger flies overhead. Harry retakes the lead, and the Bludger turns back, causing Draco to somersault to the arena grass. As Harry reaches for the Snitch, a rogue Bludger hits his arm. Despite the pain, he secures the Snitch and falls onto the sand. His friends rush to him as Hermione's spell explodes the Bludger. Lockhart examines Harry's limp arm, and he later drinks medicine in the hospital wing. At night, a noise wakes Harry; he sees a bandaged figure, and Dobby emerges."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Harry, chased by a Bludger, swoops to the grass. Draco smirks as the Bludger wrecks another tower. Suddenly, Harry spots the Golden Snitch near Draco. They duck as the Bludger passes, and Harry races for the Snitch with Draco elbowing past him. The Snitch disappears under the stands, and Draco pursues with Harry avoiding beams. The Snitch eludes Draco, and Harry is still pursued by the Bludger. Draco grits his teeth as Harry overtakes him. The Bludger crashes into beams, and Draco bashes Harry. They fly evenly, the Snitch just out of reach, as Colin ducks from the Bludger. Harry leads again, with the Bludger wreaking havoc. Draco's broom catches a strut, and he falls, while Harry chases the Snitch. A Bludger hits Harry's arm, but he grabs the Snitch, overbalances, and lands on the sand. His friends rush over as Hermione's spell explodes the Bludger. Lockhart examines Harry's limp arm, and later in the hospital we see Harry wake to find Dobby, fingers bandaged, at his bed."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Chasing after Harry with relentless determination, the Bludger crashes destructively through the towers one by one, showing no mercy. Harry, in a desperate attempt to evade it, swoops lower to the grassy field, but the persistent Bludger remains hot on his trail. Meanwhile, Draco watches with a satisfied, smug expression spread across his face as the Bludger shatters another tower with a loud, resounding crash. As Harry expertly maneuvers over the arena, he notices Draco hovering directly in front of him, and his eyes suddenly spot the elusive Golden Snitch hovering just beside Draco's head. Both Harry and Draco instinctively duck as the Bludger hurtles perilously past them. Then, without missing a beat, Harry makes a decisive move towards the Snitch, with Draco not far behind, elbowing Harry aggressively out of the path. Draco momentarily takes the lead as the ever-elusive Snitch vanishes beneath the intricate wooden scaffolding that supports the spectators' stands. Draco races after it with fervor, closely pursued by Harry, who skillfully swerves to avoid colliding with a solid wooden beam in his path. However, the Snitch proves too fast and nimble for Draco's desperately grasping fingers, and Harry remains relentlessly pursued by the ferocious, heavy wooden Bludger.\n\nDetermined and resolute to maintain his lead, Draco grits his teeth in frustration and glances around in dismay when Harry catches up to him and gradually overtakes his position. With the heavy Bludger now dangerously close behind Draco, it crashes violently into the wooden beams, creating a cacophony of splintering wood. They skillfully weave over and under the wooden struts of the structure, and Draco manages to catch up once more, bashing Harry forcefully in the ribs as he does so. Both flyers are neck and neck, the precious Snitch tantalizingly just beyond their reach, as they flash past Colin, who is preoccupied with his camera and ducks just in time. The Bludger surges over Colin's head and smashes through yet another wooden support with a deafening crash. Regaining the lead, Harry and the pesky Bludger streak past both him and Draco, weaving erratically from side to side in front of them, creating more holes in the structure's sides. Suddenly, it makes a sharp turn and hurtles back toward them with alarming speed, and Draco's broomstick snags on a wooden strut. This causes him to somersault through the air and land heavily on the grassy expanse of the arena as Harry tenaciously continues his pursuit of the Golden Snitch.\n\nAs Harry stretches out his hand in a final effort to grasp the Snitch, an unpredictable rogue Bludger strikes him with force, smashing into his arm. Wincing in excruciating pain, Harry grips his broomstick tightly between his knees, stretching out his good hand with determination and successfully manages to grab the elusive Snitch. Then, losing balance, he tumbles off and lands with a thud on his back on the soft sand beneath the goal post, where his concerned friends rush to his side. The Bludger hits the sand not far from Harry, and Hermione's spell takes effect, causing the Bludger to explode in mid-air with a dramatic burst. Everyone runs urgently towards Harry, while Lockhart pushes up Harry's sleeve to assess the damage, as Ron and Hagrid look on with alarmed expressions. Harry's arm goes completely limp, floppy and unresponsive, and he demonstrates this by folding the wrist unnaturally back on itself. Later, in the quiet of the hospital wing, he drinks some foul-tasting medicine. In the stillness of the night, while Harry is lying fast asleep, a strange and unsettling noise stirs him awake. He opens his eyes, sits up cautiously, and gazes around the dimly lit room, which seems empty until he puts on his glasses and spots a mysterious figure sitting at the end of his bed. The figure's fingers are wrapped in bandages, and, with a familiar jump, Dobby reveals himself by hopping down."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With relentless and unwavering determination, the Bludger relentlessly pursues Harry, crashing destructively through the towers one by one, showing absolutely no mercy in its path of chaos. In a desperate attempt to evade the menacing Bludger, Harry swoops lower, closer to the grassy expanse of the field; yet, despite his efforts, the persistent and unyielding Bludger continues to remain hot on his trail. Meanwhile, high above, Draco watches the unfolding spectacle with a satisfied and smug expression that spreads across his face, as the Bludger shatters yet another tower with a loud and resounding crash. As Harry expertly maneuvers over the vast expanse of the arena, he suddenly notices Draco hovering directly in his path, and his eyes quickly catch sight of the elusive Golden Snitch, which hovers tantalizingly close beside Draco's head. Both Harry and Draco instinctively duck, just in time, as the Bludger hurtles perilously past them with deadly speed. Then, without missing a beat, Harry makes a decisive and daring move towards the golden prize, with Draco trailing not far behind, aggressively elbowing Harry out of the way in a fierce manner. For a brief moment, Draco takes the lead as the ever-elusive Snitch vanishes beneath the intricate and complex wooden scaffolding that supports the spectators' stands. Draco pursues it with fervor and intensity, hotly pursued by Harry, who skillfully swerves to avoid colliding with a solid wooden beam obstructing his path. Nonetheless, the Snitch proves to be too fast and nimble for Draco’s desperately grasping fingers, and Harry remains relentlessly pursued by the ferocious, heavy wooden Bludger that continues its tireless chase.\n\nDetermined and resolute to maintain his tenuous lead, Draco grits his teeth in frustration and glances around in dismay as Harry catches up and gradually overtakes him. With the heavy Bludger now dangerously close behind Draco, it crashes violently into the wooden beams, creating a cacophony of splintering wood in its wake. They skillfully weave over and under the wooden struts of the structure, and Draco manages to catch up once more, bashing Harry forcefully in the ribs as he does so. Both flyers are neck and neck, the precious and coveted Snitch tantalizingly just beyond their reach, as they flash past Colin, who is preoccupied with his camera and ducks just in time to avoid a collision. The Bludger surges over Colin's head and smashes through yet another wooden support with a deafening crash, echoing through the air. Regaining the lead, Harry and the pesky Bludger streak past both him and Draco, weaving erratically from side to side in front of them, creating more holes in the structure's sides. Suddenly, without warning, it makes a sharp turn and hurtles back toward them with alarming speed and intensity, and Draco's broomstick snags on a wooden strut. This unexpected snag causes him to somersault through the air and land heavily on the grassy expanse of the arena, while Harry tenaciously continues his relentless pursuit of the elusive Golden Snitch.\n\nAs Harry stretches out his hand in a final effort to grasp the elusive Snitch, an unpredictable rogue Bludger strikes him with force, smashing into his arm with brutal impact. Wincing in excruciating pain, Harry grips his broomstick tightly between his knees, stretching out his good hand with determination and successfully manages to grab the elusive Snitch. Then, losing balance, he tumbles off and lands with a thud on his back on the soft sand beneath the goal post, where his concerned friends rush to his side. The Bludger hits the sand not far from Harry, and Hermione's spell takes effect, causing the Bludger to explode in mid-air with a dramatic burst. Everyone runs urgently towards Harry, while Lockhart pushes up Harry's sleeve to assess the damage, as Ron and Hagrid look on with alarmed expressions etched across their faces. Harry's arm goes completely limp, floppy, and unresponsive, and he demonstrates this by folding the wrist unnaturally back on itself. Later, in the quiet solitude of the hospital wing, he drinks some foul-tasting medicine. In the stillness of the night, while Harry is lying fast asleep, a strange and unsettling noise distinctly stirs him awake. He opens his eyes, sits up cautiously, and gazes around the dimly lit room, which seems empty at first until he puts on his glasses and spots a mysterious figure sitting at the end of his bed. The figure's fingers are wrapped in bandages, and, with a familiar and unmistakable jump, Dobby reveals himself by hopping down."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Pursuing Harry with relentless intent, the Bludger barrels forward, smashing through each tower it encounters in a systematic path of destruction. Harry expertly maneuvers his broomstick to swoop lower, skimming just above the grass, attempting to evade the persistent Bludger that trails him closely with unwavering determination. Over in the stands, Draco observes the chaos unfold with a smug expression etched on his face, clearly enjoying the spectacle as the Bludger demolishes yet another tower. Harry deftly pilots his broomstick back over the arena, eyes scanning ahead until he spots Draco hovering a short distance in front of him. In a sudden realization, Harry catches sight of the Golden Snitch hovering enticingly beside Draco's head. Both of them instinctively duck as the Bludger hurtles dangerously past, narrowly avoiding a collision. Seizing the moment, Harry propels himself toward the elusive Snitch, with Draco immediately giving chase, aggressively elbowing Harry out of his path to gain an advantage. Draco takes the lead as the Snitch darts out of sight, disappearing beneath the wooden scaffolding that forms the spectators' stands' supports. Undeterred, Draco races after the elusive golden ball, Harry in hot pursuit, skillfully swerving to dodge a solid wooden beam obstructing his path. The Snitch, ever elusive, remains just beyond Draco's grasping fingers. Meanwhile, Harry remains pursued by the heavy wooden Bludger, a constant threat looming behind. Determined not to lose his lead, Draco grits his teeth, briefly experiencing dismay as Harry catches up and gradually edges past him. Now directly trailing Draco, the Bludger crashes into the wooden beams, the sound echoing throughout the arena. They both weave skillfully over and under the intricate pattern of wooden struts, Draco managing to regain ground and retaliate by bashing Harry in the ribs. Flying side by side, the Snitch tantalizingly just out of reach, they streak past Colin taking photos with his camera, forcing him to duck in alarm as the Bludger zooms overhead, smashing through another wooden support. Regaining the lead, Harry focuses intently, but the Bludger streaks past both competitors again, erratically zigzagging and inflicting damage upon the arena structure. In an unexpected twist, the Bludger reverses direction, hurtling back toward them with menacing speed, and Draco's broomstick becomes entangled in a wooden strut, causing him to somersault through the air and land heavily on the lush grass of the arena. Meanwhile, Harry maintains his pursuit of the Golden Snitch, stretching out his hand with determination to seize it, only for a rogue Bludger to collide forcefully with his arm mid-flight. Gritting his teeth through the pain, Harry deftly grips his broomstick between his knees, extending his good hand to successfully capture the Snitch. Victory in hand, his balance falters, and he topples from his broomstick, landing on his back upon the soft sand beneath the goal post. Instantly, his friends rush to his side, filled with concern. As the Bludger makes contact with the sand near Harry, Hermione's spell activates, causing the Bludger to explode mid-air in a shower of splinters. The crowd converges on Harry, and Lockhart gingerly pushes up Harry's sleeve, revealing a limp and floppy arm, which Harry bends unnaturally at the wrist. Later, in the comforting environment of the hospital wing, Harry sips a potion meant to heal him. Deep in the night, while Harry lies fast asleep, an unfamiliar noise stirs him from slumber. He opens his eyes, promptly sits up, and scans the dimly lit room for any source of the disturbance. Initially, the room appears empty, but upon donning his glasses, he discerns a figure perched at the end of his bed, its fingers cloaked in bandages. Recognizing the visitor, Dobby then gracefully leaps down from his perch."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As the Bludger relentlessly pursues Harry, it crashes through tower after tower. Harry descends close to the grass with the Bludger in hot pursuit, while Draco watches smugly. Harry's path brings him back over the arena, where he spots Draco hovering and notices the Golden Snitch near Draco's head. Both duck to evade the Bludger, which hurtles past them. Harry speeds toward the Snitch, with Draco on his tail, elbowing past Harry to take the lead. The Snitch vanishes under the spectator stands, prompting Draco to pursue with Harry close behind, swerving to avoid obstacles. Draco fails to catch the Snitch, and Harry remains under threat from the Bludger. Determined, Draco tries to maintain his lead but is overtaken by Harry. Behind them, the Bludger crashes into the beams. Weaving through the wooden structure, Draco catches up and ribs Harry, causing them to fly neck and neck. They pass Colin, who ducks as the Bludger smashes another support. Harry regains the lead, but the Bludger streaks past, cutting through the structure before turning back toward them. Draco's broomstick catches on a strut, sending him crashing onto the arena grass. Harry continues his pursuit of the Snitch, wincing as the Bludger strikes his arm. Despite the pain, he secures the Snitch before falling onto the sand beneath the goal post, where his friends gather around him. The Bludger lands nearby, exploding mid-air due to Hermione's spell. Amid the chaos, Lockhart attends to Harry's injured arm while Ron and Hagrid look on worriedly. In the hospital wing, Harry takes medicine. Later, he awakens to strange sounds. Donning his glasses, he discovers Dobby, his fingers bandaged, sitting at the foot of his bed."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Chasing after Harry, the Bludger, a magically enchanted iron ball used in the wizarding sport of Quidditch to disrupt players, crashes through the towers one by one. Harry swoops lower to the grass on his Nimbus 2000, a top-of-the-line racing broom known for its speed and agility, but the Bludger follows him closely. Draco, whose father is a prominent and wealthy figure at the Ministry of Magic, watches with a smug expression on his face as the Bludger crashes through another tower. Harry flies back over the arena, the large and bustling Quidditch pitch filled with cheering spectators, to see Draco hovering in front of him, and suddenly he sees the Golden Snitch, the tiny winged ball worth 150 points that ends the game, beside Draco's head. They both duck as the Bludger hurtles past, with the enchanted ball almost grazing their heads. Then Harry heads for the Snitch, closely followed by Draco, who elbows him out of the way in a bid for victory. Draco takes the lead as the Snitch disappears under the wooden scaffolding, a structure built to support the spectators' stands. Draco flies after it, closely followed by Harry, who swerves to avoid a solid wooden beam, an integral part of the stadium's framework. The Snitch is too fast for Draco's grasping fingers, and Harry is still being chased by the heavy wooden Bludger, bewitched to hone in on him. Determined to stay ahead, Draco grits his teeth and looks around in dismay as Harry catches him up and gradually overtakes. Now, close behind Draco, the heavy Bludger crashes into the wooden beams, sending splinters flying. They weave over and under the wooden struts until Draco catches up again and bashes Harry in the ribs, a move that sends the crowd into a frenzy. They fly neck and neck, the Snitch just out of reach, as they flash past Colin Creevey, an enthusiastic first-year student with his camera, who ducks. The Bludger flies over his head and smashes through a wooden support. Harry takes the lead again, and the Bludger streaks past them both, weaving from side to side in front of them and smashing holes in the sides of the structure. Suddenly, it turns and hurtles back towards them, and Draco's broomstick, a Nimbus 2001 recently gifted by his father, catches on a wooden strut. He somersaults into the air and lands heavily on the grass of the arena while Harry continues pursuing the Golden Snitch. As Harry stretches out his hand to grasp it, a rogue Bludger smashes into his arm, driven berserk by faulty enchantments. Wincing with pain, he grasps his broomstick between his knees, stretches out his good hand, and grabs the Snitch. Then he overbalances, falls off, and lands on his back on the soft sand beneath the goal post, where his friends, including Ron and Hermione, rush to join him. The Bludger hits the sand beside Harry, and Hermione's spell, a particularly advanced charm she learned from extensive reading, works, causing the Bludger to explode in mid-air. Everyone runs towards Harry, and Gilderoy Lockhart, a flamboyant wizard known for his questionable magical abilities, pushes up Harry's sleeve as Ron and Hagrid, the half-giant gamekeeper with a heart of gold, look alarmed. Harry's arm goes completely limp and floppy, and he folds the wrist back on itself. Afterward, in the hospital wing, where Madam Pomfrey administers care to injured students, he drinks some medicine. Late at night, while Harry is lying fast asleep, a strange noise wakes him. He opens his eyes, sits up, and looks around, but the room seems empty until he puts on his glasses, the iconic round frames essential for his poor vision, and sees a figure sitting at the end of his bed. The figure's fingers are covered in bandages from a recent encounter with mischief, and Dobby, the house-elf bound to serve the Malfoy family, jumps down."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Chasing after Harry the Bludger crashes through the towers one by one. Harry swoops lower to the grass but the Bludger follows him closely. Draco watches with a smug expression on his face as the Bludger crashes through another tower. Harry flies back over the arena to see Draco hovering in front of him and suddenly he sees the Golden Snitch beside Draco's head. They both duck as the Bludger hurtles past. Then Harry heads for the Snitch closely followed by Draco who elbows him out of the way. Draco takes the lead as the Snitch disappears under the wooden scaffolding supporting the spectators' stands. Draco flies after it closely followed by Harry who swerves to avoid a solid wooden beam. The Snitch is too fast for Draco's grasping fingers and Harry is still being chased by the heavy wooden Bludger. Determined to stay ahead Draco grits his teeth and looks around in dismay as Harry catches him up and gradually overtakes. Now close behind Draco the heavy Bludger crashes into the wooden beams. They weave over and under the wooden struts until Draco catches up again and bashes Harry in the ribs. They fly neck and neck the Snitch just out of reach as they flash past Colin with his camera who ducks. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. The Bludger flies over his head and smashes through a wooden support. Harry takes the lead again and the Bludger streaks past them both weaving from side to side in front of them and smashing holes in the sides of the structure. Suddenly it turns and hurtles back towards them and Draco's broomstick catches on a wooden strut. He somersaults into the air and lands heavily on the grass of the arena while Harry continues pursuing the Golden Snitch. As Harry stretches out his hand to grasp it a rogue Bludger smashes into his arm. Wincing with pain he grasps his broomstick between his knees stretches out his good hand and grabs the Snitch. Then he overbalances falls off and lands on his back on the soft sand beneath the goal post where his friends rush to join him. The Bludger hits the sand beside Harry and Hermione's spell works causing the Bludger to explode in midair. Everyone runs towards Harry and Lockhart pushes up Harry's sleeve as Ron and Hagrid look alarmed. Harry's arm goes completely limp and floppy and he folds the wrist back on itself. Afterward in the hospital wing he drinks some medicine. Late at night while Harry is lying fast asleep a strange noise wakes him. He opens his eyes sits up and looks around but the room seems empty until he puts on his glasses and sees a figure sitting at the end of his bed. The figure's fingers are covered in bandages and Dobby jumps down."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Chasing after Harry the Bludger crashes through the towers one by one. Harry swoops lower to the grass but the Bludger follows him closely. Draco watches with a smug expression on his face as the Bludger crashes through another tower. Harry flies back over the arena to see Draco hovering in front of him and suddenly he sees the Golden Snitch beside Draco's head. They both duck as the Bludger hurtles past. Then Harry heads for the Snitch closely followed by Draco who elbows him out of the way. Draco takes the lead as the Snitch disappears under the wooden scaffolding supporting the spectators' stands. Draco flies after it closely followed by Harry who swerves to avoid a solid wooden beam. The Snitch is too fast for Draco's grasping fingers and Harry is still being chased by the heavy wooden Bludger. Determined to stay ahead Draco grits his teeth and looks around in dismay as Harry catches him up and gradually overtakes. Now close behind Draco the heavy Bludger crashes into the wooden beams. They weave over and under the wooden struts until Draco catches up again and bashes Harry in the ribs. They fly neck and neck the Snitch just out of reach as they flash past Colin with his camera who ducks. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. The Bludger flies over his head and smashes through a wooden support. Harry takes the lead again and the Bludger streaks past them both weaving from side to side in front of them and smashing holes in the sides of the structure. Suddenly it turns and hurtles back towards them and Draco's broomstick catches on a wooden strut. He somersaults into the air and lands heavily on the grass of the arena while Harry continues pursuing the Golden Snitch. As Harry stretches out his hand to grasp it a rogue Bludger smashes into his arm. Wincing with pain he grasps his broomstick between his knees stretches out his good hand and grabs the Snitch. Then he overbalances falls off and lands on his back on the soft sand beneath the goal post where his friends rush to join him. The Bludger hits the sand beside Harry and Hermione's spell works causing the Bludger to explode in midair. Everyone runs towards Harry and Lockhart pushes up Harry's sleeve as Ron and Hagrid look alarmed. Harry's arm goes completely limp and floppy and he folds the wrist back on itself. Afterward in the hospital wing he drinks some medicine. Late at night while Harry is lying fast asleep a strange noise wakes him. He opens his eyes sits up and looks around but the room seems empty until he puts on his glasses and sees a figure sitting at the end of his bed. The figure's fingers are covered in bandages and Dobby jumps down."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Chasing after Harry the Bludger crashes through the towers one by one. Harry swoops lower to the grass but the Bludger follows him closely. Draco watches with a smug expression on his face as the Bludger crashes through another tower. Harry flies back over the arena to see Draco hovering in front of him and suddenly he sees the Golden Snitch beside Draco's head. They both duck as the Bludger hurtles past. Then Harry heads for the Snitch closely followed by Draco who elbows him out of the way. Draco takes the lead as the Snitch disappears under the wooden scaffolding supporting the spectators' stands. The Bludger hits the sand beside Harry and Hermione's spell works causing the Bludger to explode in midair. Everyone runs towards Harry and Lockhart pushes up Harry's sleeve as Ron and Hagrid look alarmed. Harry's arm goes completely limp and floppy and he folds the wrist back on itself. Afterward in the hospital wing he drinks some medicine. Late at night while Harry is lying fast asleep a strange noise wakes him. He opens his eyes sits up and looks around but the room seems empty until he puts on his glasses and sees a figure sitting at the end of his bed. The figure's fingers are covered in bandages and Dobby jumps down."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Chasing after Harry the Bludger crashes through the towers one by one. Harry swoops lower to the grass but the Bludger follows him closely. Draco watches with a smug expression on his face as the Bludger crashes through another tower. Late at night while Harry is lying fast asleep a strange noise wakes him. He opens his eyes sits up and looks around but the room seems empty until he puts on his glasses and sees a figure sitting at the end of his bed. The figure's fingers are covered in bandages and Dobby jumps down."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Galloping after Lucy, the Marble tumbles through the umbrellas one by one. Lucy dives higher to the ocean, but the Marble pursues her distantly. Oliver observes with a cheerful grin on his face as the Marble tumbles through another umbrella. Lucy glides back over the canyon to spot Oliver floating behind her, and suddenly she notices the Crystal Bubble beside Oliver's shoulder. They both leap as the Marble rolls past. Then Lucy reaches for the Bubble, distantly trailed by Oliver, who nudges her aside. Oliver seizes the advantage as the Bubble vanishes beneath the metal lattice holding the viewers' bleachers. Oliver glides after it, distantly trailed by Lucy, who dodges to avoid a solid metal pole. The Bubble is too swift for Oliver's clenching claws, and Lucy is still being pursued by the dense metal Marble. Eager to remain ahead, Oliver clenches his jaws and gazes around in despair as Lucy catches him up and gradually surpasses. Now, close behind Oliver, the dense Marble rolls into the metal poles. They twist over and under the metal girders until Oliver catches up again and punches Lucy in the shoulder. They glide side by side, the Bubble just out of reach, as they dash past Ethan with his telescope, who crouches. The Marble rolls over his cap and slams through a metal brace. Lucy seizes the advantage again, and the Marble dashes past them both, swaying from left to right in front of them and punching gaps in the sides of the framework. Unexpectedly, it pivots and rolls back towards them, and Oliver's diving board hooks on a metal girder. He tumbles into the sky and lands lightly on the ocean of the canyon while Lucy continues chasing the Crystal Bubble. As Lucy stretches out her paw to seize it, a stray Marble slams into her leg. Grimacing with ache, she grasps her diving board between her ankles, stretches out her healthy paw, and snatches the Bubble. Then she tips over, falls off, and lands on her face on the soft clay beneath the home base, where her teammates rush to greet her. The Marble strikes the clay beside Lucy, and Gloria's charm activates, causing the Marble to scatter in thin air. Everyone dashes towards Lucy, and Trevor pulls up Lucy's pant leg as Sam and Casey look distressed. Lucy's leg goes totally numb and droopy, and she twists the ankle back on itself. Later, in the medical section, she sips some beverage. Late in the evening, while Lucy is resting quietly, an odd sound stirs her. She opens her eyes, stands up, and glances around, but the compartment seems vacant until she puts on her spectacles and spots a silhouette perched at the edge of her bunk. The silhouette's claws are wrapped in napkins, and Benny hops down."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In a thrilling chase, Harry is pursued by a persistent Bludger that smashes through towers, while Draco watches smugly. As Harry spots the Golden Snitch near Draco, they both dodge the Bludger and race for the Snitch. Draco initially takes the lead, but Harry overtakes him despite Draco's tactics. They weave through wooden struts, with both boys neck and neck until the Bludger knocks Draco off his broom. Harry grabs the Snitch despite an injury from another Bludger. He falls but lands safely, surrounded by friends. Hermione's spell causes the Bludger to explode. In the hospital wing, Harry's arm is limp after Lockhart's intervention. Later, Harry wakes to find Dobby, bandaged, sitting at the end of his bed."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The figure's fingers are covered in bandages and Dobby jumps down He opens his eyes sits up and looks around but the room seems empty until he puts on his glasses and sees a figure sitting at the end of his bed Late at night while Harry is lying fast asleep a strange noise wakes him Afterward in the hospital wing he drinks some medicine Harry's arm goes completely limp and floppy and he folds the wrist back on itself Everyone runs towards Harry and Lockhart pushes up Harry's sleeve as Ron and Hagrid look alarmed The Bludger hits the sand beside Harry and Hermione's spell works causing the Bludger to explode in midair Then he overbalances falls off and lands on his back on the soft sand beneath the goal post where his friends rush to join him Wincing with pain he grasps his broomstick between his knees stretches out his good hand and grabs the Snitch As Harry stretches out his hand to grasp it a rogue Bludger smashes into his arm He somersaults into the air and lands heavily on the grass of the arena while Harry continues pursuing the Golden Snitch Suddenly it turns and hurtles back towards them and Draco's broomstick catches on a wooden strut Harry takes the lead again and the Bludger streaks past them both weaving from side to side in front of them and smashing holes in the sides of the structure The Bludger flies over his head and smashes through a wooden support They fly neck and neck the Snitch just out of reach as they flash past Colin with his camera who ducks They weave over and under the wooden struts until Draco catches up again and bashes Harry in the ribs Now close behind Draco the heavy Bludger crashes into the wooden beams Determined to stay ahead Draco grits his teeth and looks around in dismay as Harry catches him up and gradually overtakes The Snitch is too fast for Draco's grasping fingers and Harry is still being chased by the heavy wooden Bludger Draco flies after it closely followed by Harry who swerves to avoid a solid wooden beam Draco takes the lead as the Snitch disappears under the wooden scaffolding supporting the spectators' stands Then Harry heads for the Snitch closely followed by Draco who elbows him out of the way They both duck as the Bludger hurtles past Harry flies back over the arena to see Draco hovering in front of him and suddenly he sees the Golden Snitch beside Draco's head Draco watches with a smug expression on his face as the Bludger crashes through another tower Harry swoops lower to the grass but the Bludger follows him closely Chasing after Harry the Bludger crashes through the towers one by one"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Harry swoops lower to the grass but the Bludger follows him closely Chasing after Harry the Bludger crashes through the towers one by one Harry flies back over the arena to see Draco hovering in front of him and suddenly he sees the Golden Snitch beside Draco's head Draco watches with a smug expression on his face as the Bludger crashes through another tower Then Harry heads for the Snitch closely followed by Draco who elbows him out of the way They both duck as the Bludger hurtles past Draco flies after it closely followed by Harry who swerves to avoid a solid wooden beam Draco takes the lead as the Snitch disappears under the wooden scaffolding supporting the spectators' stands Determined to stay ahead Draco grits his teeth and looks around in dismay as Harry catches him up and gradually overtakes The Snitch is too fast for Draco's grasping fingers and Harry is still being chased by the heavy wooden Bludger They weave over and under the wooden struts until Draco catches up again and bashes Harry in the ribs Now close behind Draco the heavy Bludger crashes into the wooden beams The Bludger flies over his head and smashes through a wooden support They fly neck and neck the Snitch just out of reach as they flash past Colin with his camera who ducks Suddenly it turns and hurtles back towards them and Draco's broomstick catches on a wooden strut Harry takes the lead again and the Bludger streaks past them both weaving from side to side in front of them and smashing holes in the sides of the structure As Harry stretches out his hand to grasp it a rogue Bludger smashes into his arm He somersaults into the air and lands heavily on the grass of the arena while Harry continues pursuing the Golden Snitch Then he overbalances falls off and lands on his back on the soft sand beneath the goal post where his friends rush to join him Wincing with pain he grasps his broomstick between his knees stretches out his good hand and grabs the Snitch Everyone runs towards Harry and Lockhart pushes up Harry's sleeve as Ron and Hagrid look alarmed The Bludger hits the sand beside Harry and Hermione's spell works causing the Bludger to explode in midair Afterward in the hospital wing he drinks some medicine Harry's arm goes completely limp and floppy and he folds the wrist back on itself He opens his eyes sits up and looks around but the room seems empty until he puts on his glasses and sees a figure sitting at the end of his bed Late at night while Harry is lying fast asleep a strange noise wakes him The figure's fingers are covered in bandages and Dobby jumps down"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Harry takes the lead again and the Bludger streaks past them both weaving from side to side in front of them and smashing holes in the sides of the structure Suddenly it turns and hurtles back towards them and Draco's broomstick catches on a wooden strut He somersaults into the air and lands heavily on the grass of the arena while Harry continues pursuing the Golden Snitch As Harry stretches out his hand to grasp it a rogue Bludger smashes into his arm Wincing with pain he grasps his broomstick between his knees stretches out his good hand and grabs the Snitch Then he overbalances falls off and lands on his back on the soft sand beneath the goal post where his friends rush to join him The Bludger hits the sand beside Harry and Hermione's spell works causing the Bludger to explode in midair Everyone runs towards Harry and Lockhart pushes up Harry's sleeve as Ron and Hagrid look alarmed Harry's arm goes completely limp and floppy and he folds the wrist back on itself Afterward in the hospital wing he drinks some medicine Late at night while Harry is lying fast asleep a strange noise wakes him He opens his eyes sits up and looks around but the room seems empty until he puts on his glasses and sees a figure sitting at the end of his bed The figure's fingers are covered in bandages and Dobby jumps down Chasing after Harry the Bludger crashes through the towers one by one Harry swoops lower to the grass but the Bludger follows him closely Draco watches with a smug expression on his face as the Bludger crashes through another tower Harry flies back over the arena to see Draco hovering in front of him and suddenly he sees the Golden Snitch beside Draco's head They both duck as the Bludger hurtles past Then Harry heads for the Snitch closely followed by Draco who elbows him out of the way Draco takes the lead as the Snitch disappears under the wooden scaffolding supporting the spectators' stands Draco flies after it closely followed by Harry who swerves to avoid a solid wooden beam The Snitch is too fast for Draco's grasping fingers and Harry is still being chased by the heavy wooden Bludger Determined to stay ahead Draco grits his teeth and looks around in dismay as Harry catches him up and gradually overtakes Now close behind Draco the heavy Bludger crashes into the wooden beams They weave over and under the wooden struts until Draco catches up again and bashes Harry in the ribs They fly neck and neck the Snitch just out of reach as they flash past Colin with his camera who ducks The Bludger flies over his head and smashes through a wooden support"
        }
      ]
    }
  ]
}