{
  "ground_truth": "Harry gets out of bed, covers his eyes, and blows his nose on his filthy garment, then hits his head with the medicine bottle. Harry grabs Dobby, but Dobby clicks his fingers and disappears. Harry jumps back into bed as shadows appear in the doorway. A patient is carried in on a stretcher and lifted carefully onto a bed. Professor Dumbledore takes the camera from Colin Creevey's stiff fingers and opens the back, and the film explodes. Hermione prepares a potion, and a ghostly girl in a school uniform shouts in Ron's face, then hovers high above their heads, zooms into a cubicle, and dives head first down the lavatory pan. In the Great Hall, a long platform has been erected, and Lockhart strides along it, tossing his cloak to a group of excited girls. Snape steps onto the platform, and Snape and Lockhart draw their wands and solemnly salute each other. They bow, turn, take a few steps away, then turn again and face each other. Lockhart hurtles backwards down the platform, gets painfully to his feet, and beckons to Draco who steps forward. Looking worried, Lockhart passes Harry, and grim-faced, Harry and Draco approach each other, standing face to face. Draco glares, they salute each other, then turn and walk away. The watching students hold their breath in anticipation as Harry and Draco face each other along the platform. Harry is somersaulted backwards, and Draco smirks at his cronies as Harry scrambles up and points his wand, making Draco's smile fade. Draco is spun in the air, and as he crashes onto the platform, Snape hauls him to his feet and pushes him back towards Harry. Draco points his wand, and a large snake appears in front of Harry, uncoils itself, and moves towards him. Harry backs away, the snake flies into the air, then falls again, raising its head menacingly. Harry moves slowly towards it and starts to speak. The snake fixes its gaze on a boy in the crowd as Harry speaks again. The snake moves closer to the boy who backs away, and Harry speaks again. The snake turns its head, staring at Harry, closes its mouth, and is reduced to ashes. Harry frowns and looks around the hall to find everyone staring at him. Harry runs into the Gryffindor Common Room followed by Ron and Hermione, looks from one to the other, and in a classroom, students are working quietly at long tables. Harry looks up from his books to see two girls staring at him curiously, and he glances across at Ron and Hermione, who both give him an embarrassed smile. A group of students at another table look away quickly as he turns towards them.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sure, here is the text transformed with synonyms:\n\nHarry exits from bunk, shields his eyes, and blows his nose on his grimy clothing, then strikes his head with the remedy container. Harry seizes Dobby, but Dobby snaps his digits and vanishes. Harry leaps back into bunk as silhouettes emerge in the entrance. A patient is borne in on a litter and elevated gently onto a cot. Professor Dumbledore takes the camera from Colin Creevey's rigid digits and opens the rear, and the film detonates. Hermione concocts a brew, and a spectral girl in a school outfit yells in Ron's visage, then hovers high above their skulls, zooms into a stall, and plunges headlong down the toilet bowl. In the Great Hall, a lengthy stage has been constructed, and Lockhart strides along it, tossing his mantle to a cluster of enthusiastic girls. Snape steps onto the stage, and Snape and Lockhart draw their wands and gravely greet each other. They bow, turn, take a few paces away, then turn again and confront each other. Lockhart hurtles backwards down the stage, gets painfully to his feet, and signals to Draco who steps forward. Looking uneasy, Lockhart passes Harry, and stern-faced, Harry and Draco approach each other, standing eye to eye. Draco scowls, they greet each other, then turn and pace away. The observing students hold their breath in anticipation as Harry and Draco confront each other along the stage. Harry is somersaulted backwards, and Draco sneers at his cronies as Harry scrambles up and aims his wand, making Draco's grin diminish. Draco is spun in the air, and as he crashes onto the stage, Snape pulls him to his feet and shoves him back towards Harry. Draco aims his wand, and a large serpent appears in front of Harry, uncoils itself, and moves towards him. Harry retreats, the serpent flies into the air, then falls again, raising its head menacingly. Harry moves slowly towards it and begins to speak. The serpent fixes its gaze on a boy in the throng as Harry speaks again. The serpent moves nearer to the boy who retreats, and Harry speaks again. The serpent turns its head, staring at Harry, closes its mouth, and is reduced to ashes. Harry scowls and gazes around the hall to find everyone staring at him. Harry dashes into the Gryffindor Common Room followed by Ron and Hermione, glances from one to the other, and in a classroom, students are working quietly at long tables. Harry looks up from his books to see two girls staring at him inquisitively, and he glances across at Ron and Hermione, who both give him an awkward smile. A cluster of students at another table look away quickly as he turns towards them."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Out of bed, Harry is gotten by him, his eyes are covered, and his nose is blown on his filthy garment, then his head is hit with the medicine bottle. Dobby is grabbed by Harry, but Dobby clicks his fingers and disappears. Back into bed, Harry jumps as shadows are appearing in the doorway. They carry a patient in on a stretcher and lift him carefully onto a bed. The camera is taken by Professor Dumbledore from Colin Creevey's stiff fingers and the back is opened by him, causing the film to explode. A potion is prepared by Hermione, and a ghostly girl in a school uniform shouts in Ron's face, then she is hovered high above their heads, zooming into a cubicle, and diving headfirst down the lavatory pan. In the Great Hall, they have erected a long platform, and along it, Lockhart strides, tossing his cloak to a group of excited girls. Onto the platform steps Snape, and they draw their wands and solemnly salute each other. They bow, turn, take a few steps away, then turn again and face each other. Backwards down the platform, Lockhart is hurtled, he gets painfully to his feet, and Draco is beckoned by him, who steps forward. Looking worried, Lockhart passes Harry, and grim-faced, Harry and Draco approach each other, standing face to face. Draco glares, they are saluted by them, then they turn and walk away. Their breath is held in anticipation by the watching students as Harry and Draco are faced along the platform by each other. Harry is somersaulted backwards, and at his cronies, Draco smirks as Harry scrambles up and his wand is pointed, making Draco's smile fade. Draco is spun in the air, and as he crashes onto the platform, him is hauled to his feet by Snape and he is pushed back towards Harry. Draco points his wand, and in front of Harry, a large snake appears, uncoils itself, and moves towards him. Away, Harry backs, the snake is flown into the air, then falls again, raising its head menacingly. Slowly towards it, Harry is moved, and he starts to speak. On a boy in the crowd, the snake is fixed its gaze as he speaks again. Closer to the boy, the snake is moved, who backs away, and again, Harry speaks. By the snake, its head is turned, staring at Harry, its mouth is closed, and it is reduced to ashes. Harry frowns and around the hall looks to find him stared at by everyone. The Gryffindor Common Room is run into by Harry followed by Ron and Hermione, looked from one to the other by him, and in a classroom, quietly, students work at long tables. From his books, Harry looks up to see two girls staring at him curiously, and across at Ron and Hermione, he glances, who both give him an embarrassed smile. At another table, quickly they look away as towards them he turns."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Harry gets out of bed, covers his eyes, blows his nose on his filthy garment, and hits his head with a medicine bottle. He grabs Dobby, who clicks his fingers and disappears. Harry jumps back into bed as shadows appear in the doorway. A patient is carried in on a stretcher and carefully placed onto a bed. Professor Dumbledore takes the camera from Colin Creevey's stiff fingers, opens it, and the film explodes. Hermione prepares a potion, and a ghostly girl in a school uniform shouts at Ron, hovers above, zooms into a cubicle, and dives down the lavatory pan. In the Great Hall, a long platform is erected. Lockhart struts along it, tossing his cloak to excited girls. Snape joins him on the platform; they draw their wands and salute. After bowing, they turn, walk away, then face each other. Lockhart hurtles backwards, painfully gets up, and beckons Draco, who steps forward. Looking worried, Lockhart passes Harry. Grim-faced, Harry and Draco stand face to face. Draco glares as they salute, turn, and walk away. Students hold their breath as Harry and Draco face each other. Harry somersaults backwards, and Draco smirks as Harry scrambles up, pointing his wand, erasing Draco's smile. Draco is spun in the air, crashes down, and Snape hauls him up and pushes him towards Harry. Draco points his wand; a large snake appears, uncoils, and moves toward Harry. Harry backs away, and the snake flies into the air, then falls, raising its head menacingly. Harry moves toward it, speaking, and the snake fixes its gaze on a boy in the crowd. As Harry speaks again, the snake turns to him, closes its mouth, and burns to ashes. Harry frowns, realizing everyone is staring at him. He runs into the Gryffindor Common Room with Ron and Hermione. In a classroom, students work quietly. Harry notices two girls staring curiously at him and glances at Ron and Hermione, who give embarrassed smiles. Other students quickly look away as he turns to them."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Harry wakes, uses his garment as a tissue, and accidentally hits his head with a medicine bottle. Grabbing Dobby, who vanishes, Harry returns to bed as shadows appear. A patient is carried in and placed on a bed. Dumbledore opens Colin's camera, and the film explodes. Hermione brews a potion while a ghostly girl yells at Ron, then dives down the toilet. In the Great Hall, Lockhart struts on a platform, tossing his cloak. Snape joins him, and they exchange solemn salutes. Lockhart stumbles, gets up, and calls Draco forward. Lockhart passes Harry, who faces Draco. They salute, turn, and walk away. Students watch as Harry and Draco face off. Harry is flipped, but recovers and points his wand, erasing Draco's smug look. Draco spins in the air, crashes down, and Snape pushes him back towards Harry. Draco summons a snake that slithers toward Harry. As Harry speaks, the snake targets a boy before turning to ashes. Harry notices everyone staring. In Gryffindor Common Room, Harry, Ron, and Hermione exchange looks. In class, Harry notices students staring, while Ron and Hermione give sheepish smiles. Other students quickly look away."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Harry begins his day by getting out of bed, but immediately covers his eyes, likely to shield them from the morning light. He then proceeds to blow his nose loudly on his already filthy garment, a habit that speaks volumes about his current state. In an unfortunate turn, he accidentally hits his head with the medicine bottle that was nearby. In a frustrated reaction, Harry reaches out and grabs Dobby, the house-elf, but Dobby skillfully evades him by clicking his fingers and disappearing in an instant. Harry, feeling defeated, jumps back onto his bed just as shadows ominously appear in the doorway. Meanwhile, a patient is brought in on a stretcher and is very carefully lifted onto a bed, ensuring they're comfortable.\n\nIn another scene, Professor Dumbledore gently takes the camera from Colin Creevey's rigid fingers. When he opens the back of the camera, it results in the film inside explosively unraveling. Amid this commotion, Hermione is busy preparing a potion with focused determination. Suddenly, a ghostly girl, wearing a school uniform, loudly shouts in Ron's startled face, then dramatically rises into the air above their heads. She swiftly zooms into a cubicle and plunges head first down the lavatory pan in a ghastly display. Over in the Great Hall, a long platform has been meticulously erected, drawing everyone's attention. Lockhart confidently strides along it, tossing his cloak with flair to a group of eagerly excited girls. As Lockhart makes his entrance, Snape steps onto the platform, and a solemn atmosphere settles over the room as Snape and Lockhart draw their wands and respectfully salute each other. They perform a dignified bow, turn, take a few measured steps away, then turn once more to face each other. \n\nThe tension escalates as Lockhart unexpectedly hurtles backwards down the platform, struggling as he painfully gets to his feet. With a somewhat forced confidence, he beckons Draco to step forward. Lockhart, now appearing worried, passes Harry, and both Harry and Draco, with grim determination, approach each other and stand face to face. Draco's glare could cut through stone as they both salute each other, then purposefully turn and walk away, the atmosphere thick with anticipation. The students watching hold their breath, eager to see what unfolds as Harry and Draco face each other along the platform. In a swift movement, Harry is somersaulted backwards, while Draco smirks smugly at his cronies. However, Harry quickly scrambles up and points his wand, causing Draco's smile to falter and fade. In retaliation, Draco is spun through the air, and as he unexpectedly crashes onto the platform, Snape quickly hauls him to his feet and pushes him back towards Harry.\n\nDraco, with determination, points his wand, summoning a large snake that appears menacingly in front of Harry. The snake uncoils itself slowly and begins to advance toward him. Harry instinctively backs away, watching as the snake suddenly flies into the air but then falls back down, raising its head in a threatening manner. Harry gathers his courage, moves cautiously towards it, and begins to speak in a soft, yet commanding tone. The snake turns its gaze towards a boy in the assembled crowd as Harry speaks again with urgency. The snake edges closer to the boy, who steps back in fear, prompting Harry to speak once more. The snake then turns its head, fixes its eyes on Harry, closes its mouth, and is miraculously reduced to ashes. Harry frowns deeply, looking around the hall to find every single person staring directly at him in shock and awe.\n\nOverwhelmed, Harry runs into the Gryffindor Common Room, closely followed by Ron and Hermione. He looks earnestly from one to the other, searching for answers or comfort. In a nearby classroom, students are diligently working quietly at long tables. Harry glances up from his books to notice two girls staring at him with a curious mixture of awe and suspicion. He quickly glances across at Ron and Hermione, who both respond with an awkward, embarrassed smile. Across the room, a group of students sitting at another table quickly divert their gaze and look away as soon as he turns towards them, leaving Harry with an unsettling feeling in the pit of his stomach."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Harry starts his day by getting out of bed, but he immediately covers his eyes, most likely to shield them from the intensity of the morning light streaming in. He proceeds to blow his nose loudly on his already filthy garment, a habit that speaks volumes about his current disheveled state. In an unfortunate turn of events, he accidentally hits his head with the medicine bottle that was carelessly left nearby. Frustrated by this mishap, Harry reaches out and attempts to grab Dobby, the house-elf. However, Dobby skillfully evades him by clicking his fingers and disappearing in an instant, leaving Harry feeling defeated. He then jumps back onto his bed just as shadows ominously appear in the doorway. Meanwhile, elsewhere in the scene, a patient is brought in on a stretcher and is very carefully lifted onto a bed, ensuring that they are comfortable.\n\nIn another scene of activity, Professor Dumbledore gently takes the camera from Colin Creevey's rigid fingers. Upon opening the back of the camera, the film inside explosively unravels, creating a chaotic commotion. Amid this situation, Hermione busily prepares a potion with focused determination. Suddenly, a ghostly girl, dressed in a school uniform, loudly shouts in Ron's startled face, before dramatically rising into the air above their heads. She swiftly zooms into a cubicle and plunges headfirst down the lavatory pan in a ghastly and unexpected display. Over in the Great Hall, a long platform has been meticulously erected, drawing everyone's attention. Lockhart confidently strides along it, tossing his cloak with flair to a group of eagerly excited girls. As Lockhart makes his grand entrance, Snape steps onto the platform, and a solemn atmosphere settles over the room as Snape and Lockhart draw their wands and respectfully salute each other. They perform a dignified bow, turn, take a few measured steps away, then turn once more to face each other, ready for what is to come.\n\nThe tension escalates as Lockhart is unexpectedly hurtled backwards down the platform, struggling as he painfully gets back to his feet. With a somewhat forced show of confidence, he beckons Draco to step forward. Lockhart, now appearing worried, passes Harry, and both Harry and Draco, with grim determination, approach each other and stand face to face. Draco's glare could cut through stone as they both salute each other, then purposefully turn and walk away, the atmosphere thick with anticipation. The students watching hold their breath, eager to see what unfolds next as Harry and Draco face each other along the platform. In a swift movement, Harry is somersaulted backwards, while Draco smirks smugly at his cronies. However, Harry quickly scrambles up and points his wand, causing Draco's smile to falter and fade. In retaliation, Draco is spun through the air, and as he unexpectedly crashes onto the platform, Snape quickly hauls him to his feet and pushes him back towards Harry, ready for the next round.\n\nDraco, with determination in his eyes, points his wand, summoning a large snake that appears menacingly in front of Harry. The snake uncoils itself slowly and ominously begins to advance toward him. Harry instinctively backs away, watching as the snake suddenly flies into the air but then falls back down, raising its head in a threatening manner. Harry gathers his courage, moves cautiously towards it, and begins to speak in a soft, yet commanding tone. The snake turns its gaze towards a boy in the assembled crowd as Harry speaks again with urgency. The snake edges closer to the boy, who steps back in fear, prompting Harry to speak once more. The snake then turns its head, fixes its eyes on Harry, closes its mouth, and, miraculously, is reduced to ashes. Harry frowns deeply, looking around the hall to find every single person staring directly at him, their expressions a mix of shock and awe.\n\nOverwhelmed by the situation, Harry runs into the Gryffindor Common Room, closely followed by Ron and Hermione, who are concerned for him. He looks earnestly from one to the other, searching for answers or comfort amidst the confusion. In a nearby classroom, students are diligently working quietly at long tables on their assignments. Harry glances up from his books to notice two girls staring at him with a curious mixture of awe and suspicion. He quickly glances across at Ron and Hermione, who both respond with an awkward, embarrassed smile, unsure of how to offer support. Across the room, a group of students sitting at another table quickly divert their gaze and look away as soon as he turns towards them, leaving Harry with a growing, unsettling feeling in the pit of his stomach, a feeling that something has changed."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Harry begins his morning by slowly getting out of bed, feeling the weight of sleep still hanging over him. He shields his eyes from the morning light with one hand while reaching for his filthy garment with the other. With a swift motion, he brings the garment to his face and loudly blows his nose into it, a sense of relief washing over him despite the garment's unclean state. As he turns to set the garment aside, his elbow accidentally knocks against a nearby medicine bottle, causing it to swing up and painfully hit him on the head. Reacting quickly, Harry reaches out and firmly grabs Dobby by the arm. Dobby, however, is unfazed; he flashes a knowing look and clicks his fingers, promptly disappearing before Harry's eyes. Startled but resigned, Harry quickly retreats back into his bed, pulling the covers up as shadows ominously gather in the doorway. His curiosity piqued, he watches as a patient is carefully carried in on a stretcher by several attendants, who then gently lift the patient and place them onto a nearby bed with precise care. The scene shifts, and Professor Dumbledore takes center stage by gently prying a camera from the stiff fingers of Colin Creevey. With a deliberate, practiced motion, Dumbledore opens the back of the camera, and suddenly, the film inside erupts in a small, unexpected explosion. Meanwhile, Hermione is intently preparing a potion, her focus broken only by the sudden appearance of a ghostly girl clad in a school uniform. The specter abruptly shouts directly into Ron's face, causing him to recoil, before the ghostly figure shoots up high above their heads. With a swift, fluid motion, the ghost zooms into a nearby cubicle and dives headfirst down the lavatory pan, disappearing from sight. Transitioning to the Great Hall, a long platform has been carefully erected in preparation for an event. Lockhart makes a grand entrance, confidently striding along the platform while dramatically tossing his cloak towards an eager group of girls. Not far behind, Snape steps onto the platform with a deliberate air of seriousness. The two men draw their wands, acknowledging each other with a solemn salute. In a formal display of courtesy, they bow, turn away, take measured steps, then pivot to face each other once more. The tension mounts as Lockhart is sent hurtling backward down the length of the platform, landing awkwardly yet determinedly scrambling to his feet. He gestures towards Draco, who steps forward in response. As Lockhart passes Harry, he looks worried, while Harry, now grim-faced and resolute, meets Draco head-on. They stand face to face, and Draco fixes Harry with a glare. They exchange salutes, turn their backs, and walk away to create distance. The air is thick with anticipation as the watching students collectively hold their breath, watching Harry and Draco prepare to face off. Suddenly, Harry is sent somersaulting backward through the air, eliciting a smirk from Draco directed at his henchmen. Undeterred, Harry quickly regains his footing, raising his wand and erasing the smirk from Draco's face. In an instant, Draco is spun into the air like a rag doll, crashing back down onto the platform. Snape, with a firm grip, hauls Draco back onto his feet and propels him back toward Harry. Draco, regaining his composure, points his wand, conjuring a large snake that materializes in front of Harry. The snake uncoils with ominous intent, inching closer to Harry, who instinctively backs away. The snake is lifted into the air, only to plummet back down, its head rising menacingly. Harry, determined, approaches the serpent cautiously and begins to speak in low, calm tones. The snake momentarily breaks its gaze from Harry, locking onto a young boy in the crowd, causing the boy to nervously back away. As Harry continues to speak, the snake turns its head back towards him, its once-threatening demeanor softening, before it closes its mouth and crumbles into ashes. Confusion and concern cross Harry's face as he surveys the hall, perceiving the intense stares of those around him. Overcome with emotion, Harry dashes into the Gryffindor Common Room, Ron and Hermione trailing in his wake. He quickly glances from Ron to Hermione, seeking understanding. In a nearby classroom, students are absorbed in their work, quietly engaged at long tables. Harry momentarily shifts his attention from his books, only to find two girls staring at him with curiosity. He exchanges a look with Ron and Hermione, who both offer him embarrassed smiles. Shifting his gaze, he notices a group of students at another table hastily avert their eyes, avoiding his glance in awkward silence."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Harry gets out of bed, covers his eyes, blows his nose on his filthy garment, and accidentally hits his head with a medicine bottle before grabbing Dobby, who quickly disappears with a finger snap. He jumps back into bed as shadows appear at the doorway, and a patient is carried in and placed carefully onto a bed. Professor Dumbledore takes a camera from Colin Creevey's stiff fingers, opens it, and the film explodes. Meanwhile, Hermione prepares a potion, and a ghostly schoolgirl shouts at Ron, then zips above them, dives into a cubicle, and disappears down a toilet. \n\nIn the Great Hall, a platform has been set up. Lockhart strides along it, tossing his cloak to a group of excited girls before facing Snape. The two exchange solemn salutes, bow, turn, and position themselves for a duel. As Lockhart is knocked backwards, he painfully rises and calls Draco forward. As Draco steps up, Harry follows suit, and they face each other grimly before saluting and taking their positions. \n\nThe students watch in anticipation as the duel begins. Harry is thrown backwards, but quickly recovers, wiping the smirk off Draco's face by pointing his wand. Draco is spun and crashes onto the platform where Snape helps him up and pushes him back into the duel. Draco conjures a snake that lunges at Harry. As Harry backs away, the snake rises menacingly, and Harry begins speaking to it. The snake, distracted by a nearby boy, moves closer to him until Harry speaks again, commanding its attention. The snake ultimately turns to Harry, closes its mouth, and disintegrates into ashes. Everyone stares at Harry in disbelief.\n\nHarry retreats to the Gryffindor Common Room with Ron and Hermione, exchanging anxious glances. In a classroom, as students work quietly, Harry notices two girls staring curiously at him. He glances at Ron and Hermione, who respond with embarrassed smiles, while another group of students quickly looks away when he turns their way."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Harry gets out of bed, covers his eyes, and blows his nose on his filthy garment, a habit stemming from his neglect of basic household spells taught at Hogwarts School of Witchcraft and Wizardry, then hits his head with the medicine bottle. Harry grabs Dobby, the house-elf bound by magic to serve the Malfoy family, but Dobby clicks his fingers, a common magical act among house-elves, and disappears. Harry jumps back into bed as shadows appear in the doorway, suggesting the late hour and dim lighting typical of the Hogwarts infirmary. A patient is carried in on a stretcher and lifted carefully onto a bed, an everyday scene in the bustling medical wing overseen by Madam Pomfrey. Professor Dumbledore, the esteemed headmaster known for his wisdom and eccentricity, takes the camera from Colin Creevey's stiff fingers and opens the back, and the film explodes, a result of its magical properties conflicting with the device. Hermione, renowned for her exceptional academic prowess, prepares a potion, and a ghostly girl in a school uniform, identified as Moaning Myrtle who haunts the second-floor girls' bathroom, shouts in Ron's face, then hovers high above their heads, zooms into a cubicle, and dives head first down the lavatory pan. In the Great Hall, a long platform has been erected for a dueling demonstration, and Lockhart, a self-proclaimed master of defensive magic, strides along it, tossing his cloak to a group of excited girls, eager followers of his celebrity status within the wizarding world. Snape, the formidable Potions Master notorious for his stern demeanor, steps onto the platform, and Snape and Lockhart draw their wands and solemnly salute each other. They bow, turn, take a few steps away, then turn again and face each other. Lockhart hurtles backwards down the platform, showcasing his lack of true dueling skill, gets painfully to his feet, and beckons to Draco, a member of the influential Malfoy family, who steps forward. Looking worried, Lockhart passes Harry, and grim-faced, Harry and Draco, fierce rivals from their first year at Hogwarts, approach each other, standing face to face. Draco glares, they salute each other, then turn and walk away. The watching students, familiar with the rivalry, hold their breath in anticipation as Harry and Draco face each other along the platform. Harry is somersaulted backwards, and Draco smirks at his cronies, fellow Slytherin house members, as Harry scrambles up and points his wand, making Draco's smile fade. Draco is spun in the air, and as he crashes onto the platform, Snape, never missing a chance to aid his favorite student, hauls him to his feet and pushes him back towards Harry. Draco points his wand, and a large snake, conjured through a dangerous but elementary spell, appears in front of Harry, uncoils itself, and moves towards him. Harry backs away, the snake flies into the air, then falls again, raising its head menacingly. Harry moves slowly towards it and starts to speak in Parseltongue, the rare ability to communicate with snakes. The snake fixes its gaze on a boy in the crowd as Harry speaks again. The snake moves closer to the boy who backs away, and Harry speaks again in the serpent language. The snake turns its head, staring at Harry, closes its mouth, and is reduced to ashes by a spontaneous eruption of magical energy. Harry frowns and looks around the hall to find everyone staring at him, their suspicion growing due to the historical association of Parseltongue with dark magic. Harry runs into the Gryffindor Common Room followed by Ron and Hermione, both close friends who stand by him despite the growing unease, looks from one to the other, and in a classroom, students are working quietly at long tables under the watchful eye of their professors. Harry looks up from his books to see two girls staring at him curiously, aware of the rumors spreading, and he glances across at Ron and Hermione, who both give him an embarrassed smile, supportive yet uneasy. A group of students at another table look away quickly as he turns towards them, their fear of his abilities evident in their averted gazes."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Draco points his wand and a large snake appears in front of Harry uncoils itself and moves towards him Harry gets out of bed covers his eyes and blows his nose on his filthy garment then hits his head with the medicine bottle The snake turns its head staring at Harry closes its mouth and is reduced to ashes Harry grabs Dobby but Dobby clicks his fingers and disappears Harry moves slowly towards it and starts to speak Harry jumps back into bed as shadows appear in the doorway A patient is carried in on a stretcher and lifted carefully onto a bed Professor Dumbledore takes the camera from Colin Creevey's stiff fingers and opens the back and the film explodes A patient is carried in on a stretcher and lifted carefully onto a bed Harry gets out of bed covers his eyes and blows his nose on his filthy garment then hits his head with the medicine bottle Harry jumps back into bed as shadows appear in the doorway Hermione prepares a potion and a ghostly girl in a school uniform shouts in Ron's face then hovers high above their heads zooms into a cubicle and dives head first down the lavatory pan In the Great Hall a long platform has been erected and Lockhart strides along it tossing his cloak to a group of excited girls Snape steps onto the platform and Snape and Lockhart draw their wands and solemnly salute each other They bow turn take a few steps away then turn again and face each other They bow turn take a few steps away then turn again and face each other The snake moves closer to the boy who backs away and Harry speaks again Harry runs into the Gryffindor Common Room followed by Ron and Hermione looks from one to the other and in a classroom students are working quietly at long tables Lockhart hurtles backwards down the platform gets painfully to his feet and beckons to Draco who steps forward Looking worried Lockhart passes Harry and grimfaced Harry looks up from his books to see two girls staring at him curiously and he glances across at Ron and Hermione who both give him an embarrassed smile Harry and Draco approach each other standing face to face Harry grabs Dobby but Dobby clicks his fingers and disappears Draco glares they salute each other then turn and walk away The watching students hold their breath in anticipation as Harry and Draco face each other along the platform Harry is somersaulted backwards and Draco smirks at his cronies as Harry scrambles up and points his wand making Draco's smile fade Draco is spun in the air and as he crashes onto the platform Snape hauls him to his feet and pushes him back towards Harry Draco points his wand and a large snake appears in front of Harry uncoils itself and moves towards him they salute each other then turn and walk away Harry backs away the snake flies into the air then falls again raising its head menacingly Harry moves slowly towards it and starts to speak Snape steps onto the platform and Snape and Lockhart draw their wands and solemnly salute each other Professor Dumbledore takes the camera from Colin Creevey's stiff fingers and opens the back and the film explodes The snake fixes its gaze on a boy in the crowd as Harry speaks again The snake moves closer to the boy who backs away and Harry speaks again The snake turns its head staring at Harry closes its mouth and is reduced to ashes Harry frowns and looks around the hall to find everyone staring at him Harry runs into the Gryffindor Common Room followed by Ron and Hermione looks from one to the other and in a classroom students are working quietly at long tables Harry looks up from his books to see two girls staring at him curiously and he glances across at Ron and Hermione who both give him an embarrassed smile A group of students at another table look away quickly as he turns towards them"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Harry gets out of bed covers his eyes and blows his nose on his filthy garment then hits his head with the medicine bottle. Harry grabs Dobby but Dobby clicks his fingers and disappears. Harry jumps back into bed as shadows appear in the doorway. A patient is carried in on a stretcher and lifted carefully onto a bed. Professor Dumbledore takes the camera from Colin Creevey's stiff fingers and opens the back and the film explodes. Hermione prepares a potion and a ghostly girl in a school uniform shouts in Ron's face then hovers high above their heads zooms into a cubicle and dives head first down the lavatory pan. In the Great Hall a long platform has been erected and Lockhart strides along it tossing his cloak to a group of excited girls. Snape steps onto the platform and Snape and Lockhart draw their wands and solemnly salute each other. They bow turn take a few steps away then turn again and face each other. Lockhart hurtles backwards down the platform gets painfully to his feet and beckons to Draco who steps forward. Looking worried Lockhart passes Harry and grimfaced. Harry and Draco approach each other standing face to face. Draco glares. they salute each other then turn and walk away. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. The watching students hold their breath in anticipation as Harry and Draco face each other along the platform. Harry is somersaulted backwards and Draco smirks at his cronies as Harry scrambles up and points his wand making Draco's smile fade. Draco is spun in the air and as he crashes onto the platform Snape hauls him to his feet and pushes him back towards Harry. Draco points his wand and a large snake appears in front of Harry uncoils itself and moves towards him. Harry backs away. the snake flies into the air then falls again raising its head menacingly. Harry moves slowly towards it and starts to speak. The snake fixes its gaze on a boy in the crowd as Harry speaks again. The snake moves closer to the boy who backs away and Harry speaks again. The snake turns its head staring at Harry closes its mouth and is reduced to ashes. Harry frowns and looks around the hall to find everyone staring at him. Harry runs into the Gryffindor Common Room followed by Ron and Hermione looks from one to the other and in a classroom students are working quietly at long tables. Harry looks up from his books to see two girls staring at him curiously and he glances across at Ron and Hermione who both give him an embarrassed smile. A group of students at another table look away quickly as he turns towards them."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Harry gets out of bed covers his eyes and blows his nose on his filthy garment then hits his head with the medicine bottle. Harry grabs Dobby but Dobby clicks his fingers and disappears. Harry jumps back into bed as shadows appear in the doorway. A patient is carried in on a stretcher and lifted carefully onto a bed. Professor Dumbledore takes the camera from Colin Creevey's stiff fingers and opens the back and the film explodes. Hermione prepares a potion and a ghostly girl in a school uniform shouts in Ron's face then hovers high above their heads zooms into a cubicle and dives head first down the lavatory pan. In the Great Hall a long platform has been erected and Lockhart strides along it tossing his cloak to a group of excited girls. Snape steps onto the platform and Snape and Lockhart draw their wands and solemnly salute each other. They bow turn take a few steps away then turn again and face each other. Lockhart hurtles backwards down the platform gets painfully to his feet and beckons to Draco who steps forward. Looking worried Lockhart passes Harry and grimfaced. Harry and Draco approach each other standing face to face. Draco glares. they salute each other then turn and walk away. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. The watching students hold their breath in anticipation as Harry and Draco face each other along the platform. Harry is somersaulted backwards and Draco smirks at his cronies as Harry scrambles up and points his wand making Draco's smile fade. Draco is spun in the air and as he crashes onto the platform Snape hauls him to his feet and pushes him back towards Harry. Draco points his wand and a large snake appears in front of Harry uncoils itself and moves towards him. Harry backs away. the snake flies into the air then falls again raising its head menacingly. Harry moves slowly towards it and starts to speak. The snake fixes its gaze on a boy in the crowd as Harry speaks again. The snake moves closer to the boy who backs away and Harry speaks again. The snake turns its head staring at Harry closes its mouth and is reduced to ashes. Harry frowns and looks around the hall to find everyone staring at him. Harry runs into the Gryffindor Common Room followed by Ron and Hermione looks from one to the other and in a classroom students are working quietly at long tables. Harry looks up from his books to see two girls staring at him curiously and he glances across at Ron and Hermione who both give him an embarrassed smile. A group of students at another table look away quickly as he turns towards them."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Harry gets out of bed covers his eyes and blows his nose on his filthy garment then hits his head with the medicine bottle. Harry grabs Dobby but Dobby clicks his fingers and disappears. Harry jumps back into bed as shadows appear in the doorway. A patient is carried in on a stretcher and lifted carefully onto a bed. Professor Dumbledore takes the camera from Colin Creevey's stiff fingers and opens the back and the film explodes. Hermione prepares a potion and a ghostly girl in a school uniform shouts in Ron's face then hovers high above their heads zooms into a cubicle and dives head first down the lavatory pan. In the Great Hall a long platform has been erected and Lockhart strides along it tossing his cloak to a group of excited girls. The snake fixes its gaze on a boy in the crowd as Harry speaks again. The snake moves closer to the boy who backs away and Harry speaks again. The snake turns its head staring at Harry closes its mouth and is reduced to ashes. Harry frowns and looks around the hall to find everyone staring at him. Harry runs into the Gryffindor Common Room followed by Ron and Hermione looks from one to the other and in a classroom students are working quietly at long tables. Harry looks up from his books to see two girls staring at him curiously and he glances across at Ron and Hermione who both give him an embarrassed smile. A group of students at another table look away quickly as he turns towards them."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Harry gets out of bed covers his eyes and blows his nose on his filthy garment then hits his head with the medicine bottle. Harry grabs Dobby but Dobby clicks his fingers and disappears. Harry jumps back into bed as shadows appear in the doorway. Harry runs into the Gryffindor Common Room followed by Ron and Hermione looks from one to the other and in a classroom students are working quietly at long tables. Harry looks up from his books to see two girls staring at him curiously and he glances across at Ron and Hermione who both give him an embarrassed smile. A group of students at another table look away quickly as he turns towards them."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Luna gets out of bed, covers her eyes, and blows her nose on her filthy garment, then hits her head with the medicine bottle. Luna grabs Hagrid, but Hagrid clicks his fingers and disappears. Luna jumps back into bed as shadows appear in the doorway. A cat is carried in on a stretcher and lifted carefully onto a bed. Professor McGonagall takes the camera from Peeves's stiff fingers and opens the back, and the film explodes. Filch prepares a potion, and a ghostly girl in a school uniform shouts in Neville's face, then hovers high above their heads, zooms into a cubicle, and dives head first down the lavatory pan. In the Great Hall, a long platform has been erected, and Professor Flitwick strides along it, tossing his cloak to a group of excited girls. Sirius steps onto the platform, and Sirius and Flitwick draw their wands and solemnly salute each other. They bow, turn, take a few steps away, then turn again and face each other. Flitwick hurtles backwards down the platform, gets painfully to his feet, and beckons to Ginny who steps forward. Looking worried, Flitwick passes Luna, and grim-faced, Luna and Ginny approach each other, standing face to face. Ginny glares, they salute each other, then turn and walk away. The watching students hold their breath in anticipation as Luna and Ginny face each other along the platform. Luna is somersaulted backwards, and Ginny smirks at her cronies as Luna scrambles up and points her wand, making Ginny's smile fade. Ginny is spun in the air, and as she crashes onto the platform, Sirius hauls her to her feet and pushes her back towards Luna. Ginny points her wand, and a large snake appears in front of Luna, uncoils itself, and moves towards her. Luna backs away, the snake flies into the air, then falls again, raising its head menacingly. Luna moves slowly towards it and starts to speak. The snake fixes its gaze on a girl in the crowd as Luna speaks again. The snake moves closer to the girl who backs away, and Luna speaks again. The snake turns its head, staring at Luna, closes its mouth, and is reduced to ashes. Luna frowns and looks around the hall to find everyone staring at her. Luna runs into the Hufflepuff Common Room followed by Neville and Filch, looks from one to the other, and in a classroom, students are working quietly at long tables. Luna looks up from her books to see two boys staring at her curiously, and she glances across at Neville and Filch, who both give her an embarrassed smile. A group of students at another table look away quickly as she turns towards them."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Harry gets out of the hammock, covers his eyes, and blows his nose on his filthy curtain, then hits his head with the flowerpot. Harry grabs Dobby, but Dobby clicks his fingers and disappears. Harry jumps back into the hammock as shadows appear in the window. A patient is carried in on a trolley and lifted carefully onto a bench. Professor Dumbledore takes the lantern from Colin Creevey's stiff fingers and opens the back, and the bulb explodes. Hermione prepares a pastry, and a ghostly girl in a raincoat shouts in Ron's face, then hovers high above their heads, zooms into a stall, and dives head first down the watering can. In the Great Hall, a long diving board has been erected, and Lockhart strides along it, tossing his scarf to a group of excited girls. Snape steps onto the diving board, and Snape and Lockhart draw their umbrellas and solemnly salute each other. They bow, turn, take a few steps away, then turn again and face each other. Lockhart hurtles backwards down the diving board, gets painfully to his feet, and beckons to Draco who steps forward. Looking worried, Lockhart passes Harry, and grim-faced, Harry and Draco approach each other, standing face to face. Draco glares, they salute each other, then turn and walk away. The watching students hold their breath in anticipation as Harry and Draco face each other along the diving board. Harry is somersaulted backwards, and Draco smirks at his cronies as Harry scrambles up and points his umbrella, making Draco's smile fade. Draco is spun in the air, and as he crashes onto the diving board, Snape hauls him to his feet and pushes him back towards Harry. Draco points his umbrella, and a large lizard appears in front of Harry, uncoils itself, and moves towards him. Harry backs away, the lizard flies into the air, then falls again, raising its head menacingly. Harry moves slowly towards it and starts to speak. The lizard fixes its gaze on a boy in the crowd as Harry speaks again. The lizard moves closer to the boy who backs away, and Harry speaks again. The lizard turns its head, staring at Harry, closes its mouth, and is reduced to confetti. Harry frowns and looks around the ballroom to find everyone staring at him. Harry runs into the Gryffindor Library followed by Ron and Hermione, looks from one to the other, and in a studio, students are working quietly at long benches. Harry looks up from his notebooks to see two girls staring at him curiously, and he glances across at Ron and Hermione, who both give him an embarrassed smile. A group of students at another bench look away quickly as he turns towards them."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Harry springs out of bed, shields his eyes, and scribbles on his filthy garment, then taps his head with the medicine bottle. Harry seizes Dobby, but Dobby twirls his fingers and vanishes. Harry leaps back into bed as shadows dance in the doorway. A patient is wheeled in on a stretcher and gently placed onto a bed. Professor Dumbledore removes the camera from Colin Creevey's stiff fingers and closes the back, and the film vanishes. Hermione cooks a potion, and a ghostly girl in a school uniform whispers in Ron's face, then floats high above their heads, slides into a cubicle, and glides head first down the lavatory pan. In the Great Hall, a long platform has been created, and Lockhart saunters along it, flinging his cloak to a group of excited girls. Snape walks onto the platform, and Snape and Lockhart raise their wands and jovially salute each other. They nod, spin, take a few steps forward, then spin again and face each other. Lockhart tumbles backwards down the platform, rises painfully to his feet, and gestures to Draco who steps forward. Looking anxious, Lockhart glides past Harry, and grim-faced, Harry and Draco approach each other, standing face to face. Draco squints, they nod to each other, then turn and stroll away. The watching students hold their breath in anticipation as Harry and Draco face each other along the platform. Harry is flipped backwards, and Draco giggles at his cronies as Harry leaps up and waves his wand, making Draco's smile disappear. Draco is twirled in the air, and as he lands onto the platform, Snape pulls him to his feet and nudges him back towards Harry. Draco waves his wand, and a large snake materializes in front of Harry, stretches itself, and slides towards him. Harry inches away, the snake leaps into the air, then lands again, raising its head threateningly. Harry inches slowly towards it and starts to chant. The snake fixes its eyes on a boy in the crowd as Harry chants again. The snake edges closer to the boy who inches away, and Harry chants again. The snake pivots its head, staring at Harry, closes its mouth, and is transformed to glitter. Harry ponders and looks around the hall to find everyone gazing at him. Harry sprints into the Gryffindor Common Room followed by Ron and Hermione, glances from one to the other, and in a classroom, students are chatting quietly at long tables. Harry peers up from his books to see two girls glancing at him curiously, and he peers across at Ron and Hermione, who both give him a bashful smile. A group of students at another table avert their eyes quickly as he turns towards them."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Rufus rises from the chair, covers his elbows, and wipes his brow on his grimy curtain, then taps his chin with the cereal box. Rufus seizes Moby, but Moby taps his shoes and vanishes. Rufus leaps back onto the chair as shadows emerge in the window. A musician is carried in on a canoe and placed gently onto a couch. Inspector Underhill takes the suitcase from Jerry's rigid toes and opens the top, and the tape erupts. Clarissa concocts a recipe, and an eerie boy in a fireman's uniform yells in Ben's ear, then floats high above their arms, zooms into a veranda, and dives headfirst down the chimney flue. In the Dining Room, a long spiral has been constructed, and Bradford strides along it, tossing his scarf to a cluster of thrilled cats. Jasper steps onto the spiral, and Jasper and Bradford draw their umbrellas and solemnly salute one another. They bow, pivot, take a few paces away, then pivot again and face each other. Bradford tumbles backwards down the spiral, struggles painfully to his feet, and motions to Travis who steps forward. Looking anxious, Bradford passes Rufus, and stern-faced, Rufus and Travis approach one another, standing nose to nose. Travis glowers, they salute one another, then pivot and walk away. The observing teachers hold their breath in suspense as Rufus and Travis face one another along the spiral. Rufus is backflipped backwards, and Travis sneers at his pigeons as Rufus scrambles up and aims his umbrella, making Travis's grin vanish. Travis is whirled in the atmosphere, and as he crashes onto the spiral, Jasper pulls him to his feet and nudges him back towards Rufus. Travis aims his umbrella, and a giant lizard appears in front of Rufus, unfurls itself, and slithers towards him. Rufus retreats, the lizard flips into the sky, then descends again, raising its tail threateningly. Rufus advances slowly towards it and begins to sing. The lizard fixes its sight on a girl in the audience as Rufus sings again. The lizard moves nearer to the girl who recoils, and Rufus sings once more. The lizard twists its neck, staring at Rufus, clamps its jaw, and is turned to crystals. Rufus scowls and glances around the ballroom to find everyone gaping at him. Rufus bolts into the Dragon Den followed by Ben and Clarissa, glances from one to the other, and in a workspace, teachers are drafting quietly at long benches. Rufus gazes up from his journals to see two boys gaping at him inquisitively, and he peeks across at Ben and Clarissa, who both give him an awkward grin. A band of teachers at another bench look away rapidly as he turns towards them."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Luna tumbles out of bed, shields her ears, and tosses her shoe at her filthy garment, then scratches her chin with the medicine spoon. Luna nudges Hagrid, but Hagrid waves his hat and evaporates. Luna tiptoes back into bed as mist floats in the window. An artist is rolled in on a cart and hoisted gently onto a chair. Professor McGonagall retrieves the notebook from Justin Finch-Fletchley's frozen hands and flips through the pages, and the ink vanishes. Neville concocts a spell, and a spectral boy in a wizard's cape bellows into Lavender's face, then spins high above their heads, swoops into a cupboard, and vaults head first into the waste bin. In the Library, a tall podium has been constructed, and Trelawney skips along it, flinging her scarf to a group of eager boys. Filch marches onto the podium, and Filch and Trelawney brandish their brooms and formally nod to each other. They bow, twist, take a few steps apart, then spin again and face one another. Trelawney slides sideways off the podium, struggles painfully to her feet, and gestures to Seamus who steps forward. Looking puzzled, Trelawney passes Luna, and stern-faced, Luna and Seamus confront one another, standing face to face. Seamus frowns, they nod to each other, then pivot and tiptoe away. The observing ghosts hold their breath in anticipation as Luna and Seamus confront each other along the podium. Luna is flipped sideways, and Seamus snickers at his friends as Luna stumbles up and waves her broom, making Seamus's smirk vanish. Seamus is twirled in the air, and as he thuds onto the podium, Filch drags him to his feet and nudges him back towards Luna. Seamus waves his broom, and a giant lizard appears in front of Luna, unfurls itself, and glides towards her. Luna inches away, the lizard bursts into the air, then tumbles again, raising its tail menacingly. Luna edges slowly towards it and begins to sing. The lizard fixes its gaze on a girl in the audience as Luna sings again. The lizard inches closer to the girl who retreats, and Luna sings once more. The lizard shifts its head, glaring at Luna, closes its eyes, and dissolves to mist. Luna scowls and looks around the library to find everyone staring at her. Luna skips into the Hufflepuff Common Room followed by Lavender and Neville, glances from one to the other, and in a laboratory, students are chatting quietly at round desks. Luna peers up from her scrolls to see two boys gazing at her inquisitively, and she peers across at Lavender and Neville, who both offer her a bashful nod. A group of ghosts at another desk avert their gaze quickly as she turns towards them."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Harry climbs out of a hammock, shields his ears, and whistles into his grimy scarf, then scratches his chin with the watering can. Harry seizes Dobby, but Dobby snaps his heels and vanishes. Harry leaps into the hammock as balloons materialize in the corridor. A musician is escorted in on a platform and delicately placed onto a chair. Professor Dumbledore extracts the microphone from Colin Creevey's rigid hand and unlocks the case, and the tape combusts. Hermione concocts a brew, and a translucent boy in sports gear yells in Ron's ear, then floats high above their heads, zooms into a closet, and plunges feet first into the wastebasket. In the Great Hall, a tall tree has been planted, and Lockhart marches around it, tossing his hat to a group of enthused boys. Snape climbs onto the tree, and Snape and Lockhart raise their brushes and earnestly wave at each other. They nod, pivot, take a few paces away, then pivot again and stare at each other. Lockhart tumbles forwards off the tree, gets awkwardly to his feet, and nods to Draco who steps closer. Looking anxious, Lockhart sidles past Harry, and determined, Harry and Draco move towards each other, standing toe to toe. Draco squints, they wave at each other, then pivot and stride away. The watching students hold their breath in excitement as Harry and Draco confront each other across the tree. Harry is flipped forwards, and Draco beams at his companions as Harry leaps up and gestures with his brush, making Draco's grin disappear. Draco is twirled on the ground, and as he lands onto the tree, Snape pulls him to his feet and nudges him away towards Harry. Draco waves his brush, and a large kite manifests in front of Harry, unfurls itself, and glides towards him. Harry steps aside, the kite dives into the sky, then floats back, lifting its tail ominously. Harry advances cautiously towards it and begins to sing. The kite fixes its sight on a girl in the throng as Harry sings again. The kite hovers nearer to the girl who retreats, and Harry sings once more. The kite turns its head, peering at Harry, closes its eyes, and is reduced to petals. Harry grimaces and scans around the hall to find everyone watching him. Harry dashes into the Gryffindor Common Room followed by Ron and Hermione, glances from one to the other, and in a classroom, students are crafting quietly at round stools. Harry looks up from his maps to see two boys observing him intently, and he peers across at Ron and Hermione, who both offer him a sheepish grin. A cluster of students at another stool avert their gaze swiftly as he turns towards them."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Betsy leaps off the couch, shields her ears, and flicks her teeth on her grimy blanket, then nudges her knee with the paintbrush. Betsy catches a dolphin, but the dolphin taps its toes and vanishes. Betsy tumbles into a hammock as curtains emerge in the window frame. A musician is wheeled in on a skateboard and hoisted gently into a hammock. Captain Sparrow grabs the compass from Stevie Nicks' rigid toes and unlocks the latch, and the treasure evaporates. Stephanie mixes a salad, and a spectral cat in a sailor outfit meows in Tim's ear, then floats low below their feet, zips over to a tent, and plunges feet first up the chimney flue. In the Ballroom, a tall tower has been constructed, and Thor lumbers over it, flinging his hammer to a crowd of sleepy kids. Loki hops onto the tower, and Loki and Thor cross their fingers and lightly wave at each other. They nod, spin, take a few steps closer, then spin again and face away from each other. Thor tumbles forwards up the tower, gets joyfully to his knees, and whistles to Edgar who hops backward. Beaming cheerfully, Thor squeezes Betsy, and smiling broadly, Betsy and Edgar step away from each other, standing back to back. Edgar whispers, they wave at each other, then twist and jog toward each other. The whispering audience bites their tongues in confusion as Betsy and Edgar back away from each other off the tower. Betsy is flipped sideways, and Edgar chuckles at his kittens as Betsy trips down and raises her umbrella, making Edgar’s laugh shrink. Edgar is twirled on the ground, and as he bounces off the tower, Loki swings him to his knees and pulls him away from Betsy. Edgar swings his umbrella, and a giant bird appears behind Betsy, unfurls itself, and crawls over her. Betsy crawls towards it, the bird swims through the ground, then rises again, lowering its beak disdainfully. Betsy skips hastily past it and pauses to bark. The bird averts its gaze on a cat in the gathering as Betsy barks again. The bird inches closer to the cat who tiptoes toward it, and Betsy barks again. The bird spins its wings, leering at Betsy, opens its beak, and is shattered to pebbles. Betsy grimaces and stares around the tent to find everything glaring at her. Betsy skips into the Tea Party Lounge followed by Tim and Stephanie, gazes from one to the other, and in an attic, sailors are dancing loudly on round stools. Betsy squints down at her papers to find four dogs blinking at her suspiciously, and she grimaces towards Tim and Stephanie, who both throw her a surprised frown. A cluster of sailors on another stool turn away quietly as she glares towards them."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Harry wakes up and accidentally hits himself with a medicine bottle before grabbing Dobby, who vanishes. Shadows appear as a patient is brought in, and Dumbledore realizes a camera film has exploded. Hermione prepares a potion while a ghostly girl yells at Ron. In the Great Hall, Lockhart and Snape duel before inviting Harry and Draco to face off. Draco conjures a snake that advances towards another boy, but Harry speaks calmly, causing the snake to turn to ash. Everyone stares at Harry, and he, followed by Ron and Hermione, runs to the Gryffindor Common Room. Later in class, Harry notices students staring at him, while Ron and Hermione give him awkward smiles."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "A group of students at another table look away quickly as he turns towards them Harry looks up from his books to see two girls staring at him curiously and he glances across at Ron and Hermione who both give him an embarrassed smile Harry runs into the Gryffindor Common Room followed by Ron and Hermione looks from one to the other and in a classroom students are working quietly at long tables Harry frowns and looks around the hall to find everyone staring at him The snake turns its head staring at Harry closes its mouth and is reduced to ashes The snake moves closer to the boy who backs away and Harry speaks again The snake fixes its gaze on a boy in the crowd as Harry speaks again Harry moves slowly towards it and starts to speak the snake flies into the air then falls again raising its head menacingly Harry backs away Draco points his wand and a large snake appears in front of Harry uncoils itself and moves towards him Draco is spun in the air and as he crashes onto the platform Snape hauls him to his feet and pushes him back towards Harry Harry is somersaulted backwards and Draco smirks at his cronies as Harry scrambles up and points his wand making Draco's smile fade The watching students hold their breath in anticipation as Harry and Draco face each other along the platform they salute each other then turn and walk away Draco glares Harry and Draco approach each other standing face to face Looking worried Lockhart passes Harry and grimfaced Lockhart hurtles backwards down the platform gets painfully to his feet and beckons to Draco who steps forward They bow turn take a few steps away then turn again and face each other Snape steps onto the platform and Snape and Lockhart draw their wands and solemnly salute each other In the Great Hall a long platform has been erected and Lockhart strides along it tossing his cloak to a group of excited girls Hermione prepares a potion and a ghostly girl in a school uniform shouts in Ron's face then hovers high above their heads zooms into a cubicle and dives head first down the lavatory pan Professor Dumbledore takes the camera from Colin Creevey's stiff fingers and opens the back and the film explodes A patient is carried in on a stretcher and lifted carefully onto a bed Harry jumps back into bed as shadows appear in the doorway Harry grabs Dobby but Dobby clicks his fingers and disappears Harry gets out of bed covers his eyes and blows his nose on his filthy garment then hits his head with the medicine bottle"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Harry backs away Draco is spun in the air and as he crashes onto the platform Snape hauls him to his feet and pushes him back towards Harry Looking worried Lockhart passes Harry and grimfaced The snake fixes its gaze on a boy in the crowd as Harry speaks again A group of students at another table look away quickly as he turns towards them In the Great Hall a long platform has been erected and Lockhart strides along it tossing his cloak to a group of excited girls Hermione prepares a potion and a ghostly girl in a school uniform shouts in Ron's face then hovers high above their heads zooms into a cubicle and dives head first down the lavatory pan Harry and Draco approach each other standing face to face The watching students hold their breath in anticipation as Harry and Draco face each other along the platform Lockhart hurtles backwards down the platform gets painfully to his feet and beckons to Draco who steps forward Harry frowns and looks around the hall to find everyone staring at him Draco glares the snake flies into the air then falls again raising its head menacingly Harry is somersaulted backwards and Draco smirks at his cronies as Harry scrambles up and points his wand making Draco's smile fade Harry runs into the Gryffindor Common Room followed by Ron and Hermione looks from one to the other and in a classroom students are working quietly at long tables Harry grabs Dobby but Dobby clicks his fingers and disappears they salute each other then turn and walk away Harry jumps back into bed as shadows appear in the doorway Draco points his wand and a large snake appears in front of Harry uncoils itself and moves towards him Harry looks up from his books to see two girls staring at him curiously and he glances across at Ron and Hermione who both give him an embarrassed smile Professor Dumbledore takes the camera from Colin Creevey's stiff fingers and opens the back and the film explodes The snake moves closer to the boy who backs away and Harry speaks again Snape steps onto the platform and Snape and Lockhart draw their wands and solemnly salute each other They bow turn take a few steps away then turn again and face each other The snake turns its head staring at Harry closes its mouth and is reduced to ashes Harry gets out of bed covers his eyes and blows his nose on his filthy garment then hits his head with the medicine bottle A patient is carried in on a stretcher and lifted carefully onto a bed Harry moves slowly towards it and starts to speak"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The watching students hold their breath in anticipation as Harry and Draco face each other along the platform Harry is somersaulted backwards and Draco smirks at his cronies as Harry scrambles up and points his wand making Draco's smile fade Draco is spun in the air and as he crashes onto the platform Snape hauls him to his feet and pushes him back towards Harry Draco points his wand and a large snake appears in front of Harry uncoils itself and moves towards him Harry backs away the snake flies into the air then falls again raising its head menacingly Harry moves slowly towards it and starts to speak The snake fixes its gaze on a boy in the crowd as Harry speaks again The snake moves closer to the boy who backs away and Harry speaks again The snake turns its head staring at Harry closes its mouth and is reduced to ashes Harry frowns and looks around the hall to find everyone staring at him Harry runs into the Gryffindor Common Room followed by Ron and Hermione looks from one to the other and in a classroom students are working quietly at long tables Harry looks up from his books to see two girls staring at him curiously and he glances across at Ron and Hermione who both give him an embarrassed smile A group of students at another table look away quickly as he turns towards them Harry gets out of bed covers his eyes and blows his nose on his filthy garment then hits his head with the medicine bottle Harry grabs Dobby but Dobby clicks his fingers and disappears Harry jumps back into bed as shadows appear in the doorway A patient is carried in on a stretcher and lifted carefully onto a bed Professor Dumbledore takes the camera from Colin Creevey's stiff fingers and opens the back and the film explodes Hermione prepares a potion and a ghostly girl in a school uniform shouts in Ron's face then hovers high above their heads zooms into a cubicle and dives head first down the lavatory pan In the Great Hall a long platform has been erected and Lockhart strides along it tossing his cloak to a group of excited girls Snape steps onto the platform and Snape and Lockhart draw their wands and solemnly salute each other They bow turn take a few steps away then turn again and face each other Lockhart hurtles backwards down the platform gets painfully to his feet and beckons to Draco who steps forward Looking worried Lockhart passes Harry and grimfaced Harry and Draco approach each other standing face to face Draco glares they salute each other then turn and walk away"
        }
      ]
    }
  ]
}