{
  "ground_truth": "Two eyes staring are followed by Rufus Scrimgeour, the Minister of Magic, being photographed at a press conference. At home, Hermione reads the headlines in the Daily Prophet while Harry Potter's uncle, Vernon, drags a suitcase to his car as Harry watches from his bedroom window. Outside the rebuilt Weasleys' home, Ron stands staring over the wreath beds toward the horizon as his mother and sister, Ginny, are busy in the kitchen. Ron glances briefly behind him before turning back to the wreath beds. Hermione's parents watch TV as she looks at them sadly and raises her wand, causing the tip to glow. The images of Hermione as a baby and a young child slowly fade from view in the photographs on the mantelpiece. Hermione's eyes fill with tears as she sees herself disappearing from every photograph in the home. Harry's Aunt Petunia sits in a car, staring blankly, while Uncle Vernon looks nervously at the sky and Dudley clambers into the backseat. Harry stands alone on the path watching them go. Standing outside her front door, Hermione looks back for a moment, then with her head lowered, walks down the path and strides along the street, her long wavy hair ruffled by a breeze as she carries a small beaded bag. A Death Eater, a dark shadowy figure, zooms over the countryside towards a large manor house on a country estate, descending to the ground. The Death Eater walks towards the gates, waves his wand to make them evaporate, allowing him to step through, his face somber with dark, lank, shoulder-length hair, and the gates reappear behind him. Snape enters a bare storeroom and climbs a flight of stairs to where people are seated at a long table in front of a blazing fire, and at the end of the table, a woman hangs horizontally in mid-air. Snape sits close to Voldemort as a huge snake glides on the floor beside Pius Thicknesse. Voldemort turns to Snape and she shrinks back. He passes behind the Malfoys as Lucius Malfoy turns his face twitching as he reaches for his wand, his hand shaking as he holds it out to Voldemort, who runs his fingers over it, then snaps off its handle. Snape watches keenly as Voldemort discards the handle, and Lucius trembles while Voldemort points the wand at the floating woman, who pleads with Snape as he stares coldly. Voldemort flicks the wand and she falls dead on the table, causing Draco Malfoy to wince and a single tear to fall from Charity's eye. Voldemort strokes the snake, which glides onto the table and slithers towards the dead woman, its tongue flickering and mouth opening wide. Albus Dumbledore falls from the astronomy tower, floating gently downwards.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Two optics gazing are ensued by Rufus Scrimgeour, the Head of Sorcery, being captured at a press briefing. At residence, Hermione peruses the headlines in the Daily Prophet while Harry Potter's uncle, Vernon, hauls a suitcase to his automobile as Harry observes from his bedroom pane. Outside the restored Weasleys' abode, Ron stands gazing over the garland beds toward the skyline as his mother and sister, Ginny, are active in the kitchen. Ron peers briefly behind him before revolving back to the garland beds. Hermione's parents view TV as she regards them sorrowfully and elevates her wand, causing the tip to illuminate. The depictions of Hermione as an infant and a young child gradually vanish from view in the photographs on the mantelpiece. Hermione's optics swell with tears as she witnesses herself vanishing from every photograph in the domicile. Harry's Aunt Petunia perches in a vehicle, staring blankly, while Uncle Vernon peers anxiously at the heavens and Dudley scrambles into the backseat. Harry stands solitary on the pathway observing them depart. Standing outside her front portal, Hermione glances back for a moment, then with her head lowered, strides down the pathway and saunters along the road, her long wavy mane tousled by a gust as she carries a small beaded satchel. A Death Eater, a dark shadowy entity, zooms over the countryside towards a large manor residence on a rural estate, descending to the terrain. The Death Eater strides towards the gates, waves his wand to make them dissolve, permitting him to step through, his countenance somber with dark, lank, shoulder-length hair, and the gates reappear behind him. Snape enters a bare storeroom and ascends a flight of stairs to where individuals are seated at a long table in front of a blazing blaze, and at the end of the table, a woman suspends horizontally in mid-air. Snape perches near to Voldemort as a huge serpent slides on the floor beside Pius Thicknesse. Voldemort turns to Snape and she recoils. He passes behind the Malfoys as Lucius Malfoy turns his visage twitching as he extends for his wand, his hand trembling as he holds it out to Voldemort, who runs his digits over it, then snaps off its grip. Snape observes keenly as Voldemort discards the grip, and Lucius quivers while Voldemort aims the wand at the levitating woman, who beseeches Snape as he stares frigidly. Voldemort flicks the wand and she collapses deceased on the table, causing Draco Malfoy to flinch and a singular tear to descend from Charity's eye. Voldemort caresses the serpent, which slides onto the table and slithers towards the deceased woman, its tongue flickering and mouth unveiling wide. Albus Dumbledore descends from the astronomy tower, floating gently downward."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Two eyes staring are followed by Rufus Scrimgeour, the Minister of Magic, who is photographing a press conference. At home, the headlines in the Daily Prophet are read by Hermione while a suitcase is dragged by Harry Potter's uncle, Vernon, to his car as Harry is watched by him from his bedroom window. Outside the rebuilt Weasleys' home, the horizon is stared over by Ron from the wreath beds as he stands, and his mother and sister, Ginny, busy themselves in the kitchen. Ron briefly glances behind him before turning back to the wreath beds. Hermione's parents are watched by her as they watch TV; then, she raises her wand, causing the tip to glow. The photographs on the mantelpiece slowly fade from view as images of Hermione as a baby and a young child disappear. Hermione's eyes are filled with tears as she sees herself disappearing from every photograph in the home. Harry's Aunt Petunia is sitting in a car, being stared at blankly, while the sky is looked at nervously by Uncle Vernon and Dudley clambers into the backseat. The path is stood on alone by Harry as he watches them go. Standing outside her front door, a moment is given by Hermione before she looks back; then, with her head lowered, the path is walked down and the street is strode along, her long wavy hair being ruffled by a breeze as a small beaded bag is carried by her. Over the countryside towards a large manor house on a country estate, a Death Eater, a dark shadowy figure, zooms, and the ground is descended to by him. The Death Eater waves his wand, making the gates evaporate so that they allow him to step through, and with his face somber with dark, lank, shoulder-length hair, the gates reappear behind him. A bare storeroom is entered by Snape, and he climbs a flight of stairs to where people are seated at a long table in front of a blazing fire, and at the end of the table, a woman hangs horizontally in mid-air. Voldemort sits close to Snape as a huge snake glides on the floor beside Pius Thicknesse. Snape is turned to by Voldemort, and she shrinks back. The Malfoys are passed behind by him as Lucius Malfoy turns his face twitching, reaching for his wand, and his hand shakes as it is held out to Voldemort, who runs his fingers over it, then snaps off its handle. Voldemort discards the handle as Snape watches keenly, and Lucius trembles while Voldemort points the wand at the floating woman; she pleads with Snape as he stares coldly. The wand is flicked by Voldemort, causing her to fall dead on the table, and Draco Malfoy winces, causing a single tear to fall from Charity's eye. The snake, which is stroked by Voldemort, glides onto the table and slithers towards the dead woman, its tongue flickering and mouth opening wide. Albus Dumbledore is made to fall from the astronomy tower, floating gently downwards."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Two eyes staring are followed by Rufus Scrimgeour, the Minister of Magic, being photographed at a press conference. At home, Hermione reads the Daily Prophet headlines while Harry Potter's uncle, Vernon, drags a suitcase to his car as Harry watches from his window. Outside the rebuilt Weasleys' home, Ron stares over the wreath beds toward the horizon as his mother and sister, Ginny, are busy in the kitchen. Ron glances briefly behind him before turning back. Hermione's parents watch TV as she looks at them sadly and raises her wand, causing the tip to glow. Images of Hermione as a baby and child fade from the photographs on the mantelpiece. Hermione's eyes fill with tears as she sees herself disappearing from every photo. Harry's Aunt Petunia sits in a car, staring blankly, while Uncle Vernon looks nervously at the sky and Dudley clambers into the backseat. Harry stands alone on the path watching them leave. Outside her front door, Hermione looks back, then walks down the path, her long wavy hair ruffled by a breeze as she carries a small beaded bag. A Death Eater, a dark shadowy figure, zooms over the countryside towards a large manor house, descending to the ground. The Death Eater waves his wand to make the gates evaporate, steps through, and the gates reappear behind him. Snape enters a bare storeroom and climbs stairs to where people are seated at a long table in front of a fire, and at the end, a woman hangs in mid-air. Snape sits close to Voldemort as a huge snake glides beside Pius Thicknesse. Voldemort turns to Snape, who shrinks back. He passes the Malfoys as Lucius Malfoy reaches for his wand, trembling as he holds it out to Voldemort, who snaps off its handle. Snape watches keenly as Voldemort discards the handle, and Lucius trembles while Voldemort points the wand at the floating woman, who pleads with Snape as he stares coldly. Voldemort flicks the wand, and she falls dead on the table, causing Draco Malfoy to wince and a single tear to fall from Charity's eye. Voldemort strokes the snake, which slithers towards the dead woman, its tongue flickering and mouth opening wide. Albus Dumbledore falls from the astronomy tower, floating gently downwards."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Two eyes stare as Rufus Scrimgeour, the Minister of Magic, is photographed at a press conference. At home, Hermione reads the Daily Prophet while Harry's uncle, Vernon, drags a suitcase to his car as Harry watches. Outside the rebuilt Weasleys' home, Ron stares at the horizon as his mother and sister, Ginny, are busy in the kitchen. Hermione's parents watch TV as she raises her wand, causing her childhood photos to fade. Her eyes fill with tears as she disappears from every photograph. Harry's Aunt Petunia sits in a car, staring blankly, while Uncle Vernon looks nervously at the sky and Dudley clambers into the backseat. Harry watches them go. Hermione looks back, then walks down the path, her hair ruffled by a breeze, carrying a small beaded bag. A Death Eater zooms over the countryside to a manor house, waves his wand to enter, and the gates reappear behind him. Snape enters a storeroom, climbs stairs to a room with a long table and a woman hanging in mid-air. Snape sits near Voldemort as a snake glides beside Pius Thicknesse. Voldemort turns to Snape, passes the Malfoys, and snaps Lucius's wand handle. Snape watches as Voldemort points the wand at the woman, who pleads with Snape. Voldemort flicks the wand, and she falls dead, causing Draco to wince. Voldemort strokes the snake, which slithers towards the dead woman. Albus Dumbledore falls from the astronomy tower, floating downwards."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Two intense eyes, filled with a piercing gaze, are followed by the sight of Rufus Scrimgeour, the current Minister of Magic, as he is captured in a photograph during a press conference. Meanwhile, at her home, Hermione Granger is seen reading the headlines in the Daily Prophet. At the same time, Harry Potter's uncle, Vernon Dursley, is busy dragging a suitcase to his car, all while Harry watches the scene unfold from the window of his bedroom. Outside the newly rebuilt Weasleys' home, Ron Weasley stands, his eyes fixed on the wreath beds as he gazes thoughtfully toward the distant horizon. Inside, his mother, Molly, and sister, Ginny, are occupied with tasks in the kitchen. Ron takes a moment to glance briefly behind him before turning his attention back to the wreath beds. In another scene, Hermione's parents are watching television, and she looks at them with a sad expression. She raises her wand, causing its tip to emit a soft glow. Gradually, the images of Hermione as a baby and a young child begin to fade from the photographs displayed on the mantelpiece. Hermione's eyes well up with tears as she witnesses herself disappearing from every cherished photograph in the home. Meanwhile, Harry's Aunt Petunia sits in a car, staring blankly ahead, while Uncle Vernon nervously glances at the sky, and Dudley clambers into the backseat. Harry stands alone on the path, watching them as they drive away. Standing outside her front door, Hermione pauses for a moment to look back, then, with her head lowered, she walks down the path and strides along the street, her long, wavy hair ruffled by a gentle breeze as she carries a small, beaded bag. Elsewhere, a Death Eater, a dark and shadowy figure, zooms over the countryside, heading towards a large manor house situated on a sprawling country estate. The figure descends to the ground and walks purposefully towards the gates, waving his wand to make them evaporate, allowing him to step through. His face is somber, framed by dark, lank, shoulder-length hair, and the gates reappear behind him. Severus Snape enters a bare storeroom and ascends a flight of stairs to a room where people are seated at a long table in front of a blazing fire. At the end of the table, a woman hangs horizontally in mid-air. Snape takes a seat close to Voldemort, as a huge snake glides on the floor beside Pius Thicknesse. Voldemort turns his attention to Snape, and she shrinks back in fear. He moves behind the Malfoys, and Lucius Malfoy turns, his face twitching as he reaches for his wand, his hand trembling as he holds it out to Voldemort. Voldemort runs his fingers over the wand, then snaps off its handle. Snape watches intently as Voldemort discards the handle, and Lucius trembles with fear. Voldemort points the wand at the floating woman, who pleads with Snape, but he stares back coldly. With a flick of the wand, Voldemort causes her to fall dead onto the table, prompting Draco Malfoy to wince and a single tear to fall from Charity's eye. Voldemort strokes the snake, which glides onto the table and slithers towards the lifeless woman, its tongue flickering and mouth opening wide. Albus Dumbledore is seen falling from the astronomy tower, floating gently downwards."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Two intense eyes, brimming with a piercing gaze that seems to cut through everything, are succeeded by the sight of Rufus Scrimgeour, who is the current Minister of Magic. He is captured in the flash of a photograph during a bustling press conference. Meanwhile, in the cozy confines of her home, Hermione Granger is pictured reading the bold headlines splashed across the Daily Prophet. Simultaneously, Harry Potter's uncle, the ever-gruff Vernon Dursley, busily drags a hefty suitcase across the yard to his car, while Harry quietly observes this scene unfold from the window of his bedroom sanctuary. Outside the newly rebuilt and charming Weasleys’ home, Ron Weasley stands still, his eyes transfixed on the beautifully arranged wreath beds as he contemplates the distant horizon with thoughtful eyes. Within the warm interior, his mother, Molly, and sister, Ginny, are diligently occupied with various tasks in the bustling kitchen. Ron takes a brief moment to glance back at them before letting his attention return to the wreath beds before him. Meanwhile, in another scene, Hermione’s parents are engaged with the television, and she gazes at them with a melancholic expression. She raises her wand, and its tip begins to glow softly. Gradually, the images depicting Hermione as a baby and a young child start to fade away from the mantelpiece photographs. Hermione's eyes glisten with tears as she witnesses her own image disappearing from every cherished photograph in her home. Meanwhile, Harry's Aunt Petunia sits expressionlessly in a car, staring blankly out the window, as Uncle Vernon nervously peers at the sky above, and Dudley scrambles into the backseat. Harry stands alone on the path, watching them intently as they drive away into the distance. Standing outside her front door, Hermione pauses momentarily to glance back one last time, then, with head lowered, she walks down the winding path and strides along the street; her long, wavy hair is gently ruffled by a tender breeze as she carries a small, beaded bag. Elsewhere in the world, a Death Eater, shadowy and ominous, zooms swiftly over the serene countryside, making his way purposefully towards a grand manor house nestled on an expansive country estate. The figure descends to the ground and strides with intention towards the iron-wrought gates, skillfully waving his wand to make them evaporate, allowing him to step through effortlessly. His face is marked by a somberness, framed by dark, lank hair that falls to his shoulders, and behind him, the gates reappear, sealing the entrance. Severus Snape enters a bare and austere storeroom, ascending a flight of stairs to a room where individuals are gathered around a long table set in front of a roaring fire. At the distant end of the table, a woman hangs suspended horizontally in mid-air. Snape takes his seat with authority close to Voldemort, while, at the same time, a massive snake glides eerily on the floor next to Pius Thicknesse. Voldemort directs his gaze towards Snape, causing the woman to shrink back in palpable fear. He moves stealthily behind the Malfoys, where Lucius Malfoy turns with noticeable anxiety, his face twitching as he reaches with a trembling hand for his wand, which he tentatively offers to Voldemort. Voldemort runs his fingers over the wand with deliberate care, then abruptly snaps off its handle. Snape maintains his intense gaze as Voldemort discards the handle, leaving Lucius trembling with fear. Voldemort points the wand menacingly at the floating woman, who pleads with Snape through terrified eyes, but he remains cold and unyielding as he stares back at her. With a swift flick of the wand, Voldemort causes her to plummet lifelessly onto the table, prompting Draco Malfoy to wince in horror and a single, sorrowful tear to escape from Charity’s eye. Voldemort gently strokes the snake, which then glides onto the table and slithers menacingly towards the lifeless woman, its tongue flickering with anticipation, and its mouth opening wide. In a separate vision, Albus Dumbledore is seen descending in a gentle, dreamlike fall from the astronomy tower, floating gently downwards like a whisper on the wind."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Two eyes, wide and unblinking, fixate on the scene as Rufus Scrimgeour, the Minister of Magic, stands poised at a press conference, the bright flash of cameras capturing his every move. Meanwhile, in the quiet of her home, Hermione Granger sits with the Daily Prophet spread before her, her eyes scanning the headlines with a mix of concern and determination. At the same time, Harry Potter's uncle, Vernon Dursley, grips the handle of a suitcase, his face set with purpose as he drags it across the floor, the wheels bumping over the threshold as he makes his way to the car. From the solitude of his bedroom window, Harry watches this scene unfold, his gaze following his uncle's every step. Outside the newly rebuilt Weasleys' home, Ron Weasley stands rooted to the spot, his eyes fixed on the horizon beyond the wreath beds, lost in thought. Behind him, the sounds of his mother and sister, Ginny, busy themselves in the kitchen, their movements a comforting backdrop. Ron briefly glances over his shoulder, taking in the familiar scene, before turning his attention back to the horizon. In another home, Hermione's parents sit absorbed in the glow of the television, unaware of their daughter's presence as she watches them with a heavy heart. With a deep breath, she raises her wand, the tip igniting with a soft glow, and as she does, the images of her as a baby and young child begin to fade from the photographs on the mantelpiece. Tears well in Hermione's eyes as she witnesses her own image disappearing from every cherished photograph in the house. Meanwhile, in the Dursleys' car, Aunt Petunia sits with a vacant stare, her mind elsewhere, while Uncle Vernon casts nervous glances at the sky, and Dudley clambers awkwardly into the backseat. Harry stands alone on the path, his heart heavy as he watches them drive away. Outside her front door, Hermione pauses for a moment, casting one last look back at the home she has known, before lowering her head and walking down the path. Her long, wavy hair is tousled by a gentle breeze as she strides purposefully along the street, a small beaded bag clutched in her hand. In a distant countryside, a Death Eater, a dark and shadowy figure, speeds through the air towards a large manor house nestled on a sprawling estate. As he descends to the ground, he approaches the gates, waving his wand with a practiced flick to make them evaporate, allowing him to step through. His face is somber, framed by dark, lank, shoulder-length hair, and as he passes, the gates reappear behind him. Severus Snape enters a bare storeroom, his footsteps echoing as he climbs a flight of stairs to a room where people are seated at a long table in front of a roaring fire. At the table's end, a woman hangs suspended in mid-air, her presence a haunting sight. Snape takes his place close to Voldemort, his expression unreadable as a massive snake glides silently on the floor beside Pius Thicknesse. Voldemort turns his attention to Snape, causing her to shrink back instinctively. He moves behind the Malfoys, and Lucius Malfoy, his face twitching with fear, reaches for his wand, his hand trembling as he extends it to Voldemort. With a casual air, Voldemort runs his fingers over the wand before snapping off its handle, discarding it without a second thought. Snape watches intently, his eyes never leaving the scene, as Lucius trembles with fear. Voldemort then points the wand at the floating woman, who pleads with Snape, her voice filled with desperation, but he meets her gaze with cold indifference. With a flick of the wand, Voldemort sends her crashing onto the table, lifeless, causing Draco Malfoy to wince and a solitary tear to escape from Charity's eye. Voldemort gently strokes the snake, which slithers onto the table, its tongue flickering as it approaches the dead woman, its mouth opening wide in anticipation. Meanwhile, Albus Dumbledore falls from the astronomy tower, his body descending gently through the air, a serene figure amidst the chaos."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Rufus Scrimgeour, the Minister of Magic, is photographed at a press conference, while at home, Hermione reads the Daily Prophet headlines. Harry Potter's uncle, Vernon, loads a suitcase into his car as Harry watches from his bedroom window. Outside the rebuilt Weasleys' home, Ron gazes toward the horizon, briefly glancing back at his mother and sister, Ginny, who are busy in the kitchen. Hermione, with a heavy heart, raises her wand, causing her childhood photos to fade from the mantelpiece as her parents watch TV. Tears fill her eyes as she sees herself disappearing from every photograph. Meanwhile, Harry's Aunt Petunia sits in a car, staring blankly, as Uncle Vernon nervously looks at the sky and Dudley climbs into the backseat. Harry stands alone, watching them leave. Hermione, standing outside her front door, takes a moment to look back before walking down the path and along the street, her hair ruffled by a breeze as she carries a small beaded bag. A Death Eater zooms over the countryside to a large manor house, making the gates evaporate with a wave of his wand before stepping through. Snape enters a storeroom, climbs stairs to a room where people are seated at a long table, and sits close to Voldemort, who is beside a huge snake. Voldemort turns to Snape, causing her to shrink back, and passes behind the Malfoys. Lucius Malfoy, trembling, hands his wand to Voldemort, who snaps off its handle. Snape watches as Voldemort discards the handle and points the wand at a woman hanging in mid-air, who pleads with Snape. Voldemort flicks the wand, causing her to fall dead on the table, making Draco Malfoy wince and a tear fall from Charity's eye. Voldemort strokes the snake, which slithers towards the dead woman. Meanwhile, Albus Dumbledore falls gently from the astronomy tower."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Two eyes staring are followed by Rufus Scrimgeour, the Minister of Magic who had recently taken over from Cornelius Fudge after the latter's resignation under pressure, being photographed at a press conference. At home, Hermione reads the headlines in the Daily Prophet, the wizarding world's most popular newspaper known for its sometimes sensational reporting, while Harry Potter's uncle, Vernon, drags a suitcase to his car as Harry watches from his bedroom window. Outside the rebuilt Weasleys' home, which was lovingly restored after the Burrow was destroyed in a skirmish during the Second Wizarding War, Ron stands staring over the wreath beds toward the horizon as his mother and sister, Ginny, are busy in the kitchen preparing dinner. Ron glances briefly behind him before turning back to the wreath beds. Hermione's parents, who are unaware of the magical world their daughter belongs to, watch TV as she looks at them sadly and raises her wand, causing the tip to glow with a spell designed to protect them. The images of Hermione as a baby and a young child slowly fade from view in the photographs on the mantelpiece. Hermione's eyes fill with tears as she sees herself disappearing from every photograph in the home. Harry's Aunt Petunia sits in a car, staring blankly, while Uncle Vernon looks nervously at the sky, worried about a potential magical threat, and Dudley clambers into the backseat. Harry stands alone on the path watching them go. Standing outside her front door, Hermione looks back for a moment, then with her head lowered, walks down the path and strides along the street, her long wavy hair ruffled by a breeze as she carries a small beaded bag that is enchanted with an Undetectable Extension Charm to hold many more items than it appears. A Death Eater, a dark shadowy figure aligned with Voldemort's cause, zooms over the countryside towards a large manor house on a country estate, descending to the ground. The Death Eater walks towards the gates, waves his wand to make them evaporate, allowing him to step through, his face somber with dark, lank, shoulder-length hair, and the gates reappear behind him. Snape enters a bare storeroom and climbs a flight of stairs to where people are seated at a long table in front of a blazing fire, and at the end of the table, a woman hangs horizontally in mid-air, identified as Charity Burbage, a Hogwarts professor who taught Muggle Studies. Snape sits close to Voldemort as a huge snake, Nagini, who is one of Voldemort’s Horcruxes, glides on the floor beside Pius Thicknesse, the Imperiused Minister for Magic. Voldemort turns to Snape and she shrinks back. He passes behind the Malfoys, a family disgraced by their association with Voldemort, as Lucius Malfoy turns his face twitching as he reaches for his wand, his hand shaking as he holds it out to Voldemort, who runs his fingers over it, then snaps off its handle. Snape watches keenly as Voldemort discards the handle, and Lucius trembles while Voldemort points the wand at the floating woman, who pleads with Snape as he stares coldly. Voldemort flicks the wand and she falls dead on the table, causing Draco Malfoy, Lucius's son who secretly abhors the violence, to wince and a single tear to fall from Charity's eye. Voldemort strokes the snake, which glides onto the table and slithers towards the dead woman, its tongue flickering and mouth opening wide. Albus Dumbledore, once the revered headmaster of Hogwarts, falls from the astronomy tower, floating gently downwards, a haunting reminder of his tragic death orchestrated by Snape as part of their secret plan."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Two eyes staring are followed by Rufus Scrimgeour the Minister of Magic being photographed at a press conference. At home Hermione reads the headlines in the Daily Prophet while Harry Potter's uncle Vernon drags a suitcase to his car as Harry watches from his bedroom window. Outside the rebuilt Weasleys' home Ron stands staring over the wreath beds toward the horizon as his mother and sister Ginny are busy in the kitchen. Ron glances briefly behind him before turning back to the wreath beds. Hermione's parents watch TV as she looks at them sadly and raises her wand causing the tip to glow. The images of Hermione as a baby and a young child slowly fade from view in the photographs on the mantelpiece. Hermione's eyes fill with tears as she sees herself disappearing from every photograph in the home. Harry's Aunt Petunia sits in a car staring blankly while Uncle Vernon looks nervously at the sky and Dudley clambers into the backseat. Harry stands alone on the path watching them go. Standing outside her front door Hermione looks back for a moment then with her head lowered walks down the path and strides along the street her long wavy hair ruffled by a breeze as she carries a small beaded bag. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. A Death Eater a dark shadowy figure zooms over the countryside towards a large manor house on a country estate descending to the ground. The Death Eater walks towards the gates waves his wand to make them evaporate allowing him to step through his face somber with dark lank shoulderlength hair and the gates reappear behind him. Snape enters a bare storeroom and climbs a flight of stairs to where people are seated at a long table in front of a blazing fire and at the end of the table a woman hangs horizontally in midair. Snape sits close to Voldemort as a huge snake glides on the floor beside Pius Thicknesse. Voldemort turns to Snape and she shrinks back. He passes behind the Malfoys as Lucius Malfoy turns his face twitching as he reaches for his wand his hand shaking as he holds it out to Voldemort who runs his fingers over it then snaps off its handle. Snape watches keenly as Voldemort discards the handle and Lucius trembles while Voldemort points the wand at the floating woman who pleads with Snape as he stares coldly. Voldemort flicks the wand and she falls dead on the table causing Draco Malfoy to wince and a single tear to fall from Charity's eye. Voldemort strokes the snake which glides onto the table and slithers towards the dead woman its tongue flickering and mouth opening wide. Albus. Dumbledore falls from the astronomy tower floating gently downwards."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Two eyes staring are followed by Rufus Scrimgeour the Minister of Magic being photographed at a press conference. At home Hermione reads the headlines in the Daily Prophet while Harry Potter's uncle Vernon drags a suitcase to his car as Harry watches from his bedroom window. Outside the rebuilt Weasleys' home Ron stands staring over the wreath beds toward the horizon as his mother and sister Ginny are busy in the kitchen. Ron glances briefly behind him before turning back to the wreath beds. Hermione's parents watch TV as she looks at them sadly and raises her wand causing the tip to glow. The images of Hermione as a baby and a young child slowly fade from view in the photographs on the mantelpiece. Hermione's eyes fill with tears as she sees herself disappearing from every photograph in the home. Harry's Aunt Petunia sits in a car staring blankly while Uncle Vernon looks nervously at the sky and Dudley clambers into the backseat. Harry stands alone on the path watching them go. Standing outside her front door Hermione looks back for a moment then with her head lowered walks down the path and strides along the street her long wavy hair ruffled by a breeze as she carries a small beaded bag. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. A Death Eater a dark shadowy figure zooms over the countryside towards a large manor house on a country estate descending to the ground. The Death Eater walks towards the gates waves his wand to make them evaporate allowing him to step through his face somber with dark lank shoulderlength hair and the gates reappear behind him. Snape enters a bare storeroom and climbs a flight of stairs to where people are seated at a long table in front of a blazing fire and at the end of the table a woman hangs horizontally in midair. Snape sits close to Voldemort as a huge snake glides on the floor beside Pius Thicknesse. Voldemort turns to Snape and she shrinks back. He passes behind the Malfoys as Lucius Malfoy turns his face twitching as he reaches for his wand his hand shaking as he holds it out to Voldemort who runs his fingers over it then snaps off its handle. Snape watches keenly as Voldemort discards the handle and Lucius trembles while Voldemort points the wand at the floating woman who pleads with Snape as he stares coldly. Voldemort flicks the wand and she falls dead on the table causing Draco Malfoy to wince and a single tear to fall from Charity's eye. Voldemort strokes the snake which glides onto the table and slithers towards the dead woman its tongue flickering and mouth opening wide. Albus. Dumbledore falls from the astronomy tower floating gently downwards."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Two eyes staring are followed by Rufus Scrimgeour the Minister of Magic being photographed at a press conference. At home Hermione reads the headlines in the Daily Prophet while Harry Potter's uncle Vernon drags a suitcase to his car as Harry watches from his bedroom window. Outside the rebuilt Weasleys' home Ron stands staring over the wreath beds toward the horizon as his mother and sister Ginny are busy in the kitchen. Ron glances briefly behind him before turning back to the wreath beds. Hermione's parents watch TV as she looks at them sadly and raises her wand causing the tip to glow. He passes behind the Malfoys as Lucius Malfoy turns his face twitching as he reaches for his wand his hand shaking as he holds it out to Voldemort who runs his fingers over it then snaps off its handle. Snape watches keenly as Voldemort discards the handle and Lucius trembles while Voldemort points the wand at the floating woman who pleads with Snape as he stares coldly. Voldemort flicks the wand and she falls dead on the table causing Draco Malfoy to wince and a single tear to fall from Charity's eye. Voldemort strokes the snake which glides onto the table and slithers towards the dead woman its tongue flickering and mouth opening wide. Albus. Dumbledore falls from the astronomy tower floating gently downwards."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Two eyes staring are followed by Rufus Scrimgeour the Minister of Magic being photographed at a press conference. At home Hermione reads the headlines in the Daily Prophet while Harry Potter's uncle Vernon drags a suitcase to his car as Harry watches from his bedroom window. Voldemort strokes the snake which glides onto the table and slithers towards the dead woman its tongue flickering and mouth opening wide. Albus. Dumbledore falls from the astronomy tower floating gently downwards."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Two moons blinking are pursued by Cornelius Fudge, the King of Elves, being sketched at a tea party. At a cave, Luna sings the tabloids in the Quibbler while Frodo Baggins's cousin, Bilbo, pushes a cart to his wagon as Frodo waves from his attic window. Near the renovated Baggins' shack, Sam lounges staring across the flower beds toward the skyline as his aunt and cousin, Pippin, are lazy in the library. Sam peeks briefly above him before twisting back to the flower beds. Luna's siblings sing karaoke as she waves at them happily and lowers her guitar, causing the strings to sing. The sketches of Luna as a toddler and a teenage witch slowly brighten into focus in the portraits on the bookshelf. Luna's smile fills with joy as she sees herself emerging in every painting in the cave. Frodo's Aunt Rosie swings in a hammock, singing softly, while Cousin Bilbo hums gleefully at the stars and Merry jumps onto the roof. Frodo dances alone on the trail tapping his toes. Dancing outside her shed door, Luna waves her arm for a moment, then with her smile wide, skips down the trail and leaps along the alley, her short curly wig tousled by the gale as she juggles a large feathered hat. A Pixie, a bright glowing creature, whirls over the countryside towards a tiny cottage on a forest meadow, ascending to the tree. The Pixie spins towards the porch, taps his flute to make it shine, allowing him to leap over, his face gleeful with wild, curly, shoulder-length hair, and the porch reappears beneath him. Dobby arrives at a full ballroom and somersaults a set of escalators to where animals are sleeping on a wide mat beside a roaring campfire, and at the end of the mat, a cat naps vertically on the ceiling. Dobby snoozes far from Smaug as a tiny rabbit hops on the chair beside Roland Emmerich. Smaug turns to Dobby and it laughs loudly. He dances beside the Grinches as Ebenezer Scrooge bobs his head tapping as he reaches for his cane, his arm bouncing as he flips it towards Smaug, who taps his toes over it, then snaps off its button. Dobby naps peacefully as Smaug discards the button, and Ebenezer shivers while Smaug wiggles the cane at the sleeping cat, which giggles at Dobby as he laughs warmly. Smaug spins the cane and it climbs high up to the ceiling, causing Sirius Black to jump and a joyful tear to fall from Fawkes's feather. Smaug pats the rabbit, which hops onto the rug and waltzes towards the sleeping cat, its ears twitching and legs kicking high. Gandalf the Grey spins to the music, floating gently upwards."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Two eyes are followed by Rufus Scrimgeour, Minister of Magic, being photographed. Hermione reads the Daily Prophet as Harry's Uncle Vernon loads a suitcase into the car and Harry watches. At the Weasleys, Ron looks toward the horizon while his family is busy. Hermione’s parents watch TV as she erases herself from family photos, tears in her eyes. Harry observes his family leaving, and Hermione, with a beaded bag, walks away from her home. A Death Eater arrives at a manor, evaporates the gates, and enters with a somber look. Snape joins Voldemort at a table where a woman hangs in mid-air. Voldemort examines Lucius Malfoy's wand, snapping its handle. Snape remains cold as Voldemort kills the woman, causing Draco to flinch. The snake slithers toward her body. Dumbledore falls gently from the tower."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Dumbledore falls from the astronomy tower floating gently downwards Albus  Voldemort strokes the snake which glides onto the table and slithers towards the dead woman its tongue flickering and mouth opening wide  Voldemort flicks the wand and she falls dead on the table causing Draco Malfoy to wince and a single tear to fall from Charity's eye  Snape watches keenly as Voldemort discards the handle and Lucius trembles while Voldemort points the wand at the floating woman who pleads with Snape as he stares coldly  He passes behind the Malfoys as Lucius Malfoy turns his face twitching as he reaches for his wand his hand shaking as he holds it out to Voldemort who runs his fingers over it then snaps off its handle  Voldemort turns to Snape and she shrinks back  Snape sits close to Voldemort as a huge snake glides on the floor beside Pius Thicknesse  Snape enters a bare storeroom and climbs a flight of stairs to where people are seated at a long table in front of a blazing fire and at the end of the table a woman hangs horizontally in midair  The Death Eater walks towards the gates waves his wand to make them evaporate allowing him to step through his face somber with dark lank shoulderlength hair and the gates reappear behind him  A Death Eater a dark shadowy figure zooms over the countryside towards a large manor house on a country estate descending to the ground  Standing outside her front door Hermione looks back for a moment then with her head lowered walks down the path and strides along the street her long wavy hair ruffled by a breeze as she carries a small beaded bag  Harry stands alone on the path watching them go  Harry's Aunt Petunia sits in a car staring blankly while Uncle Vernon looks nervously at the sky and Dudley clambers into the backseat  Hermione's eyes fill with tears as she sees herself disappearing from every photograph in the home  The images of Hermione as a baby and a young child slowly fade from view in the photographs on the mantelpiece  Hermione's parents watch TV as she looks at them sadly and raises her wand causing the tip to glow  Ron glances briefly behind him before turning back to the wreath beds  Outside the rebuilt Weasleys' home Ron stands staring over the wreath beds toward the horizon as his mother and sister Ginny are busy in the kitchen  At home Hermione reads the headlines in the Daily Prophet while Harry Potter's uncle Vernon drags a suitcase to his car as Harry watches from his bedroom window  Two eyes staring are followed by Rufus Scrimgeour the Minister of Magic being photographed at a press conference "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "At home Hermione reads the headlines in the Daily Prophet while Harry Potter's uncle Vernon drags a suitcase to his car as Harry watches from his bedroom window Two eyes staring are followed by Rufus Scrimgeour the Minister of Magic being photographed at a press conference Ron glances briefly behind him before turning back to the wreath beds Outside the rebuilt Weasleys' home Ron stands staring over the wreath beds toward the horizon as his mother and sister Ginny are busy in the kitchen The images of Hermione as a baby and a young child slowly fade from view in the photographs on the mantelpiece Hermione's parents watch TV as she looks at them sadly and raises her wand causing the tip to glow Harry's Aunt Petunia sits in a car staring blankly while Uncle Vernon looks nervously at the sky and Dudley clambers into the backseat Hermione's eyes fill with tears as she sees herself disappearing from every photograph in the home Standing outside her front door Hermione looks back for a moment then with her head lowered walks down the path and strides along the street her long wavy hair ruffled by a breeze as she carries a small beaded bag Harry stands alone on the path watching them go The Death Eater walks towards the gates waves his wand to make them evaporate allowing him to step through his face somber with dark lank shoulderlength hair and the gates reappear behind him A Death Eater a dark shadowy figure zooms over the countryside towards a large manor house on a country estate descending to the ground Snape sits close to Voldemort as a huge snake glides on the floor beside Pius Thicknesse Snape enters a bare storeroom and climbs a flight of stairs to where people are seated at a long table in front of a blazing fire and at the end of the table a woman hangs horizontally in midair He passes behind the Malfoys as Lucius Malfoy turns his face twitching as he reaches for his wand his hand shaking as he holds it out to Voldemort who runs his fingers over it then snaps off its handle Voldemort turns to Snape and she shrinks back Voldemort flicks the wand and she falls dead on the table causing Draco Malfoy to wince and a single tear to fall from Charity's eye Snape watches keenly as Voldemort discards the handle and Lucius trembles while Voldemort points the wand at the floating woman who pleads with Snape as he stares coldly Albus Voldemort strokes the snake which glides onto the table and slithers towards the dead woman its tongue flickering and mouth opening wide Dumbledore falls from the astronomy tower floating gently downwards"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The Death Eater walks towards the gates waves his wand to make them evaporate allowing him to step through his face somber with dark lank shoulderlength hair and the gates reappear behind him  Snape enters a bare storeroom and climbs a flight of stairs to where people are seated at a long table in front of a blazing fire and at the end of the table a woman hangs horizontally in midair  Snape sits close to Voldemort as a huge snake glides on the floor beside Pius Thicknesse  Voldemort turns to Snape and she shrinks back  He passes behind the Malfoys as Lucius Malfoy turns his face twitching as he reaches for his wand his hand shaking as he holds it out to Voldemort who runs his fingers over it then snaps off its handle  Snape watches keenly as Voldemort discards the handle and Lucius trembles while Voldemort points the wand at the floating woman who pleads with Snape as he stares coldly  Voldemort flicks the wand and she falls dead on the table causing Draco Malfoy to wince and a single tear to fall from Charity's eye  Voldemort strokes the snake which glides onto the table and slithers towards the dead woman its tongue flickering and mouth opening wide  Albus  Dumbledore falls from the astronomy tower floating gently downwards Two eyes staring are followed by Rufus Scrimgeour the Minister of Magic being photographed at a press conference  At home Hermione reads the headlines in the Daily Prophet while Harry Potter's uncle Vernon drags a suitcase to his car as Harry watches from his bedroom window  Outside the rebuilt Weasleys' home Ron stands staring over the wreath beds toward the horizon as his mother and sister Ginny are busy in the kitchen  Ron glances briefly behind him before turning back to the wreath beds  Hermione's parents watch TV as she looks at them sadly and raises her wand causing the tip to glow  The images of Hermione as a baby and a young child slowly fade from view in the photographs on the mantelpiece  Hermione's eyes fill with tears as she sees herself disappearing from every photograph in the home  Harry's Aunt Petunia sits in a car staring blankly while Uncle Vernon looks nervously at the sky and Dudley clambers into the backseat  Harry stands alone on the path watching them go  Standing outside her front door Hermione looks back for a moment then with her head lowered walks down the path and strides along the street her long wavy hair ruffled by a breeze as she carries a small beaded bag  A Death Eater a dark shadowy figure zooms over the countryside towards a large manor house on a country estate descending to the ground "
        }
      ]
    }
  ]
}