{
  "ground_truth": "He picks up the radio. Outside of the clearing, Hermione tip-toes towards the invisible, protective shield. Her eyes peeled, she gazes into the gloom. Narrowing her eyes, she peers towards the dark shadows under the trees. In the tent, Harry studies the Marauder's Map. Snape's footprints appear near the headmaster's study. Hermione continues to prowl. She freezes as men approach, one carrying a woman. He passes by. A second man follows with someone slung over his shoulder. A third stops, just past Hermione. He retraces his steps, until he stands directly in front of her. She stands stock still. He can see no sign of her, the tent, or the campfire. The second man drops the body from his shoulder. The man does as he's told. The three of them walk away. Harry joins Hermione. Hermione looks in the direction the men went. Her face is solemn. They walk towards the tent. Ron steps out of the tent. He sees the two of them together. He looks pale and haggard. As they journey through fields and past devastated homes, Ron grows more drawn and suspicious. They're camped under a bridge. Harry stands alone a little distance from them. Ron stays glued to the radio. Now, they're camped on the shore of a lake. At night, Ron lies awake. In the tent, Hermione is cutting Harry's hair. She stops suddenly. She consults a book. The light whisks away from the lamps. Hollow-eyed, Ron appears holding the deluminator. He returns the light. Harry lunges at him. The two friends glare at each other. Ron tugs off the locket and throws it down. Ron picks up his bag and scowls at Hermione. She looks distraught. She glances round at Harry, then back to Ron. She hesitates. Ron glowers at Harry. His mouth curled in a snarl, Ron storms out. Hermione follows. Harry paces uneasily. His face troubled, Harry remains alone inside the tent. Next morning, Harry steps out of the tent and sees Hermione standing by the water's edge, her back to him. She gazes anxiously across the wintry landscape. Harry waits as Hermione ties her scarf round a slender tree trunk. The locket dangles from her hand. She walks through dead bracken and stands beside Harry. He takes her hand. They apparate on a stony clifftop. Hermione sadly wipes her eyes. Harry moves away discreetly as she turns to hide her tears. High on the limestone clifftop, he creates a protective shield. Hermione sits huddled on a flat-topped rock. Harry stands alone, looking towards the setting sun. A dim light glows inside the tent. The wind ruffles Harry's hair as he walks over the rocks. He turns, hearing the faint sound of the radio.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He selects up the radio. Outside of the clearing, Hermione tip-toes towards the invisible, protective barrier. Her eyes peeled, she stares into the darkness. Narrowing her eyes, she peers towards the dark shapes under the trees. In the tent, Harry scrutinizes the Marauder's Map. Snape's footprints emerge near the headmaster's office. Hermione continues to prowl. She halts as men approach, one bearing a woman. He proceeds by. A second man follows with someone slung over his shoulder. A third pauses, just beyond Hermione. He retraces his steps, until he stands directly in front of her. She stands motionless. He can see no sign of her, the tent, or the campfire. The second man releases the body from his shoulder. The man does as he's instructed. The three of them depart. Harry joins Hermione. Hermione looks in the direction the men went. Her face is solemn. They walk towards the tent. Ron steps out of the tent. He sees the two of them together. He looks pale and worn. As they journey through fields and past devastated houses, Ron grows more drawn and suspicious. They're camped under a bridge. Harry stands alone a little distance from them. Ron stays glued to the radio. Now, they're camped on the shore of a lake. At night, Ron lies awake. In the tent, Hermione is trimming Harry's hair. She stops abruptly. She consults a book. The light whisks away from the lamps. Hollow-eyed, Ron appears holding the deluminator. He restores the light. Harry lunges at him. The two companions glare at each other. Ron tugs off the locket and throws it down. Ron picks up his bag and scowls at Hermione. She looks distraught. She glances around at Harry, then back to Ron. She hesitates. Ron glowers at Harry. His mouth curled in a snarl, Ron storms out. Hermione follows. Harry paces uneasily. His face troubled, Harry remains alone inside the tent. Next morning, Harry steps out of the tent and sees Hermione standing by the water's edge, her back to him. She gazes anxiously across the wintry landscape. Harry waits as Hermione ties her scarf around a slender tree trunk. The locket dangles from her hand. She walks through dead bracken and stands beside Harry. He takes her hand. They apparate on a stony clifftop. Hermione sadly wipes her eyes. Harry moves away discreetly as she turns to hide her tears. High on the limestone clifftop, he creates a protective barrier. Hermione sits huddled on a flat-topped rock. Harry stands alone, looking towards the setting sun. A dim light glows inside the tent. The wind ruffles Harry's hair as he walks over the rocks. He turns, hearing the faint sound of the radio."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The radio is picked up by him. Outside of the clearing, the invisible, protective shield is approached by Hermione, who tiptoes cautiously. Her eyes peeled, the gloom is gazed into by her. Narrowing her eyes, the dark shadows under the trees are peered at by her. In the tent, the Marauder's Map is studied by Harry. Snape's footprints are seen appearing near the headmaster's study. Hermione continues her prowling. As men approach, including one who carries a woman, she freezes. The man is passed by. The second man, with someone slung over his shoulder, follows. Just past Hermione, a third man stops. He retraces his steps until he stands directly in front of her. She stands stock still. No sign of her, the tent, or the campfire can be seen by him. The body is dropped from the second man's shoulder. The man complies with what he is told. Away walk the three of them. Hermione is joined by Harry. In the direction the men went, Hermione looks. Her face is solemn. Towards the tent, they walk. Out of the tent steps Ron. The two of them together are seen by him. Pale and haggard is his appearance. As they journey through fields and past devastated homes, Ron grows more drawn and suspicious. Under a bridge, they are camped. Alone, a little distance from them, Harry stands. The radio is stayed glued to by Ron. Now, on the shore of a lake, they are camped. At night, awake lies Ron. In the tent, Harry's hair is being cut by Hermione. She suddenly stops. A book is consulted by her. The light is whisked away from the lamps. The deluminator is held by hollow-eyed Ron as he appears. The light is returned by him. At him lunges Harry. At each other, the two friends glare. Off comes the locket as Ron tugs it and throws it down. His bag is picked up by Ron, and Hermione is scowled at by him. She looks distraught. Harry is glanced at by her, and then Ron. She hesitates. At Harry, Ron glowers. With his mouth curled in a snarl, out storms Ron. Hermione follows. Uneasily, Harry paces. Alone, inside the tent remains a troubled-faced Harry. The next morning, out of the tent steps Harry and Hermione is seen standing by the water's edge, her back turned to him. She anxiously gazes across the wintry landscape. As Hermione ties her scarf round a slender tree trunk, Harry waits. From her hand, the locket dangles. Through dead bracken, she walks and stands beside Harry. Her hand is taken by him. They apparate on a stony clifftop. Her eyes are sadly wiped by Hermione. Discreetly, Harry moves away as her tears are turned away to be hidden. High on the limestone clifftop, a protective shield is created by him. On a flat-topped rock, huddled sits Hermione. Alone, Harry stands, looking towards the setting sun. Inside the tent, a dim light glows. As he walks over the rocks, Harry's hair is ruffled by the wind. The faint sound of the radio is heard by him as he turns."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He picks up the radio. Outside the clearing, Hermione tiptoes to the invisible shield, eyes peeled into the gloom. Narrowing her gaze, she peers at dark shadows under the trees. In the tent, Harry studies the Marauder's Map. Snape's footprints appear near the headmaster's study. Hermione freezes as men approach, one carrying a woman, another with someone over his shoulder. A third pauses near Hermione, but sees nothing. The second man drops the body. They leave. Harry joins Hermione, who solemnly watches the men depart. Ron exits the tent, pale and haggard. As they travel through fields and devastated homes, Ron becomes suspicious. They're camped under a bridge. Harry stands alone nearby. Ron stays glued to the radio. At the lakeshore camp, Ron lies awake. In the tent, Hermione cuts Harry's hair, consulting a book. The light fades, and hollow-eyed Ron returns it with the deluminator. Harry lunges at him, and they glare at each other. Ron throws down the locket, picks up his bag, and scowls at Hermione. Distraught, she hesitates, then follows as Ron storms out. Harry paces uneasily, troubled and alone in the tent. The next morning, Harry sees Hermione by the water, gazing over the wintry landscape. He waits as she ties her scarf to a slender tree, locket in hand. She stands with Harry, and they apparate to a stony clifftop. Hermione wipes her eyes as Harry creates a protective shield. She sits on a rock, Harry alone, looking toward the setting sun. A dim light glows inside the tent, and the wind ruffles Harry's hair as he hears the faint radio sounds."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He picks up the radio. Outside, Hermione tiptoes toward the invisible shield, gazing into the gloom. In the tent, Harry studies the Marauder's Map; Snape's footprints appear near the headmaster's study. Hermione freezes as men approach, one carrying a woman. A second man follows, a third stops, but sees no sign of her or the camp. They leave. Harry joins Hermione, looking solemn in their direction. Ron exits the tent, pale and haggard. As they journey past devastated homes, Ron becomes more suspicious. Camped by a lake, Hermione cuts Harry's hair. Ron appears hollow-eyed with the deluminator, returning the light. Harry lunges at Ron, who angrily removes the locket and leaves. Distraught, Hermione follows. Harry remains troubled and alone inside the tent. The next morning, Harry sees Hermione by the water, tying her scarf around a tree. The locket dangles from her hand as they apparate to a clifftop. Hermione wipes her eyes, and Harry gives her space. He creates a shield while she sits on a rock. As the sun sets, he hears the faint sound of the radio."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He reaches out and picks up the radio with a firm grip. Meanwhile, just outside the boundary of the small clearing, Hermione carefully and quietly tip-toes her way toward the unseen, protective shield that envelops their camp. Her eyes are wide open and vigilant as she gazes intently into the enveloping gloom that surrounds her. She narrows her eyes suspiciously, peering towards the dark and ominous shadows that linger beneath the dense canopy of trees. Inside the tent, Harry is deeply engrossed in studying the Marauder's Map. To his surprise, the distinct footprints of Snape appear ominously close to the headmaster's study. Outside, Hermione continues to prowl around cautiously. She suddenly freezes in her tracks as she sees men approaching, with one of them carrying a woman. The man walks right past her without noticing. A second man follows closely, hefting another person over his shoulder. A third man halts abruptly just past where Hermione is standing hidden. He retraces his steps until he stands positioned directly in front of her. Hermione remains completely still, hardly daring to breathe. The man, oblivious to her, sees no indication of her presence, nor any signs of the tent or the campfire. Following orders, the second man drops the body from his shoulder onto the ground. The three men then walk away without looking back. Harry joins Hermione, and she turns her gaze in the direction where the men disappeared, her face solemn and filled with concern. Together, they walk back towards the tent. Ron steps out to meet them, appearing visibly pale and haggard, a shadow of his former self. As they journey together through fields and past homes that have been devastated, Ron becomes increasingly withdrawn and suspicious. They find themselves camped under a bridge for a while. Harry stands at a little distance, alone in thought. Ron remains glued to the radio, listening intently. Later, they set up camp on the shore of a serene lake. At night, Ron is unable to sleep, lying awake with troubled thoughts. In the tent, Hermione busies herself cutting Harry's hair but abruptly stops. She consults a book, searching for something. Suddenly, the light is whisked away from the lamps. Ron appears, his eyes hollow, holding the deluminator, and he restores the light. Tensions rise as Harry lunges at Ron, and the two friends glare fiercely at each other. Angrily, Ron rips the locket from his neck and throws it to the ground. He then picks up his bag, scowling at Hermione who looks utterly distraught. She glances round at Harry, then back to Ron, hesitating in indecision. Ron, with a fierce glower directed at Harry, his lips curling into a snarl, storms out of the tent. Hermione follows after him, leaving Harry to pace uneasily, his face deeply troubled, alone inside the tent. The following morning, Harry steps out of the tent to find Hermione standing by the water's edge, her back turned to him. She gazes anxiously across the stark, wintry landscape. Harry waits silently as Hermione ties her scarf carefully around a slender tree trunk. The locket dangles from her hand, swinging gently. She walks through the dead bracken to stand beside Harry. He reaches out and takes her hand compassionately, and together they apparate to a stony clifftop. On the cliff, Hermione wipes her eyes with a look of sadness. Respectfully, Harry moves away discreetly as she turns to hide her tears. High on the limestone clifftop, he creates a strong and protective shield around them. Hermione sits huddled on a flat-topped rock, lost in her thoughts. Harry, standing alone, gazes towards the setting sun contemplatively. A dim light glows softly inside the tent as the wind gently ruffles Harry's hair. He walks over the rocks, pausing as he turns to hear the faint sound of the radio in the distance."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a firm and decisive grip, he reaches out and carefully picks up the radio. Meanwhile, just beyond the boundary of the small clearing, Hermione moves with deliberate caution, gently tip-toeing her way toward the unseen, protective shield that envelops their hidden camp. Her eyes are wide open, filled with vigilance and unwavering focus as she gazes intently into the dense and mysterious gloom that envelops her from all sides. She narrows her eyes with suspicion, peering cautiously toward the dark and ominous shadows that linger beneath the densely packed canopy of tall trees. Inside the tent, Harry is completely engrossed in studying the intricate details of the Marauder's Map. To his utter surprise, the distinct footprints of Snape appear alarmingly close to the headmaster's study, stirring a sense of unease. Outside, Hermione continues to prowl around ever so cautiously. She suddenly stops dead in her tracks, freezing with tension, as she sees men approaching, with one carrying a woman over his shoulder. The man walks right past her, utterly oblivious to her presence. A second man follows closely behind, hefting yet another person over his shoulder. A third man suddenly halts just past where Hermione stands hidden. He retraces his steps until he stands positioned directly in front of her concealed spot. Hermione remains completely still, hardly daring to breathe, her heart pounding in her chest. The man, unaware of her existence, sees no indication of her presence, nor does he notice any signs of the tent or the campfire. Following orders, the second man drops the body from his shoulder unceremoniously onto the ground. The three men then walk away without so much as glancing back. Harry emerges from the tent to join Hermione, and she turns her solemn gaze in the direction where the men disappeared, her face filled with deep concern. Together, they return to the tent. Ron steps out to meet them, appearing visibly pale and haggard, almost a shadow of his former self. As they move together through fields and past homes laid waste, Ron becomes increasingly withdrawn and suspicious. They find themselves camped under a bridge for a while. Harry stands a little distance away, alone with his thoughts. Meanwhile, Ron remains absorbed, glued to the radio, listening with intense focus. Later, they set up camp along the tranquil shore of a serene lake. At night, Ron is unable to find solace in sleep, lying awake, burdened with troubled thoughts. Inside the tent, Hermione busies herself with the task of cutting Harry's hair but abruptly halts. She consults a book, searching urgently for something of significance. Suddenly, the light from the lamps is whisked away. Ron appears, his eyes hollow and distant, holding the deluminator as he restores the light. Tensions rise dramatically as Harry lunges toward Ron, and the two friends glare fiercely at each other, caught in a heated confrontation. Angrily, Ron rips the locket from around his neck and throws it angrily to the ground. He then picks up his bag, scowling angrily at Hermione, who looks utterly distraught and torn. She glances helplessly at Harry, then back to Ron, hesitating in indecision. Ron, with a fierce glower directed at Harry, his lips curling into a snarl, storms out of the tent in a fit of anger. Hermione follows after him, leaving Harry to pace uneasily, his face deeply troubled, alone inside the confines of the tent. The following morning, Harry steps out of the tent to find Hermione standing by the water's edge, her back turned to him. She gazes anxiously across the stark, wintry landscape, filled with worry. Harry waits silently, respecting her space, as Hermione ties her scarf carefully around the slender trunk of a nearby tree. The locket dangles from her hand, swinging gently. She walks through the dead bracken to stand beside Harry. He reaches out compassionately, taking her hand, and together they apparate to a stony clifftop. On the cliff, Hermione wipes her eyes with a look of sadness and melancholy. Respectfully, Harry moves away discreetly as she turns to hide her tears. High on the limestone clifftop, he creates a strong and protective shield around them both. Hermione sits huddled on a flat-topped rock, lost in deep and introspective thoughts. Harry, standing alone, gazes toward the setting sun with a contemplative expression. A dim light glows softly inside the tent as the wind gently ruffles Harry's hair. He walks over the rocks, pausing thoughtfully as he turns to hear the faint and distant sound of the radio."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He carefully reaches down, wraps his fingers around the radio, and picks it up with a determined grip. Hermione, moving cautiously outside the clearing, places each foot gently on the ground, making sure not to disturb any leaves or twigs as she tip-toes towards the protective shield that remains invisible to the eye. With her eyes wide open and alert, she gazes intently into the gloom ahead, sharply narrowing them to better focus on the dark, shifting shadows under the trees. Inside the tent, Harry hunches over the Marauder's Map, studying it with keen concentration, and notices the tiny, moving footprints of Snape appearing near the headmaster's study. Meanwhile, Hermione continues her slow, deliberate prowl, her ears pricked up in anticipation. Suddenly, she halts mid-step, freezing in place as she detects the presence of approaching men. One man strides forward, carrying a woman over his shoulder. He passes by without noticing Hermione. A second man follows closely behind, also shouldering a load that resembles a slumped figure. Just past Hermione, a third man halts, looks around suspiciously, and then retraces his steps until he stands directly in front of Hermione. She remains completely still, holding her breath to avoid detection. The man scans the area but fails to notice any sign of her, the tent, or the faint glow of the campfire. The second man obediently drops the body he carries from his shoulder, following the instruction given to him. After a brief exchange, the three men turn and walk away into the shadows. After they have disappeared, Harry emerges from the tent to join Hermione, who is standing with her eyes fixed solemnly in the direction the men had gone. Together, they begin walking back towards the tent. As they approach, Ron steps out, his face pale and shadowed with exhaustion. As they tread through fields and navigate past devastated homes, Ron's appearance grows progressively more fraught and suspicious, his eyes darting around with unease. Under the shelter of a bridge, they set up camp once more. Harry distances himself from the group, standing alone with his thoughts, while Ron stays closely tuned to the radio, his focus unyielding. Later, their camp moves to the shore of a tranquil lake. Night falls, and Ron lies in the tent, unable to sleep, while Hermione carefully scissors through Harry's hair. She suddenly halts her task and consults a nearby book for guidance. In the dimming tent, the lamps' light mysteriously vanishes, whisked away, and Ron appears, his eyes hollow, holding the deluminator. He flicks it, and the light returns with a soft glow. Unexpectedly, Harry lunges forward, fueled by anger, and the two friends lock eyes with intense glares. Fueled by frustration, Ron yanks the locket off his neck and hurls it to the ground in defiance. With a bitter scowl directed at Hermione, he hoists his bag over his shoulder. Hermione, her face crumpling with emotion, casts a pained glance between Harry and Ron, hesitating as confusion and hurt wash over her. Ron, with his mouth twisted into a snarl, spins on his heel and storms out of the tent. Hermione, torn and desperate, follows after him. Left alone, Harry paces the confines of the tent, his mind troubled and heart heavy. As morning dawns, he steps out to find Hermione standing silently at the water's edge, her back turned towards him, her gaze lost in the expanse of the frosty landscape. He waits patiently as she secures her scarf around a slender tree trunk, the locket clutched tightly in her hand. Together, they walk through the withered bracken until she stands beside him. He gently takes her hand in his, and they apparate to a wind-swept, stony clifftop. There, Hermione blinks back tears, discreetly wiping her eyes as Harry respectfully steps away, allowing her a moment of privacy. High above on the limestone clifftop, he constructs a protective shield, its magic forming an unseen barrier against the world. Hermione sits huddled on a flat-topped rock, seeking solace in her solitude, while Harry stands alone, his gaze stretching out towards the setting sun. A dim light flickers to life inside the tent, its glow a beacon in the growing darkness. As the wind stirs, ruffling his hair, Harry walks across the uneven rocks, pausing as his ear catches the faint, distant sound of the radio."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He picks up the radio while outside, Hermione approaches the invisible, protective shield with caution, scanning the surroundings intently. Inside the tent, Harry studies the Marauder's Map, noticing Snape's footprints near the headmaster's study. Nearby, Hermione halts as men carrying bodies pass by, one stopping briefly but seeing nothing before they depart. Harry joins Hermione as she solemnly watches the men leave, then they walk back to the tent where Ron emerges, looking pale and haggard. As they travel through fields and ruined homes, Ron becomes increasingly suspicious and drawn, eventually staying glued to the radio at a campsite under a bridge.\n\nLater, camped by a lake, Ron lies awake while Hermione cuts Harry's hair in the tent. She stops to consult a book as Ron, appearing hollow-eyed with the deluminator, extinguishes and then returns the light. This leads to a confrontation where Ron angrily removes the locket, throws it, and storms out, leaving Hermione distraught. Harry paces, troubled, remaining alone in the tent. The next morning, he finds Hermione by the water's edge, anxiously surveying the landscape. After tying her scarf to a tree, she joins Harry, and they apparate to a clifftop. There, Hermione wipes away her tears while Harry discreetly steps away to create a protective shield. Hermione sits huddled on a rock as Harry stands alone, gazing at the sunset and listening to the faint radio sounds against the wind."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He picks up the radio, an old-fashioned model tuned to broadcast news and emergency updates to those hiding from danger. Outside of the clearing, Hermione, known for her cleverness and quick reflexes, tip-toes towards the invisible, protective shield that safeguards them from intruders. Her eyes peeled, she gazes into the gloom, the dark forest resonating with the cries of distant creatures. Narrowing her eyes, she peers towards the dark shadows under the trees, known to conceal threats. In the tent, Harry studies the Marauder's Map, a magical document revealing the real-time locations of everyone within Hogwarts, the school they once called home. Snape's footprints appear near the headmaster's study, indicating his troubling presence. Hermione continues to prowl, reminiscent of a lioness on the hunt. She freezes as men approach, one carrying a woman who appears unconscious. He passes by, unaware of Hermione's vigilant eyes. A second man follows with someone slung over his shoulder, suggesting they are likely prisoners. A third stops, just past Hermione, as though sensing something. He retraces his steps, until he stands directly in front of her, but the magic holds. She stands stock still, her heart pounding in her chest. He can see no sign of her, the tent, or the campfire, thanks to the protective enchantments. The second man drops the body from his shoulder with a thud. The man does as he's told, their mission perhaps completed. The three of them walk away, shadows among shadows. Harry joins Hermione, quietly reassuring her. Hermione looks in the direction the men went, her face solemn as she ponders their intentions. They walk towards the tent, their sanctuary in this wild land. Ron steps out of the tent, his face reflecting the toll of endless nights of worry. He sees the two of them together, bonded by shared hardship. He looks pale and haggard, like someone who has seen too much. As they journey through fields and past devastated homes, the scars of wizarding battles, Ron grows more drawn and suspicious, his paranoia spurred by exhaustion. They're camped under a bridge, a temporary haven. Harry stands alone a little distance from them, grappling with thoughts of impending doom. Ron stays glued to the radio, hoping for news of their friends. Now, they're camped on the shore of a lake, serene yet isolated. At night, Ron lies awake, burdened by restless thoughts. In the tent, Hermione is cutting Harry's hair, a mundane task to instill some normalcy. She stops suddenly, sensing something amiss. She consults a book, perhaps a tome of spells. The light whisks away from the lamps, an abrupt assault on their senses. Hollow-eyed, Ron appears holding the Deluminator, a device left to him by Dumbledore that captures and releases light. He returns the light, restoring calm. Harry lunges at him, tensions finally boiling over. The two friends glare at each other, their friendship tested by the strain of their quest. Ron tugs off the locket, a Horcrux filled with dark magic, and throws it down, disgust radiating from him. Ron picks up his bag and scowls at Hermione, frustration in every movement. She looks distraught, torn between her friends. She glances round at Harry, then back to Ron, indecision flickering in her eyes. She hesitates, the weight of choice heavy. Ron glowers at Harry, his mouth curled in a snarl, before he storms out, leaving their camp in disarray. Hermione follows, her loyalty split. Harry paces uneasily, the silence after Ron's departure pressing in. His face troubled, Harry remains alone inside the tent, contemplating their fractured group. Next morning, Harry steps out of the tent and sees Hermione standing by the water's edge, her back to him, lost in thought. She gazes anxiously across the wintry landscape, her breath visible in the cold air. Harry waits as Hermione ties her scarf round a slender tree trunk, marking their passage. The locket dangles from her hand, a reminder of their burden. She walks through dead bracken and stands beside Harry, their unity reaffirmed. He takes her hand, and they apparate on a stony clifftop, moving with the grace of a practiced team. Hermione sadly wipes her eyes, the weight of their mission clear in her demeanor. Harry moves away discreetly as she turns to hide her tears, offering her a moment of privacy. High on the limestone clifftop, he creates a protective shield, their new fortress against the world. Hermione sits huddled on a flat-topped rock, her mind racing with plans and uncertainties. Harry stands alone, looking towards the setting sun, a flare of hopeful color in the encroaching darkness. A dim light glows inside the tent, their only home now. The wind ruffles Harry's hair as he walks over the rocks, resolute in their shared purpose. He turns, hearing the faint sound of the radio, a tether to the world from which they are isolated."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He picks up the radio. Outside of the clearing. Hermione tiptoes towards the invisible protective shield. Her eyes peeled she gazes into the gloom. Narrowing her eyes she peers towards the dark shadows under the trees. In the tent Harry studies the Marauder's Map. Snape's footprints appear near the headmaster's study. Hermione continues to prowl. She freezes as men approach one carrying a woman. He passes by. A second man follows with someone slung over his shoulder. A third stops just past Hermione. He retraces his steps until he stands directly in front of her. She stands stock still. He can see no sign of her. the tent or the campfire. The second man drops the body from his shoulder. The man does as he is told. The three of them walk away. Harry joins Hermione. Hermione looks in the direction the men went. Her face is solemn. They walk towards the tent. Ron steps out of the tent. He sees the two of them together. He looks pale and haggard. As they journey through fields and past devastated homes Ron grows more drawn and suspicious. They are camped under a bridge. Harry stands alone a little distance from them. Ron stays glued to the radio. Now they are camped on the shore of a lake. At night Ron lies awake In the tent. Hermione is cutting Harry's hair. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. She stops suddenly. She consults a book. The light whisks away from the lamps. Holloweyed Ron appears holding the deluminator. He returns the light. Harry lunges at him. The two friends glare at each other. Ron tugs off the locket and throws it down. Ron picks up his bag and scowls at Hermione. She looks distraught. She glances round at Harry then back to Ron. She hesitates. Ron glowers at Harry. His mouth curled in a snarl. Ron storms out. Hermione follows. Harry paces uneasily His face troubled. Harry remains alone inside the tent. Next morning Harry steps out of the tent and sees Hermione standing by the water's edge her back to him. She gazes anxiously across the wintry landscape. Harry waits as Hermione ties her scarf round a slender tree trunk. The locket dangles from her hand. She walks through dead bracken and stands beside Harry. He takes her hand. They apparate on a stony clifftop. Hermione sadly wipes her eyes. Harry moves away discreetly as she turns to hide her tears. High on the limestone clifftop he creates a protective shield. Hermione sits huddled on a flattopped rock. Harry stands alone looking towards the setting sun. A dim light glows inside the tent. The wind ruffles Harry's hair as he walks over the rocks. He turns hearing the faint sound of the radio."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He picks up the radio. Outside of the clearing. Hermione tiptoes towards the invisible protective shield. Her eyes peeled she gazes into the gloom. Narrowing her eyes she peers towards the dark shadows under the trees. In the tent Harry studies the Marauder's Map. Snape's footprints appear near the headmaster's study. Hermione continues to prowl. She freezes as men approach one carrying a woman. He passes by. A second man follows with someone slung over his shoulder. A third stops just past Hermione. He retraces his steps until he stands directly in front of her. She stands stock still. He can see no sign of her. the tent or the campfire. The second man drops the body from his shoulder. The man does as he is told. The three of them walk away. Harry joins Hermione. Hermione looks in the direction the men went. Her face is solemn. They walk towards the tent. Ron steps out of the tent. He sees the two of them together. He looks pale and haggard. As they journey through fields and past devastated homes Ron grows more drawn and suspicious. They are camped under a bridge. Harry stands alone a little distance from them. Ron stays glued to the radio. Now they are camped on the shore of a lake. At night Ron lies awake In the tent. Hermione is cutting Harry's hair. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. She stops suddenly. She consults a book. The light whisks away from the lamps. Holloweyed Ron appears holding the deluminator. He returns the light. Harry lunges at him. The two friends glare at each other. Ron tugs off the locket and throws it down. Ron picks up his bag and scowls at Hermione. She looks distraught. She glances round at Harry then back to Ron. She hesitates. Ron glowers at Harry. His mouth curled in a snarl. Ron storms out. Hermione follows. Harry paces uneasily His face troubled. Harry remains alone inside the tent. Next morning Harry steps out of the tent and sees Hermione standing by the water's edge her back to him. She gazes anxiously across the wintry landscape. Harry waits as Hermione ties her scarf round a slender tree trunk. The locket dangles from her hand. She walks through dead bracken and stands beside Harry. He takes her hand. They apparate on a stony clifftop. Hermione sadly wipes her eyes. Harry moves away discreetly as she turns to hide her tears. High on the limestone clifftop he creates a protective shield. Hermione sits huddled on a flattopped rock. Harry stands alone looking towards the setting sun. A dim light glows inside the tent. The wind ruffles Harry's hair as he walks over the rocks. He turns hearing the faint sound of the radio."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He picks up the radio. Outside of the clearing. Hermione tiptoes towards the invisible protective shield. Her eyes peeled she gazes into the gloom. Narrowing her eyes she peers towards the dark shadows under the trees. In the tent Harry studies the Marauder's Map. Snape's footprints appear near the headmaster's study. Hermione continues to prowl. She freezes as men approach one carrying a woman. He passes by. A second man follows with someone slung over his shoulder. A third stops just past Hermione. He retraces his steps until he stands directly in front of her. She stands stock still. He can see no sign of her. the tent or the campfire. The second man drops the body from his shoulder. Harry remains alone inside the tent. Next morning Harry steps out of the tent and sees Hermione standing by the water's edge her back to him. She gazes anxiously across the wintry landscape. Harry waits as Hermione ties her scarf round a slender tree trunk. The locket dangles from her hand. She walks through dead bracken and stands beside Harry. He takes her hand. They apparate on a stony clifftop. Hermione sadly wipes her eyes. Harry moves away discreetly as she turns to hide her tears. High on the limestone clifftop he creates a protective shield. Hermione sits huddled on a flattopped rock. Harry stands alone looking towards the setting sun. A dim light glows inside the tent. The wind ruffles Harry's hair as he walks over the rocks. He turns hearing the faint sound of the radio."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He picks up the radio. Outside of the clearing. Hermione tiptoes towards the invisible protective shield. Her eyes peeled she gazes into the gloom. Narrowing her eyes she peers towards the dark shadows under the trees. In the tent Harry studies the Marauder's Map. Snape's footprints appear near the headmaster's study. Harry moves away discreetly as she turns to hide her tears. High on the limestone clifftop he creates a protective shield. Hermione sits huddled on a flattopped rock. Harry stands alone looking towards the setting sun. A dim light glows inside the tent. The wind ruffles Harry's hair as he walks over the rocks. He turns hearing the faint sound of the radio."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "She lifts up the notebook. Beyond the orchard, Jessica prances towards the visible, defensive barrier. Her ears tuned, she stares into the mist. Squinting her ears, she glances towards the bright lights beneath the bushes. Inside the cabin, David inspects the Pirate's Journal. Mrs. Green's handprints appear near the principal's office. Jessica continues to leap. She pauses as women arrive, one dragging a child. She strides past. A third woman follows with something draped over her elbow. A fourth pauses, just beyond Jessica. She repeats her path, until she stands squarely next to her. She stands motionless. She can detect no trace of him, the cabin, or the furnace. The third woman drops the object from her elbow. The woman complies as instructed. The four of them stride away. David accompanies Jessica. Jessica glances in the direction the women departed. Her expression is joyful. They skip towards the cabin. Sam emerges from the cabin. She notices the pair of them together. She appears rosy and energetic. As they stroll through groves and past rebuilt barns, Sam becomes more cheerful and trusting. They're nestled under a trellis. David rests alone a short distance from them. Sam remains attached to the notebook. Now, they're nestled on the bank of a pond. At dawn, Sam dozes peacefully. Inside the cabin, Jessica is braiding David's hair. She halts suddenly. She references a scroll. The glow flutters away from the candles. Bright-eyed, Sam emerges holding the candle snuffer. She restores the glow. David dives towards her. The two companions smile at one another. Sam yanks off the bracelet and places it down. Sam grabs her satchel and grins at Jessica. She appears joyful. She peers round at David, then back to Sam. She lingers. Sam smiles at David. Her mouth wide in a grin, Sam skips away. Jessica trails. David pauses thoughtfully. His expression serene, David remains alone inside the cabin. By sunset, David exits the cabin and spots Jessica standing by the pond's edge, her face to him. She stares curiously across the sunny panorama. David pauses as Jessica wraps her shawl round a sturdy tree trunk. The bracelet swings from her fingers. She dances through blooming orchids and stands beside David. He clasps her arm. They teleport on a grassy plateau. Jessica cheerfully pats her cheeks. David steps away quietly as she turns to hide her laughter. High on the granite plateau, he establishes a defensive barrier. Jessica sits sprawled on a rounded boulder. David rests alone, gazing towards the rising moon. A bright light twinkles within the cabin. The breeze tousles David's jacket as he strolls over the boulders. He stops, catching the distant notes of the notebook."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In the clearing, Hermione cautiously approaches the protective shield, observing the shadows. Inside the tent, Harry notices Snape's footprints on the Marauder's Map. Nearby, Hermione freezes as men carrying bodies pass, but they can't see her or the camp. Later, Harry joins Hermione, who looks grave. They return to the tent, where Ron appears pale and suspicious. The trio camps by a lake, with Ron fixated on the radio. One night, as Hermione cuts Harry's hair, Ron uses the deluminator, leading to a tense confrontation. Ron removes his locket, storms out, and Hermione hesitantly follows. Alone, Harry paces uneasily. The next morning, Hermione ties her scarf to a tree, holding the locket, and stands with Harry. They apparate to a clifftop, where Hermione wipes her tears. Harry discreetly creates a protective shield and then stands alone, watching the sunset. A faint radio sound follows him as he walks over the rocks."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He turns hearing the faint sound of the radio The wind ruffles Harry's hair as he walks over the rocks A dim light glows inside the tent Harry stands alone looking towards the setting sun Hermione sits huddled on a flattopped rock High on the limestone clifftop he creates a protective shield Harry moves away discreetly as she turns to hide her tears Hermione sadly wipes her eyes They apparate on a stony clifftop He takes her hand She walks through dead bracken and stands beside Harry The locket dangles from her hand Harry waits as Hermione ties her scarf round a slender tree trunk She gazes anxiously across the wintry landscape Next morning Harry steps out of the tent and sees Hermione standing by the water's edge her back to him Harry remains alone inside the tent Harry paces uneasily His face troubled Hermione follows Ron storms out His mouth curled in a snarl Ron glowers at Harry She hesitates She glances round at Harry then back to Ron She looks distraught Ron picks up his bag and scowls at Hermione Ron tugs off the locket and throws it down The two friends glare at each other Harry lunges at him He returns the light Holloweyed Ron appears holding the deluminator The light whisks away from the lamps She consults a book She stops suddenly Hermione is cutting Harry's hair At night Ron lies awake In the tent Now they are camped on the shore of a lake Ron stays glued to the radio Harry stands alone a little distance from them They are camped under a bridge As they journey through fields and past devastated homes Ron grows more drawn and suspicious He looks pale and haggard He sees the two of them together Ron steps out of the tent They walk towards the tent Her face is solemn Hermione looks in the direction the men went Harry joins Hermione The three of them walk away The man does as he is told The second man drops the body from his shoulder the tent or the campfire He can see no sign of her She stands stock still He retraces his steps until he stands directly in front of her A third stops just past Hermione A second man follows with someone slung over his shoulder He passes by She freezes as men approach one carrying a woman Hermione continues to prowl Snape's footprints appear near the headmaster's study In the tent Harry studies the Marauder's Map Narrowing her eyes she peers towards the dark shadows under the trees Her eyes peeled she gazes into the gloom Hermione tiptoes towards the invisible protective shield Outside of the clearing He picks up the radio"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Outside of the clearing He picks up the radio Her eyes peeled she gazes into the gloom Hermione tiptoes towards the invisible protective shield In the tent Harry studies the Marauder's Map Narrowing her eyes she peers towards the dark shadows under the trees Hermione continues to prowl Snape's footprints appear near the headmaster's study He passes by She freezes as men approach one carrying a woman A third stops just past Hermione A second man follows with someone slung over his shoulder She stands stock still He retraces his steps until he stands directly in front of her the tent or the campfire He can see no sign of her The man does as he is told The second man drops the body from his shoulder Harry joins Hermione The three of them walk away Her face is solemn Hermione looks in the direction the men went Ron steps out of the tent They walk towards the tent He looks pale and haggard He sees the two of them together They are camped under a bridge As they journey through fields and past devastated homes Ron grows more drawn and suspicious Ron stays glued to the radio Harry stands alone a little distance from them At night Ron lies awake In the tent Now they are camped on the shore of a lake She stops suddenly Hermione is cutting Harry's hair The light whisks away from the lamps She consults a book He returns the light Holloweyed Ron appears holding the deluminator The two friends glare at each other Harry lunges at him Ron picks up his bag and scowls at Hermione Ron tugs off the locket and throws it down She glances round at Harry then back to Ron She looks distraught Ron glowers at Harry She hesitates Ron storms out His mouth curled in a snarl Harry paces uneasily His face troubled Hermione follows Next morning Harry steps out of the tent and sees Hermione standing by the water's edge her back to him Harry remains alone inside the tent Harry waits as Hermione ties her scarf round a slender tree trunk She gazes anxiously across the wintry landscape She walks through dead bracken and stands beside Harry The locket dangles from her hand They apparate on a stony clifftop He takes her hand Harry moves away discreetly as she turns to hide her tears Hermione sadly wipes her eyes Hermione sits huddled on a flattopped rock High on the limestone clifftop he creates a protective shield A dim light glows inside the tent Harry stands alone looking towards the setting sun He turns hearing the faint sound of the radio The wind ruffles Harry's hair as he walks over the rocks"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She stops suddenly She consults a book The light whisks away from the lamps Holloweyed Ron appears holding the deluminator He returns the light Harry lunges at him The two friends glare at each other Ron tugs off the locket and throws it down Ron picks up his bag and scowls at Hermione She looks distraught She glances round at Harry then back to Ron She hesitates Ron glowers at Harry His mouth curled in a snarl Ron storms out Hermione follows Harry paces uneasily His face troubled Harry remains alone inside the tent Next morning Harry steps out of the tent and sees Hermione standing by the water's edge her back to him She gazes anxiously across the wintry landscape Harry waits as Hermione ties her scarf round a slender tree trunk The locket dangles from her hand She walks through dead bracken and stands beside Harry He takes her hand They apparate on a stony clifftop Hermione sadly wipes her eyes Harry moves away discreetly as she turns to hide her tears High on the limestone clifftop he creates a protective shield Hermione sits huddled on a flattopped rock Harry stands alone looking towards the setting sun A dim light glows inside the tent The wind ruffles Harry's hair as he walks over the rocks He turns hearing the faint sound of the radio He picks up the radio Outside of the clearing Hermione tiptoes towards the invisible protective shield Her eyes peeled she gazes into the gloom Narrowing her eyes she peers towards the dark shadows under the trees In the tent Harry studies the Marauder's Map Snape's footprints appear near the headmaster's study Hermione continues to prowl She freezes as men approach one carrying a woman He passes by A second man follows with someone slung over his shoulder A third stops just past Hermione He retraces his steps until he stands directly in front of her She stands stock still He can see no sign of her the tent or the campfire The second man drops the body from his shoulder The man does as he is told The three of them walk away Harry joins Hermione Hermione looks in the direction the men went Her face is solemn They walk towards the tent Ron steps out of the tent He sees the two of them together He looks pale and haggard As they journey through fields and past devastated homes Ron grows more drawn and suspicious They are camped under a bridge Harry stands alone a little distance from them Ron stays glued to the radio Now they are camped on the shore of a lake At night Ron lies awake In the tent Hermione is cutting Harry's hair"
        }
      ]
    }
  ]
}