{
  "ground_truth": "The tiny tent is spacious inside. Harry sits beside a table piled with camping equipment. Hermione crouches by a bunk bed, listening to the radio. Harry leans back in his chair, deep in thought. Her knees drawn up to her chest, Hermione stares blankly at Ron's radio. He crosses over to her. He holds out a hand. Her face solemn, she takes both his hands and pulls herself up. Harry puts his arms around her neck. He unfastens the locket. He throws it onto the lower bunk. His eyes fixed on hers, he draws her away from the radio. She looks pale and wistful. Still holding her hands, Harry starts to move to the music. They twist back and forth and she half-smiles. Hermione grins and they start to move a little more imagistically. He spins around. They both smile and spin. His puts arm around her, they dance more closely. They hold their hands again. Laughing, they start to jive. Hermione spins into his arms. Harry leans his head against her. She rests her chin on his shoulder. They turn slowly, holding each other close. Hermione's smile fades. They stop dancing. They meet each other's gaze. Hermione sighs and walks away. Harry watches her go. Hermione sits reading on the flat-topped rocks. Inside the tent, Harry lies on a bunk, his arms folded, idly watching the snitch hovering above his head. He reaches out his hand. The fluttering wings slow then fold away. Harry draws the snitch down and holds it against his mouth. He looks at it. Writing appears on the golden surface: I open at the close. He hands it to her. She puts down her book and studies the writing. Harry sits beside her. A triangle containing a circle, with a vertical line through it. She frowns at the drawing. She ruffles his hair and smiles at him. Harry nods and grins after her, as she walks away. A few snowflakes drift past. They apparate in a quaint, snow-covered village. Wearing winter clothes, they wander down a deserted street. She takes his arm. Two villagers come out of an inn behind them. A little gate leads into the churchyard. She turns to him. In the graveyard, surrounding the church, Harry and Hermione study the name on the graves. The snow gently falls. Hermione stops at a grave marked with a horizontal slab. She brushes snow from it with her gloved hand. Carved on the slab is a triangle containing a circle, with a vertical line through it. She wipes away more snow and finds a name engraved underneath. He is standing at the far side of the graveyard. He looks down at a plain, upright gravestone.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The small canvas is roomy inside. Harry perches next to a desk stacked with outdoor gear. Hermione stoops by a cot, listening to the receiver. Harry reclines back in his seat, deep in reflection. Her knees drawn up to her torso, Hermione gazes vacantly at Ron's receiver. He moves over to her. He extends a hand. Her visage solemn, she takes both his hands and pulls herself up. Harry places his limbs around her neck. He unclasps the locket. He hurls it onto the lower cot. His eyes fixed on hers, he draws her away from the receiver. She appears pale and yearning. Still grasping her hands, Harry begins to sway to the melody. They gyrate back and forth and she half-grins. Hermione beams and they start to sway a little more expressively. He twirls around. They both smile and twirl. His puts limb around her, they waltz more closely. They clasp their hands again. Laughing, they start to jive. Hermione twirls into his limbs. Harry leans his head against her. She rests her chin on his shoulder. They rotate slowly, holding each other tight. Hermione's grin fades. They halt dancing. They meet each other's stare. Hermione exhales and strides away. Harry observes her depart. Hermione perches reading on the flat-topped stones. Inside the canvas, Harry reclines on a cot, his limbs folded, idly observing the snitch hovering above his head. He extends his hand. The fluttering wings slow then fold away. Harry draws the snitch down and holds it against his lips. He glances at it. Writing emerges on the golden exterior: I open at the close. He hands it to her. She sets down her book and examines the writing. Harry perches next to her. A triangle encompassing a circle, with a vertical line through it. She frowns at the sketch. She tousles his hair and smiles at him. Harry nods and beams after her, as she strides away. A few snowflakes drift past. They apparate in a charming, snow-draped hamlet. Wearing winter apparel, they meander down a deserted avenue. She takes his limb. Two villagers emerge from an inn behind them. A little gate leads into the churchyard. She turns to him. In the burial ground, encircling the church, Harry and Hermione examine the name on the graves. The snow gently descends. Hermione halts at a grave marked with a horizontal slab. She sweeps snow from it with her gloved hand. Carved on the slab is a triangle encompassing a circle, with a vertical line through it. She wipes away more snow and discovers a name engraved below. He is standing at the far side of the burial ground. He gazes down at a plain, upright tombstone."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The inside of the tiny tent is made to feel spacious. A table piled with camping equipment is sat beside by Harry. A bunk bed is crouched by Hermione as she listens to the radio. Harry's chair is leaned back in by him, deep in thought. With her knees drawn up to her chest, Ron's radio is stared at blankly by Hermione. She is crossed over to by him. A hand is held out by him. Her face solemn, both his hands are taken by her, and she pulls herself up. Her neck is put around by Harry's arms. The locket is unfastened by him. It is thrown onto the lower bunk by him. His eyes are fixed on hers as she is drawn away from the radio by him. She appears pale and wistful. Her hands are still held by him, and the music is started to move to by Harry. They are twisted back and forth by them, and she half-smiles. Hermione grins, and a little more imagistically they start to move. Around they spin. Smiles are shared by both, and spins are made together. An arm is put around her by him, and they dance more closely. Their hands are held again by them. Laughing, jiving is started by them. Into his arms, Hermione is spun. Against her, Harry's head is leaned by him. Her chin is rested on his shoulder by her. Slowly, they are turned by them, holding each other close. Hermione's smile fades. Their dancing is stopped by them. Each other's gaze is met by them. A sigh is given by Hermione, and she walks away. Her departure is watched by Harry. Reading on the flat-topped rocks is done by Hermione. Inside the tent, Harry is found lying on a bunk, his arms folded, idly he watches the snitch hovering above his head. His hand is reached out by him. The fluttering wings slow, then fold away. The snitch is drawn down and held against his mouth by Harry. It is looked at by him. Writing appears on the golden surface: I open at the close. It is handed to her by him. Her book is put down, and the writing is studied by her. Beside her, Harry sits. A triangle containing a circle, with a vertical line through it is observed. The drawing is frowned at by her. His hair is ruffled, and a smile is given to him by her. After her, Harry nods and grins, as away she walks. A few snowflakes drift past them. They apparate in a quaint, snow-covered village. Down a deserted street, they wander, wearing winter clothes. His arm is taken by her. Out of an inn behind them come two villagers. Into the churchyard, a little gate is led through. To him she turns. In the graveyard, surrounding the church, Harry and Hermione study the name on the graves. Snow gently falls. At a grave marked with a horizontal slab, Hermione stops. Snow is brushed from it with her gloved hand. Carved on the slab is a triangle containing a circle, with a vertical line through it. More snow is wiped away, and a name engraved underneath is found by her. The far side of the graveyard is where he stands. At a plain, upright gravestone, he looks."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The small tent feels spacious. Harry sits beside a table of camping gear. Hermione listens to the radio by the bunk bed, knees drawn to her chest, staring at Ron's radio. Harry hands her the locket, then draws her away from the radio. Looking pale, she half-smiles as they twist to the music. Hermione grins, and they dance intimately. Laughing, they jive and spin, leaning on each other. As they stop, Hermione sighs and walks away. Later, she reads on rocks while Harry idly watches a snitch in the tent. He catches it, revealing the words 'I open at the close,' then shares it with Hermione. She studies it, frowning at a triangle containing a circle with a line. Ruffling his hair, she smiles and leaves. Snowflakes fall as they apparate to a snowy village, wandering arm in arm. At the churchyard, they examine the graves. Hermione finds a grave with a familiar symbol and a name beneath it. Harry stands alone at another gravestone."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The small tent feels spacious inside. Harry sits by a table with camping gear; Hermione crouches by a bunk bed, listening to the radio. Deep in thought, Harry leans back. Hermione stares at Ron's radio, her knees drawn up. He offers his hand, and she solemnly takes it, pulling herself up. Harry unfastens the locket, throwing it onto the bunk, and draws her from the radio. Pale and wistful, she half-smiles as they start to move with the music, twisting back and forth. They spin and smile, dancing closely. Laughing, they jive, Hermione spins into Harry’s arms, and they hold each other, turning slowly. Her smile fades, and they stop, meeting each other's gaze. Sighing, Hermione walks away, watched by Harry. Outside, Hermione reads on the rocks, while Harry lies on a bunk, watching a snitch hover. He catches it, revealing writing: \"I open at the close.\" He shows her, and she studies it after putting her book down. A triangle containing a circle, with a vertical line through it, makes Hermione frown. She ruffles Harry's hair and walks away as snowflakes drift past. They apparate to a snowy village, wandering down a deserted street arm in arm. Two villagers leave an inn behind them. Inside a churchyard, Harry and Hermione study names on graves as snow falls. She brushes snow from a grave marked with a triangle, circle, and line, revealing a name. Harry stands by a simple gravestone at the graveyard's far side."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The small tent, though diminutive in appearance from the outside, is surprisingly spacious within its fabric walls. Inside this cozy shelter, Harry finds himself seated comfortably beside a table that is cluttered with an assortment of camping equipment. Nearby, Hermione is crouched by the lower part of a bunk bed, her attention fixed on the radio. Harry reclines in his chair, absorbed in contemplation. Hermione, her knees drawn up protectively to her chest, stares vacantly at the radio, which belongs to Ron. As if sensing her isolation, Ron approaches her. He extends his hand in a gesture of solidarity. With a solemn expression on her face, she wraps both hands around his and pulls herself to her feet. Harry encircles her neck with his arms. With deliberate care, he unfastens the locket and tosses it onto the lower bunk. Maintaining eye contact with her, he gently guides her away from the radio's distracting noise. Her complexion appears pale and wistful. Still clasping her hands, Harry begins to sway in rhythm with the music. They twist back and forth, and a subtle smile plays on her lips. As Hermione's expression transforms into a full grin, they start to move with more imaginative flair. Harry spins around energetically, and together they smile and twirl. As his arm wraps around her, they dance more closely, their steps synchronized. Once again, they join hands, and with laughter echoing, they shift into a lively jive. Hermione spins playfully into his arms, and Harry gently rests his head against hers. She, in turn, nestles her chin on his shoulder. They turn slowly, wrapped in each other's embrace. Gradually, Hermione's smile fades as reality intrudes, and they cease dancing. Their eyes meet in a silent exchange. Hermione lets out a sigh and walks away quietly. Harry's gaze follows her as she leaves. Hermione finds a spot on the flat-topped rocks to read in solitude. Meanwhile, inside the tent, Harry lies sprawled on a bunk, arms folded leisurely, his eyes tracking the snitch that flutters just above his head. He reaches out his hand, and slowly, the delicate wings still and fold away. Bringing the snitch close, Harry presses it to his lips. He looks at it intently. Words etch themselves onto the golden surface: \"I open at the close.\" He hands the snitch to Hermione. She sets aside her book to examine the words. Harry joins her, sitting beside her. On the snitch, an enigmatic symbol becomes visible: a triangle enclosing a circle, pierced by a vertical line. She frowns in thoughtful contemplation at the mysterious drawing, then playfully ruffles his hair, offering a warm smile. Harry nods, a grin spreading across his face, watching her as she walks away. Softly, a few snowflakes begin to drift past. They apparate into a quaint village that is blanketed in snow, the air crisp and cold. Dressed warmly for the winter chill, they wander together down an empty street. She takes his arm tenderly. Two villagers emerge from an inn just behind them. A small gate serves as an entrance into the churchyard. She turns to him, her eyes seeking his. In the graveyard, which surrounds the church in silent solemnity, Harry and Hermione pause to study the names engraved on the gravestones. Snowflakes fall gently around them, adding a layer of stillness. Hermione stops in front of a grave marked by a horizontal slab. Using her gloved hand, she brushes the snow away to reveal the markings. Carved into the stone is the same triangle with a circle and vertical line. As she continues to clear away the snow, a name appears beneath the symbol. Harry stands at the far side of the graveyard, his focus on a plain, upright gravestone that bears silent witness to the past."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The small tent, despite its unassuming and diminutive appearance from the outside, reveals itself to be surprisingly spacious within its fabric walls. Once inside this cozy and inviting shelter, Harry finds himself seated comfortably beside a table that is cluttered with an assortment of camping equipment, each item vying for space. Nearby, Hermione is crouched beside the lower part of a bunk bed, her attention completely absorbed by the radio. Lost in thought, Harry reclines in his chair, musing silently. Hermione, with her knees drawn up protectively to her chest, stares vacantly at the radio, which happens to belong to Ron. As if sensing her feeling of isolation, Ron approaches her. He extends his hand in a gesture that signifies solidarity and support. With a solemn expression on her face, she wraps both of her hands around his and uses his support to pull herself up to her feet. Harry encircles her neck gently with his arms. With deliberate care, he unfastens the locket she wears and casually tosses it onto the lower bunk. Maintaining eye contact with her, he tenderly guides her away from the distracting noise of the radio. Her complexion appears pale and wistful, as if lost in distant thoughts. Still clasping her hands, Harry begins to sway gently in rhythm with the music that plays softly. They twist back and forth, and a subtle smile begins to play on her lips. As Hermione's expression transforms into a full and genuine grin, they start to move with more imaginative flair and freedom. Harry spins energetically around, and together they smile and twirl in unison. As his arm wraps around her, they dance more closely, their steps perfectly synchronized. Once again, they join hands together, and with laughter echoing around them, they transition into a lively jive. Hermione spins playfully into his arms, and Harry gently rests his head against hers. She, in turn, nestles her chin on his shoulder, a gesture of comfort and closeness. They turn slowly, wrapped in each other's warm embrace. Gradually, Hermione's smile begins to fade as reality intrudes upon the moment, and they cease their dancing. Their eyes meet in a silent exchange that conveys understanding. Hermione lets out a soft sigh and walks away quietly, lost in her thoughts. Harry's gaze follows her as she departs, concerned yet understanding. Hermione discovers a spot on the flat-topped rocks where she can read in solitude. Meanwhile, back inside the tent, Harry lies sprawled casually on a bunk, arms folded leisurely, his eyes tracking the snitch that flutters just above his head. He reaches out his hand, and slowly, the delicate wings of the snitch still and fold themselves away. Bringing the snitch close to his face, Harry presses it gently to his lips. He looks at it intently, and words begin to etch themselves onto the golden surface: \"I open at the close.\" He hands the snitch to Hermione, who then sets aside her book to examine the mysterious words. Harry joins her, sitting closely beside her. On the snitch, an enigmatic symbol becomes visible: a triangle enclosing a circle, pierced by a vertical line. She frowns in thoughtful contemplation at the mysterious drawing, then playfully ruffles his unruly hair, offering him a warm smile. Harry nods, a grin spreading across his face as he watches her walk away. Softly, a few delicate snowflakes begin to drift past as if heralding a change. They apparate into a quaint village that is blanketed in a pristine layer of snow, the air crisp and cold, invigorating them. Dressed warmly for the winter chill, they wander together down an empty street, savoring the tranquility. She takes his arm tenderly, offering comfort and companionship. Two villagers emerge from an inn just behind them, adding a hint of life to the quiet scene. A small gate serves as an entrance into the churchyard. She turns to him, her eyes seeking reassurance from his. In the graveyard, which surrounds the church with a silent solemnity, Harry and Hermione pause to study the names engraved on the gravestones. Snowflakes continue to fall gently around them, adding a layer of stillness and peace. Hermione stops in front of a grave marked by a horizontal slab. Using her gloved hand, she brushes the snow away to reveal the markings beneath. Carved into the stone is the same triangle with a circle and vertical line, an echo of the symbol on the snitch. As she continues to clear away the snow, a name appears beneath the symbol, bringing further clarity. Harry stands at the far side of the graveyard, his focus drawn to a plain, upright gravestone that bears silent witness to the past."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Within the tent's deceptively spacious interior, Harry is seated beside a table cluttered with camping gear, absorbing the organized chaos of their temporary home. Hermione is crouched by the bunk bed, her attention fixated on the soft crackle of the radio, all while her thoughts seem distant. Harry, deep in contemplation, leans back in his chair, letting his mind wander in silence. As Hermione draws her knees up to her chest, she stares blankly at the radio that had become Ron's, her thoughts possibly adrift in memories. Resolute, Harry moves towards her, extending his hand with gentle intent. With a solemn expression, Hermione accepts his hands, and together they pull her up from her crouched position. As an act of camaraderie, Harry wraps his arms around her neck to unfasten the imposing locket, liberating them by tossing it onto the lower bunk. His eyes locked onto Hermione's, he guides her away from the radio, her complexion appearing pale and wistful. Maintaining their connection, Harry begins to sway to the music, prompting a gentle twisting motion as Hermione's lips curve into a half-smile. Gradually, Hermione's grin broadens and they transition into more fluid, artistic movements, adding spins to their dance with growing excitement. Smiles brighten their faces as they joyfully swirl together, his arm looped around her in a gesture of closeness. They rejoin their hands, and with laughter spilling out, they break into a lively jive. Hermione twirls seamlessly into Harry's arms, encouraging a tender gesture where Harry rests his head against her, and she reciprocates by placing her chin on his shoulder. Their movements slow as they turn together, enveloped in the warmth of the moment, though eventually, Hermione's smile wanes, signaling the end of their dance. Sharing a moment of profound eye contact, Hermione lets out a sigh and steps away, leaving Harry to watch her retreat into solitude. Hermione finds solace as she reads on the flat-topped rocks outside, while inside the tent, Harry lies on a bunk, his arms casually folded, watching the snitch float above him with idle fascination. As he extends his hand, the snitch's wings slow and fold away, allowing him to draw it down and hold it gently to his lips. Contemplating the object, he observes as mysterious words manifest on its golden surface: \"I open at the close.\" Intrigued, he hands the snitch over to Hermione, who momentarily sets aside her book to examine the revealed message. Harry joins her, sitting by her side as they ponder over the significance of a triangle enclosing a circle, intersected by a vertical line. Hermione scrutinizes the drawing, frowning in concentration before ruffling Harry's hair affectionately and offering him a reassuring smile. Harry acknowledges her affection with a nod and a grin, watching her as she departs, feeling a sense of camaraderie. Snowflakes begin to descend gently, transforming their world. They apparate into a quaint village blanketed in snow, their winter attire shielding them against the cold as they meander down a deserted street. Arm in arm, they share the moment until two villagers emerge from an inn behind them. They pass through a small gate into the churchyard, where Hermione turns to Harry, and together, they study the inscriptions on the gravestones amidst the softly falling snow. Hermione pauses at a grave marked with a horizontal slab, brushing the snow away with her gloved hand to uncover the same iconic symbol: a triangle containing a circle, bisected by a vertical line. As she clears more snow, a name gradually appears beneath the symbol. Meanwhile, Harry stands at the graveyard's far edge, lost in thought as he gazes down at a plain, upright gravestone, absorbed by its quiet presence."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The tiny tent is surprisingly spacious. Inside, Harry sits by a table laden with camping gear while Hermione crouches beside a bunk bed, attentively listening to the radio. Deep in thought, Harry leans back before crossing to Hermione, offering his hands to help her up. As Harry unfastens his locket and discards it on the bunk, they move away from the radio, beginning to sway to the music. They exchange half-smiles, gradually warming up to the rhythm, and their dance becomes livelier. Their movements evolve into spinning and laughing as they jive closely. Hermione spins into Harry's arms, and they share a quiet, intimate moment before she pulls away with a sigh.\n\nHermione settles on the flat-topped rocks to read, while in the tent, Harry lies on a bunk, observing a snitch hovering above. He reaches for it, its wings halting as writing appears: \"I open at the close.\" Showing it to Hermione, she studies the inscription, sets her book aside, and smiles, leaving him to ponder. Snowflakes begin to fall as they apparate to a quaint, snow-dusted village. Walking arm in arm down a deserted street, they pass villagers at an inn before entering a churchyard. Together, they examine gravestones amidst the gently falling snow. Hermione discovers a grave with a familiar symbol and a name beneath it. Meanwhile, Harry stands contemplatively by a different, plain gravestone at the graveyard's edge."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The tiny tent, charmed with wizarding magic to accommodate more space than its exterior suggests, is spacious inside. Harry sits beside a table piled with camping equipment, a necessity for those on the run like them. Hermione crouches by a bunk bed, listening to the radio which crackles with updates on the wizarding war. Harry leans back in his chair, deep in thought about their next move. Her knees drawn up to her chest, Hermione stares blankly at Ron's radio, a cherished connection to the world outside. Ron, their loyal friend who had left them in a moment of doubt, crosses over to her in her thoughts. He holds out a hand. Her face solemn, she takes both his hands and pulls herself up. Harry puts his arms around her neck, offering comfort amidst their uncertain journey. He unfastens the locket, a Horcrux filled with dark magic that had burdened them. He throws it onto the lower bunk. His eyes fixed on hers, he draws her away from the radio. She looks pale and wistful, memories of better times etched on her face. Still holding her hands, Harry starts to move to the music emanating softly from the radio. They twist back and forth, and she half-smiles, recalling a happier past. Hermione grins, and they start to move a little more imagistically, lost momentarily in a dance. He spins around. They both smile and spin, a fleeting escape from their troubles. His arm around her, they dance more closely. They hold their hands again. Laughing, they start to jive, their spirits lifted briefly. Hermione spins into his arms. Harry leans his head against her, feeling a sense of camaraderie. She rests her chin on his shoulder. They turn slowly, holding each other close. Hermione's smile fades, the weight of their mission returning. They stop dancing. They meet each other's gaze, a silent understanding passing between them. Hermione sighs and walks away, the burden of their quest heavy once more. Harry watches her go, knowing they must stay strong. Hermione sits reading a book on the flat-topped rocks beside the tent, lost in the comforting words of another's tale. Inside the tent, Harry lies on a bunk, his arms folded, idly watching the Golden Snitch hovering above his head, a reminder of his first Quidditch match at Hogwarts. He reaches out his hand. The fluttering wings slow then fold away, a gentle reminder of simpler times. Harry draws the snitch down and holds it against his mouth. He looks at it. Writing, invisibly charmed, appears on the golden surface: I open at the close. He hands it to her, sharing the mystery they must solve. She puts down her book and studies the writing, her brow furrowed in thought. Harry sits beside her. A triangle containing a circle, with a vertical line through it — the symbol of the Deathly Hallows — piques her curiosity. She frowns at the drawing, pondering its significance. She ruffles his hair and smiles at him, the gesture filled with unspoken support. Harry nods and grins after her, as she walks away, grateful for her steadfast friendship. A few snowflakes drift past, heralding the arrival of winter. They apparate in a quaint, snow-covered village, Godric's Hollow, a place of historical significance in the wizarding world, where Harry's parents once lived. Wearing winter clothes, they wander down a deserted street, the crunch of snow underfoot the only sound. She takes his arm, offering warmth in the cold. Two villagers come out of an inn behind them, their eyes briefly meeting the pair's before turning away. A little gate leads into the churchyard that holds many secrets of the past. She turns to him, aware of the weight this place carries for him. In the graveyard, surrounding the church, Harry and Hermione study the names on the graves, seeking a connection to their past. The snow gently falls, a silent witness to their search. Hermione stops at a grave marked with a horizontal slab, the worn engraving hinting at forgotten stories. She brushes snow from it with her gloved hand. Carved on the slab is a triangle containing a circle, with a vertical line through it — a mark of intrigue and danger. She wipes away more snow and finds a name engraved underneath, adding another piece to their puzzle. He is standing at the far side of the graveyard, a quiet figure against the stark white backdrop. He looks down at a plain, upright gravestone, consumed by thoughts of the parents he never knew."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The tiny tent is spacious inside. Harry sits beside a table piled with camping equipment. Hermione crouches by a bunk bed listening to the radio. Harry leans back in his chair deep in thought. Her knees drawn up to her chest. Hermione stares blankly at Ron's radio. He crosses over to her. He holds out a hand. Her face solemn. she takes both his hands and pulls herself up. Harry puts his arms around her neck. He unfastens the locket. He throws it onto the lower bunk. His eyes fixed on hers. he draws her away from the radio. She looks pale and wistful. Still holding her hands. Harry starts to move to the music. They twist back and forth and she halfsmiles. Hermione grins and they start to move a little more imagistically. He spins around. They both smile and spin. His puts arm around her. they dance more closely. They hold their hands again. Laughing they start to jive. Hermione spins into his arms. Harry leans his head against her. She rests her chin on his shoulder. They turn slowly holding each other close. Hermione's smile fades. They stop dancing. They meet each other's gaze. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Hermione sighs and walks away. Harry watches her go. Hermione sits reading on the flattopped rocks. Inside the tent. Harry lies on a bunk his arms folded idly watching the snitch hovering above his head. He reaches out his hand. The fluttering wings slow then fold away. Harry draws the snitch down and holds it against his mouth. He looks at it. Writing appears on the golden surface. I open at the close. He hands it to her. She puts down her book and studies the writing. Harry sits beside her. A triangle containing a circle with a vertical line through it. She frowns at the drawing. She ruffles his hair and smiles at him. Harry nods and grins after her as she walks away. A few snowflakes drift past. They apparate in a quaint snowcovered village. Wearing winter clothes they wander down a deserted street. She takes his arm. Two villagers come out of an inn behind them. A little gate leads into the churchyard. She turns to him. In the graveyard surrounding the church. Harry and Hermione study the name on the graves. The snow gently falls. Hermione stops at a grave marked with a horizontal slab. She brushes snow from it with her gloved hand. Carved on the slab is a triangle containing a circle with a vertical line through it. She wipes away more snow and finds a name engraved underneath. He is standing at the far side of the graveyard. He looks down at a plain upright gravestone."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The tiny tent is spacious inside. Harry sits beside a table piled with camping equipment. Hermione crouches by a bunk bed listening to the radio. Harry leans back in his chair deep in thought. Her knees drawn up to her chest. Hermione stares blankly at Ron's radio. He crosses over to her. He holds out a hand. Her face solemn. she takes both his hands and pulls herself up. Harry puts his arms around her neck. He unfastens the locket. He throws it onto the lower bunk. His eyes fixed on hers. he draws her away from the radio. She looks pale and wistful. Still holding her hands. Harry starts to move to the music. They twist back and forth and she halfsmiles. Hermione grins and they start to move a little more imagistically. He spins around. They both smile and spin. His puts arm around her. they dance more closely. They hold their hands again. Laughing they start to jive. Hermione spins into his arms. Harry leans his head against her. She rests her chin on his shoulder. They turn slowly holding each other close. Hermione's smile fades. They stop dancing. They meet each other's gaze. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Hermione sighs and walks away. Harry watches her go. Hermione sits reading on the flattopped rocks. Inside the tent. Harry lies on a bunk his arms folded idly watching the snitch hovering above his head. He reaches out his hand. The fluttering wings slow then fold away. Harry draws the snitch down and holds it against his mouth. He looks at it. Writing appears on the golden surface. I open at the close. He hands it to her. She puts down her book and studies the writing. Harry sits beside her. A triangle containing a circle with a vertical line through it. She frowns at the drawing. She ruffles his hair and smiles at him. Harry nods and grins after her as she walks away. A few snowflakes drift past. They apparate in a quaint snowcovered village. Wearing winter clothes they wander down a deserted street. She takes his arm. Two villagers come out of an inn behind them. A little gate leads into the churchyard. She turns to him. In the graveyard surrounding the church. Harry and Hermione study the name on the graves. The snow gently falls. Hermione stops at a grave marked with a horizontal slab. She brushes snow from it with her gloved hand. Carved on the slab is a triangle containing a circle with a vertical line through it. She wipes away more snow and finds a name engraved underneath. He is standing at the far side of the graveyard. He looks down at a plain upright gravestone."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The tiny tent is spacious inside. Harry sits beside a table piled with camping equipment. Hermione crouches by a bunk bed listening to the radio. Harry leans back in his chair deep in thought. Her knees drawn up to her chest. Hermione stares blankly at Ron's radio. He crosses over to her. He holds out a hand. Her face solemn. she takes both his hands and pulls herself up. Harry puts his arms around her neck. He unfastens the locket. He throws it onto the lower bunk. His eyes fixed on hers. he draws her away from the radio. She looks pale and wistful. Still holding her hands. Harry nods and grins after her as she walks away. A few snowflakes drift past. They apparate in a quaint snowcovered village. Wearing winter clothes they wander down a deserted street. She takes his arm. Two villagers come out of an inn behind them. A little gate leads into the churchyard. She turns to him. In the graveyard surrounding the church. Harry and Hermione study the name on the graves. The snow gently falls. Hermione stops at a grave marked with a horizontal slab. She brushes snow from it with her gloved hand. Carved on the slab is a triangle containing a circle with a vertical line through it. She wipes away more snow and finds a name engraved underneath. He is standing at the far side of the graveyard. He looks down at a plain upright gravestone."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The tiny tent is spacious inside. Harry sits beside a table piled with camping equipment. Hermione crouches by a bunk bed listening to the radio. Harry leans back in his chair deep in thought. Her knees drawn up to her chest. Hermione stares blankly at Ron's radio. He crosses over to her. The snow gently falls. Hermione stops at a grave marked with a horizontal slab. She brushes snow from it with her gloved hand. Carved on the slab is a triangle containing a circle with a vertical line through it. She wipes away more snow and finds a name engraved underneath. He is standing at the far side of the graveyard. He looks down at a plain upright gravestone."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The enormous bag is cramped outside. Max reclines atop a crate strewn with hiking tools. Lucy lounges by a hammock, humming to the television. Max hunches forward in his stool, lost in memories. Her arms wrapped around a pillow, Lucy glares vacantly at Tom's television. He tiptoes over to her. He flashes a smile. Her expression serious, she shakes both his arms and lifts herself over. Max drapes a scarf around her waist. He tightens the bracelet. He flings it onto the upper hammock. His eyes locked with hers, he pulls her toward the television. She looks vibrant and hopeful. Still gripping her arms, Max starts to hum to the rhythm. They sway side to side and she half-laughs. Lucy chuckles and they begin to sway a little more theatrically. He twirls around. They both grin and twirl. His slips coat over her, they sway more tightly. They grip their arms again. Giggling, they commence to shimmy. Lucy twirls into his arms. Max rests his nose against her. She places her cheek on his chest. They twist gently, embracing each other closely. Lucy's grin dwindles. They cease swaying. They catch each other's glimpse. Lucy exhales and strides afar. Max observes her departure. Lucy perches examining on the jagged boulders. Outside the bag, Max sprawls on a hammock, his arms crossed, absently observing the butterfly fluttering near his toes. He stretches out his foot. The delicate wings halt then tuck away. Max pulls the butterfly near and presses it against his lips. He peers at it. Carvings emerge on the silver texture: I close at the start. He offers it to her. She discards her journal and inspects the carvings. Max leans beside her. A square containing a star, with a horizontal spiral around it. She grimaces at the sketch. She tousles his hair and grins at him. Max shrugs and smirks after her, as she strolls away. A few raindrops float by. They teleport to a vibrant, rain-soaked town. Wearing summer attire, they meander down a bustling avenue. She grips his sleeve. Two tourists exit a café behind them. A massive door opens into the orchard. She gestures to him. In the park, encircling the chapel, Max and Lucy gaze at the letters on the stones. The rain softly pours. Lucy halts at a monument marked with a vertical stone. She sweeps rain from it with her bare finger. Etched on the stone is a square containing a star, with a horizontal spiral around it. She brushes away more rain and uncovers a word inscribed underneath. He is strolling at the near corner of the park. He gazes up at a decorated, tilted headstone."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Inside a deceptively spacious tent, Harry sits absorbed in thought while Hermione listens to a radio next to a bunk bed. They clasp hands, and Harry removes a locket, tossing it aside. As music plays, Harry pulls Hermione to dance, leading to joyful jive and eventual closeness. Their dance ends with a shared gaze before Hermione wanders off. Outside, she reads on rocks, while Harry lies watching a snitch in the tent. Catching it, he sees the phrase \"I open at the close\" appear. He shares this with Hermione, who examines the writing and frowns at a peculiar symbol: a triangle with a circle and line. After some lighthearted affection, snow begins to fall. They apparate to a snow-covered village, exploring the quiet streets. In the graveyard, they study gravestones, noting the same mysterious symbol carved on one, alongside a name Hermione uncovers. Harry contemplates a plain gravestone further away."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He looks down at a plain upright gravestone He is standing at the far side of the graveyard She wipes away more snow and finds a name engraved underneath Carved on the slab is a triangle containing a circle with a vertical line through it She brushes snow from it with her gloved hand Hermione stops at a grave marked with a horizontal slab The snow gently falls Harry and Hermione study the name on the graves In the graveyard surrounding the church She turns to him A little gate leads into the churchyard Two villagers come out of an inn behind them She takes his arm Wearing winter clothes they wander down a deserted street They apparate in a quaint snowcovered village A few snowflakes drift past Harry nods and grins after her as she walks away She ruffles his hair and smiles at him She frowns at the drawing A triangle containing a circle with a vertical line through it Harry sits beside her She puts down her book and studies the writing He hands it to her I open at the close Writing appears on the golden surface He looks at it Harry draws the snitch down and holds it against his mouth The fluttering wings slow then fold away He reaches out his hand Harry lies on a bunk his arms folded idly watching the snitch hovering above his head Inside the tent Hermione sits reading on the flattopped rocks Harry watches her go Hermione sighs and walks away They meet each other's gaze They stop dancing Hermione's smile fades They turn slowly holding each other close She rests her chin on his shoulder Harry leans his head against her Hermione spins into his arms Laughing they start to jive They hold their hands again they dance more closely His puts arm around her They both smile and spin He spins around Hermione grins and they start to move a little more imagistically They twist back and forth and she halfsmiles Harry starts to move to the music Still holding her hands She looks pale and wistful he draws her away from the radio His eyes fixed on hers He throws it onto the lower bunk He unfastens the locket Harry puts his arms around her neck she takes both his hands and pulls herself up Her face solemn He holds out a hand He crosses over to her Hermione stares blankly at Ron's radio Her knees drawn up to her chest Harry leans back in his chair deep in thought Hermione crouches by a bunk bed listening to the radio Harry sits beside a table piled with camping equipment The tiny tent is spacious inside"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Harry sits beside a table piled with camping equipment The tiny tent is spacious inside Harry leans back in his chair deep in thought Hermione crouches by a bunk bed listening to the radio Hermione stares blankly at Ron's radio Her knees drawn up to her chest He holds out a hand He crosses over to her she takes both his hands and pulls herself up Her face solemn He unfastens the locket Harry puts his arms around her neck His eyes fixed on hers He throws it onto the lower bunk She looks pale and wistful he draws her away from the radio Harry starts to move to the music Still holding her hands Hermione grins and they start to move a little more imagistically They twist back and forth and she halfsmiles They both smile and spin He spins around they dance more closely His puts arm around her Laughing they start to jive They hold their hands again Harry leans his head against her Hermione spins into his arms They turn slowly holding each other close She rests her chin on his shoulder They stop dancing Hermione's smile fades Hermione sighs and walks away They meet each other's gaze Hermione sits reading on the flattopped rocks Harry watches her go Harry lies on a bunk his arms folded idly watching the snitch hovering above his head Inside the tent The fluttering wings slow then fold away He reaches out his hand He looks at it Harry draws the snitch down and holds it against his mouth I open at the close Writing appears on the golden surface She puts down her book and studies the writing He hands it to her A triangle containing a circle with a vertical line through it Harry sits beside her She ruffles his hair and smiles at him She frowns at the drawing A few snowflakes drift past Harry nods and grins after her as she walks away Wearing winter clothes they wander down a deserted street They apparate in a quaint snowcovered village Two villagers come out of an inn behind them She takes his arm She turns to him A little gate leads into the churchyard Harry and Hermione study the name on the graves In the graveyard surrounding the church Hermione stops at a grave marked with a horizontal slab The snow gently falls Carved on the slab is a triangle containing a circle with a vertical line through it She brushes snow from it with her gloved hand He is standing at the far side of the graveyard She wipes away more snow and finds a name engraved underneath He looks down at a plain upright gravestone"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Harry watches her go Hermione sits reading on the flattopped rocks Inside the tent Harry lies on a bunk his arms folded idly watching the snitch hovering above his head He reaches out his hand The fluttering wings slow then fold away Harry draws the snitch down and holds it against his mouth He looks at it Writing appears on the golden surface I open at the close He hands it to her She puts down her book and studies the writing Harry sits beside her A triangle containing a circle with a vertical line through it She frowns at the drawing She ruffles his hair and smiles at him Harry nods and grins after her as she walks away A few snowflakes drift past They apparate in a quaint snowcovered village Wearing winter clothes they wander down a deserted street She takes his arm Two villagers come out of an inn behind them A little gate leads into the churchyard She turns to him In the graveyard surrounding the church Harry and Hermione study the name on the graves The snow gently falls Hermione stops at a grave marked with a horizontal slab She brushes snow from it with her gloved hand Carved on the slab is a triangle containing a circle with a vertical line through it She wipes away more snow and finds a name engraved underneath He is standing at the far side of the graveyard He looks down at a plain upright gravestone The tiny tent is spacious inside Harry sits beside a table piled with camping equipment Hermione crouches by a bunk bed listening to the radio Harry leans back in his chair deep in thought Her knees drawn up to her chest Hermione stares blankly at Ron's radio He crosses over to her He holds out a hand Her face solemn she takes both his hands and pulls herself up Harry puts his arms around her neck He unfastens the locket He throws it onto the lower bunk His eyes fixed on hers he draws her away from the radio She looks pale and wistful Still holding her hands Harry starts to move to the music They twist back and forth and she halfsmiles Hermione grins and they start to move a little more imagistically He spins around They both smile and spin His puts arm around her they dance more closely They hold their hands again Laughing they start to jive Hermione spins into his arms Harry leans his head against her She rests her chin on his shoulder They turn slowly holding each other close Hermione's smile fades They stop dancing They meet each other's gaze Hermione sighs and walks away"
        }
      ]
    }
  ]
}