{
  "ground_truth": "Hermione crouches down and, taking out her wand, draws a circle in the air, producing a wreath of white roses. Harry wipes his nose with his sleeve and gazes at the grave. Comforting him, Hermione rests her head on his shoulder, then she turns and spots a dark figure watching them from a short distance away. Harry sees an old woman wearing a knitted cape with a hood, who turns and totters slowly away. They follow her up the street until Harry slows and stops beside a burned-out, roofless house. He looks over the gate at the overgrown garden and recalls Voldemort's attack, with both bodies lying on the floor, setting Harry's joy. They turn to find the old woman close beside them, and Harry approaches her as she stares at him. Inside a dark house, Harry takes a matchbox from Bathilda, lights a candle, and the wizened old woman studies Harry's face. He captures sight of something over her shoulder as Bathilda turns her attention to Hermione. Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand. Bathilda gazes at him, then picks up the candle and eases her way past him. Hermione looks anxious as Harry follows Bathilda, leaving Hermione in the filthy living room. The tip of his wand lights up, illuminating his way up the stairs, while in the living room, the tip of Hermione's wand is also glowing. She picks up a book with a note attached to the cover, lifts the note to read the title, and turns the book over to reveal a moving picture of a smirking Rita. Upstairs, Harry reaches a dingy bedroom where the old woman is waiting for him, and he sees her looking at the locket around his neck. She indicates something across the room as downstairs, Hermione walks into another dark room, her wand as the only source of light, and disturbs a swarm of buzzing flies. Upstairs, Harry examines a photograph album on a dressing table as the old woman's face contorts, becoming cadaverous, and she disintegrates when Harry spins around. Downstairs, Hermione spots blood on the ceiling as the snake lunges. Harry fends it off with a chair, while downstairs, Hermione trips and falls. The snake hurls itself at Harry, smashing him through a brick wall into a child's bedroom, causing the light on the ceiling to sway. The snake wraps itself around Harry, who picks up a brick from the rubble and smashes the snake's head with it, causing it to slither off him. Harry hauls himself back through the wall as Hermione comes up the stairs, and the snake attacks again. Hermione flourishes her wand, hitting the snake and causing it to fall down the stairs. Harry's wand, dropped in the struggle, is lying at the top of the stairs.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Hermione bends down and, extracting her wand, sketches a loop in the air, generating a garland of white blossoms. Harry cleanses his nose with his sleeve and stares at the burial site. Consoling him, Hermione leans her head on his shoulder, then she rotates and notices a shadowy silhouette observing them from a minor distance away. Harry observes an elderly woman donning a knitted cloak with a hood, who rotates and staggers slowly away. They trail her up the road until Harry decelerates and halts beside a charred, roofless dwelling. He glances over the gate at the overgrown yard and remembers Voldemort's onslaught, with both corpses lying on the ground, setting Harry's happiness. They turn to discover the elderly woman nearby, and Harry moves toward her as she gapes at him. Inside a dim abode, Harry takes a matchbox from Bathilda, ignites a taper, and the shriveled elderly woman scrutinizes Harry's visage. He captures sight of something over her shoulder as Bathilda diverts her focus to Hermione. Harry raises the match beside a framed image of the young robber who stole Gregorovitch's Elder Wand. Bathilda stares at him, then seizes the taper and carefully maneuvers past him. Hermione appears worried as Harry trails Bathilda, leaving Hermione in the grimy parlor. The tip of his wand illuminates, brightening his path up the stairs, while in the parlor, the tip of Hermione's wand is likewise glowing. She seizes a tome with a note affixed to the cover, lifts the note to peruse the title, and turns the tome over to reveal a moving portrait of a sneering Rita. Upstairs, Harry arrives at a shabby chamber where the elderly woman is anticipating him, and he notices her gazing at the locket around his throat. She gestures towards something across the space as downstairs, Hermione enters another dim chamber, her wand as the sole source of light, and disrupts a cluster of buzzing insects. Upstairs, Harry inspects a photograph album on a vanity as the elderly woman's visage twists, becoming corpse-like, and she disintegrates when Harry spins around. Downstairs, Hermione notices blood on the ceiling as the serpent lunges. Harry wards it off with a chair, while downstairs, Hermione stumbles and falls. The serpent thrusts itself at Harry, crashing him through a brick barrier into a child's chamber, causing the illumination on the ceiling to oscillate. The serpent coils itself around Harry, who picks up a brick from the wreckage and crushes the serpent's head with it, causing it to slither off him. Harry drags himself back through the barrier as Hermione ascends the stairs, and the serpent strikes again. Hermione waves her wand, striking the serpent and causing it to tumble down the stairs. Harry's wand, dropped in the tussle, is lying at the apex of the stairs."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Hermione crouches down, and, after taking out her wand, a circle is drawn in the air by her, and a wreath of white roses is produced. Harry's nose is wiped with his sleeve, and the grave is gazed at by him. He is comforted by Hermione, whose head is rested on his shoulder, then a dark figure is spotted by her watching them from a short distance away. An old woman wearing a knitted cape with a hood is seen by Harry, who watches her turn and totter slowly away. She is followed by them up the street until beside a burned-out, roofless house, Harry slows and stops. The gate is looked over by him at the overgrown garden, and he recalls Voldemort's attack, with both bodies lying on the floor, setting Harry's joy. The old woman is found close beside them when they turn, and she is approached by Harry as she stares at him. Inside a dark house, a matchbox is taken from Bathilda by Harry, and a candle is lit by him, while the wizened old woman studies Harry's face. Over her shoulder, something is captured by him as Bathilda's attention turns to Hermione. The match is held up by Harry beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand. He is gazed at by Bathilda, then the candle is picked up by her, and her way past him is eased. Anxiousness is shown by Hermione as Bathilda is followed by Harry, leaving Hermione in the filthy living room. His way up the stairs is illuminated by the tip of his wand lighting up, while in the living room, Hermione's wand is also glowing at the tip. A book with a note attached to the cover is picked up by her, and the note is lifted by her to read the title, revealing a moving picture of a smirking Rita when the book is turned over. Upstairs, Harry reaches a dingy bedroom where he sees the old woman waiting for him and looking at the locket around his neck. Something across the room is indicated by her as downstairs, another dark room is walked into by Hermione, with her wand as the only source of light, and a swarm of buzzing flies is disturbed by her. A photograph album is examined by Harry on a dressing table as the old woman's face contorts, becomes cadaverous, and disintegrates when he spins around. Blood is spotted by Hermione on the ceiling as the snake lunges. The snake is fended off by Harry with a chair, while downstairs, Hermione trips and falls. Harry is smashed through a brick wall into a child's bedroom by the snake, causing the light on the ceiling to sway. The snake wraps itself around Harry, who picks up a brick from the rubble and smashes its head with it, causing it to slither off him. Harry hauls himself back through the wall as the stairs are ascended by Hermione, and the snake attacks again. Her wand is flourished by Hermione, hitting the snake and causing it to fall down the stairs. At the top of the stairs, Harry's wand, dropped in the struggle, is lying."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Hermione crouches, draws a circle with her wand, and creates a wreath of white roses. Harry wipes his nose and gazes at the grave. Comforting him, Hermione rests her head on his shoulder, then notices a dark figure nearby. Harry sees an old woman in a knitted cape, who turns and totters away. They follow her to a burned-out house. Harry recalls Voldemort's attack, setting his joy. The old woman approaches, and Harry takes a matchbox from Bathilda, lighting a candle. She studies Harry's face, then focuses on Hermione. Harry holds a match beside a photo of the thief who stole Gregorovitch's Elder Wand. Bathilda picks up the candle and moves past him. Hermione looks anxious as Harry follows Bathilda, leaving her in the filthy living room. His wand lights the stairs, while Hermione's wand glows as she reads a note on a book, revealing a moving picture of Rita. Upstairs, Harry finds the old woman in a dingy bedroom, indicating something across the room. Downstairs, Hermione disturbs buzzing flies. Harry examines a photo album as the old woman disintegrates. Hermione spots blood on the ceiling as the snake lunges. Harry fends it off with a chair, while Hermione trips. The snake smashes Harry through a wall into a child's bedroom. Harry smashes the snake's head with a brick, and it slithers off. He returns through the wall as Hermione arrives, and the snake attacks again. Hermione uses her wand, causing the snake to fall down the stairs. Harry's wand lies at the top of the stairs."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Hermione crouches, uses her wand to create a wreath of white roses, and comforts Harry as he gazes at the grave. They notice a dark figure, an old woman in a knitted cape, who totters away. Following her, they stop at a burned-out house, recalling Voldemort's attack. The woman approaches, and inside, Harry lights a candle from Bathilda, who studies him. Harry sees a photo of the thief who stole the Elder Wand. Bathilda moves past him, and Harry follows, leaving Hermione in the living room. Hermione reads a note on a book with a moving picture of Rita. Upstairs, Harry finds the old woman in a dingy bedroom, indicating something as Hermione disturbs flies downstairs. Harry examines a photo album as the woman's face contorts and disintegrates. Hermione sees blood as a snake lunges. Harry fends it off, smashing through a wall. The snake wraps around him, but he smashes its head with a brick. Harry returns through the wall as Hermione arrives, and the snake attacks again. Hermione uses her wand to hit the snake, causing it to fall down the stairs, while Harry's wand lies at the top."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Hermione crouches down carefully and, with a deliberate motion, takes out her wand. She gracefully draws a circle in the air, which magically produces a beautiful wreath of white roses. Meanwhile, Harry wipes his nose with his sleeve, his eyes fixed on the grave before him. In an attempt to comfort him, Hermione gently rests her head on his shoulder. As she does so, she turns her head and notices a dark figure observing them from a short distance away. Harry's gaze shifts to an old woman, who is wearing a knitted cape with a hood. She turns slowly and begins to totter away. They decide to follow her up the street, but eventually, Harry slows his pace and comes to a stop beside a burned-out, roofless house. He looks over the gate at the overgrown garden, his mind recalling the traumatic memory of Voldemort's attack, with both bodies lying lifeless on the floor, a memory that sets Harry's joy to sorrow. They turn around to find the old woman standing close beside them, and Harry approaches her as she stares intently at him. Inside a dark, shadowy house, Harry takes a matchbox from Bathilda, lights a candle, and the wizened old woman studies Harry's face with a scrutinizing gaze. He catches sight of something over her shoulder as Bathilda shifts her attention to Hermione. Harry holds up the match beside a framed photograph of the young thief who once stole Gregorovitch's Elder Wand. Bathilda gazes at him, then picks up the candle and carefully eases her way past him. Hermione looks anxious and concerned as Harry follows Bathilda, leaving Hermione alone in the filthy, cluttered living room. The tip of his wand lights up, casting a glow to illuminate his path up the stairs, while in the living room, the tip of Hermione's wand is also glowing softly. She picks up a book with a note attached to its cover, lifts the note to read the title, and turns the book over to reveal a moving picture of a smirking Rita. Upstairs, Harry reaches a dingy, dimly lit bedroom where the old woman is waiting for him, and he notices her looking intently at the locket around his neck. She indicates something across the room, while downstairs, Hermione walks into another dark room, her wand serving as the only source of light, and disturbs a swarm of buzzing flies. Upstairs, Harry examines a photograph album on a dressing table as the old woman's face contorts grotesquely, becoming cadaverous, and she disintegrates when Harry spins around. Downstairs, Hermione spots blood on the ceiling just as the snake lunges. Harry fends it off with a chair, while downstairs, Hermione trips and falls. The snake hurls itself at Harry, smashing him through a brick wall into a child's bedroom, causing the light on the ceiling to sway precariously. The snake wraps itself tightly around Harry, who manages to pick up a brick from the rubble and smashes the snake's head with it, causing it to slither off him. Harry hauls himself back through the wall as Hermione comes up the stairs, and the snake attacks once again. Hermione flourishes her wand, hitting the snake and causing it to fall down the stairs. Harry's wand, which was dropped during the struggle, is lying at the top of the stairs."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With great care and precision, Hermione crouches down, her movements intentional and thoughtful. From her pocket, she retrieves her wand with a deliberate motion, and with graceful finesse, she proceeds to draw an intricate circle in the air. This seemingly simple gesture magically conjures a stunningly beautiful wreath of pure white roses, hovering magnificently in the air. Meanwhile, as this enchanting scene unfolds, Harry, standing nearby, uses his sleeve to wipe his nose, his unwavering gaze locked onto the grave before him, lost in deep thought and emotion. In a gentle attempt to provide comfort and solace, Hermione softly leans her head on his shoulder. As she leans in, she turns her head slightly and notices a shadowy figure observing them from a short distance away, shrouded in an air of mystery. As Harry's eyes shift, his attention is drawn to an elderly woman clad in a knitted cape with a hood, her aura filled with intrigue. She turns ever so slowly and begins to totter away, prompting Harry and Hermione to decide to follow her up the street. However, as they proceed, Harry gradually slows his pace and eventually stops beside a burned-out, roofless house, a somber relic of the past. He peers over the gate at the wild, overgrown garden, his mind flooded with haunting memories of Voldemort’s vicious attack, recalling the lifeless bodies lying on the floor, a heart-wrenching memory that transforms any fleeting joy into profound sorrow. As they turn around, they are surprised to find the old woman standing closely beside them once more, and Harry steps forward to approach her as she stares intently and unwaveringly at him. Within the confines of a dark and shadowy house, Harry takes a matchbox from Bathilda, striking a match to light a candle, its flickering flame casting an eerie glow. The wizened old woman scrutinizes Harry's face with an intense gaze, and as she shifts her attention to Hermione, Harry glimpses something over her shoulder, piquing his curiosity. Holding up the match, he illuminates a framed photograph of the young thief known for stealing Gregorovitch's Elder Wand. Bathilda's gaze rests on him before she carefully picks up the candle, cautiously making her way past him. Hermione, now feeling a mix of anxiety and concern, watches as Harry follows Bathilda, leaving her alone in a room that is both filthy and cluttered, its chaos reflected in the dim glow of the wand light. The tip of Harry's wand glows, casting a small, bright illumination to guide his steps up the stairs, while in the living room below, Hermione's wand also glows softly. She picks up a book with a note attached to its cover, lifting the note to read the title, before turning the book over to reveal a moving picture of the smirking Rita. Meanwhile, upstairs, Harry reaches a dingy, poorly lit bedroom where the old woman waits with unwavering intent, her eyes fixated on the locket hanging around his neck. She gestures stoically toward something across the room. Downstairs, Hermione enters another dark room, her wand serving as the solitary beacon of light, and she inadvertently disturbs a swarm of flies that buzzes furiously around her. In the bedroom above, Harry examines a photograph album placed on a dressing table, and to his horror, the old woman's face contorts grotesquely, becoming cadaverous, before disintegrating when Harry spins around in alarm. Downstairs, Hermione's eyes widen as she spots blood on the ceiling just as a snake lunges unexpectedly. Harry bravely fends it off using a chair as a makeshift weapon, while downstairs, Hermione stumbles and falls. The snake hurls itself at Harry again, smashing through a brick wall into a child's bedroom, causing the hanging light on the ceiling to sway dangerously. Wrapped tightly by the snake's massive coils, Harry frantically grabs a brick from the rubble and smashes the snake's head with it, causing it to slither off him with a hiss. Summoning all his strength, Harry hauls himself back through the hole in the wall as Hermione rushes up the stairs, just as the relentless snake attacks once more. With a flourish of her wand, Hermione strikes the snake, causing it to tumble down the stairs. Meanwhile, Harry's wand, dropped during the fierce struggle, lies abandoned at the top of the stairs, its presence a stark reminder of the ongoing danger."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Hermione lowers herself into a crouch, carefully reaching into her pocket to retrieve her wand. With a deliberate motion, she draws a circle in the air, and as if by magic, a wreath of white roses materializes, floating gently before them. Meanwhile, Harry, feeling the weight of emotion, uses his sleeve to wipe his nose, his gaze fixed solemnly on the grave before him. Sensing his need for comfort, Hermione gently leans her head against his shoulder, offering silent support. Her attention is then drawn away as she turns her head and notices a dark figure standing a short distance away, observing them. Harry's eyes follow her gaze, and he sees an old woman clad in a knitted cape with a hood, who, upon being noticed, turns and begins to totter slowly away. Intrigued, they decide to follow her, walking up the street until Harry's pace slows, and he comes to a stop beside a house that has been ravaged by fire, its roof missing. He peers over the gate into the garden, now wild and overgrown, and memories flood back of Voldemort's attack, the scene of both bodies lying lifeless on the floor, a moment that forever altered his life. As they turn back, they find the old woman has approached them closely, and Harry steps forward to engage with her as she fixes her gaze on him. Inside the dimly lit house, Harry accepts a matchbox from Bathilda, striking a match to light a candle, which casts flickering shadows as the wizened old woman scrutinizes Harry's features. His attention is momentarily caught by something over her shoulder, but Bathilda shifts her focus to Hermione. Harry raises the match to illuminate a framed photograph of a young thief, the one who stole Gregorovitch's Elder Wand. Bathilda's eyes remain on him, then she picks up the candle and carefully maneuvers past him. Hermione, left in the grimy living room, watches with concern as Harry trails after Bathilda. The tip of his wand ignites, casting a glow that guides him up the stairs, while in the living room, Hermione's wand also emits a soft light. She picks up a book with a note affixed to its cover, lifting the note to read the title before flipping the book over to reveal a moving picture of a smirking Rita. Upstairs, Harry enters a dingy bedroom where the old woman awaits, her eyes drawn to the locket hanging around his neck. She gestures toward something across the room, and downstairs, Hermione steps into another darkened room, her wand the sole source of illumination, inadvertently disturbing a swarm of buzzing flies. In the bedroom, Harry inspects a photograph album on a dressing table, but as he turns, the old woman's face grotesquely contorts, becoming cadaverous, and she disintegrates before his eyes. Downstairs, Hermione notices blood on the ceiling just as the snake lunges. Harry defends himself with a chair, while downstairs, Hermione stumbles and falls. The snake propels itself at Harry, crashing through a brick wall into a child's bedroom, causing the ceiling light to sway precariously. Entangled by the snake, Harry grabs a brick from the debris and strikes the snake's head, forcing it to release him. He pulls himself back through the wall as Hermione ascends the stairs, and the snake launches another attack. Hermione swiftly brandishes her wand, striking the snake and sending it tumbling down the stairs. In the chaos, Harry's wand, lost in the struggle, lies at the top of the stairs."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Hermione conjures a wreath of white roses with her wand as she crouches beside Harry, who gazes at the grave. She comforts him by resting her head on his shoulder before noticing a dark figure nearby. They see an old woman in a knitted cape, who turns and walks away. Following her, they reach a burned-out house, where Harry recalls Voldemort's attack. The old woman approaches them, and Harry follows her into a dark house. Inside, he lights a candle from a matchbox given by Bathilda, who studies his face before shifting her attention to Hermione. Harry notices a photograph of the young thief who stole Gregorovitch's Elder Wand. Bathilda picks up the candle and moves past him, prompting Harry to follow, leaving Hermione in the living room. She examines a book with a note and discovers a moving picture of Rita. Upstairs, Harry finds Bathilda in a dingy bedroom, where she indicates something across the room. Meanwhile, Hermione enters another dark room, disturbing a swarm of flies. As Harry examines a photograph album, Bathilda's face contorts and disintegrates. Downstairs, Hermione sees blood on the ceiling as a snake lunges. Harry defends himself with a chair, and the snake smashes him through a wall into a child's bedroom. He fights back by smashing the snake's head with a brick, causing it to retreat. Harry returns through the wall as Hermione arrives, and together they fend off the snake, which falls down the stairs after Hermione strikes it with her wand. Harry's wand lies at the top of the stairs, dropped during the struggle."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Hermione, known for her proficiency with spells and a deep knowledge of ancient magic, crouches down and, taking out her wand crafted from vine wood with a dragon heartstring core, draws a circle in the air, producing a wreath of white roses, a flower symbolizing purity and remembrance. Harry wipes his nose with his sleeve and gazes at the grave of his parents, who were killed in a tragic event that marked the end of the First Wizarding War. Comforting him, Hermione rests her head on his shoulder, then she turns and spots a dark figure watching them from a short distance away in the shadow of the nearby yew trees. Harry sees an old woman wearing a knitted cape with a hood, reminiscent of traditional wizarding garments, who turns and totters slowly away, showing signs of the frailty of advanced age. They follow her up the village street, a place once vibrant but now marked by the scars of conflict, until Harry slows and stops beside a burned-out, roofless house, his childhood home, now a haunting reminder of the past. He looks over the gate at the overgrown garden and recalls Voldemort's attack, a night of terror that left both bodies lying on the floor, setting Harry's joy of eventually discovering the truth. They turn to find the old woman, revealed as Bathilda Bagshot, close beside them, and Harry approaches her as she, with eyes hinting at forgotten wisdom, stares at him. Inside a dark house, Harry takes a matchbox from Bathilda, lights a candle, a simple yet comforting light in the gloom, and the wizened old woman studies Harry's face, perhaps recognizing the resemblance to Lily, his mother. He captures sight of something over her shoulder as Bathilda turns her attention to Hermione, her expression unreadable. Harry holds up the match beside a framed photograph of the young thief, Gellert Grindelwald, who stole Gregorovitch's Elder Wand, one of the legendary Deathly Hallows. Bathilda gazes at him, then picks up the candle and eases her way past him. Hermione looks anxious as Harry follows Bathilda, leaving Hermione in the filthy living room, a place seemingly untouched since the war. The tip of his wand lights up, a lumos spell illuminating his way up the stairs, while in the living room, the tip of Hermione's wand is also glowing under the influence of her skilled magic. She picks up a book with a note attached to the cover, lifts the note to read the title, \"The Life and Lies of Albus Dumbledore,\" and turns the book over to reveal a moving picture of a smirking Rita Skeeter, notorious for her scandalous reporting. Upstairs, Harry reaches a dingy bedroom where the old woman is waiting for him, and he sees her looking at the locket around his neck, one of Voldemort's Horcruxes. She indicates something across the room as downstairs, Hermione walks into another dark room, her wand as the only source of light, and disturbs a swarm of buzzing flies, likely attracted to some unseen decay. Upstairs, Harry examines a photograph album on a dressing table as the old woman's face contorts, transforming into Nagini, Voldemort's loyal and deadly snake, and she disintegrates when Harry spins around in shock. Downstairs, Hermione spots blood on the ceiling, a gruesome sight as the snake lunges. Harry fends it off with a chair, while downstairs, Hermione trips and falls. The snake hurls itself at Harry, smashing him through a brick wall into a child's bedroom, causing the light on the ceiling to sway, an eerie dance in the chaos. The snake wraps itself around Harry, who picks up a brick from the rubble and smashes the snake's head with it, causing it to slither off him in pain. Harry hauls himself back through the wall as Hermione comes up the stairs, resolute and ready, and the snake attacks again. Hermione flourishes her wand, casting a powerful spell that hits the snake and causing it to fall down the stairs. Harry's wand, dropped in the struggle, is lying at the top of the stairs, waiting to be reclaimed."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Hermione crouches down and taking out her wand draws a circle in the air producing a wreath of white roses. Harry wipes his nose with his sleeve and gazes at the grave. Comforting him Hermione rests her head on his shoulder. then she turns and spots a dark figure watching them from a short distance away. Harry sees an old woman wearing a knitted cape with a hood who turns and totters slowly away. They follow her up the street until Harry slows and stops beside a burnedout roofless house. He looks over the gate at the overgrown garden and recalls Voldemort's attack with both bodies lying on the floor setting Harry's joy. They turn to find the old woman close beside them and Harry approaches her as she stares at him. Inside a dark house Harry takes a matchbox from Bathilda lights a candle and the wizened old woman studies Harry's face. He captures sight of something over her shoulder as Bathilda turns her attention to Hermione. Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand. Bathilda gazes at him then picks up the candle and eases her way past him. Hermione looks anxious as Harry follows Bathilda leaving Hermione in the filthy living room. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. The tip of his wand lights up illuminating his way up the stairs. while in the living room the tip of Hermione's wand is also glowing. She picks up a book with a note attached to the cover lifts the note to read the title and turns the book over to reveal a moving picture of a smirking Rita. Upstairs Harry reaches a dingy bedroom where the old woman is waiting for him and he sees her looking at the locket around his neck. She indicates something across the room as downstairs Hermione walks into another dark room her wand as the only source of light and disturbs a swarm of buzzing flies. Upstairs Harry examines a photograph album on a dressing table as the old woman's face contorts becoming cadaverous and she disintegrates when Harry spins around. Downstairs Hermione spots blood on the ceiling as the snake lunges. Harry fends it off with a chair while downstairs Hermione trips and falls. The snake hurls itself at Harry smashing him through a brick wall into a child's bedroom causing the light on the ceiling to sway. The snake wraps itself around Harry who picks up a brick from the rubble and smashes the snake's head with it causing it to slither off him. Harry hauls himself back through the wall as Hermione comes up the stairs and the snake attacks again. Hermione flourishes her wand hitting the snake and causing it to fall down the stairs. Harry's wand dropped in the struggle is lying at the top of the stairs."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Hermione crouches down and taking out her wand draws a circle in the air producing a wreath of white roses. Harry wipes his nose with his sleeve and gazes at the grave. Comforting him Hermione rests her head on his shoulder. then she turns and spots a dark figure watching them from a short distance away. Harry sees an old woman wearing a knitted cape with a hood who turns and totters slowly away. They follow her up the street until Harry slows and stops beside a burnedout roofless house. He looks over the gate at the overgrown garden and recalls Voldemort's attack with both bodies lying on the floor setting Harry's joy. They turn to find the old woman close beside them and Harry approaches her as she stares at him. Inside a dark house Harry takes a matchbox from Bathilda lights a candle and the wizened old woman studies Harry's face. He captures sight of something over her shoulder as Bathilda turns her attention to Hermione. Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand. Bathilda gazes at him then picks up the candle and eases her way past him. Hermione looks anxious as Harry follows Bathilda leaving Hermione in the filthy living room. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. The tip of his wand lights up illuminating his way up the stairs. while in the living room the tip of Hermione's wand is also glowing. She picks up a book with a note attached to the cover lifts the note to read the title and turns the book over to reveal a moving picture of a smirking Rita. Upstairs Harry reaches a dingy bedroom where the old woman is waiting for him and he sees her looking at the locket around his neck. She indicates something across the room as downstairs Hermione walks into another dark room her wand as the only source of light and disturbs a swarm of buzzing flies. Upstairs Harry examines a photograph album on a dressing table as the old woman's face contorts becoming cadaverous and she disintegrates when Harry spins around. Downstairs Hermione spots blood on the ceiling as the snake lunges. Harry fends it off with a chair while downstairs Hermione trips and falls. The snake hurls itself at Harry smashing him through a brick wall into a child's bedroom causing the light on the ceiling to sway. The snake wraps itself around Harry who picks up a brick from the rubble and smashes the snake's head with it causing it to slither off him. Harry hauls himself back through the wall as Hermione comes up the stairs and the snake attacks again. Hermione flourishes her wand hitting the snake and causing it to fall down the stairs. Harry's wand dropped in the struggle is lying at the top of the stairs."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Hermione crouches down and taking out her wand draws a circle in the air producing a wreath of white roses. Harry wipes his nose with his sleeve and gazes at the grave. Comforting him Hermione rests her head on his shoulder. then she turns and spots a dark figure watching them from a short distance away. Harry sees an old woman wearing a knitted cape with a hood who turns and totters slowly away. They follow her up the street until Harry slows and stops beside a burnedout roofless house. He looks over the gate at the overgrown garden and recalls Voldemort's attack with both bodies lying on the floor setting Harry's joy. Harry fends it off with a chair while downstairs Hermione trips and falls. The snake hurls itself at Harry smashing him through a brick wall into a child's bedroom causing the light on the ceiling to sway. The snake wraps itself around Harry who picks up a brick from the rubble and smashes the snake's head with it causing it to slither off him. Harry hauls himself back through the wall as Hermione comes up the stairs and the snake attacks again. Hermione flourishes her wand hitting the snake and causing it to fall down the stairs. Harry's wand dropped in the struggle is lying at the top of the stairs."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Hermione crouches down and taking out her wand draws a circle in the air producing a wreath of white roses. Harry wipes his nose with his sleeve and gazes at the grave. Comforting him Hermione rests her head on his shoulder. Harry hauls himself back through the wall as Hermione comes up the stairs and the snake attacks again. Hermione flourishes her wand hitting the snake and causing it to fall down the stairs. Harry's wand dropped in the struggle is lying at the top of the stairs."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Luna kneels down and, pulling out her umbrella, paints a square in the sky, conjuring a bouquet of red tulips. Neville cleans his chin with his glove and stares at the fountain. Assuring him, Luna places her hand on his back, then she glances and notices a pale squirrel observing them from a slight distance. Neville notices a young boy wearing a leather jacket with a cap, who turns and ambles quickly away. They trail him through the alley until Neville pauses and stands beside a crumbled, windowless shack. He peers over the fence at the wild meadow and remembers Grindelwald's duel, with both statues resting on the ground, sparking Neville's curiosity. They pivot to discover the young boy right behind them, and Neville steps towards him as he glares at Neville. Inside a dim barn, Neville takes a shoebox from Wilhelmina, ignites a lantern, and the shriveled young boy studies Neville's eyes. He glimpses something behind her as Wilhelmina shifts her glance to Luna. Neville raises the lantern beside a painted portrait of the old knight who lifted Tomesmith's Crystal Sword. Wilhelmina glances at him, then grabs the lantern and slips her way past him. Luna appears worried as Neville trails Wilhelmina, leaving Luna in the grimy kitchen. The end of his pen glows, illuminating his path up the ladder, while in the kitchen, the end of Luna's pen is also shining. She grabs a painting with a leaflet attached to the frame, lifts the leaflet to examine the message, and flips the painting over to show a grinning Percy. Upstairs, Neville arrives at a cluttered parlor where the young boy is waiting for him, and he notices her gazing at the bracelet around his wrist. She gestures at something across the chamber as downstairs, Luna steps into another shadowed den, her pen as the sole source of brightness, and disrupts a cloud of fluttering moths. Upstairs, Neville inspects a scrapbook on a vanity table as the young boy's face twists, becoming skeletal, and she dissolves when Neville twirls around. Downstairs, Luna discovers ink on the curtain as the bat swoops. Neville deflects it with a stool, while downstairs, Luna stumbles and slips. The bat propels itself at Neville, crashing him through a wooden partition into a child's nursery, causing the bulb on the ceiling to sway. The bat coils itself around Neville, who grabs a stick from the debris and bashes the bat's nose with it, causing it to crawl off him. Neville pulls himself back through the partition as Luna arrives up the ladder, and the bat strikes again. Luna waves her pen, hitting the bat and causing it to tumble down the ladder. Neville's pen, dropped in the tussle, is lying at the top of the ladder."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Hermione conjures a wreath of roses with her wand at a gravesite where Harry stands tearfully. A distant figure, an old woman in a knitted cape, catches their attention, leading them to follow her. They stop at a burned-out house where Harry remembers Voldemort's attack. The woman, revealed as Bathilda, guides Harry inside. As he lights a candle, she studies him, leading him to a photograph of a young thief who stole the Elder Wand. Bathilda's demeanor changes as Harry investigates upstairs, while Hermione finds a concerning book with a note. Upstairs, Harry discovers Bathilda transforming grotesquely before she disintegrates. A snake attack unfolds, with Harry using a chair to fend it off. The snake forcibly pushes Harry into another room, where he fights back with a brick. Regaining his footing, he reunites with Hermione, who aids in combating the snake, ultimately sending it tumbling down the stairs. Harry's wand rests at the top of the stairs, dropped during the chaos."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Harry's wand dropped in the struggle is lying at the top of the stairs Hermione flourishes her wand hitting the snake and causing it to fall down the stairs  Harry hauls himself back through the wall as Hermione comes up the stairs and the snake attacks again  The snake wraps itself around Harry who picks up a brick from the rubble and smashes the snake's head with it causing it to slither off him  The snake hurls itself at Harry smashing him through a brick wall into a child's bedroom causing the light on the ceiling to sway  Harry fends it off with a chair while downstairs Hermione trips and falls  Downstairs Hermione spots blood on the ceiling as the snake lunges  Upstairs Harry examines a photograph album on a dressing table as the old woman's face contorts becoming cadaverous and she disintegrates when Harry spins around  She indicates something across the room as downstairs Hermione walks into another dark room her wand as the only source of light and disturbs a swarm of buzzing flies  Upstairs Harry reaches a dingy bedroom where the old woman is waiting for him and he sees her looking at the locket around his neck  She picks up a book with a note attached to the cover lifts the note to read the title and turns the book over to reveal a moving picture of a smirking Rita  while in the living room the tip of Hermione's wand is also glowing  The tip of his wand lights up illuminating his way up the stairs  Hermione looks anxious as Harry follows Bathilda leaving Hermione in the filthy living room  Bathilda gazes at him then picks up the candle and eases her way past him  Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand  He captures sight of something over her shoulder as Bathilda turns her attention to Hermione  Inside a dark house Harry takes a matchbox from Bathilda lights a candle and the wizened old woman studies Harry's face  They turn to find the old woman close beside them and Harry approaches her as she stares at him  He looks over the gate at the overgrown garden and recalls Voldemort's attack with both bodies lying on the floor setting Harry's joy  They follow her up the street until Harry slows and stops beside a burnedout roofless house  Harry sees an old woman wearing a knitted cape with a hood who turns and totters slowly away  then she turns and spots a dark figure watching them from a short distance away  Comforting him Hermione rests her head on his shoulder  Harry wipes his nose with his sleeve and gazes at the grave  Hermione crouches down and taking out her wand draws a circle in the air producing a wreath of white roses "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Harry wipes his nose with his sleeve and gazes at the grave Hermione crouches down and taking out her wand draws a circle in the air producing a wreath of white roses then she turns and spots a dark figure watching them from a short distance away Comforting him Hermione rests her head on his shoulder They follow her up the street until Harry slows and stops beside a burnedout roofless house Harry sees an old woman wearing a knitted cape with a hood who turns and totters slowly away They turn to find the old woman close beside them and Harry approaches her as she stares at him He looks over the gate at the overgrown garden and recalls Voldemort's attack with both bodies lying on the floor setting Harry's joy He captures sight of something over her shoulder as Bathilda turns her attention to Hermione Inside a dark house Harry takes a matchbox from Bathilda lights a candle and the wizened old woman studies Harry's face Bathilda gazes at him then picks up the candle and eases her way past him Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand The tip of his wand lights up illuminating his way up the stairs Hermione looks anxious as Harry follows Bathilda leaving Hermione in the filthy living room She picks up a book with a note attached to the cover lifts the note to read the title and turns the book over to reveal a moving picture of a smirking Rita while in the living room the tip of Hermione's wand is also glowing She indicates something across the room as downstairs Hermione walks into another dark room her wand as the only source of light and disturbs a swarm of buzzing flies Upstairs Harry reaches a dingy bedroom where the old woman is waiting for him and he sees her looking at the locket around his neck Downstairs Hermione spots blood on the ceiling as the snake lunges Upstairs Harry examines a photograph album on a dressing table as the old woman's face contorts becoming cadaverous and she disintegrates when Harry spins around The snake hurls itself at Harry smashing him through a brick wall into a child's bedroom causing the light on the ceiling to sway Harry fends it off with a chair while downstairs Hermione trips and falls Harry hauls himself back through the wall as Hermione comes up the stairs and the snake attacks again The snake wraps itself around Harry who picks up a brick from the rubble and smashes the snake's head with it causing it to slither off him Harry's wand dropped in the struggle is lying at the top of the stairs Hermione flourishes her wand hitting the snake and causing it to fall down the stairs"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The tip of his wand lights up illuminating his way up the stairs  while in the living room the tip of Hermione's wand is also glowing  She picks up a book with a note attached to the cover lifts the note to read the title and turns the book over to reveal a moving picture of a smirking Rita  Upstairs Harry reaches a dingy bedroom where the old woman is waiting for him and he sees her looking at the locket around his neck  She indicates something across the room as downstairs Hermione walks into another dark room her wand as the only source of light and disturbs a swarm of buzzing flies  Upstairs Harry examines a photograph album on a dressing table as the old woman's face contorts becoming cadaverous and she disintegrates when Harry spins around  Downstairs Hermione spots blood on the ceiling as the snake lunges  Harry fends it off with a chair while downstairs Hermione trips and falls  The snake hurls itself at Harry smashing him through a brick wall into a child's bedroom causing the light on the ceiling to sway  The snake wraps itself around Harry who picks up a brick from the rubble and smashes the snake's head with it causing it to slither off him  Harry hauls himself back through the wall as Hermione comes up the stairs and the snake attacks again  Hermione flourishes her wand hitting the snake and causing it to fall down the stairs  Harry's wand dropped in the struggle is lying at the top of the stairs Hermione crouches down and taking out her wand draws a circle in the air producing a wreath of white roses  Harry wipes his nose with his sleeve and gazes at the grave  Comforting him Hermione rests her head on his shoulder  then she turns and spots a dark figure watching them from a short distance away  Harry sees an old woman wearing a knitted cape with a hood who turns and totters slowly away  They follow her up the street until Harry slows and stops beside a burnedout roofless house  He looks over the gate at the overgrown garden and recalls Voldemort's attack with both bodies lying on the floor setting Harry's joy  They turn to find the old woman close beside them and Harry approaches her as she stares at him  Inside a dark house Harry takes a matchbox from Bathilda lights a candle and the wizened old woman studies Harry's face  He captures sight of something over her shoulder as Bathilda turns her attention to Hermione  Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand  Bathilda gazes at him then picks up the candle and eases her way past him  Hermione looks anxious as Harry follows Bathilda leaving Hermione in the filthy living room "
        }
      ]
    }
  ]
}