{
  "ground_truth": "He wrestles with the chain as it drags him back, and choking, pressed up against the ice, Harry can't find the opening where he entered the water. He hammers with his hands on the underside of the ice and kicks at it with his bare feet as a shadowy figure walks over the ice above him. Harry's movements slow, and his eyes close as the figure enters the water behind him. A hand grabs the sword, and Harry is hauled across the ice. He's leant against a fallen tree as the figure moves away still clutching the sword. Harry leans forward and grabs his glasses, and he sees Ron. Harry sets the locket on the fallen tree. Drenched, Ron stares awkwardly at Harry, then looks at the ground. Ron prepares himself, and the locket springs open, knocking Harry and Ron to the ground as a huge black cloud swirls over Ron and a swarm of spiders appears. Ghostly images of Harry and Hermione speak to Ron, and he sees naked images of Hermione and Harry kissing passionately. Ron seethes as he watches them, and with the sword in both hands, Ron races towards Harry, who cowers. Ron strikes the locket with the Sword of Gryffindor, and the black cloud and the images disappear. Harry stares at the open locket as Ron is on his knees and lets go of the sword. Harry sits on the ground beside him. Hermione wakes and comes out of the tent as Harry approaches. He indicates Ron and smiles, and Ron grins broadly. Hermione glares, stomps over, and wrenches the rucksack from Ron's shoulder, then turns back to Ron, who holds up the open locket. He glances at Harry, blinks, and looks away. Scruffy and bedraggled, Ron gives Hermione a faint smile, and she faces him with her arms folded and a set expression on her face. In the tent, Ron and Harry are watching a flame in a jar while Hermione sits outside. He gazes at the flickering flame, Harry takes it, and the flame flares and dies. She ignores Ron, rushing past him to address Harry and shows him Rita's book as Ron stands shoulder to shoulder with Hermione. He puts up his hand, and she glances at Harry, raising her eyebrows, and walks off, leaving Ron crestfallen as he lowers his hand. A vast expanse of open heath land stretches out with hills in the distance, and Ron trudges ahead of Hermione and Harry. A crooked house stands alone, with plums floating in the air like orange balloons. The top half of the door opens, and Xenophilius peers out as Harry moves towards the door. Inside, they sit in a cluttered room, each holding a mug, and all four raise their mugs and drink in unison. Xenophilius holds up the pendant, and Harry glances blankly at his friends, then back to Luna's father.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He grapples with the chain as it pulls him back, and suffocating, pressed up against the ice, Harry can't locate the gap where he entered the water. He pounds with his hands on the underside of the ice and strikes at it with his bare feet as a shadowy figure strides over the ice above him. Harry's actions slow, and his eyes shut as the figure enters the water behind him. A hand seizes the sword, and Harry is dragged across the ice. He's leaned against a fallen tree as the figure moves away still holding the sword. Harry bends forward and snatches his spectacles, and he sees Ron. Harry places the locket on the fallen tree. Soaked, Ron gazes awkwardly at Harry, then looks at the ground. Ron braces himself, and the locket springs open, knocking Harry and Ron to the ground as a massive black cloud swirls over Ron and a horde of spiders appears. Spectral images of Harry and Hermione speak to Ron, and he sees unclothed images of Hermione and Harry kissing passionately. Ron fumes as he observes them, and with the sword in both hands, Ron rushes towards Harry, who recoils. Ron strikes the locket with the Sword of Gryffindor, and the black cloud and the images vanish. Harry gazes at the open locket as Ron is on his knees and releases the sword. Harry sits on the ground beside him. Hermione awakens and exits the tent as Harry approaches. He gestures toward Ron and smiles, and Ron grins broadly. Hermione scowls, stomps over, and yanks the rucksack from Ron's shoulder, then turns back to Ron, who holds up the open locket. He glances at Harry, blinks, and looks away. Shabby and unkempt, Ron gives Hermione a faint smile, and she faces him with her arms crossed and a fixed expression on her face. In the tent, Ron and Harry are watching a flame in a jar while Hermione sits outside. He gazes at the flickering flame, Harry takes it, and the flame flares and extinguishes. She disregards Ron, rushing past him to address Harry and shows him Rita's book as Ron stands shoulder to shoulder with Hermione. He raises his hand, and she glances at Harry, raising her eyebrows, and walks off, leaving Ron dejected as he lowers his hand. A vast expanse of open heath land stretches out with hills in the distance, and Ron trudges ahead of Hermione and Harry. A crooked house stands alone, with plums floating in the air like orange balloons. The top half of the door opens, and Xenophilius peers out as Harry moves towards the door. Inside, they sit in a cluttered room, each holding a mug, and all four lift their mugs and drink in unison. Xenophilius holds up the pendant, and Harry glances blankly at his companions, then back to Luna's father."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The chain is wrestled with by him as he is dragged back, and choking, pressed up against the ice, the opening where he entered the water can't be found by Harry. The underside of the ice is hammered by him with his hands, and it is kicked at with his bare feet as a shadowy figure walks over the ice above him. Harry's movements are slowed, and his eyes are closed as the figure enters the water behind him. The sword is grabbed by a hand, and Harry is hauled across the ice. He leans against a fallen tree as the figure moves away, clutching the sword still. His glasses are grabbed by Harry as he leans forward, and Ron is seen by him. The locket is set on the fallen tree by Harry. Drenched, Ron awkwardly stares at Harry, then the ground is looked at by him. He prepares himself, and the locket springs open, knocking Harry and Ron to the ground as a huge black cloud swirls over Ron, and a swarm of spiders appears. Ghostly images of Harry and Hermione speak to Ron, and naked images of Hermione and Harry kissing passionately are seen by him. He seethes as they are watched by him, and with the sword in both hands, Ron races towards Harry, who cowers. The locket is struck by Ron with the Sword of Gryffindor, and the black cloud and the images disappear. The open locket is stared at by Harry as Ron is on his knees and the sword is let go of by him. Sitting on the ground beside him is Harry. Hermione wakes and comes out of the tent as Harry approaches. Ron is indicated by him, and he smiles, and a broad grin is sported by Ron. The rucksack is wrenched from Ron's shoulder by Hermione as she glares, stomps over, then she turns back to Ron, who holds up the open locket. Harry is glanced at by him, he blinks, and looks away. Scruffy and bedraggled, Ron faintly smiles at Hermione, and she faces him with folded arms and a set expression on her face. In the tent, a flame in a jar is watched by Ron and Harry while outside sits Hermione. The flickering flame is gazed at by him, and the flame is taken by Harry, flaring and dying. Ignoring Ron, she rushes past him to address Harry and shows him Rita's book as shoulder to shoulder stands Ron with Hermione. His hand is put up by him, and she glances at Harry, raises her eyebrows, and walks off, leaving him crestfallen as his hand is lowered. A vast expanse of open heath land is stretched out with hills in the distance, and ahead trudges Ron of Hermione and Harry. A crooked house stands alone, with plums floating in the air like orange balloons. The top half of the door is opened, and out peers Xenophilius as the door is approached by Harry. Inside, they sit in a cluttered room, each holding a mug, and in unison, all four raise their mugs and drink. The pendant is held up by Xenophilius, and his friends are glanced at blankly by Harry, then Luna's father is looked back at by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Struggling with the chain pulling him back, Harry can't find the opening in the ice. He pounds and kicks at the ice as a shadowy figure walks above. Harry's movements slow, and his eyes close as the figure enters the water and pulls him out. Leaning against a tree, Harry sees Ron, who awkwardly stares at him. Harry places the locket on the tree, and it springs open, knocking them down as a black cloud and spiders appear. Ghostly images of Harry and Hermione taunt Ron, who seethes and races toward Harry. Ron strikes the locket with the Sword of Gryffindor, making the cloud and images vanish. Harry and Ron sit together as Hermione emerges from the tent. She glares, grabs Ron's rucksack, and turns back to him, who holds the open locket. Scruffy, Ron gives Hermione a faint smile, but she remains stern. In the tent, Ron and Harry watch a flame in a jar while Hermione sits outside. She shows Harry Rita's book, ignoring Ron, who stands beside her. Ron raises his hand, but Hermione walks off, leaving him crestfallen. On a vast heath, Ron trudges ahead of Hermione and Harry. A crooked house stands alone, with floating plums. Xenophilius peers out as Harry approaches. Inside, they sit in a cluttered room, raise their mugs, and drink. Xenophilius holds up a pendant, and Harry glances at his friends, then back to Luna's father."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Struggling with the chain, Harry is dragged back and can't find the water's opening. He pounds the ice with his hands and feet as a shadowy figure walks above. Harry slows, eyes closing, as the figure enters the water and pulls him out. Leaning against a tree, Harry sees Ron. Harry places the locket on the tree. Drenched, Ron awkwardly stares at Harry, then prepares as the locket opens, knocking them down. A black cloud and spiders appear, with ghostly images of Harry and Hermione kissing. Enraged, Ron charges and strikes the locket with the Sword of Gryffindor, making the images vanish. Harry and Ron sit together. Hermione exits the tent, sees Ron, and glares. She grabs the rucksack from him, who shows the open locket. Ron smiles faintly at Hermione, who stands with folded arms. In the tent, Ron and Harry watch a flame in a jar. Hermione rushes past Ron to show Harry a book, leaving Ron crestfallen. On open heath land, Ron walks ahead of Hermione and Harry. A crooked house appears, with floating plums. Xenophilius peers out as Harry approaches. Inside, they sit in a cluttered room, raising mugs in unison. Xenophilius holds a pendant, and Harry glances at his friends, then back at Luna's father."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He struggles intensely with the heavy chain as it relentlessly pulls him backward, and, gasping for air, pressed tightly against the unforgiving ice, Harry is unable to locate the opening through which he initially entered the frigid water. Desperately, he pounds with his hands on the underside of the ice and kicks at it with his bare feet, all while a shadowy figure ominously walks over the ice above him. Gradually, Harry's frantic movements slow, and his eyes begin to close as the mysterious figure enters the water behind him. A hand reaches out and grabs the sword, and Harry is dragged across the ice. He is propped up against a fallen tree as the figure moves away, still holding the sword firmly. Harry leans forward to retrieve his glasses, and he sees Ron standing there. Harry places the locket on the fallen tree. Soaked to the skin, Ron stares awkwardly at Harry, then averts his gaze to the ground. Ron steels himself, and the locket suddenly springs open, knocking both Harry and Ron to the ground as a massive black cloud swirls menacingly over Ron, and a swarm of spiders appears. Ethereal images of Harry and Hermione speak to Ron, and he envisions naked images of Hermione and Harry kissing passionately. Ron seethes with anger as he watches them, and with the sword gripped tightly in both hands, Ron charges towards Harry, who cowers in fear. Ron strikes the locket forcefully with the Sword of Gryffindor, and the black cloud along with the haunting images vanish. Harry stares intently at the now open locket as Ron, on his knees, releases his grip on the sword. Harry sits down on the ground beside him. Hermione awakens and emerges from the tent as Harry approaches. He gestures towards Ron and smiles, and Ron grins broadly in response. Hermione glares, stomps over, and yanks the rucksack from Ron's shoulder, then turns back to Ron, who holds up the open locket. He glances at Harry, blinks, and looks away. Disheveled and bedraggled, Ron offers Hermione a faint smile, and she faces him with her arms crossed and a determined expression on her face. Inside the tent, Ron and Harry are watching a flame flicker in a jar while Hermione sits outside. As he gazes at the flickering flame, Harry takes it, and the flame flares up briefly before dying out. She ignores Ron, rushing past him to speak to Harry and shows him Rita's book as Ron stands shoulder to shoulder with Hermione. He raises his hand, and she glances at Harry, raising her eyebrows, and walks off, leaving Ron feeling dejected as he lowers his hand. A vast expanse of open heathland stretches out with rolling hills in the distance, and Ron trudges ahead of Hermione and Harry. A crooked house stands alone, with plums floating in the air like orange balloons. The top half of the door opens, and Xenophilius peers out as Harry moves towards the door. Inside, they sit in a cluttered room, each holding a mug, and all four raise their mugs and drink in unison. Xenophilius holds up the pendant, and Harry glances blankly at his friends, then back to Luna's father."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Harry struggles with all his might as the heavy chain exerts a relentless pull on him, dragging him backward with an unyielding force. Gasping desperately for air, he finds himself pressed tightly against the cold, unforgiving surface of the ice. In his panic, he cannot locate the opening through which he originally entered the frigid, icy water. With increasing desperation, he pounds his fists against the underside of the ice, kicking at it furiously with his bare feet. Meanwhile, above him, a shadowy figure ominously walks on the ice. Gradually, Harry's frantic movements begin to slow, and his eyes start to close as the mysterious figure enters the water behind him. A hand reaches out and seizes the sword, dragging Harry across the ice. He is propped up against a fallen tree while the figure moves away, firmly holding the sword. Harry leans forward, retrieving his glasses, and sees Ron standing there. He places the locket on the fallen tree. Soaked to the bone, Ron stares at Harry awkwardly and then looks down at the ground. Ron steels himself as the locket suddenly springs open, throwing both Harry and Ron to the ground. A massive black cloud swirls menacingly above Ron, releasing a swarm of spiders. Ethereal images of Harry and Hermione speak hauntingly to Ron, and he envisions disturbing, naked images of Hermione and Harry passionately kissing. Anger seethes within Ron as he watches these visions, and with the sword gripped tightly in both hands, he charges towards Harry, who cowers in fear. With all his strength, Ron strikes the locket forcefully using the Sword of Gryffindor, causing the black cloud and the haunting images to vanish completely. Harry stares intently at the now open locket as Ron, kneeling, loosens his grip on the sword. Harry then sits down on the ground beside him. Hermione awakens and emerges from the tent as Harry approaches, gesturing toward Ron with a smile. Ron grins broadly in response. Hermione, however, glares at Ron, stomping over to yank the rucksack from his shoulder. Turning back to Ron, who holds up the open locket, she crosses her arms with a determined look. Disheveled and bedraggled, Ron offers Hermione a faint smile, but she responds with a stern expression. Inside the tent, Ron and Harry watch a flame flicker inside a jar, while outside, Hermione sits alone. As Harry gazes at the flickering flame, it flares up briefly in his hand before dying out. Ignoring Ron, Hermione rushes past him to speak with Harry, showing him Rita's book, while Ron stands shoulder to shoulder with her. Raising his hand in acknowledgment, she glances at Harry, raises her eyebrows, and walks away, leaving Ron feeling dejected as he lowers his hand. A vast expanse of open heathland stretches out before them, with rolling hills visible in the distance, as Ron trudges ahead of Hermione and Harry. A solitary crooked house stands alone, with plums floating in the air, resembling orange balloons. The top half of the door opens, and Xenophilius peers out as Harry moves toward it. Inside, they settle in a cluttered room, each holding a mug. In unison, the four of them raise their mugs and drink. Xenophilius holds up a pendant, prompting Harry to glance blankly at his friends and then back to Luna's father."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He struggles intensely with the chain that relentlessly pulls him backward, and as he gasps for air, pressed tightly against the unforgiving ice, Harry desperately searches for the opening through which he initially entered the frigid water. He frantically pounds with his hands on the underside of the ice and kicks at it with his bare feet, all while a shadowy figure ominously walks across the ice above him. Gradually, Harry's frantic movements slow, and his eyes begin to close as the figure silently slips into the water behind him. Suddenly, a hand reaches out and firmly grasps the sword, and Harry is swiftly dragged across the ice. He is propped up against a fallen tree as the figure retreats, still holding the sword tightly. Harry leans forward, reaching out to retrieve his glasses, and upon putting them on, he sees Ron standing there. Harry carefully places the locket on the fallen tree. Soaked to the skin, Ron stands awkwardly, staring at Harry before averting his gaze to the ground. Ron steels himself for what is to come, and the locket bursts open, sending both Harry and Ron tumbling to the ground as a massive black cloud swirls ominously over Ron, and a swarm of spiders materializes. Ghostly apparitions of Harry and Hermione taunt Ron, and he is tormented by visions of Hermione and Harry kissing passionately, both of them unclothed. Consumed by anger, Ron watches them, and with the sword gripped firmly in both hands, he charges towards Harry, who recoils in fear. Ron brings the Sword of Gryffindor down upon the locket, and with a decisive strike, the black cloud and haunting images vanish. Harry gazes intently at the now-open locket as Ron, on his knees, releases his hold on the sword. Harry then sits down on the ground beside him. Meanwhile, Hermione awakens and emerges from the tent as Harry approaches her. He gestures towards Ron with a smile, and Ron responds with a broad grin. Hermione, however, glares at Ron, stomps over to him, and forcefully yanks the rucksack from his shoulder before turning back to face him. Ron holds up the open locket, glancing at Harry, blinking, and then looking away. Disheveled and weary, Ron offers Hermione a faint smile, but she stands before him with her arms crossed and a resolute expression on her face. Inside the tent, Ron and Harry sit together, watching a flame flicker inside a jar while Hermione remains outside. Ron gazes at the dancing flame, and as Harry takes it, the flame flares up briefly before extinguishing. Hermione pointedly ignores Ron, rushing past him to speak with Harry, showing him Rita's book while Ron stands beside her, shoulder to shoulder. He raises his hand in a gesture, but she merely glances at Harry, raises her eyebrows, and walks away, leaving Ron feeling dejected as he lowers his hand. A vast expanse of open heathland stretches out before them, with hills visible in the distance, and Ron trudges ahead of Hermione and Harry. A crooked house stands alone, with plums floating in the air like orange balloons. The top half of the door swings open, and Xenophilius peers out as Harry approaches the door. Once inside, they find themselves seated in a cluttered room, each holding a mug, and all four raise their mugs and drink in unison. Xenophilius holds up the pendant, and Harry glances blankly at his friends before turning his gaze back to Luna's father."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Harry struggles against the chain pulling him back and, unable to find the opening in the ice, pounds on it with his hands and feet. As a shadowy figure walks above, Harry's movements slow, and he loses consciousness. The figure enters the water, grabs the sword, and drags Harry across the ice, propping him against a fallen tree. Harry retrieves his glasses and sees Ron, who awkwardly stares at him. Harry places the locket on the tree, and Ron, preparing himself, watches as the locket opens, releasing a black cloud and spiders. Ghostly images of Harry and Hermione taunt Ron, who, in anger, charges and strikes the locket with the Sword of Gryffindor, dispelling the images. Harry and Ron sit together, and Hermione emerges from the tent. Harry gestures to Ron with a smile, and Ron grins back. Hermione, glaring, snatches the rucksack from Ron and confronts him as he shows her the open locket. Inside the tent, Ron and Harry watch a flame in a jar while Hermione sits outside. She rushes past Ron to show Harry Rita's book, leaving Ron dejected. Later, Ron, Hermione, and Harry traverse a vast heath, with Ron leading. They approach a crooked house with floating plums, and Xenophilius opens the door as Harry approaches. Inside, they sit in a cluttered room, raise their mugs in unison, and drink. Xenophilius holds up a pendant, and Harry exchanges glances with his friends before looking back at Luna's father."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He wrestles with the chain, an ancient magical device enchanted by dark spells, as it drags him back, and choking, pressed up against the ice, Harry can't find the opening where he entered the water in the frozen lake of the Forbidden Forest, notorious for its treacherous conditions. He hammers with his hands on the underside of the ice and kicks at it with his bare feet as a shadowy figure, barely visible in the dim light, walks over the ice above him. Harry's movements slow, and his eyes close as the figure, who is actually Ron, enters the water behind him. A hand, familiar and reassuring, grabs the sword, and Harry is hauled across the ice. He's leant against a fallen tree as the figure moves away still clutching the sword known as the Sword of Gryffindor, a legendary weapon once wielded by Godric Gryffindor himself. Harry leans forward and grabs his glasses, his only link to clarity, and he sees Ron. Harry sets the locket, one of Voldemort's Horcruxes, on the fallen tree. Drenched, Ron stares awkwardly at Harry, then looks at the ground, ashamed of his earlier departure in frustration. Ron prepares himself, and the locket springs open, knocking Harry and Ron to the ground as a huge black cloud emerges, filled with dark enchantments, swirls over Ron and a swarm of spiders, his greatest fear, appears. Ghostly images of Harry and Hermione, magically conjured to taunt and provoke, speak to Ron, and he sees naked images of Hermione and Harry kissing passionately, an illusion meant to manipulate his insecurities. Ron seethes as he watches them, and with the sword in both hands, Ron races towards Harry, who cowers. Ron strikes the locket with the Sword of Gryffindor, which has the power to destroy Horcruxes, and the black cloud and the images disappear. Harry stares at the open locket as Ron is on his knees and lets go of the sword, overwhelmed by emotion. Harry sits on the ground beside him. Hermione wakes and comes out of the tent, a magically expanded shelter, as Harry approaches. He indicates Ron and smiles, and Ron grins broadly. Hermione glares, stomps over, and wrenches the rucksack, filled with their essential supplies, from Ron's shoulder, then turns back to Ron, who holds up the open locket. He glances at Harry, blinks, and looks away. Scruffy and bedraggled, Ron gives Hermione a faint smile, and she faces him with her arms folded and a set expression on her face. In the tent, Ron and Harry are watching a flame in a jar, a magical source of heat and light, while Hermione sits outside. He gazes at the flickering flame, Harry takes it, and the flame flares and dies. She ignores Ron, rushing past him to address Harry and shows him Rita's book, a tell-all biography filled with scandalous and often exaggerated stories, as Ron stands shoulder to shoulder with Hermione. He puts up his hand, a silent gesture of reconciliation, and she glances at Harry, raising her eyebrows, and walks off, leaving Ron crestfallen as he lowers his hand. A vast expanse of open heath land stretches out with hills in the distance, and Ron trudges ahead of Hermione and Harry. A crooked house, known as the Lovegood residence, stands alone, with plums floating in the air like orange balloons, a sign of the unique magic practiced by its residents. The top half of the door opens, and Xenophilius, Luna's eccentric father, peers out as Harry moves towards the door. Inside, they sit in a cluttered room filled with odd magical artifacts, each holding a mug, and all four raise their mugs and drink in unison, a gesture of hospitality. Xenophilius holds up the pendant, a symbol of the Deathly Hallows, and Harry glances blankly at his friends, then back to Luna's father, trying to understand its significance."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He wrestles with the chain as it drags him back and choking pressed up against the ice  as a shadowy figure walks over the ice above him  Harry's movements slow and his eyes close as the figure enters the water behind him  A hand grabs the sword and Harry is hauled across the ice  He's leant against a fallen tree as the figure moves away still clutching the sword  Harry leans forward and grabs his glasses and he sees Ron  Harry sets the locket on the fallen tree  Drenched Ron stares awkwardly at Harry then looks at the ground  Ron prepares himself and the locket springs open knocking Harry and Ron to the ground as a huge black cloud swirls over Ron and a swarm of spiders appears  Ghostly images of Harry and Hermione speak to Ron and he sees naked images of Hermione and Harry kissing passionately  Ron seethes as he watches them and with the sword in both hands Ron races towards Harry who cowers  Ron strikes the locket with the Sword of Gryffindor and the black cloud and the images disappear  Harry stares at the open locket as Ron is on his knees and lets go of the sword  Harry sits on the ground beside him  Hermione wakes and comes out of the tent as Harry approaches  He indicates Ron and smiles and Ron grins broadly  Hermione glares stomps over and wrenches the rucksack from Ron's shoulder then turns back to Ron who holds up the open locket  Harry can't find the opening where he entered the water  He hammers with his hands on the underside of the ice and kicks at it with his bare feet  as a shadowy figure walks over the ice above him  Harry's movements slow and his eyes close as the figure enters the water behind him  A hand grabs the sword and Harry is hauled across the ice  He's leant against a fallen tree as the figure moves away still clutching the sword  Harry leans forward and grabs his glasses and he sees Ron  Harry sets the locket on the fallen tree  Drenched Ron stares awkwardly at Harry then looks at the ground  Ron prepares himself and the locket springs open knocking Harry and Ron to the ground as a huge black cloud swirls over Ron and a swarm of spiders appears  Ghostly images of Harry and Hermione speak to Ron and he sees naked images of Hermione and Harry kissing passionately  Ron seethes as he watches them and with the sword in both hands Ron races towards Harry who cowers  Ron strikes the locket with the Sword of Gryffindor and the black cloud and the images disappear  Harry stares at the open locket as Ron is on his knees and lets go of the sword  Harry sits on the ground beside him  Hermione wakes and comes out of the tent as Harry approaches  He indicates Ron and smiles and Ron grins broadly  Hermione glares stomps over and wrenches the rucksack from Ron's shoulder then turns back to Ron who holds up the open locket  He glances at Harry blinks and looks away  Scruffy and bedraggled  Ron gives Hermione a faint smile and she faces him with her arms folded and a set expression on her face  In the tent Ron and Harry are watching a flame in a jar while Hermione sits outside  He gazes at the flickering flame  Harry takes it and the flame flares and dies  She ignores Ron rushing past him to address Harry and shows him Rita's book as Ron stands shoulder to shoulder with Hermione  He puts up his hand and she glances at Harry raising her eyebrows and walks off leaving Ron crestfallen as he lowers his hand  A vast expanse of open heath land stretches out with hills in the distance and Ron trudges ahead of Hermione and Harry  A crooked house stands alone with plums floating in the air like orange balloons  The top half of the door opens and Xenophilius peers out as Harry moves towards the door  Inside they sit in a cluttered room each holding a mug and all four raise their mugs and drink in unison  Xenophilius holds up the pendant and Harry glances blankly at his friends then back to Luna's father"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He wrestles with the chain as it drags him back and choking pressed up against the ice. Harry cannot find the opening where he entered the water. He hammers with his hands on the underside of the ice and kicks at it with his bare feet. as a shadowy figure walks over the ice above him. Harry's movements slow and his eyes close as the figure enters the water behind him. A hand grabs the sword and Harry is hauled across the ice. He is leant against a fallen tree as the figure moves away still clutching the sword. Harry leans forward and grabs his glasses and he sees Ron. Harry sets the locket on the fallen tree. Drenched. Ron stares awkwardly at Harry then looks at the ground. Ron prepares himself and the locket springs open knocking Harry and Ron to the ground as a huge black cloud swirls over Ron and a swarm of spiders appears. Ghostly images of Harry and Hermione speak to Ron and he sees naked images of Hermione and Harry kissing passionately. Ron seethes as he watches them and with the sword in both hands Ron races towards Harry who cowers. Ron strikes the locket with the Sword of Gryffindor and the black cloud and the images disappear. Harry stares at the open locket as Ron is on his knees and let us go of the sword. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Harry sits on the ground beside him. Hermione wakes and comes out of the tent as Harry approaches. He indicates Ron and smiles and Ron grins broadly. Hermione glares stomps over and wrenches the rucksack from Ron's shoulder then turns back to Ron who holds up the open locket. He glances at Harry blinks and looks away. Scruffy and bedraggled. Ron gives Hermione a faint smile and she faces him with her arms folded and a set expression on her face. In the tent Ron and Harry are watching a flame in a jar while Hermione sits outside. He gazes at the flickering flame. Harry takes it and the flame flares and dies. She ignores Ron rushing past him to address Harry and shows him Rita's book as Ron stands shoulder to shoulder with Hermione. He puts up his hand and she glances at Harry raising her eyebrows and walks off leaving Ron crestfallen as he lowers his hand. A vast expanse of open heath land stretches out with hills in the distance and Ron trudges ahead of Hermione and Harry. A crooked house stands alone with plums floating in the air like orange balloons. The top half of the door opens and Xenophilius peers out as Harry moves towards the door. Inside they sit in a cluttered room each holding a mug and all four raise their mugs and drink in unison. Xenophilius holds up the pendant and Harry glances blankly at his friends then back to Luna's father."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He wrestles with the chain as it drags him back and choking pressed up against the ice. Harry cannot find the opening where he entered the water. He hammers with his hands on the underside of the ice and kicks at it with his bare feet. as a shadowy figure walks over the ice above him. Harry's movements slow and his eyes close as the figure enters the water behind him. A hand grabs the sword and Harry is hauled across the ice. He is leant against a fallen tree as the figure moves away still clutching the sword. Harry leans forward and grabs his glasses and he sees Ron. Harry sets the locket on the fallen tree. Drenched. Ron stares awkwardly at Harry then looks at the ground. Ron prepares himself and the locket springs open knocking Harry and Ron to the ground as a huge black cloud swirls over Ron and a swarm of spiders appears. Ghostly images of Harry and Hermione speak to Ron and he sees naked images of Hermione and Harry kissing passionately. Ron seethes as he watches them and with the sword in both hands Ron races towards Harry who cowers. Ron strikes the locket with the Sword of Gryffindor and the black cloud and the images disappear. Harry stares at the open locket as Ron is on his knees and let us go of the sword. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. Harry sits on the ground beside him. Hermione wakes and comes out of the tent as Harry approaches. He indicates Ron and smiles and Ron grins broadly. Hermione glares stomps over and wrenches the rucksack from Ron's shoulder then turns back to Ron who holds up the open locket. He glances at Harry blinks and looks away. Scruffy and bedraggled. Ron gives Hermione a faint smile and she faces him with her arms folded and a set expression on her face. In the tent Ron and Harry are watching a flame in a jar while Hermione sits outside. He gazes at the flickering flame. Harry takes it and the flame flares and dies. She ignores Ron rushing past him to address Harry and shows him Rita's book as Ron stands shoulder to shoulder with Hermione. He puts up his hand and she glances at Harry raising her eyebrows and walks off leaving Ron crestfallen as he lowers his hand. A vast expanse of open heath land stretches out with hills in the distance and Ron trudges ahead of Hermione and Harry. A crooked house stands alone with plums floating in the air like orange balloons. The top half of the door opens and Xenophilius peers out as Harry moves towards the door. Inside they sit in a cluttered room each holding a mug and all four raise their mugs and drink in unison. Xenophilius holds up the pendant and Harry glances blankly at his friends then back to Luna's father."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He wrestles with the chain as it drags him back and choking pressed up against the ice. Harry cannot find the opening where he entered the water. He hammers with his hands on the underside of the ice and kicks at it with his bare feet. as a shadowy figure walks over the ice above him. Harry's movements slow and his eyes close as the figure enters the water behind him. A hand grabs the sword and Harry is hauled across the ice. He is leant against a fallen tree as the figure moves away still clutching the sword. Harry leans forward and grabs his glasses and he sees Ron. He gazes at the flickering flame. Harry takes it and the flame flares and dies. She ignores Ron rushing past him to address Harry and shows him Rita's book as Ron stands shoulder to shoulder with Hermione. He puts up his hand and she glances at Harry raising her eyebrows and walks off leaving Ron crestfallen as he lowers his hand. A vast expanse of open heath land stretches out with hills in the distance and Ron trudges ahead of Hermione and Harry. A crooked house stands alone with plums floating in the air like orange balloons. The top half of the door opens and Xenophilius peers out as Harry moves towards the door. Inside they sit in a cluttered room each holding a mug and all four raise their mugs and drink in unison. Xenophilius holds up the pendant and Harry glances blankly at his friends then back to Luna's father."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He wrestles with the chain as it drags him back and choking pressed up against the ice. Harry cannot find the opening where he entered the water. He hammers with his hands on the underside of the ice and kicks at it with his bare feet. A crooked house stands alone with plums floating in the air like orange balloons. The top half of the door opens and Xenophilius peers out as Harry moves towards the door. Inside they sit in a cluttered room each holding a mug and all four raise their mugs and drink in unison. Xenophilius holds up the pendant and Harry glances blankly at his friends then back to Luna's father."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "She wrestles with the chain as it drags her back, and choking, pressed up against the ice, Emily can't find the opening where she entered the water. She hammers with her hands on the underside of the ice and kicks at it with her bare feet as a shadowy figure walks over the ice above her. Emily's movements slow, and her eyes close as the figure enters the water behind her. A hand grabs the sword, and Emily is hauled across the ice. She's leant against a fallen tree as the figure moves away still clutching the sword. Emily leans forward and grabs her glasses, and she sees Mark. Emily sets the locket on the fallen tree. Drenched, Mark stares awkwardly at Emily, then looks at the ground. Mark prepares himself, and the locket springs open, knocking Emily and Mark to the ground as a huge black cloud swirls over Mark and a swarm of spiders appears. Ghostly images of Emily and Rachel speak to Mark, and he sees naked images of Rachel and Emily kissing passionately. Mark seethes as he watches them, and with the sword in both hands, Mark races towards Emily, who cowers. Mark strikes the locket with the Sword of Gryffindor, and the black cloud and the images disappear. Emily stares at the open locket as Mark is on his knees and lets go of the sword. Emily sits on the ground beside him. Rachel wakes and comes out of the tent as Emily approaches. She indicates Mark and smiles, and Mark grins broadly. Rachel glares, stomps over, and wrenches the rucksack from Mark's shoulder, then turns back to Mark, who holds up the open locket. He glances at Emily, blinks, and looks away. Scruffy and bedraggled, Mark gives Rachel a faint smile, and she faces him with her arms folded and a set expression on her face. In the tent, Mark and Emily are watching a flame in a jar while Rachel sits outside. She gazes at the flickering flame, Emily takes it, and the flame flares and dies. He ignores Mark, rushing past him to address Emily and shows her Rita's book as Mark stands shoulder to shoulder with Rachel. He puts up his hand, and she glances at Emily, raising her eyebrows, and walks off, leaving Mark crestfallen as he lowers his hand. A vast expanse of open heath land stretches out with hills in the distance, and Mark trudges ahead of Rachel and Emily. A crooked house stands alone, with plums floating in the air like orange balloons. The top half of the door opens, and Oliver peers out as Emily moves towards the door. Inside, they sit in a cluttered room, each holding a mug, and all four raise their mugs and drink in unison. Oliver holds up the pendant, and Emily glances blankly at his friends, then back to Sam's father."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He wrestles with the rope as it drags him back, and choking, pressed up against the wall, Harry can't find the doorway where he entered the building. He hammers with his hands on the underside of the wall and kicks at it with his bare feet as a shadowy figure walks over the roof above him. Harry's movements slow, and his eyes close as the figure enters the room behind him. A hand grabs the shield, and Harry is hauled across the ground. He's leant against a fallen bench as the figure moves away still clutching the shield. Harry leans forward and grabs his shoes, and he sees Ron. Harry sets the ring on the fallen bench. Drenched, Ron stares awkwardly at Harry, then looks at the floor. Ron prepares himself, and the ring springs open, knocking Harry and Ron to the floor as a huge purple mist swirls over Ron and a swarm of butterflies appears. Ghostly images of Harry and Hermione speak to Ron, and he sees shadowy images of Hermione and Harry kissing passionately. Ron seethes as he watches them, and with the shield in both hands, Ron races towards Harry, who cowers. Ron strikes the ring with the Shield of Gryffindor, and the purple mist and the images disappear. Harry stares at the open ring as Ron is on his knees and lets go of the shield. Harry sits on the floor beside him. Hermione wakes and comes out of the cabin as Harry approaches. He indicates Ron and smiles, and Ron grins broadly. Hermione glares, stomps over, and wrenches the backpack from Ron's shoulder, then turns back to Ron, who holds up the open ring. He glances at Harry, blinks, and looks away. Scruffy and bedraggled, Ron gives Hermione a faint smile, and she faces him with her arms folded and a set expression on her face. In the cabin, Ron and Harry are watching a lantern in a box while Hermione sits outside. He gazes at the flickering light, Harry takes it, and the light flares and dies. She ignores Ron, rushing past him to address Harry and shows him Rita's scroll as Ron stands shoulder to shoulder with Hermione. He puts up his hand, and she glances at Harry, raising her eyebrows, and walks off, leaving Ron crestfallen as he lowers his hand. A vast expanse of open grassland stretches out with trees in the distance, and Ron trudges ahead of Hermione and Harry. A crooked tower stands alone, with apples floating in the air like red balloons. The top half of the window opens, and Xenophilius peers out as Harry moves towards the window. Inside, they sit in a cluttered room, each holding a cup, and all four raise their cups and drink in unison. Xenophilius holds up the amulet, and Harry glances blankly at his friends, then back to Luna's father."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He juggles with the chain as it taps him forward, and sneezing, pressed up against the ice, Harry can't locate the opening where he exited the water. He scribbles with his hands on the underside of the ice and nudges it with his bare feet as a shadowy figure dances over the ice above him. Harry's movements halt, and his eyes flutter as the figure paints in the water behind him. A hand releases the sword, and Harry is slid across the ice. He's nudged against a fallen tree as the figure strolls away still juggling the sword. Harry slumps forward and polishes his glasses, and he notices Ron. Harry tosses the locket on the fallen tree. Drenched, Ron squints awkwardly at Harry, then peers at the ground. Ron stretches himself, and the locket glows open, nudging Harry and Ron to the ground as a huge black cloud drifts over Ron and a swarm of butterflies appears. Ghostly images of Harry and Hermione sing to Ron, and he sees glowing images of Hermione and Harry laughing together. Ron fumes as he watches them, and with the sword in both hands, Ron tiptoes towards Harry, who giggles. Ron taps the locket with the Sword of Gryffindor, and the black cloud and the images vanish. Harry gapes at the open locket as Ron stands on his knees and releases the sword. Harry reclines on the ground beside him. Hermione yawns and hops out of the tent as Harry lingers. He gestures to Ron and chuckles, and Ron beams broadly. Hermione frowns, skips over, and slips the rucksack from Ron's shoulder, then spins back to Ron, who hoists up the open locket. He peers at Harry, yawns, and glances away. Scruffy and bedraggled, Ron offers Hermione a weak smile, and she regards him with her arms swinging and a curious expression on her face. In the tent, Ron and Harry are sketching a flame in a jar while Hermione naps outside. He gazes at the flickering flame, Harry juggles it, and the flame flickers and fades. She ignores Ron, dashing past him to hug Harry and shows him Rita's book as Ron stands side by side with Hermione. He raises his hand, and she winks at Harry, raising her eyebrows, and struts off, leaving Ron dejected as he lowers his hand. A vast expanse of open heath land stretches out with hills in the distance, and Ron dances ahead of Hermione and Harry. A crooked house stands alone, with plums floating in the air like orange balloons. The top half of the door creaks open, and Xenophilius squints out as Harry drifts towards the door. Inside, they rest in a cluttered room, each holding a mug, and all four clink their mugs and sip in unison. Xenophilius waves the pendant, and Harry stares blankly at his friends, then back to Luna's father."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The cow wrestles with the yarn as it drags the lamp back, and choking, pressed up against the marshmallow, the penguin can't find the tunnel where it entered the river. The penguin hammers with its elbows on the underside of the marshmallow and kicks at it with its bare hooves as a misty pebble walks over the marshmallow above it. The penguin's jumps slow, and its eyelids close as the pebble enters the river behind it. A nose grabs the slipper, and the penguin is hauled across the marshmallow. It's leant against a broken chair as the pebble moves away still clutching the slipper. The penguin leans forward and grabs its hat, and it sees the guitar. The penguin sets the whistle on the broken chair. Drenched, the guitar stares awkwardly at the penguin, then looks at the ocean. The drum prepares itself, and the whistle springs open, knocking the penguin and the guitar to the ocean as a huge green flower swirls over the guitar and a swarm of beetles appears. Ghostly paintings of the penguin and the violin speak to the guitar, and it sees naked paintings of the violin and the penguin kissing passionately. The guitar seethes as it watches them, and with the slipper in both hands, the guitar races towards the penguin, who cowers. The guitar strikes the whistle with the Drum of Bananas, and the green flower and the paintings disappear. The penguin stares at the open whistle as the guitar is on its knees and lets go of the slipper. The penguin sits on the ocean beside it. The violin wakes and comes out of the igloo as the penguin approaches. It indicates the guitar and smiles, and the guitar grins broadly. The violin glares, stomps over, and wrenches the balloon from the guitar's shoulder, then turns back to the guitar, who holds up the open whistle. It glances at the penguin, blinks, and looks away. Scruffy and bedraggled, the guitar gives the violin a faint smile, and it faces it with its arms folded and a set expression on its face. In the igloo, the guitar and the penguin are watching a marshmallow in a sock while the violin sits outside. It gazes at the flickering marshmallow, the penguin takes it, and the marshmallow flares and dies. It ignores the guitar, rushing past it to address the penguin and shows it Alfredo's map as the guitar stands shoulder to shoulder with the violin. It puts up its wing, and the violin glances at the penguin, raising its eyebrows, and walks off, leaving the guitar crestfallen as it lowers its wing. A vast expanse of open desert stretches out with icebergs in the distance, and the guitar trudges ahead of the violin and the penguin. A twisted lighthouse stands alone, with pumpkins floating in the air like purple parachutes. The top half of the window opens, and the refrigerator peers out as the penguin moves towards the window. Inside, they sit in a cluttered attic, each holding a vase, and all four raise their vases and drink in unison. The refrigerator holds up the bracelet, and the penguin glances blankly at its companions, then back to Morty's nephew."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The squirrel tangles with the vine as it hurls him forward, and gasping, pressed against the rock, Sam can't find the entrance where he exited the cave. He pushes with his paws on the surface of the rock and taps at it with his claws as a mysterious creature glides over the rock above him. Sam's reactions slow, and his eyes open as the creature dives into the cave beneath him. A claw seizes the lantern, and Sam is dragged across the rock. He's propped against a standing bush as the creature drifts away still holding the lantern. Sam leans backward and fetches his hat, and he sees Alex. Sam places the pebble on the standing bush. Drenched, Alex glances confusedly at Sam, then stares at the sky. Alex readies himself, and the pebble bursts open, tossing Sam and Alex to the sky as a massive white mist swirls over Alex and a swarm of butterflies emerges. Spectral echoes of Sam and Jamie chant to Alex, and he observes shadowy echoes of Jamie and Sam embracing warmly. Alex fumes as he observes them, and with the lantern in both paws, Alex rushes towards Sam, who trembles. Alex strikes the pebble with the Lantern of Destiny, and the white mist and the echoes dissipate. Sam gapes at the split pebble as Alex is on his paws and releases the lantern. Sam reclines on the sky beside him. Jamie stirs and emerges from the hut as Sam advances. He motions Alex and grins, and Alex beams widely. Jamie frowns, marches over, and yanks the backpack from Alex's neck, then turns back to Alex, who waves the split pebble. He peeks at Sam, blinks, and glances away. Dusty and disheveled, Alex offers Jamie a weak grin, and she faces him with her paws crossed and a stern expression on her face. In the hut, Alex and Sam are admiring a crystal in a box while Jamie lingers outside. He watches the flickering crystal, Sam takes it, and the crystal flares and fades. She bypasses Alex, darting past him to address Sam and displays him Rita's scroll as Alex stands back to back with Jamie. He lifts his paw, and she peeks at Sam, raising her eyebrows, and strides off, leaving Alex dejected as he drops his paw. A wide expanse of open meadow extends with mounds in the distance, and Alex marches ahead of Jamie and Sam. A twisted cabin stands solitary, with apples floating in the air like red globes. The bottom half of the gate swings open, and Abernathy peers out as Sam advances towards the gate. Inside, they lounge in a chaotic chamber, each holding a goblet, and all four raise their goblets and sip in unity. Abernathy holds aloft the amulet, and Sam gazes blankly at his pals, then back to Luna's uncle."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He grapples with the ribbon as it pushes him forward, and gasping, pressed up against the pudding, Harry can't discover the hole where he left the cave. He taps with his fingers on the underside of the pudding and nudges at it with his bare elbows as a misty creature glides over the pudding above him. Harry's motions halt, and his eyes open as the creature exits the cave behind him. A foot snatches the axe, and Harry is carried across the pudding. He's propped against a collapsed fence as the creature skates away still holding the axe. Harry leans backward and snatches his hat, and he notices Ron. Harry places the necklace on the collapsed fence. Soaked, Ron gazes uncomfortably at Harry, then glances at the sky. Ron braces himself, and the necklace bursts open, hurling Harry and Ron to the sky as a huge white fog twirls over Ron and a pack of butterflies emerges. Ethereal voices of Harry and Hermione shout at Ron, and he observes blurry visions of Hermione and Harry hugging warmly. Ron fumes as he observes them, and with the axe in both arms, Ron dashes toward Harry, who flinches. Ron smashes the necklace with the Axe of Gryffindor, and the white fog and the visions vanish. Harry gawks at the broken necklace as Ron is on his feet and releases the axe. Harry stands on the ground beside him. Hermione stirs and steps out of the caravan as Harry arrives. He gestures to Ron and nods, and Ron beams widely. Hermione scowls, marches over, and snatches the suitcase from Ron's arm, then turns back to Ron, who shows the broken necklace. He peeks at Harry, squints, and looks upward. Tattered and unkempt, Ron gives Hermione a faint nod, and she faces him with her arms crossed and a stern look on her face. In the caravan, Ron and Harry are observing a feather in a bowl while Hermione sits inside. He looks at the fluttering feather, Harry holds it, and the feather dims and vanishes. She avoids Ron, dashing past him to consult Harry and shows him Rita's scroll as Ron stands elbow to elbow with Hermione. He waves his elbow, and she peeks at Harry, rolling her eyes, and strides off, leaving Ron dejected as he drops his elbow. A broad stretch of open desert land unfolds with dunes in the horizon, and Ron trudges behind Hermione and Harry. A leaning shack stands alone, with apples bouncing on the ground like blue spheres. The bottom half of the window shuts, and Xenophilius gazes out as Harry drifts towards the window. Inside, they sit in a tidy space, each holding a spoon, and all four lower their spoons and gulp in harmony. Xenophilius displays the bracelet, and Harry glances curiously at his companions, then back to Luna's father."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The dolphin grapples with the rope as it pulls her forward, and gasping, pressed up against the sand, Lucy can't locate the exit where she left the cave. She taps with her elbows on the top of the sand and nudges at it with her paws as an elusive lemur prances over the beach beneath her. Lucy's actions decelerate, and her ears shut as the lemur leaps into the cave before her. A claw snatches the wand, and Lucy is dragged along the shore. She's propped against a twisted shrub as the lemur scuttles away still holding the wand. Lucy tilts backward and snatches her hat, and she notices Dave. Lucy places the bracelet on the twisted shrub. Soaked, Dave gapes clumsily at Lucy, then glances at the sky. Dave steadies himself, and the bracelet flies open, toppling Lucy and Dave to the sand as an enormous white fog spirals over Dave and a flock of crabs emerges. Ethereal visions of Lucy and Alice chant to Dave, and he observes transparent visions of Alice and Lucy embracing joyfully. Dave fumes as he observes them, and with the wand in both paws, Dave charges toward Lucy, who flinches. Dave smashes the bracelet with the Wand of Ravenwood, and the white fog and the visions vanish. Lucy gazes at the cracked bracelet as Dave drops to his flippers and releases the wand. Lucy perches on the sand beside him. Alice stirs and steps out of the cabin as Lucy approaches. She gestures to Dave and chuckles, and Dave beams widely. Alice glowers, strides over, and yanks the backpack from Dave's arm, then turns back to Dave, who holds up the cracked bracelet. He glances at Lucy, winks, and turns away. Ragged and unkempt, Dave sends Alice a shy grin, and she regards him with her arms crossed and a stern look on her face. In the cabin, Dave and Lucy are studying a bubble in a bottle while Alice sits inside. He stares at the shimmering bubble, Lucy passes it, and the bubble flickers and fades. She dismisses Dave, rushing past him to address Lucy and shows him Fred's scroll as Dave stands elbow to elbow with Alice. He raises his nose, and she peeks at Lucy, raising her eyelids, and strides away, leaving Dave disheartened as he lowers his nose. A massive stretch of dense forest expands with valleys in the background, and Dave marches ahead of Alice and Lucy. A lopsided cabin sits isolated, with cherries hovering in the breeze like purple kites. The bottom part of the window closes, and Horace peers in as Lucy drifts towards the window. Outside, they kneel in a tidy clearing, each gripping a bowl, and all four lift their bowls and sip together. Horace lifts the charm, and Lucy glances absently at his companions, then back to Nancy's uncle."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Harry struggles under the ice, frantically searching for a way out as a shadowy figure approaches. Near drowning, he is rescued by this figure, revealed to be Ron, who retrieves the Sword of Gryffindor. Gratefully, Harry sees Ron despite the tension between them. The two set the locket Horcrux on a fallen tree, but it unleashes a black cloud and haunting visions, including Harry and Hermione kissing, aimed to provoke Ron. Overcoming his anger, Ron destroys the locket with the sword. Hermione angrily snatches her bag from Ron when she sees him, but he holds up the open locket to show his triumph. Later, in the tent, Ron attempts to engage with Hermione, but she brushes him off, focusing on Harry and Rita's book. Dejected, Ron walks ahead of his friends across a vast heath to meet Xenophilius Lovegood. At his home, they unite in a moment of camaraderie, raising their mugs in unison, with Xenophilius presenting a mysterious pendant, drawing Harry’s attention."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Xenophilius holds up the pendant and Harry glances blankly at his friends then back to Luna's father Inside they sit in a cluttered room each holding a mug and all four raise their mugs and drink in unison  The top half of the door opens and Xenophilius peers out as Harry moves towards the door  A crooked house stands alone with plums floating in the air like orange balloons  A vast expanse of open heath land stretches out with hills in the distance and Ron trudges ahead of Hermione and Harry  He puts up his hand and she glances at Harry raising her eyebrows and walks off leaving Ron crestfallen as he lowers his hand  She ignores Ron rushing past him to address Harry and shows him Rita's book as Ron stands shoulder to shoulder with Hermione  Harry takes it and the flame flares and dies  He gazes at the flickering flame  In the tent Ron and Harry are watching a flame in a jar while Hermione sits outside  Ron gives Hermione a faint smile and she faces him with her arms folded and a set expression on her face  Scruffy and bedraggled  He glances at Harry blinks and looks away  Hermione glares stomps over and wrenches the rucksack from Ron's shoulder then turns back to Ron who holds up the open locket  He indicates Ron and smiles and Ron grins broadly  Hermione wakes and comes out of the tent as Harry approaches  Harry sits on the ground beside him  Harry stares at the open locket as Ron is on his knees and lets go of the sword  Ron strikes the locket with the Sword of Gryffindor and the black cloud and the images disappear  Ron seethes as he watches them and with the sword in both hands Ron races towards Harry who cowers  Ghostly images of Harry and Hermione speak to Ron and he sees naked images of Hermione and Harry kissing passionately  Ron prepares himself and the locket springs open knocking Harry and Ron to the ground as a huge black cloud swirls over Ron and a swarm of spiders appears  Drenched Ron stares awkwardly at Harry then looks at the ground  Harry sets the locket on the fallen tree  Harry leans forward and grabs his glasses and he sees Ron  He's leant against a fallen tree as the figure moves away still clutching the sword  A hand grabs the sword and Harry is hauled across the ice  Harry's movements slow and his eyes close as the figure enters the water behind him  as a shadowy figure walks over the ice above him  He hammers with his hands on the underside of the ice and kicks at it with his bare feet  Harry can't find the opening where he entered the water  He wrestles with the chain as it drags him back and choking pressed up against the ice "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He gazes at the flickering flame  She ignores Ron rushing past him to address Harry and shows him Rita's book as Ron stands shoulder to shoulder with Hermione  Harry leans forward and grabs his glasses and he sees Ron  In the tent Ron and Harry are watching a flame in a jar while Hermione sits outside  Ron strikes the locket with the Sword of Gryffindor and the black cloud and the images disappear  He wrestles with the chain as it drags him back and choking pressed up against the ice  He glances at Harry blinks and looks away  Harry sits on the ground beside him  A hand grabs the sword and Harry is hauled across the ice  Drenched Ron stares awkwardly at Harry then looks at the ground  A crooked house stands alone with plums floating in the air like orange balloons  Hermione glares stomps over and wrenches the rucksack from Ron's shoulder then turns back to Ron who holds up the open locket  He indicates Ron and smiles and Ron grins broadly  Xenophilius holds up the pendant and Harry glances blankly at his friends then back to Luna's father Hermione wakes and comes out of the tent as Harry approaches  Ron gives Hermione a faint smile and she faces him with her arms folded and a set expression on her face  Harry stares at the open locket as Ron is on his knees and lets go of the sword  Harry can't find the opening where he entered the water  The top half of the door opens and Xenophilius peers out as Harry moves towards the door  Scruffy and bedraggled  Ghostly images of Harry and Hermione speak to Ron and he sees naked images of Hermione and Harry kissing passionately  He puts up his hand and she glances at Harry raising her eyebrows and walks off leaving Ron crestfallen as he lowers his hand  Ron seethes as he watches them and with the sword in both hands Ron races towards Harry who cowers  He hammers with his hands on the underside of the ice and kicks at it with his bare feet  as a shadowy figure walks over the ice above him  Inside they sit in a cluttered room each holding a mug and all four raise their mugs and drink in unison  Harry takes it and the flame flares and dies  He's leant against a fallen tree as the figure moves away still clutching the sword  Harry's movements slow and his eyes close as the figure enters the water behind him  Harry sets the locket on the fallen tree  Ron prepares himself and the locket springs open knocking Harry and Ron to the ground as a huge black cloud swirls over Ron and a swarm of spiders appears  A vast expanse of open heath land stretches out with hills in the distance and Ron trudges ahead of Hermione and Harry "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Hermione wakes and comes out of the tent as Harry approaches  He indicates Ron and smiles and Ron grins broadly  Hermione glares stomps over and wrenches the rucksack from Ron's shoulder then turns back to Ron who holds up the open locket  He glances at Harry blinks and looks away  Scruffy and bedraggled  Ron gives Hermione a faint smile and she faces him with her arms folded and a set expression on her face  In the tent Ron and Harry are watching a flame in a jar while Hermione sits outside  He gazes at the flickering flame  Harry takes it and the flame flares and dies  She ignores Ron rushing past him to address Harry and shows him Rita's book as Ron stands shoulder to shoulder with Hermione  He puts up his hand and she glances at Harry raising her eyebrows and walks off leaving Ron crestfallen as he lowers his hand  A vast expanse of open heath land stretches out with hills in the distance and Ron trudges ahead of Hermione and Harry  A crooked house stands alone with plums floating in the air like orange balloons  The top half of the door opens and Xenophilius peers out as Harry moves towards the door  Inside they sit in a cluttered room each holding a mug and all four raise their mugs and drink in unison  Xenophilius holds up the pendant and Harry glances blankly at his friends then back to Luna's father He wrestles with the chain as it drags him back and choking pressed up against the ice  Harry can't find the opening where he entered the water  He hammers with his hands on the underside of the ice and kicks at it with his bare feet  as a shadowy figure walks over the ice above him  Harry's movements slow and his eyes close as the figure enters the water behind him  A hand grabs the sword and Harry is hauled across the ice  He's leant against a fallen tree as the figure moves away still clutching the sword  Harry leans forward and grabs his glasses and he sees Ron  Harry sets the locket on the fallen tree  Drenched Ron stares awkwardly at Harry then looks at the ground  Ron prepares himself and the locket springs open knocking Harry and Ron to the ground as a huge black cloud swirls over Ron and a swarm of spiders appears  Ghostly images of Harry and Hermione speak to Ron and he sees naked images of Hermione and Harry kissing passionately  Ron seethes as he watches them and with the sword in both hands Ron races towards Harry who cowers  Ron strikes the locket with the Sword of Gryffindor and the black cloud and the images disappear  Harry stares at the open locket as Ron is on his knees and lets go of the sword  Harry sits on the ground beside him "
        }
      ]
    }
  ]
}