{
  "ground_truth": "Harry sits in his room, holding a shard of broken mirror and stares pensively at his own reflection, then sees an eye that is not his own looking back at him. Hedwig is sitting patiently in her cage. Harry packs a rucksack, taking a notebook with the letters RAB written in it, a gold locket on a chain, and a newspaper with Dumbledore's obituary by Elphias Doge. Harry comes down the stairs, holding his rucksack and Hedwig's cage, to a bare living room. He opens the door of the cupboard under the stairs and peers inside, pulls a cord, and the light in the cupboard comes on. Harry steps inside what was once his bedroom and slowly shakes his head, spots a toy soldier wielding a sword, picks up the metal soldier, studies it solemnly, and puts it back. He opens the front door to see Hagrid, Ron, and Hermione; Mad-eye Moody, Mr. Weasley, and Kingsley Shacklebolt follow them inside. Hermione has plucked a hair from Harry's head and puts it in the flask Moody's holding. Fleur Delacour with Bill, the Weasley twins, Remus Lupin, and Nymphadora Tonks stand nearby as Moody glares at Fred. He sips, grimaces, passes the flask to George, and starts to shrink. George also pulls a face and shrinks. Mundungus drinks and grows a little. The flask is passed to Fleur, then Ron, and finally, Hermione, and they all change physically until each one looks like Harry. Moody retrieves the flask from Hermione, then joins the real Harry and they both survey the six Harry Potter lookalikes. He empties clothes onto the floor, and the real Harry steps out of the front door with Hedwig on his arm, the snowy owl spreading her wings and flying away into the night sky. Harry is in Hagrid's motorbike sidecar as some ride broomsticks and Bill Weasley rides a thestral, a winged, skeletal horse. Decoy Harrys on broomsticks sweep past Moody as Hagrid rides his motorbike up into the air, forcing Moody to duck. Two thestrals zoom over his head, and, in the sidecar, Harry grips the windscreen as Moody passes on a souped-up broomstick. Lightning flashes through the clouds as Harry clings to the windscreen when death eaters appear and zoom over the decoy Harrys. They race through the glowering clouds, and the decoys draw some death eaters away. Hagrid presses a button, and a burst of flame shoots out of the rear, propelling the bike forward as they land on the motorway with death eaters in pursuit. Harry aims his wand as a death eater crashes to the ground, a caravan veers out of control and tips over, and Hagrid swerves into oncoming traffic to avoid it, heading into a tunnel on the wrong carriageway.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Here is the transformed text with synonyms for the appropriate words:\n\nHarry perches in his chamber, clutching a fragment of shattered glass and gazes thoughtfully at his own image, then perceives an eye that is not his own gazing back at him. Hedwig is resting patiently in her enclosure. Harry bundles a backpack, taking a journal with the characters RAB inscribed in it, a golden pendant on a chain, and a gazette with Dumbledore's eulogy by Elphias Doge. Harry descends the staircase, clutching his backpack and Hedwig's enclosure, to a sparse lounge. He opens the portal of the closet beneath the staircase and peers inward, pulls a cord, and the lamp in the closet illuminates. Harry steps inward what was once his chamber and gradually shakes his head, notices a plaything warrior wielding a sword, picks up the metallic warrior, examines it gravely, and sets it back. He opens the entrance to see Hagrid, Ron, and Hermione; Mad-eye Moody, Mr. Weasley, and Kingsley Shacklebolt trail them inward. Hermione has plucked a strand from Harry's head and places it in the flask Moody's clutching. Fleur Delacour with Bill, the Weasley twins, Remus Lupin, and Nymphadora Tonks stand close as Moody glowers at Fred. He sips, grimaces, transfers the flask to George, and begins to contract. George also distorts his face and contracts. Mundungus drinks and enlarges a bit. The flask is transferred to Fleur, then Ron, and lastly, Hermione, and they all transform bodily until each one resembles Harry. Moody recovers the flask from Hermione, then joins the actual Harry and they both assess the six Harry Potter duplicates. He empties garments onto the flooring, and the actual Harry steps out of the entrance with Hedwig on his limb, the snowy owl extending her wings and soaring away into the nocturnal sky. Harry is in Hagrid's motorbike sidecar as some ride broomsticks and Bill Weasley rides a thestral, a winged, skeletal steed. Ersatz Harrys on broomsticks glide past Moody as Hagrid pilots his motorbike up into the atmosphere, compelling Moody to duck. Two thestrals zoom over his head, and, in the sidecar, Harry grips the windscreen as Moody passes on a modified broomstick. Lightning flickers through the clouds as Harry clutches the windscreen when death eaters manifest and zoom over the ersatz Harrys. They race through the scowling clouds, and the ersatz Harrys lure some death eaters away. Hagrid presses a button, and a surge of fire ejects out of the rear, propelling the cycle forward as they alight on the highway with death eaters in chase. Harry directs his wand as a death eater collides to the earth, a caravan swerves out of control and tips over, and Hagrid maneuvers into oncoming automobiles to evade it, heading into a tunnel on the incorrect carriageway."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Harry is seated in his room, a shard of broken mirror is held by him as his own reflection is stared at pensively, then an eye not his own is seen looking back at him. Hedwig patiently sits in her cage. A rucksack is packed by Harry, and he includes a notebook with the letters RAB written in it, a gold locket on a chain, and a newspaper containing Dumbledore's obituary written by Elphias Doge. The stairs are descended by Harry, holding his rucksack and Hedwig's cage, into a bare living room. The door of the cupboard under the stairs is opened by him, and inside he peers, a cord is pulled, and the light in the cupboard comes on. What was once his bedroom is stepped into by Harry, and his head is slowly shaken by him, a toy soldier wielding a sword is spotted, the metal soldier is picked up, studied solemnly, and put back. The front door is opened by him to see Hagrid, Ron, and Hermione; Mad-eye Moody, Mr. Weasley, and Kingsley Shacklebolt follow them inside. A hair has been plucked from Harry's head by Hermione and it is put into the flask Moody is holding. Fleur Delacour with Bill, the Weasley twins, Remus Lupin, and Nymphadora Tonks stand nearby as Fred is glared at by Moody. He sips, grimaces, the flask is passed to George, and shrinking is started. George also pulls a face and shrinking is done. Mundungus drinks and he grows a little. The flask is passed to Fleur, then Ron, and finally, Hermione, and physical changes are undergone by them until each one looks like Harry. The flask is retrieved from Hermione by Moody, then the real Harry is joined by him and both of them survey the six Harry Potter lookalikes. Clothes are emptied onto the floor by him, and the front door is stepped out of by the real Harry with Hedwig on his arm, her wings are spread by the snowy owl, and she flies away into the night sky. Harry is seated in Hagrid's motorbike sidecar as broomsticks are ridden by some, and a thestral, a winged, skeletal horse, is ridden by Bill Weasley. Decoy Harrys on broomsticks sweep past Moody as the air is ascended by Hagrid on his motorbike, forcing Moody to duck. Two thestrals zoom over his head, and, in the sidecar, the windscreen is gripped by Harry as Moody is passed on a souped-up broomstick. As lightning flashes through the clouds, the windscreen is clung to by Harry when death eaters appear and the decoy Harrys are zoomed over. Through the glowering clouds, they race, and some death eaters are drawn away by the decoys. A button is pressed by Hagrid, and a burst of flame is shot out of the rear, propelling the bike forward as the motorway is landed on with death eaters in pursuit. Harry aims his wand as a death eater crashes to the ground, a caravan is veered out of control and tipped over, and Hagrid swerves into oncoming traffic to avoid it, heading into a tunnel on the wrong carriageway."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Harry sits in his room, holding a shard of mirror, watching his reflection, then notices a different eye looking back. Hedwig waits patiently in her cage. Harry packs a rucksack with a notebook marked RAB, a gold locket, and a newspaper with Dumbledore's obituary by Elphias Doge. Carrying his rucksack and Hedwig's cage, he enters a bare living room. He opens the cupboard under the stairs, pulls a cord to turn on the light, and steps inside his former bedroom, shaking his head. He picks up and studies a toy soldier before putting it back. Opening the front door, he finds Hagrid, Ron, and Hermione, followed by Mad-eye Moody, Mr. Weasley, and Kingsley Shacklebolt. Hermione plucks a hair from Harry's head and puts it in the flask Moody holds. Fleur, Bill, the Weasley twins, Remus Lupin, and Tonks stand nearby. Moody glares at Fred, sips, grimaces, and shrinks, passing the flask to George who also drinks and shrinks. Mundungus drinks and grows a little. The flask passes to Fleur, Ron, and Hermione until they all look like Harry. Moody takes back the flask, and he and Harry survey the six Harry lookalikes. Harry steps out with Hedwig, who spreads her wings, flying into the night. In Hagrid's motorbike sidecar, some ride broomsticks while Bill rides a thestral. Decoy Harrys sweep past Moody as Hagrid ascends, making Moody duck. Two thestrals zoom overhead, and Harry grips the windscreen as Moody passes on his broomstick. Lightning flashes as death eaters appear, zooming over decoy Harrys. The decoys lure some away. Hagrid presses a button, flames burst out propelling the bike onto the motorway with death eaters chasing. Harry aims his wand, causing a death eater to crash, a caravan to veer and tip over, and Hagrid to swerve into oncoming traffic and enter a tunnel."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Harry, holding a broken mirror shard, sees an unfamiliar eye in his reflection. Hedwig sits in her cage as Harry packs a rucksack with a notebook marked RAB, a gold locket, and a newspaper featuring Dumbledore's obituary. He enters the bare living room, checks the cupboard under the stairs, finds an old toy soldier, and then leaves. Outside, Hagrid, Ron, Hermione, Mad-eye Moody, Mr. Weasley, and Kingsley Shacklebolt arrive. Hermione plucks a hair from Harry's head for Moody's flask. Fleur, Bill, the Weasley twins, Lupin, and Tonks watch as the group drinks from the flask and transform into Harry lookalikes. Moody and Harry observe the six Harrys. With Hedwig flying away, Harry sits in Hagrid's motorbike sidecar while others ride broomsticks or thestrals. Decoy Harrys distract death eaters. Hagrid’s bike accelerates with flame, landing on the motorway with death eaters chasing. Harry uses his wand, a death eater crashes, and Hagrid swerves into a tunnel."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Harry sits quietly in his room, holding a jagged shard of a broken mirror in his hand. He stares pensively at his own somber reflection, and soon notices an eye that is not his own gazing back at him. Meanwhile, Hedwig, his loyal owl, is sitting patiently in her cage, watching over the room with her curious eyes. With determination, Harry begins to pack a rucksack, making sure to include a notebook that has the letters R.A.B. inscribed on it, a gold locket attached to a chain, and a newspaper containing Dumbledore's obituary written by Elphias Doge. Harry makes his way down the stairs, carrying both the rucksack and Hedwig's cage, entering a bare and empty living room. He approaches the door of the cupboard under the stairs, peers inside, and pulls a cord to illuminate the small space. Stepping into what once served as his tiny bedroom, he shakes his head slowly, reminiscing. He spots a toy soldier wielding a tiny sword, picks up the metal figure, examines it solemnly, and then carefully places it back where it was. As he opens the front door, he is greeted by Hagrid, Ron, and Hermione, followed by Mad-eye Moody, Mr. Weasley, and Kingsley Shacklebolt, all entering the space swiftly. Hermione, with a quick motion, has plucked a hair from Harry's head and places it into the flask that Moody holds. Nearby, Fleur Delacour stands with Bill, the Weasley twins, Remus Lupin, and Nymphadora Tonks, as Moody casts a critical glare at Fred. Taking a sip from the flask, he grimaces and passes it to George, who also pulls a face as he shrinks. Mundungus drinks after them, causing him to grow slightly. The flask is passed around from Fleur to Ron and finally to Hermione, as each individual undergoes a transformation until they all resemble Harry in appearance. Moody retrieves the flask from Hermione and then stands alongside the real Harry, both of them surveying the assembled group of six Harry Potter lookalikes. Moody then empties the clothes onto the floor. The real Harry steps out of the front door, Hedwig perched on his arm, and she gracefully spreads her snowy white wings, soaring away into the vast night sky. Harry finds his place in the sidecar of Hagrid's motorbike as several others take flight on broomsticks, while Bill Weasley rides upon a thestral, the spectral, winged horse. The decoy Harrys, mounted on their broomsticks, sweep past Moody just as Hagrid accelerates the motorbike skyward, causing Moody to duck quickly. Two thestrals zoom above his head, and within the sidecar, Harry grips the windscreen tightly while Moody races past on a fast broomstick. Lightning flickers through the dense clouds, and Harry clings even tighter to the windscreen when death eaters suddenly appear, zooming overhead to chase the decoy Harrys. They race through the ominous, swirling clouds, with the decoys successfully diverting some death eaters away. Hagrid, with quick thinking, presses a button, unleashing a burst of flame from the bike's rear, propelling it forward swiftly as they land onto the motorway, still with death eaters in hot pursuit. Harry expertly aims his wand, causing a death eater to crash down, sending a caravan veering out of control and tipping over. Hagrid swerves expertly into oncoming traffic to avoid it, heading into a tunnel, navigating the wrong side of the carriageway."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Harry sits quietly and contemplatively in his dimly lit room, holding a jagged shard from a broken mirror delicately in his hand. He stares pensively at his own somber reflection in the shard, and soon notices an eye that is not his own mysteriously gazing back at him. Meanwhile, Hedwig, his ever-loyal owl who is always vigilant, sits patiently in her cage, watching over the entire room with her curious and observant eyes. With determination in his heart, Harry begins to methodically pack a rucksack, making sure to carefully include a notebook that has the cryptic letters R.A.B. inscribed on the cover. He also adds a gold locket attached to a delicate chain, and a newspaper carefully folded that contains Dumbledore's obituary written by Elphias Doge. Harry proceeds to make his way down the creaky stairs, carrying both the packed rucksack and Hedwig's secure cage. He enters a bare and empty living room, devoid of warmth. Approaching the familiar door of the cupboard under the stairs, he peers inside, pulling a cord to illuminate the small, cramped space. Stepping into what once served as his tiny and humble bedroom, he shakes his head slowly in nostalgia, reminiscing about the past. He spots a small toy soldier wielding a tiny sword, picks up the metal figure, examines it solemnly, and then carefully places it back in its original spot. As he opens the front door, he is unexpectedly greeted by Hagrid, Ron, and Hermione, followed closely by Mad-eye Moody, Mr. Weasley, and Kingsley Shacklebolt, all entering the space swiftly and with purpose. Hermione, with a quick, decisive motion, plucks a single hair from Harry’s head and places it into the flask that Moody holds. Nearby, Fleur Delacour stands with Bill, the Weasley twins, Remus Lupin, and Nymphadora Tonks, while Moody casts a critical glare at Fred. Taking a sip from the flask, he grimaces in discomfort and passes it to George, who also pulls a face while shrinking slightly. Mundungus drinks after them, causing him to grow slightly in size. The flask is passed around from Fleur to Ron and finally to Hermione, as each individual undergoes a transformation until they all bear the exact resemblance to Harry in appearance. Moody retrieves the flask from Hermione’s hand and then stands steadfastly alongside the real Harry, both of them surveying the assembled group of six Harry Potter lookalikes with a critical eye. Moody then empties the contents of the clothes onto the floor. The real Harry steps out of the front door, Hedwig perched confidently on his arm, and she gracefully spreads her snowy white wings, soaring away into the vast and dark night sky. Harry finds his place in the sidecar of Hagrid's powerful and rumbling motorbike as several others take flight into the air on broomsticks, while Bill Weasley rides upon a thestral, the spectral and winged horse. The decoy Harrys, mounted upon their broomsticks, sweep past Moody just as Hagrid accelerates the motorbike skyward, causing Moody to duck quickly. Two thestrals zoom rapidly above his head, and within the sidecar, Harry grips the windscreen tightly while Moody races past on a fast broomstick. Lightning flickers ominously through the dense, swirling clouds, and Harry clings even tighter to the windscreen when death eaters suddenly appear, zooming overhead to chase the decoy Harrys. They race furiously through the ominous, swirling clouds, with the decoys successfully diverting some of the death eaters away. Hagrid, with quick thinking and a sense of urgency, presses a button, unleashing a burst of flame from the bike's rear, propelling it forward swiftly as they land onto the busy motorway, still with death eaters in hot pursuit. Harry expertly aims his wand, causing a death eater to crash down, sending a caravan veering wildly out of control and tipping over. Hagrid swerves expertly into oncoming traffic to skillfully avoid it, heading into a tunnel, navigating the wrong side of the carriageway with precision."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As Harry settles into his room, he clasps a shard of broken mirror in his hand and gazes deeply into his own reflection, his eyes contemplative and distant, only to be startled by the sight of an unfamiliar eye gazing back at him. Nearby, Hedwig waits quietly within the confines of her cage. Slowly and purposefully, Harry begins to pack a rucksack, carefully placing a notebook marked with the letters RAB, a gold locket attached to a chain, and a newspaper featuring Dumbledore's obituary by Elphias Doge inside. He then descends the stairs, balancing the weight of the rucksack over his shoulder and clutching Hedwig's cage in one hand, to find himself in the sparse, almost desolate, living room. His attention shifts as he approaches the cupboard under the stairs, pulls open the door, and hesitantly leans in to peer into the dimness. A gentle pull of the cord ignites a light, illuminating the small space that once served as his bedroom. Stepping inside, a slow shake of his head betrays a mix of nostalgia and disbelief. His eyes fall on a toy soldier brandishing a tiny sword; he reaches out, lifts the metal figure with a solemn gaze, scrutinizes it for a moment before placing it delicately back where it belongs. Moving towards the front door, he opens it to find Hagrid, Ron, and Hermione waiting; Mad-eye Moody, Mr. Weasley, and Kingsley Shacklebolt follow closely behind, entering the house. As the group assembles, Hermione swiftly plucks a hair from Harry's head and places it into the flask Moody holds. Nearby stand Fleur Delacour with Bill, the Weasley twins, Remus Lupin, and Nymphadora Tonks, all watching as Moody casts a severe look towards Fred. Moody sips from the flask, wincing at the taste, and hands it over to George, who likewise grimaces and begins to shrink in size. Mundungus takes his turn with the flask and grows slightly with a grimace. The flask continues its journey to Fleur, then Ron, and finally Hermione, each undergoing a physical transformation until they all bear the identical appearance of Harry. As Hermione returns the flask to Moody, he steps back to join the real Harry, and together, they take in the sight of the six Harry Potter doppelgangers now standing before them. Moody then empties a collection of clothes onto the floor, allowing the genuine Harry to step out of the front door with Hedwig perched gracefully on his arm. In a moment of freedom, the snowy owl unfurls her wings and takes flight, disappearing into the vast expanse of the night sky. Harry finds himself seated in the sidecar of Hagrid's motorbike, watching as some of the group depart on broomsticks while Bill Weasley mounts a thestral, its skeletal form and wings carrying it aloft. The decoy Harrys, riding broomsticks, whiz past Moody just as Hagrid propels the motorbike skyward, urging Moody to duck out of the way. Two thestrals soar above Moody's head, and in the sidecar, Harry clutches tightly onto the windscreen, catching glimpses of Moody zipping by on an enhanced broomstick. As lightning crackles ominously through the clouded sky, Harry clings desperately to the windscreen, his breath catching as death eaters materialize suddenly and swoop over the decoy Harrys. They tear through the stormy clouds, the decoys drawing several death eaters away in hot pursuit. In a desperate maneuver, Hagrid presses a button that releases a fierce jet of flame from the motorbike's rear, propelling them forward rapidly as they touch down on the motorway with death eaters still trailing behind. With determination, Harry aims his wand, causing one of the pursuers to plummet to the ground, while a caravan swerves wildly, overturning in the chaos. Navigation becomes perilous as Hagrid swerves into oncoming traffic to evade the caravan, guiding them into a tunnel where they speed along the wrong carriageway, the deafening noise of their escape echoing around them."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Harry sits in his room, contemplating a shard of broken mirror, when he glimpses an unfamiliar eye staring back at him. Nearby, Hedwig waits patiently in her cage. Harry prepares for departure, packing a rucksack with a notebook labeled RAB, a gold locket on a chain, and a newspaper featuring Dumbledore's obituary. He descends to the sparse living room, carrying his belongings, and briefly visits the cupboard under the stairs, where he once lived. Inside, he nostalgically examines a toy soldier before returning it and leaving. Upon opening the front door, he is greeted by Hagrid, Ron, Hermione, and others, including Mad-eye Moody, Mr. Weasley, and Kingsley Shacklebolt. As part of their plan, Hermione plucks a hair from Harry and adds it to Moody's flask. With Fleur Delacour, Bill, the Weasley twins, Lupin, and Tonks present, the group drinks from the flask, each transforming into Harry's likeness. Moody and the original Harry survey the six doppelgängers before Harry exits with Hedwig, who flies into the night. Harry takes his place in Hagrid's motorbike sidecar, accompanied by others on broomsticks and Bill on a thestral. As decoy Harrys fly past Moody, Hagrid ascends skyward, prompting Moody to duck from approaching thestrals. Together, they navigate through lightning-lit clouds as death eaters pursue them, targeting the decoys. Hagrid accelerates the motorbike with a fiery burst to evade the death eaters, leading them onto a motorway. In the chaos, Harry defends them with his wand, taking down a death eater, while Hagrid maneuvers through oncoming traffic, narrowly avoiding disaster by entering a tunnel."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "In his small, sparsely decorated room, Harry, a young wizard known for his distinctive lightning-shaped scar, sits holding a shard of broken mirror, an item connected to his deceased godfather Sirius Black, and stares pensively at his own reflection. Suddenly, he sees an eye that is not his own looking back at him, hinting at the mysterious connection through the mirror. Hedwig, his loyal snowy owl named after a medieval saint, sits patiently in her cage. Harry packs a rucksack, taking a notebook with the letters RAB written in it, a clue tied to a hunt for dark magical objects called Horcruxes, a gold locket on a chain which is actually one of these powerful and evil Horcruxes, and a newspaper featuring Dumbledore's obituary written by Elphias Doge, an old friend of the former headmaster of Hogwarts School of Witchcraft and Wizardry. Harry comes down the stairs, holding his rucksack and Hedwig's cage, to a bare living room devoid of warmth or personal touches. He opens the door of the cupboard under the stairs, the small, cramped space where he spent his childhood, and peers inside, pulls a cord, and the light in the cupboard comes on. Harry steps inside what was once his bedroom, a reminder of his oppressive upbringing by the Dursleys, and slowly shakes his head as he spots a toy soldier wielding a sword, a relic of his imagination-filled but lonely childhood. He picks up the metal soldier, studies it solemnly, and puts it back. He opens the front door to see Hagrid, his giant friend and a Hogwarts gamekeeper, along with Ron, his best friend and Hermione, his clever and resourceful friend; the famously paranoid Mad-Eye Moody, Mr. Weasley, Ron's father, who works at the Ministry of Magic, and Kingsley Shacklebolt, an auror known for his calm demeanor, follow them inside. Hermione has plucked a hair from Harry's head to create Polyjuice Potion and puts it in the flask Moody's holding. Fleur Delacour, a part-veela witch engaged to Bill, the eldest of the Weasley siblings, the mischievous Weasley twins, Remus Lupin, a kind-hearted werewolf and Harry's former teacher, and Nymphadora Tonks, an auror known for her ability to change appearance at will, stand nearby as Moody glares at Fred, one of the twins. He sips, grimaces at the potion's unpleasant taste, passes the flask to George, the other twin, and starts to shrink into a duplicate of Harry. George also pulls a face and shrinks. Mundungus Fletcher, a shady but sometimes helpful member of the Order of the Phoenix, drinks and grows a little before morphing into yet another Harry. The flask is passed to Fleur, then Ron, and finally, Hermione, and they all change physically until each one looks like Harry, a strategy to confuse their adversaries. Moody retrieves the flask from Hermione, then joins the real Harry and they both survey the six Harry Potter lookalikes. He empties clothes onto the floor, and the real Harry steps out of the front door with Hedwig on his arm, the snowy owl spreading her wings and flying away into the night sky, symbolizing freedom. Harry is in Hagrid's motorbike sidecar, a vehicle once owned by Sirius Black, as some ride broomsticks, traditional wizarding transport, and Bill Weasley rides a thestral, an eerie winged, skeletal horse visible only to those who have witnessed death. Decoy Harrys on broomsticks sweep past Moody as Hagrid rides his enchanted motorbike up into the air, forcing Moody to duck. Two thestrals zoom over his head, and, in the sidecar, Harry grips the windscreen as Moody passes on a souped-up broomstick. Lightning flashes through the clouds, casting an ominous glow, as Harry clings to the windscreen when deadly followers of Voldemort, known as Death Eaters, appear and zoom over the decoy Harrys. They race through the glowering clouds, and the decoys draw some Death Eaters away. Hagrid presses a button, and a burst of flame, a feature inspired by Sirius's inventive modifications, shoots out of the rear, propelling the bike forward as they land on the motorway with Death Eaters in pursuit. Harry aims his wand, a tool essential for casting spells, as a Death Eater crashes to the ground, a caravan veers out of control and tips over, and Hagrid swerves into oncoming traffic to avoid it, heading into a tunnel on the wrong carriageway, showcasing his fearless nature in the face of danger."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Hedwig is sitting patiently in her cage Harry sits in his room holding a shard of broken mirror and stares pensively at his own reflection then sees an eye that is not his own looking back at him Madeye Moody Hedwig is sitting patiently in her cage Harry is in Hagrid's motorbike sidecar as some ride broomsticks and Bill Weasley rides a thestral Harry packs a rucksack taking a notebook with the letters RAB written in it a gold locket on a chain and a newspaper with Dumbledore's obituary by Elphias Doge Harry comes down the stairs holding his rucksack and Hedwig's cage to a bare living room He opens the door of the cupboard under the stairs and peers inside pulls a cord and the light in the cupboard comes on Harry steps inside what was once his bedroom and slowly shakes his head spots a toy soldier wielding a sword picks up the metal soldier studies it solemnly and puts it back He opens the front door to see Hagrid Hagrid presses a button and a burst of flame shoots out of the rear propelling the bike forward as they land on the motorway with death eaters in pursuit Ron and Hermione Madeye Moody Mr Weasley and Kingsley Shacklebolt follow them inside Harry grips the windscreen as Moody passes on a soupedup broomstick Hermione has plucked a hair from Harry's head and puts it in the flask Moody retrieves the flask from Hermione then joins the real Harry and they both survey the six Harry Potter lookalikes Moody's holding Fleur Delacour with Bill Harry comes down the stairs holding his rucksack and Hedwig's cage to a bare living room He sips grimaces passes the flask to George and starts to shrink Harry sits in his room holding a shard of broken mirror and stares pensively at his own reflection then sees an eye that is not his own looking back at him the Weasley twins Remus Lupin and Nymphadora Tonks stand nearby as Moody glares at Fred He sips grimaces passes the flask to George and starts to shrink George also pulls a face and shrinks Mundungus drinks and grows a little The flask is passed to Fleur then Ron and finally Hermione and they all change physically until each one looks like Harry Moody retrieves the flask from Hermione then joins the real Harry and they both survey the six Harry Potter lookalikes He empties clothes onto the floor and the real Harry steps out of the front door with Hedwig on his arm the snowy owl spreading her wings and flying away into the night sky Harry is in Hagrid's motorbike sidecar as some ride broomsticks and Bill Weasley rides a thestral Harry aims his wand as a death eater crashes to the ground Harry packs a rucksack taking a notebook with the letters RAB written in it a gold locket on a chain and a newspaper with Dumbledore's obituary by Elphias Doge a winged skeletal horse Decoy Harrys on broomsticks sweep past Moody as Hagrid rides his motorbike up into the air forcing Moody to duck Two thestrals zoom over his head and in the sidecar Harry grips the windscreen as Moody passes on a soupedup broomstick Lightning flashes through the clouds as Harry clings to the windscreen when death eaters appear and zoom over the decoy Harrys They race through the glowering clouds and the decoys draw some death eaters away Hagrid presses a button and a burst of flame shoots out of the rear propelling the bike forward as they land on the motorway with death eaters in pursuit Harry aims his wand as a death eater crashes to the ground He empties clothes onto the floor and the real Harry steps out of the front door with Hedwig on his arm He opens the door of the cupboard under the stairs and peers inside pulls a cord and the light in the cupboard comes on Two thestrals zoom over his head and in the sidecar a caravan veers out of control and tips over and Hagrid swerves into oncoming traffic to avoid it heading into a tunnel on the wrong carriageway Ron and Hermione"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Harry sits in his room holding a shard of broken mirror and stares pensively at his own reflection then sees an eye that is not his own looking back at him. Hedwig is sitting patiently in her cage. Harry packs a rucksack taking a notebook with the letters RAB written in it a gold locket on a chain and a newspaper with Dumbledore's obituary by Elphias Doge. Harry comes down the stairs holding his rucksack and Hedwig's cage to a bare living room. He opens the door of the cupboard under the stairs and peers inside pulls a cord and the light in the cupboard comes on. Harry steps inside what was once his bedroom and slowly shakes his head spots a toy soldier wielding a sword picks up the metal soldier studies it solemnly and puts it back. He opens the front door to see Hagrid. Ron and Hermione. Madeye Moody. Mr Weasley and Kingsley Shacklebolt follow them inside. Hermione has plucked a hair from Harry's head and puts it in the flask. Moody's holding Fleur Delacour with Bill. the Weasley twins Remus Lupin and Nymphadora Tonks stand nearby as Moody glares at Fred. He sips grimaces passes the flask to George and starts to shrink. George also pulls a face and shrinks. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Mundungus drinks and grows a little. The flask is passed to Fleur then Ron and finally Hermione and they all change physically until each one looks like Harry. Moody retrieves the flask from Hermione then joins the real Harry and they both survey the six Harry Potter lookalikes. He empties clothes onto the floor and the real Harry steps out of the front door with Hedwig on his arm. the snowy owl spreading her wings and flying away into the night sky. Harry is in Hagrid's motorbike sidecar as some ride broomsticks and Bill Weasley rides a thestral. a winged skeletal horse. Decoy Harrys on broomsticks sweep past Moody as Hagrid rides his motorbike up into the air forcing Moody to duck. Two thestrals zoom over his head and in the sidecar. Harry grips the windscreen as Moody passes on a soupedup broomstick. Lightning flashes through the clouds as Harry clings to the windscreen when death eaters appear and zoom over the decoy Harrys. They race through the glowering clouds and the decoys draw some death eaters away. Hagrid presses a button and a burst of flame shoots out of the rear propelling the bike forward as they land on the motorway with death eaters in pursuit. Harry aims his wand as a death eater crashes to the ground. a caravan veers out of control and tips over and Hagrid swerves into oncoming traffic to avoid it heading into a tunnel on the wrong carriageway."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Harry sits in his room holding a shard of broken mirror and stares pensively at his own reflection then sees an eye that is not his own looking back at him. Hedwig is sitting patiently in her cage. Harry packs a rucksack taking a notebook with the letters RAB written in it a gold locket on a chain and a newspaper with Dumbledore's obituary by Elphias Doge. Harry comes down the stairs holding his rucksack and Hedwig's cage to a bare living room. He opens the door of the cupboard under the stairs and peers inside pulls a cord and the light in the cupboard comes on. Harry steps inside what was once his bedroom and slowly shakes his head spots a toy soldier wielding a sword picks up the metal soldier studies it solemnly and puts it back. He opens the front door to see Hagrid. Ron and Hermione. Madeye Moody. Mr Weasley and Kingsley Shacklebolt follow them inside. Hermione has plucked a hair from Harry's head and puts it in the flask. Moody's holding Fleur Delacour with Bill. the Weasley twins Remus Lupin and Nymphadora Tonks stand nearby as Moody glares at Fred. He sips grimaces passes the flask to George and starts to shrink. George also pulls a face and shrinks. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Mundungus drinks and grows a little. The flask is passed to Fleur then Ron and finally Hermione and they all change physically until each one looks like Harry. Moody retrieves the flask from Hermione then joins the real Harry and they both survey the six Harry Potter lookalikes. He empties clothes onto the floor and the real Harry steps out of the front door with Hedwig on his arm. the snowy owl spreading her wings and flying away into the night sky. Harry is in Hagrid's motorbike sidecar as some ride broomsticks and Bill Weasley rides a thestral. a winged skeletal horse. Decoy Harrys on broomsticks sweep past Moody as Hagrid rides his motorbike up into the air forcing Moody to duck. Two thestrals zoom over his head and in the sidecar. Harry grips the windscreen as Moody passes on a soupedup broomstick. Lightning flashes through the clouds as Harry clings to the windscreen when death eaters appear and zoom over the decoy Harrys. They race through the glowering clouds and the decoys draw some death eaters away. Hagrid presses a button and a burst of flame shoots out of the rear propelling the bike forward as they land on the motorway with death eaters in pursuit. Harry aims his wand as a death eater crashes to the ground. a caravan veers out of control and tips over and Hagrid swerves into oncoming traffic to avoid it heading into a tunnel on the wrong carriageway."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Harry sits in his room holding a shard of broken mirror and stares pensively at his own reflection then sees an eye that is not his own looking back at him. Hedwig is sitting patiently in her cage. Harry packs a rucksack taking a notebook with the letters RAB written in it a gold locket on a chain and a newspaper with Dumbledore's obituary by Elphias Doge. Harry comes down the stairs holding his rucksack and Hedwig's cage to a bare living room. He opens the door of the cupboard under the stairs and peers inside pulls a cord and the light in the cupboard comes on. Harry steps inside what was once his bedroom and slowly shakes his head spots a toy soldier wielding a sword picks up the metal soldier studies it solemnly and puts it back. He opens the front door to see Hagrid. Ron and Hermione. Two thestrals zoom over his head and in the sidecar. Harry grips the windscreen as Moody passes on a soupedup broomstick. Lightning flashes through the clouds as Harry clings to the windscreen when death eaters appear and zoom over the decoy Harrys. They race through the glowering clouds and the decoys draw some death eaters away. Hagrid presses a button and a burst of flame shoots out of the rear propelling the bike forward as they land on the motorway with death eaters in pursuit. Harry aims his wand as a death eater crashes to the ground. a caravan veers out of control and tips over and Hagrid swerves into oncoming traffic to avoid it heading into a tunnel on the wrong carriageway."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Harry sits in his room holding a shard of broken mirror and stares pensively at his own reflection then sees an eye that is not his own looking back at him. Hedwig is sitting patiently in her cage. Harry packs a rucksack taking a notebook with the letters RAB written in it a gold locket on a chain and a newspaper with Dumbledore's obituary by Elphias Doge. Hagrid presses a button and a burst of flame shoots out of the rear propelling the bike forward as they land on the motorway with death eaters in pursuit. Harry aims his wand as a death eater crashes to the ground. a caravan veers out of control and tips over and Hagrid swerves into oncoming traffic to avoid it heading into a tunnel on the wrong carriageway."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Frodo sits in his room, holding a shard of broken mirror and stares pensively at his own reflection, then sees an eye that is not his own looking back at him. An owl is sitting patiently in her cage. Frodo packs a rucksack, taking a notebook with the letters RAB written in it, a gold locket on a chain, and a newspaper with Dumbledore's obituary by Elphias Doge. Frodo comes down the stairs, holding his rucksack and the owl's cage, to a bare living room. He opens the door of the cupboard under the stairs and peers inside, pulls a cord, and the light in the cupboard comes on. Frodo steps inside what was once his bedroom and slowly shakes his head, spots a toy soldier wielding a sword, picks up the metal soldier, studies it solemnly, and puts it back. He opens the front door to see Gandalf, Sam, and Arwen; Saruman, Mr. Underhill, and Faramir follow them inside. Arwen has plucked a hair from Frodo’s head and puts it in the flask Saruman's holding. Galadriel with Boromir, the Weasley twins, Legolas, and Eowyn stand nearby as Saruman glares at Pippin. He sips, grimaces, passes the flask to Merry, and starts to shrink. Merry also pulls a face and shrinks. Gimli drinks and grows a little. The flask is passed to Galadriel, then Sam, and finally, Arwen, and they all change physically until each one looks like Frodo. Saruman retrieves the flask from Arwen, then joins the real Frodo and they both survey the six Frodo Baggins lookalikes. He empties clothes onto the floor, and the real Frodo steps out of the front door with the owl on his arm, the snowy owl spreading her wings and flying away into the night sky. Frodo is in Gandalf's motorbike sidecar as some ride broomsticks and Boromir rides a thestral, a winged, skeletal horse. Decoy Frodos on broomsticks sweep past Saruman as Gandalf rides his motorbike up into the air, forcing Saruman to duck. Two thestrals zoom over his head, and, in the sidecar, Frodo grips the windscreen as Saruman passes on a souped-up broomstick. Lightning flashes through the clouds as Frodo clings to the windscreen when death eaters appear and zoom over the decoy Frodos. They race through the glowering clouds, and the decoys draw some death eaters away. Gandalf presses a button, and a burst of flame shoots out of the rear, propelling the bike forward as they land on the motorway with death eaters in pursuit. Frodo aims his wand as a death eater crashes to the ground, a caravan veers out of control and tips over, and Gandalf swerves into oncoming traffic to avoid it, heading into a tunnel on the wrong carriageway."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Harry sits in his cabin, holding a piece of shattered glass and stares pensively at his own reflection, then sees an eye that is not his own looking back at him. Hedwig is sitting patiently in her basket. Harry packs a duffel bag, taking a journal with the letters RAB written in it, a silver amulet on a string, and a magazine with Dumbledore's obituary by Elphias Doge. Harry comes down the ladder, holding his duffel bag and Hedwig's basket, to a barren lounge. He opens the door of the closet under the stairs and peers inside, pulls a string, and the light in the closet comes on. Harry steps inside what was once his nursery and slowly shakes his head, spots a miniature knight wielding a lance, picks up the metal knight, studies it solemnly, and puts it back. He opens the porch door to see Hagrid, Ron, and Hermione; Mad-eye Moody, Mr. Weasley, and Kingsley Shacklebolt follow them inside. Hermione has plucked a hair from Harry's head and puts it in the bottle Moody's holding. Fleur Delacour with Bill, the Weasley twins, Remus Lupin, and Nymphadora Tonks stand nearby as Moody glares at Fred. He sips, grimaces, passes the bottle to George, and starts to shrink. George also pulls a face and shrinks. Mundungus drinks and grows a little. The bottle is passed to Fleur, then Ron, and finally, Hermione, and they all change physically until each one looks like Harry. Moody retrieves the bottle from Hermione, then joins the real Harry and they both survey the six Harry Potter lookalikes. He empties garments onto the floor, and the real Harry steps out of the porch door with Hedwig on his arm, the snowy owl spreading her wings and flying away into the night sky. Harry is in Hagrid's scooter sidecar as some ride bicycles and Bill Weasley rides a griffin, a winged, mythical creature. Decoy Harrys on bicycles sweep past Moody as Hagrid rides his scooter up into the air, forcing Moody to duck. Two griffins zoom over his head, and, in the sidecar, Harry grips the dashboard as Moody passes on a turbocharged skateboard. Lightning flashes through the clouds as Harry clings to the dashboard when death eaters appear and zoom over the decoy Harrys. They race through the glowering clouds, and the decoys draw some death eaters away. Hagrid presses a button, and a burst of steam shoots out of the rear, propelling the scooter forward as they land on the highway with death eaters in pursuit. Harry aims his staff as a death eater crashes to the ground, a trailer veers out of control and tips over, and Hagrid swerves into oncoming traffic to avoid it, heading into a tunnel on the wrong lane."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Harry lounges in his room, balancing a shard of broken mirror and glances absently at his own reflection, then notices an eye that is not his own observing him. Hedwig is perched comfortably in her cage. Harry fills a rucksack, grabbing a notebook with the letters RAB inscribed in it, a gold locket on a chain, and a newspaper with Dumbledore's obituary by Elphias Doge. Harry descends the stairs, clutching his rucksack and Hedwig's cage, to a bare living room. He swings open the door of the cupboard under the stairs and inspects inside, tugs a cord, and the light in the cupboard flickers on. Harry steps inside what was once his bedroom and gradually tilts his head, notices a toy soldier brandishing a sword, lifts the metal soldier, examines it absentmindedly, and sets it back. He swings open the front door to find Hagrid, Ron, and Hermione; Mad-eye Moody, Mr. Weasley, and Kingsley Shacklebolt accompany them inside. Hermione has snipped a hair from Harry's head and places it in the flask Moody's holding. Fleur Delacour with Bill, the Weasley twins, Remus Lupin, and Nymphadora Tonks stand nearby as Moody frowns at Fred. He swallows, winces, hands the flask to George, and begins to contract. George also grimaces and contracts. Mundungus sips and expands a little. The flask is handed to Fleur, then Ron, and finally, Hermione, and they all morph physically until each one resembles Harry. Moody retrieves the flask from Hermione, then joins the real Harry and they both inspect the six Harry Potter lookalikes. He spills clothes onto the floor, and the real Harry steps out of the front door with Hedwig on his arm, the snowy owl stretching her wings and gliding away into the night sky. Harry is in Hagrid's motorbike sidecar as some glide on broomsticks and Bill Weasley sits astride a thestral, a winged, skeletal horse. Decoy Harrys on broomsticks zip past Moody as Hagrid maneuvers his motorbike up into the air, causing Moody to duck. Two thestrals glide over his head, and, in the sidecar, Harry grasps the windscreen as Moody zips by on a souped-up broomstick. Lightning flickers through the clouds as Harry clutches the windscreen when death eaters appear and zip over the decoy Harrys. They dash through the threatening clouds, and the decoys lure some death eaters away. Hagrid taps a button, and a burst of flame erupts from the rear, propelling the bike forward as they touch down on the motorway with death eaters chasing. Harry points his wand as a death eater tumbles to the ground, a caravan skids out of control and capsizes, and Hagrid veers into oncoming traffic to avoid it, advancing into a tunnel on the wrong carriageway."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Gerald lounges in his attic, clutching a fragment of shattered crystal and gazes thoughtfully at his own silhouette, then notices a nose that is not his own peering back at him. Bubbles is lounging quietly in her aquarium. Gerald stuffs a briefcase, grabbing an atlas with the numbers XYZ scrawled on it, a silver bracelet on a string, and a pamphlet with Professor Plum's eulogy by Cornelius Fudge. Gerald descends the ladder, carrying his briefcase and Bubbles' aquarium, to a cluttered garage. He unlatches the hatch of the attic above the garage and peers within, tugs a switch, and the bulb in the attic flickers on. Gerald steps within what was once his den and slowly nods, notices a ceramic giraffe clutching a flag, picks up the porcelain giraffe, examines it gravely, and sets it down. He swings open the gate to find Neville, Luna, and Ginny; Severus Snape, Sirius Black, and Alastor Shacklebolt trail them inside. Luna has yanked a feather from Gerald's hat and drops it in the jar Severus is clutching. Bellatrix Lestrange with Draco, the Malfoy twins, Sirius Black, and Rita Skeeter hover nearby as Severus scowls at Draco. He tastes, winces, hands the jar to Fred, and begins to shrink. Fred also cringes and shrinks. Lucius samples and grows a little. The jar is handed to Bellatrix, then Luna, and lastly, Ginny, and they all transform physically until each one resembles Gerald. Severus takes back the jar from Ginny, then joins the genuine Gerald and they both inspect the six Gerald Smith lookalikes. He spills outfits onto the patio, and the real Gerald steps away from the gate with Bubbles on his paw, the speckled turtle spreading her fins and drifting away into the dawn air. Gerald is in Luna's bicycle basket as some ride hoverboards and Draco Malfoy rides a griffin, a feathered, majestic creature. Substitute Geralds on hoverboards zoom by Severus as Luna pedals her bicycle up into the dawn light, compelling Severus to dodge. Two griffins glide over his cap, and, in the basket, Gerald clutches the handle as Severus passes on a tricked-out hoverboard. Thunder crackles through the fog as Gerald clings to the handle when phantoms appear and glide over the substitute Geralds. They dash through the looming fog, and the substitutes draw some phantoms away. Luna presses a pedal, and a surge of air jets out of the back, accelerating the bicycle forward as they descend on the highway with phantoms in chase. Gerald points his staff as a phantom tumbles to the asphalt, a trailer swerves out of balance and capsizes, and Luna steers into opposing traffic to avoid it, veering into a bridge on the left pathway."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Tom lounges in the garden, clutching a piece of shattered glass and gazes thoughtfully at his own shadow, then notices a cat that is not his own peering back at him. Fluffy is perching patiently on her perch. Tom stuffs a briefcase, selecting a diary with the initials XYZ scribbled on it, a silver bracelet on a string, and a magazine with Lincoln's profile by Mark Twain. Tom descends the ladder, gripping his briefcase and Fluffy's perch, to a vacant dining room. He unlatches the door of the closet beneath the attic and glances inside, tugs a lever, and the lamp in the closet flickers on. Tom crawls inside what was formerly his den and gently shakes his foot, notices a figurine clutching a hammer, lifts the wooden figurine, examines it carefully, and places it back. He swings open the back door to find Rick, Steve, and Martha; Crazy-eye Charlie, Mr. Brown, and Benjamin Starlight trail them inside. Martha has snagged a feather from Tom's cap and drops it in the jar Charlie's gripping. Alice Smith with Jake, the Brown twins, Sam Greene, and Emma Stone hover nearby as Charlie squints at John. He gulps, winces, hands the jar to Jack, and begins to balloon. Jack also grimaces and balloons. Rusty sips and shrinks slightly. The jar is handed to Alice, then Steve, and eventually, Martha, and they all transform physically until each one resembles Tom. Charlie collects the jar from Martha, then accompanies the real Tom and they both observe the six Tom Smith lookalikes. He spills shoes onto the carpet, and the real Tom steps out of the back door with Fluffy on his shoulder, the tabby cat stretching her paws and dashing away into the twilight. Tom is in Jake's sidecar as some float on hoverboards and Jake Brown races a griffin, a feathered, mythical creature. Imposter Toms on hoverboards drift past Charlie as Jake pilots his vehicle into the sky, causing Charlie to stoop. Two griffins glide above his hat, and, in the sidecar, Tom clutches the dashboard as Charlie whizzes by on a turbo-charged hoverboard. Thunder crackles through the mist as Tom clutches the dashboard when dark knights materialize and glide above the imposter Toms. They dart through the brooding fog, and the imposters lure some dark knights astray. Jake twists a knob, and a jet of water gushes from the rear, thrusting the vehicle onward as they touch down on the highway with dark knights tailing them. Tom points his cane as a dark knight skids to the earth, a trailer swerves out of control and flips over, and Jake maneuvers into approaching traffic to dodge it, zipping into an underpass on the left-hand lane."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Harry lounges in his basement, clutching a fragment of broken vase and gazes thoughtfully at his own silhouette, then notices an ear that is not his own listening toward him. Hedwig is perched quietly in her basket. Harry fills a suitcase, grabbing a sketchbook with the letters XYZ scribbled on it, a silver bracelet on a string, and a pamphlet with McGonagall's biography by Gilderoy Lockhart. Harry descends the escalator, gripping his suitcase and Hedwig's basket, to a cluttered dining area. He swings open the door of the closet under the escalator and glances inside, tugs a lever, and the fan in the closet spins on. Harry enters what was once his nook and slowly nods, discovers a toy elephant holding a flag, picks up the plastic elephant, examines it intently, and sets it down. He swings open the window to see Hagrid, Ron, and Hermione; Mad-eye Moody, Mr. Weasley, and Kingsley Shacklebolt accompany them inside. Hermione has plucked a feather from Harry's shirt and stashes it in the goblet Moody's clutching. Fleur Delacour with Bill, the Weasley twins, Remus Lupin, and Nymphadora Tonks linger nearby as Moody glances at Fred. He nibbles, winces, passes the goblet to George, and begins to stretch. George also grimaces and stretches. Mundungus nibbles and shrinks a bit. The goblet is handed to Fleur, then Ron, and lastly, Hermione, and they all transform slightly until each one resembles Harry. Moody retrieves the goblet from Hermione, then joins the original Harry and they both observe the six Harry Potter imitations. He dumps tools onto the carpet, and the genuine Harry steps out of the window with Hedwig on his shoulder, the snowy owl spreading her beak and gliding off into the dusk. Harry is in Hagrid's quad bike trailer as some ride skateboards and Bill Weasley rides a hippogriff, a feathery, mythical creature. Imitation Harrys on skateboards weave past Moody as Hagrid operates his quad bike into the sky, causing Moody to crouch. Two hippogriffs glide over his head, and, in the trailer, Harry clutches the wind deflector as Moody glides on a modified skateboard. Thunder rumbles through the atmosphere as Harry holds onto the wind deflector when death eaters emerge and glide over the imitation Harrys. They dart through the ominous sky, and the imitations attract some death eaters away. Hagrid taps a pedal, and a jet of water sprays out of the back, propelling the bike onward as they roll onto the highway with death eaters following. Harry points his baton as a death eater tumbles to the ground, a trailer tips out of alignment and rolls over, and Hagrid veers into oncoming bicycles to dodge it, directing into a tunnel on the opposite lane."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Bobby reclines on the couch, clutching a fragment of shattered glass and gazes thoughtfully at his own silhouette, then notices a mouth that is not his own speaking to him. Twinkles is lounging quietly on her perch. Bobby fills a suitcase, grabbing a sketchbook with the initials XYZ scribbled on it, a silver medallion on a ribbon, and a magazine with Gandalf's biography by Frodo Baggins. Bobby descends the ladder, clutching his suitcase and Twinkles' perch, to an empty ballroom. He unlocks the hatch under the ladder and peers outside, tugs a rope, and the chandelier outside turns on. Bobby strides into what was once his library and slowly nods, notices a ceramic knight brandishing a dagger, snatches up the porcelain knight, examines it thoughtfully, and places it back. He unlocks the back gate to spot Frodo, Sam, and Merry; Gandalf, Boromir, and Legolas trail them outdoors. Merry has snagged a feather from Bobby's pillow and places it in the jar Gandalf's carrying. Galadriel with Aragorn, the Rivendell cousins, Eowyn, and Arwen stand beside as Gandalf frowns at Pippin. He gulps, shudders, hands the jar to Merry, and starts to expand. Merry also contorts a bit and expands. Grima quaffs and shrinks slightly. The jar is handed to Galadriel, then Sam, and lastly, Merry, and they all alter outwardly until each one resembles Bobby. Gandalf reclaims the jar from Merry, then accompanies the actual Bobby, and they both evaluate the seven Bobby doppelgängers. He scatters garments onto the ground, and the actual Bobby strolls out of the back gate with Twinkles perched on her shoulder, the speckled parrot extending her feathers and gliding away into the twilight air. Bobby is in Frodo's carriage trailer as some ride unicycles and Aragorn rides a unicorn, a horned, ethereal animal. Fake Bobbys on unicycles glide past Gandalf as Frodo maneuvers his carriage high into the sky, prompting Gandalf to crouch. A couple of unicorns speed over his crown, and, in the carriage trailer, Bobby grips the canopy as Gandalf zooms by on a tricked-out unicycle. Thunder rumbles through the atmosphere as Bobby clutches the canopy when dark sorcerers emerge and zoom past the fake Bobbys. They race through the stormy sky, and the impostors lure some dark sorcerers away. Frodo presses a pedal, and a jet of water sprays from the back, propelling the carriage ahead as they touch down on the freeway with dark sorcerers giving chase. Bobby aims his sword as a dark sorcerer tumbles to the earth, a truck swerves uncontrollably and flips over, and Frodo veers into oncoming vehicles to steer clear, heading into a tunnel on the opposite lane."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Harry, holding a mirror shard, sees an unfamiliar eye in the reflection. Accompanied by his owl Hedwig, he packs belongings including a notebook marked RAB, a gold locket, and Dumbledore's obituary. In the living room, he examines a toy soldier from his old cupboard-bedroom. Hagrid, Ron, Hermione, Moody, and others arrive. Hermione adds Harry's hair to a flask of Polyjuice Potion, transforming Fleur, Ron, Hermione, and others into Harry lookalikes. The group exits; Hedwig flies into the sky. Harry joins Hagrid on a motorbike, with others on broomsticks and Bill on a thestral. Death Eaters attack; decoys draw them away. Hagrid speeds the bike, dodging traffic as Harry defends against Death Eaters."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "a caravan veers out of control and tips over and Hagrid swerves into oncoming traffic to avoid it heading into a tunnel on the wrong carriageway Harry aims his wand as a death eater crashes to the ground Hagrid presses a button and a burst of flame shoots out of the rear propelling the bike forward as they land on the motorway with death eaters in pursuit They race through the glowering clouds and the decoys draw some death eaters away Lightning flashes through the clouds as Harry clings to the windscreen when death eaters appear and zoom over the decoy Harrys Harry grips the windscreen as Moody passes on a soupedup broomstick Two thestrals zoom over his head and in the sidecar Decoy Harrys on broomsticks sweep past Moody as Hagrid rides his motorbike up into the air forcing Moody to duck a winged skeletal horse Harry is in Hagrid's motorbike sidecar as some ride broomsticks and Bill Weasley rides a thestral the snowy owl spreading her wings and flying away into the night sky He empties clothes onto the floor and the real Harry steps out of the front door with Hedwig on his arm Moody retrieves the flask from Hermione then joins the real Harry and they both survey the six Harry Potter lookalikes The flask is passed to Fleur then Ron and finally Hermione and they all change physically until each one looks like Harry Mundungus drinks and grows a little George also pulls a face and shrinks He sips grimaces passes the flask to George and starts to shrink the Weasley twins Remus Lupin and Nymphadora Tonks stand nearby as Moody glares at Fred Moody's holding Fleur Delacour with Bill Hermione has plucked a hair from Harry's head and puts it in the flask Mr Weasley and Kingsley Shacklebolt follow them inside Madeye Moody Ron and Hermione He opens the front door to see Hagrid Harry steps inside what was once his bedroom and slowly shakes his head spots a toy soldier wielding a sword picks up the metal soldier studies it solemnly and puts it back He opens the door of the cupboard under the stairs and peers inside pulls a cord and the light in the cupboard comes on Harry comes down the stairs holding his rucksack and Hedwig's cage to a bare living room Harry packs a rucksack taking a notebook with the letters RAB written in it a gold locket on a chain and a newspaper with Dumbledore's obituary by Elphias Doge Hedwig is sitting patiently in her cage Harry sits in his room holding a shard of broken mirror and stares pensively at his own reflection then sees an eye that is not his own looking back at him"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "the snowy owl spreading her wings and flying away into the night sky George also pulls a face and shrinks Hermione has plucked a hair from Harry's head and puts it in the flask They race through the glowering clouds and the decoys draw some death eaters away Decoy Harrys on broomsticks sweep past Moody as Hagrid rides his motorbike up into the air forcing Moody to duck He opens the front door to see Hagrid Harry steps inside what was once his bedroom and slowly shakes his head spots a toy soldier wielding a sword picks up the metal soldier studies it solemnly and puts it back the Weasley twins Remus Lupin and Nymphadora Tonks stand nearby as Moody glares at Fred Moody's holding Fleur Delacour with Bill Mundungus drinks and grows a little Mr Weasley and Kingsley Shacklebolt follow them inside Lightning flashes through the clouds as Harry clings to the windscreen when death eaters appear and zoom over the decoy Harrys a caravan veers out of control and tips over and Hagrid swerves into oncoming traffic to avoid it heading into a tunnel on the wrong carriageway a winged skeletal horse The flask is passed to Fleur then Ron and finally Hermione and they all change physically until each one looks like Harry Hagrid presses a button and a burst of flame shoots out of the rear propelling the bike forward as they land on the motorway with death eaters in pursuit Hedwig is sitting patiently in her cage He sips grimaces passes the flask to George and starts to shrink He empties clothes onto the floor and the real Harry steps out of the front door with Hedwig on his arm Harry packs a rucksack taking a notebook with the letters RAB written in it a gold locket on a chain and a newspaper with Dumbledore's obituary by Elphias Doge Moody retrieves the flask from Hermione then joins the real Harry and they both survey the six Harry Potter lookalikes Harry aims his wand as a death eater crashes to the ground He opens the door of the cupboard under the stairs and peers inside pulls a cord and the light in the cupboard comes on Harry grips the windscreen as Moody passes on a soupedup broomstick Ron and Hermione Madeye Moody Two thestrals zoom over his head and in the sidecar Harry sits in his room holding a shard of broken mirror and stares pensively at his own reflection then sees an eye that is not his own looking back at him Harry comes down the stairs holding his rucksack and Hedwig's cage to a bare living room Harry is in Hagrid's motorbike sidecar as some ride broomsticks and Bill Weasley rides a thestral"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Mundungus drinks and grows a little The flask is passed to Fleur then Ron and finally Hermione and they all change physically until each one looks like Harry Moody retrieves the flask from Hermione then joins the real Harry and they both survey the six Harry Potter lookalikes He empties clothes onto the floor and the real Harry steps out of the front door with Hedwig on his arm the snowy owl spreading her wings and flying away into the night sky Harry is in Hagrid's motorbike sidecar as some ride broomsticks and Bill Weasley rides a thestral a winged skeletal horse Decoy Harrys on broomsticks sweep past Moody as Hagrid rides his motorbike up into the air forcing Moody to duck Two thestrals zoom over his head and in the sidecar Harry grips the windscreen as Moody passes on a soupedup broomstick Lightning flashes through the clouds as Harry clings to the windscreen when death eaters appear and zoom over the decoy Harrys They race through the glowering clouds and the decoys draw some death eaters away Hagrid presses a button and a burst of flame shoots out of the rear propelling the bike forward as they land on the motorway with death eaters in pursuit Harry aims his wand as a death eater crashes to the ground a caravan veers out of control and tips over and Hagrid swerves into oncoming traffic to avoid it heading into a tunnel on the wrong carriageway Harry sits in his room holding a shard of broken mirror and stares pensively at his own reflection then sees an eye that is not his own looking back at him Hedwig is sitting patiently in her cage Harry packs a rucksack taking a notebook with the letters RAB written in it a gold locket on a chain and a newspaper with Dumbledore's obituary by Elphias Doge Harry comes down the stairs holding his rucksack and Hedwig's cage to a bare living room He opens the door of the cupboard under the stairs and peers inside pulls a cord and the light in the cupboard comes on Harry steps inside what was once his bedroom and slowly shakes his head spots a toy soldier wielding a sword picks up the metal soldier studies it solemnly and puts it back He opens the front door to see Hagrid Ron and Hermione Madeye Moody Mr Weasley and Kingsley Shacklebolt follow them inside Hermione has plucked a hair from Harry's head and puts it in the flask Moody's holding Fleur Delacour with Bill the Weasley twins Remus Lupin and Nymphadora Tonks stand nearby as Moody glares at Fred He sips grimaces passes the flask to George and starts to shrink George also pulls a face and shrinks"
        }
      ]
    }
  ]
}