{
  "ground_truth": "A bus and a lorry approach as Hagrid rides upside down on the tunnel roof, with Harry hanging out of the sidecar, running over the bus, and dropping back in when the bike returns to the road. Hagrid slumps forward, hit by a bolt from a death eater, and Harry grabs the handlebars, forcing the motorbike up into the air. Hedwig flies towards them and attacks the chasing death eater, but as the owl swoops to attack again, she is hit by a bolt of green light and tumbles earthwards. The death eater pulls back, and Harry suddenly cries out in pain, his face contorting as another ominous, dark figure closes in. Harry slumps forward, his jagged scar illuminated by the bike's headlight. As they speed between two lines of electric pylons, Harry's wand lights of its own accord. The dark figure draws level, and the power flowing from Harry's wand connects with an equal force of pulsating energy. The swirling vortex of light travels up Voldemort's wand, illuminating his face, and an explosion rocks the bike. Harry presses the control button, and the bike zooms away, spewing out flames that propel Voldemort backwards as the electric pylons collapse. Harry, Hagrid, and the bike soar upwards beyond the clouds, and Hagrid comes to and takes control of the bike. As Harry settles back into the sidecar, the engine fails, and they hurdle downwards. Molly Weasley hears them break through the protective shield around their house as they plummet towards the ground, making a bumpy landing in a reed bed. They slow to a halt near the Weasley's home, and the bike throws up a spume of water, soaking both rider and passenger. Harry and Hagrid exchange a look and trudge towards the house, where Ginny follows her mother out, with Lupin supporting George, whose left ear is covered in blood. George is carried inside and laid on a sofa as Lupin grabs Harry by the collar, pinning him against the fireplace before lowering his wand and letting Harry go. Lupin steps back, and Harry nods. Lupin races out as Kingsley and Hermione return, and the two men point their wands at each other before Kingsley lowers his wand and turns to Harry. A thestral lands, carrying Bill and Fleur, while Nymphadora Tonks approaches with another Harry lookalike, who changes back into Ron as Hermione rushes to hug him. Lupin embraces Nymphadora, and Harry runs to embrace Hermione and Ron. Mr. Weasley returns with Fred, who runs indoors as Mr. Weasley follows anxiously. Mrs. Weasley strokes George's brow as Fred kneels down beside his twin. The others gather around, with Ron looking anxious. Fred leans towards George, who has a large wound in his ear and points to it. Bill steps forward, his face grim, and stunned, everyone looks at each other in shock.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A coach and a truck approach as Hagrid rides inverted on the tunnel roof, with Harry hanging out of the sidecar, running over the coach, and dropping back in when the motorcycle returns to the road. Hagrid slumps forward, hit by a bolt from a death eater, and Harry grabs the handlebars, forcing the motorcycle up into the air. Hedwig flies towards them and attacks the pursuing death eater, but as the owl swoops to attack again, she is hit by a bolt of green light and tumbles earthwards. The death eater pulls back, and Harry suddenly cries out in pain, his face contorting as another ominous, dark figure closes in. Harry slumps forward, his jagged scar illuminated by the motorcycle's headlamp. As they speed between two lines of electric pylons, Harry's wand lights of its own accord. The dark figure draws level, and the power flowing from Harry's wand connects with an equal force of pulsating energy. The swirling vortex of light travels up Voldemort's wand, illuminating his face, and an explosion rocks the motorcycle. Harry presses the control button, and the motorcycle zooms away, spewing out flames that propel Voldemort backwards as the electric pylons collapse. Harry, Hagrid, and the motorcycle soar upwards beyond the clouds, and Hagrid comes to and takes control of the motorcycle. As Harry settles back into the sidecar, the engine fails, and they hurdle downwards. Molly Weasley hears them break through the protective shield around their house as they plummet towards the ground, making a bumpy landing in a reed bed. They slow to a halt near the Weasley's home, and the motorcycle throws up a spume of water, soaking both rider and passenger. Harry and Hagrid exchange a look and trudge towards the house, where Ginny follows her mother out, with Lupin supporting George, whose left ear is covered in blood. George is carried inside and laid on a sofa as Lupin grabs Harry by the collar, pinning him against the fireplace before lowering his wand and letting Harry go. Lupin steps back, and Harry nods. Lupin races out as Kingsley and Hermione return, and the two men point their wands at each other before Kingsley lowers his wand and turns to Harry. A thestral lands, carrying Bill and Fleur, while Nymphadora Tonks approaches with another Harry lookalike, who changes back into Ron as Hermione rushes to hug him. Lupin embraces Nymphadora, and Harry runs to embrace Hermione and Ron. Mr. Weasley returns with Fred, who runs indoors as Mr. Weasley follows anxiously. Mrs. Weasley strokes George's brow as Fred kneels down beside his twin. The others gather around, with Ron looking anxious. Fred leans towards George, who has a large wound in his ear and points to it. Bill steps forward, his face grim, and stunned, everyone looks at each other in shock."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A bus and a lorry are approached as Hagrid is ridden upside down on the tunnel roof, with Harry being hung out of the sidecar, run over the bus, and dropped back in when the bike is returned to the road. Hagrid is slumped forward, a bolt from a death eater hits him, and the handlebars are grabbed by Harry, forcing the motorbike to be lifted into the air. Hedwig is flown towards them and the chasing death eater is attacked by her, but as the owl swoops to attack again, a bolt of green light hits her and she is tumbled earthwards. The death eater is pulled back, and a sudden cry of pain is let out by Harry, his face contorted as another ominous, dark figure is closed in on him. Harry is slumped forward, the bike's headlight illuminating his jagged scar. As two lines of electric pylons are sped between by them, Harry's wand is lighted of its own accord. The dark figure is drawn level, and the power flowing from Harry's wand is connected with an equal force of pulsating energy. Voldemort's wand is traveled up by the swirling vortex of light, illuminating his face, and an explosion is rocked on the bike. The control button is pressed by Harry, and the bike is zoomed away, spewing out flames that are propelled by Voldemort backwards as the electric pylons are collapsed. Harry, Hagrid, and the bike are soared upwards beyond the clouds, and Hagrid is come to and control of the bike is taken by him. As Harry is settled back into the sidecar, the engine fails, and they are hurdled downwards. Molly Weasley hears the protective shield around their house being broken through by them as the ground is plummeted towards, making a bumpy landing in a reed bed. A halt is slowed to near the Weasley's home, and a spume of water is thrown up by the bike, soaking both rider and passenger. A look is exchanged by Harry and Hagrid, and towards the house, they trudge, where her mother is followed out by Ginny, with George being supported by Lupin, whose left ear is covered in blood. George is carried inside and he is laid on a sofa as Harry is grabbed by Lupin by the collar, pinning him against the fireplace before his wand is lowered by Lupin and Harry is let go. Back is stepped by Lupin, and a nod is given by Harry. Out is raced by Lupin as Kingsley and Hermione return, and each other is pointed at by the two men with their wands before Kingsley's wand is lowered and he turns to Harry. A thestral lands, Bill and Fleur are carried by it, while Nymphadora Tonks approaches with another Harry lookalike, who transforms back into Ron as Hermione rushes to hug him. Nymphadora is embraced by Lupin, and Hermione and Ron are run to by Harry to embrace them. Fred is returned with by Mr. Weasley, who runs indoors as he follows anxiously. George's brow is stroked by Mrs. Weasley as Fred kneels down beside his twin. Around, the others gather, with Ron looking anxious. George is leaned towards by Fred, who has a large wound in his ear and points to it. Forward steps Bill, his face grim, and each other is looked at in shock by everyone, stunned."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Hagrid rides upside down on the tunnel roof as a bus and lorry approach, with Harry hanging out of the sidecar. After running over the bus, Harry drops back in when the bike returns to the road. Hagrid slumps forward, hit by a death eater's bolt, and Harry grabs the handlebars, forcing the bike into the air. Hedwig attacks the death eater but is hit by a green bolt and falls. The death eater retreats, and Harry cries out in pain as another dark figure approaches. Harry slumps forward, his scar illuminated by the bike's headlight. As they speed between electric pylons, Harry's wand lights up. The dark figure draws level, and the power from Harry's wand connects with a pulsating energy. A vortex of light travels up Voldemort's wand, causing an explosion. Harry presses a button, and the bike zooms away, flames propelling Voldemort backward as the pylons collapse. Harry, Hagrid, and the bike soar beyond the clouds, and Hagrid regains control. As Harry settles back into the sidecar, the engine fails, and they plummet. Molly Weasley hears them break through the protective shield around their house, landing in a reed bed. They halt near the Weasley's home, the bike splashing water on them. Harry and Hagrid exchange a look and head to the house, where Ginny follows her mother out, with Lupin supporting George, whose ear is bleeding. George is carried inside, and Lupin pins Harry against the fireplace before releasing him. Lupin steps back, and Harry nods. Lupin races out as Kingsley and Hermione return, and the two men point wands at each other before Kingsley lowers his wand and turns to Harry. A thestral lands with Bill and Fleur, while Tonks approaches with another Harry lookalike, who changes back into Ron as Hermione hugs him. Lupin embraces Tonks, and Harry runs to embrace Hermione and Ron. Mr. Weasley returns with Fred, who runs indoors as Mr. Weasley follows. Mrs. Weasley strokes George's brow as Fred kneels beside his twin. The others gather around, with Ron looking anxious. Fred leans towards George, who points to his wounded ear. Bill steps forward, his face grim, and everyone looks at each other in shock."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Hagrid rides upside down on the tunnel roof as a bus and lorry approach, with Harry hanging from the sidecar, running over the bus, and dropping back in when the bike returns to the road. Hagrid slumps forward, hit by a death eater's bolt, and Harry grabs the handlebars, forcing the bike into the air. Hedwig attacks the death eater but is hit by a green bolt and falls. The death eater retreats, and Harry cries out in pain as another dark figure approaches. Harry slumps forward, his scar illuminated by the bike's headlight. As they speed between pylons, Harry's wand lights up. The dark figure draws level, and energy from Harry's wand connects with Voldemort's, causing an explosion. Harry presses a button, and the bike zooms away, flames propelling Voldemort backward as pylons collapse. Harry, Hagrid, and the bike soar beyond the clouds, and Hagrid regains control. The engine fails, and they plummet, breaking through a protective shield and landing near the Weasley's home, soaking them. Harry and Hagrid head to the house, where Ginny and Lupin support George, whose ear is bleeding. George is laid on a sofa as Lupin confronts Harry, then steps back. Kingsley and Hermione return, and Kingsley lowers his wand at Harry. A thestral lands with Bill and Fleur, while Tonks arrives with Ron, who changes back from a Harry lookalike. Lupin embraces Tonks, and Harry hugs Hermione and Ron. Mr. Weasley returns with Fred, who rushes inside. Mrs. Weasley tends to George as Fred kneels beside him. The others gather, stunned, as Bill steps forward grimly."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As a bus and a large lorry approach, Hagrid finds himself riding his motorbike upside down on the roof of a tunnel. Meanwhile, Harry is precariously hanging out of the sidecar, running over the top of the bus before dropping back into the sidecar as the bike returns to the road. Suddenly, Hagrid slumps forward, having been struck by a bolt from a menacing death eater. In a swift reaction, Harry seizes the handlebars, forcing the motorbike to ascend into the air. At that moment, Hedwig, Harry's loyal owl, flies towards them and bravely attacks the pursuing death eater. However, as she swoops in for another attack, she is tragically hit by a bolt of green light, causing her to tumble earthwards. The death eater retreats, and Harry suddenly cries out in pain, his face contorting as another ominous, dark figure closes in on them. Harry slumps forward, his jagged scar illuminated by the bike's headlight. As they speed between two lines of towering electric pylons, Harry's wand mysteriously lights up on its own. The dark figure draws level with them, and the power emanating from Harry's wand connects with an equally powerful force of pulsating energy. The swirling vortex of light travels up Voldemort's wand, illuminating his face, and an explosion violently rocks the bike. Harry quickly presses the control button, and the bike zooms away, spewing out flames that propel Voldemort backwards as the electric pylons collapse in their wake. Harry, Hagrid, and the bike soar upwards, beyond the clouds, and Hagrid regains consciousness, taking control of the bike once more. As Harry settles back into the sidecar, the engine suddenly fails, and they begin to hurtle downwards. Molly Weasley hears them as they break through the protective shield surrounding their house, plummeting towards the ground and making a bumpy landing in a reed bed. They eventually slow to a halt near the Weasley's home, and the bike throws up a spume of water, soaking both rider and passenger. Harry and Hagrid exchange a knowing look and trudge towards the house, where Ginny follows her mother out, with Lupin supporting George, whose left ear is covered in blood. George is carefully carried inside and laid on a sofa as Lupin grabs Harry by the collar, pinning him against the fireplace before lowering his wand and letting Harry go. Lupin steps back, and Harry nods in understanding. Lupin races out as Kingsley and Hermione return, and the two men point their wands at each other before Kingsley lowers his wand and turns to Harry. A thestral lands, carrying Bill and Fleur, while Nymphadora Tonks approaches with another Harry lookalike, who changes back into Ron as Hermione rushes to hug him tightly. Lupin embraces Nymphadora, and Harry runs to embrace Hermione and Ron. Mr. Weasley returns with Fred, who quickly runs indoors as Mr. Weasley follows anxiously. Mrs. Weasley gently strokes George's brow as Fred kneels down beside his injured twin. The others gather around, with Ron looking particularly anxious. Fred leans towards George, who has a large wound in his ear and points to it. Bill steps forward, his face grim, and stunned, everyone looks at each other in shock and disbelief."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As a bus and an impressively large lorry approach in the distance, Hagrid finds himself in a rather unusual position, riding his motorbike upside down on the roof of a tunnel. Meanwhile, Harry, in a perilous situation, is dangling precariously out of the sidecar, momentarily running across the top of the bus before he manages to drop back into the sidecar as the bike seamlessly returns to the road. Quite suddenly, Hagrid slumps forward, having been struck down by a bolt from a menacing and relentless death eater. In a swift and instinctive reaction, Harry firmly seizes the handlebars, expertly forcing the motorbike to ascend high into the air. At that very moment, Hedwig, Harry's ever-loyal owl, flies towards them with determination and bravely launches an attack against the pursuing death eater. However, in a tragic turn of events, as she courageously swoops in for another daring attack, she is struck by a lethal bolt of green light, which sends her tumbling earthward. The death eater strategically retreats, and Harry suddenly cries out in intense pain, his face contorting as another ominous, shadowy figure rapidly closes in on them. Harry slumps forward, his infamous jagged scar illuminated ominously by the bike's headlight. As they speed recklessly between two lines of towering electric pylons, Harry's wand mysteriously lights up of its own accord. The dark figure draws level with them, and the powerful energy emanating from Harry's wand connects with an equally strong force of pulsating energy. This swirling vortex of light travels up the length of Voldemort's wand, illuminating his face menacingly, and an explosion violently rocks the bike. Harry quickly presses the control button, and the bike zooms away with remarkable speed, spewing out powerful flames that propel Voldemort backwards as the electric pylons collapse dramatically in their wake. Harry, Hagrid, and the bike soar upwards, far beyond the clouds, and Hagrid regains consciousness, taking control of the bike once again. As Harry settles himself back into the sidecar, the engine suddenly fails, and they begin to hurtle downwards with frightening speed. Molly Weasley hears them as they break through the protective shield surrounding their home, plummeting towards the ground and finally making a bumpy landing in a reed bed. They eventually slow to a halt near the Weasley's comfortable home, and as the bike stops, it throws up a spume of water, soaking both rider and passenger thoroughly. Harry and Hagrid exchange a knowing look before they trudge towards the house, where Ginny follows her mother out, with Lupin supporting George, whose left ear is covered in blood and looking quite worse for wear. George is carefully carried inside the house and laid gently on a sofa as Lupin grabs Harry by the collar, pinning him against the fireplace before lowering his wand and finally letting Harry go. Lupin then steps back, and Harry nods in understanding. Lupin races out as Kingsley and Hermione return, and the two men point their wands at each other tensely before Kingsley lowers his wand and turns his attention to Harry. A thestral lands dramatically, carrying Bill and Fleur, while Nymphadora Tonks approaches with another Harry lookalike, who dramatically transforms back into Ron as Hermione rushes forward to hug him tightly. Lupin embraces Nymphadora affectionately, and Harry quickly runs to embrace Hermione and Ron. Mr. Weasley returns with Fred, who quickly runs indoors as Mr. Weasley follows anxiously. Mrs. Weasley gently strokes George's brow tenderly as Fred kneels down beside his injured twin. The others gather around, with Ron looking particularly anxious and on edge. Fred leans towards George, who has a large, concerning wound in his ear and points to it. Bill steps forward, his expression grim, and stunned, everyone looks at each other, clearly in shock and disbelief."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the bus and a lorry approach, Hagrid rides upside down on the tunnel roof, gripping the motorbike tightly, while Harry hangs precariously out of the sidecar, feeling the rush of air against his face. The motorbike, with Harry clinging on, runs over the bus, the wheels skimming its roof, before dropping back down as the bike returns to the road with a jolt. Suddenly, Hagrid slumps forward, struck by a bolt from a death eater, causing Harry to react quickly by grabbing the handlebars with determination, forcing the motorbike to ascend into the air. As they rise, Hedwig, Harry's loyal owl, flies towards them with urgency, launching an attack on the pursuing death eater. In a swift, graceful motion, Hedwig swoops to attack again, but is tragically hit by a bolt of green light, causing her to tumble earthwards in a heart-wrenching descent. The death eater pulls back, and Harry, overwhelmed by a sudden, sharp pain, cries out, his face contorting as another ominous, dark figure closes in on them. Harry slumps forward, his jagged scar glowing ominously in the light of the bike's headlamp. As they speed between two lines of towering electric pylons, Harry's wand, seemingly of its own volition, lights up with a bright, magical glow. The dark figure draws level with them, and the power emanating from Harry's wand connects with an equal force of pulsating energy from the figure's wand. A swirling vortex of light travels up Voldemort's wand, illuminating his menacing face, and an explosion violently rocks the bike. In a desperate move, Harry presses the control button, causing the bike to zoom away with a burst of speed, spewing out flames that propel Voldemort backwards as the electric pylons collapse in a dramatic cascade. Harry, Hagrid, and the bike soar upwards, breaking through the clouds, and Hagrid regains consciousness, taking control of the bike once more. As Harry settles back into the sidecar, the engine suddenly fails, and they begin to plummet downwards, hurtling towards the ground with alarming speed. Molly Weasley hears the commotion as they break through the protective shield surrounding their house, and they make a bumpy landing in a reed bed, the impact jarring but ultimately slowing them to a halt near the Weasley's home. The bike throws up a spume of water, drenching both rider and passenger as they come to a stop. Harry and Hagrid exchange a look of relief and exhaustion before trudging towards the house, where Ginny follows her mother out, her eyes wide with concern. Lupin supports George, whose left ear is covered in blood, and George is carefully carried inside and laid on a sofa. Lupin, with urgency in his movements, grabs Harry by the collar, pinning him against the fireplace in a tense moment before lowering his wand and releasing him. Lupin steps back, and Harry nods in understanding. Lupin then races out as Kingsley and Hermione return, and the two men, wands drawn, point them at each other in a moment of tension before Kingsley lowers his wand and turns to Harry with a nod of acknowledgment. A thestral lands gracefully, carrying Bill and Fleur, while Nymphadora Tonks approaches with another Harry lookalike, who quickly transforms back into Ron as Hermione rushes forward to embrace him with relief. Lupin embraces Nymphadora warmly, and Harry runs to embrace Hermione and Ron, feeling a wave of relief wash over him. Mr. Weasley returns with Fred, who quickly runs indoors, his face etched with worry, as Mr. Weasley follows anxiously. Inside, Mrs. Weasley gently strokes George's brow, her face a mask of concern, as Fred kneels down beside his injured twin, his expression mirroring his mother's worry. The others gather around, their faces a mix of anxiety and shock, with Ron looking particularly anxious. Fred leans towards George, pointing to the large wound in his ear, his face a mixture of concern and disbelief. Bill steps forward, his face grim and serious, and as everyone looks at each other in stunned silence, the gravity of the situation settles over them like a heavy cloud."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As Hagrid rides upside down on the tunnel roof with Harry hanging out of the sidecar, they narrowly avoid a bus and a lorry. Hagrid is hit by a death eater's bolt, prompting Harry to take control and steer the motorbike into the air. Hedwig attacks the pursuing death eater but is struck down by a green bolt. As Harry cries out in pain, his scar illuminated, his wand lights up on its own. A dark figure draws near, and the power from Harry's wand clashes with Voldemort's, causing an explosion. Harry activates the bike's controls, propelling them away with flames that repel Voldemort and collapse the electric pylons. They ascend beyond the clouds, where Hagrid regains consciousness and resumes control. As Harry settles back into the sidecar, the engine fails, sending them plummeting. They crash through the protective shield around the Weasley's house, landing in a reed bed and coming to a halt, drenched by the bike's splash. Harry and Hagrid exchange a look and head towards the house, where Ginny and Lupin, supporting an injured George, meet them. Inside, George is laid on a sofa as Lupin confronts Harry before releasing him. Lupin rushes out as Kingsley and Hermione arrive, exchanging tense gestures before Kingsley turns to Harry. A thestral lands with Bill and Fleur, while Tonks arrives with a Harry lookalike who reverts to Ron, prompting Hermione to embrace him. Lupin and Tonks reunite, and Harry joins Hermione and Ron. Mr. Weasley returns with Fred, who rushes to George's side. Mrs. Weasley tends to George's wound as the others gather, stunned by the sight of his injury."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A bus and a lorry approach as Hagrid rides upside down on the tunnel roof, a location in the busy streets of London known for its iconic underground passages, with Harry hanging out of the sidecar, running over the bus, and dropping back in when the bike returns to the road. Hagrid slumps forward, hit by a bolt from a death eater, one of Voldemort's loyal followers adept in dark magic, and Harry grabs the handlebars, forcing the motorbike, a magical flying vehicle given to Hagrid by Sirius Black, up into the air. Hedwig, Harry's loyal snowy owl often used for delivering messages, flies towards them and attacks the chasing death eater, but as the owl swoops to attack again, she is hit by a bolt of green light, characteristic of the killing curse Avada Kedavra, and tumbles earthwards. The death eater pulls back, and Harry suddenly cries out in pain, his face contorting as another ominous, dark figure, Voldemort, closes in. Harry slumps forward, his jagged lightning bolt-shaped scar, a remnant of his survival against Voldemort as a child, illuminated by the bike's headlight. As they speed between two lines of electric pylons, towering metal structures that carry high voltage power lines across the countryside, Harry's wand lights of its own accord, a sign of powerful magic. The dark figure draws level, and the power flowing from Harry's wand connects with an equal force of pulsating energy, revealing the intense magical duel. The swirling vortex of light travels up Voldemort's wand, illuminating his face, and an explosion rocks the bike. Harry presses the control button, and the bike zooms away, spewing out flames that propel Voldemort backwards as the electric pylons collapse. Harry, Hagrid, and the bike soar upwards beyond the clouds, and Hagrid comes to and takes control of the bike. As Harry settles back into the sidecar, the engine fails due to the extensive damage from the battle, and they hurdle downwards. Molly Weasley, the matriarch of the Weasley family known for her fierce protective nature, hears them break through the protective shield around their house, the Burrow, as they plummet towards the ground, making a bumpy landing in a reed bed typical of the marshy surroundings of their cottage. They slow to a halt near the Weasley's home, a welcoming but chaotic household for many of Harry's friends, and the bike throws up a spume of water, soaking both rider and passenger. Harry and Hagrid exchange a look and trudge towards the house, where Ginny follows her mother out, with Lupin, a werewolf and former Defense Against the Dark Arts professor, supporting George, whose left ear is covered in blood. George is carried inside and laid on a sofa as Lupin grabs Harry by the collar, pinning him against the fireplace before lowering his wand and letting Harry go. Lupin steps back, and Harry nods. Lupin races out as Kingsley, a high-ranking Auror and Order member, and Hermione, Harry's intelligent and resourceful friend, return, and the two men point their wands at each other before Kingsley lowers his wand and turns to Harry. A thestral, a skeletal winged horse visible only to those who have witnessed death, lands carrying Bill and Fleur, while Nymphadora Tonks, a Metamorphmagus known for her ability to change appearance at will, approaches with another Harry lookalike, who changes back into Ron as Hermione rushes to hug him. Lupin embraces Nymphadora, and Harry runs to embrace Hermione and Ron. Mr. Weasley returns with Fred, who runs indoors as Mr. Weasley follows anxiously. Mrs. Weasley strokes George's brow as Fred kneels down beside his twin. The others gather around, with Ron looking anxious. Fred leans towards George, who has a large wound in his ear, indicating the severity of their skirmish with the death eaters, and points to it. Bill, known for his curse-breaking skills at Gringotts, steps forward, his face grim, and stunned, everyone looks at each other in shock."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "A bus and a lorry approach as Hagrid rides upside down on the tunnel roof with Harry hanging out of the sidecar running over the bus and dropping back in. when the bike returns to the road Hagrid slumps forward hit by a bolt from a death eater and Harry grabs the handlebars forcing the motorbike up into the air. Hedwig flies towards them and attacks the chasing death eater but as the owl swoops to attack again she is hit by a bolt of green light and tumbles earthwards. The death eater pulls back and Harry suddenly cries out in pain his face contorting as another ominous dark figure closes in. Harry slumps forward his jagged scar illuminated by the bike's headlight. As they speed between two lines of electric pylons Harry's wand lights of its own accord. The dark figure draws level and the power flowing from Harry's wand connects with an equal force of pulsating energy. The swirling vortex of light travels up Voldemort's wand illuminating his face and an explosion rocks the bike. Harry presses the control button and the bike zooms away spewing out flames that propel Voldemort backwards as the electric pylons collapse. Harry Hagrid and the bike soar upwards beyond the clouds and Hagrid comes to and takes control of the bike. As Harry settles back into the sidecar the engine fails and they hurdle downwards. Molly Weasley hears them break through the protective shield around their house as they plummet towards the ground making a bumpy landing in a reed bed. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. They slow to a halt near the Weasley's home and the bike throws up a spume of water soaking both rider and passenger. Harry and Hagrid exchange a look and trudge towards the house where Ginny follows her mother out with Lupin supporting George whose left ear is covered in blood. George is carried inside and laid on a sofa as Lupin grabs Harry by the collar pinning him against the fireplace before lowering his wand and letting Harry go. Lupin steps back and Harry nods. Lupin races out as Kingsley and Hermione return and the two men point their wands at each other before Kingsley lowers his wand and turns to Harry. A thestral lands carrying Bill and Fleur while Nymphadora Tonks approaches with another Harry lookalike who changes back into Ron as Hermione rushes to hug him. Lupin embraces Nymphadora and Harry runs to embrace Hermione and Ron. Mr Weasley returns with Fred who runs indoors as Mr Weasley follows anxiously Mrs Weasley strokes George's brow as Fred kneels down beside his twin. The others gather around with Ron looking anxious. Fred leans towards George who has a large wound in his ear and points to it. Bill steps forward his face grim and stunned. everyone looks at each other in shock."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "A bus and a lorry approach as Hagrid rides upside down on the tunnel roof with Harry hanging out of the sidecar running over the bus and dropping back in. when the bike returns to the road Hagrid slumps forward hit by a bolt from a death eater and Harry grabs the handlebars forcing the motorbike up into the air. Hedwig flies towards them and attacks the chasing death eater but as the owl swoops to attack again she is hit by a bolt of green light and tumbles earthwards. The death eater pulls back and Harry suddenly cries out in pain his face contorting as another ominous dark figure closes in. Harry slumps forward his jagged scar illuminated by the bike's headlight. As they speed between two lines of electric pylons Harry's wand lights of its own accord. The dark figure draws level and the power flowing from Harry's wand connects with an equal force of pulsating energy. The swirling vortex of light travels up Voldemort's wand illuminating his face and an explosion rocks the bike. Harry presses the control button and the bike zooms away spewing out flames that propel Voldemort backwards as the electric pylons collapse. Harry Hagrid and the bike soar upwards beyond the clouds and Hagrid comes to and takes control of the bike. As Harry settles back into the sidecar the engine fails and they hurdle downwards. Molly Weasley hears them break through the protective shield around their house as they plummet towards the ground making a bumpy landing in a reed bed. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. They slow to a halt near the Weasley's home and the bike throws up a spume of water soaking both rider and passenger. Harry and Hagrid exchange a look and trudge towards the house where Ginny follows her mother out with Lupin supporting George whose left ear is covered in blood. George is carried inside and laid on a sofa as Lupin grabs Harry by the collar pinning him against the fireplace before lowering his wand and letting Harry go. Lupin steps back and Harry nods. Lupin races out as Kingsley and Hermione return and the two men point their wands at each other before Kingsley lowers his wand and turns to Harry. A thestral lands carrying Bill and Fleur while Nymphadora Tonks approaches with another Harry lookalike who changes back into Ron as Hermione rushes to hug him. Lupin embraces Nymphadora and Harry runs to embrace Hermione and Ron. Mr Weasley returns with Fred who runs indoors as Mr Weasley follows anxiously Mrs Weasley strokes George's brow as Fred kneels down beside his twin. The others gather around with Ron looking anxious. Fred leans towards George who has a large wound in his ear and points to it. Bill steps forward his face grim and stunned. everyone looks at each other in shock."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "A bus and a lorry approach as Hagrid rides upside down on the tunnel roof with Harry hanging out of the sidecar running over the bus and dropping back in. when the bike returns to the road Hagrid slumps forward hit by a bolt from a death eater and Harry grabs the handlebars forcing the motorbike up into the air. Hedwig flies towards them and attacks the chasing death eater but as the owl swoops to attack again she is hit by a bolt of green light and tumbles earthwards. The death eater pulls back and Harry suddenly cries out in pain his face contorting as another ominous dark figure closes in. Harry slumps forward his jagged scar illuminated by the bike's headlight. As they speed between two lines of electric pylons Harry's wand lights of its own accord. Lupin embraces Nymphadora and Harry runs to embrace Hermione and Ron. Mr Weasley returns with Fred who runs indoors as Mr Weasley follows anxiously Mrs Weasley strokes George's brow as Fred kneels down beside his twin. The others gather around with Ron looking anxious. Fred leans towards George who has a large wound in his ear and points to it. Bill steps forward his face grim and stunned. everyone looks at each other in shock."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "A bus and a lorry approach as Hagrid rides upside down on the tunnel roof with Harry hanging out of the sidecar running over the bus and dropping back in. when the bike returns to the road Hagrid slumps forward hit by a bolt from a death eater and Harry grabs the handlebars forcing the motorbike up into the air. Hedwig flies towards them and attacks the chasing death eater but as the owl swoops to attack again she is hit by a bolt of green light and tumbles earthwards. Bill steps forward his face grim and stunned. everyone looks at each other in shock."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "A submarine and a spaceship drift closer as Gandalf swings sideways from the cave ceiling, with Bilbo dangling from the chariot, skipping over the submarine, and leaping back in when the skateboard glides to the pier. Gandalf leans backward, struck by a pebble from a wizard hunter, and Bilbo seizes the wheel, launching the skateboard skyward. Gollum flutters towards them and tackles the pursuing wizard hunter, but as the creature dives to tackle again, it is struck by a flash of red lightning and spirals toward the ocean. The wizard hunter recoils, and Bilbo suddenly shouts out in agony, his features twisting as another shadowy, sinister specter draws near. Bilbo leans backward, his twisted birthmark highlighted by the skateboard's spotlight. As they race between two rows of telephone poles, Bilbo's staff glows spontaneously. The shadowy specter matches pace, and the energy emanating from Bilbo's staff converges with a similar stream of throbbing power. The shimmering spiral of light ascends Sauron's staff, outlining his visage, and a detonation shakes the skateboard. Bilbo hits the activation lever, and the skateboard rockets off, belching out smoke that pushes Sauron backwards as the telephone poles topple. Bilbo, Gandalf, and the skateboard ascend beyond the mist, and Gandalf wakes up and regains control of the skateboard. As Bilbo reclines back into the chariot, the machine sputters, and they dive downwards. Arwen hears them shatter the mystical barrier around their sanctuary as they crash towards the earth, making a rough stop in a marshy pool. They decelerate to a standstill near the Elven retreat, and the skateboard kicks up a spray of mud, drenching both navigator and traveler. Bilbo and Gandalf share a glance and shuffle towards the sanctuary, where Legolas follows his father out, with Elrond supporting Aragorn, whose right arm is soaked in wine. Aragorn is carried inside and laid on a hammock as Elrond seizes Bilbo by the jacket, pressing him against the chimney before lowering his staff and releasing Bilbo. Elrond steps away, and Bilbo agrees. Elrond dashes out as Galadriel and Frodo return, and the two elves aim their staffs at each other before Galadriel lowers hers and turns to Bilbo. A phoenix lands, bearing Elendil and Éowyn, while Faramir approaches with another Bilbo doppelgänger, who shifts back into Sam as Frodo rushes to embrace him. Elrond hugs Faramir, and Bilbo runs to hug Frodo and Sam. Gimli returns with Eomer, who hurries inside as Gimli follows nervously. Arwen caresses Aragorn's cheek as Eomer crouches beside his comrade. The others cluster around, with Sam looking nervous. Eomer leans towards Aragorn, who has a massive cut on his arm and gestures to it. Elendil steps closer, his expression serious, and in disbelief, everyone stares at one another aghast."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Hagrid, upside down on the tunnel roof, rides a motorbike with Harry in the sidecar. A death eater hits Hagrid, and Harry takes control, forcing the bike into the air. Hedwig attacks the death eater but is struck down. As another dark figure approaches, Harry cries in pain, his scar glowing. His wand lights up, connecting with Voldemort's energy, causing an explosion. Harry activates the bike's controls, creating flames that repel Voldemort, collapsing electric pylons. Hagrid regains control, but the bike fails, crashing through a protective shield at the Weasleys' home. They land in a reed bed, drenched. Limping toward the house, they meet Ginny and Molly with Lupin supporting George, whose ear is injured. Lupin confronts Harry but then releases him as Kingsley and Hermione return. Thestrals bring Bill, Fleur, Tonks, and Ron, who changes from a Harry lookalike back to himself. Harry reunites with friends. Mr. Weasley and Fred arrive, and Fred tends to George's ear wound, while everyone else looks on in shock."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "everyone looks at each other in shock Bill steps forward his face grim and stunned  Fred leans towards George who has a large wound in his ear and points to it  The others gather around with Ron looking anxious  Mr Weasley returns with Fred who runs indoors as Mr Weasley follows anxiously Mrs Weasley strokes George's brow as Fred kneels down beside his twin  Lupin embraces Nymphadora and Harry runs to embrace Hermione and Ron  A thestral lands carrying Bill and Fleur while Nymphadora Tonks approaches with another Harry lookalike who changes back into Ron as Hermione rushes to hug him  Lupin races out as Kingsley and Hermione return and the two men point their wands at each other before Kingsley lowers his wand and turns to Harry  Lupin steps back and Harry nods  George is carried inside and laid on a sofa as Lupin grabs Harry by the collar pinning him against the fireplace before lowering his wand and letting Harry go  Harry and Hagrid exchange a look and trudge towards the house where Ginny follows her mother out with Lupin supporting George whose left ear is covered in blood  They slow to a halt near the Weasley's home and the bike throws up a spume of water soaking both rider and passenger  Molly Weasley hears them break through the protective shield around their house as they plummet towards the ground making a bumpy landing in a reed bed  As Harry settles back into the sidecar the engine fails and they hurdle downwards  Harry Hagrid and the bike soar upwards beyond the clouds and Hagrid comes to and takes control of the bike  Harry presses the control button and the bike zooms away spewing out flames that propel Voldemort backwards as the electric pylons collapse  The swirling vortex of light travels up Voldemort's wand illuminating his face and an explosion rocks the bike  The dark figure draws level and the power flowing from Harry's wand connects with an equal force of pulsating energy  As they speed between two lines of electric pylons Harry's wand lights of its own accord  Harry slumps forward his jagged scar illuminated by the bike's headlight  The death eater pulls back and Harry suddenly cries out in pain his face contorting as another ominous dark figure closes in  Hedwig flies towards them and attacks the chasing death eater but as the owl swoops to attack again she is hit by a bolt of green light and tumbles earthwards  when the bike returns to the road Hagrid slumps forward hit by a bolt from a death eater and Harry grabs the handlebars forcing the motorbike up into the air  A bus and a lorry approach as Hagrid rides upside down on the tunnel roof with Harry hanging out of the sidecar running over the bus and dropping back in "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "when the bike returns to the road Hagrid slumps forward hit by a bolt from a death eater and Harry grabs the handlebars forcing the motorbike up into the air A bus and a lorry approach as Hagrid rides upside down on the tunnel roof with Harry hanging out of the sidecar running over the bus and dropping back in The death eater pulls back and Harry suddenly cries out in pain his face contorting as another ominous dark figure closes in Hedwig flies towards them and attacks the chasing death eater but as the owl swoops to attack again she is hit by a bolt of green light and tumbles earthwards As they speed between two lines of electric pylons Harry's wand lights of its own accord Harry slumps forward his jagged scar illuminated by the bike's headlight The swirling vortex of light travels up Voldemort's wand illuminating his face and an explosion rocks the bike The dark figure draws level and the power flowing from Harry's wand connects with an equal force of pulsating energy Harry Hagrid and the bike soar upwards beyond the clouds and Hagrid comes to and takes control of the bike Harry presses the control button and the bike zooms away spewing out flames that propel Voldemort backwards as the electric pylons collapse Molly Weasley hears them break through the protective shield around their house as they plummet towards the ground making a bumpy landing in a reed bed As Harry settles back into the sidecar the engine fails and they hurdle downwards Harry and Hagrid exchange a look and trudge towards the house where Ginny follows her mother out with Lupin supporting George whose left ear is covered in blood They slow to a halt near the Weasley's home and the bike throws up a spume of water soaking both rider and passenger Lupin steps back and Harry nods George is carried inside and laid on a sofa as Lupin grabs Harry by the collar pinning him against the fireplace before lowering his wand and letting Harry go A thestral lands carrying Bill and Fleur while Nymphadora Tonks approaches with another Harry lookalike who changes back into Ron as Hermione rushes to hug him Lupin races out as Kingsley and Hermione return and the two men point their wands at each other before Kingsley lowers his wand and turns to Harry Mr Weasley returns with Fred who runs indoors as Mr Weasley follows anxiously Mrs Weasley strokes George's brow as Fred kneels down beside his twin Lupin embraces Nymphadora and Harry runs to embrace Hermione and Ron Fred leans towards George who has a large wound in his ear and points to it The others gather around with Ron looking anxious everyone looks at each other in shock Bill steps forward his face grim and stunned"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "They slow to a halt near the Weasley's home and the bike throws up a spume of water soaking both rider and passenger  Harry and Hagrid exchange a look and trudge towards the house where Ginny follows her mother out with Lupin supporting George whose left ear is covered in blood  George is carried inside and laid on a sofa as Lupin grabs Harry by the collar pinning him against the fireplace before lowering his wand and letting Harry go  Lupin steps back and Harry nods  Lupin races out as Kingsley and Hermione return and the two men point their wands at each other before Kingsley lowers his wand and turns to Harry  A thestral lands carrying Bill and Fleur while Nymphadora Tonks approaches with another Harry lookalike who changes back into Ron as Hermione rushes to hug him  Lupin embraces Nymphadora and Harry runs to embrace Hermione and Ron  Mr Weasley returns with Fred who runs indoors as Mr Weasley follows anxiously Mrs Weasley strokes George's brow as Fred kneels down beside his twin  The others gather around with Ron looking anxious  Fred leans towards George who has a large wound in his ear and points to it  Bill steps forward his face grim and stunned  everyone looks at each other in shock A bus and a lorry approach as Hagrid rides upside down on the tunnel roof with Harry hanging out of the sidecar running over the bus and dropping back in  when the bike returns to the road Hagrid slumps forward hit by a bolt from a death eater and Harry grabs the handlebars forcing the motorbike up into the air  Hedwig flies towards them and attacks the chasing death eater but as the owl swoops to attack again she is hit by a bolt of green light and tumbles earthwards  The death eater pulls back and Harry suddenly cries out in pain his face contorting as another ominous dark figure closes in  Harry slumps forward his jagged scar illuminated by the bike's headlight  As they speed between two lines of electric pylons Harry's wand lights of its own accord  The dark figure draws level and the power flowing from Harry's wand connects with an equal force of pulsating energy  The swirling vortex of light travels up Voldemort's wand illuminating his face and an explosion rocks the bike  Harry presses the control button and the bike zooms away spewing out flames that propel Voldemort backwards as the electric pylons collapse  Harry Hagrid and the bike soar upwards beyond the clouds and Hagrid comes to and takes control of the bike  As Harry settles back into the sidecar the engine fails and they hurdle downwards  Molly Weasley hears them break through the protective shield around their house as they plummet towards the ground making a bumpy landing in a reed bed "
        }
      ]
    }
  ]
}