{
  "ground_truth": "The Minister's eyes flit from Harry to Ron, then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them. Harry stands in the covered walkway, the Snitch hovering beside him, which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests, with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne. Standing beside the table is tall, dark-haired Madame Maxime, and Hagrid looks up at her admiringly. A man with long white blonde hair dances theatrically with Luna Lovegood, and Ron stares while Hermione appears looking delightful in a sleeveless red dress. Harry spots Elphias Doge and heads towards him. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. Harry sits with Elphias, and an old woman scowls, prompting Harry to look puzzled. A bright white light appears in the sky, and Harry rises with his eyes fixed on the approaching light as the guests draw back. The light bursts into the marquis, and images and voices emerge from the hovering light, causing the guests to freeze. The images disappear, and Bill comforts Fleur as Elphias disapparates upon Death Eaters' arrival. They attack the guests, and Ron grabs Hermione while Harry heads for Ginny, only to be stopped by Lupin. Harry, Hermione, and Ron apparate in London, with Ron and Harry holding Hermione's hands as they follow her across Piccadilly Circus and down a crowded street to a dingy alley where they stand in a doorway. Hermione puts her hand into her small, bottomless handbag and pulls out clothes. They sit at a table in a cafe as a waitress comes over, wearing earphones, then struts off. Two men enter, and Hermione indicates her bag. The men fire wands, and in the kitchen, the waitress with the earphones sings to her music. One man is down as Hermione and Ron aim at the second behind the counter, who misses Hermione, and she then takes aim, causing him to fall. The waitress comes out of the kitchen and gapes, then scurries back. Ron uses the Deluminator to absorb the light from the lamps while Hermione uses her wand to lower shutters. He strokes her cheek, and Hermione moves slowly towards the dark-haired man in overalls lying on the floor, his body stiffened and unmoving. She points her wand with a shaking hand as her arm wavers and the tip glows, with Dolohov's eyes remaining open and starry. Later, they walk through a covered arcade until Hermione suddenly stops. In Grimmauld Place, they watch as Number 12, a tall terraced house, slides into position, and they enter the Black family home.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The Leader's gazes shift from Harry to Ron, then to Hermione. The nuptial celebration is in full swing. A soft glow spills out of the tent. A group of men keep watch outside as Lupin strides past them. Harry stands in the covered passageway, the Snitch floating beside him, which he clutches and puts in his coat pocket before entering the tent. Fleur and Bill are dancing together between two rows of attendees, with butterflies fluttering around them. Harry grins as goblets magically fill with Champagne. Standing beside the table is tall, dark-haired Madame Maxime, and Hagrid gazes up at her admiringly. A man with lengthy white blonde hair dances theatrically with Luna Lovegood, and Ron observes while Hermione appears looking delightful in a sleeveless red gown. Harry notices Elphias Doge and moves towards him. Luna's father dons a pendant with a triangle containing a circle with a vertical line through it. Harry sits with Elphias, and an elderly woman scowls, prompting Harry to look baffled. A bright white glow appears in the sky, and Harry rises with his gazes fixed on the approaching glow as the attendees recoil. The glow bursts into the tent, and visuals and voices emerge from the floating glow, causing the attendees to freeze. The visuals vanish, and Bill soothes Fleur as Elphias disapparates upon Death Eaters' arrival. They assault the attendees, and Ron seizes Hermione while Harry heads for Ginny, only to be halted by Lupin. Harry, Hermione, and Ron apparate in London, with Ron and Harry holding Hermione's hands as they follow her across Piccadilly Circus and down a crowded street to a shabby alley where they stand in a doorway. Hermione puts her hand into her small, bottomless handbag and pulls out garments. They sit at a table in a cafe as a waitress approaches, wearing earphones, then struts off. Two men enter, and Hermione indicates her bag. The men fire wands, and in the kitchen, the waitress with the earphones sings to her tune. One man is down as Hermione and Ron aim at the second behind the counter, who misses Hermione, and she then takes aim, causing him to fall. The waitress emerges from the kitchen and gawks, then scurries back. Ron uses the Deluminator to absorb the glow from the lamps while Hermione uses her wand to lower blinds. He strokes her cheek, and Hermione moves slowly towards the dark-haired man in overalls lying on the floor, his form stiffened and unmoving. She points her wand with a trembling hand as her arm wavers and the tip glows, with Dolohov's gazes remaining open and starry. Later, they tread through a covered arcade until Hermione suddenly halts. In Grimmauld Place, they watch as Number 12, a tall terraced residence, slides into position, and they enter the Black clan household."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The Minister’s eyes are flitted from by Harry to Ron, then to Hermione. The wedding reception was in full swing. Soft light is spilled out of by the marquis. Guard is kept by a group of men outside as they are strolled past by Lupin. The covered walkway is stood in by Harry, with the Snitch being hovered beside him, which is grasped and put in his jacket pocket by him before the marquis is entered by him. Together, Fleur and Bill were danced with by guests between two lines, with butterflies being fluttered around them. Glasses are magically filled with Champagne as a smile is given by Harry. Beside the table stands tall, dark-haired Madame Maxime, who is looked up at admiringly by Hagrid. A man with long white blonde hair is danced with theatrically by Luna Lovegood, and Ron is stared at while Hermione appears delightful in a sleeveless red dress. Elphias Doge is spotted by Harry, and he heads towards him. A pendant with a triangle containing a circle with a vertical line through it is worn by Luna’s father. Harry sits with Elphias, causing an old woman to scowl, which prompts Harry to look puzzled. A bright white light is appeared in the sky, and his eyes are fixed on the approaching light by Harry as back is drawn by the guests. Into the marquis, the light is burst, and images and voices are emerged from by the hovering light, which causes the guests to freeze. The images are disappeared, and Fleur is comforted by Bill as Elphias disapparates upon the arrival of Death Eaters. The guests are attacked by them, and Hermione is grabbed by Ron while Ginny is headed for Harry, only to be stopped by Lupin. London is apparated in by Harry, Hermione, and Ron, with Hermione’s hands being held by Ron and Harry as she is followed by them across Piccadilly Circus and down a crowded street to a dingy alley where a doorway is stood in by them. Into her small, bottomless handbag is Hermione’s hand put, and clothes are pulled out by her. At a table, they sit in a cafe as a waitress in earphones is strut off after coming over. The men enter, and her bag is indicated by Hermione. Wands are fired by the men, and the waitress with the earphones sings to her music in the kitchen. Down is one man as the second is aimed at by Hermione and Ron behind the counter, missing Hermione before she takes aim and causes him to fall. Out of the kitchen comes the waitress, who gapes and then back she scurries. The light is absorbed from the lamps by Ron using the Deluminator while her wand is used by Hermione to lower shutters. Her cheek is stroked by him, and slowly, the dark-haired man in overalls lying on the floor is moved towards by Hermione, with his body being stiffened and unmoving. Her wand is pointed by her with a shaking hand as her arm wavers and the tip glows, with Dolohov’s eyes remaining open and starry. Through a covered arcade, they are walked until she suddenly stops. In Grimmauld Place, Number 12 is watched by them as a tall terraced house is slid into position, and the Black family home is entered by them."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The Minister's eyes move from Harry to Ron, then Hermione. The wedding reception is lively, with soft light spilling from the marquis. Guards stand outside as Lupin passes. Harry, in the covered walkway, catches the Snitch and pockets it before entering. Fleur and Bill dance amid butterflies, and glasses fill with Champagne. Madame Maxime stands tall beside Hagrid, who admires her. A man with long white-blonde hair dances theatrically with Luna Lovegood, while Ron stares at Hermione in a sleeveless red dress. Harry spots Elphias Doge and approaches him. Luna's father wears a pendant with a triangle, circle, and line. Harry sits with Elphias, puzzled by an old woman's scowl. A bright light appears, and Harry watches as it bursts into the marquis, freezing guests with images and voices. The images vanish, and Bill comforts Fleur as Elphias disapparates when Death Eaters arrive. They attack, and Ron grabs Hermione while Harry heads for Ginny but is stopped by Lupin. Harry, Hermione, and Ron apparate to London, holding hands as they navigate Piccadilly Circus to a dingy alley. Hermione retrieves clothes from her bottomless handbag. They sit in a cafe as a waitress with earphones approaches, then leaves. Two men enter, and Hermione signals her bag. The men fire wands; in the kitchen, the waitress sings. One man falls as Hermione and Ron target the second, who misses Hermione, and she makes him fall. The waitress gapes and retreats. Ron uses the Deluminator to absorb light while Hermione lowers shutters with her wand. She approaches a dark-haired man on the floor, pointing her wand with a shaking hand as Dolohov's eyes remain open. Later, they walk through an arcade until Hermione stops. At Grimmauld Place, they watch Number 12 slide into position and enter the Black family home."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The Minister's eyes move between Harry, Ron, and Hermione. The wedding reception is lively, with soft light from the marquis. Guards stand outside as Lupin passes. Harry, in the walkway, catches the Snitch and pockets it before entering. Fleur and Bill dance with butterflies around them. Harry smiles as glasses fill with Champagne. Madame Maxime stands tall beside Hagrid. A man with white blonde hair dances with Luna, while Ron stares at Hermione in a red dress. Harry approaches Elphias Doge. Luna's father wears a pendant with a triangle, circle, and line. Harry sits with Elphias, puzzled by a scowling old woman. A bright light appears, and Harry watches as it bursts into the marquis, freezing guests with images and voices. The images vanish, and Bill comforts Fleur as Elphias disapparates when Death Eaters arrive. They attack, and Ron grabs Hermione while Harry is stopped by Lupin. Harry, Hermione, and Ron apparate to London, holding hands through Piccadilly Circus to a dingy alley. Hermione retrieves clothes from her handbag. They sit in a cafe as a waitress with earphones leaves. Two men enter, and Hermione signals her bag. The men fire wands; Hermione and Ron take down one, and Hermione disarms the other. The waitress returns, shocked, then retreats. Ron uses the Deluminator to absorb light, and Hermione lowers shutters. Ron strokes her cheek as Hermione approaches a dark-haired man on the floor, pointing her wand with a glowing tip at Dolohov's open eyes. Later, they walk through an arcade until Hermione stops. At Grimmauld Place, they watch Number 12 slide into view and enter the Black family home."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The Minister's eyes dart swiftly from Harry to Ron, and then to Hermione, as he takes in the scene before him. The wedding reception is in full swing, with a lively atmosphere enveloping the guests. A gentle, soft light spills out from the marquis, casting a warm glow over the festivities. Outside, a group of vigilant men stand guard, keeping watch as Lupin casually strolls past them. Meanwhile, Harry stands in the covered walkway, with the Snitch hovering beside him. He deftly grasps it and tucks it securely into his jacket pocket before making his way into the marquis. Inside, Fleur and Bill are gracefully dancing together between two lines of guests, with delicate butterflies fluttering around them, adding to the enchanting scene. Harry smiles as he observes glasses magically filling with Champagne, a testament to the magical ambiance. Standing beside the table is the tall, dark-haired Madame Maxime, while Hagrid gazes up at her with admiration. Nearby, a man with long, white-blonde hair dances theatrically with Luna Lovegood, capturing Ron's attention, while Hermione appears, looking delightful in a sleeveless red dress. Harry spots Elphias Doge and decides to head towards him. Luna's father is wearing a pendant featuring a triangle containing a circle with a vertical line through it. Harry takes a seat with Elphias, but an old woman scowls, leaving Harry puzzled. Suddenly, a bright white light appears in the sky, prompting Harry to rise with his eyes fixed on the approaching light as the guests draw back in anticipation. The light bursts into the marquis, and images and voices emerge from the hovering light, causing the guests to freeze in shock. As the images vanish, Bill comforts Fleur, and Elphias disapparates upon the arrival of Death Eaters. Chaos ensues as they attack the guests, and Ron quickly grabs Hermione while Harry makes a move towards Ginny, only to be stopped by Lupin. In a swift moment, Harry, Hermione, and Ron apparate to London, with Ron and Harry holding Hermione's hands as they follow her across the bustling Piccadilly Circus and down a crowded street to a dingy alley where they find refuge in a doorway. Hermione reaches into her small, bottomless handbag and pulls out clothes. They sit at a table in a cafe as a waitress, wearing earphones, approaches them, then struts off. Two men enter, and Hermione discreetly indicates her bag. The men fire their wands, and in the kitchen, the waitress with the earphones continues to sing to her music, oblivious to the commotion. One man is down as Hermione and Ron aim at the second man behind the counter, who misses Hermione, and she then takes aim, causing him to fall. The waitress emerges from the kitchen, gapes at the scene, and quickly scurries back. Ron uses the Deluminator to absorb the light from the lamps while Hermione uses her wand to lower the shutters. He gently strokes her cheek, and Hermione moves slowly towards the dark-haired man in overalls lying on the floor, his body stiffened and unmoving. She points her wand with a trembling hand as her arm wavers and the tip glows, with Dolohov's eyes remaining open and starry. Later, they walk through a covered arcade until Hermione suddenly stops. In Grimmauld Place, they watch as Number 12, a tall terraced house, slides into position, and they enter the Black family home."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The Minister's eyes move rapidly and perceptively, darting swiftly from Harry to Ron, and then to Hermione, as he surveys and takes in the bustling scene before him. The wedding reception is in full joyous swing, with the lively atmosphere completely enveloping and thrilling the guests. A gentle, soft light spills out generously from the marquis, casting a warm, inviting glow over the enchanting festivities. Outside, a vigilant group of men stands alert, vigilantly keeping watch as Lupin casually strolls past them, seemingly carefree. Meanwhile, Harry stands in a covered walkway, accompanied by the Snitch, which is hovering attentively beside him. He deftly and swiftly grasps it, tucking it securely away into his jacket pocket before making his way into the marquis. Inside, Fleur and Bill are gracefully dancing together, poised elegantly between two lines of guests, as delicate butterflies flutter around them, contributing to the enchanting and magical scene. Harry smiles broadly as he observes glasses magically filling with sparkling Champagne, a testament to the rich magical ambiance. Standing beside the table is the tall, dark-haired Madame Maxime, while Hagrid gazes up at her with obvious admiration. Nearby, a man with long, white-blonde hair dances theatrically with Luna Lovegood, capturing Ron's full attention, while Hermione appears, looking delightful and radiant in a sleeveless red dress. Harry spots Elphias Doge and decides to head towards him. Luna's father is wearing a peculiar pendant, featuring a triangle containing a circle with a vertical line through it. Harry takes a seat with Elphias, but an old woman scowls at him, leaving Harry somewhat puzzled. Suddenly, a bright, intense white light appears in the sky, prompting Harry to rise with his eyes fixed intently on the approaching illumination as the guests draw back in anticipation and slight trepidation. The light bursts into the marquis, and images along with haunting voices emerge from the hovering light, causing the guests to freeze in utter shock. As the images vanish, Bill comforts Fleur, and Elphias disapparates, moving hastily upon the ominous arrival of Death Eaters. Chaos ensues rapidly as they attack the guests, and Ron quickly grabs Hermione for safety while Harry makes a move towards Ginny, only to be halted by Lupin. In a swift, decisive moment, Harry, Hermione, and Ron apparate to London, with Ron and Harry firmly holding Hermione's hands as they follow her across the bustling and vibrant Piccadilly Circus, making their way down a crowded street to a dingy alley where they find brief refuge in a shadowy doorway. Hermione reaches into her small, bottomless handbag and efficiently pulls out clothes for the three of them. They take a seat at a small table in a cafe as a waitress, wearing earphones, approaches them but then struts off casually. Two men enter the cafe, and Hermione discreetly indicates her bag to her companions. The men fire their wands ferociously, and in the kitchen, the waitress with the earphones continues to sing, absorbed in her music, completely oblivious to the commotion unfolding nearby. One man is swiftly down as Hermione and Ron aim at the second man positioned behind the counter, who misses Hermione, and she then takes aim, causing him to fall. The waitress emerges curiously from the kitchen, gapes at the chaotic scene, and quickly scurries back to her previous safety. Ron uses the Deluminator skillfully to absorb the light from the surrounding lamps while Hermione uses her wand to expertly lower the shutters. He gently strokes her cheek, offering comfort, and Hermione moves slowly towards the dark-haired man in overalls lying on the floor, his body stiffened and unmoving. She points her wand with a trembling hand, her arm wavering as the tip glows luminously, with Dolohov's eyes remaining open and starry. Later, they walk through a covered arcade until Hermione suddenly stops. In Grimmauld Place, they observe quietly as Number 12, a tall terraced house, magically slides seamlessly into position, and they enter the Black family home with a sense of familiarity and caution."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The Minister's eyes dart quickly from Harry to Ron, then shift to Hermione, capturing each of their expressions in the bustling environment. The wedding reception is lively and vibrant, with a soft, inviting light spilling out from the marquis, casting a warm glow over the scene. Outside, a group of men stand vigilantly, keeping guard as Lupin casually strolls past them, acknowledging their presence with a nod. Meanwhile, Harry stands in the covered walkway, observing the Snitch that hovers beside him. He reaches out, grasps it gently, and tucks it securely into his jacket pocket before making his way into the marquis. Inside, Fleur and Bill are gracefully dancing together, moving rhythmically between two lines of guests, while delicate butterflies flutter around them, adding to the enchanting atmosphere. Harry's face lights up with a smile as he watches glasses magically fill with Champagne, a testament to the magical festivities. Nearby, tall, dark-haired Madame Maxime stands beside a table, and Hagrid gazes up at her with admiration. A man with long white blonde hair dances theatrically with Luna Lovegood, capturing Ron's attention as he stares, while Hermione appears, looking delightful in a sleeveless red dress that catches the light. Harry's gaze shifts as he spots Elphias Doge and decides to head towards him. Luna's father, wearing a distinctive pendant with a triangle containing a circle and a vertical line, catches Harry's eye momentarily. Harry sits down with Elphias, but an old woman scowls at him, prompting a puzzled look from Harry. Suddenly, a bright white light appears in the sky, drawing Harry's attention as he rises, his eyes fixed on the approaching phenomenon. The guests instinctively draw back as the light bursts into the marquis, projecting images and voices that emerge from the hovering light, causing everyone to freeze in shock. As the images vanish, Bill moves to comfort Fleur, while Elphias quickly disapparates in response to the arrival of Death Eaters. Chaos ensues as they attack the guests, prompting Ron to grab Hermione protectively while Harry makes a move towards Ginny, only to be intercepted by Lupin. In a swift decision, Harry, Hermione, and Ron apparate to London, with Ron and Harry each holding one of Hermione's hands as they follow her through the bustling Piccadilly Circus and down a crowded street. They navigate their way to a dingy alley, where they find refuge in a doorway. Hermione reaches into her small, bottomless handbag and retrieves clothes for them. They then sit at a table in a cafe, where a waitress approaches, wearing earphones, before strutting off to attend to other tasks. Two men enter the cafe, and Hermione discreetly indicates her bag, preparing for what might come. The men suddenly fire their wands, and in the kitchen, the waitress, oblivious to the commotion, sings along to her music. One man is quickly taken down as Hermione and Ron aim their wands at the second man behind the counter. He fires a shot that narrowly misses Hermione, who then takes aim with precision, causing him to fall. The waitress emerges from the kitchen, gaping at the scene before her, then hurriedly retreats back to safety. Ron uses the Deluminator to absorb the light from the lamps, casting the room into darkness, while Hermione uses her wand to lower the shutters, securing their location. Ron gently strokes Hermione's cheek, offering comfort, as she moves slowly towards the dark-haired man in overalls lying on the floor, his body stiff and unmoving. With a shaking hand, she points her wand at him, her arm wavering slightly as the tip glows, while Dolohov's eyes remain open and starry, unseeing. Later, they walk through a covered arcade, their footsteps echoing softly, until Hermione suddenly stops, sensing something. In Grimmauld Place, they watch intently as Number 12, a tall terraced house, slides seamlessly into position, revealing the entrance to the Black family home, which they enter with a sense of cautious anticipation."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The Minister's eyes move between Harry, Ron, and Hermione as the wedding reception bustles with activity. Soft light spills from the marquis, where Lupin strolls past a group of guards. Harry, standing in the covered walkway, secures the hovering Snitch in his jacket before entering. Inside, Fleur and Bill dance amid fluttering butterflies, while glasses magically fill with Champagne. Madame Maxime stands tall beside Hagrid, who gazes at her admiringly. A man with long white blonde hair dances theatrically with Luna Lovegood, catching Ron's attention as Hermione appears in a delightful sleeveless red dress. Harry notices Elphias Doge and approaches him, observing Luna's father wearing a distinctive pendant. As Harry sits with Elphias, an old woman scowls, leaving him puzzled. Suddenly, a bright white light appears in the sky, drawing Harry's attention as guests step back. The light bursts into the marquis, projecting images and voices that freeze the guests. As the images vanish, Bill comforts Fleur, and Elphias disapparates with the arrival of Death Eaters. Chaos ensues as they attack, prompting Ron to grab Hermione while Harry attempts to reach Ginny but is stopped by Lupin. Harry, Hermione, and Ron apparate to London, holding hands as they navigate Piccadilly Circus to a dingy alley. Hermione retrieves clothes from her bottomless handbag, and they sit in a cafe. A waitress, wearing earphones, serves them before strutting off. Two men enter, prompting Hermione to indicate her bag. A skirmish ensues, with Hermione and Ron subduing the attackers. The waitress, startled, retreats to the kitchen. Ron uses the Deluminator to absorb the light, while Hermione lowers the shutters with her wand. She approaches the dark-haired man on the floor, her wand glowing as she steadies her shaking hand. Later, they walk through a covered arcade until Hermione halts abruptly. At Grimmauld Place, they watch as Number 12, a tall terraced house, slides into view, and they enter the Black family home."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The Minister's eyes flit from Harry to Ron, then to Hermione, three young wizards central to the battle against Voldemort. The wedding reception is in full swing, celebrating the union of Fleur Delacour, a quarter-Veela known for her enchanting beauty, and Bill Weasley, a brave member of the Order of the Phoenix who was recently scarred by a werewolf. A soft light spills out of the marquis, a large, elegant tent used for grand events. A group of men keep guard outside as Lupin, a werewolf and former Defense Against the Dark Arts professor, strolls past them. Harry stands in the covered walkway, the Snitch, a golden ball used in Quidditch, hovering beside him, which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests, with butterflies, traditionally associated with magical transformations, fluttering around them. Harry smiles as glasses magically fill with Champagne, a favorite celebratory drink among witches and wizards. Standing beside the table is tall, dark-haired Madame Maxime, the half-giant headmistress of Beauxbatons Academy, and Hagrid, who is also a half-giant, looks up at her admiringly. A man with long white blonde hair dances theatrically with Luna Lovegood, known for her eccentric character and unique perspective, and Ron stares while Hermione appears looking delightful in a sleeveless red dress. Harry spots Elphias Doge, an old friend of Dumbledore and writer of his obituary, and heads towards him. Luna's father, Xenophilius Lovegood, wears a pendant with a triangle containing a circle with a vertical line through it, the symbol of the Deathly Hallows. Harry sits with Elphias, and an old woman, Auntie Muriel, renowned for her sharp tongue and vast family knowledge, scowls, prompting Harry to look puzzled. A bright white light appears in the sky, a sign of approaching trouble, and Harry rises with his eyes fixed on it as the guests draw back. The light bursts into the marquis, and images and voices, typically used to convey urgent messages, emerge from the hovering light, causing the guests to freeze. The images disappear, and Bill comforts Fleur as Elphias disapparates, a method for magically teleporting, upon Death Eaters' arrival. They attack the guests, and Ron grabs Hermione while Harry heads for Ginny, his love interest and a brave Gryffindor, only to be stopped by Lupin. Harry, Hermione, and Ron apparate to London, with Ron and Harry holding Hermione's hands for safety as they follow her across Piccadilly Circus, a bustling public space in London's West End, and down a crowded street to a dingy alley where they stand in a doorway. Hermione puts her hand into her small, bottomless handbag, charmed to hold many items, and pulls out clothes. They sit at a table in a cafe as a waitress comes over, wearing earphones, perhaps listening to the latest Muggle music, then struts off. Two men enter, and Hermione indicates her bag, meaning it's time to be on guard. The men, agents of Voldemort, fire wands, and in the kitchen, the waitress with the earphones sings to her music, oblivious to the chaos. One man is down as Hermione and Ron aim at the second behind the counter, who misses Hermione, and she then takes aim, causing him to fall. The waitress comes out of the kitchen and gapes at the scene, then scurries back. Ron uses the Deluminator, a magical device invented by Dumbledore, to absorb the light from the lamps while Hermione uses her wand to lower shutters, securing their surroundings. He strokes her cheek, and Hermione moves slowly towards the dark-haired man in overalls lying on the floor, his body stiffened and unmoving, revealing signs of a successful stunning spell. She points her wand with a shaking hand as her arm wavers and the tip glows, signaling the incantation of a spell, with Dolohov's, one of Voldemort's most dangerous followers, eyes remaining open and starry. Later, they walk through a covered arcade, a historic shopping passage, until Hermione suddenly stops. In Grimmauld Place, once the ancestral home of the Black family, they watch as Number 12, a tall terraced house connected to powerful wards, slides into position, and they enter the Black family home, now serving as a secret headquarters for the Order of the Phoenix."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The Minister's eyes flit from Harry to Ron then to Hermione  The wedding reception is in full swing  A soft light spills out of the marquis  Luna's father wears a pendant with a triangle containing a circle with a vertical line through it  Harry sits with Elphias and an old woman scowls prompting Harry to look puzzled  A bright white light appears in the sky and Harry rises with his eyes fixed on the approaching light as the guests draw back  The light bursts into the marquis and images and voices emerge from the hovering light causing the guests to freeze  The images disappear and Bill comforts Fleur as Elphias disapparates upon Death Eaters' arrival  They attack the guests and Ron grabs Hermione while Harry heads for Ginny only to be stopped by Lupin  Harry  Hermione and Ron apparate in London with Ron and Harry holding Hermione's hands as they follow her across Piccadilly Circus and down a crowded street to a dingy alley where they stand in a doorway  Hermione puts her hand into her small bottomless handbag and pulls out clothes  They sit at a table in a cafe as a waitress comes over wearing earphones then struts off  Two men enter and Hermione indicates her bag  The men fire wands and in the kitchen the waitress with the earphones sings to her music  One man is down as Hermione and Ron aim at the second behind the counter who misses Hermione and she then takes aim causing him to fall  The waitress comes out of the kitchen and gapes then scurries back  Ron uses the Deluminator to absorb the light from the lamps while Hermione uses her wand to lower shutters  A group of men keep guard outside as Lupin strolls past them  Harry stands in the covered walkway the Snitch hovering beside him which he grasps and puts in his jacket pocket before entering the marquis  Fleur and Bill are dancing together between two lines of guests with butterflies fluttering around them  Harry smiles as glasses magically fill with Champagne  Standing beside the table is tall darkhaired Madame Maxime and Hagrid looks up at her admiringly  A man with long white blonde hair dances theatrically with Luna Lovegood and Ron stares while Hermione appears looking delightful in a sleeveless red dress  Harry spots Elphias Doge and heads towards him  Luna's father wears a pendant with a triangle containing a circle with a vertical line through it  Harry sits with Elphias and an old woman scowls prompting Harry to look puzzled  A bright white light appears in the sky and Harry rises with his eyes fixed on the approaching light as the guests draw back  The light bursts into the marquis and images and voices emerge from the hovering light causing the guests to freeze  The images disappear and Bill comforts Fleur as Elphias disapparates upon Death Eaters' arrival  They attack the guests and Ron grabs Hermione while Harry heads for Ginny only to be stopped by Lupin  Harry  Hermione and Ron apparate in London with Ron and Harry holding Hermione's hands as they follow her across Piccadilly Circus and down a crowded street to a dingy alley where they stand in a doorway  Hermione puts her hand into her small bottomless handbag and pulls out clothes  They sit at a table in a cafe as a waitress comes over wearing earphones then struts off  Two men enter and Hermione indicates her bag  The men fire wands and in the kitchen the waitress with the earphones sings to her music  One man is down as Hermione and Ron aim at the second behind the counter who misses Hermione and she then takes aim causing him to fall  The waitress comes out of the kitchen and gapes then scurries back  Ron uses the Deluminator to absorb the light from the lamps while Hermione uses her wand to lower shutters  He strokes her cheek and Hermione moves slowly towards the darkhaired man in overalls lying on the floor his body stiffened and unmoving  She points her wand with a shaking hand as her arm wavers and the tip glows with Dolohov's eyes remaining open and starry  Later they walk through a covered arcade until Hermione suddenly stops  In Grimmauld Place they watch as Number 12 a tall terraced house slides into position and they enter the Black family home"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The Minister's eyes flit from Harry to Ron then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them. Harry stands in the covered walkway the Snitch hovering beside him which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne. Standing beside the table is tall darkhaired Madame Maxime and Hagrid looks up at her admiringly. A man with long white blonde hair dances theatrically with Luna Lovegood and Ron stares while Hermione appears looking delightful in a sleeveless red dress. Harry spots Elphias Doge and heads towards him. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. Harry sits with Elphias and an old woman scowls prompting Harry to look puzzled. A bright white light appears in the sky and Harry rises with his eyes fixed on the approaching light as the guests draw back. The light bursts into the marquis and images and voices emerge from the hovering light causing the guests to freeze. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. The images disappear and Bill comforts Fleur as Elphias disapparates upon Death Eaters' arrival. They attack the guests and Ron grabs Hermione while Harry heads for Ginny only to be stopped by Lupin. Harry. Hermione and Ron apparate in London with Ron and Harry holding Hermione's hands as they follow her across Piccadilly Circus and down a crowded street to a dingy alley where they stand in a doorway. Hermione puts her hand into her small bottomless handbag and pulls out clothes. They sit at a table in a cafe as a waitress comes over wearing earphones then struts off. Two men enter and Hermione indicates her bag. The men fire wands and in the kitchen the waitress with the earphones sings to her music. One man is down as Hermione and Ron aim at the second behind the counter who misses Hermione and she then takes aim causing him to fall. The waitress comes out of the kitchen and gapes then scurries back. Ron uses the Deluminator to absorb the light from the lamps while Hermione uses her wand to lower shutters. He strokes her cheek and Hermione moves slowly towards the darkhaired man in overalls lying on the floor his body stiffened and unmoving. She points her wand with a shaking hand as her arm wavers and the tip glows with Dolohov's eyes remaining open and starry. Later they walk through a covered arcade until Hermione suddenly stops. In Grimmauld Place they watch as Number 12 a tall terraced house slides into position and they enter the Black family home."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The Minister's eyes flit from Harry to Ron then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them. Harry stands in the covered walkway the Snitch hovering beside him which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne. Standing beside the table is tall darkhaired Madame Maxime and Hagrid looks up at her admiringly. A man with long white blonde hair dances theatrically with Luna Lovegood and Ron stares while Hermione appears looking delightful in a sleeveless red dress. Harry spots Elphias Doge and heads towards him. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. Harry sits with Elphias and an old woman scowls prompting Harry to look puzzled. A bright white light appears in the sky and Harry rises with his eyes fixed on the approaching light as the guests draw back. The light bursts into the marquis and images and voices emerge from the hovering light causing the guests to freeze. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. The images disappear and Bill comforts Fleur as Elphias disapparates upon Death Eaters' arrival. They attack the guests and Ron grabs Hermione while Harry heads for Ginny only to be stopped by Lupin. Harry. Hermione and Ron apparate in London with Ron and Harry holding Hermione's hands as they follow her across Piccadilly Circus and down a crowded street to a dingy alley where they stand in a doorway. Hermione puts her hand into her small bottomless handbag and pulls out clothes. They sit at a table in a cafe as a waitress comes over wearing earphones then struts off. Two men enter and Hermione indicates her bag. The men fire wands and in the kitchen the waitress with the earphones sings to her music. One man is down as Hermione and Ron aim at the second behind the counter who misses Hermione and she then takes aim causing him to fall. The waitress comes out of the kitchen and gapes then scurries back. Ron uses the Deluminator to absorb the light from the lamps while Hermione uses her wand to lower shutters. He strokes her cheek and Hermione moves slowly towards the darkhaired man in overalls lying on the floor his body stiffened and unmoving. She points her wand with a shaking hand as her arm wavers and the tip glows with Dolohov's eyes remaining open and starry. Later they walk through a covered arcade until Hermione suddenly stops. In Grimmauld Place they watch as Number 12 a tall terraced house slides into position and they enter the Black family home."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The Minister's eyes flit from Harry to Ron then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them. Harry stands in the covered walkway the Snitch hovering beside him which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne. The men fire wands and in the kitchen the waitress with the earphones sings to her music. One man is down as Hermione and Ron aim at the second behind the counter who misses Hermione and she then takes aim causing him to fall. The waitress comes out of the kitchen and gapes then scurries back. Ron uses the Deluminator to absorb the light from the lamps while Hermione uses her wand to lower shutters. He strokes her cheek and Hermione moves slowly towards the darkhaired man in overalls lying on the floor his body stiffened and unmoving. She points her wand with a shaking hand as her arm wavers and the tip glows with Dolohov's eyes remaining open and starry. Later they walk through a covered arcade until Hermione suddenly stops. In Grimmauld Place they watch as Number 12 a tall terraced house slides into position and they enter the Black family home."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The Minister's eyes flit from Harry to Ron then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis. She points her wand with a shaking hand as her arm wavers and the tip glows with Dolohov's eyes remaining open and starry. Later they walk through a covered arcade until Hermione suddenly stops. In Grimmauld Place they watch as Number 12 a tall terraced house slides into position and they enter the Black family home."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dragon's eyes flit from the dolphin to the giraffe, then to the koala. The wedding reception is in full swing. A soft light spills out of the marquis. A group of pandas keep guard outside as the unicorn strolls past them. The dolphin stands in the covered walkway, the Snitch hovering beside it, which it grasps and puts in its jacket pocket before entering the marquis. The flamingo and the penguin are dancing together between two lines of guests, with butterflies fluttering around them. The dolphin smiles as glasses magically fill with Champagne. Standing beside the table is tall, dark-haired Madame Maxime, and the rhinoceros looks up at her admiringly. A man with long white blonde hair dances theatrically with the owl, and the giraffe stares while the koala appears looking delightful in a sleeveless red dress. The dolphin spots the lemur and heads towards it. The owl's father wears a pendant with a triangle containing a circle with a vertical line through it. The dolphin sits with the lemur, and an old woman scowls, prompting the dolphin to look puzzled. A bright white light appears in the sky, and the dolphin rises with its eyes fixed on the approaching light as the guests draw back. The light bursts into the marquis, and images and voices emerge from the hovering light, causing the guests to freeze. The images disappear, and the penguin comforts the flamingo as the lemur disapparates upon Death Eaters' arrival. They attack the guests, and the giraffe grabs the koala while the dolphin heads for the panda, only to be stopped by the unicorn. The dolphin, the koala, and the giraffe apparate in London, with the giraffe and the dolphin holding the koala's hands as they follow it across Piccadilly Circus and down a crowded street to a dingy alley where they stand in a doorway. The koala puts its hand into its small, bottomless handbag and pulls out clothes. They sit at a table in a cafe as a waitress comes over, wearing earphones, then struts off. Two tigers enter, and the koala indicates its bag. The tigers fire wands, and in the kitchen, the waitress with the earphones sings to her music. One tiger is down as the koala and the giraffe aim at the second behind the counter, who misses the koala, and it then takes aim, causing him to fall. The waitress comes out of the kitchen and gapes, then scurries back. The giraffe uses the Deluminator to absorb the light from the lamps while the koala uses its wand to lower shutters. The giraffe strokes its cheek, and the koala moves slowly towards the dark-haired kangaroo in overalls lying on the floor, its body stiffened and unmoving. It points its wand with a shaking hand as its arm wavers and the tip glows, with Dolohov's eyes remaining open and starry. Later, they walk through a covered arcade until the koala suddenly stops. In Grimmauld Place, they watch as Number 12, a tall terraced house, slides into position, and they enter the Black family home."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The Minister's eyes flit from Harry to Ron, then to Hermione. The birthday party is in full swing. A soft light spills out of the log cabin. A group of dogs keep guard outside as Lupin strolls past them. Harry stands in the covered porch, the marble rolling beside him, which he grasps and puts in his jacket pocket before entering the cabin. Fleur and Bill are dancing together between two lines of guests, with sparrows fluttering around them. Harry smiles as mugs magically fill with Cider. Standing beside the fountain is tall, dark-haired Madame Maxime, and Hagrid looks up at her admiringly. A man with long white blonde hair dances theatrically with Luna Lovegood, and Ron stares while Hermione appears looking delightful in a sleeveless red blouse. Harry spots Elphias Doge and heads towards him. Luna's father wears a pendant with a hexagon containing a square with a horizontal line through it. Harry sits with Elphias, and an old woman scowls, prompting Harry to look puzzled. A bright white light appears in the sky, and Harry rises with his eyes fixed on the approaching light as the guests draw back. The light bursts into the cabin, and images and voices emerge from the hovering light, causing the guests to freeze. The images disappear, and Bill comforts Fleur as Elphias disapparates upon Death Eaters' arrival. They attack the guests, and Ron grabs Hermione while Harry heads for Ginny, only to be stopped by Lupin. Harry, Hermione, and Ron apparate in Paris, with Ron and Harry holding Hermione's hands as they follow her across Trafalgar Square and down a crowded street to a narrow alley where they stand in a doorway. Hermione puts her hand into her small, bottomless backpack and pulls out books. They sit at a table in a bistro as a waiter comes over, wearing sunglasses, then struts off. Two women enter, and Hermione indicates her backpack. The women fire arrows, and in the pantry, the waiter with the sunglasses sings to his music. One woman is down as Hermione and Ron aim at the second behind the counter, who misses Hermione, and she then takes aim, causing her to fall. The waiter comes out of the pantry and gapes, then scurries back. Ron uses the Deluminator to absorb the light from the candles while Hermione uses her wand to lower curtains. He strokes her cheek, and Hermione moves slowly towards the blond-haired woman in overalls lying on the floor, her body stiffened and unmoving. She points her wand with a shaking hand as her arm wavers and the tip glows, with Dolohov's eyes remaining open and starry. Later, they walk through a covered passage until Hermione suddenly stops. In Grimmauld Place, they watch as Number 12, a tall terraced house, slides into position, and they enter the Black family home."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The Minister's eyes linger from Harry to Ron, then to Hermione. The wedding reception is bustling with energy. A soft light cascades out of the marquis. A group of men play cards outside as Lupin whispers past them. Harry lounges in the covered walkway, the Snitch hovering beside him, which he flicks and tucks in his jacket pocket before entering the marquis. Fleur and Bill are chatting together between two lines of guests, with butterflies gliding around them. Harry nods as glasses mysteriously spill with Champagne. Standing beside the table is tall, dark-haired Madame Maxime, and Hagrid glances up at her curiously. A man with long white blonde hair poses theatrically with Luna Lovegood, and Ron gawks while Hermione materializes looking delightful in a sleeveless red dress. Harry glimpses Elphias Doge and strolls towards him. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. Harry reclines with Elphias, and an old woman sneers, prompting Harry to look bewildered. A bright white light emerges in the sky, and Harry stands with his eyes glued to the approaching light as the guests pull away. The light explodes into the marquis, and images and voices echo from the hovering light, causing the guests to pause. The images vanish, and Bill reassures Fleur as Elphias disapparates upon Death Eaters' arrival. They storm the guests, and Ron drags Hermione while Harry dashes for Ginny, only to be interrupted by Lupin. Harry, Hermione, and Ron teleport in London, with Ron and Harry clutching Hermione's hands as they shadow her across Piccadilly Circus and down a bustling street to a dingy alley where they linger in a doorway. Hermione reaches her hand into her small, bottomless handbag and extracts clothes. They perch at a table in a cafe as a waitress comes over, wearing earphones, then sashays off. Two men enter, and Hermione gestures at her bag. The men hurl wands, and in the kitchen, the waitress with the earphones grooves to her music. One man is down as Hermione and Ron direct their aim at the second behind the counter, who avoids Hermione, and she then targets, causing him to topple. The waitress emerges from the kitchen and gasps, then flees back. Ron uses the Deluminator to capture the light from the lamps while Hermione uses her wand to seal shutters. He brushes her cheek, and Hermione advances slowly towards the dark-haired man in overalls sprawled on the floor, his body rigid and unmoving. She lifts her wand with a trembling hand as her arm sways and the tip glimmers, with Dolohov's eyes remaining open and starry. Later, they meander through a covered arcade until Hermione suddenly halts. In Grimmauld Place, they observe as Number 12, a tall terraced house, glides into position, and they enter the Black family home."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The Tiger's whiskers flutter from Oliver to Arthur, then to Beatrice. The circus parade is in full swing. A soft light spills out of the gazebo. A group of trees keep guard outside as Vincent strolls past them. Oliver stands in the painted tunnel, the Kite hovering beside him, which he grasps and puts in his backpack before entering the gazebo. Daisy and Tom are juggling together between two lines of acrobats, with hummingbirds fluttering around them. Oliver smiles as teacups magically fill with Lemonade. Standing beside the fountain is tall, blond-haired Mr. Jackson, and Harry looks up at him admiringly. A woman with long red hair dances theatrically with Sarah Lightfoot, and Arthur stares while Beatrice appears looking delightful in a sleeveless blue dress. Oliver spots Felix Stag and heads towards him. Sarah's sibling wears a bracelet with a square containing a star with a diagonal line through it. Oliver sits with Felix, and an old man scowls, prompting Oliver to look puzzled. A bright blue light appears in the river, and Oliver rises with his eyes fixed on the approaching light as the acrobats draw back. The light bursts into the gazebo, and images and bells emerge from the hovering light, causing the acrobats to freeze. The images disappear, and Tom comforts Daisy as Felix vanishes upon Specters' arrival. They attack the acrobats, and Arthur grabs Beatrice while Oliver heads for Jenny, only to be stopped by Vincent. Oliver, Beatrice, and Arthur teleport in Paris, with Arthur and Oliver holding Beatrice's hands as they follow her across Trafalgar Square and down a narrow tunnel to a shabby corridor where they stand in a doorway. Beatrice puts her hand into her small, bottomless backpack and pulls out shoes. They sit at a booth in a diner as a bartender comes over, wearing sunglasses, then struts off. Two women enter, and Beatrice indicates her backpack. The women fire arrows, and in the pantry, the bartender with the sunglasses hums to her tune. One woman is down as Beatrice and Arthur aim at the second behind the counter, who misses Beatrice, and she then takes aim, causing her to trip. The bartender comes out of the pantry and gapes, then scurries back. Arthur uses the Luminator to absorb the light from the candles while Beatrice uses her stick to lower shades. He strokes her wrist, and Beatrice moves slowly towards the red-haired woman in a uniform lying on the floor, her body stiffened and unmoving. She points her stick with a shaking hand as her arm wavers and the tip glows, with Theodore's eyes remaining open and dreamy. Later, they walk through a covered walkway until Beatrice suddenly stops. In Foxglove House, they watch as Number 5, a short detached tower, slides into position, and they enter the Silver family home."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The Astronaut's eyes dart from Neville to Fred, then to Luna. The graduation ceremony is in full swing. A warm light seeps out of the gazebo. A band of women dance merrily outside as Tonks slides past them. Neville waits in the covered path, the Quidditch broom hovering next to him, which he catches and places in his backpack before entering the gazebo. Ginny and Charlie are singing together between two rows of attendees, with doves gliding around them. Neville grins as plates magically fill with chocolate cake. Standing near the podium is short, curly-haired Professor Sprout, and McGonagall gazes up at her approvingly. A woman with short dark brown hair sings extravagantly with Seamus Finnigan, and Fred gapes while Luna appears looking radiant in a sleeveless blue dress. Neville notices Arabella Figg and strolls towards her. Seamus's mother wears a brooch with a square containing a diamond with a diagonal line through it. Neville converses with Arabella, and a young woman laughs, prompting Neville to look bewildered. A vivid red light flashes in the sky, and Neville stands with his gaze fixed on the approaching light as the attendees pull back. The light crashes into the gazebo, and shapes and melodies emanate from the shimmering light, causing the attendees to pause. The shapes dissipate, and Charlie calms Ginny as Arabella vanishes upon Dementors' arrival. They scare the attendees, and Fred clutches Luna while Neville rushes for Hermione, only to be halted by Tonks. Neville, Luna, and Fred teleport to Paris, with Fred and Neville holding Luna’s hands as they chase her across the Champs-Élysées and into a bustling square to a quiet lane where they lean in a doorway. Luna puts her hand into her tiny, endless bag and retrieves a map. They sit at a bench in a park as a gardener passes by, wearing sunglasses, then saunters off. Two women appear, and Luna gestures to her map. The women cast spells, and in the pantry, the gardener with the sunglasses hums to her tune. One woman is incapacitated as Luna and Fred focus on the second behind the hedge, who misses Luna, and she then takes aim, sending her toppling over. The gardener emerges from the pantry and gasps, then retreats quickly. Fred uses the Extinguisher to capture the glow from the lanterns while Luna employs her staff to close shutters. He pats her shoulder, and Luna steps cautiously towards the grey-haired woman in sneakers propped on the ground, her body rigid and motionless. She directs her staff with a trembling hand as her arm quivers and the end sparkles, with Crabbe's eyes staying open and shiny. Later, they wander through a glass arcade until Luna abruptly halts. In the Burrow, they observe as Number 23, a modest semi-detached house, shifts into sight, and they enter the Weasley family residence."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The Minister's eyes blink from Harry to Ron, then to Hermione. The concert is in full swing. A dim light pours out of the tent. A group of women keep watch outside as Lupin jogs past them. Harry lingers in the shaded corridor, the Goblet floating beside him, which he catches and slips into his coat pocket before entering the tent. Fleur and Bill are skipping together between two rows of guests, with fireflies gliding around them. Harry chuckles as mugs magically fill with Cocoa. Standing beside the pedestal is short, blond-haired Madame Maxime, and Hagrid gazes up at her appreciatively. A woman with short dark hair twirls dramatically with Luna Lovegood, and Ron gawks while Hermione appears looking charming in a sleeveless green dress. Harry notices Elphias Doge and moves towards him. Luna's father wears a necklace with a square enclosing a triangle with a diagonal line through it. Harry reclines with Elphias, and an old man huffs, prompting Harry to look confused. A bright red glow emerges in the sky, and Harry rises with his eyes glued on the advancing glow as the guests step back. The glow explodes into the tent, and figures and sounds emanate from the floating glow, causing the guests to pause. The figures vanish, and Bill soothes Fleur as Elphias vanishes amidst Giants' arrival. They challenge the guests, and Ron pulls Hermione while Harry moves for Ginny, only to be blocked by Lupin. Harry, Hermione, and Ron vanish in London, with Ron and Harry clutching Hermione's hands as they shadow her across Trafalgar Square and down a bustling avenue to a narrow alley where they linger in a doorway. Hermione puts her hand into her large, infinite satchel and extracts snacks. They perch at a booth in a diner as a waitress approaches, wearing headphones, then strides off. Two women enter, and Hermione gestures to her satchel. The women brandish brooms, and in the kitchen, the waitress with the headphones hums to her music. One woman is down as Hermione and Ron aim at the second behind the bar, who misses Hermione, and she then takes aim, causing her to stumble. The waitress emerges from the kitchen and gawks, then scampers back. Ron uses the Luminator to capture the light from the chandeliers while Hermione uses her broom to raise awnings. He brushes her hair, and Hermione glides gently towards the dark-haired woman in a uniform lying on the ground, her body rigid and unmoving. She points her broom with a trembling hand as her arm hesitates and the end shines, with Dolohov's eyes remaining open and bright. Later, they wander through a covered arcade until Hermione unexpectedly halts. In Grimmauld Place, they observe as Number 12, a short detached cottage, glides into view, and they enter the Black family house."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The Captain's gaze darts from Charlie to Mike, then to Emily. The carnival parade is in full motion. A dim glow trickles out of the gazebo. A squad of women stand watch inside as George meanders past them. Charlie lingers in the sheltered pathway, the kite floating close to him, which he catches and slips into his coat pocket before entering the gazebo. Daisy and Jack are spinning together amidst two rows of spectators, with balloons drifting around them. Charlie chuckles as mugs magically overflow with apple cider. Stationed near the booth is short, curly-haired Lady Greenfield, and Oliver glances up at her adoringly. A woman with wild purple hair jives dramatically with Lily Everbright, and Mike gapes while Emily appears looking radiant in a sleeveless green gown. Charlie notices Tobias Snodgrass and moves towards him. Lily's mother wears a necklace with a square enclosing a triangle with a horizontal line across it. Charlie sits with Tobias, and a young woman frowns, prompting Charlie to look perplexed. A vibrant pink light emerges in the sky, and Charlie stands with his gaze locked on the nearing light as the crowd steps back. The light explodes into the gazebo, and pictures and sounds emerge from the floating light, causing the crowd to halt. The images vanish, and Jack reassures Daisy as Tobias vanishes upon goblins' arrival. They ambush the crowd, and Mike snatches Emily while Charlie heads for Jenny, only to be halted by George. Charlie, Emily, and Mike transport themselves to Manchester, with Mike and Charlie gripping Emily's hands as they trail her across Trafalgar Square and down a busy avenue to a shadowy lane where they stand in a doorway. Emily reaches her hand into her tiny, infinite purse and extracts garments. They sit at a booth in a diner as a server comes over, wearing headphones, then marches off. Two women enter, and Emily signals her purse. The women fire slingshots, and in the pantry, the server with the headphones hums to her music. One woman is down as Emily and Mike aim at the second behind the counter, who misses Emily, and she then takes aim, causing her to collapse. The server emerges from the pantry and stares, then dashes back. Mike uses the Lightcatcher to absorb the glow from the lanterns while Emily uses her baton to lower blinds. He pats her shoulder, and Emily moves carefully towards the blonde woman in a jumpsuit lying on the ground, her figure rigid and still. She points her baton with a trembling hand as her arm quivers and the tip shines, with Gregory's eyes remaining open and dreamy. Later, they stroll through a covered arcade until Emily suddenly halts. At Gloomy Manor, they watch as Number 14, a short detached bungalow, swivels into place, and they enter the White family abode."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The Minister's eyes move between Harry, Ron, and Hermione at a bustling wedding reception, where soft light spills from the marquee. Guards stand outside as Lupin walks by. Harry stands with a Snitch beside him, which he pockets before entering. Inside, Fleur and Bill dance surrounded by butterflies, while Madame Maxime and Hagrid share a moment nearby. A man with long white blonde hair dances with Luna Lovegood. Harry spots Elphias Doge and approaches him, noticing Luna's father wearing a unique pendant. As Harry converses with Elphias, a bright light appears in the sky, causing the guests to pause. The light bursts into the marquee, projecting images that halt the celebration. When the images vanish, Death Eaters attack, prompting Ron to grab Hermione and Harry to try reaching Ginny, stopped by Lupin. Harry, Hermione, and Ron apparate to London, navigating a crowded street to a dingy alley. Hermione retrieves clothes from her handbag, and they sit in a cafe. Two men enter, firing wands; Hermione and Ron counterattack. After subduing the men, Ron dims the lights with the Deluminator. Hermione approaches one man, pointing her wand at him. They later walk through an arcade to Grimmauld Place, where they watch Number 12 slide into view and enter the Black family home."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "In Grimmauld Place they watch as Number 12 a tall terraced house slides into position and they enter the Black family home Later they walk through a covered arcade until Hermione suddenly stops  She points her wand with a shaking hand as her arm wavers and the tip glows with Dolohov's eyes remaining open and starry  He strokes her cheek and Hermione moves slowly towards the darkhaired man in overalls lying on the floor his body stiffened and unmoving  Ron uses the Deluminator to absorb the light from the lamps while Hermione uses her wand to lower shutters  The waitress comes out of the kitchen and gapes then scurries back  One man is down as Hermione and Ron aim at the second behind the counter who misses Hermione and she then takes aim causing him to fall  The men fire wands and in the kitchen the waitress with the earphones sings to her music  Two men enter and Hermione indicates her bag  They sit at a table in a cafe as a waitress comes over wearing earphones then struts off  Hermione puts her hand into her small bottomless handbag and pulls out clothes  Hermione and Ron apparate in London with Ron and Harry holding Hermione's hands as they follow her across Piccadilly Circus and down a crowded street to a dingy alley where they stand in a doorway  Harry  They attack the guests and Ron grabs Hermione while Harry heads for Ginny only to be stopped by Lupin  The images disappear and Bill comforts Fleur as Elphias disapparates upon Death Eaters' arrival  The light bursts into the marquis and images and voices emerge from the hovering light causing the guests to freeze  A bright white light appears in the sky and Harry rises with his eyes fixed on the approaching light as the guests draw back  Harry sits with Elphias and an old woman scowls prompting Harry to look puzzled  Luna's father wears a pendant with a triangle containing a circle with a vertical line through it  Harry spots Elphias Doge and heads towards him  A man with long white blonde hair dances theatrically with Luna Lovegood and Ron stares while Hermione appears looking delightful in a sleeveless red dress  Standing beside the table is tall darkhaired Madame Maxime and Hagrid looks up at her admiringly  Harry smiles as glasses magically fill with Champagne  Fleur and Bill are dancing together between two lines of guests with butterflies fluttering around them  Harry stands in the covered walkway the Snitch hovering beside him which he grasps and puts in his jacket pocket before entering the marquis  A group of men keep guard outside as Lupin strolls past them  A soft light spills out of the marquis  The wedding reception is in full swing  The Minister's eyes flit from Harry to Ron then to Hermione "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "They attack the guests and Ron grabs Hermione while Harry heads for Ginny only to be stopped by Lupin  The light bursts into the marquis and images and voices emerge from the hovering light causing the guests to freeze  Harry smiles as glasses magically fill with Champagne  He strokes her cheek and Hermione moves slowly towards the darkhaired man in overalls lying on the floor his body stiffened and unmoving  Standing beside the table is tall darkhaired Madame Maxime and Hagrid looks up at her admiringly  The men fire wands and in the kitchen the waitress with the earphones sings to her music  The Minister's eyes flit from Harry to Ron then to Hermione  Hermione and Ron apparate in London with Ron and Harry holding Hermione's hands as they follow her across Piccadilly Circus and down a crowded street to a dingy alley where they stand in a doorway  Harry  Fleur and Bill are dancing together between two lines of guests with butterflies fluttering around them  Harry spots Elphias Doge and heads towards him  Later they walk through a covered arcade until Hermione suddenly stops  Harry stands in the covered walkway the Snitch hovering beside him which he grasps and puts in his jacket pocket before entering the marquis  Two men enter and Hermione indicates her bag  Hermione puts her hand into her small bottomless handbag and pulls out clothes  In Grimmauld Place they watch as Number 12 a tall terraced house slides into position and they enter the Black family home The waitress comes out of the kitchen and gapes then scurries back  The images disappear and Bill comforts Fleur as Elphias disapparates upon Death Eaters' arrival  The wedding reception is in full swing  A man with long white blonde hair dances theatrically with Luna Lovegood and Ron stares while Hermione appears looking delightful in a sleeveless red dress  They sit at a table in a cafe as a waitress comes over wearing earphones then struts off  One man is down as Hermione and Ron aim at the second behind the counter who misses Hermione and she then takes aim causing him to fall  Harry sits with Elphias and an old woman scowls prompting Harry to look puzzled  She points her wand with a shaking hand as her arm wavers and the tip glows with Dolohov's eyes remaining open and starry  A bright white light appears in the sky and Harry rises with his eyes fixed on the approaching light as the guests draw back  A soft light spills out of the marquis  A group of men keep guard outside as Lupin strolls past them  Luna's father wears a pendant with a triangle containing a circle with a vertical line through it  Ron uses the Deluminator to absorb the light from the lamps while Hermione uses her wand to lower shutters "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "They attack the guests and Ron grabs Hermione while Harry heads for Ginny only to be stopped by Lupin  Harry  Hermione and Ron apparate in London with Ron and Harry holding Hermione's hands as they follow her across Piccadilly Circus and down a crowded street to a dingy alley where they stand in a doorway  Hermione puts her hand into her small bottomless handbag and pulls out clothes  They sit at a table in a cafe as a waitress comes over wearing earphones then struts off  Two men enter and Hermione indicates her bag  The men fire wands and in the kitchen the waitress with the earphones sings to her music  One man is down as Hermione and Ron aim at the second behind the counter who misses Hermione and she then takes aim causing him to fall  The waitress comes out of the kitchen and gapes then scurries back  Ron uses the Deluminator to absorb the light from the lamps while Hermione uses her wand to lower shutters  He strokes her cheek and Hermione moves slowly towards the darkhaired man in overalls lying on the floor his body stiffened and unmoving  She points her wand with a shaking hand as her arm wavers and the tip glows with Dolohov's eyes remaining open and starry  Later they walk through a covered arcade until Hermione suddenly stops  In Grimmauld Place they watch as Number 12 a tall terraced house slides into position and they enter the Black family home The Minister's eyes flit from Harry to Ron then to Hermione  The wedding reception is in full swing  A soft light spills out of the marquis  A group of men keep guard outside as Lupin strolls past them  Harry stands in the covered walkway the Snitch hovering beside him which he grasps and puts in his jacket pocket before entering the marquis  Fleur and Bill are dancing together between two lines of guests with butterflies fluttering around them  Harry smiles as glasses magically fill with Champagne  Standing beside the table is tall darkhaired Madame Maxime and Hagrid looks up at her admiringly  A man with long white blonde hair dances theatrically with Luna Lovegood and Ron stares while Hermione appears looking delightful in a sleeveless red dress  Harry spots Elphias Doge and heads towards him  Luna's father wears a pendant with a triangle containing a circle with a vertical line through it  Harry sits with Elphias and an old woman scowls prompting Harry to look puzzled  A bright white light appears in the sky and Harry rises with his eyes fixed on the approaching light as the guests draw back  The light bursts into the marquis and images and voices emerge from the hovering light causing the guests to freeze  The images disappear and Bill comforts Fleur as Elphias disapparates upon Death Eaters' arrival "
        }
      ]
    }
  ]
}