{
  "ground_truth": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed. Harry picks it up, slips the chain over his head, and tucks the locket inside his shirt while Hermione looks anxiously at him. Harry stares at them both, then turns abruptly and walks away, later sitting outside the tent, studying his piece of broken mirror; he spins around, hearing a radio being tuned in the tent, and catches sight of Hermione down in a hollow. He lifts the locket from under his shirt and holds it in his hand, which twists as he connects with Voldemort, witnessing a boy thief escaping with a wand after Voldemort kills Gregorovitch. Harry gasps for breath, and Hermione walks slowly up to him, looking concerned as he glares at the tent. Hermione glances away, and Harry looks impatient, stomping off and reaching inside his shirt. He struggles to hold a chain over his head and hands her the locket and chain, which she studies before walking slowly away from Harry, whose head is lowered. Hermione sits on guard by a campfire in front of the tent, stands up at a sound, while in the tent, Harry wakes up with his head resting on a table, glancing over at the sleeping Ron.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Harry plunges into a hearth and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley seizes them on their journey upwards, causing their faces to twist, but he loses his grasp. Sunlight sifts down through a leafy canopy, and still in Albert's garments, Harry awakens lying on a carpet of deceased foliage in a woodland. Peering to his right, he perceives the pendant, and after slipping off Albert's coat, he scrambles over to the pendant and picks it up. Hermione is on her knees by a trembling Ron, while Harry searches frantically in the bag, points his wand, and a bottle snaps into his hand. She tends to the gaping injury on Ron's left shoulder with a few droplets of the essence, sealing the injury as her bloodstained hands reveal her relief. Hermione gets to her feet and strolls away, and Harry takes her place at Ron's side. Hermione braces herself and raises her wand as Harry looks at her bag. A dim light glows inside a small tent when Harry aims his wand at the pendant and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the pendant lies unscathed among the deceased foliage. Hermione tries, the pendant is engulfed in flames, but it remains unmarked and is tossed across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares wrathfully at the shining metal as the flames expire, but the pendant remains firmly closed. Harry picks it up, slips the chain over his head, and tucks the pendant inside his shirt while Hermione looks anxiously at him. Harry stares at them both, then turns abruptly and walks away, later sitting outside the tent, examining his fragment of shattered mirror; he spins around, hearing a radio being tuned in the tent, and notices Hermione down in a hollow. He lifts the pendant from under his shirt and holds it in his hand, which twists as he connects with Voldemort, witnessing a boy thief fleeing with a wand after Voldemort slays Gregorovitch. Harry gasps for breath, and Hermione walks slowly up to him, looking concerned as he glares at the tent. Hermione glances away, and Harry looks impatient, stomping off and reaching inside his shirt. He struggles to hold a chain over his head and hands her the pendant and chain, which she examines before walking slowly away from Harry, whose head is lowered. Hermione sits on guard by a campfire in front of the tent, stands up at a noise, while in the tent, Harry awakens with his head resting on a table, glancing over at the slumbering Ron."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; they are grabbed by Yaxley on their journey upwards, causing their faces to contort, but his grip is lost. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. To his right, the locket is seen by him, and after slipping off Albert's coat, the locket is scrambled over to and picked up by him. Hermione kneels by a shivering Ron, while the bag is desperately searched by Harry, a wand is pointed by him, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, and her relief is revealed by her bloodied hands as the wound is sealed. Hermione gets to her feet and walks away, and Ron's side is taken by Harry. Hermione braces herself and lifts her wand as her bag is looked at by Harry. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. The locket is tried by Hermione, who engulfs it in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but it remains firmly closed. The locket is picked up by Harry, who slips the chain over his head and tucks it inside his shirt while Hermione looks anxiously at him. Harry stares at them both, then turns abruptly and walks away, later sitting outside the tent and studying his piece of broken mirror; he spins around, hearing a radio being tuned in the tent, and catches sight of Hermione down in a hollow. He lifts the locket from under his shirt and holds it in his hand, which twists as he connects with Voldemort, witnessing a boy thief escaping with a wand after Voldemort kills Gregorovitch. Harry gasps for breath, and Hermione walks slowly up to him, looking concerned as the tent is glared at by him. Her gaze is averted by Hermione, and an impatient look is given to her by Harry, who stomps off and reaches inside his shirt. He struggles to hold a chain over his head and hands her the locket and chain, which she studies before she walks slowly away from Harry, whose head is lowered. Hermione sits on guard by a campfire in front of the tent, stands up at a sound, while in the tent, Harry wakes up with his head resting on a table, glancing over at the sleeping Ron."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Harry dives into a fireplace, followed by Hermione and Ron, with Yaxley close behind. Yaxley grabs them during their ascent, causing their faces to contort, but he loses his grip. Sunlight filters through a leafy canopy as Harry, still in Albert's clothes, wakes on a carpet of dead leaves in a forest. He sees the locket, removes Albert's coat, and retrieves it. Hermione kneels by a shivering Ron while Harry searches the bag, points his wand, and a bottle appears. She treats Ron's shoulder wound with essence, sealing it as her bloodied hands reveal relief. Hermione stands and walks away, and Harry takes her place by Ron. Hermione lifts her wand as Harry looks at her bag. A dim light glows inside a small tent when Harry aims his wand at the locket, causing smoke to rise. All three walk towards it, Ron with his arm in a sling, while the locket remains unscathed among the leaves. Hermione tries again, engulfing the locket in flames, but it remains unmarked and is thrown across the clearing. Ron, looking weary, watches it fly further away. Harry stares angrily at the locket as the flames die, but it stays closed. He picks it up, slips the chain over his head, and tucks it inside his shirt while Hermione looks anxiously at him. Harry stares at them, then turns and walks away, later sitting outside the tent, studying a broken mirror. He hears a radio in the tent and sees Hermione in a hollow. He lifts the locket, connecting with Voldemort, witnessing a boy thief escaping with a wand after Voldemort kills Gregorovitch. Harry gasps, and Hermione approaches, concerned as he glares at the tent. She glances away, and Harry, impatient, stomps off, reaching inside his shirt. He struggles to remove the chain, hands her the locket, which she studies before walking away from Harry, who lowers his head. Hermione sits guard by a campfire, stands at a sound, while in the tent, Harry wakes with his head on a table, glancing at the sleeping Ron."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Harry dives into a fireplace, followed by Hermione and Ron, with Yaxley close behind. Yaxley grabs them, causing their faces to contort, but loses his grip. Sunlight filters through a leafy canopy as Harry, still in Albert's clothes, wakes on dead leaves in a forest. He sees the locket, removes Albert's coat, and picks it up. Hermione kneels by a shivering Ron while Harry searches the bag, retrieves a bottle, and Hermione treats Ron's shoulder wound, sealing it. Hermione walks away, and Harry takes her place. She lifts her wand as Harry looks at her bag. A dim light glows in a tent when Harry aims his wand at the locket, but it remains unscathed. All three walk towards the tent, Ron's arm in a sling. Hermione tries again, but the locket remains unmarked. Ron looks weary as the locket flies away. Harry stares angrily at it, picks it up, and tucks it inside his shirt. He later sits outside the tent, studying a broken mirror, hears a radio, and sees Hermione. He lifts the locket, connecting with Voldemort, witnessing a boy thief escaping. Harry gasps, and Hermione approaches, concerned. Harry stomps off, hands her the locket, which she studies before walking away. Hermione sits by a campfire, stands at a sound, while Harry wakes in the tent, glancing at sleeping Ron."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Harry, with a determined leap, dives headfirst into the fireplace and is swiftly whisked upwards. He is closely followed by Hermione and Ron, with Yaxley hot on their heels, pursuing them relentlessly. During their rapid ascent, Yaxley manages to grab hold of them, causing their faces to contort in discomfort. However, he soon loses his grip, unable to maintain his hold. Sunlight gently filters down through the leafy canopy above, casting dappled shadows on the ground. Still clad in Albert's clothes, Harry awakens to find himself lying on a soft carpet of dead leaves in the heart of a forest. As he glances to his right, he spots the locket. After slipping off Albert's coat, he scrambles over to the locket and picks it up with a sense of urgency. Nearby, Hermione is on her knees beside a shivering Ron, while Harry frantically searches through the bag. He points his wand, and a bottle magically pops into his hand. Hermione uses a few drops of the essence to treat the gaping wound on Ron's left shoulder, sealing it as her bloodied hands reveal her relief. Hermione then gets to her feet and walks away, leaving Harry to take her place at Ron's side. Hermione braces herself, lifting her wand as Harry looks intently at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket, causing smoke to rise from it. All three of them walk towards the tent, with Ron's left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione makes an attempt, and the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed. Harry picks it up, slips the chain over his head, and tucks the locket inside his shirt while Hermione looks anxiously at him. Harry stares at them both, then turns abruptly and walks away, later sitting outside the tent, studying his piece of broken mirror. He spins around, hearing a radio being tuned in the tent, and catches sight of Hermione down in a hollow. He lifts the locket from under his shirt and holds it in his hand, which twists as he connects with Voldemort, witnessing a boy thief escaping with a wand after Voldemort kills Gregorovitch. Harry gasps for breath, and Hermione walks slowly up to him, looking concerned as he glares at the tent. Hermione glances away, and Harry looks impatient, stomping off and reaching inside his shirt. He struggles to hold a chain over his head and hands her the locket and chain, which she studies before walking slowly away from Harry, whose head is lowered. Hermione sits on guard by a campfire in front of the tent, stands up at a sound, while in the tent, Harry wakes up with his head resting on a table, glancing over at the sleeping Ron."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a determined leap, Harry boldly dives headfirst into the large fireplace and is swiftly whisked upwards by the magical transportation system. He is immediately followed by Hermione and Ron, with Yaxley relentlessly pursuing them, remaining hot on their heels. During the swift and rapid ascent, Yaxley manages to grab hold of them, causing their faces to contort painfully in discomfort. However, Yaxley soon loses his grip, unable to maintain his hold on them for long. Sunlight gently filters down through the leafy canopy above, casting dappled shadows on the forest floor. Still wearing Albert’s clothes, Harry awakens to find himself lying on a soft carpet of dead leaves in the heart of a dense forest. As he glances to his right, his eyes catch sight of the locket. After shedding Albert’s coat, he scrambles over to the locket and picks it up with an urgent and pressing feeling. Nearby, Hermione is on her knees beside a shivering Ron, while Harry frantically searches through their bag. With determination, he points his wand, and a bottle magically pops into his hand. Hermione meticulously uses a few precious drops of the essence to treat the gaping wound on Ron’s left shoulder, successfully sealing it as her bloodied hands reveal her relief. Hermione then rises to her feet and walks away, leaving Harry to take her place at Ron’s side. Hermione braces herself, lifting her wand with purpose while Harry looks intently at her bag. Inside the small tent, a dim light flickers and glimmers when Harry aims his wand at the locket, which causes smoke to rise from it. The trio walks towards the inviting tent, with Ron’s left arm secured in a sling, while the resilient locket remains unscathed among the dead leaves. Hermione attempts a spell, and although the locket is engulfed in fierce flames, it remains unmarked and is forcefully thrown across the clearing. Looking weary and ill, Ron gazes down at the locket, watching as it flies even further away. Harry stares angrily at the shining piece of metal as the flames die out, yet the locket remains firmly and stubbornly closed. Harry picks it up, slips the chain over his head, and tucks the locket inside his shirt while Hermione watches him anxiously. Harry stares at them both, then turns abruptly and walks away. Later, he sits outside the tent, deep in thought, studying his piece of broken mirror. He spins around upon hearing the sound of a radio being tuned inside the tent and catches sight of Hermione down in a hollow. He lifts the locket from beneath his shirt and holds it in his hand, which twists as he connects with Voldemort, witnessing a young boy thief escaping with a wand after Voldemort eliminates Gregorovitch. Harry gasps for breath, and Hermione slowly approaches him, looking concerned as he glares intensely at the tent. Hermione glances away, and Harry looks impatient, stomping off and reaching inside his shirt. He struggles to hold a chain over his head and hands her the locket and chain, which she examines carefully before walking slowly away from Harry, whose head is lowered in thought. Hermione remains vigilant, sitting on guard by a flickering campfire in front of the tent, standing up alertly at a sound, while inside the tent, Harry wakes up with his head resting on a table, glancing over at the peacefully sleeping Ron."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Harry, with a determined leap, dives headfirst into the fireplace, feeling the rush as he is whisked upwards through the magical network. Hermione and Ron follow closely behind, their movements quick and urgent, with Yaxley pursuing them relentlessly. As they ascend, Yaxley manages to grab hold of them, causing their faces to contort with the strain of the journey, but his grip falters, and he loses hold. Sunlight gently filters down through the leafy canopy above, casting dappled shadows on the forest floor where Harry, still clad in Albert's clothes, awakens lying on a soft carpet of dead leaves. He blinks, adjusting to the light, and glances to his right, spotting the locket. With a swift motion, he slips off Albert's coat, feeling the cool air on his skin, and scrambles over the leaves to retrieve the locket, picking it up with a sense of urgency. Nearby, Hermione is on her knees, tending to a shivering Ron, while Harry frantically searches through the bag, his fingers moving quickly until he points his wand and a bottle pops into his hand. Hermione carefully applies a few drops of the essence to the gaping wound on Ron's left shoulder, watching as it seals, her bloodied hands revealing her relief. Rising to her feet, Hermione walks away, leaving Harry to take her place at Ron's side. Hermione braces herself, lifting her wand with determination, as Harry glances at her bag. Inside a small tent, a dim light glimmers when Harry aims his wand at the locket, watching as smoke rises from it. The three of them walk towards the tent, Ron's left arm supported in a sling, while the locket lies unscathed amongst the dead leaves. Hermione attempts to destroy it, engulfing the locket in flames, but it remains unmarked and is thrown across the clearing. Ron, looking weary and ill, gazes down at the locket as it flies even further away. Harry stares angrily at the shining metal, his frustration mounting as the flames die out, but the locket remains firmly closed. With a resigned sigh, Harry picks it up, slips the chain over his head, and tucks the locket inside his shirt, noticing Hermione's anxious gaze. He stares at them both, then turns abruptly, walking away with purpose, later sitting outside the tent, studying his piece of broken mirror. He spins around at the sound of a radio being tuned inside the tent and catches sight of Hermione down in a hollow. Lifting the locket from under his shirt, he holds it in his hand, feeling a twist as he connects with Voldemort, witnessing a boy thief escaping with a wand after Voldemort kills Gregorovitch. Harry gasps for breath, the vision leaving him shaken, as Hermione walks slowly up to him, her concern evident as he glares at the tent. Hermione glances away, sensing his impatience, and Harry, feeling restless, stomps off, reaching inside his shirt. He struggles momentarily to lift the chain over his head and hands her the locket and chain, which she studies intently before walking slowly away from Harry, whose head is lowered in thought. Hermione sits on guard by a campfire in front of the tent, alert to any sound, while inside the tent, Harry wakes up with his head resting on a table, glancing over at the sleeping Ron, his mind still processing the events."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron, with Yaxley close behind. Yaxley grabs them during the journey, causing their faces to contort, but he loses his grip. Sunlight filters through a leafy canopy as Harry, still in Albert's clothes, wakes on a carpet of dead leaves in a forest. He notices the locket, removes Albert's coat, and retrieves the locket. Nearby, Hermione tends to a shivering Ron, using essence to seal a wound on his shoulder, revealing her relief. Hermione then walks away, and Harry takes her place beside Ron. As Hermione prepares her wand, Harry examines her bag. A dim light glows inside a small tent when Harry aims his wand at the locket, causing smoke to rise. The three approach the tent, Ron with his arm in a sling, while the locket remains unscathed among the leaves. Hermione attempts to destroy the locket with flames, but it remains intact and is thrown across the clearing. Ron, looking weary, watches it fly further away. Harry angrily stares at the locket, which remains closed. He picks it up, wears it, and tucks it inside his shirt as Hermione looks on anxiously. Harry stares at them both, then abruptly walks away, later sitting outside the tent, studying a broken mirror. He hears a radio tuning in the tent and sees Hermione in a hollow. Holding the locket, he connects with Voldemort, witnessing a boy thief escaping with a wand after Voldemort kills Gregorovitch. Harry gasps, and Hermione approaches, concerned as he glares at the tent. She glances away, and Harry impatiently stomps off, handing her the locket and chain, which she examines before walking away. Hermione sits on guard by a campfire, stands at a sound, while in the tent, Harry wakes with his head on a table, glancing at the sleeping Ron."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Harry dives into a fireplace, employing the magical Floo Network, and is whisked up, followed by Hermione and Ron with Yaxley, a Death Eater who serves Voldemort, close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, possibly in the ancient and mysterious Forest of Dean, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, known to be one of Voldemort's Horcruxes, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, affected by the locket's dark magic, while Harry searches desperately in the bag, points his wand from the core of a phoenix feather, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of dittany, a magical potion known for its healing properties, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her magically expanded bag. A dim light glimmers inside a small enchanted tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries a powerful Incendio spell, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed and impervious. Harry picks it up, slips the chain over his head, and tucks the locket inside his shirt while Hermione looks anxiously at him. Harry stares at them both, then turns abruptly and walks away, later sitting outside the tent, studying his shard of the two-way mirror once owned by Sirius Black; he spins around, hearing a radio being tuned inside the tent, broadcasting the clandestine messages of the resistance, and catches sight of Hermione down in a hollow. He lifts the locket from under his shirt and holds it in his hand, which twists as he connects with Voldemort, witnessing a boy thief, likely Gellert Grindelwald, escaping with a wand after Voldemort kills Gregorovitch, the renowned wandmaker. Harry gasps for breath, and Hermione walks slowly up to him, looking concerned as he glares at the tent. Hermione glances away, and Harry looks impatient, stomping off and reaching inside his shirt. He struggles to hold a chain over his head and hands her the locket and chain, which she studies before walking slowly away from Harry, whose head is lowered. Hermione sits on guard by a campfire in front of the tent, ready to alert the others of any danger, stands up at a sound, while in the tent, Harry wakes up with his head resting on a makeshift table, glancing over at the sleeping Ron."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Harry dives into a fireplace and is whisked up followed by Hermione and Ron with Yaxley close on their heels. Yaxley grabs them on their journey upwards causing their faces to contort but he loses his grip. Sunlight filters down through a leafy canopy and still in Albert's clothes. Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right he sees the locket and after slipping off Albert's coat he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron. while Harry searches desperately in the bag points his wand and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it. Ron with his left arm in a sling while the locket lies unscathed amongst the dead leaves. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Hermione tries the locket is engulfed in flames but it remains unmarked and is thrown across the clearing. Looking weary and ill Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out but the locket remains firmly closed. Harry picks it up slips the chain over his head and tucks the locket inside his shirt while Hermione looks anxiously at him. Harry stares at them both then turns abruptly and walks away later sitting outside the tent studying his piece of broken mirror. he spins around hearing a radio being tuned in the tent and catches sight of Hermione down in a hollow. He lifts the locket from under his shirt and holds it in his hand which twists as he connects with Voldemort witnessing a boy thief escaping with a wand. after Voldemort kills Gregorovitch. Harry gasps for breath and Hermione walks slowly up to him looking concerned as he glares at the tent. Hermione glances away and Harry looks impatient stomping off and reaching inside his shirt. He struggles to hold a chain over his head and hands her the locket and chain which she studies before walking slowly away from Harry whose head is lowered. Hermione sits on guard by a campfire in front of the tent. stands up at a sound while in the tent. Harry wakes up with his head resting on a table glancing over at the sleeping Ron."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Harry dives into a fireplace and is whisked up followed by Hermione and Ron with Yaxley close on their heels. Yaxley grabs them on their journey upwards causing their faces to contort but he loses his grip. Sunlight filters down through a leafy canopy and still in Albert's clothes. Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right he sees the locket and after slipping off Albert's coat he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron. while Harry searches desperately in the bag points his wand and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it. Ron with his left arm in a sling while the locket lies unscathed amongst the dead leaves. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. Hermione tries the locket is engulfed in flames but it remains unmarked and is thrown across the clearing. Looking weary and ill Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out but the locket remains firmly closed. Harry picks it up slips the chain over his head and tucks the locket inside his shirt while Hermione looks anxiously at him. Harry stares at them both then turns abruptly and walks away later sitting outside the tent studying his piece of broken mirror. he spins around hearing a radio being tuned in the tent and catches sight of Hermione down in a hollow. He lifts the locket from under his shirt and holds it in his hand which twists as he connects with Voldemort witnessing a boy thief escaping with a wand. after Voldemort kills Gregorovitch. Harry gasps for breath and Hermione walks slowly up to him looking concerned as he glares at the tent. Hermione glances away and Harry looks impatient stomping off and reaching inside his shirt. He struggles to hold a chain over his head and hands her the locket and chain which she studies before walking slowly away from Harry whose head is lowered. Hermione sits on guard by a campfire in front of the tent. stands up at a sound while in the tent. Harry wakes up with his head resting on a table glancing over at the sleeping Ron."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Harry dives into a fireplace and is whisked up followed by Hermione and Ron with Yaxley close on their heels. Yaxley grabs them on their journey upwards causing their faces to contort but he loses his grip. Sunlight filters down through a leafy canopy and still in Albert's clothes. Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right he sees the locket and after slipping off Albert's coat he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron. while Harry searches desperately in the bag points his wand and a bottle pops into his hand. after Voldemort kills Gregorovitch. Harry gasps for breath and Hermione walks slowly up to him looking concerned as he glares at the tent. Hermione glances away and Harry looks impatient stomping off and reaching inside his shirt. He struggles to hold a chain over his head and hands her the locket and chain which she studies before walking slowly away from Harry whose head is lowered. Hermione sits on guard by a campfire in front of the tent. stands up at a sound while in the tent. Harry wakes up with his head resting on a table glancing over at the sleeping Ron."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Harry dives into a fireplace and is whisked up followed by Hermione and Ron with Yaxley close on their heels. Yaxley grabs them on their journey upwards causing their faces to contort but he loses his grip. Sunlight filters down through a leafy canopy and still in Albert's clothes. Hermione sits on guard by a campfire in front of the tent. stands up at a sound while in the tent. Harry wakes up with his head resting on a table glancing over at the sleeping Ron."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Oliver burrows into a chimney and is catapulted skyward, trailed by Clarissa and Ted with Jasper trailing closely behind them; Jasper clutches onto them during their vertical ascent, making their visages twist, but he loses his grasp. Moonlight trickles down through a tangled mesh, and still in George's attire, Oliver awakens sprawled on a mat of fallen petals in a meadow. Peering to his left, he spots the bracelet, and after shrugging off George's jacket, he dashes toward the bracelet and grasps it. Clarissa is crouched by a trembling Ted, while Oliver rummages frantically in the pouch, flicks his glove, and a flask appears in his clutch. She tends to the open gash on Ted's right leg with a few dabs of the potion, mending the injury as her stained fingers express her relief. Clarissa rises and strolls away, and Oliver assumes her position at Ted's side. Clarissa steels herself and raises her glove as Oliver inspects her satchel. A faint glow shimmers inside a tiny cabin when Oliver directs his glove at the bracelet and mist billows from it. They all amble toward it, Ted with his right limb in a bandage, while the bracelet rests unharmed amidst the fallen petals. Clarissa attempts, the bracelet is consumed by embers, but it remains undamaged and is tossed across the glade. Appearing tired and sickly, Ted peers down at it as it glides even further afield. Oliver glares furiously at the gleaming alloy as the embers fade, but the bracelet stays securely fastened. Oliver snatches it, loops the strap around his neck, and tucks the bracelet within his garment while Clarissa watches him worriedly. Oliver stares at them both, then pivots sharply and strides away, later sitting outside the cabin, examining his shard of shattered glass; he swivels around, hearing music being adjusted in the cabin, and notices Clarissa down in a ravine. He lifts the bracelet from beneath his garment and holds it in his grip, which twists as he connects with Magnus, observing a youth marauder fleeing with a glove after Magnus eliminates Jericho. Oliver gasps for air, and Clarissa ambles slowly up to him, looking worried as he scowls at the cabin. Clarissa averts her gaze, and Oliver looks restless, trudging off and reaching into his garment. He wrestles to keep a strap over his neck and hands her the bracelet and strap, which she examines before ambling slowly away from Oliver, whose head is bowed. Clarissa sits vigil by a bonfire in front of the cabin, rises at a noise, while in the cabin, Oliver awakens with his head lying on a counter, glancing over at the dormant Ted."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Harry, Hermione, and Ron escape through a fireplace, pursued by Yaxley, who loses his grip during the chase. Harry wakes up in a forest, finds the locket, and helps treat Ron's shoulder injury. The trio attempts to destroy the locket with spells and fire, but it remains unscathed. Harry puts the locket on, and later, as he studies a broken mirror, he connects with Voldemort, witnessing a vision of a boy thief escaping. Harry is distressed, and Hermione approaches him with concern. He eventually hands the locket to Hermione, who walks away with it. Later, Harry wakes inside their tent while Hermione stands guard by a campfire, alert to any sounds outside."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Harry wakes up with his head resting on a table glancing over at the sleeping Ron stands up at a sound while in the tent  Hermione sits on guard by a campfire in front of the tent  He struggles to hold a chain over his head and hands her the locket and chain which she studies before walking slowly away from Harry whose head is lowered  Hermione glances away and Harry looks impatient stomping off and reaching inside his shirt  Harry gasps for breath and Hermione walks slowly up to him looking concerned as he glares at the tent  after Voldemort kills Gregorovitch  He lifts the locket from under his shirt and holds it in his hand which twists as he connects with Voldemort witnessing a boy thief escaping with a wand  he spins around hearing a radio being tuned in the tent and catches sight of Hermione down in a hollow  Harry stares at them both then turns abruptly and walks away later sitting outside the tent studying his piece of broken mirror  Harry picks it up slips the chain over his head and tucks the locket inside his shirt while Hermione looks anxiously at him  Harry stares angrily at the shining metal as the flames die out but the locket remains firmly closed  Looking weary and ill Ron gazes down at it as it flies even further away  Hermione tries the locket is engulfed in flames but it remains unmarked and is thrown across the clearing  Ron with his left arm in a sling while the locket lies unscathed amongst the dead leaves  All three walk towards it  A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it  Hermione braces herself and lifts her wand as Harry looks at her bag  Hermione gets to her feet and walks away and Harry takes her place at Ron's side  She treats the gaping wound on Ron's left shoulder with a few drops of the essence sealing the wound as her bloodied hands reveal her relief  while Harry searches desperately in the bag points his wand and a bottle pops into his hand  Hermione is on her knees by a shivering Ron  Glancing to his right he sees the locket and after slipping off Albert's coat he scrambles over to the locket and picks it up  Harry wakes lying on a carpet of dead leaves in a forest  Sunlight filters down through a leafy canopy and still in Albert's clothes  Yaxley grabs them on their journey upwards causing their faces to contort but he loses his grip  Harry dives into a fireplace and is whisked up followed by Hermione and Ron with Yaxley close on their heels "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Yaxley grabs them on their journey upwards causing their faces to contort but he loses his grip Harry dives into a fireplace and is whisked up followed by Hermione and Ron with Yaxley close on their heels Harry wakes lying on a carpet of dead leaves in a forest Sunlight filters down through a leafy canopy and still in Albert's clothes Hermione is on her knees by a shivering Ron Glancing to his right he sees the locket and after slipping off Albert's coat he scrambles over to the locket and picks it up She treats the gaping wound on Ron's left shoulder with a few drops of the essence sealing the wound as her bloodied hands reveal her relief while Harry searches desperately in the bag points his wand and a bottle pops into his hand Hermione braces herself and lifts her wand as Harry looks at her bag Hermione gets to her feet and walks away and Harry takes her place at Ron's side All three walk towards it A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it Hermione tries the locket is engulfed in flames but it remains unmarked and is thrown across the clearing Ron with his left arm in a sling while the locket lies unscathed amongst the dead leaves Harry stares angrily at the shining metal as the flames die out but the locket remains firmly closed Looking weary and ill Ron gazes down at it as it flies even further away Harry stares at them both then turns abruptly and walks away later sitting outside the tent studying his piece of broken mirror Harry picks it up slips the chain over his head and tucks the locket inside his shirt while Hermione looks anxiously at him He lifts the locket from under his shirt and holds it in his hand which twists as he connects with Voldemort witnessing a boy thief escaping with a wand he spins around hearing a radio being tuned in the tent and catches sight of Hermione down in a hollow Harry gasps for breath and Hermione walks slowly up to him looking concerned as he glares at the tent after Voldemort kills Gregorovitch He struggles to hold a chain over his head and hands her the locket and chain which she studies before walking slowly away from Harry whose head is lowered Hermione glances away and Harry looks impatient stomping off and reaching inside his shirt stands up at a sound while in the tent Hermione sits on guard by a campfire in front of the tent Harry wakes up with his head resting on a table glancing over at the sleeping Ron"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Looking weary and ill Ron gazes down at it as it flies even further away  Harry stares angrily at the shining metal as the flames die out but the locket remains firmly closed  Harry picks it up slips the chain over his head and tucks the locket inside his shirt while Hermione looks anxiously at him  Harry stares at them both then turns abruptly and walks away later sitting outside the tent studying his piece of broken mirror  he spins around hearing a radio being tuned in the tent and catches sight of Hermione down in a hollow  He lifts the locket from under his shirt and holds it in his hand which twists as he connects with Voldemort witnessing a boy thief escaping with a wand  after Voldemort kills Gregorovitch  Harry gasps for breath and Hermione walks slowly up to him looking concerned as he glares at the tent  Hermione glances away and Harry looks impatient stomping off and reaching inside his shirt  He struggles to hold a chain over his head and hands her the locket and chain which she studies before walking slowly away from Harry whose head is lowered  Hermione sits on guard by a campfire in front of the tent  stands up at a sound while in the tent  Harry wakes up with his head resting on a table glancing over at the sleeping Ron Harry dives into a fireplace and is whisked up followed by Hermione and Ron with Yaxley close on their heels  Yaxley grabs them on their journey upwards causing their faces to contort but he loses his grip  Sunlight filters down through a leafy canopy and still in Albert's clothes  Harry wakes lying on a carpet of dead leaves in a forest  Glancing to his right he sees the locket and after slipping off Albert's coat he scrambles over to the locket and picks it up  Hermione is on her knees by a shivering Ron  while Harry searches desperately in the bag points his wand and a bottle pops into his hand  She treats the gaping wound on Ron's left shoulder with a few drops of the essence sealing the wound as her bloodied hands reveal her relief  Hermione gets to her feet and walks away and Harry takes her place at Ron's side  Hermione braces herself and lifts her wand as Harry looks at her bag  A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it  All three walk towards it  Ron with his left arm in a sling while the locket lies unscathed amongst the dead leaves  Hermione tries the locket is engulfed in flames but it remains unmarked and is thrown across the clearing "
        }
      ]
    }
  ]
}