{
  "ground_truth": "Later, the pace hots up and the hall is jumping, with Tiny Professor Flitwick being passed over the heads of the dancers. To Parvati and Padma's annoyance, Harry and Ron won't dance, so the four of them sit glumly at the end of the room while Hermione dances wildly with Viktor, and Ron and Harry glare at Krum. Parvati is asked to dance, and she gets up with relief as Padma looks exasperated. Ron spots Krum kissing Hermione's hand before Viktor leaves her, and she spins around, her face flushed, before smiling happily as she sinks down beside Harry, Ron, and Padma. Ron gives a great sigh, and Hermione gets up to speak but thinks better of it, turns her back, and walks off, prompting Padma to glare at Ron before getting up and stalking off. Later, Ron tries to reason with Hermione, who wipes away a tear as the boys escape up the stairs. Meanwhile, Hermione flops miserably on the bottom step, takes off her party shoes, and rubs her feet. Neville is still dancing with Ginny, and Hagrid rests his head on Madame Maxime's chest, but his hand slips to her bottom and she puts it firmly back on her waist. Disturbed by the bell, crows rise into the darkness and swoop between the tall towers past one or two lighted windows, while snowflakes whirl outside the boys' bedroom. A large black crow flutters down onto the windowsill and peers in, while asleep in bed, Harry is having a nightmare. He sees the dark cemetery with the winged stone statue and the cloaked skeleton clutches the long scythe, with a snow-covered mansion behind it. Along the dusty paneled corridor, light shines from the open door, inside which Wormtail hovers as the young man kneels beside the armchair, revealing the dark mark tattooed on his arm, and a large snake whispers to the figure hidden in the armchair. A green flash occurs, and Harry's eyes spring open as Neville appears with his dancing shoes slung around his neck, waltzes off, and Harry smiles. Hermione looks concerned as Harry walks away, and Harry looks weary and nods, as Cedric gives Harry a knowing smile and goes. In the prefect's bathroom, Harry slips off his dressing gown and lowers himself into a bath the size of a small swimming pool, leans back under the bubbles, and is watched by a mermaid in a stained glass window who holds back her long golden hair. Harry turns to the golden egg standing on the side of the bath and opens it, but slams it shut again as a ghostly figure appears out of the lavatory, floats toward him, and dives into the bubbles. Harry grabs the egg, twists it open under the water, and as the egg glows brightly, Harry takes a deep breath and sinks down after it before bursting to the surface.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sure, here's the transformed text with synonymous replacements:\n\nAfterward, the tempo heats up and the auditorium is hopping, with Small Professor Flitwick being handed over the heads of the dancers. To Parvati and Padma's irritation, Harry and Ron refuse to dance, so the four of them sit sullenly at the end of the chamber while Hermione dances frantically with Viktor, and Ron and Harry scowl at Krum. Parvati is invited to dance, and she rises with relief as Padma appears frustrated. Ron notices Krum kissing Hermione's hand before Viktor departs from her, and she twirls around, her face flushed, before grinning contentedly as she settles down beside Harry, Ron, and Padma. Ron gives a large exhale, and Hermione gets up to speak but reconsiders, turns her back, and walks away, prompting Padma to scowl at Ron before rising and striding off. Afterward, Ron attempts to reason with Hermione, who brushes away a tear as the boys flee up the stairs. Meanwhile, Hermione collapses miserably on the bottom step, removes her party shoes, and massages her feet. Neville is still dancing with Ginny, and Hagrid rests his head on Madame Maxime's torso, but his hand slips to her rear and she puts it assertively back on her waist. Disturbed by the bell, crows rise into the darkness and swoop between the tall towers past one or two lit windows, while snowflakes swirl outside the boys’ dormitory. A large black crow flutters down onto the windowsill and peers in, while asleep in bed, Harry is experiencing a nightmare. He sees the dark graveyard with the winged stone sculpture and the cloaked skeleton grips the long scythe, with a snow-covered mansion behind it. Along the dusty paneled hallway, light glows from the open door, inside which Wormtail hovers as the young man kneels beside the armchair, revealing the dark mark inked on his arm, and a large serpent murmurs to the figure concealed in the armchair. A green flash happens, and Harry's eyes pop open as Neville appears with his dancing shoes slung around his neck, twirls away, and Harry grins. Hermione looks worried as Harry walks away, and Harry looks tired and nods, as Cedric gives Harry a knowing grin and leaves. In the prefect’s bathroom, Harry slips off his robe and lowers himself into a bath the size of a small swimming pool, leans back under the bubbles, and is watched by a mermaid in a stained glass window who holds back her long golden tresses. Harry turns to the golden egg standing on the side of the bath and opens it, but shuts it again as a spectral figure emerges out of the toilet, floats toward him, and dives into the bubbles. Harry grabs the egg, twists it open under the water, and as the egg shines brightly, Harry takes a deep breath and submerges after it before bursting to the surface."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Later, the pace hots up and the hall is jumping, with Tiny Professor Flitwick being passed over the heads of the dancers. To Parvati and Padma's annoyance, Harry and Ron won't dance, so the four of them sit glumly at the end of the room while Viktor dances wildly with Hermione, and Krum is glared at by Ron and Harry. A request to dance is made to Parvati, and she gets up with relief as Padma looks exasperated. Krum is spotted by Ron kissing Hermione's hand before she is left by Viktor, and she spins around, her face flushed, before smiling happily as she sinks down beside Padma, Ron, and Harry. A great sigh is given by Ron, and Hermione gets up to speak but thinks better of it, turns her back, and walks off, prompting Padma to glare at Ron before getting up and stalking off. Later, Hermione is tried to be reasoned with by Ron, who wipes away a tear as the boys escape up the stairs. Meanwhile, Hermione flops miserably on the bottom step, takes off her party shoes, and rubs her feet. Ginny is still being danced with by Neville, and Hagrid rests his head on Madame Maxime's chest, but her bottom is accidentally touched by his hand and it is firmly put back on her waist by her. A disturbance from the bell causes crows to rise into the darkness and they swoop between the tall towers past one or two lighted windows, while snowflakes whirl outside the boys' bedroom. A large black crow flutters down onto the windowsill and peers in, while asleep in bed, Harry has a nightmare. The dark cemetery is seen by him with the winged stone statue and the cloaked skeleton clutching the long scythe, with a snow-covered mansion behind it. Along the dusty paneled corridor, light shines from the open door, inside which Wormtail hovers as the young man kneels beside the armchair, revealing the dark mark tattooed on his arm, and a large snake whispers to the figure hidden in the armchair. A green flash occurs, and Harry's eyes spring open as Neville appears with his dancing shoes slung around his neck and waltzes off, and Harry smiles. Concern is shown by Hermione as Harry walks away, and Harry looks weary and nods, as Cedric gives Harry a knowing smile and goes. In the prefect's bathroom, Harry slips off his dressing gown and lowers himself into a bath the size of a small swimming pool, leans back under the bubbles, and is watched by a mermaid in a stained glass window who holds back her long golden hair. The golden egg is turned to by Harry, standing on the side of the bath, and it is opened by him, but it is slammed shut again as a ghostly figure appears out of the lavatory, floats toward him, and dives into the bubbles. The egg is grabbed by Harry, twisted open under the water, and as the egg glows brightly, a deep breath is taken by Harry and he sinks down after it before bursting to the surface."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Later, the pace escalates, and the hall is lively with Tiny Professor Flitwick being passed over dancers' heads. Annoyed that Harry and Ron won't dance, Parvati and Padma sit glumly while Hermione dances with Viktor, and Ron and Harry glare at Krum. Parvati is relieved when asked to dance, leaving Padma exasperated. Ron sees Krum kiss Hermione's hand before Viktor departs. Hermione, flushed and smiling, rejoins the group. Ron sighs, prompting Hermione to leave, which angers Padma, who stalks off. Later, Ron tries reasoning with Hermione, who wipes away tears as the boys escape. Hermione, dejected, removes her shoes and rubs her feet. Neville and Ginny continue dancing, while Hagrid mistakenly lowers his head onto Madame Maxime's chest. The bell's sound causes crows to rise, flying between towers past lit windows; snow whirls outside the boys' bedroom. A crow peers inside as Harry, asleep, dreams of a dark cemetery with a winged statue and cloaked skeleton. Light shines from an open door in a paneled corridor, revealing Wormtail and a young man with a dark mark. A large snake whispers to a hidden figure, and a green flash startles Harry awake. Neville appears, dancing shoes on his neck, and Harry smiles. Hermione looks concerned as a weary Harry walks away, receiving a knowing smile from Cedric. In the prefect's bathroom, Harry slips into a large bath, watched by a mermaid in a stained glass window. He opens the golden egg beside the bath, but shuts it as a ghost emerges from the lavatory and dives into the bubbles. Harry opens the egg underwater; it glows as he sinks before resurfacing."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The pace intensifies, and the hall buzzes as Professor Flitwick is carried over dancers' heads. Parvati and Padma are frustrated because Harry and Ron refuse to dance, so they sit while Hermione dances energetically with Viktor, and Ron and Harry glare at Krum. Parvati eagerly accepts a dance, leaving Padma exasperated. Ron notices Krum kissing Hermione's hand; she spins around, flushed and smiling, then joins them. Ron sighs, Hermione starts to speak, but turns away, causing Padma to glare at Ron and leave. Ron later tries reasoning with Hermione, who wipes a tear as the boys retreat upstairs. Hermione, distressed, removes her shoes and rubs her feet. Neville dances with Ginny, and Hagrid accidentally touches Madame Maxime's bottom, prompting her to reposition his hand. Bells stir crows, which rise into darkness past lighted windows, with snow whirling outside the boys’ room. A crow peers in as Harry, asleep, dreams of a cemetery with a cloaked skeleton and snow-covered mansion. Light spills from a door where Wormtail hovers by a kneeling man with a dark mark, and a snake whispers to a hidden figure. A green flash jolts Harry awake as Neville appears and waltzes off. Hermione looks worried as Harry departs, returning Cedric's knowing smile. In the prefect's bathroom, Harry enters the bath, watched by a mermaid in a stained glass window. He opens a golden egg, and a ghostly figure dives into the bubbles. Harry grabs the egg, opens it underwater, and follows it as it glows before resurfacing."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As the night progresses and the festivities continue, the pace in the grand hall begins to heat up significantly. The atmosphere becomes electric with energy as the crowded space becomes a lively scene, with people joyously dancing and moving to the rhythm of the music. In the midst of this chaotic excitement, Tiny Professor Flitwick is seen being buoyantly passed over the heads of the eager dancers, a spectacle that adds an extra layer of merriment to the event. Meanwhile, not everyone is partaking in the dancing fun. Parvati and Padma grow increasingly irritated as Harry and Ron remain resolute in their decision not to dance. The four of them, feeling somewhat dejected, find themselves sitting glumly at the far end of the expansive room. Their spirits are further dampened as they watch Hermione dance exuberantly with Viktor. Ron and Harry can't help but shoot steely glares at Krum, their expressions filled with resentment and perhaps a tinge of jealousy.\n\nThe mood improves slightly when Parvati is asked to dance by someone else, and she accepts the invitation with a sense of relief. She rises eagerly, leaving Padma behind, who looks on with obvious frustration. As Ron observes Krum’s gentlemanly act of kissing Hermione's hand, Viktor departs, leaving Hermione spinning around, her face flushed with excitement and exhilaration. She then beams with genuine happiness as she returns to sit down beside Harry, Ron, and Padma. Ron releases a loud, dramatic sigh, expressing his inner turmoil. Hermione contemplates saying something, but ultimately decides against it. Instead, she turns her back to them, walking away purposefully, which prompts Padma to cast a reproachful glare at Ron before she too stands up and leaves in a huff.\n\nLater, in an attempt to patch things up, Ron approaches Hermione to talk things over. However, the discussion doesn't go as planned, as Hermione is seen wiping away a tear while they boys make their retreat up the staircase. Meanwhile, Hermione, feeling quite miserable, collapses onto the bottom step, removing her party shoes and rubbing her sore feet. In another part of the hall, Neville continues dancing with Ginny. Nearby is Hagrid, who is resting his head contentedly on Madame Maxime's ample chest, though his hand inadvertently slips down to her lower back, only for her to firmly reposition it onto her waist.\n\nOutside, the night air is disturbed by the toll of the bell, prompting crows to take flight into the dark sky. They sweep between the tall towers of the castle, passing by one or two softly illuminated windows, while outside the boys' dormitory, snowflakes dance wildly through the air. On the window ledge, a large black crow lands and peers inside, where Harry lies asleep, caught in the throes of a vivid nightmare. In his unsettling dream, he is transported to a dark, foreboding cemetery, where a winged stone statue looms ominously. A fearsome cloaked skeleton is depicted clutching a long scythe, with a snow-covered mansion standing in the eerie backdrop. Along a dusty, paneled corridor, a stream of light spills from an open door, revealing the unsettling sight of Wormtail inside. He hovers menacingly as a young man kneels beside a well-worn armchair, exposing the sinister dark mark tattooed on his arm, while a large snake whispers to the concealed figure ensconced within the armchair. Suddenly, a blinding green flash erupts, causing Harry to awaken with a start as Neville, with his dancing shoes slung casually around his neck, waltzes away, and Harry can't help but crack a smile.\n\nHermione casts a concerned glance in Harry's direction as he walks away, his weariness evident. Harry acknowledges her concern with a weary nod. Meanwhile, Cedric passes by, giving Harry a knowing smile, before he moves on. Later, within the confines of the secluded prefect's bathroom, Harry slips out of his dressing gown and eases himself into a luxurious bath, the size of a modest swimming pool. He leans back into the soothing bubbles, watched by a mermaid depicted in the stained glass window, who gently holds back her cascading golden hair. Harry's attention then turns to the golden egg resting on the edge of the bath. He opens it, only to be startled into slamming it shut, as a ghostly figure emerges mysteriously from the lavatory, floats toward him, and then dives into the warm bubbles. With determination, Harry retrieves the egg, twisting it open underwater, and as it begins to glow brightly, he takes a deep breath, plunges beneath the surface to pursue it, and soon after, bursts back up, gasping for air."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As the evening progresses and the vibrant festivities carry on into the night, the atmosphere within the grand hall intensifies, reaching a fever pitch of energy and excitement. The ambiance becomes electrifying, charged with the vitality of the crowd, as the spacious room transforms into a lively spectacle. People dance joyously and move in harmony with the infectious rhythm of the pulsating music. Amidst this chaotic flurry of activity and thrill, the small yet spirited Professor Flitwick is joyfully hoisted into the air, passed buoyantly over the heads of the eager dancers, a delightful sight that adds an extra layer of merriment and charm to the festive event. Meanwhile, not everyone finds themselves caught up in the dancing frenzy. Parvati and Padma grow increasingly exasperated as Harry and Ron remain resolute in their steadfast decision not to partake in the dance. Feeling somewhat dejected, the four of them sit glumly together at the far end of the expansive room, their spirits further dampened as they watch Hermione dance exuberantly with Viktor. Ron and Harry can't help but cast steely glares towards Krum, their expressions filled with resentment, possibly tinged with a hint of jealousy.\n\nThe atmosphere shifts slightly for the better when Parvati is asked to dance by someone else, and she accepts the invitation with a palpable sense of relief. She stands up eagerly, leaving Padma behind, who watches on with obvious frustration. As Ron observes Krum perform the gentlemanly act of kissing Hermione's hand, Viktor departs gracefully, leaving Hermione twirling around, her face aglow with excitement and exhilaration. She then returns to sit down beside Harry, Ron, and Padma, beaming with genuine happiness. Ron releases a loud, dramatic sigh, a gesture that conveys his inner turmoil and frustration. Hermione contemplates saying something in response, but ultimately refrains, choosing instead to turn her back on them, walking away purposefully. Her departure prompts Padma to cast a reproachful glare at Ron before she too stands up and leaves in a huff, her exasperation evident.\n\nLater that evening, in an attempt to mend fences, Ron approaches Hermione to discuss their differences. However, the conversation does not unfold as planned, as Hermione is seen wiping away a tear while the boys make their retreat up the staircase. Meanwhile, feeling quite miserable, Hermione collapses onto the bottom step, removing her party shoes with a tired sigh and rubbing her sore feet for relief. In another corner of the grand hall, Neville continues dancing energetically with Ginny. Nearby, Hagrid rests his head contentedly on Madame Maxime's ample chest, though his hand inadvertently slips down to her lower back, only for her to firmly reposition it onto her waist.\n\nOutside, the tranquil night air is disrupted by the solemn toll of the bell, prompting a flock of crows to take flight into the dark night sky. They sweep elegantly between the tall towers of the castle, flitting past one or two softly illuminated windows, while outside the boys' dormitory, snowflakes dance wildly through the freezing air. On the windowsill, a large black crow lands and peers curiously inside, where Harry lies asleep, ensnared in the throes of a vividly unsettling nightmare. In this disconcerting dream, he finds himself transported to a dark, foreboding cemetery, where a menacing winged stone statue looms ominously. A fearsome cloaked skeleton stands clutching a long scythe, with a snow-covered mansion looming eerily in the background. Along a dusty, ornately paneled corridor, a stream of light spills out from an open door, revealing the unsettling sight of Wormtail inside. He hovers menacingly over a young man who kneels beside a well-worn armchair, exposing the sinister dark mark tattooed starkly on his arm, while a large snake whispers to the concealed figure ensconced within the armchair. Abruptly, a blinding green flash erupts, jolting Harry awake with a start as Neville, with his dancing shoes slung casually around his neck, waltzes away, and Harry can't help but crack a smile at the sight.\n\nHermione casts a concerned glance in Harry's direction as he walks away, his weariness unmistakable. Harry acknowledges her show of concern with a weary nod. Meanwhile, Cedric passes by, offering Harry a knowing smile, before he continues on his way. Later, within the serene confines of the secluded prefect's bathroom, Harry slips out of his dressing gown and eases himself into a luxurious bath, the size of a modest swimming pool. He leans back against the soft bubbles, watched with interest by a mermaid depicted in the stained glass window, who gently holds back her cascading golden hair. Harry's attention then shifts to the shiny golden egg resting on the edge of the bath. He opens it, only to be startled into slamming it shut, as a ghostly figure mysteriously emerges from the lavatory, floats toward him, and then dives gracefully into the soothing bubbles. With determination, Harry retrieves the egg, twisting it open underwater, and as it begins to glow brightly, he takes a deep breath, plunges beneath the surface in pursuit of its secrets, soon bursting back up, gasping for much-needed air."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the atmosphere in the hall becomes more lively, the tempo quickens and the energy intensifies, creating an electrifying atmosphere where people are fully engaged. In the midst of this excitement, Tiny Professor Flitwick is enthusiastically lifted and passed over the dancers' heads, adding to the lively scene. Meanwhile, Parvati and Padma, feeling annoyed, notice that Harry and Ron are unwilling to dance, leading them to sit together at the end of the room, exuding a sense of gloominess. Despite the cheer around them, Hermione is energetically dancing to her heart's content with Viktor, while Ron and Harry cannot help but glare at Krum with a mix of emotions. Relief washes over Parvati as she is invited to dance, prompting her to rise and join the fun, while Padma remains seated, looking visibly exasperated. Over the course of the evening, Ron witnesses a tender moment between Krum and Hermione as Viktor delicately kisses her hand before departing, leaving Hermione in a whirl of emotions. She spins around, her cheeks flushed with exhilaration, and settles down beside Harry, Ron, and Padma, her face lit up with happiness. In response, Ron lets out a deep sigh, signaling a mix of emotions simmering inside him. Hermione rises to speak, her intentions clear, but she reconsiders, deciding against it. Instead, she turns away and walks off, leaving Padma to shoot an exasperated glare at Ron before she too rises and strides off in frustration. As the evening continues, Ron makes an attempt to reach out to Hermione, hoping to reason with her, but their conversation does not prevent the emotional tears she wipes away, while Harry and Ron make their escape up the stairs. Meanwhile, Hermione, feeling emotionally drained, collapses dejectedly on the bottom step, slipping off her party shoes and soothing her aching feet. Elsewhere, Neville remains on the dance floor, enjoying the moment with Ginny, while Hagrid, leaning affectionately on Madame Maxime's chest, has his hand repositioned firmly back onto her waist by her when it slips. As the bell disturbs the tranquility, crows are startled into flight, rising into the night sky and weaving between the towering structures, with their dark silhouettes passing by the few illuminated windows. Outside, snowflakes dance through the air, swirling in the cold night as they drift past the boys' bedroom. A large black crow descends onto the windowsill, peering inside with keen interest while Harry, deep in slumber, is plunged into a nightmare. His subconscious mind conjures a vision of a dark cemetery dominated by a winged stone statue, where a cloaked skeleton wields a long scythe, framed against a backdrop of a snow-covered mansion. As his dream unfurls, along a dusty, paneled corridor, light spills out from a door ajar, revealing Wormtail lurking within as a young man kneels by an armchair, exposing the ominous dark mark etched into his skin. Nearby, a large snake hisses softly, communicating with the unseen figure seated in the armchair. Suddenly, a green flash erupts, jolting Harry awake as his eyes snap open. The scene shifts as Neville appears with his dancing shoes slung around his neck, gliding away with a lighthearted waltz, prompting Harry to respond with a smile. Sensing Hermione's concerned gaze, Harry continues on his path, his weariness apparent, while Cedric crosses paths with him, offering a knowing smile before departing. Seeking solace in the prefect's bathroom, Harry removes his dressing gown and gently lowers himself into the expansive bath that resembles a small swimming pool, letting the warmth envelop him as he reclines beneath the frothy surface. He is under the watchful eye of a mermaid depicted in the stained glass window, who serenely holds back her flowing golden hair. Curiosity draws Harry's attention to the golden egg perched on the side of the bath. He cautiously reaches for it, opening it momentarily but quickly slamming it shut as a ghostly figure materializes from the lavatory, gliding toward him before diving into the bubbles. Reacting swiftly, Harry seizes the egg again, twisting it open under the water, and as it begins to emit a bright glow, he takes a deep breath and plunges down after it before finally breaking the surface once more."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The energy in the hall intensifies as Tiny Professor Flitwick is passed overhead by the dancers. Despite Parvati and Padma's frustration, Harry and Ron refuse to dance, leaving the group sitting sullenly while Hermione dances energetically with Viktor as Ron and Harry glower at Krum. Relieved, Parvati accepts a dance invitation, leaving behind an exasperated Padma. Ron observes Krum kiss Hermione's hand before she joyfully rejoins her friends, prompting Ron's deep sigh. Hermione considers speaking but decides against it, turning away, leading Padma to glare at Ron before leaving. Later, Ron attempts to speak with Hermione, who wipes away tears as the boys retreat upstairs. Hermione sits on the steps, removing her shoes and rubbing her feet in distress. Neville continues dancing with Ginny, while Hagrid rests his head on Madame Maxime, only to have his wandering hand gently redirected to her waist. Bells disturb the crows, which take flight among the towers, while snowflakes drift outside the boys' window, where a crow peers inside as Harry dreams. In his nightmare, Harry sees a dark cemetery and a menacing statue with a snow-covered mansion in the background. Inside the mansion, light spills from a doorway where Wormtail stands by a young man with a dark mark on his arm while a snake speaks to a concealed figure. A green flash wakes Harry, just as Neville appears with dance shoes, prompting a smile from Harry. Hermione watches Harry with concern as he departs, exchanging weary nods with Cedric before Cedric leaves. Later, in the prefect's bathroom, Harry relaxes in a large bubble-filled bath, observed by a stained glass mermaid. He opens the golden egg, quickly closing it as a ghostly figure emerges from the lavatory. Startled, Harry reopens the egg underwater, and as it glows, he inhales deeply, plunges after it, and bursts back to the surface."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Later, the pace hots up as the lively music of the orchestra fills the air, and the hall is jumping, with the diminutive and cheerful Tiny Professor Flitwick, known for his charms expertise at Hogwarts School of Witchcraft and Wizardry, being passed over the heads of the dancers. To Parvati and Padma's annoyance, Harry and Ron won't dance, so the four of them sit glumly at the end of the room while Hermione dances wildly with Viktor Krum, the famous Bulgarian Quidditch seeker, and Ron and Harry glare at Krum, their Durmstrang rival. Parvati is asked to dance by a student from Beauxbatons Academy, and she gets up with relief as Padma looks exasperated. Ron spots Krum gallantly kissing Hermione's hand before Viktor leaves her, and she spins around, her face flushed from the exhilaration of the evening, before smiling happily as she sinks down beside Harry, Ron, and Padma. Ron gives a great sigh, and Hermione gets up to speak but thinks better of it, turns her back, and walks off, prompting Padma to glare at Ron before getting up and stalking off to join a group of Ravenclaws near the punch bowl. Later, Ron tries to reason with Hermione, who wipes away a tear as the boys escape up the stairs leading to the Gryffindor common room. Meanwhile, Hermione flops miserably on the bottom step of the grand staircase, takes off her party shoes, and rubs her feet sore from dancing in high heels. Neville, ever persistent with his newfound confidence, is still dancing with Ginny, and Hagrid rests his head on Madame Maxime's chest, but his hand slips to her bottom and she puts it firmly back on her waist, maintaining her dignity. Disturbed by the bell tolling midnight, crows rise into the darkness and swoop between the tall towers of Hogwarts, past one or two lighted windows in the ancient castle, while snowflakes whirl outside the boys' bedroom. A large black crow flutters down onto the windowsill and peers in, while asleep in bed, Harry is having a nightmare. He sees the dark cemetery at Little Hangleton with the winged stone statue and the cloaked skeleton clutches the long scythe, with a snow-covered mansion, the Riddle House, behind it. Along the dusty paneled corridor, light shines from the open door of the old house, inside which Wormtail, the traitorous Peter Pettigrew, hovers as the young man kneels beside the armchair, revealing the dark mark tattooed on his arm, and a large snake, Nagini, whispers to the figure hidden in the armchair, who is none other than Voldemort himself. A green flash, indicative of the killing curse, occurs, and Harry's eyes spring open as Neville appears with his dancing shoes slung around his neck, waltzes off, and Harry smiles. Hermione looks concerned as Harry walks away, and Harry looks weary from the haunting dream and nods, as Cedric Diggory gives Harry a knowing smile about their shared tournament challenges and goes. In the prefect's bathroom, which is a luxurious space reserved for student leaders, Harry slips off his dressing gown and lowers himself into a bath the size of a small swimming pool, leans back under the bubbles, and is watched by a mermaid in a stained glass window who holds back her long golden hair. Harry turns to the golden egg, a clue for the next Triwizard Tournament task, standing on the side of the bath and opens it, but slams it shut again as Moaning Myrtle, a ghost who haunts the bathroom, appears out of the lavatory, floats toward him, and dives into the bubbles. Harry grabs the egg, twists it open under the water, and as the egg glows brightly, revealing its secret message clearly only underwater, Harry takes a deep breath and sinks down after it before bursting to the surface."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Later the pace hots up and the hall is jumping with Tiny Professor Flitwick being passed over the heads of the dancers. To Parvati and Padma's annoyance Harry and Ron will not dance so the four of them sit glumly at the end of the room while Hermione dances wildly with Viktor and Ron and Harry glare at Krum. Parvati is asked to dance and she gets up with relief as Padma looks exasperated. Ron spots Krum kissing Hermione's hand before Viktor leaves her and she spins around her face flushed before smiling happily as she sinks down beside Harry Ron and Padma. Ron gives a great sigh and Hermione gets up to speak but thinks better of it turns her back and walks off prompting Padma to glare at Ron before getting up and stalking off. Later Ron tries to reason with Hermione who wipes away a tear as the boys escape up the stairs. Meanwhile Hermione flops miserably on the bottom step takes off her party shoes and rubs her feet. Neville is still dancing with Ginny and Hagrid rests his head on Madame Maxime's chest but his hand slips to her bottom and she puts it firmly back on her waist. Disturbed by the bell crows rise into the darkness and swoop between the tall towers past one or two lighted windows while snowflakes whirl outside the boys' bedroom. A large black crow flutters down onto the windowsill and peers in while asleep in bed. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Harry is having a nightmare. He sees the dark cemetery with the winged stone statue and the cloaked skeleton clutches the long scythe with a snowcovered mansion behind it. Along the dusty paneled corridor light shines from the open door inside which Wormtail hovers as the young man kneels beside the armchair revealing the dark mark tattooed on his arm and a large snake whispers to the figure hidden in the armchair. A green flash occurs and Harry's eyes spring open as Neville appears with his dancing shoes slung around his neck waltzes off and Harry smiles. Hermione looks concerned as Harry walks away and Harry looks weary and nods as Cedric gives Harry a knowing smile and goes. In the prefect's bathroom. Harry slips off his dressing gown and lowers himself into a bath. the size of a small swimming pool leans back under the bubbles and is watched by a mermaid in a stained glass window who holds back her long golden hair. Harry turns to the golden egg standing on the side of the bath and opens it but slams it shut again as a ghostly figure appears out of the lavatory floats toward him and dives into the bubbles. Harry grabs the egg twists it open under the water and as the egg glows brightly Harry takes a deep breath and sinks down after it before bursting to the surface."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Later the pace hots up and the hall is jumping with Tiny Professor Flitwick being passed over the heads of the dancers. To Parvati and Padma's annoyance Harry and Ron will not dance so the four of them sit glumly at the end of the room while Hermione dances wildly with Viktor and Ron and Harry glare at Krum. Parvati is asked to dance and she gets up with relief as Padma looks exasperated. Ron spots Krum kissing Hermione's hand before Viktor leaves her and she spins around her face flushed before smiling happily as she sinks down beside Harry Ron and Padma. Ron gives a great sigh and Hermione gets up to speak but thinks better of it turns her back and walks off prompting Padma to glare at Ron before getting up and stalking off. Later Ron tries to reason with Hermione who wipes away a tear as the boys escape up the stairs. Meanwhile Hermione flops miserably on the bottom step takes off her party shoes and rubs her feet. Neville is still dancing with Ginny and Hagrid rests his head on Madame Maxime's chest but his hand slips to her bottom and she puts it firmly back on her waist. Disturbed by the bell crows rise into the darkness and swoop between the tall towers past one or two lighted windows while snowflakes whirl outside the boys' bedroom. A large black crow flutters down onto the windowsill and peers in while asleep in bed. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Harry is having a nightmare. He sees the dark cemetery with the winged stone statue and the cloaked skeleton clutches the long scythe with a snowcovered mansion behind it. Along the dusty paneled corridor light shines from the open door inside which Wormtail hovers as the young man kneels beside the armchair revealing the dark mark tattooed on his arm and a large snake whispers to the figure hidden in the armchair. A green flash occurs and Harry's eyes spring open as Neville appears with his dancing shoes slung around his neck waltzes off and Harry smiles. Hermione looks concerned as Harry walks away and Harry looks weary and nods as Cedric gives Harry a knowing smile and goes. In the prefect's bathroom. Harry slips off his dressing gown and lowers himself into a bath. the size of a small swimming pool leans back under the bubbles and is watched by a mermaid in a stained glass window who holds back her long golden hair. Harry turns to the golden egg standing on the side of the bath and opens it but slams it shut again as a ghostly figure appears out of the lavatory floats toward him and dives into the bubbles. Harry grabs the egg twists it open under the water and as the egg glows brightly Harry takes a deep breath and sinks down after it before bursting to the surface."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Later the pace hots up and the hall is jumping with Tiny Professor Flitwick being passed over the heads of the dancers. To Parvati and Padma's annoyance Harry and Ron will not dance so the four of them sit glumly at the end of the room while Hermione dances wildly with Viktor and Ron and Harry glare at Krum. Parvati is asked to dance and she gets up with relief as Padma looks exasperated. Ron spots Krum kissing Hermione's hand before Viktor leaves her and she spins around her face flushed before smiling happily as she sinks down beside Harry Ron and Padma. Ron gives a great sigh and Hermione gets up to speak but thinks better of it turns her back and walks off prompting Padma to glare at Ron before getting up and stalking off. In the prefect's bathroom. Harry slips off his dressing gown and lowers himself into a bath. the size of a small swimming pool leans back under the bubbles and is watched by a mermaid in a stained glass window who holds back her long golden hair. Harry turns to the golden egg standing on the side of the bath and opens it but slams it shut again as a ghostly figure appears out of the lavatory floats toward him and dives into the bubbles. Harry grabs the egg twists it open under the water and as the egg glows brightly Harry takes a deep breath and sinks down after it before bursting to the surface."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Later the pace hots up and the hall is jumping with Tiny Professor Flitwick being passed over the heads of the dancers. To Parvati and Padma's annoyance Harry and Ron will not dance so the four of them sit glumly at the end of the room while Hermione dances wildly with Viktor and Ron and Harry glare at Krum. Harry turns to the golden egg standing on the side of the bath and opens it but slams it shut again as a ghostly figure appears out of the lavatory floats toward him and dives into the bubbles. Harry grabs the egg twists it open under the water and as the egg glows brightly Harry takes a deep breath and sinks down after it before bursting to the surface."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Later, the rhythm accelerates and the zoo is bustling, with Tiny Doctor Salamander being carried over the heads of the trapeze artists. To Simone and Clara's irritation, Jack and Sam won't juggle, so the quartet lounges sadly at the corner of the garden while Matilda twirls energetically with Oscar, and Sam and Jack scowl at Oscar. Simone is invited to juggle, and she stands up with joy as Clara looks frustrated. Sam notices Oscar shaking Matilda's paw before Oscar departs, and she twists around, her cheeks rosy, before grinning cheerfully as she plops down beside Jack, Sam, and Clara. Sam exhales a loud breath, and Matilda rises to speak but reconsiders, turns away, and strolls off, causing Clara to scowl at Sam before rising and marching off. Later, Sam attempts to reason with Matilda, who dabs away a raindrop as the girls flee down the ladder. Meanwhile, Matilda sprawls unhappily on the upper rung, removes her hiking boots, and massages her ankles. Oliver is still juggling with Daphne, and the giant rests his antenna on Grandma Ruby's shoulder, but his fin slips to her knee and she places it gently back on her hip. Startled by the chime, bats ascend into the twilight and glide between the towering cliffs past one or two illuminated doorways, while rain drops swirl beyond the girls' attic. A massive blue bat flaps down onto the banister and gazes in, while asleep on the roof, Jack is experiencing a daydream. He sees the dim barnyard with the feathered iron sculpture and the hooded specter grasps the long broom, with a frost-coated castle behind it. Along the dusty tiled hallway, a glow emanates from the ajar window, within which Ratfoot drifts as the boy crouches beside the loveseat, exposing the pale scar branded on his leg, and a massive lizard murmurs to the figure cloaked in the loveseat. A red flash occurs, and Jack's eyes snap open as Oliver arrives with his juggling balls slung around his neck, jigs away, and Jack laughs. Matilda looks worried as Jack strolls away, and Jack looks tired and nods, as Victor gives Jack a perceptive grin and departs. In the scout's sauna, Jack slips off his jacket and lowers himself into a tub the size of a small pond, reclines beneath the suds, and is observed by a siren in a mosaic wall who holds back her flowing silver mane. Jack turns to the silver orb sitting on the edge of the tub and opens it, but slams it shut again as a spectral entity emerges out of the chimney, drifts toward him, and dives into the suds. Jack seizes the orb, twists it apart under the water, and as the orb shimmers brightly, Jack inhales deeply and plunges down after it before erupting to the surface."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "As the hall livens up, Tiny Professor Flitwick is passed over the dancers' heads. Parvati and Padma are annoyed as Harry and Ron refuse to dance, leaving them seated glumly while Hermione dances with Viktor Krum, drawing envious glares from the boys. Parvati eagerly accepts a dance invitation, while Padma leaves in frustration. Ron reacts to Krum's affection for Hermione, who later avoids confrontation and walks away upset, prompting Padma to leave in annoyance. Hermione is later seen tearful as the boys retreat upstairs. Neville continues dancing with Ginny, and Hagrid clumsily adjusts his hand on Madame Maxime. As night falls, Harry dreams of a dark cemetery and an ominous mansion. In a corridor, Wormtail attends to a sinister figure, and a snake whispers nearby. Harry awakens from the nightmare as Neville returns cheerfully, and Cedric shares a knowing smile. In the prefect's bathroom, Harry bathes and experiments with a golden egg. After an apparition appears, he submerges it in water, causing it to glow, and surfaces with a new understanding."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Harry grabs the egg twists it open under the water and as the egg glows brightly Harry takes a deep breath and sinks down after it before bursting to the surface Harry turns to the golden egg standing on the side of the bath and opens it but slams it shut again as a ghostly figure appears out of the lavatory floats toward him and dives into the bubbles the size of a small swimming pool leans back under the bubbles and is watched by a mermaid in a stained glass window who holds back her long golden hair Harry slips off his dressing gown and lowers himself into a bath In the prefect's bathroom Hermione looks concerned as Harry walks away and Harry looks weary and nods as Cedric gives Harry a knowing smile and goes A green flash occurs and Harry's eyes spring open as Neville appears with his dancing shoes slung around his neck waltzes off and Harry smiles Along the dusty paneled corridor light shines from the open door inside which Wormtail hovers as the young man kneels beside the armchair revealing the dark mark tattooed on his arm and a large snake whispers to the figure hidden in the armchair He sees the dark cemetery with the winged stone statue and the cloaked skeleton clutches the long scythe with a snowcovered mansion behind it Harry is having a nightmare A large black crow flutters down onto the windowsill and peers in while asleep in bed Disturbed by the bell crows rise into the darkness and swoop between the tall towers past one or two lighted windows while snowflakes whirl outside the boys' bedroom Neville is still dancing with Ginny and Hagrid rests his head on Madame Maxime's chest but his hand slips to her bottom and she puts it firmly back on her waist Meanwhile Hermione flops miserably on the bottom step takes off her party shoes and rubs her feet Later Ron tries to reason with Hermione who wipes away a tear as the boys escape up the stairs Ron gives a great sigh and Hermione gets up to speak but thinks better of it turns her back and walks off prompting Padma to glare at Ron before getting up and stalking off Ron spots Krum kissing Hermione's hand before Viktor leaves her and she spins around her face flushed before smiling happily as she sinks down beside Harry Ron and Padma Parvati is asked to dance and she gets up with relief as Padma looks exasperated To Parvati and Padma's annoyance Harry and Ron will not dance so the four of them sit glumly at the end of the room while Hermione dances wildly with Viktor and Ron and Harry glare at Krum Later the pace hots up and the hall is jumping with Tiny Professor Flitwick being passed over the heads of the dancers"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "To Parvati and Padma's annoyance Harry and Ron will not dance so the four of them sit glumly at the end of the room while Hermione dances wildly with Viktor and Ron and Harry glare at Krum Later the pace hots up and the hall is jumping with Tiny Professor Flitwick being passed over the heads of the dancers Ron spots Krum kissing Hermione's hand before Viktor leaves her and she spins around her face flushed before smiling happily as she sinks down beside Harry Ron and Padma Parvati is asked to dance and she gets up with relief as Padma looks exasperated Later Ron tries to reason with Hermione who wipes away a tear as the boys escape up the stairs Ron gives a great sigh and Hermione gets up to speak but thinks better of it turns her back and walks off prompting Padma to glare at Ron before getting up and stalking off Neville is still dancing with Ginny and Hagrid rests his head on Madame Maxime's chest but his hand slips to her bottom and she puts it firmly back on her waist Meanwhile Hermione flops miserably on the bottom step takes off her party shoes and rubs her feet A large black crow flutters down onto the windowsill and peers in while asleep in bed Disturbed by the bell crows rise into the darkness and swoop between the tall towers past one or two lighted windows while snowflakes whirl outside the boys' bedroom He sees the dark cemetery with the winged stone statue and the cloaked skeleton clutches the long scythe with a snowcovered mansion behind it Harry is having a nightmare A green flash occurs and Harry's eyes spring open as Neville appears with his dancing shoes slung around his neck waltzes off and Harry smiles Along the dusty paneled corridor light shines from the open door inside which Wormtail hovers as the young man kneels beside the armchair revealing the dark mark tattooed on his arm and a large snake whispers to the figure hidden in the armchair In the prefect's bathroom Hermione looks concerned as Harry walks away and Harry looks weary and nods as Cedric gives Harry a knowing smile and goes the size of a small swimming pool leans back under the bubbles and is watched by a mermaid in a stained glass window who holds back her long golden hair Harry slips off his dressing gown and lowers himself into a bath Harry grabs the egg twists it open under the water and as the egg glows brightly Harry takes a deep breath and sinks down after it before bursting to the surface Harry turns to the golden egg standing on the side of the bath and opens it but slams it shut again as a ghostly figure appears out of the lavatory floats toward him and dives into the bubbles"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Harry is having a nightmare He sees the dark cemetery with the winged stone statue and the cloaked skeleton clutches the long scythe with a snowcovered mansion behind it Along the dusty paneled corridor light shines from the open door inside which Wormtail hovers as the young man kneels beside the armchair revealing the dark mark tattooed on his arm and a large snake whispers to the figure hidden in the armchair A green flash occurs and Harry's eyes spring open as Neville appears with his dancing shoes slung around his neck waltzes off and Harry smiles Hermione looks concerned as Harry walks away and Harry looks weary and nods as Cedric gives Harry a knowing smile and goes In the prefect's bathroom Harry slips off his dressing gown and lowers himself into a bath the size of a small swimming pool leans back under the bubbles and is watched by a mermaid in a stained glass window who holds back her long golden hair Harry turns to the golden egg standing on the side of the bath and opens it but slams it shut again as a ghostly figure appears out of the lavatory floats toward him and dives into the bubbles Harry grabs the egg twists it open under the water and as the egg glows brightly Harry takes a deep breath and sinks down after it before bursting to the surface Later the pace hots up and the hall is jumping with Tiny Professor Flitwick being passed over the heads of the dancers To Parvati and Padma's annoyance Harry and Ron will not dance so the four of them sit glumly at the end of the room while Hermione dances wildly with Viktor and Ron and Harry glare at Krum Parvati is asked to dance and she gets up with relief as Padma looks exasperated Ron spots Krum kissing Hermione's hand before Viktor leaves her and she spins around her face flushed before smiling happily as she sinks down beside Harry Ron and Padma Ron gives a great sigh and Hermione gets up to speak but thinks better of it turns her back and walks off prompting Padma to glare at Ron before getting up and stalking off Later Ron tries to reason with Hermione who wipes away a tear as the boys escape up the stairs Meanwhile Hermione flops miserably on the bottom step takes off her party shoes and rubs her feet Neville is still dancing with Ginny and Hagrid rests his head on Madame Maxime's chest but his hand slips to her bottom and she puts it firmly back on her waist Disturbed by the bell crows rise into the darkness and swoop between the tall towers past one or two lighted windows while snowflakes whirl outside the boys' bedroom A large black crow flutters down onto the windowsill and peers in while asleep in bed"
        }
      ]
    }
  ]
}