{
  "ground_truth": "A merman prepares to attack, but Cedric appears with a transparent bubble of air over his mouth and nose, using his wand to free Cho, which scares off the merman. Cedric taps his watch as Harry nods and draws his wand to release Hermione, but a sharp, pointed trident is held at his throat. Harry turns as the open mouth of a grinning shark, which has human legs and arms and wears red shorts, looms towards him. The shark flashes past, bites through the rope, and swims off with Hermione. Harry takes a firm grip on Ron's arm, then looks at the girl with long, fair hair floating alone. He looks cautiously at the merpeople hiding in the weeds and uses his wand to release the little girl. As the time approaches eight minutes to 12, Cedric and Cho are the first to the surface and swim ashore. Meanwhile, Dumbledore and Crouch hurriedly descend the stairs of the pavilion. Hermione appears on the surface with the shark, which immediately transforms its head into Viktor Krum. Wrapped in a dressing gown, Fleur watches the water anxiously. As Harry struggles towards the surface with Ron and the little girl, he notices his hands are no longer webbed and is suddenly attacked from below by a horde of vicious little squid-like grindylows with sharp teeth and many legs nipping at his ankles. He tries to kick them away and releases his grip on Ron and the little girl, pushing them up towards the surface. As he clutches his neck, hundreds of the creatures attack him, almost suffocating him with their tentacles. Struggling to fight them off, he pulls out his wand, and sparks fly, stunning the grindylows and sending them flying in all directions. Harry then sinks to the bottom. As the clock strikes twelve, Ron and the little girl bob to the surface, and Fleur leans out over the water, stretching out her hand. With his gills now gone, Harry drifts helplessly, looking up at the patch of light above his head, and with a last desperate effort, raises his wand and rockets out of the water onto the landing stage, gasping for air. Fleur kisses Harry and Ron and wraps a towel around him, while Dumbledore puts his wand to his throat and Karkaroff is furious. Harry is with Crouch as wild-haired Moody glares at Crouch with his mad, rolling eye and flickers his tongue. Crouch stares back into Moody's scarred face, then walks away looking confused. Moody swigs from his hip flask. The scene shifts to the forest at night, where Harry sees a black hat lying on the ground and clutches the scar on his forehead. A man lies on his back among the fallen leaves, heaped-in and lifeless. Harry approaches Professor Dumbledore's room, finds the door closed, and Moody opens it.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A triton readies to assault, but Cedric emerges with a see-through globe of air over his mouth and nose, wielding his wand to liberate Cho, which frightens off the triton. Cedric taps his timepiece as Harry agrees and draws his wand to set free Hermione, but a sharp, pointed spear is held at his throat. Harry rotates as the open mouth of a smiling fish, which has human limbs and wears red trunks, looms towards him. The fish flashes past, bites through the cord, and swims off with Hermione. Harry grasps Ron's arm tightly, then gazes at the girl with long, light hair drifting solo. He glances cautiously at the merfolk hiding in the plants and uses his wand to free the little girl. As the hour approaches eight minutes to 12, Cedric and Cho are the first to the surface and swim to shore. Meanwhile, Dumbledore and Crouch hurriedly descend the steps of the pavilion. Hermione appears on the surface with the fish, which instantly metamorphoses its head into Viktor Krum. Wrapped in a bathrobe, Fleur watches the water anxiously. As Harry struggles skyward with Ron and the little girl, he notices his hands are no longer webbed and is suddenly assailed from below by a swarm of vicious little squid-like grindylows with sharp fangs and many limbs nipping at his ankles. He tries to kick them away and releases his grasp on Ron and the little girl, pushing them up towards the surface. As he clutches his neck, hundreds of the creatures assault him, nearly suffocating him with their tentacles. Struggling to repel them, he pulls out his wand, and sparks fly, stunning the grindylows and sending them flying in all directions. Harry then sinks to the bottom. As the clock strikes twelve, Ron and the little girl bob to the surface, and Fleur leans out over the water, stretching out her hand. With his gills now vanished, Harry drifts helplessly, gazing up at the patch of luminance above his head, and with a last desperate exertion, raises his wand and rockets out of the water onto the landing platform, gasping for air. Fleur kisses Harry and Ron and wraps a cloth around him, while Dumbledore puts his wand to his throat and Karkaroff is livid. Harry is with Crouch as wild-haired Moody glares at Crouch with his frenzied, rolling eye and flickers his tongue. Crouch stares back into Moody's scarred visage, then walks away looking bewildered. Moody swigs from his hip flask. The scene shifts to the woodland at night, where Harry sees a dark hat lying on the ground and clutches the scar on his forehead. A man lies on his back among the fallen leaves, heaped-in and lifeless. Harry approaches Professor Dumbledore's chamber, finds the door closed, and Moody opens it."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A merman is prepared to attack, but Cedric is appeared by a transparent bubble of air over his mouth and nose, with Cho being freed by his wand, which scares off the merman. Cedric's watch is tapped by him as a nod is given by Harry and his wand is drawn to release Hermione, but a sharp, pointed trident holds his throat. Harry turns as a grinning shark with human legs and arms and wearing red shorts looms towards him. The rope is bitten through by the shark, which flashes past and swims off with Hermione. A firm grip is taken by Harry on Ron's arm, then the girl with long, fair hair floating alone is looked at by him. The merpeople hiding in the weeds are cautiously looked at by him, and the little girl is released by his wand. As the time approaches eight minutes to 12, Cedric and Cho reach the surface first and are swum ashore. Meanwhile, the stairs of the pavilion are hurriedly descended by Dumbledore and Crouch. Hermione is appeared on the surface with the shark, which transforms its head into Viktor Krum immediately. Wrapped in a dressing gown, the water is watched anxiously by Fleur. As the surface is struggled towards by Harry with Ron and the little girl, his hands are noticed by him to be no longer webbed and he is attacked from below by a horde of vicious little squid-like grindylows with sharp teeth and many legs nipping at his ankles. They are tried to be kicked away by him, and Ron and the little girl are released by him, being pushed up towards the surface. As his neck is clutched by him, hundreds of the creatures attack him, almost suffocating him with their tentacles. They are struggled to be fought off by him as his wand is pulled out, and sparks are sent flying in all directions, stunning the grindylows. Harry then is sunk to the bottom. As the clock strikes twelve, the surface is bobbed to by Ron and the little girl, and over the water leans Fleur, stretching out her hand. With his gills now gone, Harry is drifted helplessly, while he looks up at the patch of light above his head, and with a last desperate effort, his wand is raised by him, and the water is rocketed out of by him onto the landing stage, gasping for air. Harry and Ron are kissed by Fleur and a towel is wrapped around him by her, while Dumbledore's wand is put to his throat and Karkaroff becomes furious. Crouch is with Harry as wild-haired Moody glares at Crouch with his mad, rolling eye and flickers his tongue. Moody's scarred face is stared back into by Crouch, then he walks away looking confused. His hip flask is swigged from by Moody. The scene shifts to the forest at night, where a black hat is seen lying on the ground by Harry and the scar on his forehead is clutched by him. A man lies on his back among the fallen leaves, heaped-in and lifeless. Professor Dumbledore's room is approached by Harry, the door is found closed, and it is opened by Moody."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A merman prepares to attack, but Cedric arrives with an air bubble over his mouth and nose, using his wand to free Cho, scaring off the merman. Cedric taps his watch as Harry draws his wand to release Hermione, but a trident is held at his throat. A grinning shark with human limbs and red shorts flashes by, cuts the rope, and swims off with Hermione. Harry grips Ron's arm, then looks at a girl with long, fair hair. Cautiously observing the merpeople, he uses his wand to free the girl. As the clock nears eight minutes to noon, Cedric and Cho surface and swim ashore. Dumbledore and Crouch descend the pavilion stairs. Hermione surfaces with the shark, transforming its head into Viktor Krum. Fleur anxiously watches from the shore. As Harry struggles with Ron and the girl, his hands lose their webbing, and grindylows attack, biting his ankles. Kicking them away, he releases Ron and the girl, pushing them upward. Clutching his neck, he stuns the creatures with his wand, sinking to the bottom. As the clock strikes noon, Ron and the girl surface, and Fleur offers her hand. With his gills gone, Harry raises his wand and rockets out of the water, gasping. Fleur wraps him in a towel while Dumbledore uses his wand, and Karkaroff is angry. Harry stands with Crouch as Moody glares at Crouch with his eye. Crouch stares at Moody's scarred face and walks away confused. The scene shifts to the forest at night, where Harry spots a black hat and clutches his scar. A man lies lifeless among leaves. Harry approaches Dumbledore's closed door, and Moody opens it."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A merman attacks, but Cedric appears with an air bubble over his mouth and nose, using his wand to free Cho, scaring the merman away. Cedric taps his watch; Harry nods and draws his wand to release Hermione, but a trident is held to his throat. Harry turns as a grinning shark with human limbs approaches, bites through the rope, and swims off with Hermione. Harry grips Ron's arm and looks at a girl with fair hair floating alone. Cautious of merpeople in the weeds, he uses his wand to release the girl. As it approaches eight minutes to 12, Cedric and Cho resurface. Dumbledore and Crouch descend the pavilion stairs. Hermione surfaces with the shark, which transforms into Viktor Krum. Fleur watches anxiously. As Harry struggles to the surface with Ron and the girl, grindylows attack him. He releases Ron and the girl towards the surface, fights off the grindylows with his wand, then sinks. At noon, Ron and the girl surface, and Fleur reaches out. Harry, without gills, drifts and, with effort, rockets out of the water. Fleur kisses Harry and Ron and wraps a towel around him. Dumbledore puts his wand to his throat; Karkaroff is furious. Harry is with Crouch, while Moody glares at him and drinks from his hip flask. In the night forest, Harry clutches his scar and sees a fallen man. He approaches Dumbledore's closed room, and Moody opens the door."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In the tense underwater scene, a menacing merman is poised and ready to launch an attack. However, Cedric makes a timely appearance, sporting a transparent bubble of breathable air over his mouth and nose area. With his wand firmly in hand, he manages to liberate Cho, which causes the merman to retreat in fear. Cedric quickly taps his watch as Harry responds with a nod and draws his own wand, intending to set Hermione free. Suddenly, a sharp and pointed trident is pressed threateningly against his throat. Harry turns just as a gargantuan shark, equipped with human-like legs and arms and clad in bright red shorts, appears, grinning widely. This shark flashes by swiftly, bites through Hermione's restraints, and swims away with her in tow. \n\nHarry then seizes Ron's arm with determination, turning his gaze to the girl with long, fair hair that floats alone in the water. He casts a wary eye at the merpeople who are partially concealed amidst the seaweed and uses his wand to free the young girl. As time ticks closer to eight minutes before the clock strikes noon, Cedric and Cho are the first to break the water's surface and make their way to the shore. Meanwhile, Dumbledore and Crouch descend the pavilion stairs in a hurried manner. Hermione surfaces alongside the shark, which transforms to reveal Viktor Krum. Dressed in a cozy dressing gown, Fleur watches the events unfold on the water with anxious eyes. As Harry struggles toward the surface with both Ron and the little girl, he realizes his hands are no longer webbed and is suddenly ambushed from below by a swarm of vicious, squid-like grindylows. These creatures, sporting sharp teeth and numerous legs, nip at his ankles ferociously. Harry kicks in an attempt to fend them off, inadvertently releasing Ron and the little girl, pushing them upward toward safety.\n\nAs Harry clutches his neck in desperation, hundreds of the grindylows swarm him, their tentacles nearly suffocating him. Fighting valiantly, he manages to pull out his wand, releasing sparks that stun the creatures and send them tumbling in every direction. Exhausted, Harry sinks to the bottom. As the clock tolls twelve, Ron and the little girl bob to the surface, and Fleur leans over the water as far as she dares, stretching out her hand in assistance. With his gills having vanished, Harry floats helplessly below, staring at the glimmering patch of light above. Mustering all his remaining strength, he raises his wand and propels himself out of the water onto the landing stage, gasping for much-needed air. Fleur rushes over, giving both Harry and Ron a grateful kiss, then wraps a towel around Harry. Meanwhile, Dumbledore amplifies his voice with his wand, and Karkaroff seethes with anger. Harry stands with Crouch nearby as the wild-haired Moody fixates a glare at Crouch with his wild, rolling eye and flicking tongue. Crouch returns the stare into Moody's scarred visage, then walks away, a look of confusion etched on his face. Moody takes a swig from his hip flask. The setting shifts dramatically to the shadowy forest at night, where Harry spots a black hat resting on the ground. He touches the scar on his forehead, feeling a sharp pain. Nearby, a man lies on his back amidst the fallen leaves, lifeless and discarded. Harry proceeds towards Professor Dumbledore's room, only to find the door firmly closed. It is then that Moody opens it for him."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In the highly tense and suspenseful underwater scene, a menacing merman is positioned in readiness, poised and prepared to launch a sudden attack. However, just in the nick of time, Cedric makes a timely and fortuitous appearance, notably sporting a transparent bubble of breathable air cleverly positioned over his mouth and nose area. With his wand gripped firmly in hand, he skillfully manages to liberate Cho, causing the initially aggressive merman to retreat rapidly in fear. Cedric then quickly and efficiently taps his watch while Harry responds with a nod of understanding and draws his own wand with the intention of setting Hermione free. Suddenly, a sharp, pointed trident is pressed threateningly against his throat. Harry turns just in time to see a gargantuan shark, equipped with astonishingly human-like legs and arms and clad humorously in bright red shorts, appear with a wide grin. This shark flashes by swiftly, biting through Hermione's restraints, and swiftly swims away with her in tow.\n\nHarry then decisively seizes Ron's arm with determination, turning his gaze to the girl with long, fair hair that floats gently alone in the water. Cautiously, he casts a wary eye at the merpeople who are partially concealed amidst the dense seaweed and uses his wand to skillfully free the young girl. As time ticks perilously close to eight minutes before the clock strikes noon, Cedric and Cho are the first to break through the water's surface and make their way hurriedly to the shore. Meanwhile, Dumbledore and Crouch descend the pavilion stairs in a hurried manner. Hermione surfaces alongside the shark, which transforms instantly to reveal Viktor Krum. Dressed in a cozy, comforting dressing gown, Fleur watches the unfolding events on the water with anxious eyes filled with worry. As Harry struggles laboriously toward the surface with both Ron and the little girl, he realizes with a start that his hands are no longer webbed and is suddenly ambushed from below by a swarm of vicious, squid-like grindylows. These creatures, sporting sharp teeth and numerous legs, aggressively nip at his ankles with ferocity. Harry kicks frantically in an attempt to fend them off, inadvertently releasing Ron and the little girl, pushing them upward toward much-needed safety.\n\nAs Harry clutches desperately at his neck, feeling overwhelmed, hundreds of the grindylows swarm him, their tentacles nearly suffocating him. Fighting valiantly and with great effort, he manages to pull out his wand, releasing sparks that stun the creatures and send them tumbling in every direction. Exhausted and spent, Harry sinks toward the bottom. As the clock tolls twelve, signaling the hour, Ron and the little girl bob to the surface, and Fleur leans over the water as far as she dares, stretching out her hand in a gesture of assistance. With his gills having vanished, Harry floats helplessly below, staring at the glimmering patch of light above. Mustering all his remaining strength, he raises his wand and propels himself out of the water onto the landing stage, gasping desperately for much-needed air. Fleur rushes over quickly, giving both Harry and Ron a grateful kiss before she wraps a towel warmly around Harry. Meanwhile, Dumbledore amplifies his voice with his wand, and Karkaroff seethes with palpable anger. Harry stands with Crouch nearby, as the wild-haired Moody fixates a fierce glare at Crouch with his wild, rolling eye and flicking tongue. Crouch returns the intense stare into Moody's scarred visage, then walks away with a look of confusion etched on his face. Moody takes a swig from his hip flask. The setting shifts dramatically to the shadowy, dark forest at night, where Harry spots a solitary black hat resting ominously on the ground. He touches the scar on his forehead, feeling a sharp, unmistakable pain. Nearby, a man lies on his back amidst the fallen leaves, lifeless and discarded. Harry proceeds toward Professor Dumbledore's room, only to find the door firmly and unyieldingly closed. It is then that Moody opens it for him."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the merman readies himself to attack, Cedric suddenly appears, breathing easily with the aid of a transparent bubble of air strategically placed over his mouth and nose. With a swift flick of his wand, he successfully frees Cho from her bindings, an act that frightens the merman into retreating. In a timely manner, Cedric taps his watch, prompting Harry to nod in understanding and draw his own wand with the intention of releasing Hermione. However, his action is abruptly halted as a sharp, pointed trident suddenly materializes at his throat. In response, Harry turns his head and is met with the startling sight of a grinning shark bearing down on him. This shark, unusually equipped with human legs and arms, wears a pair of bright red shorts. With a swift and fluid motion, the shark darts forward, using its powerful jaws to sever the rope binding Hermione before swimming away with her in tow. Turning his attention to Ron, Harry grips his arm firmly, then shifts his gaze to a girl with long, fair hair who floats nearby in solitude. Aware of the merpeople concealed within the surrounding weeds, he cautiously uses his wand to liberate the little girl as well. As the clock ticks closer to eight minutes to 12, Cedric and Cho emerge first from beneath the water's surface and promptly make their way ashore. Simultaneously, Dumbledore and Crouch are seen descending the pavilion stairs with urgency. Shortly thereafter, Hermione resurfaces alongside the shark, which instantly transforms its head back into Viktor Krum. Meanwhile, Fleur, wrapped snugly in a dressing gown, watches the water with evident anxiety. As Harry arduously makes his way upward with Ron and the little girl in tow, he becomes acutely aware that the webbing between his fingers has vanished. Suddenly, from below, a swarm of aggressive little grindylows, resembling squid with sharp teeth and numerous legs, attacks him, nipping relentlessly at his ankles. In an effort to fend them off, he attempts to kick them away and releases his hold on Ron and the little girl, thrusting them upward toward safety. With his hands occupied and oxygen running low, he clutches at his neck as the relentless creatures swarm over him, their tentacles threatening to suffocate him. Desperate and fighting for survival, he manages to retrieve his wand, sending forth a burst of sparks that stuns the grindylows, scattering them in all directions. As the threat diminishes, Harry descends to the lake's bottom. At the stroke of twelve, Ron and the little girl surface, and Fleur leans over the water's edge, stretching out her hand in assistance. Deprived of his gills, Harry finds himself drifting helplessly, his gaze fixed on the bright patch of light shimmering above. In a final, exhausted bid for life, he raises his wand, propelling himself out of the water and onto the landing stage, where he gasps for air. Fleur, in a gesture of gratitude and relief, kisses both Harry and Ron and envelops Harry in a warm towel. Observing the scene, Dumbledore amplifies his voice with his wand, while Karkaroff seethes with anger. Standing with Crouch, Harry catches sight of the wild-haired Moody, who scrutinizes Crouch intently, his mad, rolling eye flicking with curiosity. Unnerved, Crouch holds Moody's scarred gaze momentarily before turning away, visibly perplexed. In the background, Moody discreetly takes a swig from his hip flask. The scene transitions to a forest at night, where Harry's attention is drawn to a black hat lying amid the scattered leaves. As he clutches his forehead, marked by the familiar pain of his scar, he notices the lifeless body of a man sprawled on his back among the fallen leaves, a heap of stillness. Compelled to probe further, Harry makes his way to Professor Dumbledore's room, only to find the door closed. In the next moment, Moody opens it, revealing himself to Harry."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Cedric, equipped with a bubble of air around his face, uses his wand to free Cho, scaring off a nearby merman. Shortly after, Harry prepares to free Hermione but is paused by a menacing trident. A shark with human limbs and wearing red shorts swiftly bites through Hermione's rope and departs with her. Harry firmly grips Ron's arm, glancing at a lone girl with fair hair, and cautiously releases her with his wand while keeping an eye on the merpeople. Cedric and Cho surface first, swimming ashore as Dumbledore and Crouch hurry down the pavilion stairs. Simultaneously, Hermione surfaces alongside the now-transformed Viktor Krum. Fleur watches anxiously as Harry, burdened by Ron and the little girl, loses his webbed hands and is attacked by grindylows. He manages to fend them off with his wand, sending them scattering, though he sinks to the bottom. As Ron and the girl reach the surface, Fleur reaches out to them, and Harry, struggling without gills, uses his wand to propel himself to the landing stage, gasping for air. Fleur tends to Harry and Ron, while Dumbledore intervenes as Karkaroff expresses his anger. Meanwhile, Harry stands with Crouch as Moody, eye-rolling and tongue-flicking, glares at him. Crouch meets Moody's gaze, retreats confusedly, while Moody drinks from his flask. Later, in the forest at night, Harry sees a black hat, clutches his forehead scar, and finds a lifeless man among the leaves. He heads to Professor Dumbledore's room, finds it closed, and is greeted by Moody."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A merman prepares to attack in the murky depths of the Black Lake, a location on the Hogwarts grounds renowned for hosting the Second Task of the Triwizard Tournament, but Cedric Diggory appears with a transparent bubble of air over his mouth and nose, an advanced magical technique taught in higher-level charms classes, using his wand to free Cho Chang, which scares off the merman. Cedric taps his watch as Harry nods and draws his wand to release Hermione Granger, but a sharp, pointed trident, a common weapon among the mythical merpeople known to inhabit the lake, is held at his throat. Harry turns as the open mouth of a grinning shark, which has human legs and arms and wears red shorts, looms towards him, a startling transformation showcasing Viktor Krum's skill in Transfiguration. The shark flashes past, bites through the rope, and swims off with Hermione. Harry takes a firm grip on Ron Weasley's arm, then looks at the girl with long, fair hair floating alone, Gabrielle Delacour, Fleur Delacour's younger sister and one of the hostages. He looks cautiously at the merpeople hiding in the weeds, known for their non-interference policy during the task, and uses his wand to release the little girl. As the time approaches eight minutes to 12, a crucial deadline for completing the task, Cedric and Cho are the first to the surface and swim ashore. Meanwhile, Albus Dumbledore and Bartemius Crouch hurriedly descend the stairs of the pavilion atop the lake, anxious to see the task's outcome. Hermione appears on the surface with the shark, which immediately transforms its head into Viktor Krum, revealing his mastery of partial Transfiguration. Wrapped in a dressing gown, Fleur watches the water anxiously as her sister's fate hangs in the balance. As Harry struggles towards the surface with Ron and the little girl, he notices his hands are no longer webbed due to the diminishing effect of the Gillyweed, a magical plant that allows underwater breathing, and is suddenly attacked from below by a horde of vicious little squid-like grindylows, creatures notorious for their aggressive nature in the lake, with sharp teeth and many legs nipping at his ankles. He tries to kick them away and releases his grip on Ron and the little girl, pushing them up towards the surface. As he clutches his neck, hundreds of the creatures attack him, almost suffocating him with their tentacles. Struggling to fight them off, he pulls out his wand, and sparks fly, a standard defensive spell that stuns the grindylows and sends them flying in all directions. Harry then sinks to the bottom. As the clock strikes twelve, Ron and the little girl bob to the surface, and Fleur leans out over the water, stretching out her hand. With his gills now gone, Harry drifts helplessly, looking up at the patch of light above his head, and with a last desperate effort, raises his wand and rockets out of the water onto the landing stage, gasping for air. Fleur kisses Harry and Ron and wraps a towel around him, while Dumbledore puts his wand to his throat, amplifying his voice with the Sonorus charm, and Igor Karkaroff, headmaster of Durmstrang Institute, is furious. Harry is with Crouch as wild-haired Alastor Moody, a former Auror with a reputation for paranoia, glares at Crouch with his mad, rolling eye and flickers his tongue. Crouch stares back into Moody's scarred face, then walks away looking confused, an unsettling development in the ongoing mystery surrounding him. Moody swigs from his hip flask, a habit that raises suspicion. The scene shifts to the Forbidden Forest at night, a place of many secrets and dangers at Hogwarts, where Harry sees a black hat lying on the ground and clutches the scar on his forehead, a remnant of Voldemort's attack on him as a baby. A man lies on his back among the fallen leaves, heaped in and lifeless, a grim discovery hinting at dark events. Harry approaches Professor Dumbledore's room, finds the door closed, and Moody opens it, foreshadowing the revelations to come."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "A merman prepares to attack but Cedric appears with a transparent bubble of air over his mouth and nose using his wand to free Cho which scares off the merman. Cedric taps his watch as Harry nods and draws his wand to release Hermione but a sharp pointed trident is held at his throat. Harry turns as the open mouth of a grinning shark which has human legs and arms and wears red shorts looms towards him. The shark flashes past bites through the rope and swims off with Hermione. Harry takes a firm grip on Ron's arm then looks at the girl with long fair hair floating alone. He looks cautiously at the merpeople hiding in the weeds and uses his wand to release the little girl. As the time approaches eight minutes to 12 Cedric and Cho are the first to the surface and swim ashore. Meanwhile Dumbledore and Crouch hurriedly descend the stairs of the pavilion. Hermione appears on the surface with the shark which immediately transforms its head into Viktor Krum. Wrapped in a dressing gown Fleur watches the water anxiously. As Harry struggles towards the surface with Ron and the little girl he notices his hands are no longer webbed and is suddenly attacked from below by a horde of vicious little squidlike grindylows with sharp teeth and many legs nipping at his ankles. He tries to kick them away and releases his grip on Ron and the little girl pushing them up towards the surface. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. As he clutches his neck hundreds of the creatures attack him almost suffocating him with their tentacles. Struggling to fight them off he pulls out his wand and sparks fly stunning the grindylows and sending them flying in all directions. Harry then sinks to the bottom. As the clock strikes twelve Ron and the little girl bob to the surface and Fleur leans out over the water stretching out her hand. With his gills now gone Harry drifts helplessly looking up at the patch of light above his head and with a last desperate effort raises his wand and rockets out of the water onto the landing stage gasping for air. Fleur kisses Harry and Ron and wraps a towel around him while Dumbledore puts his wand to his throat and Karkaroff is furious. Harry is with Crouch as wildhaired Moody glares at Crouch with his mad rolling eye and flickers his tongue. Crouch stares back into Moody's scarred face then walks away looking confused. Moody swigs from his hip flask. The scene shifts to the forest at night where Harry sees a black hat lying on the ground and clutches the scar on his forehead. A man lies on his back among the fallen leaves. heapedin and lifeless Harry approaches Professor Dumbledore's room finds the door closed and Moody opens it."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "A merman prepares to attack but Cedric appears with a transparent bubble of air over his mouth and nose using his wand to free Cho which scares off the merman. Cedric taps his watch as Harry nods and draws his wand to release Hermione but a sharp pointed trident is held at his throat. Harry turns as the open mouth of a grinning shark which has human legs and arms and wears red shorts looms towards him. The shark flashes past bites through the rope and swims off with Hermione. Harry takes a firm grip on Ron's arm then looks at the girl with long fair hair floating alone. He looks cautiously at the merpeople hiding in the weeds and uses his wand to release the little girl. As the time approaches eight minutes to 12 Cedric and Cho are the first to the surface and swim ashore. Meanwhile Dumbledore and Crouch hurriedly descend the stairs of the pavilion. Hermione appears on the surface with the shark which immediately transforms its head into Viktor Krum. Wrapped in a dressing gown Fleur watches the water anxiously. As Harry struggles towards the surface with Ron and the little girl he notices his hands are no longer webbed and is suddenly attacked from below by a horde of vicious little squidlike grindylows with sharp teeth and many legs nipping at his ankles. He tries to kick them away and releases his grip on Ron and the little girl pushing them up towards the surface. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. As he clutches his neck hundreds of the creatures attack him almost suffocating him with their tentacles. Struggling to fight them off he pulls out his wand and sparks fly stunning the grindylows and sending them flying in all directions. Harry then sinks to the bottom. As the clock strikes twelve Ron and the little girl bob to the surface and Fleur leans out over the water stretching out her hand. With his gills now gone Harry drifts helplessly looking up at the patch of light above his head and with a last desperate effort raises his wand and rockets out of the water onto the landing stage gasping for air. Fleur kisses Harry and Ron and wraps a towel around him while Dumbledore puts his wand to his throat and Karkaroff is furious. Harry is with Crouch as wildhaired Moody glares at Crouch with his mad rolling eye and flickers his tongue. Crouch stares back into Moody's scarred face then walks away looking confused. Moody swigs from his hip flask. The scene shifts to the forest at night where Harry sees a black hat lying on the ground and clutches the scar on his forehead. A man lies on his back among the fallen leaves. heapedin and lifeless Harry approaches Professor Dumbledore's room finds the door closed and Moody opens it."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "A merman prepares to attack but Cedric appears with a transparent bubble of air over his mouth and nose using his wand to free Cho which scares off the merman. Cedric taps his watch as Harry nods and draws his wand to release Hermione but a sharp pointed trident is held at his throat. Harry turns as the open mouth of a grinning shark which has human legs and arms and wears red shorts looms towards him. The shark flashes past bites through the rope and swims off with Hermione. Harry takes a firm grip on Ron's arm then looks at the girl with long fair hair floating alone. He looks cautiously at the merpeople hiding in the weeds and uses his wand to release the little girl. Harry is with Crouch as wildhaired Moody glares at Crouch with his mad rolling eye and flickers his tongue. Crouch stares back into Moody's scarred face then walks away looking confused. Moody swigs from his hip flask. The scene shifts to the forest at night where Harry sees a black hat lying on the ground and clutches the scar on his forehead. A man lies on his back among the fallen leaves. heapedin and lifeless Harry approaches Professor Dumbledore's room finds the door closed and Moody opens it."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "A merman prepares to attack but Cedric appears with a transparent bubble of air over his mouth and nose using his wand to free Cho which scares off the merman. Cedric taps his watch as Harry nods and draws his wand to release Hermione but a sharp pointed trident is held at his throat. Harry turns as the open mouth of a grinning shark which has human legs and arms and wears red shorts looms towards him. A man lies on his back among the fallen leaves. heapedin and lifeless Harry approaches Professor Dumbledore's room finds the door closed and Moody opens it."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "A turtle prepares to dance, but Lionel appears with a golden cone of fire over his shoes and hat, using his violin to capture Lily, which scares off the turtle. Lionel shakes his compass as Andy winks and lifts his violin to release Melanie, but a soft, rounded balloon is placed at his hat. Andy rotates as the closed window of a smiling dolphin, which has bird wings and feathers and wears blue trousers, drifts towards him. The dolphin rushes past, snaps through the thread, and glides away with Melanie. Andy takes a gentle hold on Oscar's elbow, then looks at the boy with short, dark fur floating alone. He glances nervously at the seahorses hiding in the sand and uses his violin to release the baby boy. As the moment approaches seven minutes to thirteen, Lionel and Lily are the first to the sky and fly towards the meadow. Meanwhile, Gandalf and Bilbo urgently climb the mountains of the castle. Melanie emerges on the horizon with the dolphin, which instantly transforms its wings into Victor Grumble. Wrapped in a raincoat, Fiona watches the clouds nervously. As Andy struggles towards the horizon with Oscar and the baby boy, he realizes his feet are no longer webbed and is suddenly attacked from above by a swarm of angry little octopus-like jellyfish with blunt fins and many fingers pulling at his toes. He attempts to shake them off and releases his hold on Oscar and the baby boy, pushing them up towards the horizon. As he grabs his hat, hundreds of the beings surround him, almost smothering him with their fins. Struggling to escape them, he pulls out his violin, and smoke flies, mesmerizing the jellyfish and sending them drifting in all directions. Andy then floats to the top. As the clock chimes thirteen, Oscar and the baby boy leap to the sky, and Fiona leans back over the clouds, extending her elbow. With his fins now gone, Andy drifts aimlessly, gazing up at the circle of shadow above his head, and with a final desperate push, raises his violin and catapults out of the clouds onto the wooden pier, coughing for breath. Fiona hugs Andy and Oscar and wraps a scarf around him, while Gandalf places his violin to his hat and Sauron is cheerful. Andy is with Bilbo as curly-haired Frodo stares at Bilbo with his calm, blinking eye and wags his nose. Bilbo glances back into Frodo's smooth grin, then turns aside appearing thoughtful. Frodo sips from his water bottle. The scene transitions to the desert at dusk, where Andy notices a white glove lying on the sand and touches the scar on his chin. A creature lies on its belly among the scattered rocks, flattened and motionless. Andy strolls towards Teacher Gandalf's tent, finds the flap tied, and Frodo unties it."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Cedric arrives with a bubble of air, freeing Cho and scaring off a merman. He and Harry work to release Hermione and Ron, but a shark-headed Viktor Krum cuts Hermione's ropes and swims off with her. Harry releases Ron and a floating girl, noticing the hostile merpeople. As Cedric and Cho reach the surface, Dumbledore and Crouch rush downstairs. Hermione resurfaces with Krum, who reverts back from his shark form. Harry struggles with grindylows attacking him, releasing Ron and the girl to safety. Despite losing his gills and being overwhelmed by creatures, Harry uses his wand to fend them off and reaches the surface. Fleur helps Harry and Ron, while Dumbledore and a furious Karkaroff watch. Crouch leaves confused after an encounter with Moody, who drinks from a flask. Later, in the forest, Harry clutches his scar near a man's lifeless body. He then approaches Dumbledore's room, where Moody greets him at the door."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "heapedin and lifeless Harry approaches Professor Dumbledore's room finds the door closed and Moody opens it A man lies on his back among the fallen leaves The scene shifts to the forest at night where Harry sees a black hat lying on the ground and clutches the scar on his forehead Moody swigs from his hip flask Crouch stares back into Moody's scarred face then walks away looking confused Harry is with Crouch as wildhaired Moody glares at Crouch with his mad rolling eye and flickers his tongue Fleur kisses Harry and Ron and wraps a towel around him while Dumbledore puts his wand to his throat and Karkaroff is furious With his gills now gone Harry drifts helplessly looking up at the patch of light above his head and with a last desperate effort raises his wand and rockets out of the water onto the landing stage gasping for air As the clock strikes twelve Ron and the little girl bob to the surface and Fleur leans out over the water stretching out her hand Harry then sinks to the bottom Struggling to fight them off he pulls out his wand and sparks fly stunning the grindylows and sending them flying in all directions As he clutches his neck hundreds of the creatures attack him almost suffocating him with their tentacles He tries to kick them away and releases his grip on Ron and the little girl pushing them up towards the surface As Harry struggles towards the surface with Ron and the little girl he notices his hands are no longer webbed and is suddenly attacked from below by a horde of vicious little squidlike grindylows with sharp teeth and many legs nipping at his ankles Wrapped in a dressing gown Fleur watches the water anxiously Hermione appears on the surface with the shark which immediately transforms its head into Viktor Krum Meanwhile Dumbledore and Crouch hurriedly descend the stairs of the pavilion As the time approaches eight minutes to 12 Cedric and Cho are the first to the surface and swim ashore He looks cautiously at the merpeople hiding in the weeds and uses his wand to release the little girl Harry takes a firm grip on Ron's arm then looks at the girl with long fair hair floating alone The shark flashes past bites through the rope and swims off with Hermione Harry turns as the open mouth of a grinning shark which has human legs and arms and wears red shorts looms towards him Cedric taps his watch as Harry nods and draws his wand to release Hermione but a sharp pointed trident is held at his throat A merman prepares to attack but Cedric appears with a transparent bubble of air over his mouth and nose using his wand to free Cho which scares off the merman"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Cedric taps his watch as Harry nods and draws his wand to release Hermione but a sharp pointed trident is held at his throat A merman prepares to attack but Cedric appears with a transparent bubble of air over his mouth and nose using his wand to free Cho which scares off the merman The shark flashes past bites through the rope and swims off with Hermione Harry turns as the open mouth of a grinning shark which has human legs and arms and wears red shorts looms towards him He looks cautiously at the merpeople hiding in the weeds and uses his wand to release the little girl Harry takes a firm grip on Ron's arm then looks at the girl with long fair hair floating alone Meanwhile Dumbledore and Crouch hurriedly descend the stairs of the pavilion As the time approaches eight minutes to 12 Cedric and Cho are the first to the surface and swim ashore Wrapped in a dressing gown Fleur watches the water anxiously Hermione appears on the surface with the shark which immediately transforms its head into Viktor Krum He tries to kick them away and releases his grip on Ron and the little girl pushing them up towards the surface As Harry struggles towards the surface with Ron and the little girl he notices his hands are no longer webbed and is suddenly attacked from below by a horde of vicious little squidlike grindylows with sharp teeth and many legs nipping at his ankles Struggling to fight them off he pulls out his wand and sparks fly stunning the grindylows and sending them flying in all directions As he clutches his neck hundreds of the creatures attack him almost suffocating him with their tentacles As the clock strikes twelve Ron and the little girl bob to the surface and Fleur leans out over the water stretching out her hand Harry then sinks to the bottom Fleur kisses Harry and Ron and wraps a towel around him while Dumbledore puts his wand to his throat and Karkaroff is furious With his gills now gone Harry drifts helplessly looking up at the patch of light above his head and with a last desperate effort raises his wand and rockets out of the water onto the landing stage gasping for air Crouch stares back into Moody's scarred face then walks away looking confused Harry is with Crouch as wildhaired Moody glares at Crouch with his mad rolling eye and flickers his tongue The scene shifts to the forest at night where Harry sees a black hat lying on the ground and clutches the scar on his forehead Moody swigs from his hip flask heapedin and lifeless Harry approaches Professor Dumbledore's room finds the door closed and Moody opens it A man lies on his back among the fallen leaves"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "As he clutches his neck hundreds of the creatures attack him almost suffocating him with their tentacles Struggling to fight them off he pulls out his wand and sparks fly stunning the grindylows and sending them flying in all directions Harry then sinks to the bottom As the clock strikes twelve Ron and the little girl bob to the surface and Fleur leans out over the water stretching out her hand With his gills now gone Harry drifts helplessly looking up at the patch of light above his head and with a last desperate effort raises his wand and rockets out of the water onto the landing stage gasping for air Fleur kisses Harry and Ron and wraps a towel around him while Dumbledore puts his wand to his throat and Karkaroff is furious Harry is with Crouch as wildhaired Moody glares at Crouch with his mad rolling eye and flickers his tongue Crouch stares back into Moody's scarred face then walks away looking confused Moody swigs from his hip flask The scene shifts to the forest at night where Harry sees a black hat lying on the ground and clutches the scar on his forehead A man lies on his back among the fallen leaves heapedin and lifeless Harry approaches Professor Dumbledore's room finds the door closed and Moody opens it A merman prepares to attack but Cedric appears with a transparent bubble of air over his mouth and nose using his wand to free Cho which scares off the merman Cedric taps his watch as Harry nods and draws his wand to release Hermione but a sharp pointed trident is held at his throat Harry turns as the open mouth of a grinning shark which has human legs and arms and wears red shorts looms towards him The shark flashes past bites through the rope and swims off with Hermione Harry takes a firm grip on Ron's arm then looks at the girl with long fair hair floating alone He looks cautiously at the merpeople hiding in the weeds and uses his wand to release the little girl As the time approaches eight minutes to 12 Cedric and Cho are the first to the surface and swim ashore Meanwhile Dumbledore and Crouch hurriedly descend the stairs of the pavilion Hermione appears on the surface with the shark which immediately transforms its head into Viktor Krum Wrapped in a dressing gown Fleur watches the water anxiously As Harry struggles towards the surface with Ron and the little girl he notices his hands are no longer webbed and is suddenly attacked from below by a horde of vicious little squidlike grindylows with sharp teeth and many legs nipping at his ankles He tries to kick them away and releases his grip on Ron and the little girl pushing them up towards the surface"
        }
      ]
    }
  ]
}