{
  "ground_truth": "On his way out, Moody gives Harry a long look. The tadpole-like licorice snaps attract Harry's attention. He takes a handful. They nip his fingers with their sharp, little teeth. He drops them onto the floor and stomps on them. Behind him, the doors of a cabinet swing open. A blue light glows from a large, stone vase in front of a flicking mirror. Harry slowly walks towards it. Reflected in the mirror, he gazes down into the shining blue bowl. The cloudy surface swirls. Harry sees a glow at the bottom of a deep shaft. He finds himself falling down into a crowded courtroom. He lands in a chair, sitting next to someone he recognizes. The man next to him shakes hand with Professor Dumbledore right through Harry. A disheveled man appears in a cage in front of the judge, Mr. Crouch. Rita Skeeter gasps. Moody aims his wand at a young man hurrying from his seat. Barty is dragged to the bench. His tongue flickers like a snake. Mr. Crouch is transfixed, horrified. Harry falls from the bowl to the floor in Professor Dumbledore's room. He puts his wand to his temple and drops a thread of memory into the pensieve. Leaving Dumbledore's room, Harry hears voices from the open door of Snape's storeroom. Harry sees the dark mark on Karkaroff's arm. Karkaroff leaves quickly. He shows Harry a small bottle. Tiny Professor Flitwick conducts the school band. The stands are crowded with flag-waving supporters. An enthusiastic, Mr. Diggory runs in, encouraging the crowd to cheer as an embarrassed Cedric enters the arena. Fleur follows. Her classmates perform a cheerleader routine. Draco and his crony support Viktor Krum, who appears with Karkaroff. A concerned Dumbledore accompanies Harry who looks around nervously. Standing in front of a tall hedge, Dumbledore addresses the crowd. They gather around Dumbledore. Harry stands before a narrow opening in the hedge. Mr. Diggory hugs Cedric tearfully. Harry gives Cedric a friendly nod. Once again, Filch lights the cannon too soon. Moody pats Harry encouragingly on the shoulder as he tentatively enters the maze. Dumbledore watches him go. Harry looks back towards the entrance and sees Moody pointing surreptitiously to the left. He stares uncertainly down the narrow, misty path. Suddenly, the hedges close together behind him, blocking the way out. Harry swallows hard and follows the direction Moody has indicated. Each long path looks exactly the same. The thick, hewn hedges rise 25 feet on either side. Above his head, he can only see a narrow strip of sky. The intricate maze extends far around him stretching away into the distance of the mist-covered valley. Harry moves slowly and cautiously between the hedges. He turns and looks behind him fearfully.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "On his route out, Moody grants Harry a lengthy gaze. The tadpole-like licorice snaps captivate Harry's attention. He grasps a fistful. They bite his digits with their sharp, little fangs. He lets them fall onto the ground and tramples on them. Behind him, the doors of a cupboard swing ajar. A blue radiance emanates from a large, stone urn in front of a flickering mirror. Harry gradually strides towards it. Reflected in the mirror, he peers down into the gleaming blue basin. The cloudy facade whirls. Harry perceives a glow at the base of a deep tunnel. He finds himself plunging down into a bustling tribunal. He descends in a seat, positioned next to somebody he recognizes. The gentleman adjacent to him shakes hand with Professor Dumbledore right through Harry. A unkempt male manifests in a cage in front of the magistrate, Mr. Crouch. Rita Skeeter gasps. Moody directs his wand at a youthful man hurrying from his place. Barty is hauled to the bench. His tongue quivers like a serpent. Mr. Crouch is mesmerized, horrified. Harry falls from the basin to the floor in Professor Dumbledore's chamber. He places his wand to his forehead and drops a filament of recollection into the pensieve. Departing Dumbledore's chamber, Harry hears voices from the open portal of Snape's storeroom. Harry observes the dark emblem on Karkaroff's limb. Karkaroff departs swiftly. He presents Harry a small vial. Tiny Professor Flitwick directs the academy band. The stands are crowded with flag-waving backers. An enthusiastic, Mr. Diggory sprints in, encouraging the crowd to cheer as an abashed Cedric enters the arena. Fleur trails. Her schoolmates execute a cheerleader routine. Draco and his accomplice endorse Viktor Krum, who arrives with Karkaroff. A concerned Dumbledore escorts Harry who glances around apprehensively. Standing in front of a towering shrub, Dumbledore addresses the crowd. They convene around Dumbledore. Harry stands before a narrow gap in the shrub. Mr. Diggory embraces Cedric tearfully. Harry bestows Cedric an amiable nod. Once more, Filch ignites the cannon prematurely. Moody pats Harry encouragingly on the shoulder as he cautiously enters the labyrinth. Dumbledore observes him depart. Harry glances back towards the entry and sees Moody gesturing covertly to the left. He stares uncertainly down the narrow, misty pathway. Abruptly, the hedges close together behind him, obstructing the way out. Harry swallows hard and follows the direction Moody has indicated. Each lengthy path appears precisely the same. The dense, hewn hedges ascend 25 feet on either side. Above his head, he can only see a narrow strip of sky. The intricate labyrinth extends far around him stretching away into the distance of the mist-covered valley. Harry proceeds slowly and cautiously between the hedges. He turns and looks behind him apprehensively."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "On his way out, Harry is given a long look by Moody. Harry's attention is attracted by the tadpole-like licorice snaps. A handful is taken by him. His fingers are nipped by their sharp, little teeth. They are dropped onto the floor by him and he stomps on them. Behind him, a cabinet swings its doors open. A blue light is emitted by a large, stone vase in front of a flicking mirror. Harry slowly walks towards it. He gazes down into the shining blue bowl reflected in the mirror. The cloudy surface swirls. A glow is seen by Harry at the bottom of a deep shaft. He finds himself falling down into a crowded courtroom. A chair is landed in by him, sitting next to someone he recognizes. The man next to him shakes Professor Dumbledore's hand right through Harry. In a cage in front of the judge, Mr. Crouch, a disheveled man appears. Rita Skeeter gasps. Aiming his wand at a young man, Moody hurries from his seat. Barty is dragged to the bench. His tongue flickers like a snake. Mr. Crouch is transfixed, horrified. From the bowl, Harry falls to the floor in Professor Dumbledore's room. He puts his wand to his temple and a thread of memory is dropped into the pensieve by him. Leaving Dumbledore's room, voices are heard by Harry from the open door of Snape's storeroom. The dark mark is seen by Harry on Karkaroff's arm. Karkaroff leaves quickly. A small bottle is shown to Harry by him. The school band is conducted by tiny Professor Flitwick. The stands are crowded with flag-waving supporters. Running in enthusiastically, Mr. Diggory encourages the crowd to cheer as an embarrassed Cedric enters the arena. Fleur follows. A cheerleader routine is performed by her classmates. Viktor Krum is supported by Draco and his crony, who appears with Karkaroff. A concerned Dumbledore accompanies Harry who looks around nervously. In front of a tall hedge, the crowd is addressed by Dumbledore. They gather around Dumbledore. A narrow opening in the hedge is stood before by Harry. Cedric is hugged tearfully by Mr. Diggory. A friendly nod is given to Cedric by Harry. Once again, the cannon is lit too soon by Filch. Harry is patted encouragingly on the shoulder by Moody as he tentatively enters the maze. Dumbledore watches him go. The entrance is looked back towards by Harry and Moody is seen by him pointing surreptitiously to the left. Down the narrow, misty path, he stares uncertainly. Suddenly, the hedges close together behind him, blocking the way out. Hard is swallowed by Harry and the direction indicated by Moody is followed by him. Each long path looks exactly the same. On either side, the thick, hewn hedges rise 25 feet. Above his head, only a narrow strip of sky can be seen by him. The intricate maze extends far around him, stretching away into the distance of the mist-covered valley. Slowly and cautiously, Harry moves between the hedges. Behind him, he turns and looks fearfully."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "On his way out, Moody gives Harry a significant look. Harry is drawn to the tadpole-like licorice snaps and grabs a handful. They bite his fingers, so he drops and stomps on them. A cabinet's doors swing open behind him, revealing a blue light from a stone vase in front of a mirror. Harry approaches it, gazing into the glowing blue bowl. The swirling surface reveals a glow at the bottom of a deep shaft, and he finds himself falling into a crowded courtroom, landing in a chair beside a familiar man. The man shakes hands with Professor Dumbledore through Harry. A disheveled man appears in a cage before the judge, Mr. Crouch. Rita Skeeter gasps as Moody points his wand at a young man. Barty is dragged to the bench, his tongue flickering like a snake, and Mr. Crouch is horrified. Harry falls from the bowl to the floor in Dumbledore's room, where he drops a memory thread into the pensieve. As he leaves, Harry hears voices from Snape's storeroom and notices the dark mark on Karkaroff's arm. Karkaroff leaves quickly, showing Harry a small bottle. Tiny Professor Flitwick leads the school band while stands are packed with flag-waving supporters. An enthusiastic Mr. Diggory encourages the crowd as an embarrassed Cedric enters the arena, followed by Fleur and cheering classmates. Draco and his crony support Viktor Krum, who appears with Karkaroff. Dumbledore escorts a nervous Harry, addressing the crowd by a tall hedge. Harry stands before a narrow hedge opening, Diggory tearfully hugs Cedric, and Harry nods at Cedric. Filch prematurely lights the cannon, and Moody encourages Harry as he enters the maze. Dumbledore watches as Harry notices Moody pointing left. He stares uncertainly down the misty path, and the hedges close behind him, blocking the exit. Harry follows Moody's direction. The paths look identical, with hewn hedges rising 25 feet high on either side. Above, only a narrow strip of sky is visible. The maze extends far around, stretching into the misty valley. Harry cautiously moves between the hedges, looking behind fearfully."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Moody eyes Harry, whose attention is drawn to licorice snaps. They bite his fingers, so he drops and stomps them. A cabinet's doors open, revealing a glowing vase and a flickering mirror. Harry walks toward it, sees a deep shaft glow, and falls into a crowded courtroom beside a familiar man. The man shakes hands with Professor Dumbledore through Harry. A disheveled man appears in a cage before Judge Crouch, while Rita Skeeter gasps. Moody aims at a young man, and Barty is dragged to the bench. Mr. Crouch is horrified. Harry falls back to Dumbledore's room, places memory in the pensieve, and hears voices in Snape’s storeroom, spotting the dark mark on Karkaroff's arm. Tiny Flitwick conducts the band before flag-waving supporters. Mr. Diggory encourages cheering as Cedric enters embarrassed, followed by Fleur. Draco supports Viktor Krum, appearing with Karkaroff. Dumbledore, with a nervous Harry, addresses the crowd. Mr. Diggory hugs Cedric, and Harry nods to him. Filch lights the cannon prematurely. Moody encourages Harry entering the maze. Dumbledore watches as Harry, directed by Moody, follows a narrow path. Hedges close behind, blocking the exit. Harry cautiously proceeds through the identical paths, surrounded by 25-foot hedges, seeing only a strip of sky above in the misty valley."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As Moody is making his way out, he pauses to give Harry an extended, thoughtful look. His gaze lingers as if contemplating something significant. Harry's attention is momentarily captured by the peculiar, tadpole-like licorice snaps. Intrigued, he reaches out and grabs a generous handful. To his surprise, they unexpectedly nip at his fingers with their tiny, sharp teeth. Reacting quickly, he lets them fall to the floor and promptly stomps on them with purpose. Behind him, he hears a noise as the cabinet doors swing open with a creaking sound. A mysterious blue light begins to emanate from a large stone vase positioned in front of an oscillating mirror. With a sense of curiosity and trepidation, Harry starts to slowly walk towards the source of the glowing light. As he catches a glimpse of himself reflected in the mirror, he finds his gaze drawn downwards into the luminous blue bowl. The cloudy surface begins to swirl hypnotically. Within the depths, Harry envisions a glow coming from the bottom of what appears to be a deep shaft. Suddenly, he finds himself descending into the midst of a crowded courtroom. He lands with a gentle thud, seated in a chair next to a familiar figure he recognizes. The man beside him reaches out to shake hands with Professor Dumbledore, his hand passing right through Harry. Before the judge, identified as Mr. Crouch, a disheveled man materializes within a cage. A gasp escapes from Rita Skeeter. Moody, with determination, aims his wand at a young man hurrying away from his seat. Barty is forcibly brought to the bench, his tongue flickering and darting like a snake's. Mr. Crouch stands motionless, seemingly transfixed and horrified. Abruptly, Harry finds himself falling back from the bowl, landing on the floor of Professor Dumbledore's room. He raises his wand to his temple and gently withdraws a thread of memory, carefully placing it into the pensieve. As he exits Dumbledore's room, Harry's ears catch the sound of voices emanating from the open door of Snape's storeroom. He spots the dark mark inked on Karkaroff's arm as Karkaroff quickly makes his exit. He holds up a small bottle to Harry. Meanwhile, the diminutive Professor Flitwick energetically conducts the school band. The stands are filled to capacity with enthusiastic, flag-waving supporters. A spirited Mr. Diggory enters, rallying the crowd to cheer as an embarrassed Cedric makes his entrance into the grand arena. Fleur follows closely, accompanied by her classmates, who engage in a lively cheerleader routine. Draco Malfoy and his loyal crony show their support for Viktor Krum, who, along with Karkaroff, makes a bold appearance. With a concerned expression, Dumbledore accompanies Harry, who casts his gaze around nervously. In front of a towering hedge, Dumbledore steps forward to address the assembled crowd. The crowd gathers around Dumbledore, paying close attention. Positioned before a narrow opening in the hedge, Harry observes as Mr. Diggory embraces Cedric with a tearful hug. Harry nods in friendly acknowledgment towards Cedric. Once again, Filch inadvertently lights the cannon too soon. Moody offers Harry an encouraging pat on the shoulder as he tentatively makes his way into the mysterious maze. Dumbledore stands watchfully, seeing him off. Glancing back towards the entrance, Harry spots Moody covertly signaling to the left. He stares with uncertainty down the narrow, mist-shrouded path. Suddenly, with a surprising swiftness, the hedges close in tightly behind him, sealing off the exit. Harry swallows hard and cautiously follows the direction Moody has indicated. Each long, winding path appears eerily identical. The dense, carefully hewn hedges rise dramatically, towering 25 feet high on either side of him. Above, he can see only a narrow strip of the sky. The complex maze stretches out endlessly in every direction, extending far into the distance of the mist-covered valley. Moving slowly and warily between the towering hedges, Harry turns to glance behind him, a hint of fear evident in his eyes."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As Moody begins to make his way out of the room, he comes to a halt, pausing to give Harry an extended, thoughtful look. His gaze lingers intently, almost as if he is deeply contemplating something of great significance. Harry's attention, though, is momentarily captured and diverted by the peculiar, tadpole-like licorice snaps sitting nearby. Intrigued by their unusual appearance, he reaches out with curiosity and grabs a generous handful. To his surprise, they unexpectedly begin to nip at his fingers with their tiny, sharp teeth, catching him off guard. Reacting quickly, he lets them fall to the ground and promptly stomps on them with purpose and determination. Behind him, he hears a peculiar noise as the cabinet doors swing open with a distinct creaking sound. From a large stone vase positioned in front of an oscillating mirror, a mysterious blue light begins to emanate. With a blend of curiosity and apprehension, Harry starts to slowly walk towards the intriguing source of the glowing light. As he catches a glimpse of himself reflected in the mirror, his gaze is drawn downwards into the luminous blue bowl. The cloudy surface within begins to swirl hypnotically, captivating his attention. Within the depths, Harry envisions a glow originating from the bottom of what appears to be a deep shaft. Suddenly, he finds himself descending into the midst of a crowded courtroom. He lands with a gentle thud, seated in a chair next to a familiar figure he easily recognizes. The man beside him reaches out to shake hands with Professor Dumbledore, his hand passing right through Harry as if he were a mere ghost. Before the judge, identified as Mr. Crouch, a disheveled man materializes within a cage, drawing a gasp from Rita Skeeter. Moody, with unwavering determination, aims his wand at a young man hurrying away from his seat. Barty is forcibly brought to the bench, his tongue flickering and darting like a snake's. Mr. Crouch stands motionless, his expression seemingly transfixed and horrified. Abruptly, Harry finds himself falling back from the bowl, landing on the floor of Professor Dumbledore's room. He raises his wand to his temple and gently withdraws a thread of memory, carefully placing it into the pensieve. As he exits Dumbledore's room, Harry's ears catch the sound of voices emanating from the open door of Snape's storeroom. He spots the dark mark inked on Karkaroff's arm as Karkaroff quickly makes his sudden exit. He holds up a small bottle to Harry. Meanwhile, the diminutive Professor Flitwick is energetically conducting the school band with enthusiasm. The stands are filled to capacity with enthusiastic, flag-waving supporters who cheer loudly. A spirited Mr. Diggory enters, rallying the crowd to cheer as an embarrassed Cedric makes his entrance into the grand arena. Fleur follows closely behind, accompanied by her classmates, who engage in a lively and well-coordinated cheerleader routine. Draco Malfoy and his loyal crony show their support for Viktor Krum, who, along with Karkaroff, makes a bold and confident appearance. With a concerned expression on his face, Dumbledore accompanies Harry, who casts his gaze around nervously. In front of a towering hedge, Dumbledore steps forward to address the assembled crowd. The crowd gathers around Dumbledore, paying close and attentive attention to his words. Positioned before a narrow opening in the hedge, Harry observes as Mr. Diggory embraces Cedric with a tearful hug, filled with emotion. Harry nods in friendly acknowledgment towards Cedric. Once again, Filch inadvertently lights the cannon too soon, causing a brief commotion. Moody offers Harry an encouraging pat on the shoulder as he tentatively makes his way into the mysterious maze. Dumbledore stands watchfully, seeing him off with a careful eye. Glancing back towards the entrance, Harry spots Moody covertly signaling to the left, indicating the path he should take. He stares with uncertainty down the narrow, mist-shrouded path. Suddenly, with surprising swiftness, the hedges close in tightly behind him, sealing off the exit and trapping him within. Harry swallows hard, his resolve firm, and cautiously follows the direction Moody has indicated. Each long, winding path seems eerily identical to the last. The dense, carefully hewn hedges rise dramatically, towering a daunting 25 feet high on either side of him. Above, obscuring his view, he can see only a narrow strip of the sky. The complex maze stretches out endlessly in every direction, extending far into the distance of the mist-covered valley. Moving slowly and warily between the towering hedges, Harry turns to glance behind him, a hint of fear and apprehension evident in his eyes."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As Moody makes his way out of the room, he pauses and gives Harry a long, significant look, which lingers as if conveying an unspoken message. Harry's attention is captured by a curious sight: tadpole-like licorice snaps that glisten enticingly. Compelled by curiosity, Harry reaches out to take a handful of these peculiar candies. The moment they come into contact with his skin, he feels a sharp nip as their tiny, sharp teeth latch onto his fingers. Reacting instinctively to the unexpected bite, he quickly drops them onto the floor. Determined to end the annoyance, he stomps on them with force, feeling them crunch underfoot. Behind him, as if responding to some invisible cue, the doors of a nearby cabinet creak open slowly to reveal a hidden spectacle. A striking blue light emanates from a large stone vase, casting an eerie glow in front of a flicking mirror. Entranced by the mysterious light, Harry begins to walk slowly towards it, his steps cautious and deliberate. As he draws closer, he gazes into the mirror, which reflects his image back at him, but his attention is drawn down into the shining blue bowl contained within its frame. The surface of the bowl, cloudy and swirling, seems alive with movement. Within the depths of this swirling blue, Harry perceives a glow emanating from the bottom of what appears to be a deep shaft. In an instant, he plunges headlong into this vision, finding himself suddenly falling down into a bustling courtroom filled with people. The descent concludes with him landing somewhat abruptly in a chair, situated right next to a person he recognizes immediately. The man beside him reaches out, passing his hand directly through Harry as he shakes hands with Professor Dumbledore, oblivious to Harry's presence. In front of the judge, Mr. Crouch, a disheveled man suddenly materializes within a cage, causing Rita Skeeter to let out an audible gasp. Moody, reacting swiftly to the commotion, points his wand menacingly at a young man who is hastily making his way from his seat. This young man, Barty, is forcibly dragged to the bench where his tongue flickers unnervingly like a snake's. Mr. Crouch, witnessing the scene, stands transfixed, horror etched across his features. At that moment, Harry is jolted back to reality, tumbling from the bowl to the floor of Professor Dumbledore's room. Composing himself, he lifts his wand to his temple and gently pulls a silvery thread of memory, which he deposits into the pensieve before him. As he exits Dumbledore's room, Harry's ears catch the sound of voices emanating from the open door of Snape's storeroom. Peering inside, he sees the distinctive dark mark on Karkaroff's arm. Karkaroff, noticing Harry's presence, briskly departs, but not before showing Harry a small bottle. Shifting scenes, tiny Professor Flitwick energetically conducts the school band, while in the stands, a sea of supporters waves flags in excited anticipation. Mr. Diggory enters spiritedly, urging the crowd to cheer even louder as his son, an embarrassed Cedric, makes his entrance into the arena. Fleur enters next, followed by her classmates who break into an enthusiastic cheerleader routine. Meanwhile, Draco and his crony conspicuously support Viktor Krum, who emerges alongside Karkaroff. A solemn Dumbledore accompanies Harry, whose nervous glances dart around the scene. Dumbledore stands before a towering hedge, addressing the gathered crowd with authoritative calm. The crowd converges around Dumbledore, hanging on his words, while Harry finds himself standing before a narrow opening in the hedge. It's a poignant moment as Mr. Diggory envelops Cedric in a tearful hug. Cedric receives a friendly nod from Harry, a gesture of mutual respect and camaraderie. Yet again, Filch prematurely fires the cannon, the sound echoing sharply. Moody responds with a reassuring pat on Harry's shoulder, offering encouragement as Harry hesitantly steps forward, entering the maze. Dumbledore's watchful eyes follow his progress. Glancing back towards the entrance, Harry catches sight of Moody subtly pointing to the left, indicating a hidden path. Doubt lingers as Harry stares uncertainly down the narrow, misty path before him. Abruptly, the hedges close behind him with an audible rustle, cutting off any retreat. With determination, Harry swallows hard, gathers his resolve, and decides to follow the direction Moody suggested. As he navigates the maze, each path stretches out indistinguishably, the high, thick hedges on either side trimmed to a uniform height of 25 feet. His view of the sky is limited to a thin, distant strip above. The maze sprawls complexly around him, extending forward into a mist-shrouded valley. Harry's movements are measured and intentional as he ventures cautiously between the towering hedges, casting wary glances over his shoulder, ever watchful for unseen threats lurking behind."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As Moody gives Harry a long look on his way out, Harry is drawn to the tadpole-like licorice snaps. Grabbing a handful, he's bitten by their sharp teeth and drops them, stomping them on the floor. Behind him, cabinet doors swing open to reveal a blue light glowing from a large stone vase in front of a flickering mirror. Mesmerized, Harry approaches, gazing at the swirling, cloudy surface of the shimmering blue bowl. As he peers deeper, he finds himself tumbling into a crowded courtroom, landing in a chair next to a familiar person. He watches as the man beside him shakes hands with Professor Dumbledore, passing through Harry. A disheveled man appears caged before the judge, Mr. Crouch, while Rita Skeeter gasps and Moody targets a young man with his wand. Barty is hauled to the bench, his tongue flickering like a snake, leaving Mr. Crouch horrified. Harry then tumbles from the bowl to the floor of Professor Dumbledore's room, depositing a thread of memory into the pensieve with his wand. Exiting Dumbledore’s room, Harry overhears voices from Snape’s storeroom and spots the dark mark on Karkaroff's arm as Karkaroff quickly departs, showing Harry a small bottle. Tiny Professor Flitwick conducts the school band before a crowd of flag-waving supporters, with Mr. Diggory rallying the crowd as Cedric enters the arena, followed by Fleur and her cheering classmates. Draco and his crony support Viktor Krum alongside Karkaroff, while a concerned Dumbledore accompanies a nervous Harry to a tall hedge and addresses the crowd. Mr. Diggory hugs Cedric tearfully, and Harry nods at Cedric before Filch prematurely fires a cannon. Moody encourages Harry with a pat on the shoulder as he enters the maze, watched by Dumbledore. Glancing back, Harry sees Moody discreetly indicating a direction. As he tentatively proceeds, the hedges close behind him, sealing the exit. Determined, Harry swallows hard and follows Moody's suggested path, navigating the identical, mist-covered paths with towering hedges rising on either side, and only a sliver of sky above. Carefully, Harry moves between the hedges, turning back in fear to check his surroundings."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "On his way out, Moody, the grizzled and vigilant ex-Auror known for his magical eye, gives Harry a long look. The tadpole-like licorice snaps, enchanted candies popular in the wizarding world for their bizarre behavior, attract Harry's attention. He takes a handful. They nip his fingers with their sharp, little teeth. He drops them onto the floor and stomps on them. Behind him, the doors of a cabinet swing open. A blue light glows from a large, stone vase, which serves as a pensieve used to review memories, in front of a flickering mirror. Harry slowly walks towards it. Reflected in the mirror, he gazes down into the shining blue bowl. The cloudy surface swirls. Harry sees a glow at the bottom of a deep shaft. He finds himself falling down into a crowded courtroom, the infamous setting of many high-profile trials during the First Wizarding War. He lands in a chair, sitting next to someone he recognizes. The man next to him shakes hands with Professor Dumbledore, the esteemed headmaster of Hogwarts, right through Harry. A disheveled man appears in a cage in front of the judge, Mr. Crouch, a respected but stern Ministry official. Rita Skeeter, the notorious journalist known for her sensationalist articles, gasps. Moody aims his wand at a young man hurrying from his seat. Barty, identified as a Death Eater due to his allegiance to Voldemort, is dragged to the bench. His tongue flickers like a snake. Mr. Crouch is transfixed, horrified. Harry falls from the bowl to the floor in Professor Dumbledore's room. He puts his wand to his temple and drops a thread of memory into the pensieve. Leaving Dumbledore's room, Harry hears voices from the open door of Snape's storeroom, a place filled with rare and dangerous potions ingredients. Harry sees the dark mark on Karkaroff's arm, a brand given to Voldemort's followers. Karkaroff leaves quickly. He shows Harry a small bottle, likely containing a potion or ingredient of interest. Tiny Professor Flitwick, a former dueling champion known for his charm expertise, conducts the school band. The stands are crowded with flag-waving supporters. An enthusiastic Mr. Diggory, Cedric's father who is proud of his son's achievements, runs in, encouraging the crowd to cheer as an embarrassed Cedric enters the arena. Fleur follows. Her classmates perform a cheerleader routine. Draco, a student from the Slytherin house, and his crony support Viktor Krum, the famous Bulgarian Seeker, who appears with Karkaroff. A concerned Dumbledore accompanies Harry, who looks around nervously. Standing in front of a tall hedge, specially grown for the Triwizard Tournament's final task, Dumbledore addresses the crowd. They gather around Dumbledore. Harry stands before a narrow opening in the hedge. Mr. Diggory hugs Cedric tearfully. Harry gives Cedric a friendly nod. Once again, Filch, the cantankerous caretaker known for his dislike of students, lights the cannon too soon. Moody pats Harry encouragingly on the shoulder as he tentatively enters the maze. Dumbledore watches him go. Harry looks back towards the entrance and sees Moody pointing surreptitiously to the left. He stares uncertainly down the narrow, misty path. Suddenly, the hedges close together behind him, blocking the way out. Harry swallows hard and follows the direction Moody has indicated. Each long path looks exactly the same. The thick, hewn hedges rise 25 feet on either side. Above his head, he can only see a narrow strip of sky. The intricate maze extends far around him stretching away into the distance of the mist-covered valley. Harry moves slowly and cautiously between the hedges. He turns and looks behind him fearfully."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "On his way out Moody gives Harry a long look. The tadpolelike licorice snaps attract Harry's attention. He takes a handful. They nip his fingers with their sharp little teeth. He drops them onto the floor and stomps on them. Behind him the doors of a cabinet swing open. A blue light glows from a large stone vase in front of a flicking mirror. Harry slowly walks towards it. Reflected in the mirror he gazes down into the shining blue bowl. The cloudy surface swirls. Harry sees a glow at the bottom of a deep shaft. He finds himself falling down into a crowded courtroom. He lands in a chair sitting next to someone he recognizes. The man next to him shakes hand with Professor Dumbledore right through Harry. A disheveled man appears in a cage in front of the judge Mr Crouch. Rita Skeeter gasps. Moody aims his wand at a young man hurrying from his seat. Barty is dragged to the bench. His tongue flickers like a snake. Mr Crouch is transfixed. horrified. Harry falls from the bowl to the floor in Professor Dumbledore's room. He puts his wand to his temple and drops a thread of memory into the pensieve. Leaving Dumbledore's room Harry hears voices from the open door of Snape's storeroom. Harry sees the dark mark on Karkaroff's arm. Karkaroff leaves quickly. He shows Harry a small bottle Tiny. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. Professor Flitwick conducts the school band. The stands are crowded with flagwaving supporters. An enthusiastic Mr Diggory runs in encouraging the crowd to cheer. as an embarrassed Cedric enters the arena. Fleur follows. Her classmates perform a cheerleader routine. Draco and his crony support Viktor Krum who appears with Karkaroff. A concerned Dumbledore accompanies Harry who looks around nervously. Standing in front of a tall hedge. Dumbledore addresses the crowd. They gather around Dumbledore. Harry stands before a narrow opening in the hedge. Mr Diggory hugs Cedric tearfully. Harry gives Cedric a friendly nod. Once again Filch lights the cannon too soon. Moody pats Harry encouragingly on the shoulder as he tentatively enters the maze. Dumbledore watches him go. Harry looks back towards the entrance and sees Moody pointing surreptitiously to the left. He stares uncertainly down the narrow misty path. Suddenly the hedges close together behind him blocking the way out. Harry swallows hard and follows the direction Moody has indicated. Each long path looks exactly the same. The thick hewn hedges rise 25 feet on either side. Above his head he can only see a narrow strip of sky. The intricate maze extends far around him stretching away into the distance of the mistcovered valley. Harry moves slowly and cautiously between the hedges. He turns and looks behind him fearfully."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "On his way out Moody gives Harry a long look. The tadpolelike licorice snaps attract Harry's attention. He takes a handful. They nip his fingers with their sharp little teeth. He drops them onto the floor and stomps on them. Behind him the doors of a cabinet swing open. A blue light glows from a large stone vase in front of a flicking mirror. Harry slowly walks towards it. Reflected in the mirror he gazes down into the shining blue bowl. The cloudy surface swirls. Harry sees a glow at the bottom of a deep shaft. He finds himself falling down into a crowded courtroom. He lands in a chair sitting next to someone he recognizes. The man next to him shakes hand with Professor Dumbledore right through Harry. A disheveled man appears in a cage in front of the judge Mr Crouch. Rita Skeeter gasps. Moody aims his wand at a young man hurrying from his seat. Barty is dragged to the bench. His tongue flickers like a snake. Mr Crouch is transfixed. horrified. Harry falls from the bowl to the floor in Professor Dumbledore's room. He puts his wand to his temple and drops a thread of memory into the pensieve. Leaving Dumbledore's room Harry hears voices from the open door of Snape's storeroom. Harry sees the dark mark on Karkaroff's arm. Karkaroff leaves quickly. He shows Harry a small bottle Tiny. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Professor Flitwick conducts the school band. The stands are crowded with flagwaving supporters. An enthusiastic Mr Diggory runs in encouraging the crowd to cheer. as an embarrassed Cedric enters the arena. Fleur follows. Her classmates perform a cheerleader routine. Draco and his crony support Viktor Krum who appears with Karkaroff. A concerned Dumbledore accompanies Harry who looks around nervously. Standing in front of a tall hedge. Dumbledore addresses the crowd. They gather around Dumbledore. Harry stands before a narrow opening in the hedge. Mr Diggory hugs Cedric tearfully. Harry gives Cedric a friendly nod. Once again Filch lights the cannon too soon. Moody pats Harry encouragingly on the shoulder as he tentatively enters the maze. Dumbledore watches him go. Harry looks back towards the entrance and sees Moody pointing surreptitiously to the left. He stares uncertainly down the narrow misty path. Suddenly the hedges close together behind him blocking the way out. Harry swallows hard and follows the direction Moody has indicated. Each long path looks exactly the same. The thick hewn hedges rise 25 feet on either side. Above his head he can only see a narrow strip of sky. The intricate maze extends far around him stretching away into the distance of the mistcovered valley. Harry moves slowly and cautiously between the hedges. He turns and looks behind him fearfully."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "On his way out Moody gives Harry a long look. The tadpolelike licorice snaps attract Harry's attention. He takes a handful. They nip his fingers with their sharp little teeth. He drops them onto the floor and stomps on them. Behind him the doors of a cabinet swing open. A blue light glows from a large stone vase in front of a flicking mirror. Harry slowly walks towards it. Reflected in the mirror he gazes down into the shining blue bowl. The cloudy surface swirls. Harry sees a glow at the bottom of a deep shaft. He finds himself falling down into a crowded courtroom. He lands in a chair sitting next to someone he recognizes. The man next to him shakes hand with Professor Dumbledore right through Harry. Once again Filch lights the cannon too soon. Moody pats Harry encouragingly on the shoulder as he tentatively enters the maze. Dumbledore watches him go. Harry looks back towards the entrance and sees Moody pointing surreptitiously to the left. He stares uncertainly down the narrow misty path. Suddenly the hedges close together behind him blocking the way out. Harry swallows hard and follows the direction Moody has indicated. Each long path looks exactly the same. The thick hewn hedges rise 25 feet on either side. Above his head he can only see a narrow strip of sky. The intricate maze extends far around him stretching away into the distance of the mistcovered valley. Harry moves slowly and cautiously between the hedges. He turns and looks behind him fearfully."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "On his way out Moody gives Harry a long look. The tadpolelike licorice snaps attract Harry's attention. He takes a handful. They nip his fingers with their sharp little teeth. He drops them onto the floor and stomps on them. Behind him the doors of a cabinet swing open. The thick hewn hedges rise 25 feet on either side. Above his head he can only see a narrow strip of sky. The intricate maze extends far around him stretching away into the distance of the mistcovered valley. Harry moves slowly and cautiously between the hedges. He turns and looks behind him fearfully."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "On his way out, the elephant gives Jerome a brief glance. The pebble-like cupcakes capture Jerome's curiosity. He grabs a bundle. They nibble his toes with their blunt, tiny claws. He tosses them onto the carpet and leaps on them. Behind him, the flaps of a tent fly apart. A green light radiates from a gigantic, wooden chest in front of a swaying tapestry. Jerome cautiously strides towards it. Reflected in the tapestry, he peers down into the gleaming green container. The murky surface churns. Jerome spots a sparkle at the top of a colossal tower. He discovers himself floating into a noisy ballroom. He settles in a hammock, resting beside someone he recognizes. The woman next to him waves hand with Doctor Marigold right through Jerome. A bedraggled woman emerges in a crate in front of the referee, Mrs. Birch. Lana Barker sighs. The kangaroo points its paw at an old woman fleeing from her corner. Benny is pushed to the platform. His toes wriggle like a lizard. Mrs. Birch is bewitched, stunned. Jerome tumbles from the container to the carpet in Doctor Marigold's hall. He places his compass to his forehead and releases a thread of thought into the birdcage. Exiting Marigold's hall, Jerome catches whispers from the ajar window of Olga's pantry. Jerome notices the bright emblem on Igor's hand. Igor departs hastily. He presents Jerome a large basket. Tiny Officer Bumble orchestrates the town choir. The benches are packed with banner-waving fans. A lively, Mrs. Towler dashes out, inspiring the audience to laugh as a shy Louis steps into the rink. Françoise trails. Her comrades execute a marching band act. Philip and his buddy endorse Walter Plume, who emerges with Igor. A worried Marigold escorts Jerome who scans about anxiously. Standing in front of a broad fence, Marigold speaks to the spectators. They assemble around Marigold. Jerome stands before a wide entrance in the fence. Mrs. Towler embraces Louis joyfully. Jerome offers Louis a respectful salute. Once more, James rings the bell too early. The elephant taps Jerome reassuringly on the elbow as he gingerly steps into the labyrinth. Marigold observes him proceed. Jerome glances back towards the gate and sees the elephant gesturing secretly to the right. He gazes hesitantly down the narrow, foggy trail. Instantly, the fences draw near behind him, sealing the exit. Jerome gulps and pursues the course the elephant has shown. Each winding trail appears utterly identical. The dense, towering fences soar 25 feet on either side. Over his head, he can barely glimpse a slender sliver of sky. The tangled labyrinth stretches far around him reaching out into the expanse of the fog-draped canyon. Jerome advances slowly and warily among the fences. He spins and peers back nervously."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "On his way out, Moody gives Harry a long look. Harry is drawn to the licorice snaps, which bite his fingers, prompting him to drop and stomp on them. A cabinet opens, revealing a glowing stone vase. Harry approaches, gazing into its swirling blue surface, and finds himself in a crowded courtroom. He lands beside someone he recognizes. A disheveled man appears in a cage before Mr. Crouch, and Barty is dragged before the judge. Suddenly, Harry falls back into Dumbledore's room, placing a thread of memory into the pensieve. Leaving, he overhears conversations and sees the dark mark on Karkaroff's arm. At an event, the school band plays as Cedric enters the arena, followed by Fleur and Krum. Mr. Diggory and Harry offer encouragements. Filch prematurely fires the cannon, and Harry hesitantly enters the maze, guided by Moody's surreptitious point. The hedges close behind him, and he ventures into the misty paths, wary but determined."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He turns and looks behind him fearfully Harry moves slowly and cautiously between the hedges The intricate maze extends far around him stretching away into the distance of the mistcovered valley Above his head he can only see a narrow strip of sky The thick hewn hedges rise 25 feet on either side Each long path looks exactly the same Harry swallows hard and follows the direction Moody has indicated Suddenly the hedges close together behind him blocking the way out He stares uncertainly down the narrow misty path Harry looks back towards the entrance and sees Moody pointing surreptitiously to the left Dumbledore watches him go Moody pats Harry encouragingly on the shoulder as he tentatively enters the maze Once again Filch lights the cannon too soon Harry gives Cedric a friendly nod Mr Diggory hugs Cedric tearfully Harry stands before a narrow opening in the hedge They gather around Dumbledore Dumbledore addresses the crowd Standing in front of a tall hedge A concerned Dumbledore accompanies Harry who looks around nervously Draco and his crony support Viktor Krum who appears with Karkaroff Her classmates perform a cheerleader routine Fleur follows as an embarrassed Cedric enters the arena An enthusiastic Mr Diggory runs in encouraging the crowd to cheer The stands are crowded with flagwaving supporters Professor Flitwick conducts the school band He shows Harry a small bottle Tiny Karkaroff leaves quickly Harry sees the dark mark on Karkaroff's arm Leaving Dumbledore's room Harry hears voices from the open door of Snape's storeroom He puts his wand to his temple and drops a thread of memory into the pensieve Harry falls from the bowl to the floor in Professor Dumbledore's room horrified Mr Crouch is transfixed His tongue flickers like a snake Barty is dragged to the bench Moody aims his wand at a young man hurrying from his seat Rita Skeeter gasps A disheveled man appears in a cage in front of the judge Mr Crouch The man next to him shakes hand with Professor Dumbledore right through Harry He lands in a chair sitting next to someone he recognizes He finds himself falling down into a crowded courtroom Harry sees a glow at the bottom of a deep shaft The cloudy surface swirls Reflected in the mirror he gazes down into the shining blue bowl Harry slowly walks towards it A blue light glows from a large stone vase in front of a flicking mirror Behind him the doors of a cabinet swing open He drops them onto the floor and stomps on them They nip his fingers with their sharp little teeth He takes a handful The tadpolelike licorice snaps attract Harry's attention On his way out Moody gives Harry a long look"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The tadpolelike licorice snaps attract Harry's attention On his way out Moody gives Harry a long look They nip his fingers with their sharp little teeth He takes a handful Behind him the doors of a cabinet swing open He drops them onto the floor and stomps on them Harry slowly walks towards it A blue light glows from a large stone vase in front of a flicking mirror The cloudy surface swirls Reflected in the mirror he gazes down into the shining blue bowl He finds himself falling down into a crowded courtroom Harry sees a glow at the bottom of a deep shaft The man next to him shakes hand with Professor Dumbledore right through Harry He lands in a chair sitting next to someone he recognizes Rita Skeeter gasps A disheveled man appears in a cage in front of the judge Mr Crouch Barty is dragged to the bench Moody aims his wand at a young man hurrying from his seat Mr Crouch is transfixed His tongue flickers like a snake Harry falls from the bowl to the floor in Professor Dumbledore's room horrified Leaving Dumbledore's room Harry hears voices from the open door of Snape's storeroom He puts his wand to his temple and drops a thread of memory into the pensieve Karkaroff leaves quickly Harry sees the dark mark on Karkaroff's arm Professor Flitwick conducts the school band He shows Harry a small bottle Tiny An enthusiastic Mr Diggory runs in encouraging the crowd to cheer The stands are crowded with flagwaving supporters Fleur follows as an embarrassed Cedric enters the arena Draco and his crony support Viktor Krum who appears with Karkaroff Her classmates perform a cheerleader routine Standing in front of a tall hedge A concerned Dumbledore accompanies Harry who looks around nervously They gather around Dumbledore Dumbledore addresses the crowd Mr Diggory hugs Cedric tearfully Harry stands before a narrow opening in the hedge Once again Filch lights the cannon too soon Harry gives Cedric a friendly nod Dumbledore watches him go Moody pats Harry encouragingly on the shoulder as he tentatively enters the maze He stares uncertainly down the narrow misty path Harry looks back towards the entrance and sees Moody pointing surreptitiously to the left Harry swallows hard and follows the direction Moody has indicated Suddenly the hedges close together behind him blocking the way out The thick hewn hedges rise 25 feet on either side Each long path looks exactly the same The intricate maze extends far around him stretching away into the distance of the mistcovered valley Above his head he can only see a narrow strip of sky He turns and looks behind him fearfully Harry moves slowly and cautiously between the hedges"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Professor Flitwick conducts the school band The stands are crowded with flagwaving supporters An enthusiastic Mr Diggory runs in encouraging the crowd to cheer as an embarrassed Cedric enters the arena Fleur follows Her classmates perform a cheerleader routine Draco and his crony support Viktor Krum who appears with Karkaroff A concerned Dumbledore accompanies Harry who looks around nervously Standing in front of a tall hedge Dumbledore addresses the crowd They gather around Dumbledore Harry stands before a narrow opening in the hedge Mr Diggory hugs Cedric tearfully Harry gives Cedric a friendly nod Once again Filch lights the cannon too soon Moody pats Harry encouragingly on the shoulder as he tentatively enters the maze Dumbledore watches him go Harry looks back towards the entrance and sees Moody pointing surreptitiously to the left He stares uncertainly down the narrow misty path Suddenly the hedges close together behind him blocking the way out Harry swallows hard and follows the direction Moody has indicated Each long path looks exactly the same The thick hewn hedges rise 25 feet on either side Above his head he can only see a narrow strip of sky The intricate maze extends far around him stretching away into the distance of the mistcovered valley Harry moves slowly and cautiously between the hedges He turns and looks behind him fearfully On his way out Moody gives Harry a long look The tadpolelike licorice snaps attract Harry's attention He takes a handful They nip his fingers with their sharp little teeth He drops them onto the floor and stomps on them Behind him the doors of a cabinet swing open A blue light glows from a large stone vase in front of a flicking mirror Harry slowly walks towards it Reflected in the mirror he gazes down into the shining blue bowl The cloudy surface swirls Harry sees a glow at the bottom of a deep shaft He finds himself falling down into a crowded courtroom He lands in a chair sitting next to someone he recognizes The man next to him shakes hand with Professor Dumbledore right through Harry A disheveled man appears in a cage in front of the judge Mr Crouch Rita Skeeter gasps Moody aims his wand at a young man hurrying from his seat Barty is dragged to the bench His tongue flickers like a snake Mr Crouch is transfixed horrified Harry falls from the bowl to the floor in Professor Dumbledore's room He puts his wand to his temple and drops a thread of memory into the pensieve Leaving Dumbledore's room Harry hears voices from the open door of Snape's storeroom Harry sees the dark mark on Karkaroff's arm Karkaroff leaves quickly He shows Harry a small bottle Tiny"
        }
      ]
    }
  ]
}