{
  "ground_truth": "Red light streams from Harry's wand, and green light from Voldemort's, as the power from their wands collides and meets like molten lava in a burst of bright flame. Sparks fly as they struggle desperately to overcome each other while Harry controls his quivering wand with both hands and Voldemort's face is twisted with hatred. Streaks of light burst all around, illuminating the dark sky, and the ghostly images of Voldemort's victims appear, first Cedric, then Bryce, the old caretaker killed in the mansion. Harry's father and mother appear at his side, and his father speaks. Breaking the connection, Harry grabs Cedric as the cup flies into his hand, and Voldemort howls with frustration. Harry lands with Cedric in the arena, and the spectators go wild. Fleur senses that something is wrong, Dumbledore gets up and tries to pull Harry away, but Harry clings to Cedric's body as Mr. Diggory bursts through the spectators and weeps over Cedric's body. Moody pulls Harry up and helps him away as the students stand, stunned into silence. Still in a state of shock, Harry walks into Professor Moody's room, and Moody slides shut the iron lock on the heavy wooden door. Harry stands in a trance, pale and shaking, clutching his arm as his clothes are torn and his face is bloody. Moody pulls up a stool and sits him down in front of the fire, revealing Harry's deep gash, and grips Harry's arm. Moody's face twists with agony as he opens his hip flask but finds it empty, then runs into the next room and searches feverishly among bottles in a wooden box, but they are all empty. Moody stands in the doorway behind him, searches the shelves, and glares at Harry with his mad eye before grabbing Harry's arm and sucking Harry's blood from his fingers. The door bursts open, and Moody is flung hard against the stone wall as Dumbledore grabs him, and Snape pours truth serum into Moody's mouth. Moody looks towards the locked trunk, Snape points his wand, and the lid flies open. Then six more trunks open, one inside the other, and Dumbledore, Snape, and McGonagall peer into the trunk, down a deep shaft, where a figure with one leg and one eye lies far below. Snape sniffs the flask, and they turn and watch his face and body start to twist with violent convulsions as he wrenches off the leather patch with the mad, rolling eye and flings it down, transforming into a younger man who lashes out angrily. It's Mr. Crouch's son who lunges at Harry as Barty reveals the dark mark. Dumbledore uncovers Harry's wound, and Snape presses his wand hard against Barty's cheek as Barty narrows his eyes and flickers out his tongue. The entire school is assembled in the great hall, and Dumbledore finds Harry packing his case in the boys' bedroom.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Crimson gleam streams from Harry's wand, and verdant glow from Voldemort's, as the might from their wands clashes and meets like molten lava in a burst of bright blaze. Sparks fly as they struggle desperately to conquer each other while Harry controls his quivering wand with both hands and Voldemort's countenance is contorted with hatred. Streaks of radiance burst all around, illuminating the dark sky, and the ghostly images of Voldemort's victims materialize, first Cedric, then Bryce, the old caretaker slain in the mansion. Harry's father and mother appear at his side, and his father speaks. Breaking the connection, Harry seizes Cedric as the cup flies into his hand, and Voldemort howls with frustration. Harry lands with Cedric in the arena, and the spectators go wild. Fleur senses that something is amiss, Dumbledore rises and attempts to pull Harry away, but Harry clings to Cedric's body as Mr. Diggory bursts through the spectators and weeps over Cedric's body. Moody pulls Harry up and assists him away as the students stand, stunned into silence. Still in a state of shock, Harry walks into Professor Moody's room, and Moody slides shut the iron lock on the heavy wooden door. Harry stands in a trance, pale and trembling, clutching his arm as his garments are torn and his face is bloody. Moody pulls up a stool and seats him down in front of the fire, revealing Harry's deep laceration, and grips Harry's arm. Moody's face contorts with agony as he opens his hip flask but finds it vacant, then rushes into the adjacent room and searches feverishly among containers in a wooden box, but they are all empty. Moody stands in the doorway behind him, searches the shelves, and glares at Harry with his mad eye before grasping Harry's arm and sucking Harry's blood from his fingers. The door bursts open, and Moody is flung hard against the stone wall as Dumbledore grabs him, and Snape pours truth serum into Moody's mouth. Moody glances towards the locked trunk, Snape points his wand, and the lid flies open. Then six more trunks open, one within the other, and Dumbledore, Snape, and McGonagall peer into the trunk, down a deep shaft, where a figure with one leg and one eye lies far below. Snape sniffs the flask, and they turn and watch his face and body begin to contort with violent convulsions as he wrenches off the leather patch with the mad, rolling eye and flings it down, transforming into a younger man who lashes out angrily. It's Mr. Crouch's son who lunges at Harry as Barty reveals the dark mark. Dumbledore uncovers Harry's wound, and Snape presses his wand hard against Barty's cheek as Barty narrows his eyes and flickers out his tongue. The entire school is assembled in the great hall, and Dumbledore finds Harry packing his case in the boys' dormitory."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Red light is streamed by Harry's wand, and green light is streamed by Voldemort's, as the power from their wands collides and is met like molten lava in a burst of bright flame. Sparks are flown as they are struggled desperately by them to be overcome while Harry's quivering wand is controlled with both hands by him and Voldemort twists his face with hatred. Streaks of light all around burst, illuminating the dark sky, and the ghostly images of Voldemort's victims are appeared, first Cedric, then Bryce, the old caretaker, who killed in the mansion. Harry's father and mother are appeared at his side, and his father speaks. Breaking the connection, Cedric is grabbed by Harry as the cup is flown into his hand, and Voldemort howls with frustration. Cedric is landed with Harry in the arena, and the spectators go wild. Fleur senses that something is wrong, Dumbledore gets up and tries to pull Harry away, but Cedric's body is clung to by Harry as Mr. Diggory bursts through the spectators and Cedric's body is wept over by him. Harry is pulled up by Moody and Harry is helped away from him as the students, stunned into silence, stand. Still in a state of shock, Professor Moody's room is walked into by Harry, and the iron lock on the heavy wooden door is slid shut by Moody. A trance is stood in by Harry, pale and shaking, clutching his arm as his clothes are torn and his face is bloody. A stool is pulled up by Moody and he sits Harry down in front of the fire, revealing Harry's deep gash, and Harry's arm is gripped by him. Moody's face is twisted with agony as his hip flask is opened by him but he finds it empty, then runs into the next room and searches feverishly among bottles in a wooden box, but he finds all of them are empty. The doorway behind him is stood in by Moody, the shelves are searched by him, and Harry is glared at with his mad eye before Harry's arm is grabbed by him, and Harry's blood is sucked from his fingers. The door bursts open, and Moody is flung hard against the stone wall as Dumbledore grabs him, and truth serum is poured into Moody's mouth by Snape. Moody looks towards the locked trunk, Snape points his wand, and the lid flies open. Then six more trunks open, one inside the other, and into the trunk, down a deep shaft, Dumbledore, Snape, and McGonagall peer, where a figure with one leg and one eye lies far below. The flask is sniffed by Snape, and Snape turns and watches his face and body start to twist with violent convulsions as the leather patch with the mad, rolling eye is wrenched off by him and it is flung down, transforming into a younger man who lashes out angrily. It's Mr. Crouch's son who lunges at Harry as the dark mark is revealed by Barty. Harry's wound is uncovered by Dumbledore, and Snape presses his wand hard against Barty's cheek as Barty narrows his eyes and flickers out his tongue. The great hall is assembled by the entire school, and Harry is found by Dumbledore packing his case in the boys' bedroom."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Red light streams from Harry's wand and green from Voldemort's as their powers collide, creating a fiery burst. Sparks fly as they desperately battle; Harry controls his quivering wand with both hands while Voldemort's face shows hatred. Streaks of light illuminate the sky, revealing ghostly images of Voldemort's victims: Cedric and the old caretaker, Bryce. Harry's father and mother appear, and his father speaks. As the connection breaks, Harry grabs Cedric, the cup flies to his hand, and Voldemort howls with frustration. Harry lands in the arena with Cedric, causing the spectators to go wild. Fleur senses something amiss, Dumbledore tries to pull Harry away, but he clings to Cedric's body as Mr. Diggory weeps. Moody helps Harry up, guiding him away as stunned students watch silently. In shock, Harry enters Professor Moody's room, where the iron lock slides shut. Harry, pale and shaking, clutches his arm as Moody reveals Harry's deep gash, gripping his arm. Moody's face twists in agony; he finds his hip flask empty and searches frantically among bottles, all empty. Moody glares at Harry before grabbing his arm and sucking his blood. The door bursts open as Dumbledore throws Moody against the wall and Snape pours truth serum into his mouth. Moody looks to a locked trunk; Snape opens it, revealing six more inside, leading to a figure with one leg and one eye. Snape sniffs the flask as Moody convulses, transforming into a younger man who angrily lashes out. It's Mr. Crouch's son, who lunges at Harry and reveals the dark mark. Dumbledore examines Harry's wound, and Snape presses his wand against Barty's cheek as Barty flickers his tongue. The school assembles in the great hall, and Dumbledore finds Harry packing in the boys' bedroom."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Red light streams from Harry's wand and green from Voldemort's as their wands' power bursts into flame. Sparks fly as they struggle, Harry gripping his wand with both hands, Voldemort's face twisted in hate. Light streaks illuminate the sky, showing ghostly victims: Cedric, then Bryce. Harry's parents appear, guiding him. The connection breaks, Harry grabs Cedric, the cup flies to him, and Voldemort howls. Harry lands with Cedric in the arena; spectators go wild. Sensing trouble, Fleur reacts, Dumbledore tries pulling Harry away, but Mr. Diggory weeps over Cedric. Moody helps Harry as students stand stunned. In shock, Harry enters Moody's locked room, pale, shaking, with torn clothes. Moody sits him by the fire, revealing Harry's wound, but his flask is empty. Moody searches for potions, finds none, and glares with his mad eye, sucking Harry's blood. The door bursts, flinging Moody against the wall as Dumbledore grabs him, Snape gives truth serum. Moody looks at the trunk, Snape opens it, revealing a deep shaft with a figure below. Snape sniffs the flask, watches Moody convulsing and transforming into Mr. Crouch's son, who lashes out, showing the dark mark. Dumbledore, Snape, and McGonagall reveal Harry's wound, Snape presses his wand on Barty's cheek. The school gathers in the hall, Dumbledore finds Harry packing in the dormitory."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Streams of intense red light emanate from Harry's wand, while vibrant green light pours from Voldemort's, creating a dramatic and powerful visual spectacle. As the forces from their wands collide, they merge like molten lava, bursting into an explosion of bright and dazzling flames. Sparks fly wildly as the two adversaries engage in a fierce struggle, each desperately trying to overpower the other. Harry, his wand trembling under the strain, grips it tightly with both hands to maintain control, while Voldemort's face contorts with intense hatred and malice. Around them, streaks of glowing light erupt in every direction, casting an eerie glow across the dark, night sky. In this surreal scene, ghostly apparitions of Voldemort's victims begin to manifest; first appears Cedric, followed by the spectral figure of Bryce, the elderly caretaker who met his fate in the mansion. Moving closer to Harry, the ghostly figures of his father and mother materialize, offering him companionship, and his father begins to speak. Seizing a crucial moment, Harry breaks the magical connection and swiftly grabs Cedric, simultaneously catching hold of the cup as it soars towards him, while Voldemort lets out a howl of sheer frustration. Back in the arena, Harry lands with Cedric, and the spectators erupt into a frenzy of excitement and confusion. Sensing that something might be dreadfully amiss, Fleur becomes anxious. Dumbledore rises quickly, attempting to pull Harry away, but Harry refuses to let go of Cedric's lifeless body. Mr. Diggory pushes through the crowd with urgency, breaking down in tears over his son. As Moody steps in to assist Harry, guiding him away, the students stand rooted in place, stunned into a deep, silent shock. Harry, still reeling from the ordeal, finds himself entering Professor Moody's dimly lit room. The weighty wooden door closes with a heavy iron lock sliding shut. Harry stands there, caught in a trance-like state, his complexion pale and his body shaking. He's clutching his injured arm, with clothes torn and his face bloodied. Moody draws up a stool, seating Harry in front of the warm fireplace, exposing the deep gash on Harry’s arm, and grips it firmly. As Moody's face twists with visible distress, he reaches for his hip flask only to find it empty. He rushes into the adjacent room, frantically searching through a wooden box filled with bottles, which all turn out to be disappointingly empty. Moody stands helplessly in the doorway, scanning the shelves with his wild, mad eye before suddenly grabbing Harry's arm, tasting the blood from his fingers. Just then, the door bursts open with force, and Moody is violently thrown against the cold, stone wall. Dumbledore seizes him, and Snape steps forward, administering truth serum into Moody’s mouth. Moody’s gaze shifts toward the locked trunk, prompting Snape to flick his wand, causing the lid to fly open. Inside, astonishingly, six more trunks reveal themselves, each nested within the other. Dumbledore, Snape, and McGonagall lean over to peer into the deepest shaft of the trunk, where a figure with one leg and a single eye lies far below. As Snape sniffs the contents of the flask, everyone watches intently as Moody’s face and body start to violently convulse and twist. He tears off the leather patch with the rolling, mad eye and throws it aside, transforming into a much younger man who lashes out with anger. It is revealed to be Mr. Crouch's son, who lunges aggressively at Harry as Barty unveils the infamous dark mark. Dumbledore carefully examines Harry’s wound, while Snape presses his wand firmly against Barty's cheek. Barty narrows his eyes, revealing a flickering tongue. The entire student body gathers in the grand and majestic great hall, and later, Dumbledore discovers Harry somberly packing his suitcase in the boys' dormitory."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Streams of intense, vivid red light emanate dramatically from Harry's wand, while vibrant, luminescent green light pours powerfully from Voldemort's, creating an epic and powerful visual spectacle that is both mesmerizing and ominous. As the potent forces erupting from their wands collide with great force, they merge like molten lava, culminating in an explosion of light that bursts into a display of bright and dazzling flames. Sparks fly wildly through the air, adding chaos to the scene, as the two adversaries engage in a fierce and desperate struggle, each one trying with all their might to overpower the other. Harry, his wand trembling violently under the strain of the magical duel, grips it tightly with both hands to maintain control and stability, while Voldemort's face contorts with intense, seething hatred and malice. Around them, streaks of glowing light erupt fiercely in every direction, casting an eerie, otherworldly glow across the dark, foreboding night sky. Amidst this surreal, dreamlike scene, ghostly apparitions of Voldemort's victims begin to manifest; first emerges Cedric, followed by the spectral, wispy figure of Bryce, the elderly caretaker who met his untimely fate in the mansion. Moving ever closer to Harry, the ghostly figures of his father and mother materialize, offering him companionship and comfort, as his father begins to speak words of encouragement. Seizing a crucial, fleeting moment of opportunity, Harry breaks the magical connection between their wands and swiftly grabs Cedric, simultaneously catching hold of the cup as it soars towards him, while Voldemort lets out a howl of sheer, gut-wrenching frustration. Back in the bustling arena, Harry lands with Cedric beside him, and the spectators erupt into a whirlwind of excitement and confusion. Sensing that something might be dreadfully amiss, Fleur becomes understandably anxious and worried. Dumbledore rises quickly, attempting to pull Harry away from the scene, but Harry refuses to let go of Cedric's lifeless body. Mr. Diggory pushes through the crowd urgently, breaking down in tears over his beloved son. As Moody steps in to assist Harry, guiding him away from the chaos, the students stand rooted in place, stunned into a deep, silent shock that reverberates through the crowd. Harry, still reeling from the overwhelming ordeal, finds himself entering Professor Moody's dimly lit room. The weighty wooden door closes behind him with a heavy iron lock sliding shut with a decisive clank. Harry stands there, caught in a trance-like state, his complexion pale as a ghost and his body shaking visibly. He's clutching his injured arm, his clothes torn and his face bloodied from the brutal encounter. Moody draws up a sturdy stool, seating Harry in front of the warm, flickering fireplace, exposing the deep gash on Harry’s arm, and grips it firmly with concern. As Moody's face twists with visible distress, he reaches instinctively for his trusty hip flask only to find it disappointingly empty. He rushes into the adjacent room with urgency, frantically searching through a wooden box filled with bottles, which all turn out to be disappointingly empty as well. Moody stands helplessly in the doorway, scanning the shelves with his wild, mad eye, before suddenly deciding to grab Harry's arm, tasting the blood from his fingertips in a bizarre, unsettling moment. Just then, the door bursts open with force, and Moody is violently thrown against the cold, unforgiving stone wall. Dumbledore seizes him with authority, and Snape steps forward with determination, administering truth serum directly into Moody’s mouth. Moody’s gaze shifts significantly toward the locked, mysterious trunk, prompting Snape to flick his wand, causing the lid to fly open dramatically. Inside, astonishingly, six more trunks reveal themselves, each nested intricately within the other. Dumbledore, Snape, and McGonagall lean over to peer deeply into the farthest, deepest shaft of the trunk, where a figure with one leg and a single eye lies far below. As Snape sniffs the contents of the flask intently, everyone watches with bated breath as Moody’s face and body start to violently convulse and twist. He tears off the leather patch with the rolling, mad eye and throws it aside, transforming before their eyes into a much younger man who lashes out with unbridled anger. It is revealed to be Mr. Crouch's son, who lunges aggressively at Harry as Barty unveils the infamous dark mark on his arm. Dumbledore carefully examines Harry’s wound, while Snape presses his wand with firm conviction against Barty's cheek. Barty narrows his eyes defiantly, revealing a flickering, serpentine tongue. The entire student body later gathers in the grand and majestic great hall, and in a quieter moment, Dumbledore discovers Harry somberly packing his suitcase in the boys' dormitory, lost in his thoughts."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Red light streams from Harry's wand, emanating in a concentrated beam, while green light erupts from Voldemort's wand, and both beams of magic surge forward with relentless intensity until they collide mid-air in a spectacular display, meeting like molten lava in a dazzling burst of bright flame. As this fiery explosion settles, sparks fly in every direction, reflecting the fierce struggle as Harry and Voldemort fight desperately to overcome each other. Harry grips his quivering wand with both hands, channeling all his strength into maintaining control, while Voldemort's face contorts into a grimace of pure hatred. Streaks of light explode around them, punctuating the dark sky above, as the ghostly images of Voldemort's victims begin to materialize in the air; first, Cedric appears, followed by Bryce, the elderly caretaker who met his end in the mansion. As the apparitions continue to form, Harry's father and mother appear intimately at his side, his father speaking softly to him, offering strength. In a decisive move, Harry breaks the magical connection, reaching swiftly for Cedric as the cup, imbued with its portkey magic, hurtles into his grasp, while Voldemort howls in frustration at losing his prey. Harry and Cedric crash-land into the arena, where the spectators erupt into wild cheers, the noise filling the stadium. Yet amidst the jubilation, Fleur senses that something is amiss, and Dumbledore rises quickly, attempting to pull Harry away from the scene, but Harry is unwilling to let go, clinging tightly to Cedric's lifeless body. As Mr. Diggory forces his way through the mass of spectators, he collapses in grief, weeping over his son's body. Meanwhile, Moody maneuvers through the chaos, lifting Harry to his feet and guiding him away as the students stand by, struck silent by the unfolding tragedy. In a state of shock, Harry finds himself inside Professor Moody's dimly lit room, where Moody slides the iron lock shut on the formidable wooden door, securing them inside. Harry stands in a daze, his face pale and shaking, clutching his arm, his clothes torn and his face marked with blood. Moody, with a stern but concerned demeanor, drags a stool over and sits Harry down in front of the crackling fire, exposing the deep gash on Harry's arm and gripping it with concern. Moody's expression shifts to one of frustration and pain as he unscrews his hip flask, only to discover it empty. In a rush, he bolts into the adjoining room, rummaging frantically through a wooden box of bottles, only to find them all disappointingly empty as well. Moody stands in the doorway, scouring the shelves with his intense, mad eye, before glaring at Harry. Abruptly, he seizes Harry's arm and begins to suck the blood from Harry's fingers in a bizarre act of desperation. Suddenly, the door bursts open with force, and Moody is propelled violently against the cold, stone wall as Dumbledore storms in, rapidly taking control. Snape follows, pouring a truth serum into Moody's mouth to extract the truth. Moody's gaze shifts towards the locked trunk, prompting Snape to point his wand decisively, causing the lid to spring open. As if by magic, six more trunks unlock in succession, each one revealing another inside, until Dumbledore, Snape, and McGonagall peer cautiously into the bottommost trunk, which plunges down to a deep shaft, at the base of which lies a figure with one leg and one eye, the real Moody. Snape inspects the flask's contents suspiciously, and they observe intently as the man's face and body begin to contort through violent convulsions, wrenching off the leather patch to reveal the erratic, mad eye beneath. He flings it away, morphing swiftly into a younger man who exhibits volatile rage. It is revealed to be Mr. Crouch's son, who lunges aggressively at Harry as Barty exposes the dark mark. Dumbledore approaches to inspect Harry's wound with care, while Snape applies his wand with firm pressure against Barty's cheek, watching as Barty narrows his eyes and flicks his tongue defiantly. The entire student body is gathered within the great hall, their silence heavy with anticipation, while Dumbledore finds Harry amidst the boys' bedroom, packing his suitcase in preparation for what lies ahead."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Red and green lights stream from Harry's and Voldemort's wands, respectively, colliding in a burst of flame as they struggle fiercely against each other. As streaks of light illuminate the dark sky, the ghostly images of Voldemort’s victims, including Cedric and Bryce, appear. Harry's parents manifest beside him, his father speaking before Harry breaks the connection, grabs Cedric, and retrieves the cup, while Voldemort howls in frustration. Landing in the arena with Cedric, the spectators go wild. Sensing something amiss, Fleur watches as Dumbledore attempts to pull Harry away, but Harry clings to Cedric’s body as Mr. Diggory rushes in, weeping for his son. Moody assists Harry by leading him away from the stunned students into his room, locking the heavy door. In a trance and showing signs of injury, Harry sits near the fire as Moody inspects his wounds and frantically searches for an empty hip flask. While Moody searches the next room, he is revealed to be Mr. Crouch’s son after Dumbledore and Snape intervene, feeding him truth serum as he makes a desperate escape attempt. The locked trunk is opened, revealing the real Moody inside. As Barty’s disguise fails, Snape restrains him, and Dumbledore attends to Harry's wounds. In the aftermath, the entire school gathers in the great hall, and Dumbledore finds Harry packing in the boys' dormitory."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Red light streams from Harry's wand, and green light from Voldemort's, as the power from their wands collides and meets like molten lava in a burst of bright flame during their intense duel in the graveyard. Sparks fly as they struggle desperately to overcome each other while Harry controls his quivering wand with both hands and Voldemort's face is twisted with hatred. This clash, known as Priori Incantatem, occurs only when two wands with cores from the same magical creature face off. Streaks of light burst all around, illuminating the dark sky, and the ghostly images of Voldemort's victims appear, first Cedric, who was recently killed on Voldemort's orders, then Bryce, the old caretaker killed in the Riddle mansion where Voldemort had been hiding. Harry's father and mother appear at his side, and his father speaks, offering words of courage and love. Breaking the connection, Harry grabs Cedric as the Triwizard Cup, bewitched to be a Portkey, flies into his hand, and Voldemort howls with frustration. Harry lands with Cedric in the arena, the Hogwarts Quidditch pitch, and the spectators go wild. Fleur, the Beauxbatons champion, senses that something is wrong, Dumbledore, the wise and respected headmaster of Hogwarts, gets up and tries to pull Harry away, but Harry clings to Cedric's body as Mr. Diggory, Cedric's father, bursts through the spectators and weeps over Cedric's body. Moody, the Defense Against the Dark Arts teacher known for his magical eye and quirky behavior, pulls Harry up and helps him away as the students stand, stunned into silence. Still in a state of shock, Harry walks into Professor Moody's office, and Moody slides shut the iron lock on the heavily enchanted wooden door. Harry stands in a trance, pale and shaking, clutching his arm as his clothes are torn and his face is bloody. Moody pulls up a stool and sits him down in front of the fire, revealing Harry's deep gash, and grips Harry's arm. Moody's face twists with agony as he opens his hip flask but finds it empty of the potion that maintains his disguise, then runs into the next room and searches feverishly among bottles in a wooden box, but they are all empty. Moody stands in the doorway behind him, searches the shelves, and glares at Harry with his mad eye before grabbing Harry's arm and sucking Harry's blood from his fingers in desperation for his disguise not to be discovered. The door bursts open, and Moody is flung hard against the stone wall as Dumbledore grabs him, and Snape, the Potions Master at Hogwarts, pours truth serum into Moody's mouth. Moody looks towards the locked trunk, which was used to imprison the real Mad-Eye Moody for months, Snape points his wand, and the lid flies open. Then six more trunks open, one inside the other, and Dumbledore, Snape, and McGonagall, the Transfiguration professor, peer into the trunk, down a deep shaft, where a figure with one leg and one eye lies far below. Snape sniffs the polyjuice potion flask, confirming its use, and they turn and watch his face and body start to twist with violent convulsions as he wrenches off the leather patch with the mad, rolling eye and flings it down, transforming into Barty Crouch Jr., a notorious Death Eater who had escaped Azkaban and was presumed dead, who lashes out angrily. It's Mr. Crouch's son who lunges at Harry as Barty reveals the dark mark, the symbol of allegiance to Voldemort. Dumbledore uncovers Harry's wound, and Snape presses his wand hard against Barty's cheek as Barty narrows his eyes and flickers out his tongue, revealing his unwavering loyalty to Voldemort. The entire school is assembled in the great hall, where important announcements and gatherings are held, and Dumbledore finds Harry packing his case in the boys' bedroom, preparing to return home after another perilous year."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Red light streams from Harry's wand and green light from Voldemort's as the power from their wands collides and meets like molten lava in a burst of bright flame. Sparks fly as they struggle desperately to overcome each other while Harry controls his quivering wand with both hands and Voldemort's face is twisted with hatred. Streaks of light burst all around illuminating the dark sky and the ghostly images of Voldemort's victims appear first Cedric then Bryce the old caretaker killed in the mansion. Harry's father and mother appear at his side and his father speaks. Breaking the connection Harry grabs Cedric as the cup flies into his hand and Voldemort howls with frustration. Harry lands with Cedric in the arena and the spectators go wild. Fleur senses that something is wrong. Dumbledore gets up and tries to pull Harry away but Harry clings to Cedric's body as Mr Diggory bursts through the spectators and weeps over Cedric's body. Moody pulls Harry up and helps him away as the students stand stunned into silence. Still in a state of shock Harry walks into Professor Moody's room and Moody slides shut the iron lock on the heavy wooden door. Harry stands in a trance pale and shaking clutching his arm as his clothes are torn and his face is bloody. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Moody pulls up a stool and sits him down in front of the fire revealing Harry's deep gash and grips Harry's arm. Moody's face twists with agony as he opens his hip flask but finds it empty then runs into the next room and searches feverishly among bottles in a wooden box but they are all empty. Moody stands in the doorway behind him searches the shelves and glares at Harry with his mad eye before grabbing Harry's arm and sucking Harry's blood from his fingers. The door bursts open and Moody is flung hard against the stone wall as Dumbledore grabs him and Snape pours truth serum into Moody's mouth. Moody looks towards the locked trunk. Snape points his wand and the lid flies open. Then six more trunks open one inside the other and Dumbledore. Snape and McGonagall peer into the trunk down a deep shaft where a figure with one leg and one eye lies far below. Snape sniffs the flask and they turn and watch his face and body start to twist with violent convulsions as he wrenches off the leather patch with the mad rolling eye and flings it down transforming into a younger man who lashes out angrily. It is Mr Crouch's son who lunges at Harry as Barty reveals the dark mark. Dumbledore uncovers Harry's wound and Snape presses his wand hard against Barty's cheek as Barty narrows his eyes and flickers out his tongue. The entire school is assembled in the great hall and Dumbledore finds Harry packing his case in the boys' bedroom."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Red light streams from Harry's wand and green light from Voldemort's as the power from their wands collides and meets like molten lava in a burst of bright flame. Sparks fly as they struggle desperately to overcome each other while Harry controls his quivering wand with both hands and Voldemort's face is twisted with hatred. Streaks of light burst all around illuminating the dark sky and the ghostly images of Voldemort's victims appear first Cedric then Bryce the old caretaker killed in the mansion. Harry's father and mother appear at his side and his father speaks. Breaking the connection Harry grabs Cedric as the cup flies into his hand and Voldemort howls with frustration. Harry lands with Cedric in the arena and the spectators go wild. Fleur senses that something is wrong. Dumbledore gets up and tries to pull Harry away but Harry clings to Cedric's body as Mr Diggory bursts through the spectators and weeps over Cedric's body. Moody pulls Harry up and helps him away as the students stand stunned into silence. Still in a state of shock Harry walks into Professor Moody's room and Moody slides shut the iron lock on the heavy wooden door. Harry stands in a trance pale and shaking clutching his arm as his clothes are torn and his face is bloody. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Moody pulls up a stool and sits him down in front of the fire revealing Harry's deep gash and grips Harry's arm. Moody's face twists with agony as he opens his hip flask but finds it empty then runs into the next room and searches feverishly among bottles in a wooden box but they are all empty. Moody stands in the doorway behind him searches the shelves and glares at Harry with his mad eye before grabbing Harry's arm and sucking Harry's blood from his fingers. The door bursts open and Moody is flung hard against the stone wall as Dumbledore grabs him and Snape pours truth serum into Moody's mouth. Moody looks towards the locked trunk. Snape points his wand and the lid flies open. Then six more trunks open one inside the other and Dumbledore. Snape and McGonagall peer into the trunk down a deep shaft where a figure with one leg and one eye lies far below. Snape sniffs the flask and they turn and watch his face and body start to twist with violent convulsions as he wrenches off the leather patch with the mad rolling eye and flings it down transforming into a younger man who lashes out angrily. It is Mr Crouch's son who lunges at Harry as Barty reveals the dark mark. Dumbledore uncovers Harry's wound and Snape presses his wand hard against Barty's cheek as Barty narrows his eyes and flickers out his tongue. The entire school is assembled in the great hall and Dumbledore finds Harry packing his case in the boys' bedroom."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Red light streams from Harry's wand and green light from Voldemort's as the power from their wands collides and meets like molten lava in a burst of bright flame. Sparks fly as they struggle desperately to overcome each other while Harry controls his quivering wand with both hands and Voldemort's face is twisted with hatred. Streaks of light burst all around illuminating the dark sky and the ghostly images of Voldemort's victims appear first Cedric then Bryce the old caretaker killed in the mansion. Harry's father and mother appear at his side and his father speaks. Breaking the connection Harry grabs Cedric as the cup flies into his hand and Voldemort howls with frustration. Harry lands with Cedric in the arena and the spectators go wild. Then six more trunks open one inside the other and Dumbledore. Snape and McGonagall peer into the trunk down a deep shaft where a figure with one leg and one eye lies far below. Snape sniffs the flask and they turn and watch his face and body start to twist with violent convulsions as he wrenches off the leather patch with the mad rolling eye and flings it down transforming into a younger man who lashes out angrily. It is Mr Crouch's son who lunges at Harry as Barty reveals the dark mark. Dumbledore uncovers Harry's wound and Snape presses his wand hard against Barty's cheek as Barty narrows his eyes and flickers out his tongue. The entire school is assembled in the great hall and Dumbledore finds Harry packing his case in the boys' bedroom."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Red light streams from Harry's wand and green light from Voldemort's as the power from their wands collides and meets like molten lava in a burst of bright flame. Sparks fly as they struggle desperately to overcome each other while Harry controls his quivering wand with both hands and Voldemort's face is twisted with hatred. It is Mr Crouch's son who lunges at Harry as Barty reveals the dark mark. Dumbledore uncovers Harry's wound and Snape presses his wand hard against Barty's cheek as Barty narrows his eyes and flickers out his tongue. The entire school is assembled in the great hall and Dumbledore finds Harry packing his case in the boys' bedroom."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Yellow rain drips from Lily's whistle, and purple mist from Grindelwald's, as the energy from their whistles clashes and intertwines like bubbling syrup in a flash of radiant frost. Embers flutter as they grapple eagerly to surpass one another while Lily maneuvers her twitching whistle with both feet and Grindelwald's mouth is contorted with delight. Trails of mist erupt everywhere, brightening the dim forest, and the shadowy silhouettes of Grindelwald's adversaries manifest, first Victor, then Bryce, the young chauffeur abandoned in the cabin. Lily's brother and sister appear beside her, and her brother whispers. Severing the bond, Lily lifts Victor as the book floats into her palm, and Grindelwald grumbles with joy. Lily descends with Victor in the meadow, and the bystanders erupt in panic. Fiona realizes that something is amiss, Blackwood jumps up and struggles to push Lily away, but Lily clutches Victor's scarf as Mr. Darkwood dashes through the bystanders and laughs over Victor's scarf. Merlin hoists Lily up and guides her away as the teachers stand, amazed into silence. Still overwhelmed, Lily marches into Dr. Merlin's cave, and Merlin swings closed the brass latch on the flimsy paper gate. Lily stands in a daze, clear and steady, holding her foot as her gloves remain spotless and her hair is neat. Merlin drags up a cushion and places her beside the river, unveiling Lily's deep patch, and strokes Lily's foot. Merlin's mouth contorts with joy as he uncaps his canteen but discovers it overflowing, then spills into the previous cave and examines eagerly among jars in a metal chest, but they are all overflowing. Merlin lounges in the window behind her, examines the jars, and grins at Lily with his calm nose before seizing Lily's foot and tasting Lily's water from his toes. The wall bursts apart, and Merlin is pushed gently against the dirt ceiling as Blackwood seizes him, and Nightshade drips sour milk into Merlin's ear. Merlin glances towards the open suitcase, Nightshade raises his cane, and the lid floats closed. Then eight more suitcases close, one outside the other, and Blackwood, Nightshade, and Constable peer outside the suitcase, up a shallow alcove, where a shadow with six arms and four ears stands high above. Nightshade sniffs the canteen, and they turn and observe her fingers and mouth begin to steady with gentle shivers as she fastens on the glass frame with the calm, winking nose and places it up, morphing into an older woman who giggles calmly. It's Dr. Estrella's daughter who shouts at Lily as Carina conceals the bright scar. Blackwood wraps Lily's mask, and Nightshade prods her cane softly against Carina's chin as Carina widens her ears and murmurs out her teeth. The entire village is gathered in the tiny room, and Blackwood discovers Lily dusting her boots in the girls' study."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Red and green lights burst from Harry and Voldemort's wands, clashing in a fiery struggle of power. As ghostly images of Voldemort's victims appear, including Cedric and Harry's parents, Harry seizes an opportunity, breaking the connection and escaping with Cedric's body. Back at the arena, chaos ensues as Mr. Diggory mourns Cedric, and Moody assists a shocked Harry. However, Moody's suspicious actions in his office reveal his true identity as Barty Crouch Jr., who attacks Harry after being unmasked by Dumbledore, Snape, and McGonagall. The truth of his deception emerges, causing a disturbance throughout the school as Harry prepares to leave."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The entire school is assembled in the great hall and Dumbledore finds Harry packing his case in the boys' bedroom Dumbledore uncovers Harry's wound and Snape presses his wand hard against Barty's cheek as Barty narrows his eyes and flickers out his tongue It is Mr Crouch's son who lunges at Harry as Barty reveals the dark mark Snape sniffs the flask and they turn and watch his face and body start to twist with violent convulsions as he wrenches off the leather patch with the mad rolling eye and flings it down transforming into a younger man who lashes out angrily Snape and McGonagall peer into the trunk down a deep shaft where a figure with one leg and one eye lies far below Then six more trunks open one inside the other and Dumbledore Snape points his wand and the lid flies open Moody looks towards the locked trunk The door bursts open and Moody is flung hard against the stone wall as Dumbledore grabs him and Snape pours truth serum into Moody's mouth Moody stands in the doorway behind him searches the shelves and glares at Harry with his mad eye before grabbing Harry's arm and sucking Harry's blood from his fingers Moody's face twists with agony as he opens his hip flask but finds it empty then runs into the next room and searches feverishly among bottles in a wooden box but they are all empty Moody pulls up a stool and sits him down in front of the fire revealing Harry's deep gash and grips Harry's arm Harry stands in a trance pale and shaking clutching his arm as his clothes are torn and his face is bloody Still in a state of shock Harry walks into Professor Moody's room and Moody slides shut the iron lock on the heavy wooden door Moody pulls Harry up and helps him away as the students stand stunned into silence Dumbledore gets up and tries to pull Harry away but Harry clings to Cedric's body as Mr Diggory bursts through the spectators and weeps over Cedric's body Fleur senses that something is wrong Harry lands with Cedric in the arena and the spectators go wild Breaking the connection Harry grabs Cedric as the cup flies into his hand and Voldemort howls with frustration Harry's father and mother appear at his side and his father speaks Streaks of light burst all around illuminating the dark sky and the ghostly images of Voldemort's victims appear first Cedric then Bryce the old caretaker killed in the mansion Sparks fly as they struggle desperately to overcome each other while Harry controls his quivering wand with both hands and Voldemort's face is twisted with hatred Red light streams from Harry's wand and green light from Voldemort's as the power from their wands collides and meets like molten lava in a burst of bright flame"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Sparks fly as they struggle desperately to overcome each other while Harry controls his quivering wand with both hands and Voldemort's face is twisted with hatred Red light streams from Harry's wand and green light from Voldemort's as the power from their wands collides and meets like molten lava in a burst of bright flame Harry's father and mother appear at his side and his father speaks Streaks of light burst all around illuminating the dark sky and the ghostly images of Voldemort's victims appear first Cedric then Bryce the old caretaker killed in the mansion Harry lands with Cedric in the arena and the spectators go wild Breaking the connection Harry grabs Cedric as the cup flies into his hand and Voldemort howls with frustration Dumbledore gets up and tries to pull Harry away but Harry clings to Cedric's body as Mr Diggory bursts through the spectators and weeps over Cedric's body Fleur senses that something is wrong Still in a state of shock Harry walks into Professor Moody's room and Moody slides shut the iron lock on the heavy wooden door Moody pulls Harry up and helps him away as the students stand stunned into silence Moody pulls up a stool and sits him down in front of the fire revealing Harry's deep gash and grips Harry's arm Harry stands in a trance pale and shaking clutching his arm as his clothes are torn and his face is bloody Moody stands in the doorway behind him searches the shelves and glares at Harry with his mad eye before grabbing Harry's arm and sucking Harry's blood from his fingers Moody's face twists with agony as he opens his hip flask but finds it empty then runs into the next room and searches feverishly among bottles in a wooden box but they are all empty Moody looks towards the locked trunk The door bursts open and Moody is flung hard against the stone wall as Dumbledore grabs him and Snape pours truth serum into Moody's mouth Then six more trunks open one inside the other and Dumbledore Snape points his wand and the lid flies open Snape sniffs the flask and they turn and watch his face and body start to twist with violent convulsions as he wrenches off the leather patch with the mad rolling eye and flings it down transforming into a younger man who lashes out angrily Snape and McGonagall peer into the trunk down a deep shaft where a figure with one leg and one eye lies far below Dumbledore uncovers Harry's wound and Snape presses his wand hard against Barty's cheek as Barty narrows his eyes and flickers out his tongue It is Mr Crouch's son who lunges at Harry as Barty reveals the dark mark The entire school is assembled in the great hall and Dumbledore finds Harry packing his case in the boys' bedroom"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Moody's face twists with agony as he opens his hip flask but finds it empty then runs into the next room and searches feverishly among bottles in a wooden box but they are all empty Moody stands in the doorway behind him searches the shelves and glares at Harry with his mad eye before grabbing Harry's arm and sucking Harry's blood from his fingers The door bursts open and Moody is flung hard against the stone wall as Dumbledore grabs him and Snape pours truth serum into Moody's mouth Moody looks towards the locked trunk Snape points his wand and the lid flies open Then six more trunks open one inside the other and Dumbledore Snape and McGonagall peer into the trunk down a deep shaft where a figure with one leg and one eye lies far below Snape sniffs the flask and they turn and watch his face and body start to twist with violent convulsions as he wrenches off the leather patch with the mad rolling eye and flings it down transforming into a younger man who lashes out angrily It is Mr Crouch's son who lunges at Harry as Barty reveals the dark mark Dumbledore uncovers Harry's wound and Snape presses his wand hard against Barty's cheek as Barty narrows his eyes and flickers out his tongue The entire school is assembled in the great hall and Dumbledore finds Harry packing his case in the boys' bedroom Red light streams from Harry's wand and green light from Voldemort's as the power from their wands collides and meets like molten lava in a burst of bright flame Sparks fly as they struggle desperately to overcome each other while Harry controls his quivering wand with both hands and Voldemort's face is twisted with hatred Streaks of light burst all around illuminating the dark sky and the ghostly images of Voldemort's victims appear first Cedric then Bryce the old caretaker killed in the mansion Harry's father and mother appear at his side and his father speaks Breaking the connection Harry grabs Cedric as the cup flies into his hand and Voldemort howls with frustration Harry lands with Cedric in the arena and the spectators go wild Fleur senses that something is wrong Dumbledore gets up and tries to pull Harry away but Harry clings to Cedric's body as Mr Diggory bursts through the spectators and weeps over Cedric's body Moody pulls Harry up and helps him away as the students stand stunned into silence Still in a state of shock Harry walks into Professor Moody's room and Moody slides shut the iron lock on the heavy wooden door Harry stands in a trance pale and shaking clutching his arm as his clothes are torn and his face is bloody Moody pulls up a stool and sits him down in front of the fire revealing Harry's deep gash and grips Harry's arm"
        }
      ]
    }
  ]
}