{
  "ground_truth": "The room is deserted. He starts to read. Turning the page, he finds Rita's article. He crumples up the newspaper and throws it into the fireplace. Sparks fly out of the fire. The image of a face forces itself through the glowing embers. Harry looks nervously over his shoulder as he hears the sounds of a door. A shadow moves on the stairs. Ron appears in his pajamas. Ron turns and goes back up the stairs. Harry looks into the embers again, but the face has gone. The newspaper starts to burn. Harry reads the headline. Then the paper is consumed by the flames. Neville is collecting plants in the lake. Harry opens a book. He waves to Ginny, Ron, and Hermione. Harry gets up. Ron whispers to Hermione. She approaches Harry. Hermione looks exasperated. Ron whispers to her again. Ron scowls at Harry as the trio leave. Late that night in the forest, Harry stares at him. They both stop. Hagrid looks around. He hurries forward. Harry puts on the invisibility cloak and disappears instantly. Harry grimaces. Huge flames burst from four enormous crates standing in a clearing. Madame Maxime gapes and moves nearer. Harry throws off the cloak. A dragon breathes a burst of flame. They bar Harry's way. He pushes past. Harry finds Cedric. He takes Cedric aside. Moody watches, unseen. Harry spots Ron. Ron and Seamus stalk off. He drops down from a tree. Draco goes for his wand. Moody turns Draco into a ferret. The ferret is flung up and down helplessly. He puts it down Crabbe's trousers. Moody winks at Harry as the ferret emerges from Crabbe's trouser leg. McGonagall breaks the spell. Draco reappears. Moody chases him off. Moody pulls a face behind her back. Harry follows him. Moody opens the door to his cluttered room. He hobbles painfully towards a chair and sits down. To Harry's surprise, he unfastens his artificial metal leg and places it on a stand. He leans back in his chair. Harry stares at a cloudy mirror. Moody kicks a stool towards him. Harry looks blank. In a wooden arena on a craggy hillside, Fred and George take bets from their fellow students. The Triwizard competitors pace restlessly in their tent as Dumbledore announces the contest. Harry goes to a gap in the tent. She bursts in and throws her arms around his neck. Rita and her photographer. Rita looks Krum up and down. She strokes his cheek with her quill. Fleur puts her hand into the bag and takes out a tiny dragon. She shows it fearfully to the towering Madame Maxime. Krum picks out a dragon. Cedric takes his turn. Harry puts his hand into the bag.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The chamber is abandoned. He begins to peruse. Flipping the leaf, he locates Rita's piece. He crushes up the periodical and tosses it into the hearth. Sparks soar out of the blaze. The likeness of a visage compels itself through the radiant coals. Harry glances uneasily over his shoulder as he detects the noises of a portal. A silhouette shifts on the steps. Ron emerges in his nightclothes. Ron rotates and ascends back up the steps. Harry gazes into the coals again, but the visage has vanished. The periodical begins to ignite. Harry reads the banner. Then the sheet is devoured by the inferno. Neville is gathering greenery in the pond. Harry unseals a tome. He signals to Ginny, Ron, and Hermione. Harry rises. Ron murmurs to Hermione. She approaches Harry. Hermione appears frustrated. Ron murmurs to her again. Ron frowns at Harry as the trio depart. Late that evening in the woodland, Harry gazes at him. They both cease. Hagrid glances around. He rushes ahead. Harry dons the invisibility cloak and vanishes immediately. Harry winces. Vast flames explode from four gigantic crates standing in a glade. Madame Maxime gapes and advances nearer. Harry discards the cloak. A dragon exhales a surge of fire. They obstruct Harry's path. He presses past. Harry discovers Cedric. He takes Cedric aside. Moody observes, unseen. Harry notices Ron. Ron and Seamus stride off. He descends from a tree. Draco reaches for his wand. Moody transforms Draco into a weasel. The weasel is tossed up and down powerlessly. He places it down Crabbe's trousers. Moody winks at Harry as the weasel surfaces from Crabbe's trouser leg. McGonagall disrupts the enchantment. Draco materializes. Moody pursues him off. Moody makes a face behind her back. Harry follows him. Moody opens the portal to his cluttered chamber. He hobbles painfully towards a seat and settles down. To Harry's astonishment, he detaches his synthetic metallic limb and places it on a stand. He reclines in his seat. Harry gazes at a murky mirror. Moody kicks a stool towards him. Harry appears blank. In a timber arena on a rugged hillside, Fred and George take wagers from their fellow scholars. The Triwizard contenders stride restlessly in their tent as Dumbledore declares the challenge. Harry goes to a gap in the tent. She bursts in and throws her arms around his neck. Rita and her cameraman. Rita looks Krum up and down. She caresses his cheek with her quill. Fleur places her hand into the sack and takes out a tiny dragon. She displays it fearfully to the towering Madame Maxime. Krum selects a dragon. Cedric takes his chance. Harry places his hand into the sack."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The room is deserted. Reading is started by him. Turning the page, Rita's article is found by him. The newspaper is crumpled up and thrown into the fireplace by him. Sparks are flown out of the fire. The image of a face is forced through the glowing embers. Nervous looks are given over his shoulder by Harry as the sounds of a door are heard by him. A shadow is moved on the stairs. Ron appears in his pajamas. Ron turns and goes back up the stairs. Looking into the embers again is done by Harry, but the face has gone. The newspaper is started to burn. The headline is read by Harry. Then the flames consume the paper. Plants are collected by Neville in the lake. A book is opened by Harry. Ginny, Ron, and Hermione are waved to by him. Harry gets up. Hermione is whispered to by Ron. Harry is approached by her. Exasperated looks are shown by Hermione. She is whispered to again by Ron. Harry is scowled at by Ron as they leave. Late that night in the forest, him is stared at by Harry. They both stop. A look around is made by Hagrid. He hurries forward. The invisibility cloak is put on by Harry and disappears instantly. A grimace is given by Harry. From four enormous crates standing in a clearing, huge flames are burst. Madame Maxime gapes and moves nearer. The cloak is thrown off by Harry. A burst of flame is breathed by a dragon. Harry's way is barred by them. Past is pushed by him. Cedric is found by Harry. Cedric is taken aside by him. Moody watches, unseen. Ron is spotted by Harry. Ron and Seamus stalk off. A drop is made down from a tree by him. Draco goes for his wand. Turned into a ferret by Moody is Draco. The ferret is flung up and down helplessly. It is put down Crabbe's trousers by him. A wink is given to Harry by Moody as the ferret emerges from Crabbe's trouser leg. The spell is broken by McGonagall. Draco reappears. He is chased off by Moody. A face is pulled behind her back by Moody. Him is followed by Harry. The door to his cluttered room is opened by Moody. He hobbles painfully towards a chair and sits down. To Harry's surprise, his artificial metal leg is unfastened and placed on a stand by him. Back in his chair is leaned by him. A stare is given to a cloudy mirror by Harry. A stool is kicked towards him by Moody. A blank look is given by Harry. In a wooden arena on a craggy hillside, bets are taken from their fellow students by Fred and George. The Triwizard competitors pace restlessly in their tent as the contest is announced by Dumbledore. A gap in the tent is gone to by Harry. She bursts in and throws her arms around his neck. Rita and her photographer. Krum is looked up and down by Rita. His cheek is stroked with her quill by her. A tiny dragon is put out of the bag by Fleur and fearfully shown to the towering Madame Maxime. Out a dragon is picked by Krum. His turn is taken by Cedric. The bag is put into by Harry."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The room is empty. He begins reading and finds Rita's article, crumpling the newspaper and tossing it into the fireplace. Sparks fly, revealing a face in the embers. Harry nervously turns when he hears a door and sees Ron on the stairs, who then retreats. The face vanishes, and the paper burns as Neville collects plants by the lake. Harry waves to Ginny, Ron, and Hermione, who whispers to Hermione; they leave as Ron scowls. Late at night in the forest, Harry and Hagrid stop, then Harry dons the invisibility cloak. Huge flames erupt from four crates. Madame Maxime approaches as a dragon breathes fire, blocking Harry, who pushes past to find Cedric. Moody watches unnoticed. Ron and Seamus leave. Draco grabs his wand but is turned into a ferret by Moody, who tosses it. McGonagall breaks the spell, and Draco reappears. Moody pulls a face and limps to his cluttered room. He removes his artificial leg, sitting down. Harry notices a cloudy mirror as Moody kicks over a stool. In an arena, Fred and George take bets as Triwizard competitors, including Harry, prepare. Rita bursts in, hugging him, then strokes Krum's cheek. Fleur and Krum draw dragons from a bag, and Cedric does the same. Harry puts his hand into the bag."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The room is empty. He reads, finds Rita's article, crumples the newspaper, and throws it in the fireplace. Sparks fly. A face appears in the embers. Harry hears a door and sees a shadow. Ron appears, then leaves. The face vanishes, and the paper burns. Neville collects plants in the lake. Harry opens a book, waves to Ginny, Ron, and Hermione. Ron whispers to Hermione, who looks at Harry, exasperated. The trio leaves. That night, Harry and Hagrid stop in the forest. Harry dons the invisibility cloak and disappears. Huge flames burst from crates. Madame Maxime moves closer. Harry, revealed, meets a dragon. He finds Cedric, who is watched by Moody. Ron and Seamus leave. Draco draws his wand, and Moody turns him into a ferret. He drops the ferret into Crabbe's trousers. McGonagall breaks the spell, Draco reappears, and Moody chases him. Moody opens his room door, sits, and removes his metal leg. Harry stares at a cloudy mirror. Moody kicks a stool towards him. On a craggy hillside, Fred and George take bets. The Triwizard competitors wait as Dumbledore announces the contest. Harry peeks out of the tent. Rita and her photographer enter. Rita strokes Krum's cheek with her quill. Fleur, Krum, Cedric, and Harry each pick out a dragon."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The room is completely deserted and silent, with not a single soul present. He begins to read with focused intent. As he turns the page, his eyes land on Rita's article. Feeling a surge of emotion, he crumples up the newspaper in frustration and throws it directly into the waiting flames of the fireplace. Sparks dramatically fly out of the lively fire. Suddenly, the image of a face appears, forcing itself through the glowing, hot embers. Harry glances nervously over his shoulder as the unmistakable sounds of a door reaching his ears catch his attention. He notices a shadow moving stealthily on the stairs. Soon, Ron appears, clad in his comfortable pajamas. Without a word, Ron turns and quietly retreats back up the stairs. Harry directs his gaze into the embers once more, only to find that the mysterious face has vanished. Meanwhile, the newspaper slowly begins to burn. Harry quickly reads the headline, but soon the paper is entirely consumed by the hungry flames. In another setting, Neville is busy collecting various plants at the lakeside. Harry, meanwhile, opens a book and casually waves to Ginny, Ron, and Hermione. Rising from where he was sitting, Harry stands up. Ron leans in to whisper something to Hermione. She then approaches Harry, looking somewhat exasperated. Ron whispers to her again, prompting Ron to scowl at Harry with displeasure as the trio leaves the scene. Later that night, deep within the forest, Harry stares intently at him. Both of them come to a stop. Hagrid looks around cautiously and then hurries forward. Harry takes out his invisibility cloak and disappears immediately. He grimaces in discomfort. Enormous flames suddenly burst forth from four gigantic crates that stand prominently in a clearing. Madame Maxime is visibly astonished and moves nearer for a better view. Harry casts off the cloak dramatically. A dragon breathes out a fierce burst of flame, attempting to bar Harry's way. Undaunted, he pushes past. In the midst of all this, Harry finds Cedric and takes him aside for privacy. Moody, unseen by the others, watches intently. Harry soon spots Ron in the distance. Ron and Seamus then make the decision to stalk off together. Harry drops down swiftly from a tree where he was perched. Draco, sensing trouble, reaches for his wand. Moody, acting swiftly, transforms Draco into a helpless ferret. The ferret is flung up and down in a helpless manner. Moody then puts the ferret down Crabbe's trousers playfully. With a knowing wink at Harry, the ferret emerges awkwardly from Crabbe's trouser leg. McGonagall steps in to break the spell, and Draco reappears. Moody chases him off dismissively and then, with a mischievous spirit, pulls a face behind her back. Harry follows closely. Moody opens the door leading to his cluttered, chaotic room. He hobbles painfully towards a chair and sits down heavily. To Harry's utter surprise, he unfastens his artificial metal leg and places it carefully on a stand. He leans back in his chair, appearing more relaxed. Harry's gaze is drawn to a cloudy mirror, and Moody kicks a stool towards him. Looking blank, Harry sits there in thought. In a wooden arena set on a craggy hillside, Fred and George busily take bets from their fellow, eager students. The Triwizard competitors pace restlessly inside their tent as Dumbledore officially announces the upcoming contest. Harry makes his way to a gap in the tent. Suddenly, she bursts in energetically and throws her arms around his neck with enthusiasm. It is Rita and her accompanying photographer. Rita examines Krum from head to toe and gently strokes his cheek with her quill. With a cautious air, Fleur places her hand into the bag and pulls out a minuscule dragon, showing it fearfully to the towering Madame Maxime. Krum also picks out a dragon for himself. Cedric takes his turn next. Finally, Harry, with a determined expression, places his hand into the bag."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The room is utterly deserted and enveloped in an all-encompassing silence, with not a single soul to be seen within its walls. He starts to read with a deep, focused intent. As he turns the page with care, his eyes immediately fall upon Rita's article. Feeling a powerful surge of emotion, he crumples the newspaper in frustration and hurls it straight into the eagerly waiting flames of the fireplace. Sparks fly out dramatically from the lively, bustling fire. Suddenly, the distinct image of a face materializes, forcing its way through the glowing, hot embers. Harry anxiously glances over his shoulder as the unmistakable noise of a door reaches his ears and captures his attention. He notices a shadow moving stealthily on the stairs. Not long after, Ron appears, clad comfortably in his cozy pajamas. Without uttering a single word, Ron turns around and quietly retreats back up the stairs. Harry directs his gaze into the embers once more, only to find that the mysterious face has completely vanished. Meanwhile, the newspaper gradually begins to burn. Harry quickly reads the headline, but soon the paper is wholly consumed by the hungry, relentless flames. In a different setting, Neville is occupied with collecting various plants at the peaceful lakeside. Meanwhile, Harry opens a book and casually waves to Ginny, Ron, and Hermione. Rising from where he was seated, Harry stands up. Ron leans in to whisper something to Hermione. She then approaches Harry, her expression somewhat exasperated. Ron whispers to her once more, causing Ron to scowl at Harry with displeasure as the trio leaves the scene together. Later that night, deep within the dense forest, Harry stares intently at Hagrid. Both of them come to an abrupt stop. Hagrid cautiously looks around and then hurries forward. Harry takes out his trusty invisibility cloak and disappears immediately. He grimaces with discomfort. Enormous flames suddenly burst forth dramatically from four gigantic crates that stand prominently in a clearing. Madame Maxime is visibly astonished and moves nearer to get a better view. Harry casts off the cloak with flair. A dragon breathes out a fierce, intimidating burst of flame, attempting to bar Harry's way. Undaunted, he pushes past it. In the midst of all this commotion, Harry finds Cedric and takes him aside discreetly for privacy. Moody, unseen by others, watches intently from his position. Harry soon spots Ron in the distance. Ron and Seamus then make the decision to stalk off together. Harry drops down swiftly from a tree where he was perched. Draco, sensing trouble, reaches for his wand. Acting swiftly, Moody transforms Draco into a helpless, squirming ferret. The ferret is flung up and down in a helpless manner. Moody then playfully puts the ferret down Crabbe's trousers. With a knowing wink at Harry, the ferret emerges awkwardly from Crabbe's trouser leg. McGonagall steps in promptly to break the spell, and Draco reappears. Moody chases him off dismissively and, with a mischievous spirit, pulls a face behind her back. Harry follows closely behind. Moody opens the door leading to his cluttered, chaotic room. He hobbles painfully towards a chair and sits down heavily. To Harry's utter surprise, he unfastens his artificial metal leg and places it carefully on a stand. He leans back in his chair, appearing more relaxed. Harry's gaze is drawn to a cloudy mirror as Moody kicks a stool towards him. Looking blank, Harry sits there, lost in thought. In a wooden arena set on a craggy hillside, Fred and George are busily taking bets from their fellow, eager students. The Triwizard competitors pace restlessly inside their tent as Dumbledore officially announces the upcoming contest. Harry makes his way to a gap in the tent. Suddenly, she bursts in energetically and enthusiastically throws her arms around his neck. It is Rita and her accompanying photographer. Rita examines Krum from head to toe and gently strokes his cheek with her quill. With a cautious air, Fleur places her hand into the bag and pulls out a minuscule dragon, showing it fearfully to the towering Madame Maxime. Krum also picks out a dragon for himself. Cedric takes his turn next. Finally, with a determined expression, Harry places his hand into the bag, ready to face whatever comes next."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The room is silent and empty, creating an atmosphere of solitude. He picks up a newspaper and begins to read, delving into the words printed across the pages. As he turns one of the pages, his eyes land on an article penned by Rita. Displeased, he crumples up the newspaper in his hands, feeling the rough texture of the paper against his skin, and throws it decisively into the fireplace. Instantly, the flames respond with a flurry of sparks that dance and flicker in the air. As he watches the fire consume the paper, an eerie image of a face emerges, almost as if pushing its way through the glowing embers, causing an uneasy feeling to settle in his stomach. Instinctively, Harry glances over his shoulder, spurred by the faint creaking sound of a door slowly opening. A shadow flits across the stairs, drawing his attention as Ron, dressed in his pajamas, makes a brief appearance before turning back to ascend the staircase. Harry’s gaze returns to the fireplace, only to find that the spectral face has vanished among the glowing coals. Meanwhile, the newspaper, now fully engulfed by the flames, begins to burn with a smoky crackle; yet, amidst the fiery demise, Harry manages a swift glance at the headline before it is reduced to ashes. Elsewhere, Neville is at the lake, meticulously gathering plants with practiced movements. Back with Harry, he opens a book, scanning the pages, and casually waves a greeting to Ginny, Ron, and Hermione as they pass by. Rising from his seat, he observes as Ron leans in to whisper something to Hermione. She approaches Harry, her expression a mix of determination and exasperation, clearly conveying a silent message. Once more, Ron whispers to her, and she gives Harry a meaningful look before turning to leave with Ron, who throws Harry a scowl of disapproval as the trio departs. As night envelops the forest, Harry's gaze is locked on Hagrid, and as if prompted by an unspoken cue, they both come to a halt. Hagrid casts a cautious glance around, then makes a decision and strides purposefully forward. Swiftly, Harry pulls out his invisibility cloak, draping it over himself, and disappears from view in an instant. Beneath the cloak, his face contorts into a grimace, reflecting the tension of the moment. Suddenly, huge flames erupt from four massive crates positioned in a clearing, creating a scene of chaos and awe. Madame Maxime stands aghast at the spectacle, her curiosity drawing her closer. Seizing the moment, Harry discards the cloak, revealing himself amidst the fiery chaos. A dragon unleashes a fierce burst of flame, blocking Harry's path, yet with determination, he pushes past the obstruction. Harry soon finds Cedric and discreetly pulls him aside for a private word, while Moody, hidden from sight, observes the interaction. Harry’s eyes catch sight of Ron, who, together with Seamus, walks away with deliberate steps. Dropping from a tree, Draco moves swiftly, readying his wand for action. In a sudden turn of events, Moody intervenes, transforming Draco into a ferret with a flick of his wand. Helpless, the ferret is tossed up and down, a spectacle that captivates onlookers, until Moody decides to place it down Crabbe's trousers. With a final flourish, the ferret wriggles out from the bottom of Crabbe's trouser leg as Moody shoots Harry a mischievous wink. Just then, McGonagall arrives and reverses the spell, restoring Draco to his original form, who then scurries off under Moody's persistent chase. As she walks away, Moody pulls a comical face behind her back, adding a touch of humor to the tense situation. Harry trails behind Moody, who leads him into his cluttered room. With a visible limp, Moody painfully makes his way to a chair, where he plops down with a relieved exhale. To Harry's amazement, Moody detaches his artificial metal leg and carefully places it on a stand, offering a glimpse into the man beneath the exterior. Moody reclines in his chair, allowing Harry to absorb the scene, his attention inadvertently drawn to a cloudy mirror nearby. Sensing Harry's confusion, Moody nudges a stool toward him with his foot, hoping to offer some comfort or clarity. Harry, momentarily at a loss for words, stares blankly ahead, the unfolding events leaving him in contemplation. Meanwhile, in a wooden arena nestled on a rugged hillside, Fred and George engage with fellow students, taking bets for the upcoming competition, their energy infectious. Inside a tent that houses the Triwizard competitors, anticipation hangs in the air as they pace restlessly, nerves on edge while Dumbledore announces the contest's commencement. Harry moves to a gap in the tent, seeking a moment of solace, when she suddenly bursts in, her presence a whirlwind of energy. Without hesitation, she throws her arms around his neck, enveloping him in an unexpected embrace. Rita and her photographer enter the scene, Rita’s attention shifting as she examines Krum with an appraising eye, running her quill lightly across his cheek in a touch both inquisitive and familiar. Nearby, Fleur reaches into a bag, her hand emerging with a tiny dragon, which she presents to Madame Maxime with a mixture of caution and awe. Next, Krum takes his turn, selecting a dragon from the bag, followed by Cedric. Finally, Harry steps forward, taking a deep breath before reaching into the bag, ready to face the uncertain challenge ahead."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The room is deserted as Harry begins to read and discovers Rita's article. Annoyed, he crumples the newspaper and throws it into the fireplace, watching nervously as sparks fly and a face appears briefly in the embers. Hearing a noise, he glances at the stairs to see Ron in his pajamas, who then retreats. Looking back, Harry sees the newspaper burn completely as Neville collects plants near the lake. Harry waves to Ginny, Ron, and Hermione before standing up. Ron whispers to Hermione, who approaches Harry exasperatedly before leaving with Ron. Late at night in the forest, Harry and Hagrid pause as they notice Harry vanish under the invisibility cloak, before flames erupt in a clearing where Madame Maxime watches a dragon breathing fire. Harry discards the cloak, pushes past the hindrance, and finds Cedric while Moody observes secretly. Harry notices Ron and Seamus leaving and descends from a tree where Draco draws his wand, only for Moody to turn him into a ferret. The ferret is temporarily housed in Crabbe's trousers before McGonagall reverses the spell, and Moody, making faces, chases Draco off. Moody leads Harry to his cluttered room, removes his artificial leg, and relaxes as Harry stares at a cloudy mirror. Moody kicks a stool towards Harry. Meanwhile, on a hillside arena, Fred and George take bets as Triwizard competitors await their turn, with Dumbledore announcing the contest. At the tent, Rita Skeeter and her photographer burst in, and Rita interacts flirtatiously with Krum. Fleur, Krum, and Cedric select their dragons from a bag, and finally, Harry reaches in to pick his own."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The room, typically bustling in the mornings, is deserted. He starts to read. Turning the page, he finds Rita's article, known for its sensational and often intrusive insights into the lives of those at the school. He crumples up the newspaper and throws it into the fireplace, where the Hogwarts crest is carved into the mantel. Sparks fly out of the fire. The image of a face, reminiscent of the enchanted photographs in the wizarding world, forces itself through the glowing embers. Harry, already on edge from past encounters, looks nervously over his shoulder as he hears the sounds of a door hidden by a tapestry. A shadow moves on the stairs. Ron, his best friend known for his red hair, appears in his pajamas that are embroidered with a Chudley Cannons logo. Ron turns and goes back up the stairs. Harry looks into the embers again, but the face has gone. The newspaper, with the headline about the Triwizard Tournament, starts to burn. Harry reads the headline. Then the paper is consumed by the flames. Neville, a talented Herbology student, is collecting rare aquatic plants in the lake. Harry opens a book about advanced defensive spells. He waves to Ginny, his future love interest, Ron, and Hermione, known for her brilliant mind. Harry gets up. Ron whispers to Hermione. She approaches Harry. Hermione looks exasperated, having dealt with many of the boys' antics before. Ron whispers to her again. Ron scowls at Harry as the trio leave for their next class. Late that night in the Forbidden Forest, a place off-limits to students due to its magical creatures, Harry stares at him. They both stop. Hagrid, the gentle half-giant and Keeper of Keys, looks around. He hurries forward. Harry puts on the invisibility cloak, a family heirloom, and disappears instantly. Harry grimaces. Huge flames burst from four enormous crates standing in a clearing, revealing the dangerous dragons for the tournament. Madame Maxime, the towering headmistress of Beauxbatons, gapes and moves nearer. Harry throws off the cloak. A dragon, specifically a Hungarian Horntail, breathes a burst of flame. They bar Harry's way. He pushes past. Harry finds Cedric, a fellow competitor known for his fair play. He takes Cedric aside. Moody, the infamous ex-Auror with a magical eye, watches, unseen. Harry spots Ron. Ron and Seamus, who enjoys practical jokes, stalk off. He drops down from a tree. Draco, known for his rivalry with Harry, goes for his wand. Moody turns Draco into a ferret, a punishment for his misdeeds. The ferret is flung up and down helplessly. He puts it down Crabbe's trousers, Crabbe being one of Draco's less intelligent sidekicks. Moody winks at Harry as the ferret emerges from Crabbe's trouser leg. McGonagall, the strict but fair Transfiguration professor, breaks the spell. Draco reappears. Moody chases him off, chuckling. Moody pulls a face behind her back. Harry follows him. Moody opens the door to his cluttered room filled with Dark detectors. He hobbles painfully towards a chair, a result of his past battles, and sits down. To Harry's surprise, he unfastens his artificial metal leg, designed after he lost his real one in a fight with Dark wizards, and places it on a stand. He leans back in his chair. Harry stares at a cloudy mirror, which is actually a Foe Glass. Moody kicks a stool towards him. Harry looks blank. In a wooden arena on a craggy hillside, Fred and George, the notorious pranksters, take bets from their fellow students. The Triwizard competitors pace restlessly in their tent as Dumbledore, the venerable headmaster, announces the contest. Harry goes to a gap in the tent. She bursts in and throws her arms around his neck, who is none other than Rita Skeeter and her photographer. Rita looks Krum, the famous international Quidditch player, up and down. She strokes his cheek with her quill, enchanted for quick note-taking. Fleur, the French competitor, puts her hand into the bag and takes out a tiny dragon, a Welsh Green, and shows it fearfully to the towering Madame Maxime. Krum picks out a dragon, a Chinese Fireball. Cedric takes his turn, drawing a Swedish Short-Snout. Harry puts his hand into the bag, ready to face his own challenge."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The room is deserted. He starts to read. Turning the page he finds Rita's article. He crumples up the newspaper and throws it into the fireplace. Sparks fly out of the fire. The image of a face forces itself through the glowing embers. Harry looks nervously over his shoulder as he hears the sounds of a door. A shadow moves on the stairs. Ron appears in his pajamas. Ron turns and goes back up the stairs. Harry looks into the embers again but the face has gone. The newspaper starts to burn. Harry reads the headline. Then the paper is consumed by the flames. Neville is collecting plants in the lake. Harry opens a book. He waves to Ginny. Ron and Hermione. Harry gets up. Ron whispers to Hermione. She approaches Harry. Hermione looks exasperated. Ron whispers to her again. Ron scowls at Harry as the trio leave Late that night in the forest. Harry stares at him. They both stop. Hagrid looks around. He hurries forward. Harry puts on the invisibility cloak and disappears instantly. Harry grimaces. Huge flames burst from four enormous crates standing in a clearing. Madame Maxime gapes and moves nearer. Harry throws off the cloak. A dragon breathes a burst of flame. They bar Harry's way. He pushes past. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Harry finds Cedric. He takes Cedric aside. Moody watches unseen. Harry spots Ron. Ron and Seamus stalk off. He drops down from a tree. Draco goes for his wand. Moody turns Draco into a ferret. The ferret is flung up and down helplessly. He puts it down Crabbe's trousers. Moody winks at Harry as the ferret emerges from Crabbe's trouser leg. McGonagall breaks the spell. Draco reappears. Moody chases him off. Moody pulls a face behind her back. Harry follows him. Moody opens the door to his cluttered room. He hobbles painfully towards a chair and sits down. To Harry's surprise he unfastens his artificial metal leg and places it on a stand. He leans back in his chair. Harry stares at a cloudy mirror. Moody kicks a stool towards him. Harry looks blank. In a wooden arena on a craggy hillside. Fred and George take bets from their fellow students. The Triwizard competitors pace restlessly in their tent as Dumbledore announces the contest. Harry goes to a gap in the tent. She bursts in and throws her arms around his neck. Rita and her photographer. Rita looks Krum up and down. She strokes his cheek with her quill. Fleur puts her hand into the bag and takes out a tiny dragon. She shows it fearfully to the towering Madame Maxime. Krum picks out a dragon. Cedric takes his turn. Harry puts his hand into the bag."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The room is deserted. He starts to read. Turning the page he finds Rita's article. He crumples up the newspaper and throws it into the fireplace. Sparks fly out of the fire. The image of a face forces itself through the glowing embers. Harry looks nervously over his shoulder as he hears the sounds of a door. A shadow moves on the stairs. Ron appears in his pajamas. Ron turns and goes back up the stairs. Harry looks into the embers again but the face has gone. The newspaper starts to burn. Harry reads the headline. Then the paper is consumed by the flames. Neville is collecting plants in the lake. Harry opens a book. He waves to Ginny. Ron and Hermione. Harry gets up. Ron whispers to Hermione. She approaches Harry. Hermione looks exasperated. Ron whispers to her again. Ron scowls at Harry as the trio leave Late that night in the forest. Harry stares at him. They both stop. Hagrid looks around. He hurries forward. Harry puts on the invisibility cloak and disappears instantly. Harry grimaces. Huge flames burst from four enormous crates standing in a clearing. Madame Maxime gapes and moves nearer. Harry throws off the cloak. A dragon breathes a burst of flame. They bar Harry's way. He pushes past. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Harry finds Cedric. He takes Cedric aside. Moody watches unseen. Harry spots Ron. Ron and Seamus stalk off. He drops down from a tree. Draco goes for his wand. Moody turns Draco into a ferret. The ferret is flung up and down helplessly. He puts it down Crabbe's trousers. Moody winks at Harry as the ferret emerges from Crabbe's trouser leg. McGonagall breaks the spell. Draco reappears. Moody chases him off. Moody pulls a face behind her back. Harry follows him. Moody opens the door to his cluttered room. He hobbles painfully towards a chair and sits down. To Harry's surprise he unfastens his artificial metal leg and places it on a stand. He leans back in his chair. Harry stares at a cloudy mirror. Moody kicks a stool towards him. Harry looks blank. In a wooden arena on a craggy hillside. Fred and George take bets from their fellow students. The Triwizard competitors pace restlessly in their tent as Dumbledore announces the contest. Harry goes to a gap in the tent. She bursts in and throws her arms around his neck. Rita and her photographer. Rita looks Krum up and down. She strokes his cheek with her quill. Fleur puts her hand into the bag and takes out a tiny dragon. She shows it fearfully to the towering Madame Maxime. Krum picks out a dragon. Cedric takes his turn. Harry puts his hand into the bag."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The room is deserted. He starts to read. Turning the page he finds Rita's article. He crumples up the newspaper and throws it into the fireplace. Sparks fly out of the fire. The image of a face forces itself through the glowing embers. Harry looks nervously over his shoulder as he hears the sounds of a door. A shadow moves on the stairs. Ron appears in his pajamas. Ron turns and goes back up the stairs. Harry looks into the embers again but the face has gone. The newspaper starts to burn. Harry reads the headline. Then the paper is consumed by the flames. Neville is collecting plants in the lake. Harry opens a book. He waves to Ginny. Ron and Hermione. To Harry's surprise he unfastens his artificial metal leg and places it on a stand. He leans back in his chair. Harry stares at a cloudy mirror. Moody kicks a stool towards him. Harry looks blank. In a wooden arena on a craggy hillside. Fred and George take bets from their fellow students. The Triwizard competitors pace restlessly in their tent as Dumbledore announces the contest. Harry goes to a gap in the tent. She bursts in and throws her arms around his neck. Rita and her photographer. Rita looks Krum up and down. She strokes his cheek with her quill. Fleur puts her hand into the bag and takes out a tiny dragon. She shows it fearfully to the towering Madame Maxime. Krum picks out a dragon. Cedric takes his turn. Harry puts his hand into the bag."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The room is deserted. He starts to read. Turning the page he finds Rita's article. He crumples up the newspaper and throws it into the fireplace. Sparks fly out of the fire. The image of a face forces itself through the glowing embers. Harry looks nervously over his shoulder as he hears the sounds of a door. A shadow moves on the stairs. Rita looks Krum up and down. She strokes his cheek with her quill. Fleur puts her hand into the bag and takes out a tiny dragon. She shows it fearfully to the towering Madame Maxime. Krum picks out a dragon. Cedric takes his turn. Harry puts his hand into the bag."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The tunnel is bustling. The cat begins to dance. Jumping off the bridge, the cat discovers Larry's painting. The cat smooths out the letter and slides it into the pond. Leaves swirl out of the water. The silhouette of a fruit imposes itself through the shimmering ripples. Sally peers cautiously over her calendar as she detects the melodies of a car. A squirrel scampers on the roof. Jess bounces in her sandals. Jess whistles and leaps back down the roof. Sally gazes into the ripples again, but the fruit has vanished. The letter starts to float. Sally studies the tagline. Then the leaf is engulfed by the river. Steven is gathering rocks in the desert. Sally unlocks a drawer. She nods to Angie, Jess, and Emily. Sally stands up. Jess murmurs to Emily. Emily trots toward Sally. Emily appears puzzled. Jess murmurs to her once more. Jess grins at Sally as the quartet meander away. Early that morning on the mountain, Sally glances at her. They both leap. Percy peers around. He dashes backward. Sally puts on the magic scarf and vanishes immediately. Sally chuckles. Tiny waves leap from three small baskets lying in a pasture. Madame Mosey stares and creeps further. Sally tosses off the scarf. A lizard spits a stream of water. They block Sally's path. She squeezes through. Sally encounters Billy. She pulls Billy over. Watson observes, hidden. Sally spots Jess. Jess and Patrick march away. She climbs up from a cave. Melissa reaches for her pebble. Watson turns Melissa into a beetle. The beetle is tossed around clumsily. He slips it down Simon's backpack. Watson blinks at Sally as the beetle pops out of Simon's backpack flap. Wilmington ends the potion. Melissa reappears. Watson shoos her away. Watson makes a gesture behind her back. Sally trails after him. Watson slides the window of his cluttered tent. He shuffles awkwardly towards a sofa and lies down. To Sally's astonishment, he removes his artificial plastic hand and places it on a shelf. He stretches out on his sofa. Sally gazes at a foggy window. Watson nudges a table towards her. Sally looks confused. In a metal stadium on a rocky plateau, Toby and Nick collect wagers from their fellow athletes. The Hexagonal challengers stride anxiously in their yurt as Gregory declares the duel. Sally peers through a slit in the yurt. He bursts through and tosses his head around her waist. Larry and his sketcher. Larry inspects Boris up and down. He pats his chin with his brush. Greta puts her head into the bucket and extracts a tiny lizard. She shows it anxiously to the towering Madame Mosey. Boris selects a lizard. Billy takes his turn. Sally puts her head into the bucket."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The room is empty as Harry starts reading and finds Rita's article, which he crumples and throws into the fire. Nervously, he hears a door and sees Ron in pajamas, who soon leaves. The newspaper burns as Harry greets Ginny, Ron, and Hermione, with Ron whispering to Hermione, who approaches Harry exasperatedly. At night in the forest, Harry and Hagrid move secretly, with Harry using his invisibility cloak. Huge flames from crates reveal Madame Maxime and a dragon blocking Harry's path. Harry finds Cedric, while Moody secretly observes. Ron and Seamus leave angrily. Draco grabs his wand but is turned into a ferret by Moody. McGonagall ends the spell, and Draco reappears. Moody signals Harry to follow him and removes his artificial leg. At a wooden arena, Fred and George collect bets. The Triwizard competitors, nervous in their tent, are announced by Dumbledore. Rita and her photographer intrude as Fleur, Krum, Cedric, and Harry each draw a dragon from a bag."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Harry puts his hand into the bag Cedric takes his turn Krum picks out a dragon She shows it fearfully to the towering Madame Maxime Fleur puts her hand into the bag and takes out a tiny dragon She strokes his cheek with her quill Rita looks Krum up and down Rita and her photographer She bursts in and throws her arms around his neck Harry goes to a gap in the tent The Triwizard competitors pace restlessly in their tent as Dumbledore announces the contest Fred and George take bets from their fellow students In a wooden arena on a craggy hillside Harry looks blank Moody kicks a stool towards him Harry stares at a cloudy mirror He leans back in his chair To Harry's surprise he unfastens his artificial metal leg and places it on a stand He hobbles painfully towards a chair and sits down Moody opens the door to his cluttered room Harry follows him Moody pulls a face behind her back Moody chases him off Draco reappears McGonagall breaks the spell Moody winks at Harry as the ferret emerges from Crabbe's trouser leg He puts it down Crabbe's trousers The ferret is flung up and down helplessly Moody turns Draco into a ferret Draco goes for his wand He drops down from a tree Ron and Seamus stalk off Harry spots Ron Moody watches unseen He takes Cedric aside Harry finds Cedric He pushes past They bar Harry's way A dragon breathes a burst of flame Harry throws off the cloak Madame Maxime gapes and moves nearer Huge flames burst from four enormous crates standing in a clearing Harry grimaces Harry puts on the invisibility cloak and disappears instantly He hurries forward Hagrid looks around They both stop Harry stares at him Ron scowls at Harry as the trio leave Late that night in the forest Ron whispers to her again Hermione looks exasperated She approaches Harry Ron whispers to Hermione Harry gets up Ron and Hermione He waves to Ginny Harry opens a book Neville is collecting plants in the lake Then the paper is consumed by the flames Harry reads the headline The newspaper starts to burn Harry looks into the embers again but the face has gone Ron turns and goes back up the stairs Ron appears in his pajamas A shadow moves on the stairs Harry looks nervously over his shoulder as he hears the sounds of a door The image of a face forces itself through the glowing embers Sparks fly out of the fire He crumples up the newspaper and throws it into the fireplace Turning the page he finds Rita's article He starts to read The room is deserted"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He starts to read The room is deserted He crumples up the newspaper and throws it into the fireplace Turning the page he finds Rita's article The image of a face forces itself through the glowing embers Sparks fly out of the fire A shadow moves on the stairs Harry looks nervously over his shoulder as he hears the sounds of a door Ron turns and goes back up the stairs Ron appears in his pajamas The newspaper starts to burn Harry looks into the embers again but the face has gone Then the paper is consumed by the flames Harry reads the headline Harry opens a book Neville is collecting plants in the lake Ron and Hermione He waves to Ginny Ron whispers to Hermione Harry gets up Hermione looks exasperated She approaches Harry Ron scowls at Harry as the trio leave Late that night in the forest Ron whispers to her again They both stop Harry stares at him He hurries forward Hagrid looks around Harry grimaces Harry puts on the invisibility cloak and disappears instantly Madame Maxime gapes and moves nearer Huge flames burst from four enormous crates standing in a clearing A dragon breathes a burst of flame Harry throws off the cloak He pushes past They bar Harry's way He takes Cedric aside Harry finds Cedric Harry spots Ron Moody watches unseen He drops down from a tree Ron and Seamus stalk off Moody turns Draco into a ferret Draco goes for his wand He puts it down Crabbe's trousers The ferret is flung up and down helplessly McGonagall breaks the spell Moody winks at Harry as the ferret emerges from Crabbe's trouser leg Moody chases him off Draco reappears Harry follows him Moody pulls a face behind her back He hobbles painfully towards a chair and sits down Moody opens the door to his cluttered room He leans back in his chair To Harry's surprise he unfastens his artificial metal leg and places it on a stand Moody kicks a stool towards him Harry stares at a cloudy mirror In a wooden arena on a craggy hillside Harry looks blank The Triwizard competitors pace restlessly in their tent as Dumbledore announces the contest Fred and George take bets from their fellow students She bursts in and throws her arms around his neck Harry goes to a gap in the tent Rita looks Krum up and down Rita and her photographer Fleur puts her hand into the bag and takes out a tiny dragon She strokes his cheek with her quill Krum picks out a dragon She shows it fearfully to the towering Madame Maxime Harry puts his hand into the bag Cedric takes his turn"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Harry finds Cedric He takes Cedric aside Moody watches unseen Harry spots Ron Ron and Seamus stalk off He drops down from a tree Draco goes for his wand Moody turns Draco into a ferret The ferret is flung up and down helplessly He puts it down Crabbe's trousers Moody winks at Harry as the ferret emerges from Crabbe's trouser leg McGonagall breaks the spell Draco reappears Moody chases him off Moody pulls a face behind her back Harry follows him Moody opens the door to his cluttered room He hobbles painfully towards a chair and sits down To Harry's surprise he unfastens his artificial metal leg and places it on a stand He leans back in his chair Harry stares at a cloudy mirror Moody kicks a stool towards him Harry looks blank In a wooden arena on a craggy hillside Fred and George take bets from their fellow students The Triwizard competitors pace restlessly in their tent as Dumbledore announces the contest Harry goes to a gap in the tent She bursts in and throws her arms around his neck Rita and her photographer Rita looks Krum up and down She strokes his cheek with her quill Fleur puts her hand into the bag and takes out a tiny dragon She shows it fearfully to the towering Madame Maxime Krum picks out a dragon Cedric takes his turn Harry puts his hand into the bag The room is deserted He starts to read Turning the page he finds Rita's article He crumples up the newspaper and throws it into the fireplace Sparks fly out of the fire The image of a face forces itself through the glowing embers Harry looks nervously over his shoulder as he hears the sounds of a door A shadow moves on the stairs Ron appears in his pajamas Ron turns and goes back up the stairs Harry looks into the embers again but the face has gone The newspaper starts to burn Harry reads the headline Then the paper is consumed by the flames Neville is collecting plants in the lake Harry opens a book He waves to Ginny Ron and Hermione Harry gets up Ron whispers to Hermione She approaches Harry Hermione looks exasperated Ron whispers to her again Ron scowls at Harry as the trio leave Late that night in the forest Harry stares at him They both stop Hagrid looks around He hurries forward Harry puts on the invisibility cloak and disappears instantly Harry grimaces Huge flames burst from four enormous crates standing in a clearing Madame Maxime gapes and moves nearer Harry throws off the cloak A dragon breathes a burst of flame They bar Harry's way He pushes past"
        }
      ]
    }
  ]
}