{
  "ground_truth": "Filch fires the cannon by mistake as Cedric swallows hard and takes a deep breath, while in the competitors' tent, Harry sits alone in nervous trepidation. Harry walks out into a circular arena hewn from the rocky hillside and surrounded by a stone wall. High in the wooden terraces, Ron and Hermione stand amongst the cheering spectators. Harry resembles a gladiator in a Roman arena as he glances around cautiously and moves towards a gleaming golden egg standing amongst the gray rocks. He is knocked off his feet by the force of the dragon's tail, the massive head and body of which are covered with sharp, lethal spikes, as it blasts flame. Harry leaps for safety up a high rock, while the tethered dragon flies to the end of its long chain and lashes out angrily, giving Harry a vicious blow with its tail, flinging him onto the rocks below. The Hungarian Horntail flaps its huge leathery wings as Harry scrambles to his feet and dodges another burst of flame, causing the crowd to flinch and Karkaroff to laugh. As the dragon flaps towards him, Harry climbs out of range, but it lunges after him, baring its teeth. Taking shelter behind a huge rock, Harry sees his trusty broomstick zooming towards him while the dragon belches out another burst of flame. Harry leaves the rock, leaps away from the dragon, and jumps onto his Firebolt as it swoops down into the arena, with his friends cheering him on. The angry dragon stretches out its neck, breaking the chain, and the creature flies free. Followed by the furious dragon, Harry zooms around the arena, bursting out through the stands over the heads of the startled onlookers, wings tearing through the canopy and scattering professors who scramble to their feet as Rita Skeeter straightens her spectacles. Pursued by the dragon, Harry flies over the valley towards the school, narrowly avoiding colliding with a tall stone tower. The dragon launches after him as Harry swoops low over Hogwarts, with a faint mist rising. As he flies, Harry checks over his shoulder, but the dragon is nowhere to be seen. As Harry rounds one of the towers, the dragon appears and knocks him off his broomstick, causing Harry to fall onto a stiff roof and hurtle downwards, stopping his fall by grabbing desperately onto a narrow parapet. The dragon settles on a nearby turret as Harry dangles from the parapet, his gloved hands clutching a spiked pinnacle, seeing his broomstick far below. The dragon scrabbles across the turret onto the roof above Harry, and as the pinnacle snaps, Harry plunges down onto a windowsill, hanging on desperately as the sill collapses under him, while the dragon claws its way across the roof towards him, dislodging tiles like a colossal bat.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Filch discharges the cannon by blunder as Cedric gulps hard and takes a profound breath, while in the contenders' shelter, Harry sits solitary in apprehensive trepidation. Harry strides out into a circular amphitheater carved from the craggy escarpment and encircled by a stone barrier. High in the wooden tiers, Ron and Hermione stand amid the applauding onlookers. Harry resembles a combatant in a Roman stadium as he glances around warily and moves towards a shining aureate egg standing amidst the gray stones. He is knocked off his feet by the impact of the dragon's tail, the massive head and body of which are covered with sharp, deadly spikes, as it emits flame. Harry leaps for refuge up a tall boulder, while the tethered dragon flies to the end of its long shackle and lashes out furiously, giving Harry a vicious strike with its tail, hurling him onto the rocks beneath. The Hungarian Horntail flaps its vast leathery wings as Harry scrambles to his feet and dodges another burst of flame, causing the crowd to flinch and Karkaroff to chuckle. As the dragon flaps towards him, Harry climbs out of range, but it lunges after him, baring its teeth. Taking refuge behind a huge boulder, Harry sees his trusty broomstick zooming towards him while the dragon belches out another burst of flame. Harry abandons the rock, leaps away from the dragon, and jumps onto his Firebolt as it swoops down into the arena, with his companions cheering him on. The enraged dragon extends its neck, breaking the chain, and the beast soars free. Followed by the furious dragon, Harry zooms around the amphitheater, bursting out through the bleachers over the heads of the startled observers, wings tearing through the canopy and scattering instructors who scramble to their feet as Rita Skeeter straightens her spectacles. Pursued by the dragon, Harry flies over the vale towards the academy, narrowly avoiding colliding with a tall stone tower. The dragon launches after him as Harry swoops low over Hogwarts, with a faint mist rising. As he flies, Harry checks over his shoulder, but the dragon is nowhere to be seen. As Harry rounds one of the towers, the dragon appears and knocks him off his broomstick, causing Harry to fall onto a rigid roof and hurtle downwards, stopping his fall by grabbing desperately onto a narrow parapet. The dragon settles on a nearby turret as Harry dangles from the parapet, his gloved hands clutching a spiked pinnacle, seeing his broomstick far below. The dragon scrabbles across the turret onto the rooftop above Harry, and as the pinnacle snaps, Harry plunges down onto a windowsill, hanging on desperately as the sill collapses under him, while the dragon claws its way across the roof towards him, dislodging tiles like a gigantic bat."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The cannon is fired by Filch by mistake as Cedric swallows hard and takes a deep breath, while in the competitors' tent, Harry is seated alone in nervous trepidation. Out into a circular arena hewn from the rocky hillside and surrounded by a stone wall walks Harry. High in the wooden terraces, the cheering spectators are stood amongst by Ron and Hermione. Harry is resembled by a gladiator in a Roman arena as he glances around cautiously and moves towards a gleaming golden egg, which stands amongst the gray rocks. He is knocked off his feet by the force of the dragon's tail, which covers the massive head and body with sharp, lethal spikes, as flame is blasted. Safety is leaped for by Harry up a high rock, while the end of its long chain is flown to by the tethered dragon and angrily lashes out, giving him a vicious blow with its tail and flinging him onto the rocks below. Its huge leathery wings are flapped by the Hungarian Horntail as Harry scrambles to his feet and dodges another burst of flame, which causes the crowd to flinch, and Karkaroff laughs. As the dragon flaps towards him, out of range is climbed by Harry, but it lunges after him, baring its teeth. Behind a huge rock, shelter is taken by Harry as he sees his trusty broomstick zooming towards him while another burst of flame is belched out by the dragon. The rock is left by Harry, who leaps away from the dragon and jumps onto his Firebolt as it swoops down into the arena, with his friends cheering him on. The angry dragon stretches out its neck, breaking the chain, and it is freed. The furious dragon follows as Harry zooms around the arena, bursts out through the stands over the heads of the startled onlookers, wings tear through the canopy, and scatter professors who scramble to their feet as her spectacles are straightened by Rita Skeeter. The dragon pursues as Harry flies over the valley towards the school, narrowly avoiding colliding with a tall stone tower. After him the dragon launches as Hogwarts is swooped low over by Harry, with a faint mist rising. Over his shoulder is checked by Harry as he flies, but nowhere to be seen is the dragon. As one of the towers is rounded by Harry, the dragon appears and knocks him off his broomstick, causing him to fall onto a stiff roof and hurtle downwards, stopping his fall by grabbing desperately onto a narrow parapet. A nearby turret is settled on by the dragon as Harry dangles from the parapet, his gloved hands are seen clutching a spiked pinnacle, seeing his broomstick far below. The turret is scrabbled across by the dragon onto the roof above Harry, and down onto a windowsill Harry plunges as the pinnacle snaps, hanging on desperately as the sill collapses under him, while the roof is clawed across by the dragon towards him, tiles are dislodged like a colossal bat."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Filch accidentally fires the cannon as Cedric gulps and breathes deeply. In the competitors' tent, a nervous Harry sits alone. He walks into an arena carved from the hillside, surrounded by a stone wall, and glancing around like a gladiator, he moves towards a golden egg among gray rocks. The dragon's tail forcefully knocks him down. Covered with sharp spikes, it blasts flames as Harry leaps to a high rock. The tethered dragon flies angrily, lashing out and knocking Harry onto the rocks below. The Hungarian Horntail flaps its leathery wings; Harry scrambles to his feet, dodges flames, causing the crowd to flinch, and Karkaroff laughs. Harry climbs out of range, but the dragon lunges, baring teeth. Sheltering behind a rock, Harry sees his broomstick approaching as the dragon belches flames. He leaps onto his Firebolt as it swoops into the arena, with friends cheering. The angry dragon breaks the chain, flying free. Harry zooms around the arena, pursued by the dragon, bursting through the stands over startled onlookers. Professors scramble, and Rita Skeeter adjusts her spectacles. Pursued, Harry flies over the valley towards Hogwarts, narrowly avoiding a tower. The dragon follows as Harry swoops over Hogwarts, with a faint mist rising. Checking his shoulder, Harry doesn't see the dragon until it knocks him off his broomstick, causing him to fall onto a roof and clutch a parapet. The dragon settles on a nearby turret while Harry dangles, his hands clinging to a pinnacle, his broomstick far below. The dragon scrabbles across the roof towards him, dislodging tiles like a colossal bat."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Filch mistakenly fires the cannon as Cedric swallows hard. In the tent, Harry sits alone, nervous. He enters a rocky, circular arena, where Ron and Hermione stand in the cheering crowd. Resembling a gladiator, Harry moves toward a golden egg. A dragon's tail knocks him down, then blasts fire. Harry climbs a rock, avoiding the dragon tethered by a chain. It lashes its tail, throwing him onto the rocks. The Hungarian Horntail flaps its wings as Harry dodges flames, causing the audience to flinch, while Karkaroff laughs. As the dragon approaches, Harry seeks cover and spots his broomstick arriving. Harry leaps onto his Firebolt amid cheers, with the dragon breaking free and pursuing him. Escaping through the stands, Harry narrowly avoids a tower near Hogwarts. The dragon vanishes, then suddenly appears, knocking him from his broom. Harry lands on a roof, grabbing a parapet as the dragon settles nearby. Clinging to a spiked pinnacle, it snaps, and Harry falls to a windowsill. As the dragon advances, tiles dislodge like a giant bat."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Filch, whose clumsiness is legendary, accidentally fires the cannon, causing Cedric to swallow hard with nervous anticipation as he takes a deep, calming breath. Meanwhile, within the confines of the competitors’ tent, Harry sits all by himself, engulfed in a state of anxious trepidation. Soon, Harry walks out onto a circular arena meticulously carved from the rugged and rocky hillside, enclosed by a towering stone wall. High above, in the wooden terraces, Ron and Hermione stand among the excited, cheering spectators. In that charged moment, Harry seems to embody the spirit of a gladiator in an ancient Roman arena, as he cautiously surveys his surroundings and moves towards the gleaming golden egg positioned amid the gray-toned rocks. Suddenly, he is knocked off his feet by the forceful impact of the dragon's powerful tail, the massive head and formidable body of the creature covered with sharp, lethal spikes, as it releases a blast of scorching flame.\n\nActing swiftly, Harry leaps to safety by climbing up a high rock, while the tethered dragon lunges to the limit of its lengthy chain, lashing out in sheer anger and giving Harry a vicious blow with its powerful tail, sending him sprawling onto the rocks below. The ferocious Hungarian Horntail flaps its enormous, leathery wings as Harry scrambles to his feet and narrowly dodges another incendiary burst of flame. The crowd collectively flinches at the sight, while Karkaroff laughs at the spectacle. As the dragon flaps menacingly towards him, Harry climbs out of its immediate range, but with relentless determination, it lunges after him, baring its sharp, threatening teeth. Seeking refuge behind a massive rock, Harry catches sight of his trusty broomstick zooming towards him, even as the dragon unleashes yet another blast of flame. Seizing the moment, Harry leaves the relative safety of the rock, leaps away from the fearsome dragon, and expertly jumps onto his Firebolt as it swoops down into the arena, encouraged by the cheers of his supportive friends. \n\nIn its fury, the dragon stretches its neck to break the binding chain, ultimately freeing itself. With the enraged dragon hot on his trail, Harry zooms around the expansive arena and bursts out through the stands, flying just above the heads of bewildered onlookers. The dragon’s wings tear through the canopy, scattering professors who scramble to their feet in shock, as Rita Skeeter hurriedly straightens her spectacles. Continuously pursued by the dragon, Harry flies over the expanse of the valley towards the looming school, narrowly avoiding a catastrophic collision with a tall stone tower. The dragon launches itself after him as Harry swoops low over Hogwarts, the faint mist rising beneath him. As he flies, Harry looks back over his shoulder, only to find no trace of the dragon. As he rounds one of the tall towers, the dragon suddenly appears and knocks him off his speeding broomstick, causing Harry to fall onto a stiff roof and hurtle downwards. He manages to stop his fall by grabbing onto a narrow parapet with desperate urgency. \n\nThe dragon then settles on a nearby turret as Harry dangles precariously from the parapet, his gloved hands clutching a spiked pinnacle, while he spots his broomstick far below. The relentless dragon scrabbles across the turret onto the roof above Harry, and as the pinnacle snaps, Harry plunges onto a windowsill, hanging on desperately as the sill begins to collapse under his weight, while the dragon claws its way across the roof towards him, dislodging tiles like an enormous, ominous bat."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Filch, whose clumsiness and lack of coordination are almost legendary in their notoriety, inadvertently sets off the cannon, an act that causes Cedric to swallow audibly with a mix of anxiety and anticipation, prompting him to take a deep, calming breath in an effort to steady his nerves. At the same time, within the enclosed space of the competitors' tent, Harry finds himself sitting in complete solitude, enveloped in a palpable state of anxious trepidation and foreboding. Before long, Harry makes his way out onto a circular arena that has been meticulously carved from the rugged and rocky hillside, a space enclosed by imposing, towering stone walls. High above, in the wooden terraces filled with excited and cheering spectators, Ron and Hermione stand among the throng. In that charged and electrifying moment, Harry seemingly embodies the spirit of a gladiator from an ancient Roman arena, as he carefully and cautiously surveys his surroundings, gradually moving towards the gleaming golden egg that is positioned amid the gray-toned array of rocks. Suddenly, he is knocked off his feet by the forceful and powerful impact of the dragon's tail, the creature's massive head and formidable body covered with menacing sharp spikes, as it unleashes a blast of scorching, fiery flame.\n\nActing with remarkable speed and agility, Harry leaps to safety by climbing swiftly up a high rock, while the tethered dragon lunges ferociously to the limit of its lengthy chain, lashing out in sheer, unbridled anger and delivering a vicious blow with its powerful tail, sending Harry sprawling painfully onto the rocks below. The fierce Hungarian Horntail flaps its enormous, leathery wings threateningly as Harry scrambles to his feet and narrowly dodges another incendiary burst of fiery flame. The crowd collectively flinches and winces at the sight, while Karkaroff laughs derisively at the spectacle. As the dragon menacingly flaps its wings towards him, Harry climbs desperately out of its immediate range, but with relentless determination, the dragon lunges after him, baring its sharp and threatening teeth. Seeking refuge behind a massive rock, Harry catches sight of his trusty broomstick zooming towards him, even as the dragon unleashes yet another fiery blast of flame. Seizing the opportune moment, Harry leaves the relative safety of the rock, leaps away from the fearsome dragon, and expertly jumps onto his Firebolt as it swoops down dramatically into the arena, buoyed by the encouraging cheers of his supportive friends.\n\nIn an overwhelming surge of fury, the dragon stretches its neck to the utmost to break the binding chain, ultimately freeing itself from its confines. With the enraged dragon hotly pursuing him on his trail, Harry zooms around the expansive arena and bursts out through the stands, flying just above the heads of the bewildered and astonished onlookers. The dragon’s wings tear destructively through the canopy, scattering professors who scramble to their feet in shock, while Rita Skeeter hurriedly straightens her spectacles in a flustered manner. Continuously pursued by the relentless dragon, Harry flies over the vast expanse of the valley towards the looming and imposing school, narrowly avoiding a catastrophic collision with a tall stone tower. The dragon launches itself with fierce intensity after him as Harry swoops low over Hogwarts, the faint mist rising beneath him like a spectral presence. As he flies, Harry looks back over his shoulder, only to his surprise, he finds no trace of the dragon. Just as he rounds one of the tall towers, the dragon suddenly appears unexpectedly and knocks him off his speeding broomstick, causing Harry to plummet onto a stiff roof and hurtle dangerously downwards. He manages to stop his fall by grabbing onto a narrow parapet with a desperate sense of urgency.\n\nThe dragon then settles with ominous intent on a nearby turret as Harry dangles precariously from the parapet, his gloved hands clutching tightly to a spiked pinnacle, while he spots his broomstick far below, seeming almost out of reach. The relentless dragon scrabbles menacingly across the turret onto the roof above where Harry precariously hangs, and as the pinnacle snaps with a loud crack, Harry plunges onto a windowsill, hanging on desperately as the fragile sill begins to crumble and collapse under his weight, while the dragon claws its way across the roof towards him, dislodging tiles with ease, like an enormous and ominous bat intent on its prey."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Filch unintentionally sets off the cannon, creating a loud explosion that echoes through the air, causing Cedric to swallow hard, his Adam's apple bobbing visibly as he takes a deep, calming breath to steady his nerves. Meanwhile, inside the competitors' tent, Harry sits alone, enveloped in a thick cloud of nervous anticipation, his mind racing with thoughts of the challenge ahead. Rising from his seat, he gathers his courage and steps out into the open, moving purposefully into the circular arena that has been painstakingly carved from the rugged hillside, and is encircled by an imposing stone wall. Above, the wooden terraces brim with spectators, including Ron and Hermione, who stand amidst the enthusiastic crowd, cheering fervently. Harry, with a bearing reminiscent of a gladiator in an ancient Roman arena, cautiously surveys his surroundings, his eyes focused on the gleaming golden egg resting among the gray, unyielding rocks. Suddenly, the air is violently disturbed as the dragon's massive tail, bristling with deadly spikes, strikes him with tremendous force, sending him sprawling to the ground while the creature lets loose a fiery blast. Reacting swiftly, Harry leaps to his feet and seeks refuge atop a towering rock as the dragon, straining against its long chain, meets its limit and lashes out with fury, delivering a brutal blow that sends Harry tumbling onto the rocky terrain below. The Hungarian Horntail spreads its enormous leathery wings menacingly as Harry scrambles upright, narrowly evading another searing gout of flame, an action that causes the audience to collectively recoil while Karkaroff, in contrast, laughs with twisted amusement. As the dragon flaps closer, Harry ascends quickly, moving out of its immediate reach, though the beast lunges in pursuit, displaying its menacing teeth. Seeking shelter, Harry hides behind a large, protective rock, his eyes catching sight of his reliable broomstick, the Firebolt, zipping towards him with urgent speed as the dragon unleashes yet another fiery breath. Emerging from his cover, Harry deftly evades the dragon's furious attacks and leaps onto the Firebolt as it gracefully swoops down, entering the arena, accompanied by the jubilant cheers and support of his friends. Incensed, the dragon stretches its neck to its limit, breaking free from its chains and soaring freely into the sky. With the dragon in hot pursuit, Harry accelerates around the arena, bursting out through the stands, flying over the heads of the astonished audience, as the dragon's wings tear through the canopy, scattering professors who hurriedly regain their footing, while a startled Rita Skeeter readjusts her spectacles. As the chase intensifies, Harry races over the valley towards the school, expertly maneuvering to avoid a collision with a tall, imposing stone tower. The relentless dragon launches itself after him as Harry glides low over Hogwarts, slipping through the mist that rises gently from the grounds. Checking over his shoulder mid-flight, Harry realizes the dragon has momentarily vanished from view. However, as he navigates around one of the school’s towers, the dragon suddenly reemerges, striking with such force that Harry is unseated, plummeting onto a stiff roof, where he tumbles downward, stopping his rapid descent by desperately grasping onto a narrow parapet with all his strength. The dragon perches menacingly on a turret close by, as Harry dangles precariously, his gloved hands tightly gripping a spiked pinnacle, casting a desperate glance at his broomstick lying far below. Meanwhile, the dragon methodically claws its way across the turret, advancing onto the roof above him like a monstrous bat, dislodging tiles as it goes. Just as the pinnacle gives way and snaps, Harry plunges down onto a windowsill, barely maintaining his grip as even this support begins to yield, collapsing beneath his weight, while the dragon continues its relentless approach, tearing across the roof in pursuit."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Filch inadvertently fires the cannon, prompting Cedric to brace himself, while Harry, in nervous trepidation, awaits alone in the competitors' tent. Emerging into a circular arena surrounded by stone walls, Harry appears gladiatorial as he cautiously approaches a gleaming golden egg among the rocks. A dragon knocks him off his feet with its tail, prompting Harry to seek refuge on a high rock. The tethered creature lashes out, flinging him back down, while the crowd reacts with a mix of flinching and laughter. As the dragon looms closer, Harry takes cover and spots his broomstick approaching. He darts out, leaps onto his Firebolt, and escapes the broken chain-released dragon, flying over the arena and startling onlookers and professors alike. Pursued over the valley, Harry narrowly avoids a tower and skims low over Hogwarts, momentarily losing sight of the dragon. When it reappears, it knocks him off his broom, sending him into a precarious fall. Harry clings to a parapet, watching his broomstick below, and as the pinnacle breaks, he lands on a windowsill. The dragon, clawing its way across the roof, dislodges tiles as Harry hangs on, underscoring the perilous chase."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Filch, the caretaker of Hogwarts known for his strict adherence to rules, fires the cannon by mistake as Cedric Diggory, a respected and talented student from Hufflepuff, swallows hard and takes a deep breath, while in the competitors' tent, Harry sits alone in nervous trepidation, aware of the high stakes in the Triwizard Tournament. Harry walks out into a circular arena hewn from the rocky hillside of the Hogwarts grounds and surrounded by a stone wall reminiscent of ancient amphitheaters. High in the wooden terraces, Ron and Hermione stand amongst the cheering spectators, eager to support their friend. Harry resembles a gladiator in a Roman arena, once used for public spectacles and combat, as he glances around cautiously and moves towards a gleaming golden egg standing amongst the gray rocks, a coveted prize in the tournament. He is knocked off his feet by the force of the dragon's tail, the massive head and body of which are covered with sharp, lethal spikes like those of the feared Hungarian Horntail, as it blasts flame. Harry leaps for safety up a high rock, while the tethered dragon flies to the end of its long chain, a magical restraint used for safety, and lashes out angrily, giving Harry a vicious blow with its tail, flinging him onto the rocks below. The Hungarian Horntail, one of the most dangerous dragon breeds known for its ferocity, flaps its huge leathery wings as Harry scrambles to his feet and dodges another burst of flame, causing the crowd to flinch and Karkaroff, the shifty headmaster of Durmstrang, to laugh. As the dragon flaps towards him, Harry climbs out of range, but it lunges after him, baring its teeth, sharp and menacing. Taking shelter behind a huge rock, Harry sees his trusty broomstick, the Firebolt known for its unmatched speed and maneuverability, zooming towards him while the dragon belches out another burst of flame. Harry leaves the rock, leaps away from the dragon, and jumps onto his Firebolt as it swoops down into the arena, with his friends cheering him on with hopeful faces. The angry dragon stretches out its neck, breaking the chain, and the creature flies free. Followed by the furious dragon, Harry zooms around the arena, bursting out through the stands over the heads of the startled onlookers, wings tearing through the canopy and scattering professors who scramble to their feet as Rita Skeeter, the notorious journalist with a penchant for sensationalism, straightens her spectacles. Pursued by the dragon, Harry flies over the valley towards the school, narrowly avoiding colliding with a tall stone tower, a part of the ancient Hogwarts architecture. The dragon launches after him as Harry swoops low over Hogwarts, with a faint mist rising from the Black Lake below. As he flies, Harry checks over his shoulder, but the dragon is nowhere to be seen, providing a brief moment of relief. As Harry rounds one of the towers, the dragon appears and knocks him off his broomstick, causing Harry to fall onto a stiff roof, the worn shingles threatening to give way, and hurtle downwards, stopping his fall by grabbing desperately onto a narrow parapet, his heart racing. The dragon settles on a nearby turret, its scales gleaming menacingly, as Harry dangles from the parapet, his gloved hands clutching a spiked pinnacle, seeing his broomstick far below, a vital tool now out of reach. The dragon scrabbles across the turret onto the roof above Harry, and as the pinnacle snaps, Harry plunges down onto a windowsill, hanging on desperately as the sill collapses under him, while the dragon claws its way across the roof towards him, dislodging tiles like a colossal bat, a terrifying sight against the darkening sky."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The dragon scrabbles across the turret onto the roof above Harry and as the pinnacle snaps Harry plunges down onto a windowsill hanging on desperately as the sill collapses under him while the dragon claws its way across the roof towards him dislodging tiles like a colossal bat Filch fires the cannon by mistake as Cedric swallows hard and takes a deep breath Harry walks out into a circular arena hewn from the rocky hillside and surrounded by a stone wall The Hungarian Horntail flaps its huge leathery wings as Harry scrambles to his feet and dodges another burst of flame causing the crowd to flinch and Karkaroff to laugh while in the competitors' tent Harry sits alone in nervous trepidation High in the wooden terraces Ron and Hermione stand amongst the cheering spectators The angry dragon stretches out its neck breaking the chain and the creature flies free while in the competitors' tent Harry sits alone in nervous trepidation Harry walks out into a circular arena hewn from the rocky hillside and surrounded by a stone wall High in the wooden terraces Ron and Hermione stand amongst the cheering spectators Harry resembles a gladiator in a Roman arena as he glances around cautiously and moves towards a gleaming golden egg standing amongst the gray rocks He is knocked off his feet by the force of the dragon's tail the massive head and body of which are covered with sharp lethal spikes as it blasts flame Harry leaps for safety up a high rock while the tethered dragon flies to the end of its long chain and lashes out angrily giving Harry a vicious blow with its tail flinging him onto the rocks below The Hungarian Horntail flaps its huge leathery wings as Harry scrambles to his feet and dodges another burst of flame causing the crowd to flinch and Karkaroff to laugh As the dragon flaps towards him Harry climbs out of range but it lunges after him baring its teeth Taking shelter behind a huge rock Harry sees his trusty broomstick zooming towards him while the dragon belches out another burst of flame Harry leaves the rock leaps away from the dragon and jumps onto his Firebolt as it swoops down into the arena with his friends cheering him on Harry leaves the rock leaps away from the dragon and jumps onto his Firebolt as it swoops down into the arena with his friends cheering him on The angry dragon stretches out its neck breaking the chain and the creature flies free As Harry rounds one of the towers the dragon appears and knocks him off his broomstick causing Harry to fall onto a stiff roof and hurtle downwards stopping his fall by grabbing desperately onto a narrow parapet As the dragon flaps towards him Harry climbs out of range but it lunges after him baring its teeth Followed by the furious dragon Harry zooms around the arena bursting out through the stands over the heads of the startled onlookers wings tearing through the canopy and scattering professors who scramble to their feet as Rita Skeeter straightens her spectacles Pursued by the dragon Harry flies over the valley towards the school narrowly avoiding colliding with a tall stone tower The dragon launches after him as Harry swoops low over Hogwarts with a faint mist rising As he flies Harry checks over his shoulder but the dragon is nowhere to be seen As Harry rounds one of the towers the dragon appears and knocks him off his broomstick causing Harry to fall onto a stiff roof and hurtle downwards stopping his fall by grabbing desperately onto a narrow parapet Filch fires the cannon by mistake as Cedric swallows hard and takes a deep breath The dragon settles on a nearby turret as Harry dangles from the parapet his gloved hands clutching a spiked pinnacle seeing his broomstick far below The dragon scrabbles across the turret onto the roof above Harry and as the pinnacle snaps Harry plunges down onto a windowsill hanging on desperately as the sill collapses under him while the dragon claws its way across the roof towards him dislodging tiles like a colossal bat"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Filch fires the cannon by mistake as Cedric swallows hard and takes a deep breath. while in the competitors' tent Harry sits alone in nervous trepidation. Harry walks out into a circular arena hewn from the rocky hillside and surrounded by a stone wall. High in the wooden terraces Ron and Hermione stand amongst the cheering spectators. Harry resembles a gladiator in a Roman arena as he glances around cautiously and moves towards a gleaming golden egg standing amongst the gray rocks. He is knocked off his feet by the force of the dragon's tail the massive head and body of which are covered with sharp lethal spikes. as it blasts flame Harry leaps for safety up a high rock while the tethered dragon flies to the end of its long chain and lashes out angrily giving Harry a vicious blow with its tail flinging him onto the rocks below. The Hungarian Horntail flaps its huge leathery wings as Harry scrambles to his feet and dodges another burst of flame causing the crowd to flinch and Karkaroff to laugh. As the dragon flaps towards him Harry climbs out of range but it lunges after him baring its teeth. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Taking shelter behind a huge rock Harry sees his trusty broomstick zooming towards him while the dragon belches out another burst of flame. Harry leaves the rock leaps away from the dragon and jumps onto his Firebolt as it swoops down into the arena with his friends cheering him on. The angry dragon stretches out its neck breaking the chain and the creature flies free. Followed by the furious dragon Harry zooms around the arena bursting out through the stands over the heads of the startled onlookers wings tearing through the canopy and scattering professors who scramble to their feet as Rita Skeeter straightens her spectacles. Pursued by the dragon Harry flies over the valley towards the school narrowly avoiding colliding with a tall stone tower. The dragon launches after him as Harry swoops low over Hogwarts with a faint mist rising. As he flies Harry checks over his shoulder but the dragon is nowhere to be seen. As Harry rounds one of the towers the dragon appears and knocks him off his broomstick causing Harry to fall onto a stiff roof and hurtle downwards stopping his fall by grabbing desperately onto a narrow parapet. The dragon settles on a nearby turret as Harry dangles from the parapet his gloved hands clutching a spiked pinnacle seeing his broomstick far below. The dragon scrabbles across the turret onto the roof above Harry and as the pinnacle snaps Harry plunges down onto a windowsill hanging on desperately as the sill collapses under him while the dragon claws its way across the roof towards him dislodging tiles like a colossal bat."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Filch fires the cannon by mistake as Cedric swallows hard and takes a deep breath. while in the competitors' tent Harry sits alone in nervous trepidation. Harry walks out into a circular arena hewn from the rocky hillside and surrounded by a stone wall. High in the wooden terraces Ron and Hermione stand amongst the cheering spectators. Harry resembles a gladiator in a Roman arena as he glances around cautiously and moves towards a gleaming golden egg standing amongst the gray rocks. He is knocked off his feet by the force of the dragon's tail the massive head and body of which are covered with sharp lethal spikes. as it blasts flame Harry leaps for safety up a high rock while the tethered dragon flies to the end of its long chain and lashes out angrily giving Harry a vicious blow with its tail flinging him onto the rocks below. The Hungarian Horntail flaps its huge leathery wings as Harry scrambles to his feet and dodges another burst of flame causing the crowd to flinch and Karkaroff to laugh. As the dragon flaps towards him Harry climbs out of range but it lunges after him baring its teeth. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Taking shelter behind a huge rock Harry sees his trusty broomstick zooming towards him while the dragon belches out another burst of flame. Harry leaves the rock leaps away from the dragon and jumps onto his Firebolt as it swoops down into the arena with his friends cheering him on. The angry dragon stretches out its neck breaking the chain and the creature flies free. Followed by the furious dragon Harry zooms around the arena bursting out through the stands over the heads of the startled onlookers wings tearing through the canopy and scattering professors who scramble to their feet as Rita Skeeter straightens her spectacles. Pursued by the dragon Harry flies over the valley towards the school narrowly avoiding colliding with a tall stone tower. The dragon launches after him as Harry swoops low over Hogwarts with a faint mist rising. As he flies Harry checks over his shoulder but the dragon is nowhere to be seen. As Harry rounds one of the towers the dragon appears and knocks him off his broomstick causing Harry to fall onto a stiff roof and hurtle downwards stopping his fall by grabbing desperately onto a narrow parapet. The dragon settles on a nearby turret as Harry dangles from the parapet his gloved hands clutching a spiked pinnacle seeing his broomstick far below. The dragon scrabbles across the turret onto the roof above Harry and as the pinnacle snaps Harry plunges down onto a windowsill hanging on desperately as the sill collapses under him while the dragon claws its way across the roof towards him dislodging tiles like a colossal bat."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Filch fires the cannon by mistake as Cedric swallows hard and takes a deep breath. while in the competitors' tent Harry sits alone in nervous trepidation. Harry walks out into a circular arena hewn from the rocky hillside and surrounded by a stone wall. High in the wooden terraces Ron and Hermione stand amongst the cheering spectators. Harry resembles a gladiator in a Roman arena as he glances around cautiously and moves towards a gleaming golden egg standing amongst the gray rocks. The dragon launches after him as Harry swoops low over Hogwarts with a faint mist rising. As he flies Harry checks over his shoulder but the dragon is nowhere to be seen. As Harry rounds one of the towers the dragon appears and knocks him off his broomstick causing Harry to fall onto a stiff roof and hurtle downwards stopping his fall by grabbing desperately onto a narrow parapet. The dragon settles on a nearby turret as Harry dangles from the parapet his gloved hands clutching a spiked pinnacle seeing his broomstick far below. The dragon scrabbles across the turret onto the roof above Harry and as the pinnacle snaps Harry plunges down onto a windowsill hanging on desperately as the sill collapses under him while the dragon claws its way across the roof towards him dislodging tiles like a colossal bat."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Filch fires the cannon by mistake as Cedric swallows hard and takes a deep breath. while in the competitors' tent Harry sits alone in nervous trepidation. The dragon settles on a nearby turret as Harry dangles from the parapet his gloved hands clutching a spiked pinnacle seeing his broomstick far below. The dragon scrabbles across the turret onto the roof above Harry and as the pinnacle snaps Harry plunges down onto a windowsill hanging on desperately as the sill collapses under him while the dragon claws its way across the roof towards him dislodging tiles like a colossal bat."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Snape fires the cannon by mistake as Neville swallows hard and takes a deep breath, while in the competitors' tent, Hermione sits alone in nervous trepidation. Hermione walks out into a circular arena hewn from the rocky hillside and surrounded by a stone wall. High in the wooden terraces, Dobby and McGonagall stand amongst the cheering spectators. Hermione resembles a gladiator in a Roman arena as she glances around cautiously and moves towards a gleaming golden egg standing amongst the gray rocks. She is knocked off her feet by the force of the dragon's tail, the massive head and body of which are covered with sharp, lethal spikes, as it blasts flame. Hermione leaps for safety up a high rock, while the tethered dragon flies to the end of its long chain and lashes out angrily, giving Hermione a vicious blow with its tail, flinging her onto the rocks below. The Hungarian Horntail flaps its huge leathery wings as Hermione scrambles to her feet and dodges another burst of flame, causing the crowd to flinch and Moody to laugh. As the dragon flaps towards her, Hermione climbs out of range, but it lunges after her, baring its teeth. Taking shelter behind a huge rock, Hermione sees her trusty broomstick zooming towards her while the dragon belches out another burst of flame. Hermione leaves the rock, leaps away from the dragon, and jumps onto her Cleansweep as it swoops down into the arena, with her friends cheering her on. The angry dragon stretches out its neck, breaking the chain, and the creature flies free. Followed by the furious dragon, Hermione zooms around the arena, bursting out through the stands over the heads of the startled onlookers, wings tearing through the canopy and scattering ghosts who scramble to their feet as Hagrid straightens his spectacles. Pursued by the dragon, Hermione flies over the valley towards the school, narrowly avoiding colliding with a tall stone tower. The dragon launches after her as Hermione swoops low over Hogwarts, with a faint mist rising. As she flies, Hermione checks over her shoulder, but the dragon is nowhere to be seen. As Hermione rounds one of the towers, the dragon appears and knocks her off her broomstick, causing Hermione to fall onto a stiff roof and hurtle downwards, stopping her fall by grabbing desperately onto a narrow parapet. The dragon settles on a nearby turret as Hermione dangles from the parapet, her gloved hands clutching a spiked pinnacle, seeing her broomstick far below. The dragon scrabbles across the turret onto the roof above Hermione, and as the pinnacle snaps, Hermione plunges down onto a windowsill, hanging on desperately as the sill collapses under her, while the dragon claws its way across the roof towards her, dislodging tiles like a colossal bat."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Filch fires the slingshot by mistake as Cedric swallows hard and takes a deep breath, while in the competitors' caravan, Harry sits alone in nervous trepidation. Harry walks out into a square courtyard hewn from the sandy desert and surrounded by a wooden fence. High in the metal bleachers, Ron and Hermione stand amongst the cheering spectators. Harry resembles a gladiator in a Greek amphitheater as he glances around cautiously and moves towards a gleaming silver trumpet standing amongst the brown boulders. He is knocked off his feet by the force of the turtle's flipper, the massive head and body of which are covered with sharp, lethal barnacles, as it blasts sand. Harry leaps for safety up a tall dune, while the tethered turtle slides to the end of its long rope and lashes out angrily, giving Harry a vicious blow with its flipper, flinging him onto the dunes below. The Hungarian Horntail flaps its huge feathery wings as Harry scrambles to his feet and dodges another burst of sand, causing the crowd to flinch and Karkaroff to laugh. As the turtle flaps towards him, Harry climbs out of range, but it lunges after him, baring its beak. Taking shelter behind a massive boulder, Harry sees his trusty skateboard zooming towards him while the turtle burps out another burst of sand. Harry leaves the boulder, leaps away from the turtle, and jumps onto his Firebolt as it swoops down into the courtyard, with his friends cheering him on. The angry turtle stretches out its neck, breaking the rope, and the creature slides free. Followed by the furious turtle, Harry zooms around the courtyard, bursting out through the fences over the heads of the startled onlookers, wings tearing through the awning and scattering professors who scramble to their feet as Rita Skeeter straightens her hat. Pursued by the turtle, Harry glides over the field towards the school, narrowly avoiding colliding with a tall wooden tower. The turtle launches after him as Harry swoops low over Hogwarts, with a faint breeze rising. As he flies, Harry checks over his shoulder, but the turtle is nowhere to be seen. As Harry rounds one of the towers, the turtle appears and knocks him off his skateboard, causing Harry to fall onto a stiff roof and hurtle downwards, stopping his fall by grabbing desperately onto a narrow railing. The turtle settles on a nearby outpost as Harry dangles from the railing, his gloved hands clutching a spiked weathervane, seeing his skateboard far below. The turtle scrabbles across the outpost onto the roof above Harry, and as the weathervane snaps, Harry plunges down onto a balcony, hanging on desperately as the balcony collapses under him, while the turtle claws its way across the roof towards him, dislodging shingles like a colossal bird."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Filch triggers the siren by mistake as Cedric frowns deeply and holds his breath, while in the competitors' tent, Harry waits alone in anxious anticipation. Harry strides out into a circular arena carved from the rocky hillside and bordered by a stone wall. High in the wooden terraces, Ron and Hermione stand amongst the excited spectators. Harry resembles a gladiator in a Roman arena as he peers around cautiously and steps towards a sparkling golden egg nestled amongst the gray rocks. He is swept off his feet by the force of the dragon's tail, the massive head and body of which are adorned with sharp, lethal spikes, as it exhales smoke. Harry climbs for safety up a high rock, while the tethered dragon lunges to the end of its long chain and swipes out angrily, giving Harry a fierce knock with its tail, tossing him onto the rocks below. The Hungarian Horntail rustles its huge leathery wings as Harry jumps to his feet and skitters away from another burst of flame, causing the crowd to gasp and Karkaroff to snigger. As the dragon charges towards him, Harry steps out of range, but it snaps after him, baring its teeth. Taking cover behind a huge rock, Harry spots his trusty broomstick sailing towards him while the dragon spits out another burst of flame. Harry leaves the rock, bounds away from the dragon, and clambers onto his Firebolt as it dives down into the arena, with his friends rooting for him. The angry dragon stretches out its neck, releasing the chain, and the creature glides free. Followed by the furious dragon, Harry darts around the arena, shooting out through the stands over the heads of the bewildered onlookers, wings ripping through the canopy and scattering professors who scurry to their feet as Rita Skeeter adjusts her spectacles. Chased by the dragon, Harry veers over the valley towards the school, narrowly avoiding smashing into a tall stone tower. The dragon rushes after him as Harry dips low over Hogwarts, with a faint mist drifting. As he flies, Harry glances over his shoulder, but the dragon is nowhere to be found. As Harry rounds one of the towers, the dragon emerges and swipes him off his broomstick, causing Harry to slide onto a rigid roof and plummet downwards, stopping his descent by clasping desperately onto a narrow parapet. The dragon rests on a nearby turret as Harry dangles from the parapet, his gloved hands gripping a spiked pinnacle, seeing his broomstick far below. The dragon scrambles across the turret onto the roof above Harry, and as the pinnacle snaps, Harry tumbles down onto a windowsill, clutching on desperately as the sill crumbles under him, while the dragon crawls its way across the roof towards him, knocking away tiles like a colossal bat."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Blitzen ignites the chandelier by mistake as Penelope swallows hard and takes a deep breath, while in the baker's alcove, Felix sits alone in nervous trepidation. Felix walks out into a circular courtyard hewn from the crystal glacier and surrounded by a marble fence. High in the aluminum bleachers, Oliver and Daphne stand amongst the cheering dancers. Felix resembles a sailor in a Greek coliseum as he glances around cautiously and moves towards a gleaming silver teapot standing amongst the white cliffs. He is knocked off his feet by the force of the lion's paw, the massive head and body of which are covered with sharp, lethal spines, as it blasts lightning. Felix leaps for safety up a tall tree, while the tethered lion flies to the end of its long rope and lashes out angrily, giving Felix a vicious blow with its paw, flinging him onto the cliffs below. The Siberian Gryphon flaps its huge leathery wings as Felix scrambles to his feet and dodges another burst of lightning, causing the choir to flinch and Dumbledore to laugh. As the lion flaps towards him, Felix climbs out of range, but it lunges after him, baring its claws. Taking shelter behind a huge tree, Felix sees his trusty skateboard zooming towards him while the lion belches out another burst of lightning. Felix leaves the tree, leaps away from the lion, and jumps onto his Nimbus as it swoops down into the courtyard, with his siblings cheering him on. The angry lion stretches out its neck, breaking the rope, and the creature flies free. Followed by the furious lion, Felix zooms around the courtyard, bursting out through the stalls over the heads of the startled gardeners, wings tearing through the canopy and scattering minstrels who scramble to their feet as Lucy Goosey straightens her magnifying glass. Pursued by the lion, Felix flies over the canyon towards the bakery, narrowly avoiding colliding with a tall steel spire. The lion launches after him as Felix swoops low over Camelot, with a faint fog rising. As he flies, Felix checks over his shoulder, but the lion is nowhere to be seen. As Felix rounds one of the spires, the lion appears and knocks him off his skateboard, causing Felix to fall onto a narrow balcony and hurtle downwards, stopping his fall by grabbing desperately onto a slender weathervane. The lion settles on a nearby mast as Felix dangles from the weathervane, his gloved hands clutching a rusty gargoyle, seeing his skateboard far below. The lion scrabbles across the mast onto the balcony above Felix, and as the gargoyle snaps, Felix plunges down onto a windowsill, hanging on desperately as the sill collapses under him, while the lion claws its way across the balcony towards him, dislodging bricks like a colossal tarantula."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Binky triggers the alarm by mistake as Neville gulps loudly and exhales slowly, while in the competitors' tent, Luna stands alone in anxious anticipation. Luna heads out into a circular garden carved from the rocky hillside and enclosed by a stone barrier. High in the wooden stands, Draco and Ginny perch amongst the enthusiastic spectators. Luna resembles a warrior in a medieval tournament as she peers around warily and advances towards a shimmering silver trophy resting amongst the gray stones. She is knocked off her perch by the impact of the chimera's wing, the massive head and body of which are adorned with jagged, deadly spikes, as it spews smoke. Luna vaults for safety up a high ledge, while the tethered chimera bounds to the end of its long chain and strikes out furiously, delivering a savage hit with its wing, sending her crashing onto the stones below. The Norwegian Ridgeback spreads its vast leathery wings as Luna scampers to her feet and evades another plume of smoke, causing the crowd to wince and Trelawney to giggle. As the chimera bounds towards her, Luna climbs out of reach, but it pounces after her, brandishing its claws. Taking refuge behind a large stone, Luna spots her reliable skateboard zooming towards her while the chimera coughs out another plume of smoke. Luna leaves the stone, bounds away from the chimera, and lands onto her Silver Streak as it dips down into the garden, with her companions encouraging her onward. The furious chimera extends its neck, snapping the chain, and the creature bounds free. Trailed by the enraged chimera, Luna whirls around the garden, dashing out through the bleachers over the heads of the astonished audience, wings ripping through the awning and scattering students who leap to their feet as Colin Creevey adjusts his binoculars. Chased by the chimera, Luna soars over the meadow towards the castle, narrowly dodging a collision with a tall stone spire. The chimera launches after her as Luna glides low over Hogwarts, with a gentle mist ascending. As she flies, Luna glances over her shoulder, but the chimera is nowhere to be found. As Luna curves around one of the spires, the chimera surfaces and unseats her from her skateboard, causing Luna to plummet onto a rugged roof and tumble downwards, halting her descent by grasping frantically onto a narrow cornice. The chimera perches on a nearby turret as Luna dangles from the cornice, her gloved hands gripping a jagged finial, spotting her skateboard far below. The chimera scrambles across the turret onto the roof above Luna, and as the finial cracks, Luna plunges down onto a ledge, clinging desperately as the ledge crumbles under her, while the chimera claws its way across the roof towards her, dislodging slates like a monstrous moth."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Filch ignites the lantern by mistake as Cedric gulps nervously and exhales slowly, while in the competitors' tent, Harry lounges alone in anxious anticipation. Harry strides out into a rectangular garden carved from the sandy beach and bordered by a wooden fence. High in the metal bleachers, Ron and Hermione lean amongst the applauding onlookers. Harry resembles a knight in a medieval joust as he peers around alertly and strides towards a shimmering silver vase resting amongst the brown pebbles. He is knocked off his feet by the force of the lion's mane, the massive head and body of which are covered with smooth, sleek scales, as it blows smoke. Harry darts for cover up a high boulder, while the tethered lion leaps to the end of its short rope and pounces angrily, giving Harry a sharp nudge with its paw, hurling him onto the ground below. The Hungarian Horntail flutters its tiny feathered wings as Harry clambers to his feet and evades another cloud of smoke, causing the crowd to wince and Karkaroff to chuckle. As the lion bounds towards him, Harry shuffles out of reach, but it lunges after him, snapping its jaws. Taking cover behind a massive boulder, Harry sees his reliable bicycle racing towards him while the lion spews out another cloud of smoke. Harry abandons the boulder, vaults away from the lion, and hops onto his Firebolt as it glides down into the garden, with his friends applauding him. The furious lion extends its paws, snapping the rope, and the creature leaps free. Followed by the enraged lion, Harry speeds around the garden, bursting out through the stands over the heads of the surprised spectators, horns tearing through the canopy and scattering professors who jump to their feet as Rita Skeeter adjusts her hat. Chased by the lion, Harry pedals over the meadow towards the castle, narrowly missing crashing into a tall stone pillar. The lion bounds after him as Harry glides low over Hogwarts, with a faint fog swirling. As he rides, Harry checks over his shoulder, but the lion is nowhere to be seen. As Harry circles one of the pillars, the lion emerges and shoves him off his bicycle, causing Harry to tumble onto a flat roof and slide downwards, stopping his fall by clutching desperately onto a narrow beam. The lion lands on a nearby tower as Harry dangles from the beam, his gloved hands gripping a sharp spire, seeing his bicycle far below. The lion scrambles across the tower onto the roof above Harry, and as the spire cracks, Harry plummets down onto a ledge, gripping on desperately as the ledge crumbles beneath him, while the lion claws its way across the roof towards him, dislodging shingles like a gigantic eagle."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Pinecone ignites the lantern by error as Gregory chews gently and inhales a shallow gulp, while in the artist's garage, Neville lies together in relaxed anticipation. Neville dances out into a triangular plaza carved from the sandy desert and enclosed by a glass fence. Low in the metal bleachers, Luna and Ginny sit amidst the silent wanderers. Neville resembles a knight in an Arthurian castle as he peers around nervously and dances towards a shimmering silver coin resting amidst the blue pebbles. He is lifted off his toes by the breeze of the lion's paw, the tiny ears and whiskers of which are coated with smooth, harmless feathers, as it whispers wind. Neville slides for cover up a low hill, while the chained lion leaps to the start of its short leash and purrs peacefully, giving Neville a gentle hug with its paw, flinging him onto the sand nearby. The Tibetan Tabby flutters its small silky ears as Neville stretches to his feet and dances around another puff of wind, causing the group to cheer and Umbridge to cry. As the lion flutters towards him, Neville climbs out of reach, but it hops after him, closing its lips. Finding cover behind a small stone, Neville notices his trusty umbrella floating towards him while the lion spits out another puff of wind. Neville leaves the stone, spins away from the lion, and hops onto his Nimbus as it floats down into the plaza, with his buddies singing him on. The gentle lion retracts its whiskers, snapping the leash, and the feline paces clear. Chased by the playful lion, Neville drifts around the plaza, jumping out through the stalls over the heads of the relaxed dreamers, fins slicing through the mist and calming students who fall to their knees as Luna Lovegood adjusts her bracelet. Followed by the lion, Neville glides over the meadow towards the fortress, barely missing touching a short wooden spire. The lion jumps after him as Neville drifts low over Hogwarts, with a heavy fog settling. As he drifts, Neville peers over his elbow, but the lion is nowhere to be found. As Neville curves one of the spires, the lion arises and nudges him off his umbrella, causing Neville to float onto a soft leaf and sail upwards, halting his flight by holding lazily onto a wide beam. The lion nestles on a distant peak as Neville hangs from the beam, his bare feet relaxing against a wide ledge, noticing his umbrella far above. The lion rolls across the peak onto the path below Neville, and as the ledge shatters, Neville drifts gently onto a trampoline, balancing calmly as the fabric splinters beneath him, while the lion crawls its way along the path towards him, moving cushions like a gentle breeze."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Filch accidentally fires a cannon as Cedric nervously prepares, while Harry, alone in the competitors' tent, anticipates his challenge. Entering a circular arena, Harry approaches a golden egg among the rocks, resembling a gladiator. A dragon, the Hungarian Horntail, attacks, knocking Harry off his feet, and he narrowly escapes its fiery blasts. As the crowd reacts, Harry climbs a rock for cover. His broomstick arrives just in time, allowing him to dodge the dragon's fury. Breaking free of its chain, the dragon chases Harry around the arena and over the school grounds. Harry narrowly avoids obstacles, but the dragon catches up, knocking him from his broomstick. He falls onto a roof, clinging desperately to a narrow parapet. As the dragon advances, Harry plunges onto a windowsill, struggling to hold on as the creature dislodges tiles, looming like a colossal bat."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The dragon scrabbles across the turret onto the roof above Harry and as the pinnacle snaps Harry plunges down onto a windowsill hanging on desperately as the sill collapses under him while the dragon claws its way across the roof towards him dislodging tiles like a colossal bat The dragon settles on a nearby turret as Harry dangles from the parapet his gloved hands clutching a spiked pinnacle seeing his broomstick far below As Harry rounds one of the towers the dragon appears and knocks him off his broomstick causing Harry to fall onto a stiff roof and hurtle downwards stopping his fall by grabbing desperately onto a narrow parapet As he flies Harry checks over his shoulder but the dragon is nowhere to be seen The dragon launches after him as Harry swoops low over Hogwarts with a faint mist rising Pursued by the dragon Harry flies over the valley towards the school narrowly avoiding colliding with a tall stone tower Followed by the furious dragon Harry zooms around the arena bursting out through the stands over the heads of the startled onlookers wings tearing through the canopy and scattering professors who scramble to their feet as Rita Skeeter straightens her spectacles The angry dragon stretches out its neck breaking the chain and the creature flies free Harry leaves the rock leaps away from the dragon and jumps onto his Firebolt as it swoops down into the arena with his friends cheering him on Taking shelter behind a huge rock Harry sees his trusty broomstick zooming towards him while the dragon belches out another burst of flame As the dragon flaps towards him Harry climbs out of range but it lunges after him baring its teeth The Hungarian Horntail flaps its huge leathery wings as Harry scrambles to his feet and dodges another burst of flame causing the crowd to flinch and Karkaroff to laugh as it blasts flame Harry leaps for safety up a high rock while the tethered dragon flies to the end of its long chain and lashes out angrily giving Harry a vicious blow with its tail flinging him onto the rocks below He is knocked off his feet by the force of the dragon's tail the massive head and body of which are covered with sharp lethal spikes Harry resembles a gladiator in a Roman arena as he glances around cautiously and moves towards a gleaming golden egg standing amongst the gray rocks High in the wooden terraces Ron and Hermione stand amongst the cheering spectators Harry walks out into a circular arena hewn from the rocky hillside and surrounded by a stone wall while in the competitors' tent Harry sits alone in nervous trepidation Filch fires the cannon by mistake as Cedric swallows hard and takes a deep breath"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The dragon launches after him as Harry swoops low over Hogwarts with a faint mist rising Pursued by the dragon Harry flies over the valley towards the school narrowly avoiding colliding with a tall stone tower Harry resembles a gladiator in a Roman arena as he glances around cautiously and moves towards a gleaming golden egg standing amongst the gray rocks Taking shelter behind a huge rock Harry sees his trusty broomstick zooming towards him while the dragon belches out another burst of flame He is knocked off his feet by the force of the dragon's tail the massive head and body of which are covered with sharp lethal spikes As he flies Harry checks over his shoulder but the dragon is nowhere to be seen The dragon settles on a nearby turret as Harry dangles from the parapet his gloved hands clutching a spiked pinnacle seeing his broomstick far below as it blasts flame Harry leaps for safety up a high rock while the tethered dragon flies to the end of its long chain and lashes out angrily giving Harry a vicious blow with its tail flinging him onto the rocks below Followed by the furious dragon Harry zooms around the arena bursting out through the stands over the heads of the startled onlookers wings tearing through the canopy and scattering professors who scramble to their feet as Rita Skeeter straightens her spectacles As Harry rounds one of the towers the dragon appears and knocks him off his broomstick causing Harry to fall onto a stiff roof and hurtle downwards stopping his fall by grabbing desperately onto a narrow parapet Harry leaves the rock leaps away from the dragon and jumps onto his Firebolt as it swoops down into the arena with his friends cheering him on while in the competitors' tent Harry sits alone in nervous trepidation The angry dragon stretches out its neck breaking the chain and the creature flies free Harry walks out into a circular arena hewn from the rocky hillside and surrounded by a stone wall The dragon scrabbles across the turret onto the roof above Harry and as the pinnacle snaps Harry plunges down onto a windowsill hanging on desperately as the sill collapses under him while the dragon claws its way across the roof towards him dislodging tiles like a colossal bat The Hungarian Horntail flaps its huge leathery wings as Harry scrambles to his feet and dodges another burst of flame causing the crowd to flinch and Karkaroff to laugh As the dragon flaps towards him Harry climbs out of range but it lunges after him baring its teeth Filch fires the cannon by mistake as Cedric swallows hard and takes a deep breath High in the wooden terraces Ron and Hermione stand amongst the cheering spectators"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Harry leaves the rock leaps away from the dragon and jumps onto his Firebolt as it swoops down into the arena with his friends cheering him on The angry dragon stretches out its neck breaking the chain and the creature flies free Followed by the furious dragon Harry zooms around the arena bursting out through the stands over the heads of the startled onlookers wings tearing through the canopy and scattering professors who scramble to their feet as Rita Skeeter straightens her spectacles Pursued by the dragon Harry flies over the valley towards the school narrowly avoiding colliding with a tall stone tower The dragon launches after him as Harry swoops low over Hogwarts with a faint mist rising As he flies Harry checks over his shoulder but the dragon is nowhere to be seen As Harry rounds one of the towers the dragon appears and knocks him off his broomstick causing Harry to fall onto a stiff roof and hurtle downwards stopping his fall by grabbing desperately onto a narrow parapet The dragon settles on a nearby turret as Harry dangles from the parapet his gloved hands clutching a spiked pinnacle seeing his broomstick far below The dragon scrabbles across the turret onto the roof above Harry and as the pinnacle snaps Harry plunges down onto a windowsill hanging on desperately as the sill collapses under him while the dragon claws its way across the roof towards him dislodging tiles like a colossal bat Filch fires the cannon by mistake as Cedric swallows hard and takes a deep breath while in the competitors' tent Harry sits alone in nervous trepidation Harry walks out into a circular arena hewn from the rocky hillside and surrounded by a stone wall High in the wooden terraces Ron and Hermione stand amongst the cheering spectators Harry resembles a gladiator in a Roman arena as he glances around cautiously and moves towards a gleaming golden egg standing amongst the gray rocks He is knocked off his feet by the force of the dragon's tail the massive head and body of which are covered with sharp lethal spikes as it blasts flame Harry leaps for safety up a high rock while the tethered dragon flies to the end of its long chain and lashes out angrily giving Harry a vicious blow with its tail flinging him onto the rocks below The Hungarian Horntail flaps its huge leathery wings as Harry scrambles to his feet and dodges another burst of flame causing the crowd to flinch and Karkaroff to laugh As the dragon flaps towards him Harry climbs out of range but it lunges after him baring its teeth Taking shelter behind a huge rock Harry sees his trusty broomstick zooming towards him while the dragon belches out another burst of flame"
        }
      ]
    }
  ]
}