{
  "ground_truth": "Harry staggers in with Dudley, who, about to be sick, points weakly at Harry as an owl hits the ceiling and falls in a flurry of feathers, then flies off. The envelope speaks, and Uncle Vernon smirks with glee. Under cover of darkness, the Dursleys smuggle Dudley into the car with a blanket over his head while Mrs. Figg watches from her window opposite and waves. In his bedroom, Harry thumps the wardrobe in anger and frustration, causing a photograph beside his owl's cage to fall onto the carpet, which he picks up, then sits on his bed to look at his parents dancing together in the moving photograph. He places it carefully on his bedside table beside a half-eaten plate of food. Cedric's face looms out of the darkness, sweating with fear, and Harry relives his terror as a flash of green light engulfs Cedric, who falls lifeless, followed by Voldemort's blank eyes staring out from his bony, snake-like skull, and Harry jerks awake to a streak of moonlight across his pillow. He lies as if in a trance, his lips moving, then turns his head as he hears a scraping sound. Still fully dressed, Harry reaches for his glasses and puts them on as he looks towards the door, where the key is slowly turning in the lock. Harry grabs his wand and sits up as the key continues to turn and falls to the floor. With a dazzling flash, the door flies open, revealing five people lit by a wand standing in the doorway, one of whom Harry recognizes. Moody leads them all outside, taps his stick, and a broomstick flies into each person's hand as Mrs. Figg watches them soar away high above Privet Drive. The twinkling lights of central London are spread out below as Kingsley, a wizard in African robes, flies in front, following the line of the River Thames as it winds through the city. They fly low, cloaks flying like a flight of huge bats skimming the surface of the shimmering water, swooping by HMS Belfast and heading upriver towards Westminster. Harry flies close beside Nymphadora Tonks as a pleasure boat on a nighttime cruise heads straight toward them, and Nymphadora steers to the right of it, with Harry to the left. They pass the flood-lit houses of Parliament, reflected in the water like a huge ocean liner, while a refuse lorry passes a garden in the middle of the London square. Moody leads them from the garden into the street, facing a terrace of Georgian houses, where he strikes the pavement, and one of the houses in front of them moves to the left, causing Harry's jaw to drop as an extra house slides into the space and balconies slot into position, with the people next door remaining oblivious as they continue watching television.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Harry totters in with Dudley, who, about to be ill, gestures feebly at Harry as an owl strikes the roof and descends in a flurry of plumes, then soars away. The packet speaks, and Uncle Vernon grins with delight. Under cover of darkness, the Dursleys sneak Dudley into the car with a cover over his head while Mrs. Figg observes from her window opposite and waves. In his bedroom, Harry pounds the wardrobe in rage and annoyance, causing a picture beside his owl's cage to drop onto the carpet, which he picks up, then sits on his bed to gaze at his parents dancing together in the moving picture. He sets it carefully on his bedside table beside a half-eaten plate of food. Cedric's visage looms out of the gloom, sweating with dread, and Harry relives his horror as a flash of jade light engulfs Cedric, who falls motionless, followed by Voldemort's blank eyes staring out from his gaunt, snake-like skull, and Harry jerks awake to a beam of moonlight across his pillow. He lies as if in a stupor, his lips moving, then turns his head as he hears a scraping noise. Still fully dressed, Harry reaches for his spectacles and puts them on as he looks towards the entrance, where the key is slowly turning in the lock. Harry seizes his wand and sits up as the key continues to turn and falls to the flooring. With a brilliant flash, the portal flies open, revealing five figures lit by a wand standing in the entryway, one of whom Harry identifies. Moody directs them all outside, taps his staff, and a broomstick flies into each individual's hand as Mrs. Figg watches them soar away high above Privet Drive. The sparkling lights of central London are spread out below as Kingsley, a sorcerer in African garments, flies in front, following the line of the River Thames as it curls through the metropolis. They fly low, cloaks flying like a fleet of huge bats skimming the surface of the shining water, swooping by HMS Belfast and heading upriver towards Westminster. Harry flies close beside Nymphadora Tonks as a pleasure vessel on a nighttime voyage heads directly toward them, and Nymphadora steers to the right of it, with Harry to the left. They pass the flood-lit buildings of Parliament, mirrored in the water like a huge ocean liner, while a refuse truck passes a garden in the middle of the London square. Moody guides them from the garden into the street, facing a terrace of Georgian houses, where he strikes the pavement, and one of the houses in front of them shifts to the left, causing Harry's jaw to drop as an additional house slides into the space and balconies slot into place, with the people next door remaining oblivious as they continue watching television."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Dudley, about to be sick, is pointed at weakly by him as an owl is hit by the ceiling and is fallen upon in a flurry of feathers, then it flies off. The envelope is spoken by, and glee is smirked with by Uncle Vernon. Under cover of darkness, Dudley is smuggled into the car by the Dursleys with a blanket over his head while Mrs. Figg watches from her window opposite and waves. In his bedroom, the wardrobe is thumped by Harry in anger and frustration, causing a photograph beside his owl's cage to be fallen onto the carpet, which is picked up by him, then he sits on his bed to look at his parents dancing together in the moving photograph. It is carefully placed by him on his bedside table beside a half-eaten plate of food. Cedric's face looms out of the darkness, sweating with fear, and terror is relived by Harry as a flash of green light engulfs Cedric, who is caused to fall lifeless, followed by Voldemort's blank eyes staring out from his bony, snake-like skull, and a streak of moonlight across his pillow jerks Harry awake. He lies as if in a trance, his lips moving, then he turns his head as a scraping sound is heard by him. Still fully dressed, glasses are reached for by Harry and put on as he looks towards the door, where the key is slowly turned in the lock. Harry grabs his wand and sits up as the key continues to turn and falls to the floor. With a dazzling flash, five people are revealed by the door flying open, lit by a wand standing in the doorway, one of whom is recognized by Harry. They are all led outside by Moody, who taps his stick, and a broomstick flies into each person's hand as Mrs. Figg watches them soar away high above Privet Drive. Below them, the twinkling lights of central London are spread out as Kingsley, a wizard in African robes, flies in front, following the line of the River Thames as it winds through the city. They fly low, their cloaks flying like a flight of huge bats skimming the surface of the shimmering water, swooping by HMS Belfast and heading upriver towards Westminster. Harry flies close beside Nymphadora Tonks as a pleasure boat on a nighttime cruise heads straight toward them, and it is steered to the right by Nymphadora, with Harry steering to the left. The flood-lit houses of Parliament, reflected in the water like a huge ocean liner, are passed by them, while a refuse lorry passes a garden in the middle of the London square. From the garden, they are led by Moody into the street, facing a terrace of Georgian houses, where he strikes the pavement, and one of the houses in front of them moves to the left, causing Harry's jaw to drop as an extra house is slid into the space and balconies are slotted into position, while the people next door remain oblivious as they continue watching television."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Harry staggers in with Dudley, who, feeling ill, weakly points at Harry as an owl hits the ceiling and flies off in a flurry of feathers. The envelope speaks, making Uncle Vernon smirk. Under cover of darkness, the Dursleys smuggle Dudley into the car with a blanket over his head, while Mrs. Figg watches and waves from her window. In his room, Harry angrily thumps the wardrobe, causing a photograph to fall, which he picks up and sits on his bed to view his parents dancing. He sets it on his bedside table next to a half-eaten plate of food. Cedric's terrified face looms in the dark as Harry relives his fear and sees Cedric fall lifeless with a green flash, followed by Voldemort's blank eyes from a snake-like skull. Harry jerks awake to moonlight across his pillow, lies in a trance, then hears a scraping sound. Fully dressed, Harry puts on his glasses and watches the key turn in the lock. He grabs his wand as the door bursts open with a flash, revealing five wand-lit people, one familiar. Moody leads them outside, taps his stick, and broomsticks fly to each hand as Mrs. Figg watches them soar above Privet Drive. London lights twinkle below as Kingsley, in African robes, leads along the Thames. Cloaks flying like bats, they skim the water, pass HMS Belfast, and head to Westminster. Harry flies beside Nymphadora Tonks, avoiding a cruise boat, and they pass Parliament reflecting in the water. Moody leads them from a garden to a street with Georgian houses, striking the pavement to reveal an extra house sliding into view, leaving neighbors oblivious as they watch TV."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Harry staggers in with Dudley, who points weakly at Harry as an owl hits the ceiling, falls, and flies off. The envelope speaks, and Uncle Vernon smirks. At night, the Dursleys smuggle Dudley into the car under a blanket while Mrs. Figg watches and waves. In his room, Harry angrily thumps the wardrobe, dislodging a photograph of his parents, which he picks up and places beside his half-eaten food. Cedric's fearful face appears in darkness, and Harry relives his terror as a green flash engulfs Cedric. Awaking to moonlight, Harry, in a trance, hears a scraping sound, dons his glasses, and sees the key turn in the lock. He grabs his wand as the door opens, revealing five people, including someone he recognizes. Moody leads them outside, and broomsticks fly into their hands as Mrs. Figg watches them soar above Privet Drive. The lights of London spread below as Kingsley, in African robes, flies ahead, following the Thames. They fly low, cloaks billowing, past HMS Belfast towards Westminster. Harry and Nymphadora Tonks avoid a cruise boat, passing the flood-lit Parliament reflected in the water. Moody leads them into a square, strikes the pavement, and a house slides into view, unnoticed by the neighbors watching TV."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Harry, appearing quite unsteady, enters alongside Dudley, who is on the verge of being sick. Dudley weakly gestures towards Harry just as an owl, in a sudden burst of motion, strikes the ceiling and then plunges amidst a flurry of feathers before regaining composure and flying off. Meanwhile, an envelope suddenly begins to speak, causing Uncle Vernon to smirk with unmistakable glee. Under the protective shroud of darkness, the Dursleys sneak Dudley into the car, concealing him with a blanket draped over his head, all the while Mrs. Figg looks on from her window directly across the street, waving as she observes the scene. Later, in his bedroom, Harry vents his anger and frustration by forcefully thumping the wardrobe, which results in a photograph, previously resting beside his owl's cage, to tumble onto the carpet. He retrieves it and then settles onto his bed, gazing at the moving picture of his parents dancing together. Carefully, he places the photo on his bedside table next to a half-eaten plate of food. Suddenly, out of the darkness, Cedric's face looms, sweating intensely with fear, as Harry is compelled to relive the horrifying memory of the flash of sickly green light that overtakes Cedric, leaving him lifeless. Following this, Voldemort's emotionless eyes stare hauntingly from his bony, snake-like skull, and with a jolt, Harry awakens, finding a streak of moonlight cast across his pillow. He lies there, seemingly in a trance, his lips moving silently. His attention shifts as he hears a scraping noise. Still wearing his clothes, Harry reaches for his glasses, placing them on his face, and turns his gaze toward the door, observing the key that is slowly turning in the lock. Quickly, Harry seizes his wand and sits upright as the key continues its revolution and finally falls to the floor. With a dazzling flash of light, the door bursts open, illuminating five figures in the doorway, their faces revealed by wand light, one of whom is known to Harry. Moody leads the group outside, tapping his stick, causing a broomstick to magically appear in each person's hand. As Mrs. Figg watches, they all soar high above Privet Drive, heading into the night. The twinkling lights of central London spread out below them as they fly, with Kingsley, a wizard clad in traditional African robes, taking the lead. He guides them alongside the winding River Thames as it snakes through the heart of the city. They swoop low, their cloaks billowing like the wings of gigantic bats skimming the surface of the shimmering water, passing by landmarks such as HMS Belfast and making their way upriver towards Westminster. Harry keeps close to Nymphadora Tonks as they navigate around a pleasure boat on a nighttime cruise, with Nymphadora maneuvering to the right and Harry veering to the left. They glide by the flood-lit Houses of Parliament, mirrored in the water below like an enormous ocean liner. A refuse lorry crosses a garden situated in the midst of the London square. Led by Moody, they proceed from the garden into the street, coming face to face with a row of Georgian houses. Moody taps the pavement, and astonishingly, one of the houses before them begins to shift to the left. Harry's jaw drops in amazement as an extra house seamlessly slides into the vacant space, with balconies clicking into place, while the neighboring residents remain blissfully unaware, engrossed in watching television."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Harry, appearing somewhat unsteady and not quite himself, makes his entrance alongside Dudley, who is clearly on the brink of being sick. Dudley, looking pale and weak, gestures feebly toward Harry at the exact moment when an owl, with a sudden burst of frantic motion, collides with the ceiling. Amidst a dramatic flurry of feathers, the owl manages to regain its composure and flies off in a hurry. Meanwhile, an envelope, in an unexpected twist, begins to speak aloud, provoking a smirk of unmistakable glee from Uncle Vernon. Cloaked under the shroud of protective darkness, the Dursleys manage to sneak Dudley into the car, going to the extent of concealing him with a blanket carefully draped over his head. During this covert operation, Mrs. Figg, observing intently from her window directly across the street, waves as she watches the entire scene unfold. Later, within the confines of his bedroom, Harry vents his pent-up anger and frustration by forcefully thumping the wardrobe, which causes a photograph, previously resting beside his owl's cage, to tumble onto the carpeted floor. He retrieves the photo and then settles himself onto his bed, watching the moving image of his parents as they dance together, seemingly in joy. He carefully places the cherished photo on his bedside table next to a half-eaten plate of food. Suddenly, emerging from the darkness, Cedric's face looms, drenched in sweat and consumed with fear, as Harry is compelled to relive the terrifying memory of the flash of sickly green light that surrounds Cedric, leaving him lifeless. Following this haunting vision, Voldemort's emotionless eyes stare menacingly from his bony, snake-like skull, and with a sudden jolt, Harry awakens to find a streak of moonlight casting an eerie glow across his pillow. He lies there, seemingly caught in a trance-like state, his lips moving silently without sound. As his attention shifts, he hears a distinct scraping noise. Still dressed in his clothes, Harry reaches for his glasses, placing them on his face, and turns his gaze toward the door, where he observes the key slowly turning in the lock. With quick reflexes, Harry seizes his wand and sits upright as the key completes its revolution and finally falls to the floor. With a dazzling flash of light, the door bursts open, dramatically illuminating five figures standing in the doorway, their faces revealed by the light of their wands, one of whom is recognizable to Harry. Moody leads the assembled group outside, tapping his stick to conjure a broomstick, which magically appears in each person's hand. As Mrs. Figg continues to watch, they all take to the sky, soaring high above Privet Drive and heading into the night. The twinkling lights of central London spread out below them as they fly, with Kingsley, a wizard dressed in traditional African robes, taking the lead. He guides them expertly alongside the winding River Thames as it snakes through the very heart of the city. They swoop low, their cloaks billowing and fluttering like the wings of gigantic bats skimming the surface of the shimmering water, passing by prominent landmarks such as HMS Belfast and making their way upstream towards Westminster. Harry stays close to Nymphadora Tonks as they skillfully navigate around a pleasure boat on its nighttime cruise, with Nymphadora maneuvering smoothly to the right and Harry veering confidently to the left. They glide past the flood-lit Houses of Parliament, which are perfectly mirrored in the water below like the reflection of an enormous ocean liner. A refuse lorry moves across a garden situated in the midst of the London square. Led by Moody, they proceed from the tranquil garden into the bustling street, coming face to face with a row of Georgian houses. Moody taps the pavement with precision, and astonishingly, one of the houses before them begins to shift seamlessly to the left. With amazement, Harry's jaw drops as an extra house slides effortlessly into the previously vacant space, its balconies clicking into place with precision, while the neighboring residents remain blissfully unaware, wholly engrossed in watching television."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Harry enters the room, staggering slightly alongside Dudley, who is visibly pale and on the verge of being sick. Dudley weakly lifts his hand to point at Harry just as an owl crashes into the ceiling, sending a flurry of feathers everywhere before it regains its balance and flies away. An envelope begins to speak, capturing everyone's attention, and Uncle Vernon responds by smirking with satisfaction, his face lighting up with glee. As darkness blankets the area outside, the Dursleys carefully navigate their way to the car, ensuring they remain unseen, as they discreetly cover Dudley's head with a blanket and usher him inside; across the street, Mrs. Figg watches intently from her window and gives a subtle wave. Inside his bedroom, Harry channels his anger and frustration into a single act by thumping the wardrobe, sending vibrations through the room that cause a photograph, precariously perched beside his owl's cage, to topple onto the carpet. Harry bends down to retrieve the photograph and then settles onto his bed, his eyes focusing on the image of his parents dancing together in the animated photograph. He places the photograph with care onto his bedside table next to a half-eaten plate of food. Suddenly, Cedric's fearful face emerges from the darkness in Harry's memory, sweat clinging to his brow, as Harry is pulled back into the chilling moment when a flash of green light consumes Cedric, leaving him lifeless. Voldemort's blank, piercing eyes follow from a skull resembling that of a snake, causing Harry to jolt awake in his room to find a streak of moonlight casting across his pillow. He lies there momentarily entranced, his lips moving silently, before a scraping noise draws his attention, prompting him to turn his head. Still dressed in his clothes from earlier, Harry reaches for his glasses, carefully placing them on his face to bring the door into focus, where he notices the key slowly turning in the lock. Instinctively, he grabs his wand and pushes himself upright, watching as the key completes its turn and drops to the floor with a soft thud. A blinding flash illuminates the room as the door swings open wide, revealing five figures standing at the threshold with a wand lighting their faces, and among them is someone Harry recognizes. Moody steps forward, leading the group outside, where he taps his stick, causing broomsticks to fly into everyone's hands as Mrs. Figg continues to observe from her window, watching the group soar high above Privet Drive. Below them, the luminous display of central London unfolds, with Kingsley, dressed in African robes, flying at the front, tracing the path of the River Thames as it snakes through the cityscape. Flying low, their cloaks billow behind them like enormous bats skimming the water's surface as they pass notable landmarks such as the HMS Belfast and head upriver toward the iconic silhouette of Westminster. Harry remains close to Nymphadora Tonks, and as a pleasure boat on a nighttime cruise approaches directly in their path, Nymphadora veers to the right while Harry shifts to the left, ensuring they safely avoid it. The duo glides past the floodlit Houses of Parliament, their grand reflection resembling a massive ocean liner on the water's surface, while down below, a refuse lorry rumbles past a garden nestled within a London square. Moody directs their flight from this garden onto a dimly lit street facing a line of Georgian houses. Striking the pavement with determination, he activates a magical mechanism that causes one of the houses before them to shift to the left, revealing an extra house that seamlessly slides into place, with balconies aligning perfectly, all while the oblivious neighbors continue engrossed in their television program, unaware of the magical transformation taking place next door."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Harry staggers in with Dudley, who weakly points at him just as an owl hits the ceiling, falls, then flies off again. The envelope speaks, and Uncle Vernon smirks. Under darkness, the Dursleys discreetly smuggle Dudley to the car, hidden under a blanket, while Mrs. Figg watches from her window and waves. In his room, Harry slams the wardrobe in frustration, causing a photograph to fall. He picks it up, sits on his bed, and gazes at the moving image of his parents dancing, then places it beside his half-eaten food. Harry is haunted by flashes of Cedric's death and Voldemort's terrifying gaze, jerking awake in the moonlight. He hears a noise, reaches for his glasses, and sees the key turning in the lock. Grabbing his wand, he sits up as the door bursts open, revealing five people with wands. Among them is one he recognizes. Moody leads them outside, taps his stick, and broomsticks fly into their hands as they soar above Privet Drive with Mrs. Figg watching. They glide over London, led by Kingsley along the Thames, their cloaks billowing as they swoop past landmarks like HMS Belfast and Westminster. Harry flies alongside Nymphadora Tonks as they navigate around a pleasure boat, passing the illuminated Houses of Parliament reflected on the water. Guided by Moody, they reach a Georgian terrace where he strikes the pavement, revealing a hidden house that astonishes Harry while the neighbors remain unaware, engrossed in their television."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Harry staggers in with Dudley, who, about to be sick, points weakly at Harry just as an owl crashes into the ceiling, a typical occurrence in their magical household, and after a flurry of feathers, the bird flies off. The envelope, charmed to deliver a vocal message, speaks, and Uncle Vernon smirks with glee at the prospect of thwarting Harry's plans. Under cover of darkness, the Dursleys, Harry's neglectful relatives who dislike anything abnormal, smuggle Dudley into the car with a blanket over his head while Mrs. Figg, a neighbor and a member of the wizarding world's watchdog network known as the Order of the Phoenix, watches from her window opposite and waves. In his bedroom, Harry thumps the wardrobe in anger and frustration, causing a photograph beside his owl's cage, an important link to his past kept in a cage for his pet Hedwig, to fall onto the carpet, which he picks up, then sits on his bed to look at his parents dancing together joyfully in the moving photograph. He places it carefully on his bedside table beside a half-eaten plate of food, a reminder of his hurried lifestyle. Cedric's face looms out of the darkness, a haunting memory from the Triwizard Tournament, sweating with fear, and Harry relives his terror as a flash of green light, the infamous Killing Curse cast by Voldemort, engulfs Cedric, who falls lifeless, followed by Voldemort's blank eyes staring out from his bony, snake-like skull, and Harry jerks awake to a streak of moonlight across his pillow. He lies as if in a trance, his lips moving in a muttered incantation, then turns his head as he hears a scraping sound. Still fully dressed, Harry reaches for his glasses and puts them on as he looks towards the door, where the key is slowly turning in the lock, reminiscent of many secretive escapades at the Dursley home. Harry grabs his wand, his constant companion in dangerous situations, and sits up as the key continues to turn and falls to the floor. With a dazzling flash, the door flies open, revealing five people lit by a wand standing in the doorway, one of whom Harry recognizes as Alastor \"Mad-Eye\" Moody, the grizzled ex-Auror known for his magical eye. Moody leads them all outside, taps his stick, a simple spell causing a broomstick to fly into each person's hand, as Mrs. Figg watches them soar away high above Privet Drive, which is part of the quiet suburb where Harry grew up. The twinkling lights of central London, a bustling metropolis rich in history, are spread out below as Kingsley Shacklebolt, a respected Auror in African robes, flies in front, following the line of the River Thames as it winds gracefully through the city. They fly low, cloaks flying like a flight of huge bats skimming the surface of the shimmering water, swooping by HMS Belfast, a famous WWII warship turned museum, and heading upriver towards Westminster, home to the seat of the UK's government. Harry flies close beside Nymphadora Tonks, a young Auror known for her Metamorphmagus abilities, as a pleasure boat on a nighttime cruise heads straight toward them, and Nymphadora steers to the right of it, with Harry to the left. They pass the flood-lit Houses of Parliament, the iconic government building, reflected in the water like a huge ocean liner, while a refuse lorry, a common sight in the city streets, passes a garden in the middle of the London square. Moody leads them from the garden into the street, facing a terrace of Georgian houses, an architectural style popular during the reigns of the British monarchs George I-IV, where he strikes the pavement, and one of the houses in front of them moves to the left with the help of a concealed magical enchantment, causing Harry's jaw to drop as an extra house, known as the secret headquarters of the Order of the Phoenix, slides into the space and balconies slot into position, with the people next door remaining oblivious as they continue watching television."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Harry staggers in with Dudley who about to be sick points weakly at Harry as an owl hits the ceiling and falls in a flurry of feathers then flies off. The envelope speaks and Uncle Vernon smirks with glee. Under cover of darkness the Dursleys smuggle Dudley into the car with a blanket over his head while Mrs Figg watches from her window opposite and waves. In his bedroom Harry thumps the wardrobe in anger and frustration causing a photograph beside his owl's cage to fall onto the carpet which he picks up then sits on his bed to look at his parents dancing together in the moving photograph. He places it carefully on his bedside table beside a halfeaten plate of food. Cedric's face looms out of the darkness sweating with fear and Harry relives his terror. as a flash of green light engulfs Cedric who falls lifeless followed by Voldemort's blank eyes staring out from his bony snakelike skull and Harry jerks awake to a streak of moonlight across his pillow. He lies as if in a trance his lips moving then turns his head as he hears a scraping sound. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. Still fully dressed Harry reaches for his glasses and puts them on as he looks towards the door where the key is slowly turning in the lock. Harry grabs his wand and sits up as the key continues to turn and falls to the floor. With a dazzling flash the door flies open revealing five people lit by a wand standing in the doorway one of whom Harry recognizes. Moody leads them all outside taps his stick and a broomstick flies into each person's hand as Mrs Figg watches them soar away high above Privet Drive. The twinkling lights of central London are spread out below as Kingsley a wizard in African robes flies in front following the line of the River Thames as it winds through the city. They fly low cloaks flying like a flight of huge bats skimming the surface of the shimmering water swooping by HMS Belfast and heading upriver towards Westminster. Harry flies close beside Nymphadora Tonks as a pleasure boat on a nighttime cruise heads straight toward them and Nymphadora steers to the right of it with Harry to the left. They pass the floodlit houses of Parliament reflected in the water like a huge ocean liner while a refuse lorry passes a garden in the middle of the London square. Moody leads them from the garden into the street facing a terrace of Georgian houses where he strikes the pavement and one of the houses in front of them moves to the left causing Harry's jaw to drop as an extra house slides into the space and balconies slot into position with the people next door remaining oblivious as they continue watching television."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Harry staggers in with Dudley who about to be sick points weakly at Harry as an owl hits the ceiling and falls in a flurry of feathers then flies off. The envelope speaks and Uncle Vernon smirks with glee. Under cover of darkness the Dursleys smuggle Dudley into the car with a blanket over his head while Mrs Figg watches from her window opposite and waves. In his bedroom Harry thumps the wardrobe in anger and frustration causing a photograph beside his owl's cage to fall onto the carpet which he picks up then sits on his bed to look at his parents dancing together in the moving photograph. He places it carefully on his bedside table beside a halfeaten plate of food. Cedric's face looms out of the darkness sweating with fear and Harry relives his terror. as a flash of green light engulfs Cedric who falls lifeless followed by Voldemort's blank eyes staring out from his bony snakelike skull and Harry jerks awake to a streak of moonlight across his pillow. He lies as if in a trance his lips moving then turns his head as he hears a scraping sound. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Still fully dressed Harry reaches for his glasses and puts them on as he looks towards the door where the key is slowly turning in the lock. Harry grabs his wand and sits up as the key continues to turn and falls to the floor. With a dazzling flash the door flies open revealing five people lit by a wand standing in the doorway one of whom Harry recognizes. Moody leads them all outside taps his stick and a broomstick flies into each person's hand as Mrs Figg watches them soar away high above Privet Drive. The twinkling lights of central London are spread out below as Kingsley a wizard in African robes flies in front following the line of the River Thames as it winds through the city. They fly low cloaks flying like a flight of huge bats skimming the surface of the shimmering water swooping by HMS Belfast and heading upriver towards Westminster. Harry flies close beside Nymphadora Tonks as a pleasure boat on a nighttime cruise heads straight toward them and Nymphadora steers to the right of it with Harry to the left. They pass the floodlit houses of Parliament reflected in the water like a huge ocean liner while a refuse lorry passes a garden in the middle of the London square. Moody leads them from the garden into the street facing a terrace of Georgian houses where he strikes the pavement and one of the houses in front of them moves to the left causing Harry's jaw to drop as an extra house slides into the space and balconies slot into position with the people next door remaining oblivious as they continue watching television."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Harry staggers in with Dudley who about to be sick points weakly at Harry as an owl hits the ceiling and falls in a flurry of feathers then flies off. The envelope speaks and Uncle Vernon smirks with glee. Under cover of darkness the Dursleys smuggle Dudley into the car with a blanket over his head while Mrs Figg watches from her window opposite and waves. In his bedroom Harry thumps the wardrobe in anger and frustration causing a photograph beside his owl's cage to fall onto the carpet which he picks up then sits on his bed to look at his parents dancing together in the moving photograph. The twinkling lights of central London are spread out below as Kingsley a wizard in African robes flies in front following the line of the River Thames as it winds through the city. They fly low cloaks flying like a flight of huge bats skimming the surface of the shimmering water swooping by HMS Belfast and heading upriver towards Westminster. Harry flies close beside Nymphadora Tonks as a pleasure boat on a nighttime cruise heads straight toward them and Nymphadora steers to the right of it with Harry to the left. They pass the floodlit houses of Parliament reflected in the water like a huge ocean liner while a refuse lorry passes a garden in the middle of the London square. Moody leads them from the garden into the street facing a terrace of Georgian houses where he strikes the pavement and one of the houses in front of them moves to the left causing Harry's jaw to drop as an extra house slides into the space and balconies slot into position with the people next door remaining oblivious as they continue watching television."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Harry staggers in with Dudley who about to be sick points weakly at Harry as an owl hits the ceiling and falls in a flurry of feathers then flies off. The envelope speaks and Uncle Vernon smirks with glee. They pass the floodlit houses of Parliament reflected in the water like a huge ocean liner while a refuse lorry passes a garden in the middle of the London square. Moody leads them from the garden into the street facing a terrace of Georgian houses where he strikes the pavement and one of the houses in front of them moves to the left causing Harry's jaw to drop as an extra house slides into the space and balconies slot into position with the people next door remaining oblivious as they continue watching television."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Timothy wobbles in with Lester, who, on the verge of sneezing, gestures feebly at Timothy as a raven taps the curtain and tumbles in a cascade of petals, then glides away. The postcard whispers, and Aunt Judy chuckles with delight. Shrouded by twilight, the Mundays sneak Lester into the boat with a sheet over his chin while Ms. Green peeks from her doorway nearby and salutes. In his garage, Timothy bangs the chest in irritation and exasperation, causing a painting beside his frog's jar to topple onto the rug, which he scoops up, then perches on his couch to gaze at his cousins skiing together in the moving painting. He places it gingerly on his nightstand beside a half-consumed bowl of fruit. Eric's silhouette towers from the shadows, trembling with anxiety, and Timothy re-experiences his dread as a burst of red flame surrounds Eric, who slumps motionless, followed by Barnaby's vacant gaze staring out from his equine, bird-like visage, and Timothy jolts awake to a strip of starlight across his quilt. He rests as if enchanted, his fingers twitching, then turns his ear as he detects a humming noise. Still fully clothed, Timothy reaches for his binoculars and dons them as he gazes towards the hatch, where the lever is gradually spinning in the latch. Timothy snatches his cane and springs up as the lever persists to spin and clinks to the floor. With a brilliant blaze, the hatch bursts open, exposing four creatures illuminated by a torch lounging in the hallway, one of whom Timothy recognizes. Gloomy guides them all outdoors, taps his pole, and a parachute zooms into each creature's grasp as Ms. Green observes them drift away high above Maple Lane. The gleaming glow of uptown Liverpool is sprawled below as Josiah, a juggler in Aztec attire, soars ahead, tracing the path of the River Mersey as it twists through the metropolis. They glide low, capes fluttering like a squadron of massive owls skimming the expanse of the glistening stream, darting past Moorfield Station and proceeding upriver towards Kensington. Timothy soars beside Daphne Shimmer as a cargo barge on an evening voyage sails directly toward them, and Daphne veers to the left of it, with Timothy to the right. They cruise past the illuminated towers of Buckingham Palace, reflected in the liquid like a colossal cruiser, while a taxi bus navigates a grove in the core of the Liverpool plaza. Gloomy guides them from the grove into the avenue, facing a row of Victorian cottages, where he taps the roadway, and one of the cottages ahead of them shuffles to the right, prompting Timothy's mouth to gape as an additional cottage slides into the gap, and verandas snap into place, with the neighbors remaining unaware as they continue listening to radio."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Harry enters with Dudley, who is ill, as an owl crashes into the ceiling. The envelope speaks, and Uncle Vernon revels in it. At night, the Dursleys secretly drive Dudley away, observed by Mrs. Figg. In his room, Harry's anger causes a photo of his parents to fall. He dreams of Cedric's death and Voldemort's face, waking to find his door being unlocked. Prepared, he grabs his wand as the door opens, revealing five people, one familiar. Moody leads them outside, where broomsticks appear. They fly over London, with Kingsley leading along the Thames, their cloaks resembling bats. Harry flies near Nymphadora Tonks, dodging a boat. They pass Parliament, heading to a terrace of houses. Moody strikes the pavement, creating space for an extra house, astonishing Harry. The neighbors remain oblivious as they watch TV."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Moody leads them from the garden into the street facing a terrace of Georgian houses where he strikes the pavement and one of the houses in front of them moves to the left causing Harry's jaw to drop as an extra house slides into the space and balconies slot into position with the people next door remaining oblivious as they continue watching television They pass the floodlit houses of Parliament reflected in the water like a huge ocean liner while a refuse lorry passes a garden in the middle of the London square Harry flies close beside Nymphadora Tonks as a pleasure boat on a nighttime cruise heads straight toward them and Nymphadora steers to the right of it with Harry to the left They fly low cloaks flying like a flight of huge bats skimming the surface of the shimmering water swooping by HMS Belfast and heading upriver towards Westminster The twinkling lights of central London are spread out below as Kingsley a wizard in African robes flies in front following the line of the River Thames as it winds through the city Moody leads them all outside taps his stick and a broomstick flies into each person's hand as Mrs Figg watches them soar away high above Privet Drive With a dazzling flash the door flies open revealing five people lit by a wand standing in the doorway one of whom Harry recognizes Harry grabs his wand and sits up as the key continues to turn and falls to the floor Still fully dressed Harry reaches for his glasses and puts them on as he looks towards the door where the key is slowly turning in the lock He lies as if in a trance his lips moving then turns his head as he hears a scraping sound as a flash of green light engulfs Cedric who falls lifeless followed by Voldemort's blank eyes staring out from his bony snakelike skull and Harry jerks awake to a streak of moonlight across his pillow Cedric's face looms out of the darkness sweating with fear and Harry relives his terror He places it carefully on his bedside table beside a halfeaten plate of food In his bedroom Harry thumps the wardrobe in anger and frustration causing a photograph beside his owl's cage to fall onto the carpet which he picks up then sits on his bed to look at his parents dancing together in the moving photograph Under cover of darkness the Dursleys smuggle Dudley into the car with a blanket over his head while Mrs Figg watches from her window opposite and waves The envelope speaks and Uncle Vernon smirks with glee Harry staggers in with Dudley who about to be sick points weakly at Harry as an owl hits the ceiling and falls in a flurry of feathers then flies off"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The envelope speaks and Uncle Vernon smirks with glee Harry staggers in with Dudley who about to be sick points weakly at Harry as an owl hits the ceiling and falls in a flurry of feathers then flies off In his bedroom Harry thumps the wardrobe in anger and frustration causing a photograph beside his owl's cage to fall onto the carpet which he picks up then sits on his bed to look at his parents dancing together in the moving photograph Under cover of darkness the Dursleys smuggle Dudley into the car with a blanket over his head while Mrs Figg watches from her window opposite and waves Cedric's face looms out of the darkness sweating with fear and Harry relives his terror He places it carefully on his bedside table beside a halfeaten plate of food He lies as if in a trance his lips moving then turns his head as he hears a scraping sound as a flash of green light engulfs Cedric who falls lifeless followed by Voldemort's blank eyes staring out from his bony snakelike skull and Harry jerks awake to a streak of moonlight across his pillow Harry grabs his wand and sits up as the key continues to turn and falls to the floor Still fully dressed Harry reaches for his glasses and puts them on as he looks towards the door where the key is slowly turning in the lock Moody leads them all outside taps his stick and a broomstick flies into each person's hand as Mrs Figg watches them soar away high above Privet Drive With a dazzling flash the door flies open revealing five people lit by a wand standing in the doorway one of whom Harry recognizes They fly low cloaks flying like a flight of huge bats skimming the surface of the shimmering water swooping by HMS Belfast and heading upriver towards Westminster The twinkling lights of central London are spread out below as Kingsley a wizard in African robes flies in front following the line of the River Thames as it winds through the city They pass the floodlit houses of Parliament reflected in the water like a huge ocean liner while a refuse lorry passes a garden in the middle of the London square Harry flies close beside Nymphadora Tonks as a pleasure boat on a nighttime cruise heads straight toward them and Nymphadora steers to the right of it with Harry to the left Moody leads them from the garden into the street facing a terrace of Georgian houses where he strikes the pavement and one of the houses in front of them moves to the left causing Harry's jaw to drop as an extra house slides into the space and balconies slot into position with the people next door remaining oblivious as they continue watching television"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Harry grabs his wand and sits up as the key continues to turn and falls to the floor With a dazzling flash the door flies open revealing five people lit by a wand standing in the doorway one of whom Harry recognizes Moody leads them all outside taps his stick and a broomstick flies into each person's hand as Mrs Figg watches them soar away high above Privet Drive The twinkling lights of central London are spread out below as Kingsley a wizard in African robes flies in front following the line of the River Thames as it winds through the city They fly low cloaks flying like a flight of huge bats skimming the surface of the shimmering water swooping by HMS Belfast and heading upriver towards Westminster Harry flies close beside Nymphadora Tonks as a pleasure boat on a nighttime cruise heads straight toward them and Nymphadora steers to the right of it with Harry to the left They pass the floodlit houses of Parliament reflected in the water like a huge ocean liner while a refuse lorry passes a garden in the middle of the London square Moody leads them from the garden into the street facing a terrace of Georgian houses where he strikes the pavement and one of the houses in front of them moves to the left causing Harry's jaw to drop as an extra house slides into the space and balconies slot into position with the people next door remaining oblivious as they continue watching television Harry staggers in with Dudley who about to be sick points weakly at Harry as an owl hits the ceiling and falls in a flurry of feathers then flies off The envelope speaks and Uncle Vernon smirks with glee Under cover of darkness the Dursleys smuggle Dudley into the car with a blanket over his head while Mrs Figg watches from her window opposite and waves In his bedroom Harry thumps the wardrobe in anger and frustration causing a photograph beside his owl's cage to fall onto the carpet which he picks up then sits on his bed to look at his parents dancing together in the moving photograph He places it carefully on his bedside table beside a halfeaten plate of food Cedric's face looms out of the darkness sweating with fear and Harry relives his terror as a flash of green light engulfs Cedric who falls lifeless followed by Voldemort's blank eyes staring out from his bony snakelike skull and Harry jerks awake to a streak of moonlight across his pillow He lies as if in a trance his lips moving then turns his head as he hears a scraping sound Still fully dressed Harry reaches for his glasses and puts them on as he looks towards the door where the key is slowly turning in the lock"
        }
      ]
    }
  ]
}