{
  "ground_truth": "A dark narrow corridor, dimly lit and festooned with cobwebs, leads to the scene where the patterned tiles underfoot are cracked and dirty. Harry hesitates, but Moody pushes past him impatiently, followed by the others moving toward an open door at the end of the gloomy passage. Nymphadora turns and winks at Harry, but she trips over an umbrella stand. Through the open door, Harry spots Mr. Weasley, Sirius, and Lupin, and as she comes out closing the door, she hugs him warmly and looks at him closely. A house elf emerges onto the landing dragging a wooden box. It has skinny arms, a long pointed nose and ears, and wears a ragged vest, glaring spitefully at Harry. The elf stands on the box and polishes a picture frame. Harry opens a door and is nearly knocked off his feet by Hermione, with Ron standing behind her. Harry looks around the bedroom and his eyes widen as the Weasley twins dangle a magic ear over the banisters. Hermione's cat, Crookshanks, sees the ear and grabs at it with his paw, then runs off with it, chased by Fred and George. Harry embraces his godfather Sirius, who holds him close. Harry's photograph is underneath, and Sirius looks directly at Harry and winks at him. Ron sleeps peacefully, but Harry's sleep is disturbed by dreams. The scene shifts to a down escalator on the London Underground where Mr. Weasley stands stiffly holding both handrails. Nearing the bottom, he braces himself and steps off unsteadily as Harry follows him. At the barrier, Mr. Weasley copies other passengers by placing his palm on the automatic ticket reader pad, but the gate remains shut. Harry puts a ticket in the slot, and with Mr. Weasley leaning back against the gates, they open and he slips through backwards looking delighted. On street level, they find a red telephone box and step inside, as the inside of the box sinks below the surface of the pavement like a lift, with a replacement interior sliding down to fill the empty space as the box comes to a halt. Mr. Weasley opens the door and they step out into a cavernous tiled hall lined on either side with enormous fireplaces, as the telephone box lift disappears above their heads. People appear from the fireplaces in flashes of green smoke, carrying briefcases and bundles of papers, joining the throngs of other witches and wizards hurrying to work through the great underground hall. Harry follows Mr. Weasley past a fountain with huge golden statues, looking up at a gigantic silken banner floating above with a moving image of the Minister of Magic, Cornelius Fudge. They crowd into a Victorian lift with metal gates, as paper airplanes swoop around their heads. Kingsley pushes into the lift and whispers to Mr. Weasley, the gates close, and the lift moves backwards before dropping downwards.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A murky constricted passageway, faintly illuminated and adorned with cobwebs, directs to the setting where the decorated tiles beneath are fractured and filthy. Harry pauses, but Moody shoves past him restlessly, trailed by the others progressing toward an ajar portal at the conclusion of the murky corridor. Nymphadora turns and blinks at Harry, but she stumbles over an umbrella pedestal. Through the open portal, Harry discerns Mr. Weasley, Sirius, and Lupin, and as she emerges closing the portal, she embraces him affectionately and observes him carefully. A house elf appears onto the platform hauling a wooden container. It has slender limbs, a long pointed snout and ears, and wears a tattered vest, glaring maliciously at Harry. The elf stands on the container and cleanses a picture frame. Harry opens a portal and is nearly toppled over by Hermione, with Ron standing behind her. Harry glances around the sleeping chamber and his eyes widen as the Weasley twins suspend a magic auricle over the balustrade. Hermione's feline, Crookshanks, notices the auricle and clutches at it with his paw, then dashes off with it, pursued by Fred and George. Harry hugs his godfather Sirius, who holds him firmly. Harry's photograph is beneath, and Sirius gazes directly at Harry and winks at him. Ron slumbers serenely, but Harry's rest is unsettled by visions. The setting alters to a descending escalator on the London subway where Mr. Weasley stands rigidly gripping both handrails. Approaching the base, he steadies himself and steps off shakily as Harry follows him. At the barrier, Mr. Weasley mimics other travelers by placing his palm on the automatic entry reader pad, but the gate stays closed. Harry inserts a ticket in the slot, and with Mr. Weasley leaning back against the gates, they open and he slips through in reverse appearing pleased. At street level, they discover a red telephone kiosk and step within, as the inside of the kiosk descends below the level of the sidewalk like a lift, with a replacement interior sliding down to occupy the vacant area as the kiosk halts. Mr. Weasley opens the portal and they exit into a cavernous tiled chamber lined on either flank with colossal fireplaces, as the telephone kiosk lift vanishes above their heads. Individuals appear from the fireplaces in bursts of green smoke, bearing briefcases and bundles of documents, joining the crowds of other witches and wizards hastening to work through the vast belowground chamber. Harry follows Mr. Weasley past a fountain with enormous golden effigies, gazing up at a massive silken streamer floating above with a moving likeness of the Minister of Magic, Cornelius Fudge. They cram into a Victorian lift with metallic gates, as paper gliders swoop around their heads. Kingsley presses into the lift and murmurs to Mr. Weasley, the gates close, and the lift moves rearwards before plummeting downward."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A dark narrow corridor, dimly lit and festooned with cobwebs, is led through by the scene where the patterned tiles underfoot are cracked and dirty. Harry hesitates, but he is pushed past impatiently by Moody, followed by the others moving toward an open door at the end of the gloomy passage. Nymphadora turns and winks at Harry, but an umbrella stand is tripped over by her. Through the open door, Mr. Weasley, Sirius, and Lupin are spotted by Harry, and as she comes out closing the door, he is hugged warmly by her and looked at closely. A wooden box is dragged by a house elf that emerges onto the landing. It has skinny arms, a long pointed nose and ears, and wears a ragged vest, glaring spitefully at Harry. The box is stood on by the elf and a picture frame is polished. A door is opened by Harry and he is nearly knocked off his feet by Hermione, with Ron standing behind her. The bedroom is looked around by Harry and his eyes widen as a magic ear is dangled over the banisters by the Weasley twins. The ear is seen by Hermione's cat, Crookshanks, and it is grabbed at with his paw, then he runs off with it, chased by Fred and George. Sirius is embraced by Harry, who is held close. Underneath is Harry's photograph, and Sirius looks directly at Harry and winks at him. Ron sleeps peacefully, but dreams disturb Harry's sleep. The scene is shifted to a down escalator on the London Underground where both handrails are held stiffly by Mr. Weasley. Nearing the bottom, he braces himself and steps off unsteadily as he is followed by Harry. At the barrier, other passengers are copied by Mr. Weasley placing his palm on the automatic ticket reader pad, but the gate remains shut. A ticket is put in the slot by Harry, and with the gates leaned back against by Mr. Weasley, they are opened and he slips through backwards looking delighted. On street level, a red telephone box is found and stepped into by them, as the inside of the box sinks below the surface of the pavement like a lift, with a replacement interior sliding down to fill the empty space as the box comes to a halt. The door is opened by Mr. Weasley and they step out into a cavernous tiled hall lined on either side with enormous fireplaces, as the telephone box lift disappears above their heads. From the fireplaces, people appear in flashes of green smoke, carrying briefcases and bundles of papers, joining the throngs of other witches and wizards hurrying to work through the great underground hall. Mr. Weasley is followed by Harry past a fountain with huge golden statues, and he looks up at a gigantic silken banner floating above with a moving image of the Minister of Magic, Cornelius Fudge. A Victorian lift with metal gates is crowded into, as paper airplanes swoop around their heads. Kingsley pushes into the lift and whispers to Mr. Weasley, the gates are closed, and the lift is moved backwards before it drops downwards."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A dim, cobwebbed corridor leads to cracked, dirty tiles. Harry hesitates, but Moody pushes past, followed by others toward an open door. Nymphadora winks at Harry but trips over an umbrella stand. Through the door, Harry sees Mr. Weasley, Sirius, and Lupin. She hugs Harry warmly. A house elf with skinny arms, a long nose, and ragged vest glares at Harry while polishing a picture frame. Harry opens a door and is nearly knocked over by Hermione, with Ron behind her. In the bedroom, Harry sees the Weasley twins dangling a magic ear over the banisters. Crookshanks grabs it and runs, chased by Fred and George. Harry embraces Sirius, who winks at him. Ron sleeps peacefully, but Harry's dreams are troubled. The scene shifts to a London Underground escalator where Mr. Weasley stands stiffly. At the bottom, he steps off unsteadily as Harry follows. At the barrier, Mr. Weasley mimics others by placing his palm on the ticket reader, but it stays shut. Harry uses a ticket, and Mr. Weasley slips through delightedly. On street level, they enter a red telephone box, which sinks like a lift. They step into a tiled hall with fireplaces, as the box disappears above. People emerge from fireplaces in green smoke, joining the throngs of witches and wizards. Harry follows Mr. Weasley past a fountain with golden statues and a banner of Minister Cornelius Fudge. They enter a Victorian lift with paper airplanes swooping around. Kingsley joins them, whispers to Mr. Weasley, and the lift moves backward before descending."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A dim, cobwebbed corridor with cracked tiles leads to an open door. Harry hesitates, but Moody pushes past, followed by others. Nymphadora winks at Harry but trips over an umbrella stand. Through the door, Harry sees Mr. Weasley, Sirius, and Lupin. Nymphadora hugs Harry warmly. A house elf with a long nose and ears, wearing a ragged vest, glares at Harry while polishing a picture frame. Harry opens a door and is nearly knocked over by Hermione, with Ron behind her. In the bedroom, Harry sees the Weasley twins with a magic ear, which Crookshanks grabs and runs off with, chased by Fred and George. Harry embraces Sirius, who winks at him. Ron sleeps peacefully, but Harry's dreams are disturbed. The scene shifts to the London Underground, where Mr. Weasley awkwardly steps off an escalator. At the barrier, Mr. Weasley struggles with the ticket reader, but Harry helps him through. They enter a red telephone box, which descends like a lift into a tiled hall with fireplaces. People appear in green smoke, joining the crowd of witches and wizards. Harry follows Mr. Weasley past a fountain and a banner of Cornelius Fudge. They enter a Victorian lift with paper airplanes flying around. Kingsley whispers to Mr. Weasley as the lift moves backwards and drops downwards."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A dark, narrow corridor stretches out before them, dimly lit and festooned with cobwebs that hang like ghostly decorations. This passageway leads to the scene where the patterned tiles underfoot are not only cracked but also dirty, adding to the eerie atmosphere. Harry hesitates for a moment, unsure of what lies ahead, but Moody, with his usual impatience, pushes past him, followed closely by the others who are moving purposefully toward an open door at the far end of the gloomy passage. Nymphadora turns her head and gives Harry a playful wink, but in her distraction, she trips over an umbrella stand, causing a brief commotion. Through the open door, Harry catches sight of Mr. Weasley, Sirius, and Lupin, and as she emerges, closing the door behind her, she embraces him warmly and looks at him with a scrutinizing gaze. A house elf then appears on the landing, dragging a wooden box behind it. The elf has skinny arms, a long pointed nose and ears, and is dressed in a ragged vest, glaring spitefully at Harry as it stands on the box to polish a picture frame. Harry opens a door and is nearly knocked off his feet by Hermione, who rushes in with Ron standing just behind her. As Harry looks around the bedroom, his eyes widen in surprise as he sees the Weasley twins dangling a magic ear over the banisters. Hermione's cat, Crookshanks, spots the ear and, with a swift motion, grabs at it with his paw, then dashes off with it, pursued by Fred and George. Harry embraces his godfather Sirius, who holds him close in a comforting hug. Beneath them, Harry's photograph is visible, and Sirius looks directly at Harry, giving him a conspiratorial wink. Ron sleeps peacefully, undisturbed by the events around him, but Harry's sleep is troubled by dreams that refuse to let him rest. The scene then shifts to a down escalator on the London Underground, where Mr. Weasley stands stiffly, gripping both handrails for support. As they near the bottom, he braces himself and steps off unsteadily, with Harry following closely behind. At the barrier, Mr. Weasley attempts to mimic the other passengers by placing his palm on the automatic ticket reader pad, but the gate remains stubbornly shut. Harry, more familiar with the process, inserts a ticket into the slot, and with Mr. Weasley leaning back against the gates, they finally open, allowing him to slip through backwards, looking utterly delighted by the success. Once on street level, they locate a red telephone box and step inside. As they do, the interior of the box sinks below the surface of the pavement like a lift, with a replacement interior sliding down to fill the empty space as the box comes to a halt. Mr. Weasley opens the door, and they step out into a cavernous tiled hall lined on either side with enormous fireplaces. The telephone box lift disappears above their heads, leaving them in the bustling underground hall. People appear from the fireplaces in flashes of green smoke, carrying briefcases and bundles of papers, joining the throngs of other witches and wizards who are hurrying to work through the great underground hall. Harry follows Mr. Weasley past a fountain adorned with huge golden statues, looking up at a gigantic silken banner floating above, which displays a moving image of the Minister of Magic, Cornelius Fudge. They crowd into a Victorian lift with metal gates, as paper airplanes swoop around their heads in a flurry. Kingsley pushes into the lift and whispers something to Mr. Weasley. The gates close with a clang, and the lift moves backwards before dropping downwards, carrying them to their next destination."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A shadowy, narrow corridor stretches out interminably before them, dimly illuminated and festooned with cobwebs that hang like ghostly decorations draped carelessly by some unseen force. This passageway leads directly to the scene where the patterned tiles underfoot are not only cracked but also covered in layers of grime, further contributing to the already eerie atmosphere. Harry pauses momentarily, hesitating as he is unsure of what potentially lies ahead, but Moody, displaying his characteristic impatience, brusquely pushes past him, followed closely by the others who are moving purposefully toward an open door situated at the far end of the gloomy passageway. Nymphadora turns her head momentarily and gives Harry a playful, conspiratorial wink, but in her momentary distraction, she inadvertently trips over an umbrella stand, causing a brief yet noticeable commotion. Through the open door, Harry catches sight of Mr. Weasley, Sirius, and Lupin, and as she emerges, closing the door securely behind her, she embraces him warmly and looks at him with a scrutinizing gaze that seems intent on assessing his well-being. A house elf then appears on the landing, laboriously dragging a sizable wooden box behind it. The elf possesses skinny arms, a long, pointed nose and ears, and is dressed in a ragged vest, glaring spitefully at Harry while standing on the box to polish a picture frame with some vigor. Harry opens another door and is nearly knocked off his feet by Hermione, who rushes in with Ron standing just behind her, looking eager. As Harry takes in the scene around the bedroom, his eyes widen in genuine surprise as he sees the Weasley twins dangling a magical ear over the banisters, seemingly intent on some mischief. Hermione's cat, Crookshanks, spots the ear and, with a swift, calculated motion, grabs at it with his paw, then dashes off with it, pursued frantically by Fred and George. Harry embraces his godfather Sirius, who holds him close in a comforting, reassuring hug. Beneath them, a photograph of Harry is visible, and Sirius looks directly at Harry, giving him a knowing, conspiratorial wink. Ron sleeps peacefully, undisturbed by the tumultuous events occurring around him, but Harry's sleep is restless and troubled by dreams that refuse to let him find any true rest. The scene then transitions to a bustling down escalator on the London Underground, where Mr. Weasley stands stiffly, gripping both handrails for support as if unsure of the moving stairway. As they near the bottom, he braces himself and steps off unsteadily, with Harry following closely behind him, ready to assist if needed. At the barrier, Mr. Weasley attempts rather awkwardly to mimic the other passengers by placing his palm on the automatic ticket reader pad, but the gate remains stubbornly shut, much to his consternation. Harry, more familiar with the process, inserts a ticket into the designated slot, and with Mr. Weasley leaning back against the gates, they finally spring open, allowing him to slip through backwards, looking utterly delighted by the small success. Once back on street level, they locate a red telephone box and step inside. As they do, the interior of the box descends below the surface of the pavement like a lift, with a replacement interior sliding down seamlessly to fill the empty space as the box comes to a halt. Mr. Weasley opens the door, and they step out into a cavernous tiled hall lined on either side by a series of enormous fireplaces. The telephone box lift disappears above their heads, leaving them standing in the bustling underground hall. People emerge from the fireplaces in flashes of vivid green smoke, carrying briefcases and bundles of papers, joining the throngs of other witches and wizards who are hurriedly making their way through the great underground hall to work. Harry dutifully follows Mr. Weasley past a fountain adorned with large, impressive golden statues, looking up at a gigantic silken banner floating majestically above, which displays a moving image of the Minister of Magic, Cornelius Fudge. They crowd into a Victorian lift with imposing metal gates, as enchanted paper airplanes swoop and flutter around their heads in a colorful flurry. Kingsley pushes into the lift and whispers something quietly to Mr. Weasley. The gates close with a clang, and the lift moves backwards before smoothly dropping downwards, carrying them to their next destination within the labyrinthine Ministry of Magic."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A dark narrow corridor, dimly lit and festooned with cobwebs, stretches out ominously, leading to a scene where the patterned tiles underfoot are visibly cracked and dirty, creating an unsettling atmosphere. Harry pauses at the entrance, hesitating as he takes in the eerie surroundings, but Moody, with an air of impatience, brushes past him, urging the group forward. The others follow suit, moving purposefully toward an open door at the end of the gloomy passage. As they proceed, Nymphadora turns her head back toward Harry, offering him a playful wink, but in her distraction, she stumbles over an umbrella stand, momentarily losing her balance. Through the open door, Harry catches sight of Mr. Weasley, Sirius, and Lupin, and as Nymphadora exits the room, she closes the door behind her, enveloping Harry in a warm embrace and scrutinizing him closely with a caring gaze. Meanwhile, a house elf appears on the landing, laboriously dragging a wooden box. The elf, with its skinny arms, long pointed nose, and ears, clad in a ragged vest, casts a spiteful glare at Harry. Climbing onto the box, the elf begins to polish a picture frame with meticulous care. Harry then opens another door and is almost knocked off his feet by Hermione, who bursts through with Ron standing just behind her. As Harry surveys the bedroom, his eyes widen in surprise as he notices the Weasley twins mischievously dangling a magic ear over the banisters. Hermione's cat, Crookshanks, spots the ear and, with a swift motion, snatches it with his paw before darting away, prompting Fred and George to give chase. In a moment of affection, Harry embraces his godfather Sirius, who holds him tightly, conveying warmth and protection. Beneath them, a photograph of Harry lies, and Sirius, with a twinkle in his eye, looks directly at Harry and gives him a conspiratorial wink. As night falls, Ron sleeps peacefully, undisturbed, while Harry's rest is plagued by unsettling dreams that disrupt his slumber. The scene transitions to a bustling down escalator on the London Underground, where Mr. Weasley stands rigidly, gripping both handrails for support. As they near the bottom, he braces himself, stepping off the escalator with an unsteady gait, and Harry follows closely behind. At the barrier, Mr. Weasley observes other passengers and mimics their actions by placing his palm on the automatic ticket reader pad, but the gate remains stubbornly shut. Harry, noticing the issue, inserts a ticket into the slot, and with Mr. Weasley leaning back against the gates, they swing open, allowing him to slip through backwards, his face lighting up with delight. Once on street level, they locate a red telephone box and step inside, feeling the interior sink below the pavement like a lift, as a replacement interior slides down to fill the void, bringing the box to a gentle halt. Mr. Weasley opens the door, and they step out into a vast tiled hall, lined on either side with enormous fireplaces, as the telephone box lift vanishes above them. People materialize from the fireplaces in bursts of green smoke, clutching briefcases and bundles of papers, seamlessly joining the throngs of witches and wizards hurrying to work through the expansive underground hall. Harry trails behind Mr. Weasley, passing a fountain adorned with towering golden statues, his gaze drawn upward to a gigantic silken banner floating above, displaying a moving image of the Minister of Magic, Cornelius Fudge. They squeeze into a Victorian lift with ornate metal gates, as paper airplanes flutter around their heads. Kingsley pushes his way into the lift, leans in to whisper something to Mr. Weasley, and as the gates close, the lift begins to move, first sliding backwards before descending rapidly."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A dark, narrow corridor, dimly lit and festooned with cobwebs, leads to a scene with cracked and dirty patterned tiles. Harry hesitates, but Moody impatiently pushes past him, followed by the others heading toward an open door at the end of the passage. Nymphadora winks at Harry but trips over an umbrella stand. Through the door, Harry sees Mr. Weasley, Sirius, and Lupin. As she exits, she warmly hugs Harry and looks at him closely. A house elf emerges, dragging a wooden box, and glares spitefully at Harry while polishing a picture frame. Harry opens a door and is nearly knocked over by Hermione, with Ron behind her. In the bedroom, Harry's eyes widen as the Weasley twins dangle a magic ear over the banisters. Crookshanks, Hermione's cat, grabs the ear and runs off, chased by Fred and George. Harry embraces his godfather Sirius, who winks at him. Ron sleeps peacefully, but Harry's sleep is disturbed by dreams.\n\nThe scene shifts to the London Underground, where Mr. Weasley stands stiffly on a down escalator. Nearing the bottom, he steps off unsteadily, followed by Harry. At the barrier, Mr. Weasley mimics other passengers by placing his palm on the ticket reader, but the gate remains shut. Harry uses a ticket, and with Mr. Weasley leaning back, the gates open, allowing him to slip through delightedly. On street level, they enter a red telephone box, which descends like a lift, replaced by an interior sliding down as it halts. They step out into a cavernous tiled hall lined with enormous fireplaces, as the telephone box lift disappears above. People emerge from the fireplaces in green smoke, joining the throngs of witches and wizards heading to work. Harry follows Mr. Weasley past a fountain with golden statues, glancing at a gigantic silken banner with a moving image of the Minister of Magic, Cornelius Fudge. They crowd into a Victorian lift with metal gates, surrounded by swooping paper airplanes. Kingsley enters, whispers to Mr. Weasley, and as the gates close, the lift moves backwards before descending."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A dark narrow corridor, dimly lit and festooned with cobwebs like an abandoned gothic mansion, leads to the scene where the patterned tiles underfoot are cracked and dirty; remnants of what was once a grand foyer. Harry hesitates, perhaps recalling past misadventures in similar ominous settings, but Moody, known for his strategic impatience honed from years as an Auror, pushes past him impatiently, followed by the others moving toward an open door at the end of the gloomy passage. Nymphadora, often known as Tonks within her circle for her Metamorphmagus abilities, turns and winks at Harry, but she trips over an umbrella stand, a notorious hazard in the house due to its previous owner’s eccentric collection of items. Through the open door, Harry spots Mr. Weasley, Sirius, and Lupin, three key figures in the Order of the Phoenix, and as she comes out closing the door, she hugs him warmly and looks at him closely, reassessing his growth since their last meeting. A house elf, named Kreacher and known for his grudging service due to his loyalty to the house's dark past, emerges onto the landing dragging a wooden box. It has skinny arms, a long pointed nose and ears, and wears a ragged vest, glaring spitefully at Harry, whose presence he resents. The elf stands on the box and polishes a picture frame that holds a family portrait, possibly cherished from better times. Harry opens a door and is nearly knocked off his feet by Hermione, with Ron standing behind her, the pair having arrived to assist in the growing resistance against sinister forces. Harry looks around the bedroom and his eyes widen as the Weasley twins dangle a magic ear, an ingenious invention for eavesdropping created by their burgeoning joke shop, over the banisters. Hermione's cat, Crookshanks, an intelligent half-Kneazle known for his antics, sees the ear and grabs at it with his paw, then runs off with it, chased by Fred and George. Harry embraces his godfather Sirius, who holds him close, offering comfort and strength amid the ongoing chaos. Harry's photograph is underneath, and Sirius looks directly at Harry and winks at him, a gesture filled with mischief and reassurance. Ron sleeps peacefully, unburdened by the worries that haunt Harry, but Harry's sleep is disturbed by dreams, remnants of the looming threat that plagues his consciousness. The scene shifts to a down escalator on the London Underground, a testament to the sprawling city’s bustling public transit system, where Mr. Weasley, fascinated by Muggle inventions due to his deep-seated curiosity, stands stiffly holding both handrails. Nearing the bottom, he braces himself and steps off unsteadily as Harry follows him. At the barrier, Mr. Weasley copies other passengers by placing his palm on the automatic ticket reader pad, a device often bewildering to those unfamiliar with non-magical technology, but the gate remains shut. Harry puts a ticket in the slot, and with Mr. Weasley leaning back against the gates, they open and he slips through backwards looking delighted, a small triumph over the complexities of Muggle travel. On street level, they find a red telephone box, an iconic feature of London's cityscape, and step inside, as the inside of the box sinks below the surface of the pavement like a lift, with a replacement interior sliding down to fill the empty space as the box comes to a halt, revealing one of the Ministry of Magic’s secret entrances. Mr. Weasley opens the door and they step out into a cavernous tiled hall lined on either side with enormous fireplaces, as the telephone box lift disappears above their heads, a testament to the Ministry's blend of secrecy and spectacle. People appear from the fireplaces in flashes of green smoke, utilizing the Floo Network for transportation, carrying briefcases and bundles of papers, joining the throngs of other witches and wizards hurrying to work through the great underground hall, a hub of magical governance. Harry follows Mr. Weasley past a fountain with huge golden statues, a symbol of the magical community’s ideals, looking up at a gigantic silken banner floating above with a moving image of the Minister of Magic, Cornelius Fudge, a leader often criticized for his denial of the growing dark threat. They crowd into a Victorian lift with metal gates, as paper airplanes, enchanted inter-office memos, swoop around their heads. Kingsley, an Auror respected for his calm and composed demeanor, pushes into the lift and whispers to Mr. Weasley, the gates close, and the lift moves backwards before dropping downwards, heading deeper into the labyrinthine recesses of the Ministry."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "A dark narrow corridor dimly lit and festooned with cobwebs leads to the scene where the patterned tiles underfoot are cracked and dirty. Harry hesitates but Moody pushes past him impatiently followed by the others moving toward an open door at the end of the gloomy passage. Nymphadora turns and winks at Harry but she trips over an umbrella stand. Through the open door Harry spots Mr Weasley Sirius and Lupin and as she comes out closing the door she hugs him warmly and looks at him closely. A house elf emerges onto the landing dragging a wooden box. It has skinny arms a long pointed nose and ears and wears a ragged vest glaring spitefully at Harry. The elf stands on the box and polishes a picture frame. Harry opens a door and is nearly knocked off his feet by Hermione with Ron standing behind her. Harry looks around the bedroom and his eyes widen as the Weasley twins dangle a magic ear over the banisters. Hermione's cat Crookshanks sees the ear and grabs at it with his paw then runs off with it chased by Fred and George. Harry embraces his godfather Sirius who holds him close. Harry's photograph is underneath and Sirius looks directly at Harry and winks at him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Ron sleeps peacefully but Harry's sleep is disturbed by dreams. The scene shifts to a down escalator on the London Underground where Mr Weasley stands stiffly holding both handrails. Nearing the bottom he braces himself and steps off unsteadily as Harry follows him. At the barrier Mr Weasley copies other passengers by placing his palm on the automatic ticket reader pad but the gate remains shut. Harry puts a ticket in the slot and with Mr Weasley leaning back against the gates they open and he slips through backwards looking delighted. On street level they find a red telephone box and step inside as the inside of the box sinks below the surface of the pavement like a lift with a replacement interior sliding down to fill the empty space as the box comes to a halt. Mr Weasley opens the door and they step out into a cavernous tiled hall lined on either side with enormous fireplaces as the telephone box lift disappears above their heads. People appear from the fireplaces in flashes of green smoke carrying briefcases and bundles of papers joining the throngs of other witches and wizards hurrying to work through the great underground hall. Harry follows Mr Weasley past a fountain with huge golden statues looking up at a gigantic silken banner floating above with a moving image of the Minister of Magic Cornelius Fudge. They crowd into a Victorian lift with metal gates as paper airplanes swoop around their heads. Kingsley pushes into the lift and whispers to Mr Weasley. the gates close and the lift moves backwards before dropping downwards."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "A dark narrow corridor dimly lit and festooned with cobwebs leads to the scene where the patterned tiles underfoot are cracked and dirty. Harry hesitates but Moody pushes past him impatiently followed by the others moving toward an open door at the end of the gloomy passage. Nymphadora turns and winks at Harry but she trips over an umbrella stand. Through the open door Harry spots Mr Weasley Sirius and Lupin and as she comes out closing the door she hugs him warmly and looks at him closely. A house elf emerges onto the landing dragging a wooden box. It has skinny arms a long pointed nose and ears and wears a ragged vest glaring spitefully at Harry. The elf stands on the box and polishes a picture frame. Harry opens a door and is nearly knocked off his feet by Hermione with Ron standing behind her. Harry looks around the bedroom and his eyes widen as the Weasley twins dangle a magic ear over the banisters. Hermione's cat Crookshanks sees the ear and grabs at it with his paw then runs off with it chased by Fred and George. Harry embraces his godfather Sirius who holds him close. Harry's photograph is underneath and Sirius looks directly at Harry and winks at him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Ron sleeps peacefully but Harry's sleep is disturbed by dreams. The scene shifts to a down escalator on the London Underground where Mr Weasley stands stiffly holding both handrails. Nearing the bottom he braces himself and steps off unsteadily as Harry follows him. At the barrier Mr Weasley copies other passengers by placing his palm on the automatic ticket reader pad but the gate remains shut. Harry puts a ticket in the slot and with Mr Weasley leaning back against the gates they open and he slips through backwards looking delighted. On street level they find a red telephone box and step inside as the inside of the box sinks below the surface of the pavement like a lift with a replacement interior sliding down to fill the empty space as the box comes to a halt. Mr Weasley opens the door and they step out into a cavernous tiled hall lined on either side with enormous fireplaces as the telephone box lift disappears above their heads. People appear from the fireplaces in flashes of green smoke carrying briefcases and bundles of papers joining the throngs of other witches and wizards hurrying to work through the great underground hall. Harry follows Mr Weasley past a fountain with huge golden statues looking up at a gigantic silken banner floating above with a moving image of the Minister of Magic Cornelius Fudge. They crowd into a Victorian lift with metal gates as paper airplanes swoop around their heads. Kingsley pushes into the lift and whispers to Mr Weasley. the gates close and the lift moves backwards before dropping downwards."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "A dark narrow corridor dimly lit and festooned with cobwebs leads to the scene where the patterned tiles underfoot are cracked and dirty. Harry hesitates but Moody pushes past him impatiently followed by the others moving toward an open door at the end of the gloomy passage. Nymphadora turns and winks at Harry but she trips over an umbrella stand. Through the open door Harry spots Mr Weasley Sirius and Lupin and as she comes out closing the door she hugs him warmly and looks at him closely. A house elf emerges onto the landing dragging a wooden box. It has skinny arms a long pointed nose and ears and wears a ragged vest glaring spitefully at Harry. Mr Weasley opens the door and they step out into a cavernous tiled hall lined on either side with enormous fireplaces as the telephone box lift disappears above their heads. People appear from the fireplaces in flashes of green smoke carrying briefcases and bundles of papers joining the throngs of other witches and wizards hurrying to work through the great underground hall. Harry follows Mr Weasley past a fountain with huge golden statues looking up at a gigantic silken banner floating above with a moving image of the Minister of Magic Cornelius Fudge. They crowd into a Victorian lift with metal gates as paper airplanes swoop around their heads. Kingsley pushes into the lift and whispers to Mr Weasley. the gates close and the lift moves backwards before dropping downwards."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "A dark narrow corridor dimly lit and festooned with cobwebs leads to the scene where the patterned tiles underfoot are cracked and dirty. Harry hesitates but Moody pushes past him impatiently followed by the others moving toward an open door at the end of the gloomy passage. Nymphadora turns and winks at Harry but she trips over an umbrella stand. Kingsley pushes into the lift and whispers to Mr Weasley. the gates close and the lift moves backwards before dropping downwards."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "A bright spacious atrium, brilliantly illuminated and adorned with balloons, veers to the spectacle where the marble columns overhead are polished and pristine. Daisy pauses, but Chip skates around her energetically, shadowed by the teammates sliding toward a closed window at the start of the vibrant avenue. Reginald spins and grins at Daisy, but he stumbles over a bicycle rack. Through the closed window, Daisy glimpses Mr. Whittaker, Jasper, and Quincy, and as he bursts in swinging the window, he shakes her vigorously and glances at her briefly. A garden gnome pops onto the patio hauling a plastic crate. It has plump cheeks, a short round chin and toes, and sports a patchwork coat, glowering cheerfully at Daisy. The gnome leaps on the crate and dusts a mirror. Daisy shifts a window and is nearly toppled off her toes by Clarissa, with Barry leaning alongside her. Daisy glances across the parlor and her jaw drops as the Thompson siblings dangle a silk thread over the railing. Clarissa’s bunny, Whiskers, notices the thread and tugs at it with his teeth, then hops away with it, pursued by Tim and Tom. Daisy hugs her uncle Jasper, who holds her afar. Daisy's portrait is above, and Jasper gazes directly at Daisy and grimaces at her. Barry snoozes blissfully, but Daisy's rest is interrupted by visions. The scenario moves to an up escalator on the Sydney Metro where Mr. Whittaker stands loosely gripping one railing. Approaching the top, he steadies himself and leaps on clumsily as Daisy trails him. At the portal, Mr. Whittaker mimics other travelers by placing his elbow on the electronic card reader pad, but the portal stays sealed. Daisy drops a card in the slot, and with Mr. Whittaker bending forward into the portals, they swing open and he darts through forward looking thrilled. On rooftop level, they discover a yellow van and climb inside, as the inside of the van floats above the surface of the sidewalk like a balloon, with a substitute exterior rising upwards to cover the vacant gap as the van settles down. Mr. Whittaker slides the window and they climb out into a cramped glass chamber lined on either side with tiny heaters, as the van balloon ascends beneath their feet. Creatures emerge from the heaters in sparks of purple bubbles, carrying notebooks and stacks of letters, joining the mobs of other fairies and sprites rushing to play through the giant outdoor chamber. Daisy trails Mr. Whittaker past a pond with small silver figurines, glancing up at an immense velvet flag soaring beneath with a still image of the King of Vision, Xavier Pudge. They squeeze into a space-age elevator with glass barriers, as toy helicopters dive around their necks. Albert squeezes into the elevator and sings to Mr. Whittaker, the barriers part, and the elevator shifts forwards before ascending upwards."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A dim corridor, with cracked tiles and cobwebs, leads Harry and Moody to an open door. Nymphadora trips, smiles at Harry, but the highlight is Mr. Weasley, Sirius, and Lupin appearing. Nymphadora hugs Harry warmly, a house elf glowers at him while polishing a frame. Harry greets Hermione and Ron, noticing the Weasley twins dangle a magic ear. Crookshanks snatches it, chased by Fred and George. Sirius embraces Harry, who sees his photo as Sirius winks. Ron sleeps peacefully, but Harry has unsettling dreams. On the London Underground, Mr. Weasley clumsily handles escalators and turnstiles, with Harry's help. At street level, they enter a red telephone box, descending into a vast hall with fireplaces and witches and wizards bustling. They proceed past a fountain with statues and a banner of Cornelius Fudge. Crowded into a Victorian lift, with Kingsley joining, the lift descends as paper airplanes swirl."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "the gates close and the lift moves backwards before dropping downwards Kingsley pushes into the lift and whispers to Mr Weasley  They crowd into a Victorian lift with metal gates as paper airplanes swoop around their heads  Harry follows Mr Weasley past a fountain with huge golden statues looking up at a gigantic silken banner floating above with a moving image of the Minister of Magic Cornelius Fudge  People appear from the fireplaces in flashes of green smoke carrying briefcases and bundles of papers joining the throngs of other witches and wizards hurrying to work through the great underground hall  Mr Weasley opens the door and they step out into a cavernous tiled hall lined on either side with enormous fireplaces as the telephone box lift disappears above their heads  On street level they find a red telephone box and step inside as the inside of the box sinks below the surface of the pavement like a lift with a replacement interior sliding down to fill the empty space as the box comes to a halt  Harry puts a ticket in the slot and with Mr Weasley leaning back against the gates they open and he slips through backwards looking delighted  At the barrier Mr Weasley copies other passengers by placing his palm on the automatic ticket reader pad but the gate remains shut  Nearing the bottom he braces himself and steps off unsteadily as Harry follows him  The scene shifts to a down escalator on the London Underground where Mr Weasley stands stiffly holding both handrails  Ron sleeps peacefully but Harry's sleep is disturbed by dreams  Harry's photograph is underneath and Sirius looks directly at Harry and winks at him  Harry embraces his godfather Sirius who holds him close  Hermione's cat Crookshanks sees the ear and grabs at it with his paw then runs off with it chased by Fred and George  Harry looks around the bedroom and his eyes widen as the Weasley twins dangle a magic ear over the banisters  Harry opens a door and is nearly knocked off his feet by Hermione with Ron standing behind her  The elf stands on the box and polishes a picture frame  It has skinny arms a long pointed nose and ears and wears a ragged vest glaring spitefully at Harry  A house elf emerges onto the landing dragging a wooden box  Through the open door Harry spots Mr Weasley Sirius and Lupin and as she comes out closing the door she hugs him warmly and looks at him closely  Nymphadora turns and winks at Harry but she trips over an umbrella stand  Harry hesitates but Moody pushes past him impatiently followed by the others moving toward an open door at the end of the gloomy passage  A dark narrow corridor dimly lit and festooned with cobwebs leads to the scene where the patterned tiles underfoot are cracked and dirty "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Harry hesitates but Moody pushes past him impatiently followed by the others moving toward an open door at the end of the gloomy passage A dark narrow corridor dimly lit and festooned with cobwebs leads to the scene where the patterned tiles underfoot are cracked and dirty Through the open door Harry spots Mr Weasley Sirius and Lupin and as she comes out closing the door she hugs him warmly and looks at him closely Nymphadora turns and winks at Harry but she trips over an umbrella stand It has skinny arms a long pointed nose and ears and wears a ragged vest glaring spitefully at Harry A house elf emerges onto the landing dragging a wooden box Harry opens a door and is nearly knocked off his feet by Hermione with Ron standing behind her The elf stands on the box and polishes a picture frame Hermione's cat Crookshanks sees the ear and grabs at it with his paw then runs off with it chased by Fred and George Harry looks around the bedroom and his eyes widen as the Weasley twins dangle a magic ear over the banisters Harry's photograph is underneath and Sirius looks directly at Harry and winks at him Harry embraces his godfather Sirius who holds him close The scene shifts to a down escalator on the London Underground where Mr Weasley stands stiffly holding both handrails Ron sleeps peacefully but Harry's sleep is disturbed by dreams At the barrier Mr Weasley copies other passengers by placing his palm on the automatic ticket reader pad but the gate remains shut Nearing the bottom he braces himself and steps off unsteadily as Harry follows him On street level they find a red telephone box and step inside as the inside of the box sinks below the surface of the pavement like a lift with a replacement interior sliding down to fill the empty space as the box comes to a halt Harry puts a ticket in the slot and with Mr Weasley leaning back against the gates they open and he slips through backwards looking delighted People appear from the fireplaces in flashes of green smoke carrying briefcases and bundles of papers joining the throngs of other witches and wizards hurrying to work through the great underground hall Mr Weasley opens the door and they step out into a cavernous tiled hall lined on either side with enormous fireplaces as the telephone box lift disappears above their heads They crowd into a Victorian lift with metal gates as paper airplanes swoop around their heads Harry follows Mr Weasley past a fountain with huge golden statues looking up at a gigantic silken banner floating above with a moving image of the Minister of Magic Cornelius Fudge the gates close and the lift moves backwards before dropping downwards Kingsley pushes into the lift and whispers to Mr Weasley"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Ron sleeps peacefully but Harry's sleep is disturbed by dreams  The scene shifts to a down escalator on the London Underground where Mr Weasley stands stiffly holding both handrails  Nearing the bottom he braces himself and steps off unsteadily as Harry follows him  At the barrier Mr Weasley copies other passengers by placing his palm on the automatic ticket reader pad but the gate remains shut  Harry puts a ticket in the slot and with Mr Weasley leaning back against the gates they open and he slips through backwards looking delighted  On street level they find a red telephone box and step inside as the inside of the box sinks below the surface of the pavement like a lift with a replacement interior sliding down to fill the empty space as the box comes to a halt  Mr Weasley opens the door and they step out into a cavernous tiled hall lined on either side with enormous fireplaces as the telephone box lift disappears above their heads  People appear from the fireplaces in flashes of green smoke carrying briefcases and bundles of papers joining the throngs of other witches and wizards hurrying to work through the great underground hall  Harry follows Mr Weasley past a fountain with huge golden statues looking up at a gigantic silken banner floating above with a moving image of the Minister of Magic Cornelius Fudge  They crowd into a Victorian lift with metal gates as paper airplanes swoop around their heads  Kingsley pushes into the lift and whispers to Mr Weasley  the gates close and the lift moves backwards before dropping downwards A dark narrow corridor dimly lit and festooned with cobwebs leads to the scene where the patterned tiles underfoot are cracked and dirty  Harry hesitates but Moody pushes past him impatiently followed by the others moving toward an open door at the end of the gloomy passage  Nymphadora turns and winks at Harry but she trips over an umbrella stand  Through the open door Harry spots Mr Weasley Sirius and Lupin and as she comes out closing the door she hugs him warmly and looks at him closely  A house elf emerges onto the landing dragging a wooden box  It has skinny arms a long pointed nose and ears and wears a ragged vest glaring spitefully at Harry  The elf stands on the box and polishes a picture frame  Harry opens a door and is nearly knocked off his feet by Hermione with Ron standing behind her  Harry looks around the bedroom and his eyes widen as the Weasley twins dangle a magic ear over the banisters  Hermione's cat Crookshanks sees the ear and grabs at it with his paw then runs off with it chased by Fred and George  Harry embraces his godfather Sirius who holds him close  Harry's photograph is underneath and Sirius looks directly at Harry and winks at him "
        }
      ]
    }
  ]
}