{
  "ground_truth": "She's barefoot. Harry looks up at the reptilian creature. They see a baby Thestral. She takes an apple from her bag. The baby Thestral squawks. She rolls the apple to the baby. Luna throws down a piece of raw meat. Ignoring the apple, the baby Thestral flaps its wings and gobbles up the meat. Ron gobbles a sausage at breakfast. Harry approaches the table. On the stairs, McGonagall is affronted. Filch hammers in a nail and hangs a decree. Umbridge has been appointed Hogwarts' high inquisitor. Pink suede shoes stalk the corridor. Umbridge interrogates Professor Trelawney. Snape swipes Ron. The twins play tricks with a firework. Umbridge destroys it. Filch climbs a ladder. More decrees. Umbridge smiles smugly to herself. Filch swings his ladder. Students duck. He swings it back. They duck again. Trelawney gapes. Umbridge measures the height of tiny Professor Flitwick as he conducts the choir. Trelawney's eyes look round desperately behind her huge glasses. Umbridge ticks a box and leaves the classroom. Students crowd into the cloisters. Professor Trelawney stands in the courtyard, looking devastated. She sits on a trunk. Filch brings out more of her luggage. Umbridge comes out of the main door and approaches purposefully. Professor Trelawney gets up and bumps into a suitcase. She starts to weep. Umbridge is unmoved. Umbridge holds up a decree. McGonagall comforts Trelawney. The great main doors swing open. Dumbledore appears. The students watch with baited breath. Umbridge smiles a knowing smile. Harry pushes his way through the crowd of students, but Dumbledore has gone. In the common room. Harry turns up the radio. In the fire, his image fades away into the embers. A flash of lightning. Lightning illuminates the room. Hermione looks directly at Harry. Rain streams down the diamond-shaped window panes. The rain turns to swirling snow, briefly forming the face of Voldemort. The sun rises over the snow-covered village of Hogsmeade. The three friends trudge towards the decrepit Hogshead Inn. They peer inside. A goat walks through the bar. Hermione addresses around 20 students. He glances at Cho. Students shift uncomfortably. He sits down. She takes a deep breath. Harry nods. Hermione, Harry and Ron sit at a table. Walking back to Hogwarts, Harry consults his friends. Harry grins. Umbridge watches from a high tower as they return to school. Filch leans close as she gives him instructions. Neville hurries away from the bullying Crabbe and Goyle. Walking along the corridor, an odd sound causes him to stop. He turns back, bewildered. An intricate carving appears in the stone wall in front of him, and then a large archway. As Neville watches, the carved stone becomes a pair of huge, wooden double doors. The doors swing open, revealing a long room lined with shadowy mirrors.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sure, here is the text with synonyms replaced where possible:\n\nShe's unshod. Harry gazes up at the saurian being. They perceive a baby Thestral. She withdraws an apple from her satchel. The baby Thestral squawks. She rolls the apple to the infant. Luna hurls down a slice of raw flesh. Ignoring the apple, the juvenile Thestral flaps its wings and devours the meat. Ron devours a sausage at morning meal. Harry approaches the board. On the stairway, McGonagall is insulted. Filch hammers in a spike and hangs a decree. Umbridge has been appointed Hogwarts' high inquisitor. Pink suede footwear stalk the hallway. Umbridge interrogates Professor Trelawney. Snape swipes Ron. The twins play pranks with a pyrotechnic. Umbridge demolishes it. Filch ascends a ladder. Additional decrees. Umbridge grins complacently to herself. Filch swings his ladder. Pupils duck. He swings it back. They duck again. Trelawney gapes. Umbridge measures the altitude of diminutive Professor Flitwick as he conducts the choir. Trelawney's eyes look round frantically following her enormous spectacles. Umbridge ticks a box and departs the classroom. Students crowd into the cloisters. Professor Trelawney stands in the courtyard, looking devastated. She sits on a trunk. Filch brings out more of her baggage. Umbridge emerges from the principal door and approaches determinedly. Professor Trelawney gets up and bumps into a suitcase. She starts to weep. Umbridge is unaffected. Umbridge holds up a decree. McGonagall consoles Trelawney. The great principal doors swing open. Dumbledore appears. The students observe with bated breath. Umbridge smiles a knowledgeable smile. Harry pushes his way through the throng of students, but Dumbledore has gone. In the common room. Harry turns up the radio. In the blaze, his image fades away into the embers. A flash of lightning. Lightning illuminates the room. Hermione looks directly at Harry. Rain streams down the diamond-shaped window panes. The rain turns to swirling snow, briefly forming the visage of Voldemort. The sun ascends over the snow-covered village of Hogsmeade. The trio of friends trudge towards the decrepit Hogshead Inn. They peer within. A goat wanders through the tavern. Hermione addresses around 20 pupils. He glances at Cho. Students shift uncomfortably. He sits down. She takes a deep breath. Harry nods. Hermione, Harry, and Ron sit at a table. Walking back to Hogwarts, Harry consults his friends. Harry grins. Umbridge observes from a high tower as they return to school. Filch leans close as she gives him instructions. Neville hurries away from the bullying Crabbe and Goyle. Walking along the corridor, a peculiar sound causes him to halt. He turns back, perplexed. An intricate carving appears in the stone partition in front of him, and then a large archway. As Neville watches, the carved stone becomes a pair of huge, wooden double doors. The doors swing open, revealing a long chamber lined with shadowy mirrors."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "She's barefoot. The reptilian creature is looked up at by Harry. A baby Thestral is seen by them. An apple is taken from her bag by her. A squawk is made by the baby Thestral. The apple is rolled to the baby by her. A piece of raw meat is thrown down by Luna. Ignoring the apple, the meat is gobbled up by the baby Thestral as it flaps its wings. A sausage is gobbled by Ron at breakfast. The table is approached by Harry. On the stairs, McGonagall feels affronted. A nail is hammered in by Filch and a decree is hung. Hogwarts' high inquisitor has appointed Umbridge. The corridor is stalked by pink suede shoes. Professor Trelawney is interrogated by Umbridge. Ron is swiped by Snape. Tricks are played by the twins with a firework. It is destroyed by Umbridge. A ladder is climbed by Filch. More decrees are presented. A smug smile is given by Umbridge to herself. His ladder is swung by Filch. Students duck. It is swung back by him. They duck again. Trelawney gapes. The height of tiny Professor Flitwick is measured by Umbridge as the choir is conducted by him. Behind her huge glasses, Trelawney's eyes desperately look round. A box is ticked by Umbridge and she leaves the classroom. The cloisters are crowded into by students. In the courtyard, Professor Trelawney stands, looking devastated. She sits on a trunk. More of her luggage is brought out by Filch. Out of the main door, Umbridge approaches purposefully. Professor Trelawney gets up and a suitcase is bumped into by her. She starts to weep. Umbridge remains unmoved. A decree is held up by Umbridge. Trelawney is comforted by McGonagall. The great main doors swing open. Dumbledore appears. With bated breath, the students watch. A knowing smile is given by Umbridge. His way is pushed through the crowd of students by Harry, but Dumbledore has gone. In the common room, the radio is turned up by Harry. In the fire, his image is faded away into the embers. A flash of lightning occurs. The room is illuminated by lightning. Harry is looked at directly by Hermione. Down the diamond-shaped window panes, rain streams. The face of Voldemort is briefly formed by the rain as it turns to swirling snow. Over the snow-covered village of Hogsmeade, the sun rises. Towards the decrepit Hogshead Inn, the three friends trudge. Inside is peered at by them. Through the bar, a goat walks. Around 20 students are addressed by Hermione. Cho is glanced at by him. Uncomfortably, the students shift. Down is sat by him. A deep breath is taken by her. Harry nods. At a table, Hermione, Harry, and Ron sit. Walking back to Hogwarts, his friends are consulted by Harry. Harry grins. From a high tower, Umbridge watches as school is returned to by them. Close is leaned by Filch as instructions are given to him by her. From the bullying Crabbe and Goyle, Neville hurries away. Walking along the corridor, he is caused to stop by an odd sound. Bewildered, he turns back. In the stone wall in front of him, an intricate carving appears, and then a large archway. As Neville watches, a pair of huge, wooden double doors become the carved stone. Open, the doors swing, revealing a long room lined with shadowy mirrors."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Harry gazes at a reptilian creature. They spot a baby Thestral. She retrieves an apple from her bag, but the baby Thestral, enticed by Luna's raw meat offering, eats that instead. Ron devours a sausage. Harry joins the table. On the stairs, McGonagall is appalled. Filch installs a decree. Umbridge is made Hogwarts' high inquisitor. Her pink shoes echo in the corridor as she questions Professor Trelawney. Snape brushes past Ron, and the twins' firework prank is foiled by Umbridge. Filch hangs more decrees; students dodge his swinging ladder. Umbridge measures Professor Flitwick during choir practice, ticking off a list before leaving. Trelawney is devastated in the courtyard as Filch brings her luggage. Umbridge, holding a decree, is indifferent to Trelawney's tears, while McGonagall offers comfort. Dumbledore emerges through the main doors, capturing everyone’s attention, but disappears before Harry can reach him. In the common room, Harry tunes into the radio, his image fading in the fire. Lightning lights the room, and Hermione faces Harry. Rain turns to snow, briefly forming Voldemort's face. Sunlight rises over snowy Hogsmeade as the trio heads to the dilapidated Hogshead Inn. Inside, a goat wanders as Hermione speaks to about 20 students. Harry glances at Cho and nods. They sit together, and on the way back, Harry consults his friends. Umbridge watches them approach the school, whispering instructions to Filch. Neville escapes Crabbe and Goyle's bullying. A strange sound halts him; intricate carvings emerge in the stone wall, becoming giant double doors. The doors open to reveal a room lined with shadowy mirrors."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Barefoot, she watches Harry look up at a reptilian creature and a baby Thestral. She rolls an apple, but the Thestral eats raw meat Luna throws. Ron eats sausage at breakfast as Harry arrives. McGonagall is upset on the stairs. Filch hammers a decree. Umbridge, the new high inquisitor, interrogates Trelawney while Snape hits Ron. The twins play with fireworks; Umbridge destroys them. Filch’s ladder swings as Umbridge measures Flitwick and ticks a box, leaving Trelawney devastated in the courtyard. McGonagall comforts her. Dumbledore appears as Umbridge smiles; he vanishes before Harry can reach him. In the common room, Harry's image fades in the fire. Lightning and rain reveal Voldemort’s face in the window. Sun rises over snow-covered Hogsmeade. Friends head to the Hogshead Inn, where Hermione addresses students. Harry nods at Cho, and later grins at his friends as Umbridge watches from a tower. Neville escapes bullies, discovers a carving, and watches it become a door opening to a room lined with mirrors."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Her bare feet touch the ground gently as she stands, while Harry raises his gaze towards the imposing reptilian creature before them. They both notice a baby Thestral nearby. She carefully reaches into her bag and retrieves an apple. The young Thestral lets out a squawk of interest. With a gentle motion, she rolls the apple towards it. Instead of the apple, Luna, seemingly without hesitation, throws down a piece of raw meat. The baby Thestral, ignoring the apple entirely, flaps its delicate wings and eagerly devours the meat. Meanwhile, Ron is busy devouring a sausage during breakfast. Harry makes his way over to the table. On the nearby stairs, McGonagall appears visibly affronted. Filch is busy, hammering a nail into the wall to hang a decree. Umbridge has been appointed as Hogwarts' high inquisitor, and the news spreads quickly. Her pink suede shoes echo ominously as they stalk the corridor. Umbridge takes it upon herself to interrogate Professor Trelawney. Snape sharply swipes at Ron. The mischievous twins entertain with their tricks involving a firework, which Umbridge promptly destroys. Filch climbs a ladder, busying himself with putting up more decrees. Umbridge, observing her surroundings, smiles smugly to herself. Filch, swinging the ladder, causes students to duck hurriedly, only for him to swing it back, resulting in the same reaction. Trelawney stands with gaping eyes. Umbridge meticulously measures the height of the diminutive Professor Flitwick as he conducts the choir. Trelawney's eyes appear desperately round behind her enormous glasses. Umbridge ticks a box with satisfaction and leaves the classroom nonchalantly. Students begin to gather in the cloisters. Professor Trelawney stands forlorn in the courtyard, looking utterly devastated. She sits down heavily on a trunk. Filch brings out yet more of her belongings. In a determined stride, Umbridge emerges from the main door and walks with purpose. Professor Trelawney rises and accidentally bumps into a suitcase, causing her to start weeping. Umbridge remains completely unmoved by the scene. Holding up a decree, Umbridge maintains her stance. McGonagall steps in to comfort the distraught Trelawney. The grand main doors swing open dramatically, and Dumbledore appears. The gathered students watch the scene unfold with bated breath. Umbridge displays a knowing smile. In the midst of the throng, Harry pushes his way through the crowd, but by then, Dumbledore has vanished. Back in the common room, Harry turns up the volume on the radio. In the flickering fire, his image gradually fades away into the glowing embers. A flash of lightning illuminates the space. Hermione turns her gaze directly towards Harry. Rain streams steadily down the diamond-shaped window panes, turning to swirling snow that briefly forms the face of Voldemort. The sun eventually rises over the snow-blanketed village of Hogsmeade. The three friends, Harry, Hermione, and Ron, trudge along towards the decrepit Hogshead Inn. They peer inside with curiosity. A goat casually walks through the bar. Hermione addresses a gathering of around 20 students. He glances briefly at Cho. The students shift uncomfortably in their seats. He sits down with determination. She takes a deep, reassuring breath. Harry nods in agreement. Hermione, Harry, and Ron settle at a table. As they walk back to Hogwarts, Harry consults with his friends. Harry's face breaks into a grin. From a high tower, Umbridge watches them as they make their return to the school. Leaning close, Filch listens intently as she gives him instructions. Neville hurries away, trying to escape the bullying Crabbe and Goyle. As he walks along the corridor, an odd sound catches his attention and causes him to stop. He turns back, visibly bewildered. In the stone wall before him, an intricate carving becomes evident and gradually transforms into a large archway. As Neville continues to watch, the carved stone seamlessly becomes a pair of huge, wooden double doors. The doors swing open, revealing a long, mysterious room lined with shadowy mirrors."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Her bare feet make gentle contact with the ground as she stands, while Harry lifts his gaze slowly towards the imposing and formidable reptilian creature standing before them. Together, they both observe a baby Thestral nearby. She carefully reaches down into her bag and takes out an apple. The young Thestral emits a squawk, clearly showing interest. With a gentle movement, she rolls the apple towards it. Rather unexpectedly, instead of the apple, Luna, appearing without any hesitation, throws down a piece of raw meat. The baby Thestral, paying no attention whatsoever to the apple, flaps its delicate wings and eagerly devours the meat. At the same time, Ron is preoccupied with devouring a sausage during breakfast. Harry makes his way over to the table. On the stairs nearby, McGonagall appears notably affronted. Filch is occupied, hammering a nail into the wall to hang a decree. Umbridge has been appointed as Hogwarts' high inquisitor, and the news rapidly spreads through the halls. Her pink suede shoes echo ominously as they make their way down the corridor. Umbridge takes it upon herself to interrogate Professor Trelawney with determination. Snape swiftly swipes at Ron. The mischievous twins entertain everyone with their tricks involving a firework, which Umbridge quickly destroys with no room for nonsense. Filch climbs a ladder, busily putting up more decrees. Umbridge, observing her surroundings, smiles smugly to herself. Filch, swinging the ladder, causes students to duck hurriedly, only for him to swing it back, resulting in the same hurried reaction. Trelawney stands with her eyes wide and gaping. Umbridge meticulously measures the height of the diminutive Professor Flitwick as he conducts the choir. Trelawney's eyes appear desperately round behind her enormous glasses. Umbridge ticks a box with satisfaction and exits the classroom nonchalantly. Students begin to gather in the cloisters, whispering among themselves. Professor Trelawney stands forlorn in the courtyard, appearing utterly devastated. She sits down heavily on a trunk. Filch brings out yet more of her personal belongings. In a determined and purposeful stride, Umbridge emerges from the main door and walks with clear intent. Professor Trelawney rises and accidentally bumps into a suitcase, causing her to start weeping. Umbridge remains completely unmoved by the emotional scene. Holding up a decree, Umbridge maintains her unyielding stance. McGonagall steps in with compassion to comfort the distraught Trelawney. The grand main doors swing open dramatically, and Dumbledore appears. The gathered students watch the unfolding scene with bated breath, anticipation hanging in the air. Umbridge displays a knowing, self-satisfied smile. In the midst of the throng, Harry pushes his way through the crowd, but by that time, Dumbledore has already vanished. Back in the cozy common room, Harry turns up the volume on the softly playing radio. In the flickering fire, his image gradually fades away into the glowing embers. A sudden flash of lightning illuminates the space. Hermione turns her gaze directly and intently towards Harry. Rain streams steadily down the diamond-shaped window panes, transforming into swirling snow that briefly forms the ominous face of Voldemort. Eventually, the sun rises over the snow-blanketed village of Hogsmeade, bringing light to the quiet landscape. The three faithful friends, Harry, Hermione, and Ron, trudge along through the snow towards the decrepit and rundown Hogshead Inn. They peer inside with a sense of curiosity. A goat casually ambles through the bar. Hermione addresses a gathering of around 20 students with determination and clarity. He glances briefly at Cho with a sense of uncertainty. The students shift uncomfortably in their seats, reacting to the tension in the room. He sits down with determination, ready to proceed. She takes a deep, reassuring breath, preparing herself. Harry nods in agreement, showing his support. Hermione, Harry, and Ron settle together at a table. As they walk back to Hogwarts, Harry consults with his friends, seeking their opinion. Harry's face breaks into a wide grin. From a high tower, Umbridge watches them as they make their return to the school. Leaning in close, Filch listens intently as she gives him detailed instructions. Neville hurries away, trying to escape the bullying Crabbe and Goyle. As he walks along the corridor, an odd sound catches his attention and causes him to stop suddenly. He turns back, visibly bewildered and curious. In the stone wall before him, an intricate carving becomes evident and gradually transforms into a large and impressive archway. As Neville continues to watch with fascination, the carved stone seamlessly becomes a pair of huge, wooden double doors. The doors swing open, revealing a long, mysterious room lined with shadowy mirrors."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As she stands barefoot, Harry directs his gaze upwards to take in the sight of the reptilian creature before them. Together, they observe a baby Thestral making its presence known. She reaches into her bag, her fingers curling around a fresh apple, which she draws out. At that moment, the baby Thestral emits a squawk, its voice piercing the air. She gently rolls the apple across the ground towards the baby Thestral, her motion smooth and deliberate. However, with a swift motion, Luna throws a piece of raw meat onto the ground. The baby Thestral, paying no heed to the apple, begins to flap its wings vigorously before swiftly devouring the meat. Meanwhile, Ron, indulging in his breakfast, stuffs a sausage into his mouth, savoring each bite. Harry approaches the table, his steps measured and purposeful. On the staircase, McGonagall stands, her expression one of affront as she observes the scene. Filch, with focused determination, hammers a nail, his actions precise, as he hangs a new decree for all to see. The decree announces that Umbridge has now assumed the role of Hogwarts' high inquisitor. The sound of pink suede shoes echoes ominously as Umbridge stalks down the corridor with purpose. She enters the classroom, where she begins her interrogation of Professor Trelawney, her questions incisive and unrelenting. Nearby, Snape swipes at Ron with a deft motion. The twins then commence their mischief, setting off a firework with gleeful enthusiasm, but Umbridge swiftly and decisively destroys it. Filch ascends a ladder, his movements steady, as he hangs additional decrees for all to see. Umbridge observes the students with a self-satisfied smile, assured in her authority. Filch swings his ladder, causing the students to duck instinctively, only to duck again as he swings it back. Professor Trelawney stands by, her mouth agape in disbelief. Umbridge, meanwhile, measures the diminutive Professor Flitwick as he conducts the choir, her actions systematic and cold. Professor Trelawney’s eyes dart round, her desperation evident behind her oversized glasses. Umbridge, after completing her inspection, ticks a box with finality and exits the classroom. In the cloisters, students gather, their collective presence filling the space. Professor Trelawney stands in the courtyard, a figure of utter devastation, her posture slumped as she lowers herself onto a trunk. Filch arrives, burdened with more of her luggage. Umbridge emerges from the main door, striding forward with determined intent. Upon seeing Umbridge, Professor Trelawney rises, only to stumble into a suitcase, prompting her to weep, overcome with emotion. Umbridge remains impassive, holding up a decree with finality. McGonagall steps forward to offer comfort to Trelawney, her presence a balm in the tense moment. The imposing main doors of Hogwarts swing open, and Dumbledore makes his entrance, capturing the attention of the gathered students, who watch with bated breath. Umbridge greets him with a knowing smile, confident in her position. Harry, eager to witness the proceedings, pushes through the throng of students, but finds that Dumbledore has already departed. In the common room, Harry increases the volume on the radio, allowing the sound to fill the space. His image flickers in the fire before slowly dissolving into the glowing embers. A sudden flash of lightning pierces the room, momentarily illuminating it. Hermione turns her gaze directly towards Harry, her eyes searching his face. Outside, rain cascades down the diamond-shaped window panes, the droplets racing each other in intricate patterns. As if by magic, the rain transforms into swirling snow, momentarily shaping itself into the menacing visage of Voldemort. The scene shifts as the sun rises over the snow-blanketed village of Hogsmeade, casting a warm glow over the serene landscape. Harry, Hermione, and Ron trudge across the snowy ground towards the decrepit Hogshead Inn, their footsteps crunching softly with each step. They pause to peer inside the establishment, curiosity piquing their interest. A goat wanders casually through the bar, its presence adding to the Inn’s peculiar charm. Hermione gathers around 20 students, her voice carrying a note of authority as she addresses them. Harry, catching sight of Cho, glances in her direction, subtlety marking the moment. The gathered students shift uneasily, their discomfort palpable in the air. As the assembly settles, he takes a seat, ready to engage. Hermione draws a deep breath, gathering her thoughts before continuing. Harry acknowledges her words with a nod, signaling his agreement. The three friends—Hermione, Harry, and Ron—sit together at a table, their camaraderie evident in their shared expressions. As they walk back to Hogwarts, Harry consults with his friends, their conversation punctuated by nods and smiles, a plan forming between them. Harry grins, satisfaction evident in his demeanor. Umbridge, from her vantage point in a high tower, watches their return to school with a scrutinizing gaze. Filch leans in close as she whispers instructions, the nature of which remains a mystery. Neville, meanwhile, hurries away from the bullying antics of Crabbe and Goyle, their intimidation tactic a constant bother. As he proceeds along the corridor, an odd sound reaches his ears, causing him to halt, intrigued yet bewildered. He turns back, searching for the source of the sound, only to witness an intricate carving materializing in the stone wall before him, gradually taking shape. As he watches, the carved stone transforms into a pair of massive, wooden double doors. These doors swing open slowly, revealing a long room lined with shadowy mirrors, the space inviting exploration under its mysterious ambiance."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Luna, barefoot, interacts with a baby Thestral by offering an apple and then raw meat, which the creature eagerly consumes. Meanwhile, at breakfast, Ron enjoys a sausage as Harry joins the table. On the stairs, McGonagall reacts to Filch, who is busy putting up decrees stating Umbridge's new role as Hogwarts' High Inquisitor. Umbridge, walking the corridors in pink suede shoes, questions Professor Trelawney. Snape reprimands Ron, while the twins create chaos with fireworks that Umbridge destroys. Filch continues to hang decrees, causing students to duck as he swings his ladder. Umbridge subtly measures Professor Flitwick during choir practice before exiting the classroom. In the courtyard, a devastated Professor Trelawney is comforted by McGonagall after Umbridge presents a decree, showing her authority. The scenario heightens as Dumbledore arrives amidst the students' anticipation, but departs before Harry can reach him.\n\nLater, in the common room, Harry listens to the radio until his image fades into the fire's embers. Lightning briefly illuminates Hermione's gaze at him, while rain and snow transform into Voldemort's face against the window. The next morning in Hogsmeade, Harry, Hermione, and Ron arrive at the Hogshead Inn, where Hermione addresses a group of students, including Cho. The meeting is tense but ends with Harry affirming Hermione's words before the trio returns to Hogwarts under Umbridge's watchful eye. She gives instructions to Filch, while Neville, fleeing from Crabbe and Goyle, encounters a mysterious transformation of a stone wall into a set of grand wooden doors leading to a shadowy room lined with mirrors."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She's barefoot, feeling the cool grass under her feet. Harry looks up at the reptilian creature, a mythical dragon known for its fiery breath. They see a baby Thestral, an invisible creature to those who haven't witnessed death, grazing quietly. She takes an apple from her bag, a Granny Smith, known for its crisp texture. The baby Thestral squawks, a sound that echoes eerily through the woods. She rolls the apple to the baby, hoping to entice it. Luna throws down a piece of raw meat, sourced from the kitchens of Hogwarts. Ignoring the apple, the baby Thestral flaps its wings and gobbles up the meat, its preferred diet. Ron gobbles a sausage at breakfast, savoring the homemade recipe of the Hogwarts' elves. Harry approaches the table, feeling a sense of camaraderie. On the stairs, McGonagall is affronted by the latest decree. Filch hammers in a nail and hangs a decree, adding to the growing collection of rules. Umbridge has been appointed Hogwarts' high inquisitor, a position granting her sweeping powers. Pink suede shoes, reflecting her authoritarian style, stalk the corridor. Umbridge interrogates Professor Trelawney, questioning her dubious predictions. Snape swipes Ron with a look of disdain. The twins play tricks with a firework, a Weasley product known for its innovation. Umbridge destroys it, her disdain for mischief evident. Filch climbs a ladder, his cloak billowing. More decrees, tightening Umbridge's grip. Umbridge smiles smugly to herself, content with her control. Filch swings his ladder, causing chaos. Students duck, avoiding the clumsy maneuver. He swings it back, adding to the commotion. They duck again, laughter breaking the tension. Trelawney gapes, worried for her future at the school. Umbridge measures the height of tiny Professor Flitwick, a master of charms, as he conducts the choir, their voices echoing through the hall. Trelawney's eyes look round desperately behind her huge glasses, reflecting her fear and uncertainty. Umbridge ticks a box, a symbol of her critical assessment, and leaves the classroom. Students crowd into the cloisters, whispering about the latest events. Professor Trelawney stands in the courtyard, looking devastated after her confrontation with Umbridge. She sits on a trunk, contemplating her uncertain future. Filch brings out more of her luggage, the weight of her displacement evident. Umbridge comes out of the main door and approaches purposefully, her steps echoing authority. Professor Trelawney gets up and bumps into a suitcase, an unwelcome reminder of her predicament. She starts to weep, feeling the pressure of her position. Umbridge is unmoved, her heart hardened by her ambitions. Umbridge holds up a decree, a paper that seals Trelawney's fate. McGonagall comforts Trelawney, offering her support. The great main doors swing open, a symbol of hope, and Dumbledore appears, his presence commanding respect. The students watch with bated breath, eager for his intervention. Umbridge smiles a knowing smile, confident in her authority. Harry pushes his way through the crowd of students, determined to reach Dumbledore, but Dumbledore has gone, leaving only questions. In the common room, Harry turns up the radio, a source of news and hope. In the fire, his image fades away into the embers, a reminder of his fleeting presence. A flash of lightning, illuminating the room in an instant. Lightning illuminates the room, casting eerie shadows. Hermione looks directly at Harry, her eyes full of questions. Rain streams down the diamond-shaped window panes, a soothing sound against the tension. The rain turns to swirling snow, briefly forming the face of Voldemort, a haunting apparition. The sun rises over the snow-covered village of Hogsmeade, painting a serene picture. The three friends trudge towards the decrepit Hogshead Inn, a place known for its discrete atmosphere. They peer inside, the smell of ale and old wood greeting them. A goat walks through the bar, its presence unremarkable in this eclectic place. Hermione addresses around 20 students, her voice filled with determination. He glances at Cho, remembering past emotions. Students shift uncomfortably, feeling the weight of the meeting's secrecy. He sits down, ready for the discussion. She takes a deep breath, gathering her courage. Harry nods, showing his support. Hermione, Harry and Ron sit at a table, a united front. Walking back to Hogwarts, Harry consults his friends, seeking their insights. Harry grins, feeling a sense of unity. Umbridge watches from a high tower as they return to school, her eyes sharp and watchful. Filch leans close as she gives him instructions, his loyalty evident. Neville hurries away from the bullying Crabbe and Goyle, their taunting laughs echoing. Walking along the corridor, an odd sound causes him to stop, curiosity piqued. He turns back, bewildered by the unexpected. An intricate carving appears in the stone wall in front of him, a magical transformation unfolding. Then a large archway, leading to unknown places. As Neville watches, the carved stone becomes a pair of huge, wooden double doors, their significance a mystery. The doors swing open, revealing a long room lined with shadowy mirrors, an enigmatic space awaiting discovery."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "She is barefoot. Harry looks up at the reptilian creature. They see a baby Thestral. She takes an apple from her bag. The baby Thestral squawks. She rolls the apple to the baby. Luna throws down a piece of raw meat. Ignoring the apple the baby Thestral flaps its wings and gobbles up the meat. Ron gobbles a sausage at breakfast. Harry approaches the table. On the stairs McGonagall is affronted. Filch hammers in a nail and hangs a decree. Umbridge has been appointed Hogwarts' high inquisitor. Pink suede shoes stalk the corridor. Umbridge interrogates Professor Trelawney. Snape swipes Ron. The twins play tricks with a firework. Umbridge destroys it. Filch climbs a ladder. More decrees. Umbridge smiles smugly to herself. Filch swings his ladder. Students duck. He swings it back. They duck again. Trelawney gapes. Umbridge measures the height of tiny Professor Flitwick as he conducts the choir. Trelawney's eyes look round desperately behind her huge glasses. Umbridge ticks a box and leaves the classroom. Students crowd into the cloisters. Professor Trelawney stands in the courtyard looking devastated. She sits on a trunk. Filch brings out more of her luggage. Umbridge comes out of the main door and approaches purposefully. Professor Trelawney gets up and bumps into a suitcase. She starts to weep. Umbridge is unmoved. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Umbridge holds up a decree. McGonagall comforts Trelawney. The great main doors swing open. Dumbledore appears. The students watch with baited breath. Umbridge smiles a knowing smile. Harry pushes his way through the crowd of students but Dumbledore has gone. In the common room Harry turns up the radio. In the fire his image fades away into the embers. A flash of lightning. Lightning illuminates the room. Hermione looks directly at Harry. Rain streams down the diamondshaped window panes. The rain turns to swirling snow briefly forming the face of Voldemort. The sun rises over the snowcovered village of Hogsmeade. The three friends trudge towards the decrepit. Hogshead Inn. They peer inside. A goat walks through the bar. Hermione addresses around 20 students. He glances at Cho. Students shift uncomfortably. He sits down. She takes a deep breath. Harry nods Hermione. Harry and Ron sit at a table. Walking back to Hogwarts. Harry consults his friends. Harry grins. Umbridge watches from a high tower as they return to school. Filch leans close as she gives him instructions. Neville hurries away from the bullying Crabbe and Goyle. Walking along the corridor an odd sound causes him to stop. He turns back bewildered. An intricate carving appears in the stone wall in front of him and then a large archway. As Neville watches the carved stone becomes a pair of huge wooden double doors. The doors swing open revealing a long room lined with shadowy mirrors."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "She is barefoot. Harry looks up at the reptilian creature. They see a baby Thestral. She takes an apple from her bag. The baby Thestral squawks. She rolls the apple to the baby. Luna throws down a piece of raw meat. Ignoring the apple the baby Thestral flaps its wings and gobbles up the meat. Ron gobbles a sausage at breakfast. Harry approaches the table. On the stairs McGonagall is affronted. Filch hammers in a nail and hangs a decree. Umbridge has been appointed Hogwarts' high inquisitor. Pink suede shoes stalk the corridor. Umbridge interrogates Professor Trelawney. Snape swipes Ron. The twins play tricks with a firework. Umbridge destroys it. Filch climbs a ladder. More decrees. Umbridge smiles smugly to herself. Filch swings his ladder. Students duck. He swings it back. They duck again. Trelawney gapes. Umbridge measures the height of tiny Professor Flitwick as he conducts the choir. Trelawney's eyes look round desperately behind her huge glasses. Umbridge ticks a box and leaves the classroom. Students crowd into the cloisters. Professor Trelawney stands in the courtyard looking devastated. She sits on a trunk. Filch brings out more of her luggage. Umbridge comes out of the main door and approaches purposefully. Professor Trelawney gets up and bumps into a suitcase. She starts to weep. Umbridge is unmoved. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Umbridge holds up a decree. McGonagall comforts Trelawney. The great main doors swing open. Dumbledore appears. The students watch with baited breath. Umbridge smiles a knowing smile. Harry pushes his way through the crowd of students but Dumbledore has gone. In the common room Harry turns up the radio. In the fire his image fades away into the embers. A flash of lightning. Lightning illuminates the room. Hermione looks directly at Harry. Rain streams down the diamondshaped window panes. The rain turns to swirling snow briefly forming the face of Voldemort. The sun rises over the snowcovered village of Hogsmeade. The three friends trudge towards the decrepit. Hogshead Inn. They peer inside. A goat walks through the bar. Hermione addresses around 20 students. He glances at Cho. Students shift uncomfortably. He sits down. She takes a deep breath. Harry nods Hermione. Harry and Ron sit at a table. Walking back to Hogwarts. Harry consults his friends. Harry grins. Umbridge watches from a high tower as they return to school. Filch leans close as she gives him instructions. Neville hurries away from the bullying Crabbe and Goyle. Walking along the corridor an odd sound causes him to stop. He turns back bewildered. An intricate carving appears in the stone wall in front of him and then a large archway. As Neville watches the carved stone becomes a pair of huge wooden double doors. The doors swing open revealing a long room lined with shadowy mirrors."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "She is barefoot. Harry looks up at the reptilian creature. They see a baby Thestral. She takes an apple from her bag. The baby Thestral squawks. She rolls the apple to the baby. Luna throws down a piece of raw meat. Ignoring the apple the baby Thestral flaps its wings and gobbles up the meat. Ron gobbles a sausage at breakfast. Harry approaches the table. On the stairs McGonagall is affronted. Filch hammers in a nail and hangs a decree. Umbridge has been appointed Hogwarts' high inquisitor. Pink suede shoes stalk the corridor. Umbridge interrogates Professor Trelawney. Snape swipes Ron. The twins play tricks with a firework. Umbridge destroys it. Filch climbs a ladder. Hermione addresses around 20 students. He glances at Cho. Students shift uncomfortably. He sits down. She takes a deep breath. Harry nods Hermione. Harry and Ron sit at a table. Walking back to Hogwarts. Harry consults his friends. Harry grins. Umbridge watches from a high tower as they return to school. Filch leans close as she gives him instructions. Neville hurries away from the bullying Crabbe and Goyle. Walking along the corridor an odd sound causes him to stop. He turns back bewildered. An intricate carving appears in the stone wall in front of him and then a large archway. As Neville watches the carved stone becomes a pair of huge wooden double doors. The doors swing open revealing a long room lined with shadowy mirrors."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "She is barefoot. Harry looks up at the reptilian creature. They see a baby Thestral. She takes an apple from her bag. The baby Thestral squawks. She rolls the apple to the baby. Luna throws down a piece of raw meat. Ignoring the apple the baby Thestral flaps its wings and gobbles up the meat. Filch leans close as she gives him instructions. Neville hurries away from the bullying Crabbe and Goyle. Walking along the corridor an odd sound causes him to stop. He turns back bewildered. An intricate carving appears in the stone wall in front of him and then a large archway. As Neville watches the carved stone becomes a pair of huge wooden double doors. The doors swing open revealing a long room lined with shadowy mirrors."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "He's wearing slippers. Daphne gazes up at the feathery mammal. They notice a young phoenix. He grabs a pear from his pocket. The young phoenix chirps. He tosses the pear to the young one. Luna flicks a chunk of cheese. Ignoring the pear, the young phoenix flutters its feathers and devours the cheese. Ron munches a croissant at lunch. Daphne strides towards the counter. On the elevator, Flitwick is outraged. Pince drills in a screw and posts a notice. Sprout has been declared the castle's chief inspector. Blue velvet boots wander through the hallway. Sprout questions Madam Pomfrey. Binns pinches Hermione. The imps pull pranks with a sparkler. Sprout extinguishes it. Pince scales a ladder. Additional notices. Sprout grins triumphantly to herself. Pince sways his ladder. Apprentices duck. He swings it again. They duck once more. Pomfrey gapes. Sprout gauges the width of tiny Madam Hooch as she orchestrates the band. Pomfrey's binoculars look rounded frantically behind her massive goggles. Sprout ticks off an item and exits the laboratory. Learners cram into the atrium. Madam Pomfrey lingers in the garden, appearing devastated. She kneels on a suitcase. Pince carries out more of her bags. Sprout strides out of the gate and advances decisively. Madam Pomfrey rises and trips over a box. She begins to cry. Sprout remains indifferent. She lifts a notice. Flitwick consoles Pomfrey. The grand entrance gates swing wide. Grindelwald appears. The apprentices observe with bated breath. Sprout grins an insightful grin. Daphne shoves his path through the throng of apprentices, but Grindelwald has departed. In the study. Daphne cranks up the television. In the flames, his visage fades into the soot. A bolt of thunder. Thunder brightens the chamber. Luna gazes straight at Daphne. Snow cascades down the hexagonal skylight. The snow morphs into swirling mist, momentarily forming the visage of Draco. The moon ascends over the frost-draped village of Hogsmeade. The trio plods towards the ramshackle Boar's Head Inn. They squint inside. A sheep meanders through the lounge. Luna addresses around 25 apprentices. He peers at Lavender. Apprentices shuffle hesitantly. He reclines. She inhales profoundly. Daphne nods. Luna, Daphne, and Ron gather at a counter. Trekking back to Beauxbatons, Daphne consults with his companions. Daphne beams. Sprout observes from a lofty turret as they return to campus. Pince leans close as she issues commands. Ginny dashes away from the teasing Zabini and Nott. Strolling down the hallway, a peculiar melody halts him. He pivots around, perplexed. An elaborate sculpture manifests in the brick wall ahead of him, and then a grand doorway. As Ginny observes, the carved bricks transform into a pair of enormous, metallic double portals. The portals swing wide, revealing a vast chamber bordered with dim reflections."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Harry, Ron, and Hermione navigate a complex year at Hogwarts under Umbridge's rule. Luna feeds a baby Thestral while Umbridge enforces strict decrees, interrogating and dismissing Professor Trelawney, who is comforted by McGonagall. Dumbledore's unexpected intervention leaves a mysterious void as he disappears. At Hogsmeade, the trio meets with fellow students to unite against Umbridge in a secret meeting at the Hogshead Inn, with Harry exchanging glances with Cho. Meanwhile, Umbridge spies from a tower as they return to school. Neville discovers a hidden room, which opens into a chamber with mirrors, suggesting new possibilities amidst the tension."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The doors swing open revealing a long room lined with shadowy mirrors As Neville watches the carved stone becomes a pair of huge wooden double doors An intricate carving appears in the stone wall in front of him and then a large archway He turns back bewildered Walking along the corridor an odd sound causes him to stop Neville hurries away from the bullying Crabbe and Goyle Filch leans close as she gives him instructions Umbridge watches from a high tower as they return to school Harry grins Harry consults his friends Walking back to Hogwarts Harry and Ron sit at a table Harry nods Hermione She takes a deep breath He sits down Students shift uncomfortably He glances at Cho Hermione addresses around 20 students A goat walks through the bar They peer inside Hogshead Inn The three friends trudge towards the decrepit The sun rises over the snowcovered village of Hogsmeade The rain turns to swirling snow briefly forming the face of Voldemort Rain streams down the diamondshaped window panes Hermione looks directly at Harry Lightning illuminates the room A flash of lightning In the fire his image fades away into the embers In the common room Harry turns up the radio Harry pushes his way through the crowd of students but Dumbledore has gone Umbridge smiles a knowing smile The students watch with baited breath Dumbledore appears The great main doors swing open McGonagall comforts Trelawney Umbridge holds up a decree Umbridge is unmoved She starts to weep Professor Trelawney gets up and bumps into a suitcase Umbridge comes out of the main door and approaches purposefully Filch brings out more of her luggage She sits on a trunk Professor Trelawney stands in the courtyard looking devastated Students crowd into the cloisters Umbridge ticks a box and leaves the classroom Trelawney's eyes look round desperately behind her huge glasses Umbridge measures the height of tiny Professor Flitwick as he conducts the choir Trelawney gapes They duck again He swings it back Students duck Filch swings his ladder Umbridge smiles smugly to herself More decrees Filch climbs a ladder Umbridge destroys it The twins play tricks with a firework Snape swipes Ron Umbridge interrogates Professor Trelawney Pink suede shoes stalk the corridor Umbridge has been appointed Hogwarts' high inquisitor Filch hammers in a nail and hangs a decree On the stairs McGonagall is affronted Harry approaches the table Ron gobbles a sausage at breakfast Ignoring the apple the baby Thestral flaps its wings and gobbles up the meat Luna throws down a piece of raw meat She rolls the apple to the baby The baby Thestral squawks She takes an apple from her bag They see a baby Thestral Harry looks up at the reptilian creature She is barefoot"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Harry looks up at the reptilian creature She is barefoot She takes an apple from her bag They see a baby Thestral She rolls the apple to the baby The baby Thestral squawks Ignoring the apple the baby Thestral flaps its wings and gobbles up the meat Luna throws down a piece of raw meat Harry approaches the table Ron gobbles a sausage at breakfast Filch hammers in a nail and hangs a decree On the stairs McGonagall is affronted Pink suede shoes stalk the corridor Umbridge has been appointed Hogwarts' high inquisitor Snape swipes Ron Umbridge interrogates Professor Trelawney Umbridge destroys it The twins play tricks with a firework More decrees Filch climbs a ladder Filch swings his ladder Umbridge smiles smugly to herself He swings it back Students duck Trelawney gapes They duck again Trelawney's eyes look round desperately behind her huge glasses Umbridge measures the height of tiny Professor Flitwick as he conducts the choir Students crowd into the cloisters Umbridge ticks a box and leaves the classroom She sits on a trunk Professor Trelawney stands in the courtyard looking devastated Umbridge comes out of the main door and approaches purposefully Filch brings out more of her luggage She starts to weep Professor Trelawney gets up and bumps into a suitcase Umbridge holds up a decree Umbridge is unmoved The great main doors swing open McGonagall comforts Trelawney The students watch with baited breath Dumbledore appears Harry pushes his way through the crowd of students but Dumbledore has gone Umbridge smiles a knowing smile In the fire his image fades away into the embers In the common room Harry turns up the radio Lightning illuminates the room A flash of lightning Rain streams down the diamondshaped window panes Hermione looks directly at Harry The sun rises over the snowcovered village of Hogsmeade The rain turns to swirling snow briefly forming the face of Voldemort Hogshead Inn The three friends trudge towards the decrepit A goat walks through the bar They peer inside He glances at Cho Hermione addresses around 20 students He sits down Students shift uncomfortably Harry nods Hermione She takes a deep breath Walking back to Hogwarts Harry and Ron sit at a table Harry grins Harry consults his friends Filch leans close as she gives him instructions Umbridge watches from a high tower as they return to school Walking along the corridor an odd sound causes him to stop Neville hurries away from the bullying Crabbe and Goyle An intricate carving appears in the stone wall in front of him and then a large archway He turns back bewildered The doors swing open revealing a long room lined with shadowy mirrors As Neville watches the carved stone becomes a pair of huge wooden double doors"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Umbridge holds up a decree McGonagall comforts Trelawney The great main doors swing open Dumbledore appears The students watch with baited breath Umbridge smiles a knowing smile Harry pushes his way through the crowd of students but Dumbledore has gone In the common room Harry turns up the radio In the fire his image fades away into the embers A flash of lightning Lightning illuminates the room Hermione looks directly at Harry Rain streams down the diamondshaped window panes The rain turns to swirling snow briefly forming the face of Voldemort The sun rises over the snowcovered village of Hogsmeade The three friends trudge towards the decrepit Hogshead Inn They peer inside A goat walks through the bar Hermione addresses around 20 students He glances at Cho Students shift uncomfortably He sits down She takes a deep breath Harry nods Hermione Harry and Ron sit at a table Walking back to Hogwarts Harry consults his friends Harry grins Umbridge watches from a high tower as they return to school Filch leans close as she gives him instructions Neville hurries away from the bullying Crabbe and Goyle Walking along the corridor an odd sound causes him to stop He turns back bewildered An intricate carving appears in the stone wall in front of him and then a large archway As Neville watches the carved stone becomes a pair of huge wooden double doors The doors swing open revealing a long room lined with shadowy mirrors She is barefoot Harry looks up at the reptilian creature They see a baby Thestral She takes an apple from her bag The baby Thestral squawks She rolls the apple to the baby Luna throws down a piece of raw meat Ignoring the apple the baby Thestral flaps its wings and gobbles up the meat Ron gobbles a sausage at breakfast Harry approaches the table On the stairs McGonagall is affronted Filch hammers in a nail and hangs a decree Umbridge has been appointed Hogwarts' high inquisitor Pink suede shoes stalk the corridor Umbridge interrogates Professor Trelawney Snape swipes Ron The twins play tricks with a firework Umbridge destroys it Filch climbs a ladder More decrees Umbridge smiles smugly to herself Filch swings his ladder Students duck He swings it back They duck again Trelawney gapes Umbridge measures the height of tiny Professor Flitwick as he conducts the choir Trelawney's eyes look round desperately behind her huge glasses Umbridge ticks a box and leaves the classroom Students crowd into the cloisters Professor Trelawney stands in the courtyard looking devastated She sits on a trunk Filch brings out more of her luggage Umbridge comes out of the main door and approaches purposefully Professor Trelawney gets up and bumps into a suitcase She starts to weep Umbridge is unmoved"
        }
      ]
    }
  ]
}