{
  "ground_truth": "The student army faces a metal figure dressed as a cloaked Dementor holding a wand, with a target painted on its chest. Harry nods to Neville, whose wand is hurled across the room, and the Dementor's wand falls. Filch lurks behind a pillar, spotting students approaching the room, and reaches the door as it dissolves back into the stone wall. Nigel, a plucky small boy, faces Harry and prepares himself. Harry is thrown backwards. Filch, eating a huge sandwich, guards the blank wall. Ron faces Hermione, as Neville encourages him, and then Ron flies backwards. Fred collects his winnings. Outside, Filch wakes from a doze while Nigel keeps watch as everyone leaves the room through another door. A student is ushered into Umbridge's room. Nigel floats in mid-air as Harry guides Cho's wand, and she turns to look at him. Nigel plummets to the ground and tucks in, while the twins hide nearby. Red pustules break out all over Filch's face, and Umbridge snaps her pencil. Umbridge's squad, including Draco Malfoy, Crabbe, Goyle, and Filch, watches Luna skip along the corridor and go through the large wooden doors. The squad runs, the door shrinks, and they fall into a broom cupboard. Ginny Weasley's spell destroys the metal Dementor, which disintegrates into a pile of dust. She is amazed at her own skill, and her three brothers look rather put out. Harry beams and watches Cho, who gives him a shy smile. Neville is determined to succeed, and as a wand spins out of a girl's hand, Harry congratulates him. Harry smiles proudly as his pupils applaud, and the students start to leave. Ron and Hermione exchange a smile when they notice that Harry is watching Cho, who is lingering beside a mirror covered with photographs. Harry can't take his eyes off her. Ron and Hermione leave as Fred and George leave the Room of Requirement. Harry joins Cho in front of the mirror, where they both look at a moving photograph of a smiling Cedric. She smiles at him, and Cho looks up as something green and white appears above their heads. Harry gazes into her dark eyes, and their lips meet in a gentle kiss. They're standing close together, but only their lips touch, and above their heads, the bunch of mistletoe continues to grow. Ron looks blank as Harry catches his eye, and the three friends smile warmly. In a black corridor, Harry writhes in his sleep, and a snake is reflected in the shining black. The blue door and the glass sphere appear, along with the light of a wand and a figure in a room full of shelves. It's Mr. Weasley, his eyes wide with alarm. Harry's neck flexes as Mr. Weasley falls and struggles, then lies still, covered in blood. Harry wakes.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The scholar battalion confronts a metallic entity garbed as a shrouded Dementor clutching a wand, with a bullseye painted on its torso. Harry gestures to Neville, whose wand is flung across the chamber, and the Dementor's wand drops. Filch skulks behind a column, spotting scholars nearing the chamber, and reaches the portal as it dissolves back into the stone partition. Nigel, a spirited diminutive lad, confronts Harry and braces himself. Harry is propelled backwards. Filch, consuming a gigantic sandwich, guards the vacant partition. Ron confronts Hermione, as Neville urges him, and then Ron soars backwards. Fred gathers his earnings. Outside, Filch stirs from a nap while Nigel keeps watch as everyone departs the chamber through another portal. A scholar is escorted into Umbridge's chamber. Nigel hovers in mid-air as Harry directs Cho's wand, and she turns to glance at him. Nigel plunges to the ground and tucks in, while the twins conceal themselves nearby. Crimson pustules erupt all over Filch's visage, and Umbridge snaps her pencil. Umbridge's squad, including Draco Malfoy, Crabbe, Goyle, and Filch, observes Luna skip along the passageway and go through the large wooden portals. The squad sprints, the portal contracts, and they tumble into a broom cupboard. Ginny Weasley's spell obliterates the metallic Dementor, which crumbles into a heap of dust. She is astonished at her own prowess, and her three siblings appear rather discomfited. Harry beams and observes Cho, who offers him a timid smile. Neville is resolute to triumph, and as a wand whirls out of a girl's hand, Harry lauds him. Harry grins proudly as his pupils applaud, and the students begin to leave. Ron and Hermione trade a smile when they observe that Harry is watching Cho, who is lingering beside a mirror adorned with pictures. Harry can't avert his gaze from her. Ron and Hermione depart as Fred and George exit the Chamber of Requirement. Harry joins Cho in front of the mirror, where they both gaze at a moving picture of a smiling Cedric. She smiles at him, and Cho looks up as something emerald and alabaster materializes above their heads. Harry gazes into her dark eyes, and their lips unite in a tender kiss. They're standing near together, but only their lips touch, and above their heads, the cluster of mistletoe continues to expand. Ron looks blank as Harry catches his gaze, and the three companions smile warmly. In a blackened passageway, Harry squirms in his slumber, and a serpent is mirrored in the gleaming black. The blue portal and the glass orb appear, along with the light of a wand and an entity in a chamber full of racks. It's Mr. Weasley, his eyes wide with alarm. Harry's neck flexes as Mr. Weasley falls and struggles, then lies motionless, covered in blood. Harry wakes."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The student army is faced by a metal figure dressed as a cloaked Dementor holding a wand, with a target painted on its chest. Neville is nodded to by Harry, whose wand is hurled across the room, and the Dementor's wand is caused to fall. Students are spotted approaching the room by Filch, who lurks behind a pillar, and the door is reached as it dissolves back into the stone wall. Harry is faced by Nigel, a plucky small boy, as he prepares himself. Harry throws him backwards. The blank wall is guarded by Filch, eating a huge sandwich. Hermione is faced by Ron, as Neville encourages him, and then he is flown backwards. His winnings are collected by Fred. Outside, Filch is woken from a doze while everyone is watched by Nigel as they leave the room through another door. Umbridge's room is entered by a student, who is ushered in. Harry guides Cho's wand as Nigel floats in mid-air, and he is turned to look at by her. Nigel tucks in as he plummets to the ground, while the twins hide nearby. All over Filch's face, red pustules break out, and a pencil is snapped by Umbridge. Luna is watched skipping along the corridor and going through the large wooden doors by Umbridge's squad, including Draco Malfoy, Crabbe, Goyle, and Filch. The door is shrunk, and a broom cupboard is fallen into by the squad as they run. The metal Dementor is destroyed by Ginny Weasley's spell, and it is disintegrated into a pile of dust. Her own skill amazes her, and her three brothers look rather put out. Cho is watched by Harry, who beams as he receives a shy smile from her. Succeeding is determined by Neville, and as a girl's wand spins out of her hand, he is congratulated by Harry. Pride is smiled by Harry as his pupils applaud, and the students start to leave. Hermione and Ron exchange a smile, noticing Cho being watched by Harry, who is lingering beside a mirror covered with photographs. Her eyes can't be taken off by Harry. Fred and George leave the Room of Requirement, and Ron and Hermione leave. Cho is joined by Harry in front of the mirror, where a moving photograph of a smiling Cedric is looked at by them both. Harry is smiled at by her, and Cho looks up as something green and white appears above their heads. Her dark eyes are gazed into by Harry, and their lips meet his in a gentle kiss. Close together they stand, but only their lips are touched, and above their heads, the bunch of mistletoe is continued to grow. Harry's eye is caught by Ron, who looks blank, and a warm smile is shared among the three friends. Harry writhes in his sleep in a black corridor, and a snake reflects in the shining black. The blue door and the glass sphere appear, along with the light of a wand and a figure in a room full of shelves. Mr. Weasley is found, his eyes wide with alarm. Mr. Weasley's fall and struggle flex Harry's neck, and then he lies still, covered in blood. Harry wakes."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The student army confronts a metal figure dressed as a cloaked Dementor with a wand and target on its chest. Harry nods to Neville, who loses his wand, while the Dementor's wand falls. Filch, lurking behind a pillar, spots students and reaches the door as it dissolves. Nigel, a plucky boy, faces Harry but is thrown backward. Filch guards the blank wall, eating a sandwich. Ron faces Hermione, encouraged by Neville, before being flung back. Fred collects his winnings. Outside, Filch wakes from a nap as Nigel watches everyone exit through another door. A student enters Umbridge's room. Nigel floats as Harry guides Cho's wand; she turns to look at him. Nigel falls but tucks in, while the twins hide. Red pustules erupt on Filch's face as Umbridge snaps her pencil. Her squad, including Draco, Crabbe, Goyle, and Filch, sees Luna skip through wooden doors. The squad runs, the door shrinks, and they tumble into a cupboard. Ginny's spell annihilates the metal Dementor into dust; she’s amazed, while her brothers look put out. Harry beams at Cho, who smiles shyly back. Neville is determined, and Harry praises him as a wand flies out of a girl’s hand. Students applaud as Harry smiles proudly. Ron and Hermione notice Harry watching Cho by a mirror with photos. He can't look away. Ron and Hermione leave as Fred and George exit the Room of Requirement. Harry joins Cho by the mirror with a moving photo of Cedric. She smiles, and a green and white mistletoe appears. Harry gazes into her eyes, their lips meet in a tender kiss. Only their lips touch under the growing mistletoe. Ron looks blankly at Harry, and the friends share warm smiles. In a dark corridor, Harry writhes in his sleep, a snake reflected on the black. A blue door, a glass sphere, wand light, and a figure in a room full of shelves appear. It's Mr. Weasley, wide-eyed with alarm. Harry's neck tenses as Mr. Weasley falls, struggles, then lies motionless, covered in blood. Harry wakes."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The student army confronts a metal figure dressed as a cloaked Dementor with a target on its chest. Harry nods to Neville, causing Neville's wand to hurl across the room, disarming the Dementor. Filch, hidden, sees students arriving and reaches the door as it merges back into the stone wall. Nigel, a brave small boy, faces Harry before Harry is thrown back. Filch, eating a large sandwich, guards the wall. Ron, encouraged by Neville, faces Hermione and is knocked back. Fred collects his bets. Filch dozes outside while Nigel watches everyone leave the room through another door. A student is taken to Umbridge. Nigel floats and Harry guides Cho's wand, but Nigel falls while the twins hide. Red pustules appear on Filch's face, and Umbridge breaks her pencil. Umbridge's squad, including Draco, Crabbe, Goyle, and Filch, sees Luna skipping along and entering large wooden doors. The squad follows, the door shrinks, and they fall into a broom cupboard. Ginny destroys the metal Dementor with a spell, turning it to dust. Impressed by her skill, her brothers look disgruntled. Harry smiles, watching Cho, who returns his smile shyly. Neville is determined, and when a wand spins out of a girl's hand, Harry praises him. Harry proudly watches as pupils applaud and begin to leave. Ron and Hermione smile at Harry watching Cho by a photo-covered mirror. Unable to look away, Harry joins Cho at the mirror, and they see a photo of Cedric. They smile at each other, then kiss gently under mistletoe. Ron looks puzzled as Harry glances at him, and they all exchange warm smiles. In a dark corridor, Harry writhes in his sleep, seeing a snake, a blue door, and a glass sphere. Mr. Weasley, in a room of shelves, appears, eyes wide with alarm. As Mr. Weasley falls, struggling, Harry wakes."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The brave and determined student army stands united, facing a daunting challenge in the form of a metallic figure. This imposing entity is eerily dressed and designed to resemble a cloaked Dementor, clutching a wand in its hand, with a conspicuous target emblazoned on its chest. As the scene unfolds, Harry gives a reassuring nod to Neville, whose wand, unfortunately, is sent flying across the room, while the imposing Dementor's wand clatters to the ground. Meanwhile, Filch, the ever-watchful caretaker, lurks in the shadows behind a sturdy pillar, vigilantly noting students as they approach the room. He reaches the door just as it magically melds back into the solid stone wall, disappearing from view. \n\nNigel, a determined and spirited young boy, stands in front of Harry, ready to face the challenge ahead. With a sudden force, Harry is thrown backward. Filch, maintaining his staunch guard, munches on a sizable sandwich while he remains stationed near the now blank, featureless wall. Ron positions himself in front of Hermione; Neville offers words of encouragement, but despite the support, Ron is propelled backwards. Fred, amid the commotion, collects his winnings. Outside the room, Filch rouses from a nap, diligently keeping an eye out, while Nigel stands watch as the group quietly departs through an alternate exit. A student is shown into the office of Umbridge, the formidable authority figure. Inside, Nigel finds himself suspended in mid-air as Harry adeptly guides Cho’s wand, prompting her to turn and meet his gaze. In another moment of chaos, Nigel crashes to the ground, quickly tucking himself in, while the mischievous twins remain concealed nearby. Filch is abruptly afflicted with red pustules, spreading across his face, just as Umbridge’s annoyance peaks, causing her to snap her pencil in frustration.\n\nElsewhere, Umbridge's squad, comprising the likes of Draco Malfoy, Crabbe, Goyle, and Filch, keenly observes as Luna skips lightheartedly down the corridor, disappearing through the large wooden doors. The squad springs into action, racing forward, but the door suddenly shrinks, and they find themselves trapped, tumbling into a compact broom cupboard. Meanwhile, Ginny Weasley displays her impressive magical prowess, casting a spell that obliterates the metal Dementor, reducing it to a mere pile of dust. Amazed by her own capabilities, Ginny stands astonished, while her three brothers watch with a hint of dismay. Harry, filled with pride, observes Cho, who reciprocates with a shy, endearing smile. Neville, steadfast and resolute, is determined to succeed, and as a wand spins out of a nearby girl's hand, Harry offers him words of encouragement and congratulates him on his progress. Harry beams with pride as the students applaud, and gradually, they begin to make their way out. Ron and Hermione exchange a knowing smile upon noticing Harry’s focus on Cho, who lingers beside a mirror adorned with photographs. Harry finds himself captivated by her, unable to look away.\n\nAs Ron and Hermione depart, Fred and George exit the transformative Room of Requirement. Harry takes this opportunity to join Cho in front of the reflective surface, both gazing at a dynamic photograph of a smiling Cedric. She flashes him a warm smile, and as Cho glances upward, something green and white mysteriously manifests above their heads. Harry looks deeply into her dark eyes, and their lips meet in a gentle, tender kiss. Though they stand closely together, it is only their lips that softly touch, and overhead, the mistletoe continues to flourish and grow. Ron appears momentarily baffled as Harry catches his eye; the trio of friends share a genuine, warm smile. In a contrasting, shadowy corridor, Harry is tormented in his sleep, writhing and struggling, as the sinister reflection of a snake is visible in the gleaming darkness. Suddenly, a blue door and a glass sphere come into view, illuminated by the light of a wand and the presence of a figure standing in a room filled with countless shelves. The figure is unmistakably Mr. Weasley, his eyes wide with fear and alarm. Harry's neck strains as Mr. Weasley falls, battling against unseen forces, until he lies motionless, blood covering him. With a start, Harry jolts awake from the unsettling vision."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The courageous and resolute student army stands united in solidarity, bravely confronting an intimidating challenge posed by a menacing metallic figure. This formidable entity, hauntingly clad and crafted to resemble a cloaked Dementor, holds a wand in its hand, with a prominent target conspicuously emblazoned upon its chest. As the scene develops, Harry offers Neville a reassuring nod, even as Neville's wand is unfortunately sent spinning across the room, while the daunting Dementor's wand similarly clatters noisily to the ground. Meanwhile, Filch, the ever-vigilant caretaker, lurks stealthily in the shadows behind a robust pillar, meticulously taking note of the students as they approach the room. He arrives at the door precisely as it magically merges back into the solid stone wall, vanishing from sight as if it had never existed.\n\nNigel, an eager and spirited young boy, stands resolutely in front of Harry, bracing himself to tackle the daunting challenge ahead. With a sudden, unexpected force, Harry is hurled backward with considerable momentum. Filch, unwavering in his steadfast vigilance, munches on a substantial sandwich while he remains stationed near the now featureless, blank wall. Ron positions himself protectively in front of Hermione; Neville offers encouraging words of motivation, yet despite the heartfelt support, Ron is propelled backwards. Amid the clamor and commotion, Fred collects his winnings with satisfaction. Outside the room, Filch rouses from his nap, keeping a watchful eye on the surroundings, while Nigel stands guard as the group quietly slips away through an alternate exit. A student is escorted into the office of Umbridge, the stern and formidable authority figure. Inside, Nigel finds himself unexpectedly suspended in mid-air as Harry skillfully guides Cho’s wand, prompting her to turn and meet his gaze with curiosity. In another chaotic moment, Nigel crashes to the ground and quickly tucks himself in for safety, while the mischievous twins remain concealed nearby, observing. Filch is suddenly afflicted with a rash of red pustules that rapidly spread across his face, just as Umbridge’s irritation and annoyance reach a peak, causing her to snap her pencil in frustration.\n\nElsewhere in the vast corridors, Umbridge's squad, including the likes of Draco Malfoy, Crabbe, Goyle, and Filch, keenly observes as Luna skips lightheartedly down the corridor, disappearing through the large, imposing wooden doors. The squad springs into action, racing forward with urgency, but the door unexpectedly shrinks, resulting in them being trapped, tumbling into a cramped, compact broom cupboard. Meanwhile, Ginny Weasley showcases her exceptional magical prowess, casting a powerful spell that obliterates the metal Dementor, reducing it to a mere pile of dust and debris. Amazed and astonished by her own capabilities, Ginny stands in disbelief, while her three brothers look on with a hint of dismay. Harry, filled with an overwhelming sense of pride, watches Cho, who reciprocates with a shy, endearing smile. Neville, unwavering in his determination, is resolved to succeed, and as a wand spins out of a nearby girl's hand, Harry offers him words of encouragement and congratulates him on his noticeable progress. Harry beams with pride as the assembled students applaud enthusiastically, and gradually, they begin to make their way out of the room. Ron and Hermione exchange a knowing smile upon noticing Harry’s focused attention on Cho, who lingers beside a mirror adorned with photographs. Harry finds himself captivated by her presence, unable to look away.\n\nAs Ron and Hermione depart, Fred and George make their exit from the transformative Room of Requirement. Harry seizes this moment to join Cho in front of the reflective surface, both of them gazing at a dynamic photograph of a smiling Cedric. She offers him a warm and inviting smile, and as Cho glances upward, something green and white magically appears above their heads. Harry looks deeply into her dark, captivating eyes, and their lips meet in a gentle, tender kiss. Though they stand closely together, it is only their lips that softly touch, while overhead, the mistletoe continues to flourish and grow luxuriantly. Ron appears momentarily puzzled as Harry catches his eye; the trio of friends shares a genuine, warm smile of camaraderie. In stark contrast, within a shadowy, dimly-lit corridor, Harry is tormented in his restless sleep, writhing and struggling as the sinister reflection of a snake is visible in the gleaming darkness. Suddenly, a blue door and a glass sphere emerge into view, illuminated by the light of a wand and the presence of a figure standing fearfully in a room filled with countless shelves. The figure is unmistakably Mr. Weasley, his eyes wide with fear and alarm. Harry’s neck strains as Mr. Weasley falls, battling valiantly against unseen forces, until he lies motionless, covered in blood. With a sudden start, Harry jolts awake, jarred from the unsettling vision that plagued his slumber."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The student army stands resolutely before a daunting metal figure, which is meticulously crafted to resemble a cloaked Dementor, complete with a wand and a conspicuous target painted on its chest. Harry, taking charge and exuding quiet confidence, nods to Neville, who bravely acts, resulting in his wand being hurled forcefully across the room. In response, the Dementor's wand, with an almost theatrical motion, drops to the ground. Meanwhile, Filch, ever-watchful, lurks stealthily behind a pillar; his eyes keenly track the movements of students as they approach the room's entrance. Just as the door begins to dissolve and merge seamlessly back into the stone wall, Filch reaches it, observing the strange transition. In the midst of this, Nigel, a spirited and diminutive boy, steps forward to face Harry, mentally steeling himself for what is to come. Suddenly, Harry finds himself propelled backwards by an unseen force. In another part of the room, Filch, nonchalantly munching on a substantial sandwich, stands vigilant, guarding the now blank wall with a determined posture. Across the room, Ron squares up to Hermione, while Neville offers him some encouragement; Ron then experiences being launched backwards in a dramatic fashion. Nearby, Fred is already bustling with energy as he gathers his winnings with a sense of triumph. Outside, Filch stirs from a light doze, reorienting himself, while Nigel conscientiously keeps a lookout, ensuring that everyone makes their way out of the room through an unobtrusive alternate door. Simultaneously, a student is escorted into Umbridge's room, adding an air of tension. Within the magical practice room, Nigel suddenly finds himself suspended in mid-air; Harry steps in to guide Cho's wand, prompting her to turn and glance at him with curiosity. Just then, Nigel begins a rapid descent to the floor, instinctively curling into himself for protection, whilst the twins remain hidden nearby, stifling laughter. Red pustules inexplicably erupt over Filch's face, causing alarm, as Umbridge sharply snaps her pencil in response to the chaos. Umbridge's squad, an authoritative group including Draco Malfoy, Crabbe, Goyle, and Filch, observe Luna skipping lightly down the corridor before she disappears through the grand wooden doors. The squad bounds forward, only to comically stumble and tumble into a suddenly shrinking broom cupboard. Inside the practice room, Ginny Weasley executes a spell with remarkable precision, obliterating the metal Dementor which dramatically disintegrates into a pile of fine dust. She stands momentarily stunned by her own prowess, while her three brothers, Fred, George, and Ron, appear somewhat disconcerted by her display of skill. Amidst the aftermath, Harry beams with pride, casting a fond glance at Cho, who meets his gaze with a shy smile. Neville, fueled by determination, persists, ultimately succeeding as a wand spins off from a girl's hand; Harry congratulates him, his pride palpable. The students erupt in applause, acknowledging Harry's leadership as they begin to file out. As Ron and Hermione exchange a knowing smile, they catch sight of Harry's unwavering gaze fixed on Cho, who lingers beside a mirror adorned with photographs. Ron and Hermione exit, while Fred and George make their way out of the Room of Requirement. Harry lingers, joining Cho before the mirror where they both gaze at a moving photograph of a smiling Cedric, a moment of shared reflection. She meets his eyes with a smile, and Cho glances upwards as an ethereal green and white mistletoe grows above them. Harry, his gaze steady, looks into her dark eyes, and gently, their lips meet in a tender kiss, their proximity intimate yet only their lips touching. Above them, the mistletoe continues to flourish. At this moment, Ron, looking somewhat blank, catches Harry's eye, and a warm smile is shared among the friends. Elsewhere, in a dimly lit corridor, Harry thrashes in restless sleep, haunted by a serpent's reflection gleaming in the obsidian blackness. Images of a blue door, a mysterious glass sphere, a wand's glow, and a shadowy figure surrounded by shelves flood his mind. It's Mr. Weasley, his eyes wide with alarm, and as Harry's neck tenses, Mr. Weasley is seen collapsing, struggling on the floor before lying still, blood obscuring his features. Abruptly, Harry awakens, startled and disoriented."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The student army confronts a metal figure resembling a cloaked Dementor with a target on its chest. Observing the scene, Harry nods to Neville, resulting in both wands being disarmed, while Filch is seen approaching the room, only to witness the door blend seamlessly into the wall. Meanwhile, Nigel, a resolute young student, steps up to face Harry and prepares as Harry is thrust backward. Filch, munching on a large sandwich, watches over the blank wall, while Ron, encouraged by Neville, also attempts and is sent flying backward. Fred revels in his victory. Outside, Filch awakes as Nigel keeps vigil, ensuring a smooth departure of students through another exit. A student is escorted into Umbridge's room. Within, Nigel levitates while Harry assists Cho with her wand technique; she acknowledges him with a glance. Soon after, Nigel descends safely as the twins conceal themselves nearby. Filch suffers a sudden outbreak of red pustules, and Umbridge breaks her pencil in frustration. Her squad, with Draco Malfoy, Crabbe, Goyle, and Filch, observes Luna skipping through a corridor before disappearing through large doors. Attempting to follow, the squad ends up in a broom cupboard as the door shrinks. Ginny Weasley demonstrates her prowess by obliterating the metal Dementor, leaving her amazed and her brothers rather envious. Harry, smiling, observes Cho, who returns his gaze with a shy smile. Neville, showing persistence, impresses Harry as a wand escapes a girl's grasp, earning him congratulations. With pride, Harry smiles as the students applaud and begin their departure. Ron and Hermione exchange a knowing smile, noting Harry's attention fixed on Cho, who lingers by a photograph-covered mirror. As Ron and Hermione leave with Fred and George, Harry approaches Cho and together they admire a moving photo of a smiling Cedric. Sharing a smile, they both look up to see mistletoe above them, leading to a gentle kiss. Ron remains puzzled as Harry acknowledges him, and the three friends share a warm smile. In a dark corridor, Harry is seen tossing in his sleep, images of a snake and a blue door with a glass sphere, wand light, and a room of shelves filling his mind. Mr. Weasley, eyes wide in alarm, appears, struggling and eventually lying still in a pool of blood, prompting Harry to wake abruptly."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The student army, assembled in the Room of Requirement, an enchanted space at Hogwarts that transforms to meet the needs of those who seek it, faces a metal figure dressed as a cloaked Dementor, a feared creature from Azkaban known for feeding on human happiness, holding a wand, with a target painted on its chest. Harry, leader of Dumbledore's Army, nods to Neville, whose wand is hurled across the room by an unseen force, and the Dementor's wand falls to the ground. Argus Filch, the cantankerous caretaker of Hogwarts, lurks behind a pillar, spotting students approaching the room, and reaches the door just as it dissolves back into the stone wall due to the room's protective magic. Nigel, a plucky small boy with an unyielding spirit, faces Harry and prepares himself for the lesson. Harry is thrown backwards by a practiced spell. Filch, eating a huge sandwich from the kitchens, guards the blank wall that conceals the room's entrance. Ron faces Hermione, as Neville encourages him with a supportive cheer, and then Ron flies backwards due to a well-timed hex. Fred, known for his mischievous nature, collects his winnings from a bet. Outside, Filch wakes from a doze while Nigel keeps watch as everyone leaves the room through another hidden door. A student is ushered into Umbridge's room, the office of the despised High Inquisitor appointed by the Ministry. Nigel floats in mid-air as Harry guides Cho's wand, and she turns to look at him, impressed by his teaching. Nigel plummets to the ground and tucks in with a practiced roll, while the twins, Fred and George Weasley, hide nearby, enjoying the chaos. Red pustules break out all over Filch's face from a prank spell, and Umbridge, known for her authoritarian rule, snaps her pencil in frustration. Umbridge's squad, including the notorious Draco Malfoy and his cronies Crabbe and Goyle, along with Filch, watches Luna Lovegood, a whimsical and often underestimated student, skip along the corridor and go through the large wooden doors. The squad runs, the door shrinks due to the room's enchantments, and they fall into a broom cupboard in comical disarray. Ginny Weasley's spell, demonstrating her growing magical prowess, destroys the metal Dementor, which disintegrates into a pile of dust. She is amazed at her own skill, and her three brothers look rather put out, feeling a mix of pride and sibling rivalry. Harry beams and watches Cho, who gives him a shy smile, a gesture that hints at their developing connection. Neville, determined to succeed despite past struggles, manages to disarm an opponent, and as a wand spins out of a girl's hand, Harry congratulates him on his improvement. Harry smiles proudly as his pupils applaud, and the students start to leave the transformed room. Ron and Hermione exchange a smile when they notice that Harry is watching Cho, who is lingering beside a mirror covered with photographs, one of which shows Cedric Diggory, a reminder of the Triwizard Tournament's tragic conclusion. Harry can't take his eyes off her, captivated by her presence. Ron and Hermione leave as Fred and George depart the Room of Requirement, looking pleased with their latest antics. Harry joins Cho in front of the mirror, where they both look at a moving photograph of a smiling Cedric, a poignant reminder of their shared past. She smiles at him, and Cho looks up as something green and white, a sprig of magical mistletoe, appears above their heads. Harry gazes into her dark eyes, and their lips meet in a gentle kiss, a momentous first for them. They're standing close together, but only their lips touch, and above their heads, the bunch of enchanted mistletoe continues to grow, unnoticed. Ron looks blank as Harry catches his eye, and the three friends smile warmly at each other, sharing in Harry's happiness. In a black corridor, Harry writhes in his sleep, tormented by dreams, and a snake is reflected in the shining black, reminiscent of the serpent-like qualities of Voldemort. The blue door and the glass sphere, symbols of prophecies and their mysterious power, appear, along with the light of a wand and a figure in a room full of shelves at the Department of Mysteries. It's Mr. Weasley, his eyes wide with alarm, a victim of an attack. Harry's neck flexes as Mr. Weasley falls and struggles, then lies still, covered in blood, a vision too real to be just a nightmare. Harry wakes, shaken by the dream's vividness and the lingering sense of dread."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The student army faces a metal figure dressed as a cloaked Dementor holding a wand with a target painted on its chest. Harry nods to Neville whose wand is hurled across the room and the Dementor's wand falls. Filch lurks behind a pillar spotting students approaching the room and reaches the door as it dissolves back into the stone wall. Nigel a plucky small boy faces Harry and prepares himself. Harry is thrown backwards. Filch eating a huge sandwich guards the blank wall. Ron faces Hermione as Neville encourages him and then Ron flies backwards. Fred collects his winnings. Outside. Filch wakes from a doze while Nigel keeps watch as everyone leaves the room through another door. A student is ushered into Umbridge's room. Nigel floats in midair as Harry guides Cho's wand and she turns to look at him. Nigel plummets to the ground and tucks in while the twins hide nearby. Red pustules break out all over Filch's face and Umbridge snaps her pencil. Umbridge's squad including Draco Malfoy Crabbe Goyle and Filch watches Luna skip along the corridor and go through the large wooden doors. The squad runs the door shrinks and they fall into a broom cupboard. Ginny Weasley's spell destroys the metal Dementor which disintegrates into a pile of dust. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. She is amazed at her own skill and her three brothers look rather put out. Harry beams and watches Cho who gives him a shy smile. Neville is determined to succeed and as a wand spins out of a girl's hand Harry congratulates him. Harry smiles proudly as his pupils applaud and the students start to leave. Ron and Hermione exchange a smile when they notice that Harry is watching Cho who is lingering beside a mirror covered with photographs. Harry cannot take his eyes off her. Ron and Hermione leave as Fred and George leave the Room of Requirement. Harry joins Cho in front of the mirror where they both look at a moving photograph of a smiling Cedric. She smiles at him and Cho looks up as something green and white appears above their heads. Harry gazes into her dark eyes and their lips meet in a gentle kiss. They are standing close together but only their lips touch and above their heads the bunch of mistletoe continues to grow. Ron looks blank as Harry catches his eye and the three friends smile warmly. In a black corridor Harry writhes in his sleep and a snake is reflected in the shining black. The blue door and the glass sphere appear along with the light of a wand and a figure in a room full of shelves. It is Mr Weasley his eyes wide with alarm. Harry's neck flexes as Mr Weasley falls and struggles then lies still covered in blood. Harry wakes."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The student army faces a metal figure dressed as a cloaked Dementor holding a wand with a target painted on its chest. Harry nods to Neville whose wand is hurled across the room and the Dementor's wand falls. Filch lurks behind a pillar spotting students approaching the room and reaches the door as it dissolves back into the stone wall. Nigel a plucky small boy faces Harry and prepares himself. Harry is thrown backwards. Filch eating a huge sandwich guards the blank wall. Ron faces Hermione as Neville encourages him and then Ron flies backwards. Fred collects his winnings. Outside. Filch wakes from a doze while Nigel keeps watch as everyone leaves the room through another door. A student is ushered into Umbridge's room. Nigel floats in midair as Harry guides Cho's wand and she turns to look at him. Nigel plummets to the ground and tucks in while the twins hide nearby. Red pustules break out all over Filch's face and Umbridge snaps her pencil. Umbridge's squad including Draco Malfoy Crabbe Goyle and Filch watches Luna skip along the corridor and go through the large wooden doors. The squad runs the door shrinks and they fall into a broom cupboard. Ginny Weasley's spell destroys the metal Dementor which disintegrates into a pile of dust. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. She is amazed at her own skill and her three brothers look rather put out. Harry beams and watches Cho who gives him a shy smile. Neville is determined to succeed and as a wand spins out of a girl's hand Harry congratulates him. Harry smiles proudly as his pupils applaud and the students start to leave. Ron and Hermione exchange a smile when they notice that Harry is watching Cho who is lingering beside a mirror covered with photographs. Harry cannot take his eyes off her. Ron and Hermione leave as Fred and George leave the Room of Requirement. Harry joins Cho in front of the mirror where they both look at a moving photograph of a smiling Cedric. She smiles at him and Cho looks up as something green and white appears above their heads. Harry gazes into her dark eyes and their lips meet in a gentle kiss. They are standing close together but only their lips touch and above their heads the bunch of mistletoe continues to grow. Ron looks blank as Harry catches his eye and the three friends smile warmly. In a black corridor Harry writhes in his sleep and a snake is reflected in the shining black. The blue door and the glass sphere appear along with the light of a wand and a figure in a room full of shelves. It is Mr Weasley his eyes wide with alarm. Harry's neck flexes as Mr Weasley falls and struggles then lies still covered in blood. Harry wakes."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The student army faces a metal figure dressed as a cloaked Dementor holding a wand with a target painted on its chest. Harry nods to Neville whose wand is hurled across the room and the Dementor's wand falls. Filch lurks behind a pillar spotting students approaching the room and reaches the door as it dissolves back into the stone wall. Nigel a plucky small boy faces Harry and prepares himself. Harry is thrown backwards. Filch eating a huge sandwich guards the blank wall. Ron faces Hermione as Neville encourages him and then Ron flies backwards. Fred collects his winnings. Outside. Harry gazes into her dark eyes and their lips meet in a gentle kiss. They are standing close together but only their lips touch and above their heads the bunch of mistletoe continues to grow. Ron looks blank as Harry catches his eye and the three friends smile warmly. In a black corridor Harry writhes in his sleep and a snake is reflected in the shining black. The blue door and the glass sphere appear along with the light of a wand and a figure in a room full of shelves. It is Mr Weasley his eyes wide with alarm. Harry's neck flexes as Mr Weasley falls and struggles then lies still covered in blood. Harry wakes."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The student army faces a metal figure dressed as a cloaked Dementor holding a wand with a target painted on its chest. Harry nods to Neville whose wand is hurled across the room and the Dementor's wand falls. Filch lurks behind a pillar spotting students approaching the room and reaches the door as it dissolves back into the stone wall. Nigel a plucky small boy faces Harry and prepares himself. It is Mr Weasley his eyes wide with alarm. Harry's neck flexes as Mr Weasley falls and struggles then lies still covered in blood. Harry wakes."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The chef orchestra confronts a wooden butterfly disguised as a wrapped scarecrow holding a trumpet, with a puzzle etched on its forehead. Lucy winks to Oliver, whose trumpet is flung across the cave, and the scarecrow's trumpet tumbles. Marge skulks behind a tree, noticing chefs advancing toward the cave, and reaches the entrance as it melts back into the mossy hill. Benny, a brave tiny frog, confronts Lucy and braces himself. Lucy is swept forwards. Marge, munching a massive apple, protects the blank hill. Bob confronts Alice, as Oliver cheers him, and then Bob dives forwards. Greg gathers his marbles. Outside, Marge drifts into a trance while Benny guards as everyone exits the cave through another staircase. A chef is lured into Agatha's cave. Benny glides in mid-air as Lucy steers Daisy's trumpet, and she spins to glance at him. Benny spirals to the water and curls up, while the turtles rest nearby. Blue feathers sprout all over Marge's hand, and Agatha crushes her spoon. Agatha's platoon, including Patrick Peanut, Nigel, Arnold, and Marge, observes Lucy hop along the bridge and enter the tiny metal tunnels. The platoon flies, the tunnel expands, and they trip into a candy jar. Daisy Plum's potion repairs the wooden scarecrow, which morphs into a heap of glitter. She is thrilled at her own mastery, and her four cousins look rather spaced out. Lucy grins and observes Daisy, who gives her a curious glance. Oliver is eager to fail, and as a trumpet twirls out of a boy's hand, Lucy applauds him. Lucy chuckles shyly as her dragons cheer, and the chefs begin to vanish. Bob and Alice swap a joke when they spot that Lucy is observing Daisy, who is lingering beside a curtain concealed with paintings. Lucy can't take her mind off her. Bob and Alice disappear as Greg and George exit the Trove of Whispers. Lucy joins Daisy in front of the curtain, where they both gaze at a drifting painting of a winking Paul. She laughs at him, and Daisy notices up as something red and yellow emerges below their feet. Lucy peers into her bright eyes, and their fingers brush in a tender hug. They're standing far apart, but only their fingers touch, and below their feet, the ring of daisies continues to shrink. Bob looks lost as Lucy snags her foot, and the five turtles giggle softly. In a green cave, Lucy dances in her dream, and a forest is mirrored in the glowing green. The red gate and the wooden cube appear, along with the shade of a trumpet and a ghost in a field full of vines. It's Mr. Plum, his ears large with surprise. Lucy's nose bends as Mr. Plum spins and dances, then stands tall, covered in syrup. Lucy dreams."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The student army encounters a metal figure resembling a Dementor with a target on its chest. Harry signals Neville, whose wand is thrown across the room, causing the Dementor's wand to fall. Filch, spying on the students, reaches the door as it vanishes into the wall. Nigel, a brave boy, faces Harry and prepares, but Harry is thrown backwards. Filch, munching on a sandwich, guards the wall. Ron and Hermione have a moment before Ron is also thrown back. Fred collects winnings as Nigel watches students exit through another door. In Umbridge's room, Nigel floats as Harry guides Cho's wand, resulting in Nigel falling safely. Filch's face breaks out in pustules as Umbridge's squad, including Draco, Crabbe, Goyle, and Filch, chases Luna, but the door shrinks, trapping them in a cupboard. Ginny destroys the Dementor, impressing herself and surprising her brothers. Harry beams at Cho, who smiles shyly back. Neville shows determination, and Harry congratulates him. The students leave as Harry watches Cho by a photo-covered mirror. He joins her, and they share a gentle kiss under expanding mistletoe. Ron and Hermione exchange smiles as Harry and Cho look at a moving photo of Cedric. Later, in a dark corridor, Harry dreams of Mr. Weasley being attacked, waking distressed."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Harry wakes Harry's neck flexes as Mr Weasley falls and struggles then lies still covered in blood It is Mr Weasley his eyes wide with alarm The blue door and the glass sphere appear along with the light of a wand and a figure in a room full of shelves In a black corridor Harry writhes in his sleep and a snake is reflected in the shining black Ron looks blank as Harry catches his eye and the three friends smile warmly They are standing close together but only their lips touch and above their heads the bunch of mistletoe continues to grow Harry gazes into her dark eyes and their lips meet in a gentle kiss She smiles at him and Cho looks up as something green and white appears above their heads Harry joins Cho in front of the mirror where they both look at a moving photograph of a smiling Cedric Ron and Hermione leave as Fred and George leave the Room of Requirement Harry cannot take his eyes off her Ron and Hermione exchange a smile when they notice that Harry is watching Cho who is lingering beside a mirror covered with photographs Harry smiles proudly as his pupils applaud and the students start to leave Neville is determined to succeed and as a wand spins out of a girl's hand Harry congratulates him Harry beams and watches Cho who gives him a shy smile She is amazed at her own skill and her three brothers look rather put out Ginny Weasley's spell destroys the metal Dementor which disintegrates into a pile of dust The squad runs the door shrinks and they fall into a broom cupboard Umbridge's squad including Draco Malfoy Crabbe Goyle and Filch watches Luna skip along the corridor and go through the large wooden doors Red pustules break out all over Filch's face and Umbridge snaps her pencil Nigel plummets to the ground and tucks in while the twins hide nearby Nigel floats in midair as Harry guides Cho's wand and she turns to look at him A student is ushered into Umbridge's room Filch wakes from a doze while Nigel keeps watch as everyone leaves the room through another door Outside Fred collects his winnings Ron faces Hermione as Neville encourages him and then Ron flies backwards Filch eating a huge sandwich guards the blank wall Harry is thrown backwards Nigel a plucky small boy faces Harry and prepares himself Filch lurks behind a pillar spotting students approaching the room and reaches the door as it dissolves back into the stone wall Harry nods to Neville whose wand is hurled across the room and the Dementor's wand falls The student army faces a metal figure dressed as a cloaked Dementor holding a wand with a target painted on its chest"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Harry nods to Neville whose wand is hurled across the room and the Dementor's wand falls The student army faces a metal figure dressed as a cloaked Dementor holding a wand with a target painted on its chest Nigel a plucky small boy faces Harry and prepares himself Filch lurks behind a pillar spotting students approaching the room and reaches the door as it dissolves back into the stone wall Filch eating a huge sandwich guards the blank wall Harry is thrown backwards Fred collects his winnings Ron faces Hermione as Neville encourages him and then Ron flies backwards Filch wakes from a doze while Nigel keeps watch as everyone leaves the room through another door Outside Nigel floats in midair as Harry guides Cho's wand and she turns to look at him A student is ushered into Umbridge's room Red pustules break out all over Filch's face and Umbridge snaps her pencil Nigel plummets to the ground and tucks in while the twins hide nearby The squad runs the door shrinks and they fall into a broom cupboard Umbridge's squad including Draco Malfoy Crabbe Goyle and Filch watches Luna skip along the corridor and go through the large wooden doors She is amazed at her own skill and her three brothers look rather put out Ginny Weasley's spell destroys the metal Dementor which disintegrates into a pile of dust Neville is determined to succeed and as a wand spins out of a girl's hand Harry congratulates him Harry beams and watches Cho who gives him a shy smile Ron and Hermione exchange a smile when they notice that Harry is watching Cho who is lingering beside a mirror covered with photographs Harry smiles proudly as his pupils applaud and the students start to leave Ron and Hermione leave as Fred and George leave the Room of Requirement Harry cannot take his eyes off her She smiles at him and Cho looks up as something green and white appears above their heads Harry joins Cho in front of the mirror where they both look at a moving photograph of a smiling Cedric They are standing close together but only their lips touch and above their heads the bunch of mistletoe continues to grow Harry gazes into her dark eyes and their lips meet in a gentle kiss In a black corridor Harry writhes in his sleep and a snake is reflected in the shining black Ron looks blank as Harry catches his eye and the three friends smile warmly It is Mr Weasley his eyes wide with alarm The blue door and the glass sphere appear along with the light of a wand and a figure in a room full of shelves Harry wakes Harry's neck flexes as Mr Weasley falls and struggles then lies still covered in blood"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She is amazed at her own skill and her three brothers look rather put out Harry beams and watches Cho who gives him a shy smile Neville is determined to succeed and as a wand spins out of a girl's hand Harry congratulates him Harry smiles proudly as his pupils applaud and the students start to leave Ron and Hermione exchange a smile when they notice that Harry is watching Cho who is lingering beside a mirror covered with photographs Harry cannot take his eyes off her Ron and Hermione leave as Fred and George leave the Room of Requirement Harry joins Cho in front of the mirror where they both look at a moving photograph of a smiling Cedric She smiles at him and Cho looks up as something green and white appears above their heads Harry gazes into her dark eyes and their lips meet in a gentle kiss They are standing close together but only their lips touch and above their heads the bunch of mistletoe continues to grow Ron looks blank as Harry catches his eye and the three friends smile warmly In a black corridor Harry writhes in his sleep and a snake is reflected in the shining black The blue door and the glass sphere appear along with the light of a wand and a figure in a room full of shelves It is Mr Weasley his eyes wide with alarm Harry's neck flexes as Mr Weasley falls and struggles then lies still covered in blood Harry wakes The student army faces a metal figure dressed as a cloaked Dementor holding a wand with a target painted on its chest Harry nods to Neville whose wand is hurled across the room and the Dementor's wand falls Filch lurks behind a pillar spotting students approaching the room and reaches the door as it dissolves back into the stone wall Nigel a plucky small boy faces Harry and prepares himself Harry is thrown backwards Filch eating a huge sandwich guards the blank wall Ron faces Hermione as Neville encourages him and then Ron flies backwards Fred collects his winnings Outside Filch wakes from a doze while Nigel keeps watch as everyone leaves the room through another door A student is ushered into Umbridge's room Nigel floats in midair as Harry guides Cho's wand and she turns to look at him Nigel plummets to the ground and tucks in while the twins hide nearby Red pustules break out all over Filch's face and Umbridge snaps her pencil Umbridge's squad including Draco Malfoy Crabbe Goyle and Filch watches Luna skip along the corridor and go through the large wooden doors The squad runs the door shrinks and they fall into a broom cupboard Ginny Weasley's spell destroys the metal Dementor which disintegrates into a pile of dust"
        }
      ]
    }
  ]
}