{
  "ground_truth": "Professor McGonagall and Ron help Harry to Dumbledore's study, where Ginny is present with the twins, and Dumbledore turns from the moving portraits to face Harry as Professor Snape approaches from behind. Snape takes Harry down to his storeroom, raises his wand, and Harry's body goes rigid; he gasps in agony as his mind fills with terrifying memories. The wind sends a flurry of snowflakes in all directions, and the snow begins to settle on the towers and turrets of Hogwarts School as the screen turns white. Children throw snowballs outside the London house, where the kitchen is decorated for Christmas, and Mr. Weasley is brought in, looking battered and bruised, sitting in a wheelchair and wearing a paper hat. Standing in the doorway, Sirius raises his glass and winks, donning a knitted jerkin. Harry finds a room where the walls are covered with a tapestry sewn with names and faces, the house elf startles him and skulks off, and Sirius's image has been burnt away. Sirius embraces Harry and hugs him affectionately before Harry joins Hermione. Sirius looks back at the family tree and his own obliterated face, then closes the door. A gray sky is reflected in the river as Hogwarts School stands high on the cliffs above. Harry chats with Cho as they walk through the courtyard until Hermione finds them, prompting Harry to turn to Cho and then hurry off with Hermione. Harry, Ron, and Hermione run down the hill towards Hagrid's cottage, where a faint plume of smoke rises from the chimney, and they hide as Umbridge comes out wearing a fluffy purple coat over her pink dress. She sniffs, wrinkles her nose, sprays herself with perfume, and then sprays a cross on the cottage door. Inside, Hagrid's face is red and bruised, holding a raw steak to his eye while the huge dog gobbles it eagerly, as the wind blows wisps of straw across the room and Hagrid looks out of the window. A flash of lightning reveals a snake tattooed on a man's arm that twists and writhes. A woman with wild hair runs her tongue over a snake tattooed on her arm, hears an explosion, and escapes through a gaping hole while wearing striped prison clothes. Dementors circle high above the prison, a colossal triangular tower surrounded by an angry sea. Neville slowly closes the newspaper at breakfast, as a cozy fire burns in the Room of Requirement. Harry joins Neville, who is looking at a photograph stuck up on the mirror, the photograph that Sirius gave Harry at the station, which includes Neville's parents as part of the group. Harry nods reassuringly and looks at his own parents. A horse, an otter for Hermione, a dog for Ron, and Luna produces a hare, which leaps joyfully over their heads, while Harry grins proudly as the chandelier begins to shake.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Professor McGonagall and Ron assist Harry to Dumbledore's office, where Ginny is present with the twins, and Dumbledore turns from the shifting portraits to face Harry as Professor Snape approaches from behind. Snape escorts Harry down to his storeroom, elevates his wand, and Harry's body becomes rigid; he gasps in agony as his mind fills with terrifying recollections. The breeze sends a flurry of snowflakes in all directions, and the snow begins to settle on the towers and turrets of Hogwarts School as the screen turns white. Children toss snowballs outside the London house, where the kitchen is decorated for Christmas, and Mr. Weasley is brought in, appearing battered and bruised, sitting in a wheelchair and wearing a paper hat. Standing in the doorway, Sirius lifts his glass and winks, wearing a knitted jerkin. Harry locates a chamber where the walls are adorned with a tapestry sewn with names and faces, the house elf startles him and skulks off, and Sirius's likeness has been burnt away. Sirius embraces Harry and hugs him affectionately before Harry joins Hermione. Sirius looks back at the family tree and his own obliterated face, then closes the door. A gray sky is mirrored in the river as Hogwarts School stands high on the cliffs above. Harry converses with Cho as they stroll through the courtyard until Hermione finds them, prompting Harry to turn to Cho and then hurry off with Hermione. Harry, Ron, and Hermione sprint down the hill towards Hagrid's cottage, where a faint plume of smoke rises from the chimney, and they conceal themselves as Umbridge emerges wearing a fluffy purple coat over her pink dress. She sniffs, wrinkles her nose, sprays herself with fragrance, and then sprays a cross on the cottage door. Inside, Hagrid's face is red and bruised, holding a raw steak to his eye while the giant dog devours it eagerly, as the breeze blows wisps of straw across the room and Hagrid looks out of the window. A flash of lightning reveals a snake tattooed on a man's arm that twists and writhes. A woman with wild hair runs her tongue over a snake tattooed on her arm, hears an explosion, and escapes through a gaping hole while wearing striped prison garments. Dementors circle high above the prison, a colossal triangular tower surrounded by an angry sea. Neville slowly closes the newspaper at breakfast, as a cozy fire burns in the Room of Requirement. Harry joins Neville, who is looking at a photograph affixed to the mirror, the photograph that Sirius gave Harry at the station, which includes Neville's parents as part of the group. Harry nods reassuringly and looks at his own parents. A horse, an otter for Hermione, a dog for Ron, and Luna produces a hare, which leaps joyfully over their heads, while Harry grins proudly as the chandelier begins to shake."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Harry is helped to Dumbledore's study by Professor McGonagall and Ron, where Ginny is present with the twins, and Harry is faced by Dumbledore, who turns from the moving portraits, as Professor Snape approaches from behind. Harry is taken down to Snape's storeroom by him, and Snape raises his wand; Harry's body goes rigid, and he gasps in agony as terrifying memories fill his mind. A flurry of snowflakes is sent in all directions by the wind, and the snow begins to settle on the towers and turrets of Hogwarts School as the screen turns white. Outside the London house, snowballs are thrown by children, where the kitchen is decorated for Christmas; Mr. Weasley, looking battered and bruised, is brought in sitting in a wheelchair and wearing a paper hat. Sirius stands in the doorway, raises his glass, and winks, donning a knitted jerkin. A room is found by Harry, where the walls are covered with a tapestry sewn with names and faces; the house elf startles him and skulks off, and Sirius's image has been burnt away. Harry is embraced by Sirius and hugged affectionately before Hermione is joined by Harry. Sirius looks back at the family tree and his own obliterated face, then the door is closed by him. The river reflects a gray sky as Hogwarts School stands high on the cliffs above. Cho is chatted with by Harry as they walk through the courtyard until Hermione finds them, prompting Cho to be turned to by Harry before Hermione hurries off with him. Down the hill, Harry, Ron, and Hermione run towards Hagrid's cottage, where a faint plume of smoke rises from the chimney, and as Umbridge comes out wearing a fluffy purple coat over her pink dress, they hide. Her nose is wrinkled, and perfume is sprayed by her, and then a cross is sprayed on the cottage door. Inside, Hagrid's face is bruised and red, holding a raw steak to his eye while the huge dog gobbles it eagerly, as wisps of straw are blown across the room by the wind, and Hagrid looks out of the window. A snake tattooed on a man's arm is revealed by a flash of lightning as it twists and writhes. Her tongue is run over a snake tattooed on her arm by a woman with wild hair, an explosion is heard, and through a gaping hole, she escapes while wearing striped prison clothes. The prison is circled by Dementors, a colossal triangular tower surrounded by an angry sea. The newspaper is slowly closed by Neville at breakfast, as a cozy fire burns in the Room of Requirement. Neville is joined by Harry, who is looking at a photograph stuck up on the mirror, the photograph that Sirius gave Harry at the station, which includes Neville's parents as part of the group. Reassuringly, Harry nods and looks at his own parents. A horse is produced, an otter for Hermione, a dog for Ron, and Luna produces a hare, which joyfully leaps over their heads, while Harry grins proudly as the chandelier begins to shake."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Professor McGonagall and Ron escort Harry to Dumbledore's study, where Ginny and the twins wait. Dumbledore turns from the portraits, and Snape arrives to lead Harry to his storeroom. Snape raises his wand, making Harry's body stiffen as painful memories flood his mind. Snowflakes swirl and settle on Hogwarts' towers, turning the screen white. In London, children throw snowballs outside a house adorned for Christmas. Mr. Weasley, battered and bruised, sits in a wheelchair wearing a paper hat as Sirius, in a knitted jerkin, raises his glass and winks. Harry discovers a room with a tapestry of names; startled by a house elf, he notices Sirius's image burned away. Sirius embraces Harry before Harry joins Hermione. Sirius gazes at the family tree, sees his erased face, and closes the door. Hogwarts stands high on cliffs above a river under a gray sky. Harry and Cho chat in the courtyard until Hermione approaches, prompting Harry to leave with her. Harry, Ron, and Hermione race to Hagrid's cottage, hiding as Umbridge exits in a fluffy purple coat, marking the door with perfume. Inside, Hagrid, red and bruised, holds a steak to his eye while his dog devours it. A snake tattoo on a man's arm twists as lightning flashes. A woman with wild hair, wearing striped prison clothes, licks her snake tattoo, hears an explosion, and escapes. Dementors circle a triangular tower in a turbulent sea. Neville closes the newspaper in the Room of Requirement, where a fire burns cozily. Harry joins Neville, who examines a photograph from Sirius, featuring Neville's parents. Harry nods and glances at his parents. Hermione's otter, Ron's dog, and Luna's hare jump joyfully, while Harry smiles as the chandelier starts to shake."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Professor McGonagall and Ron assist Harry to Dumbledore's study, where Ginny and the twins are present. Dumbledore faces Harry as Snape approaches, leading Harry to his storeroom. Snape immobilizes Harry, triggering painful memories. Snow falls on Hogwarts, turning the screen white. Outside a London house decorated for Christmas, children throw snowballs. Mr. Weasley, battered in a wheelchair, wears a paper hat. Sirius winks and raises his glass in a knitted jerkin. Harry sees a tapestry with names; a house elf startles him, and Sirius’s image is burned away. Sirius hugs Harry affectionately. Returning to Hermione, Sirius observes his obliterated face on the family tree and closes the door. A gray sky reflects in the river beneath Hogwarts. Harry talks with Cho in the courtyard until Hermione arrives, prompting Harry to leave with her. They and Ron run to Hagrid's cottage, hiding as Umbridge, in a fluffy purple coat, marks the door with perfume. Inside, Hagrid tends to a bruise with steak as a dog eats. Lightning reveals a tattoo on a man's arm. A wild-haired woman with a snake tattoo escapes through a hole during an explosion. Dementors hover over a prison tower in a turbulent sea. At breakfast, Neville closes a newspaper; a cozy fire burns nearby. Harry joins Neville, looking at a photograph featuring Neville's parents. Harry nods reassuringly at Neville and looks at his own parents. A horse, otter, dog, and hare Patronus leap overhead as Harry smiles proudly, and the chandelier shakes."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Professor McGonagall and Ron carefully assist Harry as they make their way to Dumbledore's study, where they encounter Ginny along with the Weasley twins. Dumbledore, who is initially focused on the moving portraits that line the walls, turns his attention to Harry just as Professor Snape approaches silently from behind them. With purposeful movements, Snape escorts Harry down to his storeroom, where he solemnly raises his wand, causing Harry's entire body to go rigid. Harry gasps in pain as his mind becomes overwhelmed with terrifying, haunting memories. Meanwhile, outside, the wind scatters a flurry of snowflakes in every possible direction, and the snow starts to settle gracefully on the majestic towers and turrets of Hogwarts School as the screen dramatically fades to white.\n\nChildren joyfully throw snowballs outside a London house, where the kitchen is lovingly decorated for the festive Christmas season. Mr. Weasley is brought into the scene, looking battered, bruised, and weary, as he sits in a wheelchair adorned with a festive paper hat. In the doorway, Sirius stands with a glass in hand, winking with a mischievous glint in his eye as he dons a warm knitted jerkin. Harry enters a room where the walls are completely covered with an intricately sewn tapestry, displaying names and faces. The house elf unexpectedly startles him and then skulks off quietly, leaving behind the image of Sirius, which has been burnt away from the tapestry. Sirius embraces Harry warmly, holding him in an affectionate hug before Harry moves on to join Hermione. As Sirius looks back at the family tree, he sees his own face has been obliterated, and he gently closes the door behind him.\n\nA gray, overcast sky reflects ominously in the river below, while Hogwarts School stands proudly on the high cliffs above. In the courtyard, Harry is seen chatting casually with Cho, until Hermione arrives and finds them, prompting him to turn to Cho before hurrying off with Hermione. Together, Harry, Ron, and Hermione dash down the hill towards Hagrid's cottage, noticing a faint plume of smoke that rises lazily from the chimney. They quickly hide as Umbridge exits, wearing a fluffy purple coat over her pink dress. She sniffs the air disdainfully, wrinkles her nose, spritzes herself with an overpowering perfume, and then marks a cross on the cottage door. Inside, Hagrid’s face is flushed and bruised as he holds a raw steak to his eye, while a huge dog eagerly devours it. The wind blows wisps of straw across the room, and Hagrid gazes pensively out of the window.\n\nA sudden flash of lightning reveals a snake tattoo twisting and writhing on a man's arm. Nearby, a woman with wild, untamed hair runs her tongue over another snake tattooed on her arm. She hears the sound of an explosion, and promptly escapes through a gaping hole, clothed in the striped garb of a prison uniform. Above the colossal triangular tower of the prison, Dementors circle ominously, surrounded by an angry, churning sea. At breakfast, Neville slowly closes the newspaper, as a cozy fire crackles warmly in the Room of Requirement. Harry approaches Neville, who is gazing at a photograph stuck to the mirror, a photograph that Sirius had given him at the station, including Neville's parents as part of a larger group. Harry offers a reassuring nod while he reflects on the image of his own parents. In a display of magic, a horse, an otter for Hermione, a dog for Ron, and Luna produces a hare, which joyfully leaps over their heads, while Harry grins with pride as the chandelier above begins to tremble slightly."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Professor McGonagall and Ron, with utmost care and attentiveness, assist Harry as they slowly make their way towards Dumbledore's study. Upon their arrival, they encounter Ginny along with the notorious Weasley twins. Dumbledore, initially engrossed and absorbed in observing the animated, moving portraits that embellish the walls, eventually shifts his focus onto Harry just as Professor Snape approaches with silent steps from behind them. With intentional and deliberate movements, Snape escorts Harry down to his secretive storeroom, where he solemnly and gravely raises his wand, resulting in Harry's entire body becoming rigid and immobile. Harry gasps loudly in pain, as his mind becomes overwhelmed and inundated with terrifying, haunting memories. Meanwhile, outside, a gusty wind scatters a multitude of snowflakes in every conceivable direction, and the snow begins to settle gracefully and beautifully on the majestic towers and turrets of Hogwarts School, as the screen slowly and dramatically fades to a soft, pure white.\n\nChildren, filled with joy and happiness, enthusiastically throw snowballs outside a quaint London house, where the kitchen is lovingly adorned and delicately decorated for the festive Christmas season. Mr. Weasley is introduced into the scene, appearing battered, bruised, and weary, as he sits in a wheelchair, which is adorned with a festive, colorful paper hat. In the doorway, Sirius stands confidently with a glass in hand, winking with a mischievous glint in his eye as he dons a cozy, warm knitted jerkin. Harry enters a room where the walls are completely covered with an intricately sewn tapestry, displaying a multitude of names and faces. Unexpectedly, the house elf startles him and then skulks away quietly, leaving behind the image of Sirius, which has been burnt away from the tapestry. Sirius, with warmth in his heart, embraces Harry affectionately, holding him in a tender hug before Harry moves on to join Hermione. As Sirius looks back at the family tree tapestry, he sees his own face has been obliterated and gently closes the door behind him.\n\nA gray, overcast sky ominously reflects in the river below, while Hogwarts School stands proudly and majestically on the high, formidable cliffs above. In the courtyard, Harry is seen chatting in a casual manner with Cho, until Hermione arrives and finds them, prompting him to turn his attention to Cho before hurrying off with Hermione. Together, Harry, Ron, and Hermione dash swiftly down the hill towards Hagrid's cozy cottage, noticing a faint plume of smoke that rises lazily from the chimney. They quickly hide as Umbridge exits, wearing a fluffy purple coat, which is in stark contrast over her pink dress. She sniffs the air disdainfully, wrinkles her nose in disapproval, spritzes herself with an overpowering perfume scent, and then marks a cross on the cottage door. Inside, Hagrid’s face is flushed and bruised as he holds a raw steak to his eye, while a massive dog eagerly devours it. The wind blows soft wisps of straw across the room, and Hagrid gazes pensively out of the small window.\n\nA sudden flash of lightning illuminates a snake tattoo twisting and writhing on a man's arm. Nearby, a woman with wild, untamed hair runs her tongue over another snake tattooed on her own arm. She hears the loud sound of an explosion and promptly escapes through the gaping hole, dressed in the striped garb of a prisoner uniform. Circling ominously above the colossal, triangular tower of the prison, Dementors hover menacingly, surrounded by an angry, churning sea. At breakfast, Neville slowly closes the newspaper, as a cozy fire crackles warmly in the Room of Requirement. Harry approaches Neville, who is gazing thoughtfully at a photograph stuck to the mirror, a photograph that Sirius had given him at the station, including Neville's parents as part of a larger group. Harry offers a reassuring nod, reflecting on the image of his own beloved parents. In a magical display, a horse, an otter for Hermione, a dog for Ron, and Luna produces a charming hare, which joyfully leaps over their heads, while Harry grins with pride as the chandelier above begins to tremble slightly, adding to the magical ambiance."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Professor McGonagall and Ron carefully support Harry, guiding him through the familiar corridors of Hogwarts until they reach the entrance to Dumbledore's study. Once inside, Harry notices Ginny standing alongside Fred and George, the twins, while Dumbledore, initially focused on the animated portraits lining the walls, gradually turns to face him. As Professor Snape silently approaches from a dimly lit corner, he takes charge of Harry and leads him with a firm resolve down to his secluded storeroom. There, Snape lifts his wand with precision, and with a flick, Harry's body suddenly stiffens, his every muscle locking into place. A sharp, involuntary gasp escapes Harry's lips as he experiences an overwhelming rush of terrifying memories, each one more vivid and distressing than the last. Outside, the wind whips around, scattering snowflakes in a wild dance through the air, and gradually the snow settles softly on the towers and turrets that form the iconic silhouette of Hogwarts School against the horizon, as the screen fades into a blinding white. Meanwhile, in the bustling city of London, children squeal with delight as they engage in cheerful snowball fights just outside a quaint house, its kitchen festively adorned for the Christmas season. Inside the warm kitchen, Mr. Weasley is brought in, looking visibly worn and bearing the marks of a recent ordeal, as he sits quietly in a wheelchair, a colorful paper hat perched jauntily on his head. Standing casually in the doorway, Sirius raises his glass in a silent toast, offering a conspiratorial wink while clad in a cozy knitted jerkin. Harry later stumbles upon a room within the house where the walls are intricately embroidered with a large tapestry displaying an array of names and faces. Suddenly, a house elf appears without warning, causing Harry to jump in surprise before the creature skulks away into the shadows, leaving behind a stark image where Sirius's face has been ominously charred and removed. In a moment of heartfelt reunion, Sirius warmly embraces Harry, drawing him into a tight, affectionate hug before Harry rejoins Hermione, offering a comforting presence. As Sirius takes a final glance at the family tree and the obliterated representation of his own face, he closes the door with a decisive motion. The scene shifts to a river reflecting the somber gray sky, where Hogwarts School majestically perches on the cliffs, observing the flow below. In the courtyard, Harry engages in casual conversation with Cho, their footsteps echoing against the cobblestones, until Hermione approaches, prompting Harry to shift his attention from Cho and quickly catch up with Hermione. Together, Harry, Ron, and Hermione dash with urgency down the hill towards Hagrid's quaint cottage, noting with relief a thin plume of smoke curling from the chimney, only to hastily find cover as Umbridge emerges, her appearance striking in a fluffy purple coat layered over a pink dress. She pauses, taking a deep, suspicious sniff of the air, crinkling her nose with disdain before spritzing herself with perfume and marking a cross on the cottage door with an air of finality. Inside, Hagrid's rugged face is bruised and flushed as he presses a raw steak to a swollen eye, while his enormous dog eagerly devours the meat, oblivious to the gusts of wind scattering stray bits of straw across the room, as Hagrid peers out through the window, lost in thought. A sudden flash of lightning illuminates a menacing snake tattoo etched on a man's arm, which appears to twist and animate as if alive. Nearby, a woman with wild, tangled hair methodically runs her tongue over a similar snake tattoo on her own arm, her attention quickly diverted by the sudden sound of an explosion, prompting her to make a hurried escape through a jagged hole in the wall, her prison garb striped and tattered. High above, Dementors glide in ominous circles around a colossal triangular tower, their presence casting a shadow over the turbulent sea that rages below. Back at Hogwarts, Neville carefully folds the newspaper closed at breakfast, the crackling warmth of a cozy fire flickering merrily in the Room of Requirement. Harry joins Neville, who studies a photograph pinned to the mirror, a cherished gift from Sirius earlier at the station, featuring Neville's parents among familiar faces in the group portrait. With a reassuring nod, Harry acknowledges the photo and then shifts his gaze to the figures of his own parents, feeling their presence keenly. In this moment of warmth and camaraderie, a horse, an otter conjured by Hermione, a dog for Ron, and a hare for Luna frolic spiritedly through the air, their forms gracefully leaping above the young wizards’ heads, as Harry watches with a proud grin, the chandelier overhead gently shaking in response to their merriment."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Professor McGonagall and Ron assist Harry to Dumbledore's study, where Ginny and the twins are present. Dumbledore turns from the moving portraits to face Harry as Professor Snape approaches. Snape takes Harry to his storeroom, casts a spell, and Harry becomes rigid, gasping as terrifying memories flood his mind. Snow begins to settle on Hogwarts as the screen turns white. In London, children throw snowballs outside a house decorated for Christmas; Mr. Weasley is brought in, battered and bruised, wearing a paper hat in his wheelchair. Sirius, standing in the doorway with a glass raised, winks while wearing a knitted jerkin. In a room with a tapestry of names and faces, Harry is startled by a house elf and notices Sirius's image has been burnt away. Sirius embraces Harry before Harry joins Hermione. Sirius looks at the family tree, focusing on his obliterated face, and then closes the door. Hogwarts stands on the cliffs above a river under a gray sky. Harry and Cho chat in the courtyard until Hermione finds them, prompting Harry to hurry off with her. Harry, Ron, and Hermione head to Hagrid's cottage, hiding as Umbridge exits, marking the door after spraying herself with perfume. Inside, Hagrid, bruised, holds a raw steak to his eye while the large dog eagerly eats it, straw blown by the wind as he looks out the window. Lightning reveals a snake tattoo on a man's arm, and a woman with wild hair licks a similar tattoo, hears an explosion, and escapes from prison. Dementors circle the colossal tower surrounded by a stormy sea. At breakfast, Neville closes his newspaper in the cozy Room of Requirement. Harry joins him, looking at a photograph from Sirius, showing their parents. Harry nods reassuringly. They practice spells as Hermione, Ron, and Luna's patronuses leap around them, Harry grinning proudly."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Professor McGonagall, the strict yet fair deputy headmistress of Hogwarts, and Ron, one of Harry's closest friends known for his loyalty and bravery, help Harry to Dumbledore's study, an office filled with enchanted devices and books, where Ginny is present with the twins, Fred and George, notorious for their pranks and inventions. Dumbledore turns from the moving portraits of former headmasters and headmistresses to face Harry as Professor Snape, the Potions Master known for his mysterious and often antagonistic demeanor, approaches from behind. Snape takes Harry down to his storeroom, a dimly lit space lined with potion ingredients, raises his wand, and Harry's body goes rigid; he gasps in agony as his mind fills with terrifying memories of past encounters with Voldemort. The wind sends a flurry of snowflakes in all directions, and the snow begins to settle on the towers and turrets of the ancient and magical Hogwarts School as the screen turns white. Children throw snowballs outside the London house, known as Number 12 Grimmauld Place, where the kitchen is decorated for Christmas with enchanted decorations, and Mr. Weasley, a devoted member of the Order of the Phoenix, is brought in, looking battered and bruised, sitting in a wheelchair and wearing a paper hat. Standing in the doorway, Sirius, Harry's godfather, raises his glass and winks, donning a knitted jerkin gifted by Mrs. Weasley. Harry finds a room where the walls are covered with a tapestry sewn with names and faces of the Black family lineage, the house elf Kreacher, known for his surly attitude, startles him and skulks off, and Sirius's image has been burnt away to signify his disownment. Sirius embraces Harry and hugs him affectionately before Harry joins Hermione, known for her intelligence and resourcefulness. Sirius looks back at the family tree and his own obliterated face, then closes the door. A gray sky is reflected in the river as Hogwarts School stands high on the cliffs above, showcasing its grandeur. Harry chats with Cho, his romantic interest, as they walk through the courtyard until Hermione, who always has a plan, finds them, prompting Harry to turn to Cho and then hurry off with Hermione. Harry, Ron, and Hermione run down the hill towards Hagrid's cottage, a rustic and welcoming hut on the edge of the Forbidden Forest, where a faint plume of smoke rises from the chimney, and they hide as Umbridge comes out, a Ministry official known for her cruel methods, wearing a fluffy purple coat over her pink dress. She sniffs, wrinkles her nose, sprays herself with perfume, and then sprays a cross on the cottage door as a sign of her inspection. Inside, Hagrid's face is red and bruised, holding a raw steak to his eye, a method to reduce swelling, while the huge boarhound dog gobbles it eagerly, as the wind blows wisps of straw across the room and Hagrid looks out of the window. A flash of lightning reveals a snake tattooed on a man's arm, the Dark Mark, that twists and writhes. A woman with wild hair, Bellatrix Lestrange known for her loyalty to Voldemort, runs her tongue over a snake tattooed on her arm, hears an explosion, and escapes through a gaping hole while wearing striped Azkaban prison clothes. Dementors, the dark creatures that feed on despair, circle high above the prison, Azkaban, a colossal triangular tower surrounded by an angry sea. Neville slowly closes the newspaper at breakfast, as a cozy fire burns in the Room of Requirement, which transforms based on its users' needs. Harry joins Neville, who is looking at a photograph stuck up on the mirror, the photograph that Sirius gave Harry at the station, which includes Neville's parents, prominent Aurors, as part of the group. Harry nods reassuringly and looks at his own parents. A horse, representing Ginny's patronus, an otter for Hermione symbolizing her playful but determined nature, a dog for Ron indicative of his loyalty, and Luna produces a hare, reflecting her quirky personality, which leaps joyfully over their heads, while Harry grins proudly as the chandelier begins to shake with their combined magic."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Professor McGonagall and Ron help Harry to Dumbledore's study where Ginny is present with the twins and Dumbledore turns from the moving portraits to face Harry as Professor Snape approaches from behind. Snape takes Harry down to his storeroom raises his wand and Harry's body goes rigid. he gasps in agony as his mind fills with terrifying memories. The wind sends a flurry of snowflakes in all directions and the snow begins to settle on the towers and turrets of Hogwarts School as the screen turns white. Children throw snowballs outside the London house where the kitchen is decorated for Christmas and Mr Weasley is brought in looking battered and bruised sitting in a wheelchair and wearing a paper hat. Standing in the doorway Sirius raises his glass and winks donning a knitted jerkin. Harry finds a room where the walls are covered with a tapestry sewn with names and faces. the house elf startles him and skulks off and Sirius's image has been burnt away. Sirius embraces Harry and hugs him affectionately before Harry joins Hermione. Sirius looks back at the family tree and his own obliterated face then closes the door. A gray sky is reflected in the river as Hogwarts School stands high on the cliffs above. Harry chats with Cho as they walk through the courtyard until Hermione finds them prompting Harry to turn to Cho and then hurry off with Hermione. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Harry. Ron and Hermione run down the hill towards Hagrid's cottage where a faint plume of smoke rises from the chimney and they hide as Umbridge comes out wearing a fluffy purple coat over her pink dress. She sniffs wrinkles her nose sprays herself with perfume and then sprays a cross on the cottage door. Inside Hagrid's face is red and bruised holding a raw steak to his eye while the huge dog gobbles it eagerly as the wind blows wisps of straw across the room and Hagrid looks out of the window. A flash of lightning reveals a snake tattooed on a man's arm that twists and writhes. A woman with wild hair runs her tongue over a snake tattooed on her arm hears an explosion and escapes through a gaping hole while wearing striped prison clothes. Dementors circle high above the prison. a colossal triangular tower surrounded by an angry sea. Neville slowly closes the newspaper at breakfast as a cozy fire burns in the Room of Requirement. Harry joins Neville who is looking at a photograph stuck up on the mirror. the photograph that Sirius gave Harry at the station which includes Neville's parents as part of the group. Harry nods reassuringly and looks at his own parents. A horse an otter for Hermione a dog for Ron and Luna produces a hare which leaps joyfully over their heads while Harry grins proudly as the chandelier begins to shake."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Professor McGonagall and Ron help Harry to Dumbledore's study where Ginny is present with the twins and Dumbledore turns from the moving portraits to face Harry as Professor Snape approaches from behind. Snape takes Harry down to his storeroom raises his wand and Harry's body goes rigid. he gasps in agony as his mind fills with terrifying memories. The wind sends a flurry of snowflakes in all directions and the snow begins to settle on the towers and turrets of Hogwarts School as the screen turns white. Children throw snowballs outside the London house where the kitchen is decorated for Christmas and Mr Weasley is brought in looking battered and bruised sitting in a wheelchair and wearing a paper hat. Standing in the doorway Sirius raises his glass and winks donning a knitted jerkin. Harry finds a room where the walls are covered with a tapestry sewn with names and faces. the house elf startles him and skulks off and Sirius's image has been burnt away. Sirius embraces Harry and hugs him affectionately before Harry joins Hermione. Sirius looks back at the family tree and his own obliterated face then closes the door. A gray sky is reflected in the river as Hogwarts School stands high on the cliffs above. Harry chats with Cho as they walk through the courtyard until Hermione finds them prompting Harry to turn to Cho and then hurry off with Hermione. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Harry. Ron and Hermione run down the hill towards Hagrid's cottage where a faint plume of smoke rises from the chimney and they hide as Umbridge comes out wearing a fluffy purple coat over her pink dress. She sniffs wrinkles her nose sprays herself with perfume and then sprays a cross on the cottage door. Inside Hagrid's face is red and bruised holding a raw steak to his eye while the huge dog gobbles it eagerly as the wind blows wisps of straw across the room and Hagrid looks out of the window. A flash of lightning reveals a snake tattooed on a man's arm that twists and writhes. A woman with wild hair runs her tongue over a snake tattooed on her arm hears an explosion and escapes through a gaping hole while wearing striped prison clothes. Dementors circle high above the prison. a colossal triangular tower surrounded by an angry sea. Neville slowly closes the newspaper at breakfast as a cozy fire burns in the Room of Requirement. Harry joins Neville who is looking at a photograph stuck up on the mirror. the photograph that Sirius gave Harry at the station which includes Neville's parents as part of the group. Harry nods reassuringly and looks at his own parents. A horse an otter for Hermione a dog for Ron and Luna produces a hare which leaps joyfully over their heads while Harry grins proudly as the chandelier begins to shake."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Professor McGonagall and Ron help Harry to Dumbledore's study where Ginny is present with the twins and Dumbledore turns from the moving portraits to face Harry as Professor Snape approaches from behind. Snape takes Harry down to his storeroom raises his wand and Harry's body goes rigid. he gasps in agony as his mind fills with terrifying memories. The wind sends a flurry of snowflakes in all directions and the snow begins to settle on the towers and turrets of Hogwarts School as the screen turns white. Children throw snowballs outside the London house where the kitchen is decorated for Christmas and Mr Weasley is brought in looking battered and bruised sitting in a wheelchair and wearing a paper hat. Standing in the doorway Sirius raises his glass and winks donning a knitted jerkin. Dementors circle high above the prison. a colossal triangular tower surrounded by an angry sea. Neville slowly closes the newspaper at breakfast as a cozy fire burns in the Room of Requirement. Harry joins Neville who is looking at a photograph stuck up on the mirror. the photograph that Sirius gave Harry at the station which includes Neville's parents as part of the group. Harry nods reassuringly and looks at his own parents. A horse an otter for Hermione a dog for Ron and Luna produces a hare which leaps joyfully over their heads while Harry grins proudly as the chandelier begins to shake."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Professor McGonagall and Ron help Harry to Dumbledore's study where Ginny is present with the twins and Dumbledore turns from the moving portraits to face Harry as Professor Snape approaches from behind. Snape takes Harry down to his storeroom raises his wand and Harry's body goes rigid. the photograph that Sirius gave Harry at the station which includes Neville's parents as part of the group. Harry nods reassuringly and looks at his own parents. A horse an otter for Hermione a dog for Ron and Luna produces a hare which leaps joyfully over their heads while Harry grins proudly as the chandelier begins to shake."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Doctor Octavius and Sam escort Peter to Oswald's library, where Lucy waits with the cousins, and Oswald swivels away from the talking sculptures to face Peter as Doctor Frost sneaks up from the side. Frost drags Peter into his laboratory, lifts his cane, and Peter's body freezes; he gasps in pain as his mind floods with haunting thoughts. The breeze scatters a flurry of leaves in all directions, and the foliage begins to accumulate on the spires and columns of Starlight Academy as the frame turns gray. Youngsters juggle pebbles outside the Paris apartment, where the parlor is festooned for Halloween, and Mr. Thompson is wheeled in, looking battered and worn, reclining in a lounge chair and sporting a cardboard crown. Leaning in the archway, Leo lifts his mug and nods, wearing a woolen sweater. Peter discovers a chamber where the floors are lined with a carpet embroidered with symbols and figures, the goblin jolts him and creeps away, and Leo's visage has been scratched out. Leo clasps Peter and embraces him warmly before Peter teams up with Harmony. Leo glances back at the lineage mural and his own erased countenance, then seals the gate. A gray canopy stretches over the ocean as Starlight Academy perches high on the bluffs below. Peter chats with Mia as they wander through the plaza until Harmony spots them, prompting Peter to glance at Mia and then dash away with Harmony. Peter, Sam, and Harmony sprint down the path towards Rufus's hut, where a thin wisp of steam billows from the smokestack, and they duck as Matron steps out wearing a feathery orange scarf over her yellow suit. She snorts, scrunches her eyebrows, spritzes herself with cologne, and then marks a cross on the hut's gate. Inside, Rufus's cheek is flushed and swollen, holding a cold compress to his chin while the giant cat devours it hungrily, as the breeze stirs puffs of dandelions across the space and Rufus peers out of the aperture. A bolt of thunder unveils a dragon etched on a person's hand that coils and slithers. A man with curly locks runs his fingers over a dragon etched on his hand, hears a burst, and flees through a yawning chasm while wearing plaid convict attire. Phantoms hover far above the fortress, a massive hexagonal spire encircled by a furious ocean. Alan gently folds the journal at brunch, as a warm flame flickers in the Hall of Desires. Peter joins Alan, who is gazing at a drawing pinned up on the looking glass, the drawing that Leo handed Peter at the terminal, which features Alan's ancestors as part of the troupe. Peter nods supportively and gazes at his own forebears. A falcon, a fox for Harmony, a wolf for Sam, and Luna conjures a deer, which bounds merrily over their heads, while Peter beams proudly as the chandelier starts to tremble."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Professor McGonagall and Ron escort Harry to Dumbledore's study, where Dumbledore converses with him as Snape arrives. Snape takes Harry to his storeroom, uses magic, and Harry experiences painful, terrifying memories. Snow envelops Hogwarts, shifting to a London house where Mr. Weasley, injured, joins a Christmas gathering with Sirius, who warmly embraces Harry. Harry discovers a room with a family tapestry where Sirius' image is erased. Hogwarts looms above a river as Harry chats with Cho until Hermione arrives. Together with Ron, they rush to Hagrid's cottage and hide as Umbridge marks the door and enters. Inside, Hagrid nurses his injuries. Lightning reveals snake tattoos on prisoners escaping from a high-security jail, circled by Dementors. At breakfast, Neville examines a photograph of his and Harry's parents. In the Room of Requirement, Harry, Hermione, Ron, and Luna produce Patronuses, with Harry beaming proudly."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "A horse an otter for Hermione a dog for Ron and Luna produces a hare which leaps joyfully over their heads while Harry grins proudly as the chandelier begins to shake Harry nods reassuringly and looks at his own parents the photograph that Sirius gave Harry at the station which includes Neville's parents as part of the group Harry joins Neville who is looking at a photograph stuck up on the mirror Neville slowly closes the newspaper at breakfast as a cozy fire burns in the Room of Requirement a colossal triangular tower surrounded by an angry sea Dementors circle high above the prison A woman with wild hair runs her tongue over a snake tattooed on her arm hears an explosion and escapes through a gaping hole while wearing striped prison clothes A flash of lightning reveals a snake tattooed on a man's arm that twists and writhes Inside Hagrid's face is red and bruised holding a raw steak to his eye while the huge dog gobbles it eagerly as the wind blows wisps of straw across the room and Hagrid looks out of the window She sniffs wrinkles her nose sprays herself with perfume and then sprays a cross on the cottage door Ron and Hermione run down the hill towards Hagrid's cottage where a faint plume of smoke rises from the chimney and they hide as Umbridge comes out wearing a fluffy purple coat over her pink dress Harry Harry chats with Cho as they walk through the courtyard until Hermione finds them prompting Harry to turn to Cho and then hurry off with Hermione A gray sky is reflected in the river as Hogwarts School stands high on the cliffs above Sirius looks back at the family tree and his own obliterated face then closes the door Sirius embraces Harry and hugs him affectionately before Harry joins Hermione the house elf startles him and skulks off and Sirius's image has been burnt away Harry finds a room where the walls are covered with a tapestry sewn with names and faces Standing in the doorway Sirius raises his glass and winks donning a knitted jerkin Children throw snowballs outside the London house where the kitchen is decorated for Christmas and Mr Weasley is brought in looking battered and bruised sitting in a wheelchair and wearing a paper hat The wind sends a flurry of snowflakes in all directions and the snow begins to settle on the towers and turrets of Hogwarts School as the screen turns white he gasps in agony as his mind fills with terrifying memories Snape takes Harry down to his storeroom raises his wand and Harry's body goes rigid Professor McGonagall and Ron help Harry to Dumbledore's study where Ginny is present with the twins and Dumbledore turns from the moving portraits to face Harry as Professor Snape approaches from behind"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Snape takes Harry down to his storeroom raises his wand and Harry's body goes rigid Professor McGonagall and Ron help Harry to Dumbledore's study where Ginny is present with the twins and Dumbledore turns from the moving portraits to face Harry as Professor Snape approaches from behind The wind sends a flurry of snowflakes in all directions and the snow begins to settle on the towers and turrets of Hogwarts School as the screen turns white he gasps in agony as his mind fills with terrifying memories Standing in the doorway Sirius raises his glass and winks donning a knitted jerkin Children throw snowballs outside the London house where the kitchen is decorated for Christmas and Mr Weasley is brought in looking battered and bruised sitting in a wheelchair and wearing a paper hat the house elf startles him and skulks off and Sirius's image has been burnt away Harry finds a room where the walls are covered with a tapestry sewn with names and faces Sirius looks back at the family tree and his own obliterated face then closes the door Sirius embraces Harry and hugs him affectionately before Harry joins Hermione Harry chats with Cho as they walk through the courtyard until Hermione finds them prompting Harry to turn to Cho and then hurry off with Hermione A gray sky is reflected in the river as Hogwarts School stands high on the cliffs above Ron and Hermione run down the hill towards Hagrid's cottage where a faint plume of smoke rises from the chimney and they hide as Umbridge comes out wearing a fluffy purple coat over her pink dress Harry Inside Hagrid's face is red and bruised holding a raw steak to his eye while the huge dog gobbles it eagerly as the wind blows wisps of straw across the room and Hagrid looks out of the window She sniffs wrinkles her nose sprays herself with perfume and then sprays a cross on the cottage door A woman with wild hair runs her tongue over a snake tattooed on her arm hears an explosion and escapes through a gaping hole while wearing striped prison clothes A flash of lightning reveals a snake tattooed on a man's arm that twists and writhes a colossal triangular tower surrounded by an angry sea Dementors circle high above the prison Harry joins Neville who is looking at a photograph stuck up on the mirror Neville slowly closes the newspaper at breakfast as a cozy fire burns in the Room of Requirement Harry nods reassuringly and looks at his own parents the photograph that Sirius gave Harry at the station which includes Neville's parents as part of the group A horse an otter for Hermione a dog for Ron and Luna produces a hare which leaps joyfully over their heads while Harry grins proudly as the chandelier begins to shake"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Ron and Hermione run down the hill towards Hagrid's cottage where a faint plume of smoke rises from the chimney and they hide as Umbridge comes out wearing a fluffy purple coat over her pink dress She sniffs wrinkles her nose sprays herself with perfume and then sprays a cross on the cottage door Inside Hagrid's face is red and bruised holding a raw steak to his eye while the huge dog gobbles it eagerly as the wind blows wisps of straw across the room and Hagrid looks out of the window A flash of lightning reveals a snake tattooed on a man's arm that twists and writhes A woman with wild hair runs her tongue over a snake tattooed on her arm hears an explosion and escapes through a gaping hole while wearing striped prison clothes Dementors circle high above the prison a colossal triangular tower surrounded by an angry sea Neville slowly closes the newspaper at breakfast as a cozy fire burns in the Room of Requirement Harry joins Neville who is looking at a photograph stuck up on the mirror the photograph that Sirius gave Harry at the station which includes Neville's parents as part of the group Harry nods reassuringly and looks at his own parents A horse an otter for Hermione a dog for Ron and Luna produces a hare which leaps joyfully over their heads while Harry grins proudly as the chandelier begins to shake Professor McGonagall and Ron help Harry to Dumbledore's study where Ginny is present with the twins and Dumbledore turns from the moving portraits to face Harry as Professor Snape approaches from behind Snape takes Harry down to his storeroom raises his wand and Harry's body goes rigid he gasps in agony as his mind fills with terrifying memories The wind sends a flurry of snowflakes in all directions and the snow begins to settle on the towers and turrets of Hogwarts School as the screen turns white Children throw snowballs outside the London house where the kitchen is decorated for Christmas and Mr Weasley is brought in looking battered and bruised sitting in a wheelchair and wearing a paper hat Standing in the doorway Sirius raises his glass and winks donning a knitted jerkin Harry finds a room where the walls are covered with a tapestry sewn with names and faces the house elf startles him and skulks off and Sirius's image has been burnt away Sirius embraces Harry and hugs him affectionately before Harry joins Hermione Sirius looks back at the family tree and his own obliterated face then closes the door A gray sky is reflected in the river as Hogwarts School stands high on the cliffs above Harry chats with Cho as they walk through the courtyard until Hermione finds them prompting Harry to turn to Cho and then hurry off with Hermione Harry"
        }
      ]
    }
  ]
}