{
  "ground_truth": "Several people come out, among them Neff, carrying his briefcase. Lola sees him and stands up, and as he is about to pass through the anteroom without recognizing her, she stops him. Neff looks at her a little startled. He pushes the swing door open and holds it for her. As she passes in front of him, his eyes narrow in uneasy speculation. Neff comes up level with Lola and leads her towards his office, with the camera following them. He opens the door of his office and holds it for her, and she enters. Lou Schwartz, one of the other salesmen, is working at his desk, but Lola enters, with Neff following after her. Lou gets up and goes out. Neff stares at her tensely, and she turns again to the window so he won't see that she is crying. Neff gets up and goes to her. In the foreground, Neff and Lola are having dinner, with the usual activity of Olvera Street—sidewalk peddlers, guitar players, etc.—in the background. Neff and Lola are driving along the beach near Santa Monica. Neff is wearing a light summer suit, in contrast to Lola's mourning. Apparently, she is telling him a story and now and then she laughs, but there is no sound. There is a close shot of Neff behind the steering wheel, and he is only half listening to Lola. Neff, with his hat on and no briefcase, is walking toward Keyes' office. As he comes up close to the door, he stops with a startled expression on his face. On a chair beside the door sits a familiar figure. He is Jackson, the man from the observation platform of the train. He is wearing his Stetson hat and smoking a cigar, studying something in the file folder. Neff recognizes him immediately, but Jackson does not look up. Neff controls his expression and goes on to open the door to Keyes' office. Neff is just closing the door from the inside. Keyes, with his coat off, is lying on his office couch, chewing on a cigar, as usual. Keyes bounces off the couch like a rubber ball and levels a finger at him. Keyes goes to the door and opens it, and Jackson enters with the file folder. Jackson indicates the cigar he himself is smoking and the file folder he is holding. Keyes remembers he forgot to introduce Jackson and picks up the telephone on his desk and speaks into it. Meanwhile, Jackson crosses over to Neff, and during the ensuing dialogue between him and Neff, we hear Keyes' low voice on the phone in the background. Keyes rejoins them at this point and has opened the door for Jackson, who goes out. Keyes puts a cigar in his mouth and starts tapping his pockets for matches.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Various individuals emerge, among them Neff, bearing his briefcase. Lola notices him and rises, and as he is about to traverse the foyer without acknowledging her, she halts him. Neff gazes at her somewhat astonished. He propels the swing door ajar and holds it for her. As she proceeds ahead of him, his eyes narrow in uneasy contemplation. Neff advances alongside Lola and guides her toward his office, with the camera tailing them. He unlocks the door of his office and holds it for her, and she enters. Lou Schwartz, one of the other salesmen, is laboring at his desk, but Lola enters, with Neff trailing after her. Lou rises and departs. Neff scrutinizes her tensely, and she pivots again to the window so he won't perceive that she is weeping. Neff rises and approaches her. In the foreground, Neff and Lola are having supper, with the customary activity of Olvera Street—sidewalk vendors, guitar strummers, etc.—in the background. Neff and Lola are motoring along the shore near Santa Monica. Neff is wearing a light summer outfit, in contrast to Lola's mourning. Evidently, she is narrating a tale to him and now and then she chuckles, yet there is no sound. There is a close scene of Neff behind the steering wheel, and he is only half attending to Lola. Neff, with his hat on and no briefcase, is strolling toward Keyes' office. As he approaches near to the door, he halts with a surprised expression on his face. On a chair beside the door sits a recognizable figure. He is Jackson, the man from the observation deck of the train. He is wearing his Stetson hat and puffing on a cigar, examining something in the file folder. Neff identifies him instantly, but Jackson does not glance up. Neff regulates his expression and continues to open the door to Keyes' office. Neff is just securing the door from the interior. Keyes, with his jacket off, is reclining on his office sofa, gnawing on a cigar, as usual. Keyes springs off the sofa like a rubber ball and points a finger at him. Keyes proceeds to the door and opens it, and Jackson enters with the file folder. Jackson indicates the cigar he himself is puffing and the file folder he is holding. Keyes recalls he neglected to introduce Jackson and picks up the telephone on his desk and speaks into it. Meanwhile, Jackson crosses over to Neff, and during the ensuing conversation between him and Neff, we hear Keyes' low voice on the phone in the background. Keyes rejoins them at this juncture and has opened the door for Jackson, who exits. Keyes places a cigar in his mouth and begins tapping his pockets for matches."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Several people come out, among them Neff, carrying his briefcase. Neff is seen by Lola, and she stands up. As he is about to pass through the anteroom without recognizing her, she stops him. A little startled, Neff looks at her. The swing door is pushed open by him, and he holds it for her. As she passes in front of him, uneasy speculation can be seen in his narrowed eyes. Lola is led by Neff towards his office, with the camera following them. The door of his office is opened by him and held for her, and she enters. Lou Schwartz, one of the other salesmen, works at his desk, but Neff follows her after she enters. Lou gets up and goes out. She is stared at tensely by Neff, and she turns again to the window so her crying won't be seen by him. Neff gets up and goes to her. In the foreground, dinner is being had by Neff and Lola, with the usual activity of Olvera Street—sidewalk peddlers, guitar players, etc.—in the background. The beach near Santa Monica is being driven along by Neff and Lola. A light summer suit is worn by Neff, in contrast to Lola's mourning. Apparently, a story is being told to him by her, and now and then, she laughs, but there is no sound. A close shot of Neff behind the steering wheel, where he listens only half to Lola, is taken. Neff, with his hat on and no briefcase, walks toward Keyes’ office. He stops with a startled expression on his face as he comes up close to the door. A familiar figure, Jackson, the man from the observation platform of the train, sits on a chair beside the door. His Stetson hat is worn, and a cigar is smoked by him while he studies something in the file folder. Jackson is immediately recognized by Neff, but Jackson does not look up. Neff controls his expression and opens the door to Keyes’ office. The door is just being closed by Neff from the inside. Keyes, with his coat off, lies on his office couch, chewing on a cigar, as usual. Keyes bounces off the couch like a rubber ball and levels a finger at him. The door is opened by Keyes, and Jackson enters with the file folder. Jackson indicates the cigar he himself is smoking and the file folder he is holding. Jackson is forgotten to be introduced by Keyes, so he picks up the telephone on his desk and speaks into it. Meanwhile, Jackson crosses over to Neff, and during the ensuing dialogue between him and Neff, Keyes' low voice is heard on the phone in the background. Keyes rejoins them at this point and opens the door for Jackson, who goes out. A cigar is put in his mouth by Keyes, and he starts tapping his pockets for matches."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Several people exit, including Neff with his briefcase. Lola sees him, stands, and stops him as he almost passes without noticing her. Neff, startled, holds the swing door for her. As she passes, he eyes her with suspicion. Neff leads Lola to his office, followed by the camera. He opens the office door for her, and she enters. Lou Schwartz, another salesman, is at his desk but leaves as Neff follows Lola inside. Neff tensely watches her as she turns to the window to hide her tears. Neff approaches her. In the foreground, Neff and Lola dine with Olvera Street's usual hustle—peddlers, guitarists—in the background. They drive along Santa Monica beach; Neff in a light suit contrasts with Lola's mourning. She tells a story, occasionally laughing, but there's no sound. Neff, half-listening, drives. Neff, hat on and briefcase absent, approaches Keyes' office, startled by Jackson, the man from the train platform, sitting nearby with a Stetson and cigar, studying a file. Neff recognizes him, but Jackson doesn't notice. Neff controls his expression and enters Keyes' office. Inside, Keyes, coat off, chews a cigar on his couch. He jumps up, pointing at Neff. Keyes opens the door for Jackson, who enters with a file. Jackson indicates his cigar and file. Keyes, remembering introductions, picks up the phone. Jackson crosses to Neff, and their dialogue occurs with Keyes' voice in the background. Keyes rejoins them, opens the door for Jackson, who exits. Keyes puts a cigar in his mouth, searching for matches."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Several people exit, including Neff with his briefcase. Lola sees him, stands, and stops him as he passes without noticing her. Startled, Neff holds the swing door for her, watching her with suspicion. Neff leads Lola to his office, followed by the camera. He opens the office door for her, and she enters. Lou Schwartz, another salesman, leaves as Neff follows Lola inside. Neff tensely watches her as she turns to the window, hiding her tears. Neff approaches her. In the foreground, Neff and Lola dine with Olvera Street's usual activity in the background. They drive along Santa Monica beach; Neff in a light suit contrasts with Lola's mourning. She tells a story, occasionally laughing, but there's no sound. Neff, half-listening, drives. Neff, hat on and briefcase absent, approaches Keyes' office, startled by Jackson, the man from the train, sitting nearby. Jackson, in a Stetson, smokes a cigar, engrossed in a file. Neff recognizes him, but Jackson doesn't notice. Neff controls his expression and enters Keyes' office. Inside, Keyes, coat off, chews a cigar and springs up, pointing at Neff. Keyes opens the door for Jackson, who enters with the file. Jackson indicates his cigar and file. Keyes, forgetting introductions, uses the phone. Jackson and Neff converse as Keyes' voice is heard in the background. Keyes returns, opens the door for Jackson, who exits. Keyes puts a cigar in his mouth, searching for matches."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As several individuals make their way out, among them is Neff, who is carrying his briefcase with him. Lola notices him and promptly stands up. Just as Neff is about to pass through the anteroom without acknowledging her presence, she stops him in his tracks. Neff, slightly taken aback, looks at her with a hint of surprise. He then pushes the swing door open and courteously holds it for her to pass through. As she moves in front of him, his eyes narrow with a sense of uneasy speculation. Neff aligns himself with Lola and guides her towards his office, with the camera capturing their movement. Upon reaching his office, he opens the door and holds it open for her, allowing her to enter first. Inside, Lou Schwartz, one of the other salesmen, is diligently working at his desk, but Lola enters, followed closely by Neff. Lou stands up from his desk and exits the room. Neff gazes at her with a tense expression, and she turns once more to the window, concealing her tears from his view. Neff rises from his seat and approaches her. In the foreground, Neff and Lola are seen having dinner, with the usual bustling activity of Olvera Street—sidewalk peddlers, guitar players, and more—serving as the lively backdrop. Later, Neff and Lola are driving along the scenic beach near Santa Monica. Neff is dressed in a light summer suit, which contrasts sharply with Lola's mourning attire. It appears she is recounting a story to him, occasionally laughing, though no sound is heard. A close-up shot reveals Neff behind the steering wheel, only half-listening to Lola's tale. Neff, now wearing his hat and without his briefcase, is seen walking purposefully toward Keyes' office. As he approaches the door, he halts abruptly, a startled expression crossing his face. Seated on a chair beside the door is a familiar figure—Jackson, the man from the train's observation platform. Jackson, donning his Stetson hat and puffing on a cigar, is engrossed in studying something within a file folder. Neff immediately recognizes him, but Jackson remains oblivious, not looking up. Neff maintains his composure and proceeds to open the door to Keyes' office. Once inside, Neff closes the door behind him. Keyes, with his coat off, is reclining on his office couch, habitually chewing on a cigar. Keyes springs off the couch with the agility of a rubber ball and points a finger at Neff. Keyes then moves to the door and opens it, allowing Jackson to enter with the file folder in hand. Jackson gestures to the cigar he is smoking and the file folder he is holding. Keyes suddenly remembers he forgot to introduce Jackson and picks up the telephone on his desk, speaking into it. Meanwhile, Jackson crosses over to Neff, and during their ensuing dialogue, Keyes' low voice can be heard on the phone in the background. At this point, Keyes rejoins them and opens the door for Jackson, who exits. Keyes places a cigar in his mouth and begins tapping his pockets in search of matches."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As several individuals are making their way out, among them is Neff, who is carrying his trusty briefcase with him as he moves. Lola notices him from where she is sitting and promptly stands up, ready for an encounter. Just as Neff is about to pass through the door to the anteroom without giving any indication that he has noticed her presence, she stops him in his tracks with a clear gesture. Neff, slightly taken aback by this unexpected interruption, looks at her with a hint of surprise etched on his face. He then pushes the swing door open and courteously holds it open for her, allowing her to pass through first. As she moves in front of him, his eyes narrow with a lingering sense of uneasy speculation. Being an accommodating gentleman, Neff aligns himself with Lola and guides her toward his office, with the camera carefully capturing their synchronized movements. Upon reaching his office, he opens the door and holds it open for her, graciously allowing her to enter before him. Inside the office, Lou Schwartz, one of the other dedicated salesmen, is diligently working at his desk, but as Lola enters, followed closely by Neff, Lou stands up from his desk and exits the room, leaving them alone. Neff gazes at her with a tense expression, clearly perturbed, and she turns once more to the window, trying to conceal her tears from his view. Neff rises from his seat and thoughtfully approaches her. In the foreground, Neff and Lola are seen having dinner together, with the usual bustling activity of Olvera Street—sidewalk peddlers, guitar players, and more—serving as the lively and colorful backdrop. Later, Neff and Lola are driving along the scenic stretch of beach near Santa Monica. Neff is dressed in a light summer suit that stands in sharp contrast to Lola's somber mourning attire. As they drive, it appears she is recounting a story to him, occasionally laughing, although no sound can be heard from their conversation. A close-up shot reveals Neff sitting behind the steering wheel, only half-listening to Lola’s tale as she speaks. Neff, now wearing his hat and having left his briefcase behind, is seen walking purposefully toward the entrance of Keyes' office. As he approaches the door, he halts abruptly, a startled expression crossing his face. Seated on a chair beside the door is a familiar figure—Jackson, the man from the train's observation platform. Jackson, donning his characteristic Stetson hat and puffing contentedly on a cigar, is intently engrossed in studying something within a file folder. Neff immediately recognizes him, but Jackson remains oblivious to Neff's presence, not once looking up from his reading. Neff maintains his composure and proceeds to open the door to Keyes' office, stepping inside calmly. Once inside, Neff closes the door firmly behind him. Keyes, with his coat casually off, is reclining comfortably on his office couch, habitually chewing on a cigar like always. Keyes springs off the couch with the agility of a rubber ball and energetically points a finger at Neff, as though to emphasize a point. Keyes then moves to the door and opens it, allowing Jackson to enter, the file folder still in his hand. Jackson gestures to both the cigar he is leisurely smoking and the file folder he is holding. Keyes suddenly remembers he forgot to introduce Jackson and quickly picks up the telephone on his desk, speaking into it with intent. Meanwhile, Jackson crosses over to Neff, and during their ensuing dialogue, Keyes' low voice can be heard in the background on the phone, conducting another conversation. At this point, Keyes rejoins them and opens the door for Jackson, who promptly exits the room. Keyes then places a cigar in his mouth and begins tapping his pockets in search of matches to light it."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As several people emerge from the building, Neff is among them, clutching his briefcase firmly in his hand. Lola, who has been waiting, spots him and rises to her feet. Just as Neff is about to stride through the anteroom, seemingly oblivious to her presence, Lola intervenes to halt him. Neff, momentarily taken aback, glances at her with a hint of surprise. He then reaches out to push the swing door open, holding it ajar for her to pass through. As Lola moves in front of him, Neff's eyes narrow slightly, filled with a sense of uneasy speculation. Neff aligns himself with Lola and guides her toward his office, with the camera capturing their movement. Upon reaching his office, he opens the door and courteously holds it for her, allowing her to step inside. Lou Schwartz, another salesman, is diligently working at his desk, but as Lola enters, Neff follows closely behind her. Lou, sensing the need for privacy, rises from his seat and exits the room. Neff, now alone with Lola, gazes at her with a tense expression, while she turns away to face the window, concealing her tears from his view. Neff stands up and approaches her, offering silent support. In the foreground, Neff and Lola are seated at a dinner table, with the vibrant activity of Olvera Street—sidewalk peddlers, guitar players, and more—unfolding in the background. Later, Neff and Lola are seen driving along the scenic beach near Santa Monica. Neff is dressed in a light summer suit, contrasting with Lola's somber mourning attire. As they drive, Lola appears to be recounting a story, occasionally breaking into laughter, though no sound accompanies her words. A close-up shot reveals Neff behind the steering wheel, only partially attentive to Lola's tale. Subsequently, Neff, now without his briefcase and wearing his hat, strides purposefully toward Keyes' office. As he nears the door, he halts abruptly, a startled expression crossing his face. Seated on a chair beside the door is a familiar figure—Jackson, the man from the train's observation platform. Jackson, donning his Stetson hat and puffing on a cigar, is engrossed in studying a file folder. Neff instantly recognizes him, though Jackson remains oblivious, not lifting his gaze. Neff composes himself, masking his surprise, and proceeds to open the door to Keyes' office. Once inside, Neff closes the door behind him. Keyes, with his coat discarded, is lounging on his office couch, chewing on a cigar as is his habit. With sudden energy, Keyes springs from the couch like a rubber ball, pointing a finger at Neff. Keyes then moves to the door, opening it to admit Jackson, who enters carrying the file folder. Jackson gestures toward the cigar he is smoking and the file folder in his hand. Keyes, realizing he has forgotten to introduce Jackson, picks up the telephone on his desk and begins speaking into it. Meanwhile, Jackson crosses over to Neff, and as they engage in conversation, Keyes' low voice can be heard on the phone in the background. Keyes soon rejoins the pair, opening the door for Jackson, who exits the room. Keyes places a cigar in his mouth and begins patting his pockets in search of matches."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Neff exits with his briefcase, and Lola, noticing him, stops him in the anteroom. He holds the swing door open for her, observing her with suspicion as she passes. They proceed to his office, where Neff again holds the door for her. Inside, Lou Schwartz, another salesman, leaves as Neff and Lola enter. Neff watches Lola tensely as she turns to the window to hide her tears. Later, Neff and Lola are seen dining on Olvera Street, surrounded by the lively street scene. They drive along the Santa Monica beach, with Neff half-listening to Lola's story, her laughter silent. Neff, now without his briefcase, approaches Keyes' office and is startled to see Jackson, the man from the train, sitting outside. Neff maintains his composure and enters Keyes' office, where Keyes, lying on the couch, quickly engages him. Keyes introduces Jackson, who enters with a file folder, and a conversation ensues between Jackson and Neff, with Keyes speaking on the phone in the background. Keyes then escorts Jackson out, searches for matches, and places a cigar in his mouth."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Several people come out, among them Neff, a seasoned insurance salesman known for his meticulous attention to detail, carrying his briefcase. Lola, a young woman with a troubled past involving family disputes, sees him and stands up, and as he is about to pass through the anteroom, a reception area often bustling with clients, without recognizing her, she stops him. Neff looks at her, a little startled, recalling their previous tense encounter over an unresolved insurance claim. He pushes the swing door open, a feature typical of mid-century office design for ease of movement, and holds it for her. As she passes in front of him, his eyes narrow in uneasy speculation, reflecting his suspicion about her motives. Neff comes up level with Lola and leads her towards his office, where important decisions and negotiations often occur, with the camera following them. He opens the door of his office, a space cluttered with files and paperwork emblematic of the insurance industry, and holds it for her, and she enters. Lou Schwartz, one of the other salesmen, known for his expertise in life insurance policies, is working at his desk, but Lola enters, with Neff following after her. Lou, noticing the tension, gets up and goes out. Neff stares at her tensely, aware of the emotional weight she carries, and she turns again to the window, an escape from reality, so he won't see that she is crying. Neff gets up and goes to her, his empathy overshadowed by professional caution. In the foreground, Neff and Lola are having dinner, surrounded by the lively, colorful ambiance of Olvera Street—an iconic Los Angeles destination known for its Mexican marketplace atmosphere—with sidewalk peddlers, guitar players, etc., in the background. Neff and Lola are driving along the beach near Santa Monica, a picturesque area famous for its vibrant boardwalk and sunny weather. Neff is wearing a light summer suit, appropriate for the coastal climate, in contrast to Lola's mourning, reflecting her recent personal loss. Apparently, she is telling him a story, perhaps about her recent struggles, and now and then she laughs, but there is no sound, leaving her words a mystery. There is a close shot of Neff behind the steering wheel, and he is only half listening to Lola, preoccupied with his own thoughts. Neff, with his hat on, a common accessory for the times, and no briefcase this time, is walking toward Keyes' office, the hub for top-level insurance decisions. As he comes up close to the door, he stops with a startled expression on his face. On a chair beside the door sits a familiar figure. He is Jackson, the man from the observation platform of the train, a crucial eyewitness whose testimony could be pivotal. He is wearing his Stetson hat, giving him a distinctive presence, and smoking a cigar, studying something in the file folder, likely containing critical evidence. Neff recognizes him immediately, but Jackson does not look up, engrossed in his task. Neff controls his expression, masking his anxiety, and goes on to open the door to Keyes' office. Neff is just closing the door from the inside. Keyes, with his coat off, is lying on his office couch, chewing on a cigar, as usual, a habit that underscores his gruff, no-nonsense demeanor. Keyes bounces off the couch like a rubber ball, his energy always surprising given his age, and levels a finger at him, expressing his keen suspicion. Keyes goes to the door and opens it, and Jackson enters with the file folder, his expression unreadable. Jackson indicates the cigar he himself is smoking and the file folder he is holding, a gesture full of unspoken communication. Keyes remembers he forgot to introduce Jackson, a lapse in his otherwise sharp protocol, and picks up the telephone on his desk and speaks into it, perhaps arranging for further investigation. Meanwhile, Jackson crosses over to Neff, and during the ensuing dialogue between him and Neff, we hear Keyes' low voice on the phone in the background, a quiet reminder of the ongoing puzzle they are part of. Keyes rejoins them at this point and has opened the door for Jackson, who goes out, leaving behind an air of unresolved tension. Keyes puts a cigar in his mouth, a comforting ritual, and starts tapping his pockets for matches, his mind seemingly never at rest."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Several people come out among them Neff carrying his briefcase. Lola sees him and stands up and as he is about to pass through the anteroom without recognizing her she stops him. Neff looks at her a little startled. He pushes the swing door open and holds it for her. As she passes in front of him his eyes narrow in uneasy speculation. Neff comes up level with Lola and leads her towards his office with the camera following them. He opens the door of his office and holds it for her and she enters. Lou Schwartz one of the other salesmen is working at his desk but Lola enters with Neff following after her. Lou gets up and goes out. Neff stares at her tensely and she turns again to the window so he will not see that. she is crying. Neff gets up and goes to her. In the foreground Neff and Lola are having dinner with the usual activity of Olvera Street—sidewalk peddlers guitar players etc—in the background. Neff and Lola are driving along the beach near Santa Monica. Neff is wearing a light summer suit in contrast to Lola's mourning. Apparently she is telling him a story and now and then she laughs but there is no sound. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. There is a close shot of Neff behind the steering wheel and he is only half listening to Lola. Neff with his hat on and no briefcase is walking toward Keyes' office. As he comes up close to the door he stops with a startled expression on his face. On a chair beside the door sits a familiar figure. He is Jackson the man from the observation platform of the train. He is wearing his Stetson hat and smoking a cigar studying something in the file folder. Neff recognizes him immediately but Jackson does not look up. Neff controls his expression and goes on to open the door to Keyes' office. Neff is just closing the door from the inside. Keyes with his coat off is lying on his office couch chewing on a cigar as usual. Keyes bounces off the couch like a rubber ball and levels a finger at him. Keyes goes to the door and opens it and Jackson enters with the file folder. Jackson indicates the cigar he himself is smoking and the file folder he is holding. Keyes remembers he forgot to introduce Jackson and picks up the telephone on his desk and speaks into it. Meanwhile Jackson crosses over to Neff and during the ensuing dialogue between him and Neff we hear Keyes' low voice on the phone in the background. Keyes rejoins them at this point and has opened the door for Jackson who goes out. Keyes puts a cigar in his mouth and starts tapping his pockets for matches."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Several people come out among them Neff carrying his briefcase. Lola sees him and stands up and as he is about to pass through the anteroom without recognizing her she stops him. Neff looks at her a little startled. He pushes the swing door open and holds it for her. As she passes in front of him his eyes narrow in uneasy speculation. Neff comes up level with Lola and leads her towards his office with the camera following them. He opens the door of his office and holds it for her and she enters. Lou Schwartz one of the other salesmen is working at his desk but Lola enters with Neff following after her. Lou gets up and goes out. Neff stares at her tensely and she turns again to the window so he will not see that. she is crying. Neff gets up and goes to her. In the foreground Neff and Lola are having dinner with the usual activity of Olvera Street—sidewalk peddlers guitar players etc—in the background. Neff and Lola are driving along the beach near Santa Monica. Neff is wearing a light summer suit in contrast to Lola's mourning. Apparently she is telling him a story and now and then she laughs but there is no sound. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. There is a close shot of Neff behind the steering wheel and he is only half listening to Lola. Neff with his hat on and no briefcase is walking toward Keyes' office. As he comes up close to the door he stops with a startled expression on his face. On a chair beside the door sits a familiar figure. He is Jackson the man from the observation platform of the train. He is wearing his Stetson hat and smoking a cigar studying something in the file folder. Neff recognizes him immediately but Jackson does not look up. Neff controls his expression and goes on to open the door to Keyes' office. Neff is just closing the door from the inside. Keyes with his coat off is lying on his office couch chewing on a cigar as usual. Keyes bounces off the couch like a rubber ball and levels a finger at him. Keyes goes to the door and opens it and Jackson enters with the file folder. Jackson indicates the cigar he himself is smoking and the file folder he is holding. Keyes remembers he forgot to introduce Jackson and picks up the telephone on his desk and speaks into it. Meanwhile Jackson crosses over to Neff and during the ensuing dialogue between him and Neff we hear Keyes' low voice on the phone in the background. Keyes rejoins them at this point and has opened the door for Jackson who goes out. Keyes puts a cigar in his mouth and starts tapping his pockets for matches."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Several people come out among them Neff carrying his briefcase. Lola sees him and stands up and as he is about to pass through the anteroom without recognizing her she stops him. Neff looks at her a little startled. He pushes the swing door open and holds it for her. As she passes in front of him his eyes narrow in uneasy speculation. Neff comes up level with Lola and leads her towards his office with the camera following them. He opens the door of his office and holds it for her and she enters. Lou Schwartz one of the other salesmen is working at his desk but Lola enters with Neff following after her. Neff is just closing the door from the inside. Keyes with his coat off is lying on his office couch chewing on a cigar as usual. Keyes bounces off the couch like a rubber ball and levels a finger at him. Keyes goes to the door and opens it and Jackson enters with the file folder. Jackson indicates the cigar he himself is smoking and the file folder he is holding. Keyes remembers he forgot to introduce Jackson and picks up the telephone on his desk and speaks into it. Meanwhile Jackson crosses over to Neff and during the ensuing dialogue between him and Neff we hear Keyes' low voice on the phone in the background. Keyes rejoins them at this point and has opened the door for Jackson who goes out. Keyes puts a cigar in his mouth and starts tapping his pockets for matches."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Several people come out among them Neff carrying his briefcase. Lola sees him and stands up and as he is about to pass through the anteroom without recognizing her she stops him. Neff looks at her a little startled. Keyes remembers he forgot to introduce Jackson and picks up the telephone on his desk and speaks into it. Meanwhile Jackson crosses over to Neff and during the ensuing dialogue between him and Neff we hear Keyes' low voice on the phone in the background. Keyes rejoins them at this point and has opened the door for Jackson who goes out. Keyes puts a cigar in his mouth and starts tapping his pockets for matches."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Several cats emerge, among them Jasper, lugging his backpack. Daisy notices him and hops up, and as he is about to drift through the hallway without acknowledging her, she halts him. Jasper glances at her a tad confused. He shoves the barn door ajar and steadies it for her. As she strides past him, his eyes squint in uneasy reflection. Jasper strolls alongside Daisy and guides her towards his workshop, with the drone tailing them. He unlocks the entrance of his workshop and steadies it for her, and she steps inside. Max Thompson, one of the other bakers, is tinkering at his station, but Daisy walks in, with Jasper trailing behind. Max rises and exits. Jasper gazes at her anxiously, and she spins once more to the skylight so he won't notice that she is weeping. Jasper rises and approaches her. In the foreground, Jasper and Daisy are having a picnic, with the typical hustle of Fisherman's Wharf—street jugglers, violinists, etc.—in the backdrop. Jasper and Daisy are cruising along the forest near Redwood Park. Jasper is sporting a breezy spring jacket, contrasting with Daisy's somber attire. Apparently, she is narrating a tale to him and now and then she chuckles, but there is no noise. There is a close glimpse of Jasper behind the handlebars, and he is only partly attending to Daisy. Jasper, with his cap on and no backpack, is strolling toward Palmer's workshop. As he approaches close to the entrance, he pauses with a surprised expression on his face. On a stool beside the entrance sits a recognized silhouette. He is McCoy, the man from the lookout tower of the ship. He is wearing his cowboy hat and chewing on a toothpick, examining something in the scrapbook. Jasper identifies him instantly, but McCoy does not glance up. Jasper maintains his composure and proceeds to unlatch the entrance to Palmer's workshop. Jasper is just sealing the entrance from within. Palmer, with his apron off, is reclining on his workshop hammock, munching on a toothpick, as usual. Palmer springs off the hammock like a jack-in-the-box and aims a thumb at him. Palmer strides to the entrance and unlatches it, and McCoy steps in with the scrapbook. McCoy gestures at the toothpick he himself is chewing and the scrapbook he is grasping. Palmer recalls he neglected to introduce McCoy and picks up the lantern on his bench and speaks into it. Meanwhile, McCoy ambles over to Jasper, and during the following conversation between him and Jasper, we catch Palmer's muted voice on the lantern in the backdrop. Palmer rejoins them at this juncture and has swung the entrance open for McCoy, who steps out. Palmer places a toothpick in his mouth and starts patting his vest for matches."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Several people exit a building, including Neff with his briefcase. Lola spots Neff and stops him; he looks at her, startled, and holds the door as they proceed to his office. Once inside, Neff observes Lola crying at the window, and he approaches. Later, Neff and Lola have dinner amid the activity of Olvera Street and then drive along a beach. Lola, in mourning attire, shares a story, but Neff only half-listens. Neff walks to Keyes' office and is surprised to see Jackson, a familiar figure from the train, seated nearby. Inside, Keyes points at Neff upon seeing him, then opens the door for Jackson, who enters with a file. Keyes introduces Jackson, who exchanges words with Neff, while Keyes is briefly on the phone. After a brief dialogue, Jackson exits, and Keyes lights a cigar, searching for matches."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Keyes puts a cigar in his mouth and starts tapping his pockets for matches Keyes rejoins them at this point and has opened the door for Jackson who goes out  Meanwhile Jackson crosses over to Neff and during the ensuing dialogue between him and Neff we hear Keyes' low voice on the phone in the background  Keyes remembers he forgot to introduce Jackson and picks up the telephone on his desk and speaks into it  Jackson indicates the cigar he himself is smoking and the file folder he is holding  Keyes goes to the door and opens it and Jackson enters with the file folder  Keyes bounces off the couch like a rubber ball and levels a finger at him  Keyes with his coat off is lying on his office couch chewing on a cigar as usual  Neff is just closing the door from the inside  Neff controls his expression and goes on to open the door to Keyes' office  Neff recognizes him immediately but Jackson does not look up  He is wearing his Stetson hat and smoking a cigar studying something in the file folder  He is Jackson the man from the observation platform of the train  On a chair beside the door sits a familiar figure  As he comes up close to the door he stops with a startled expression on his face  Neff with his hat on and no briefcase is walking toward Keyes' office  There is a close shot of Neff behind the steering wheel and he is only half listening to Lola  Apparently she is telling him a story and now and then she laughs but there is no sound  Neff is wearing a light summer suit in contrast to Lola's mourning  Neff and Lola are driving along the beach near Santa Monica  In the foreground Neff and Lola are having dinner with the usual activity of Olvera Street—sidewalk peddlers guitar players etc—in the background  Neff gets up and goes to her  she is crying  Neff stares at her tensely and she turns again to the window so he won't see that  Lou gets up and goes out  Lou Schwartz one of the other salesmen is working at his desk but Lola enters with Neff following after her  He opens the door of his office and holds it for her and she enters  Neff comes up level with Lola and leads her towards his office with the camera following them  As she passes in front of him his eyes narrow in uneasy speculation  He pushes the swing door open and holds it for her  Neff looks at her a little startled  Lola sees him and stands up and as he is about to pass through the anteroom without recognizing her she stops him  Several people come out among them Neff carrying his briefcase "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Lola sees him and stands up and as he is about to pass through the anteroom without recognizing her she stops him Several people come out among them Neff carrying his briefcase He pushes the swing door open and holds it for her Neff looks at her a little startled Neff comes up level with Lola and leads her towards his office with the camera following them As she passes in front of him his eyes narrow in uneasy speculation Lou Schwartz one of the other salesmen is working at his desk but Lola enters with Neff following after her He opens the door of his office and holds it for her and she enters Neff stares at her tensely and she turns again to the window so he will not see that Lou gets up and goes out Neff gets up and goes to her she is crying Neff and Lola are driving along the beach near Santa Monica In the foreground Neff and Lola are having dinner with the usual activity of Olvera Street—sidewalk peddlers guitar players etc—in the background Apparently she is telling him a story and now and then she laughs but there is no sound Neff is wearing a light summer suit in contrast to Lola's mourning Neff with his hat on and no briefcase is walking toward Keyes' office There is a close shot of Neff behind the steering wheel and he is only half listening to Lola On a chair beside the door sits a familiar figure As he comes up close to the door he stops with a startled expression on his face He is wearing his Stetson hat and smoking a cigar studying something in the file folder He is Jackson the man from the observation platform of the train Neff controls his expression and goes on to open the door to Keyes' office Neff recognizes him immediately but Jackson does not look up Keyes with his coat off is lying on his office couch chewing on a cigar as usual Neff is just closing the door from the inside Keyes goes to the door and opens it and Jackson enters with the file folder Keyes bounces off the couch like a rubber ball and levels a finger at him Keyes remembers he forgot to introduce Jackson and picks up the telephone on his desk and speaks into it Jackson indicates the cigar he himself is smoking and the file folder he is holding Keyes rejoins them at this point and has opened the door for Jackson who goes out Meanwhile Jackson crosses over to Neff and during the ensuing dialogue between him and Neff we hear Keyes' low voice on the phone in the background Keyes puts a cigar in his mouth and starts tapping his pockets for matches"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Neff with his hat on and no briefcase is walking toward Keyes' office  As he comes up close to the door he stops with a startled expression on his face  On a chair beside the door sits a familiar figure  He is Jackson the man from the observation platform of the train  He is wearing his Stetson hat and smoking a cigar studying something in the file folder  Neff recognizes him immediately but Jackson does not look up  Neff controls his expression and goes on to open the door to Keyes' office  Neff is just closing the door from the inside  Keyes with his coat off is lying on his office couch chewing on a cigar as usual  Keyes bounces off the couch like a rubber ball and levels a finger at him  Keyes goes to the door and opens it and Jackson enters with the file folder  Jackson indicates the cigar he himself is smoking and the file folder he is holding  Keyes remembers he forgot to introduce Jackson and picks up the telephone on his desk and speaks into it  Meanwhile Jackson crosses over to Neff and during the ensuing dialogue between him and Neff we hear Keyes' low voice on the phone in the background  Keyes rejoins them at this point and has opened the door for Jackson who goes out  Keyes puts a cigar in his mouth and starts tapping his pockets for matches Several people come out among them Neff carrying his briefcase  Lola sees him and stands up and as he is about to pass through the anteroom without recognizing her she stops him  Neff looks at her a little startled  He pushes the swing door open and holds it for her  As she passes in front of him his eyes narrow in uneasy speculation  Neff comes up level with Lola and leads her towards his office with the camera following them  He opens the door of his office and holds it for her and she enters  Lou Schwartz one of the other salesmen is working at his desk but Lola enters with Neff following after her  Lou gets up and goes out  Neff stares at her tensely and she turns again to the window so he won't see that  she is crying  Neff gets up and goes to her  In the foreground Neff and Lola are having dinner with the usual activity of Olvera Street—sidewalk peddlers guitar players etc—in the background  Neff and Lola are driving along the beach near Santa Monica  Neff is wearing a light summer suit in contrast to Lola's mourning  Apparently she is telling him a story and now and then she laughs but there is no sound  There is a close shot of Neff behind the steering wheel and he is only half listening to Lola "
        }
      ]
    }
  ]
}