{
  "ground_truth": "Harry lines up next to the keeper, Oliver Wood, and swallows nervously. The gate opens, and the teams step forward. One after the other, they fly out of the player's tunnel and swoop around between the tall spectator towers, which surround the oval grassy arena. A student introduces the game. In the stands, Gryffindor supporters wear red and gold scarves, while Slytherin's colors are green and white. The Slytherin team fly out in their green cloaks. Standing around the oval arena, the spectators cheer on their teams, with other spectators seated at the top of tall towers hung with heraldic designs. The players hover above the Quidditch trunk, which stands quivering in the center of the pitch. Madam Hooch kicks the trunk, and the lid falls open as three boars fly out. She lifts out the red Quaffle and throws it high into the air. A Gryffindor chaser, Angelina, grabs the Quaffle and heads straight for the goal. The spectators duck as the players swoop low over their heads. The Slytherin players try to hit Angelina off, but she's too quick for them. She aims for the center hoop, and the Quaffle sails straight through the middle, putting points on the scoreboard. Harry is nearly knocked off his broomstick by a passing Bludger. Hagrid cheers on the Gryffindors, while Snape stares and Quirrell looks nervous. The Slytherin captain gives Angelina a slight kick. Dodging a Bludger, he hurls the Quaffle towards a hoop, then scowls as Oliver skillfully knocks it away and gives him a cheeky smile. The Gryffindors capture the Quaffle, ducking and diving, passing it around the team from chaser to chaser. Well placed in front of the goal, Angelina catches the Quaffle and hurls it straight through the center of the hoop, past the helpless Slytherin keeper, adding twenty points on the scoreboard. The Gryffindor supporters are ecstatic. The Slytherin captain aims again for the goal, but Oliver catches the Quaffle, and the captain smiles angrily. Snatching a bat from a beater, he deliberately hits a Bludger straight to Oliver, who falls backwards through the hoop and hurdles downwards, landing heavily on the dry sand below the goal. Harry stares with disbelief at the cheating Slytherin captain. Malfoy and his cronies celebrate while Professor McGonagall watches anxiously. A Slytherin sails over the beater's head and shoots accurately at the hoop; the Quaffle flies through, giving ten points to Slytherin. Harry clenches his fists with frustration. The Slytherin captain points at Angelina, and with his teammate, on each side, jostles and confuses her. She collides with one of the tall spectator towers, tumbles down behind the canvas covering, and lies without moving on the gravel path below.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Harry lines up adjacent to the keeper, Oliver Wood, and gulps anxiously. The gate opens, and the squads step forward. One after the other, they soar out of the player's tunnel and glide around between the lofty spectator towers, which encircle the oval grassy stadium. A pupil introduces the game. In the stands, Gryffindor fans wear red and gold scarves, while Slytherin's shades are green and white. The Slytherin squad fly out in their green cloaks. Standing around the oval stadium, the spectators cheer on their squads, with other spectators seated at the summit of tall towers hung with heraldic motifs. The athletes hover above the Quidditch chest, which stands trembling in the center of the field. Madam Hooch kicks the chest, and the lid falls open as three boars fly out. She lifts out the red Quaffle and flings it high into the air. A Gryffindor chaser, Angelina, snatches the Quaffle and heads directly for the target. The spectators duck as the athletes swoop low over their heads. The Slytherin athletes try to knock Angelina off, but she's too swift for them. She targets the center hoop, and the Quaffle sails directly through the middle, putting points on the scoreboard. Harry is nearly knocked off his broomstick by a passing Bludger. Hagrid cheers on the Gryffindors, while Snape stares and Quirrell looks uneasy. The Slytherin captain gives Angelina a slight kick. Dodging a Bludger, he flings the Quaffle towards a hoop, then scowls as Oliver expertly knocks it away and gives him a cheeky grin. The Gryffindors seize the Quaffle, ducking and diving, passing it around the squad from chaser to chaser. Well placed in front of the target, Angelina catches the Quaffle and flings it directly through the center of the hoop, past the defenseless Slytherin keeper, adding twenty points on the scoreboard. The Gryffindor fans are ecstatic. The Slytherin captain targets again for the target, but Oliver catches the Quaffle, and the captain smiles angrily. Grabbing a bat from a beater, he intentionally hits a Bludger directly to Oliver, who falls backwards through the hoop and plummets downwards, landing heavily on the dry sand beneath the target. Harry stares with disbelief at the cheating Slytherin captain. Malfoy and his cronies celebrate while Professor McGonagall watches anxiously. A Slytherin sails over the beater's head and shoots precisely at the hoop; the Quaffle flies through, giving ten points to Slytherin. Harry clenches his fists with irritation. The Slytherin captain gestures at Angelina, and with his teammate, on each side, jostles and confounds her. She collides with one of the lofty spectator towers, tumbles down behind the canvas covering, and lies without moving on the gravel path beneath."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Harry is lined up next to the keeper, Oliver Wood, and he swallows nervously. The gate is opened, and the teams step forward. One after the other, they are flown out of the player's tunnel and are swooped around between the tall spectator towers, which surround the oval grassy arena. A student introduces the game. In the stands, red and gold scarves are worn by Gryffindor supporters, while Slytherin's colors are green and white. Green cloaks are worn by the Slytherin team as they fly out. Standing around the oval arena, their teams are cheered on by the spectators, with other spectators seated at the top of tall towers hung with heraldic designs. Above the Quidditch trunk, the players hover, which is standing quivering in the center of the pitch. The trunk is kicked by Madam Hooch, and its lid falls open as three boars fly out. She lifts out the red Quaffle and it is thrown high into the air by her. The Quaffle is grabbed by a Gryffindor chaser, Angelina, and she heads straight for the goal. As the players swoop low over their heads, the spectators duck. Attempts are made by the Slytherin players to hit Angelina off, but she's too quick for them. The center hoop is aimed for by her, and the Quaffle is sailed straight through the middle, points are put on the scoreboard. Harry is nearly knocked off his broomstick by a passing Bludger. The Gryffindors are cheered on by Hagrid, while Snape stares and Quirrell looks nervous. Angelina is given a slight kick by the Slytherin captain. Dodging a Bludger, the Quaffle is hurled towards a hoop by him, then he scowls as Oliver skillfully knocks it away and gives him a cheeky smile. The Quaffle is captured by the Gryffindors, and it is passed around the team from chaser to chaser while they duck and dive. Well placed in front of the goal, the Quaffle is caught by Angelina and she hurls it straight through the center of the hoop, past the helpless Slytherin keeper, twenty points are added on the scoreboard. Gryffindor supporters are ecstatic. The goal is aimed again for by the Slytherin captain, but Oliver catches the Quaffle, and the captain smiles angrily. A bat is snatched from a beater by him, and a Bludger is deliberately hit straight to Oliver, who is knocked backwards through the hoop and is hurdled downwards, landing heavily on the dry sand below the goal. With disbelief, Harry stares at the cheating Slytherin captain. Celebrations are held by Malfoy and his cronies while Professor McGonagall watches anxiously. Over the beater's head, a Slytherin sails and shoots accurately at the hoop; ten points are given to Slytherin as the Quaffle flies through. Frustration causes Harry to clench his fists. Angelina is pointed at by the Slytherin captain, and with his teammate on each side, she is jostled and confused by them. A collision is made by her with one of the tall spectator towers, and she tumbles down behind the canvas covering, lying without moving on the gravel path below."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Harry stands beside keeper Oliver Wood, swallowing nervously. As the gate opens, the teams fly out from the tunnel, swooping between tall spectator towers around the oval arena. A student announces the game. Gryffindor supporters wear red and gold scarves, while Slytherins don green and white. The Slytherin team emerges in green cloaks. Spectators cheer, some seated in high towers with heraldic designs. Players hover above the quivering Quidditch trunk. Madam Hooch kicks it open; three boars fly out. She throws the red Quaffle into the air. Gryffindor chaser Angelina grabs it, heading for the goal, dodging Slytherin attempts to stop her. She scores, earning points. Harry dodges a Bludger, while Hagrid cheers and Snape watches. The Slytherin captain kicks Angelina slightly, throws the Quaffle at a hoop, but Oliver deflects it. Gryffindors pass the Quaffle until Angelina scores again, adding twenty points. Gryffindor supporters are ecstatic. The Slytherin captain aims for the goal, but Oliver catches it, prompting an angry smile. He hits a Bludger at Oliver, who falls, landing heavily. Harry watches the cheating captain incredulously. Malfoy and cronies celebrate, and Professor McGonagall looks anxious. A Slytherin scores ten points, frustrating Harry. The Slytherin captain targets Angelina, and she collides with a tower, falling behind the canvas and lying motionless below."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Harry stands nervously next to Oliver Wood, the keeper, as the gate opens. The teams fly out of the tunnel between tall spectator towers surrounding the grassy arena. A student introduces the game. Gryffindor supporters wear red and gold, while Slytherin's colors are green and white as they fly out in green cloaks. Spectators cheer with others seated atop towers adorned with heraldic designs. Players hover above the quivering Quidditch trunk, which Madam Hooch kicks open, releasing three balls. She throws the Quaffle into the air, and Angelina seizes it, aiming for the goal. Slytherin players try to stop her, but she scores. Harry dodges a Bludger, Hagrid cheers, and professors watch tensely. The Slytherin captain attempts a goal, but Oliver blocks it with a smile. Gryffindors pass the Quaffle until Angelina scores again. Gryffindor supporters rejoice. The Slytherin captain retaliates by hitting Oliver with a Bludger, causing him to fall. Harry is shocked, while Malfoy and his cronies celebrate. A Slytherin scores, adding points for their team. The Slytherin captain and teammate jostle Angelina, who crashes into a tower, falling motionless onto the gravel below."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Harry stands poised and slightly tense, lining up next to the keeper, Oliver Wood, while nervously swallowing and attempting to steady himself. The anticipation builds as the gate swings open, and the teams collectively step forward, ready for the game to commence. In a thrilling sequence, one after another, they fly out of the player's tunnel with grace and speed, weaving expertly between the towering spectator structures, which encircle the expansive, green oval arena. A student takes on the role of announcer, introducing the game to the eager crowd. In the vibrant stands, Gryffindor enthusiasts energetically show their support, proudly wearing red and gold scarves, while the Slytherin supporters sport their own colors of green and white. Emerging with confidence, the Slytherin team flies out clad in their distinctive green cloaks. Surrounding the oval arena, spectators stand and cheer passionately for their respective teams, with additional fans seated atop the lofty towers, adorned with heraldic designs. \n\nThe players skilfully hover over the centrally placed Quidditch trunk, which sits quivering with anticipation on the pitch. With a decisive kick, Madam Hooch sends the trunk’s lid flying open, releasing three boars. She deftly lifts the red Quaffle and hurls it high into the sky. Swiftly, a Gryffindor chaser named Angelina seizes the Quaffle and makes a determined beeline for the goal. Spectators duck instinctively as players swoop daringly low, right over their heads. Slytherin players attempt to knock Angelina off course, but her agility and speed outmatch them. She confidently targets the center hoop, and with precision, the Quaffle sails straight through, immediately placing points on the scoreboard. \n\nHarry experiences a close call as a Bludger whizzes by, nearly unseating him from his broomstick. Meanwhile, Hagrid enthusiastically cheers for the Gryffindors, while Snape’s gaze remains fixed and stern, and Quirrell appears anxious. The Slytherin captain takes a sly opportunity, giving Angelina a slight kick. Artfully dodging a Bludger, he attempts to send the Quaffle towards a hoop but wears a scowl when Oliver expertly deflects it, responding with a cheeky grin. The Gryffindors seize control of the Quaffle, maneuvering deftly, passing it seamlessly from one chaser to the next. Well-positioned in front of the goal, Angelina receives the Quaffle once more, launching it with determination through the center of the hoop past the helpless Slytherin keeper, thereby adding twenty more points to the scoreboard. \n\nGryffindor supporters erupt with joy and excitement at their growing lead. Undeterred, the Slytherin captain makes another attempt at the goal, but Oliver catches the Quaffle again, provoking an irate yet reluctant smile from the captain. Grabbing a bat from a nearby beater, he deliberately strikes a Bludger directly at Oliver, causing him to fall backward through the hoop and crash into the dry sand below with a heavy thud. Harry, taken aback by the blatant cheating, stares in disbelief at the Slytherin captain. Meanwhile, Malfoy and his cronies revel in the chaos, celebrating as Professor McGonagall watches the unfolding events with increasing worry. A Slytherin player swoops confidently over a beater’s head, aiming at the hoop with precision; the Quaffle flies through, earning ten points for Slytherin. Harry is consumed with frustration, clenching his fists tightly. The Slytherin captain cunningly points at Angelina and, with a teammate positioned on each side, jostles and confuses her. She loses control, colliding with one of the towering spectator structures, tumbling down behind the canvas covering, and lies motionless on the gravel path below."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Harry stands poised and slightly tense, positioned next to the vigilant keeper, Oliver Wood. He is internally battling his nerves, swallowing anxiously while trying to steady himself. The anticipation in the air is palpable as the gate swings open. The teams, in unison, step forward, ready and prepared for the game to begin. In an exhilarating display, one by one, they fly out of the player's tunnel with elegance and remarkable speed, weaving expertly between the towering spectator structures that encircle the expansive, green oval arena. A student eagerly takes on the role of announcer, enthusiastically introducing the game to the awaiting crowd. In the vibrant stands, Gryffindor enthusiasts energetically flaunt their support, proudly wrapping themselves in red and gold scarves, while the Slytherin supporters wear their own distinctive colors of green and white. The Slytherin team, emerging with bold confidence, flies out clad in their unique, recognizable green cloaks. All around the oval arena, spectators stand and cheer passionately for their respective teams, with additional fans seated atop the lofty towers that are adorned with heraldic designs.\n\nThe players hover skillfully over the centrally placed Quidditch trunk, which sits quivering with anticipation on the pitch. With a decisive, powerful kick, Madam Hooch sends the trunk’s lid flying open, releasing three Boars. In a deft move, she lifts the red Quaffle and hurls it high into the sky. Swiftly reacting, a Gryffindor chaser named Angelina seizes the Quaffle, making a determined and focused beeline for the goal. Spectators duck instinctively as players swoop with daring precision, flying low right over their heads. The Slytherin players attempt to knock Angelina off her course, but her agility and speed are more than a match for them. She confidently targets the center hoop, and with precision and skill, the Quaffle sails straight through it, immediately adding points to the scoreboard.\n\nHarry experiences a harrowing close call as a Bludger whizzes by, nearly unseating him from his broomstick. Meanwhile, Hagrid is enthusiastically cheering for the Gryffindors, while Snape’s gaze remains fixed and stern, and Quirrell appears noticeably anxious. The Slytherin captain seizes a sly opportunity, giving Angelina a slight kick. He artfully dodges a Bludger and attempts to send the Quaffle towards a hoop, but wears a scowl when Oliver expertly deflects it with a cheeky grin. The Gryffindors quickly seize control of the Quaffle, maneuvering it deftly and passing it seamlessly from one chaser to the next. Well-positioned in front of the goal, Angelina receives the Quaffle once more, launching it with determined accuracy through the center of the hoop, past the helpless Slytherin keeper, thereby adding twenty more points to the scoreboard.\n\nGryffindor supporters erupt with uncontained joy and excitement at their growing lead. Undeterred by the challenge, the Slytherin captain makes another bold attempt at the goal, but Oliver, showcasing his skills, catches the Quaffle again, provoking an irate yet reluctant smile from the captain. Grabbing a bat from a nearby beater, he deliberately strikes a Bludger directly at Oliver, causing him to fall backward through the hoop and crash into the dry sand below with a loud thud. Harry, taken aback by the blatant cheating, stares in disbelief at the Slytherin captain. Meanwhile, Malfoy and his cronies revel in the chaos, celebrating as Professor McGonagall watches the unfolding events with increasing worry. A Slytherin player, with bold confidence, swoops gracefully over a beater’s head, aiming precisely at the hoop; the Quaffle flies through it, earning ten points for Slytherin. Harry is consumed with frustration, clenching his fists tightly in anger. The Slytherin captain cunningly points at Angelina, and with a teammate positioned strategically on each side, they jostle and confuse her. She loses control, disastrously colliding with one of the towering spectator structures, tumbling helplessly down behind the canvas covering, and lies motionless on the gravel path below."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Harry finds himself standing in line next to the keeper, Oliver Wood, and as he swallows nervously, his gaze is fixed ahead, mentally preparing for what comes next. The gate in front of them slowly opens, and the teams take a synchronized step forward, their expressions a mix of anticipation and focus. One by one, they mount their broomsticks and fly out of the player's tunnel, accelerating into the open space of the arena. They expertly maneuver around and between the tall spectator towers that encircle the oval grassy field, each sweep of their flight path carefully calculated. Up in the stands, a student introduces the game, their voice echoing through the arena, while Gryffindor supporters proudly display their allegiance with red and gold scarves draped around their necks, and Slytherin fans counter with green and white adornments. The Slytherin team makes a dramatic entrance in their green cloaks, their movements fluid and confident. Spectators standing along the perimeter of the arena cheer enthusiastically for their respective teams, while others seated at the top of the towering stands, adorned with heraldic designs, add to the increasing crescendo of excitement. The players gather above the Quidditch trunk positioned in the pitch's center, where it quivers in anticipation. With a decisive motion, Madam Hooch kicks the trunk, causing the lid to tilt open as three balls burst forth. She retrieves the Quaffle, raises it high, and with a vigorous throw, launches it into the air. Angelina, a Gryffindor chaser, swiftly takes control of the Quaffle and streaks towards the goal, executing sharp turns and maintaining her speed. The spectators collectively duck as players swoop low, their broomsticks whizzing inches above heads. Slytherin players make a concerted effort to intercept Angelina, but she's too agile, weaving past them with ease. Aiming carefully, she releases the Quaffle, and it sails unerringly through the center hoop, igniting cheers as points are added to the scoreboard for Gryffindor. Meanwhile, Harry narrowly avoids being unseated by a Bludger that zooms past, barely missing him. Hagrid, in the crowd, boisterously supports the Gryffindors, counterbalancing Snape's intense stare and Quirrell's evident anxiety. Confronted by Gryffindor's early success, the Slytherin captain resorts to underhanded tactics, slyly giving Angelina a minor kick. Then, deftly maneuvering to avoid a Bludger, he propels the Quaffle with force towards a hoop, only to be thwarted as Oliver gracefully deflects it, responding with a cheeky smile that further irritates the captain. Gryffindors regain possession of the Quaffle, engaging in a rapid series of passes executed with precision, as they duck, dive, and weave across the pitch. Positioned advantageously before the goal, Angelina seizes the Quaffle, propelling it through the hoop's center past the outmatched Slytherin keeper, further increasing Gryffindor's lead by twenty points. The Gryffindor supporters erupt in jubilation, their cheers reverberating around the stadium. The Slytherin captain, undeterred, makes another bid for the goal, but Oliver intercepts with swift reflexes, prompting the captain to respond with an angry smile. In frustration, the captain grabs a bat from a beater and deliberately strikes a Bludger directly towards Oliver, causing him to topple backward through the hoop and land heavily on the sand below the goal, leaving Harry aghast at the blatant cheating. Malfoy and his companions exult in the underhanded tactic while Professor McGonagall observes with concern etched on her face. A Slytherin player, showing deft skill, navigates above the beater's head and releases a precise shot at the hoop; the Quaffle sails cleanly through, adding ten points for Slytherin. Harry, witnessing this, clenches his fists in mounting frustration. The Slytherin captain then directs a pointed finger at Angelina, and with a coordinated effort involving a teammate on either side, they jostle and disorient her. As Angelina struggles to maintain her course, she collides with one of the towering spectator structures, tumbles out of sight behind the canvas covering, and lands motionless on the gravel path below."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Harry lines up nervously next to the keeper, Oliver Wood, as the gate opens. The teams fly out of the player’s tunnel and swoop around the spectator towers of the oval grassy arena, surrounded by cheering supporters in Gryffindor’s red and gold and Slytherin’s green and white. A student introduces the game, and Madam Hooch kicks open the Quidditch trunk, releasing three boars. She throws the red Quaffle into the air, and Gryffindor chaser Angelina swiftly grabs it, heading for the goal. Slytherin players attempt to intercept, but she skillfully scores through the center hoop. As the Gryffindors celebrate, Harry narrowly avoids a Bludger. Hagrid cheers enthusiastically, while Snape looks on and Quirrell appears nervous. The Slytherin captain kicks Angelina and tries to score, but Oliver blocks the Quaffle, and the Gryffindors pass it among themselves. Positioned in front of the goal, Angelina scores again, delighting Gryffindor supporters. The Slytherin captain attempts another goal, but Oliver catches the Quaffle. Frustrated, the captain hits a Bludger at Oliver, who falls heavily to the ground. Harry watches in disbelief as Malfoy and his allies celebrate. A Slytherin player scores, narrowing the gap. Tension rises as the Slytherin captain jostles Angelina with a teammate, causing her to crash into a spectator tower and fall unconscious onto the gravel below."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Harry lines up next to the keeper, Oliver Wood, the dedicated captain of the Gryffindor Quidditch team, and swallows nervously. The gate opens, and the teams step forward to the roar of the crowd. One after the other, they fly out of the player's tunnel, a structure designed to amplify the anticipation of the match, and swoop around between the tall spectator towers, which surround the oval grassy arena, reminiscent of a medieval jousting ground. A student from the commentary team, perched in a box high above, introduces the game with an energetic flair. In the stands, Gryffindor supporters, known for their passionate loyalty, wear red and gold scarves, while Slytherin's colors are green and white, reflecting the traditional rivalry between the houses. The Slytherin team fly out in their green cloaks, emblematic of their house's cunning and ambition. Standing around the oval arena, the spectators cheer on their teams, with other spectators seated at the top of tall towers hung with heraldic designs, each pennant representing a house's legacy. The players hover above the Quidditch trunk, which stands quivering in the center of the pitch, containing the enchanted balls essential for the game. Madam Hooch, the seasoned referee known for her strictness, kicks the trunk, and the lid falls open as three boars fly out, revealing the fierce Bludgers. She lifts out the red Quaffle and throws it high into the air. A Gryffindor chaser, Angelina, renowned for her agility, grabs the Quaffle and heads straight for the goal. The spectators duck as the players swoop low over their heads, creating an exhilarating spectacle. The Slytherin players try to hit Angelina off, but she's too quick for them, exemplifying her skill. She aims for the center hoop, and the Quaffle sails straight through the middle, putting points on the scoreboard. Harry is nearly knocked off his broomstick by a passing Bludger, one of the perilous balls designed to disrupt players. Hagrid, the gentle giant and gamekeeper, cheers on the Gryffindors with his booming voice, while Snape stares and Quirrell looks nervous, hinting at deeper tensions. The Slytherin captain gives Angelina a slight kick, a move that underscores the team's reputation for bending the rules. Dodging a Bludger, he hurls the Quaffle towards a hoop, then scowls as Oliver skillfully knocks it away and gives him a cheeky smile. The Gryffindors capture the Quaffle, ducking and diving, passing it around the team from chaser to chaser with seamless coordination. Well placed in front of the goal, Angelina catches the Quaffle and hurls it straight through the center of the hoop, past the helpless Slytherin keeper, adding twenty points on the scoreboard. The Gryffindor supporters are ecstatic, their cheers echoing across the pitch. The Slytherin captain aims again for the goal, but Oliver catches the Quaffle, demonstrating his exceptional reflexes, and the captain smiles angrily. Snatching a bat from a beater, he deliberately hits a Bludger straight to Oliver, who falls backwards through the hoop and hurdles downwards, landing heavily on the dry sand below the goal, a testament to the game's physical demands. Harry stares with disbelief at the cheating Slytherin captain. Malfoy and his cronies celebrate with smug satisfaction while Professor McGonagall watches anxiously, her protective instincts heightened. A Slytherin sails over the beater's head and shoots accurately at the hoop; the Quaffle flies through, giving ten points to Slytherin. Harry clenches his fists with frustration, feeling the weight of the match's intensity. The Slytherin captain points at Angelina, and with his teammate, on each side, jostles and confuses her, exemplifying their aggressive tactics. She collides with one of the tall spectator towers, tumbles down behind the canvas covering, and lies without moving on the gravel path below, causing the audience to gasp in concern."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Harry lines up next to the keeper Oliver Wood and swallows nervously. The gate opens and the teams step forward. One after the other they fly out of the player's tunnel and swoop around between the tall spectator towers which surround the oval grassy arena. A student introduces the game. In the stands Gryffindor supporters wear red and gold scarves while Slytherin's colors are green and white. The Slytherin team fly out in their green cloaks. Standing around the oval arena the spectators cheer on their teams with other spectators seated at the top of tall towers hung with heraldic designs. The players hover above the Quidditch trunk which stands quivering in the center of the pitch. Madam Hooch kicks the trunk and the lid falls open as three boars fly out. She lifts out the red Quaffle and throws it high into the air. A Gryffindor chaser. Angelina grabs the Quaffle and heads straight for the goal. The spectators duck as the players swoop low over their heads. The Slytherin players try to hit Angelina off but she is too quick for them. She aims for the center hoop and the Quaffle sails straight through the middle putting points on the scoreboard. Harry is nearly knocked off his broomstick by a passing Bludger. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Hagrid cheers on the Gryffindors while Snape stares and Quirrell looks nervous. The Slytherin captain gives Angelina a slight kick. Dodging a Bludger he hurls the Quaffle towards a hoop then scowls as Oliver skillfully knocks it away and gives him a cheeky smile. The Gryffindors capture the Quaffle ducking and diving passing it around the team from chaser to chaser. Well placed in front of the goal. Angelina catches the Quaffle and hurls it straight through the center of the hoop past the helpless Slytherin keeper adding twenty points on the scoreboard. The Gryffindor supporters are ecstatic. The Slytherin captain aims again for the goal but Oliver catches the Quaffle and the captain smiles angrily. Snatching a bat from a beater. he deliberately hits a Bludger straight to Oliver who falls backwards through the hoop and hurdles downwards landing heavily on the dry sand below the goal. Harry stares with disbelief at the cheating Slytherin captain. Malfoy and his cronies celebrate while Professor McGonagall watches anxiously. A Slytherin sails over the beater's head and shoots accurately at the hoop. the Quaffle flies through giving ten points to Slytherin. Harry clenches his fists with frustration. The Slytherin captain points at Angelina and with his teammate on each side jostles and confuses her. She collides with one of the tall spectator towers tumbles down behind the canvas covering and lies without moving on the gravel path below."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Harry lines up next to the keeper Oliver Wood and swallows nervously. The gate opens and the teams step forward. One after the other they fly out of the player's tunnel and swoop around between the tall spectator towers which surround the oval grassy arena. A student introduces the game. In the stands Gryffindor supporters wear red and gold scarves while Slytherin's colors are green and white. The Slytherin team fly out in their green cloaks. Standing around the oval arena the spectators cheer on their teams with other spectators seated at the top of tall towers hung with heraldic designs. The players hover above the Quidditch trunk which stands quivering in the center of the pitch. Madam Hooch kicks the trunk and the lid falls open as three boars fly out. She lifts out the red Quaffle and throws it high into the air. A Gryffindor chaser. Angelina grabs the Quaffle and heads straight for the goal. The spectators duck as the players swoop low over their heads. The Slytherin players try to hit Angelina off but she is too quick for them. She aims for the center hoop and the Quaffle sails straight through the middle putting points on the scoreboard. Harry is nearly knocked off his broomstick by a passing Bludger. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. Hagrid cheers on the Gryffindors while Snape stares and Quirrell looks nervous. The Slytherin captain gives Angelina a slight kick. Dodging a Bludger he hurls the Quaffle towards a hoop then scowls as Oliver skillfully knocks it away and gives him a cheeky smile. The Gryffindors capture the Quaffle ducking and diving passing it around the team from chaser to chaser. Well placed in front of the goal. Angelina catches the Quaffle and hurls it straight through the center of the hoop past the helpless Slytherin keeper adding twenty points on the scoreboard. The Gryffindor supporters are ecstatic. The Slytherin captain aims again for the goal but Oliver catches the Quaffle and the captain smiles angrily. Snatching a bat from a beater. he deliberately hits a Bludger straight to Oliver who falls backwards through the hoop and hurdles downwards landing heavily on the dry sand below the goal. Harry stares with disbelief at the cheating Slytherin captain. Malfoy and his cronies celebrate while Professor McGonagall watches anxiously. A Slytherin sails over the beater's head and shoots accurately at the hoop. the Quaffle flies through giving ten points to Slytherin. Harry clenches his fists with frustration. The Slytherin captain points at Angelina and with his teammate on each side jostles and confuses her. She collides with one of the tall spectator towers tumbles down behind the canvas covering and lies without moving on the gravel path below."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Harry lines up next to the keeper Oliver Wood and swallows nervously. The gate opens and the teams step forward. One after the other they fly out of the player's tunnel and swoop around between the tall spectator towers which surround the oval grassy arena. A student introduces the game. In the stands Gryffindor supporters wear red and gold scarves while Slytherin's colors are green and white. The Slytherin team fly out in their green cloaks. Standing around the oval arena the spectators cheer on their teams with other spectators seated at the top of tall towers hung with heraldic designs. The players hover above the Quidditch trunk which stands quivering in the center of the pitch. Snatching a bat from a beater. he deliberately hits a Bludger straight to Oliver who falls backwards through the hoop and hurdles downwards landing heavily on the dry sand below the goal. Harry stares with disbelief at the cheating Slytherin captain. Malfoy and his cronies celebrate while Professor McGonagall watches anxiously. A Slytherin sails over the beater's head and shoots accurately at the hoop. the Quaffle flies through giving ten points to Slytherin. Harry clenches his fists with frustration. The Slytherin captain points at Angelina and with his teammate on each side jostles and confuses her. She collides with one of the tall spectator towers tumbles down behind the canvas covering and lies without moving on the gravel path below."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Harry lines up next to the keeper Oliver Wood and swallows nervously. The gate opens and the teams step forward. One after the other they fly out of the player's tunnel and swoop around between the tall spectator towers which surround the oval grassy arena. the Quaffle flies through giving ten points to Slytherin. Harry clenches his fists with frustration. The Slytherin captain points at Angelina and with his teammate on each side jostles and confuses her. She collides with one of the tall spectator towers tumbles down behind the canvas covering and lies without moving on the gravel path below."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Martin crouches beside the gardener, Georgia Blue, and whistles anxiously. The door swings open, and the bands march inward. One after another, they skate out of the artist's hallway and glide around beneath the towering library books, which enclose the rectangular icy pond. A teacher announces the performance. In the audience, Lavender Club members wear purple and silver ties, while Cerulean's hues are blue and yellow. The Cerulean ensemble slides out in their azure jackets. Ringing the rectangular pond, the viewers applaud their bands, with other audiences perched at the peak of towering books draped with floral panels. The skaters twirl above the chess box, which rests trembling in the heart of the field. Doctor Finch nudges the box, and the cover drops open as three doves soar out. She draws out the orange Sphere and flings it far into the sky. A Lavender leader, Bianca, snatches the Sphere and charges directly toward the net. The audience flinches as the skaters glide low above their faces. The Cerulean skaters attempt to shove Bianca aside, but she's too swift for them. She targets the circular ring, and the Sphere glides directly through the core, tallying marks on the scoreboard. Martin is almost thrown off his skateboard by a rushing Marble. Nigel applauds the Lavenders, while Thompson gazes and Quincy appears jittery. The Cerulean director nudges Bianca slightly. Evading a Marble, he lobs the Sphere towards a ring, then grimaces as Georgia deftly bats it aside and grants him a playful grin. The Lavenders seize the Sphere, weaving and swooping, passing it among the team from leader to leader. Perfectly aligned in front of the net, Bianca catches the Sphere and flings it straight through the core of the ring, beyond the futile Cerulean guardian, adding forty marks on the scoreboard. The Lavender fans are overjoyed. The Cerulean director targets the net once more, but Georgia intercepts the Sphere, and the director grins bitterly. Grabbing a paddle from a striker, he intentionally smacks a Marble directly at Georgia, who tumbles backward through the ring and plummets downward, hitting the solid rock beneath the net. Martin gapes with amazement at the dishonest Cerulean director. Jerome and his clique rejoice while Instructor Petunia observes nervously. A Cerulean glides over the striker's hair and aims precisely at the ring; the Sphere zooms through, awarding twenty marks to Cerulean. Martin tightens his hands with anger. The Cerulean director gestures at Bianca, and with his partner, on either flank, shoves and confounds her. She crashes into one of the towering library books, plunges behind the silk drape, and rests motionless on the pebble road beneath."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Harry stands nervously beside keeper Oliver Wood as the Quidditch match begins. The Gryffindor and Slytherin teams fly out into the grassy arena, surrounded by cheering spectators in towers adorned with team colors. Madam Hooch releases the Quaffle, and Gryffindor's Angelina swiftly scores, dodging Slytherin players. Harry narrowly avoids a Bludger while Oliver blocks another Slytherin attempt. Angelina scores again, igniting Gryffindor supporters. However, the Slytherin captain's aggression intensifies, knocking Oliver down with a Bludger strike. Malfoy and his group celebrate as Slytherin ties the game. In a calculated move, the Slytherin captain and teammate disrupt Angelina, causing her to crash into a spectator tower and fall, leaving her motionless on the ground."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She collides with one of the tall spectator towers tumbles down behind the canvas covering and lies without moving on the gravel path below The Slytherin captain points at Angelina and with his teammate on each side jostles and confuses her Harry clenches his fists with frustration the Quaffle flies through giving ten points to Slytherin A Slytherin sails over the beater's head and shoots accurately at the hoop Malfoy and his cronies celebrate while Professor McGonagall watches anxiously Harry stares with disbelief at the cheating Slytherin captain he deliberately hits a Bludger straight to Oliver who falls backwards through the hoop and hurdles downwards landing heavily on the dry sand below the goal Snatching a bat from a beater The Slytherin captain aims again for the goal but Oliver catches the Quaffle and the captain smiles angrily The Gryffindor supporters are ecstatic Angelina catches the Quaffle and hurls it straight through the center of the hoop past the helpless Slytherin keeper adding twenty points on the scoreboard Well placed in front of the goal The Gryffindors capture the Quaffle ducking and diving passing it around the team from chaser to chaser Dodging a Bludger he hurls the Quaffle towards a hoop then scowls as Oliver skillfully knocks it away and gives him a cheeky smile The Slytherin captain gives Angelina a slight kick Hagrid cheers on the Gryffindors while Snape stares and Quirrell looks nervous Harry is nearly knocked off his broomstick by a passing Bludger She aims for the center hoop and the Quaffle sails straight through the middle putting points on the scoreboard The Slytherin players try to hit Angelina off but she is too quick for them The spectators duck as the players swoop low over their heads Angelina grabs the Quaffle and heads straight for the goal A Gryffindor chaser She lifts out the red Quaffle and throws it high into the air Madam Hooch kicks the trunk and the lid falls open as three boars fly out The players hover above the Quidditch trunk which stands quivering in the center of the pitch Standing around the oval arena the spectators cheer on their teams with other spectators seated at the top of tall towers hung with heraldic designs The Slytherin team fly out in their green cloaks In the stands Gryffindor supporters wear red and gold scarves while Slytherin's colors are green and white A student introduces the game One after the other they fly out of the player's tunnel and swoop around between the tall spectator towers which surround the oval grassy arena The gate opens and the teams step forward Harry lines up next to the keeper Oliver Wood and swallows nervously"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The gate opens and the teams step forward Harry lines up next to the keeper Oliver Wood and swallows nervously A student introduces the game One after the other they fly out of the player's tunnel and swoop around between the tall spectator towers which surround the oval grassy arena The Slytherin team fly out in their green cloaks In the stands Gryffindor supporters wear red and gold scarves while Slytherin's colors are green and white The players hover above the Quidditch trunk which stands quivering in the center of the pitch Standing around the oval arena the spectators cheer on their teams with other spectators seated at the top of tall towers hung with heraldic designs She lifts out the red Quaffle and throws it high into the air Madam Hooch kicks the trunk and the lid falls open as three boars fly out Angelina grabs the Quaffle and heads straight for the goal A Gryffindor chaser The Slytherin players try to hit Angelina off but she is too quick for them The spectators duck as the players swoop low over their heads Harry is nearly knocked off his broomstick by a passing Bludger She aims for the center hoop and the Quaffle sails straight through the middle putting points on the scoreboard The Slytherin captain gives Angelina a slight kick Hagrid cheers on the Gryffindors while Snape stares and Quirrell looks nervous The Gryffindors capture the Quaffle ducking and diving passing it around the team from chaser to chaser Dodging a Bludger he hurls the Quaffle towards a hoop then scowls as Oliver skillfully knocks it away and gives him a cheeky smile Angelina catches the Quaffle and hurls it straight through the center of the hoop past the helpless Slytherin keeper adding twenty points on the scoreboard Well placed in front of the goal The Slytherin captain aims again for the goal but Oliver catches the Quaffle and the captain smiles angrily The Gryffindor supporters are ecstatic he deliberately hits a Bludger straight to Oliver who falls backwards through the hoop and hurdles downwards landing heavily on the dry sand below the goal Snatching a bat from a beater Malfoy and his cronies celebrate while Professor McGonagall watches anxiously Harry stares with disbelief at the cheating Slytherin captain the Quaffle flies through giving ten points to Slytherin A Slytherin sails over the beater's head and shoots accurately at the hoop The Slytherin captain points at Angelina and with his teammate on each side jostles and confuses her Harry clenches his fists with frustration She collides with one of the tall spectator towers tumbles down behind the canvas covering and lies without moving on the gravel path below"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The Slytherin captain gives Angelina a slight kick Dodging a Bludger he hurls the Quaffle towards a hoop then scowls as Oliver skillfully knocks it away and gives him a cheeky smile The Gryffindors capture the Quaffle ducking and diving passing it around the team from chaser to chaser Well placed in front of the goal Angelina catches the Quaffle and hurls it straight through the center of the hoop past the helpless Slytherin keeper adding twenty points on the scoreboard The Gryffindor supporters are ecstatic The Slytherin captain aims again for the goal but Oliver catches the Quaffle and the captain smiles angrily Snatching a bat from a beater he deliberately hits a Bludger straight to Oliver who falls backwards through the hoop and hurdles downwards landing heavily on the dry sand below the goal Harry stares with disbelief at the cheating Slytherin captain Malfoy and his cronies celebrate while Professor McGonagall watches anxiously A Slytherin sails over the beater's head and shoots accurately at the hoop the Quaffle flies through giving ten points to Slytherin Harry clenches his fists with frustration The Slytherin captain points at Angelina and with his teammate on each side jostles and confuses her She collides with one of the tall spectator towers tumbles down behind the canvas covering and lies without moving on the gravel path below Harry lines up next to the keeper Oliver Wood and swallows nervously The gate opens and the teams step forward One after the other they fly out of the player's tunnel and swoop around between the tall spectator towers which surround the oval grassy arena A student introduces the game In the stands Gryffindor supporters wear red and gold scarves while Slytherin's colors are green and white The Slytherin team fly out in their green cloaks Standing around the oval arena the spectators cheer on their teams with other spectators seated at the top of tall towers hung with heraldic designs The players hover above the Quidditch trunk which stands quivering in the center of the pitch Madam Hooch kicks the trunk and the lid falls open as three boars fly out She lifts out the red Quaffle and throws it high into the air A Gryffindor chaser Angelina grabs the Quaffle and heads straight for the goal The spectators duck as the players swoop low over their heads The Slytherin players try to hit Angelina off but she is too quick for them She aims for the center hoop and the Quaffle sails straight through the middle putting points on the scoreboard Harry is nearly knocked off his broomstick by a passing Bludger Hagrid cheers on the Gryffindors while Snape stares and Quirrell looks nervous"
        }
      ]
    }
  ]
}