{
  "ground_truth": "The professors rise to their feet as a Slytherin chaser tosses the Quaffle into the air and fixes it through the goal with his broomstick. Hovering high above the pitch, Harry follows the game anxiously. Suddenly, the Golden Snitch swoops past, and Harry speeds after it, dodging the Bludgers aimed for his head. His broomstick goes out of control, shaking him violently from side to side and spinning him over and over. Through her binoculars, Hermione spots Snape in the professors' grand stand with his lips moving, and she gives her binoculars to Ron. Harry clings desperately to the bucking broomstick, which spins him off, but he manages to grab the handle and hang underneath, holding on with only one hand as Malfoy and his cronies cheer. Snape is still muttering to himself as Harry grabs the broomstick with both hands, which swings him backward and forward, trying to shake him off. Ron watches through the binoculars as Hermione reaches the professors' grand stand and races up the stairs, where Snape continues muttering. She pulls out her wand and, crawling beneath the seats, gives it a flick, smiling as a flame appears and Snape's cloak starts to burn. The professors beat out the flames, knocking Quirrell off his feet, and Harry's broomstick suddenly calms down. Quirrell and Snape put out the fire and watch as Harry manages to regain control of the Nimbus 2000. He climbs onto the broomstick and zooms off to the Slytherin seeker, who is close behind the Snitch. They fly shoulder to shoulder as the crafty Slytherin barges Harry, trying to knock him out of the way, but Harry circles round and then comes back, with the Slytherin bully barging him again. The Snitch flips from tower to tower, suddenly changing its course and heading straight for the ground. The two seekers follow, but the cowardly Slytherin pulls out at the last moment as they plummet headfirst. The Snitch levels out, skimming low along the ground, and standing precariously on the broomstick, Harry stretches out his hand to catch the Snitch. He takes a step forward, and the broom tips up, sending him somersaulting over onto the grass. He scrambles up, clutching his stomach with both hands as his friends watch with concern. Hagrid peers through the binoculars as Harry spits out the Snitch. As Madam Hooch declares the winner, the Gryffindors leap for joy, with giant Hagrid punching the air victoriously and Hermione shrieking at the top of her voice. Dumbledore and Professor McGonagall applaud enthusiastically, while Snape remains in his seat, expressionless. Standing in the middle of the arena in his scarlet and gold cloak, Harry beams with pride and pleasure. As his teammates swoop around the arena on their broomsticks, celebrating their success, Harry holds the fluttering Golden Snitch triumphantly above his head and slowly turns, displaying his prize to his ecstatic supporters.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The instructors ascend to their feet as a Slytherin pursuer hurls the Quaffle into the air and secures it through the hoop with his broomstick. Hovering high above the field, Harry follows the match apprehensively. Suddenly, the Golden Snitch dives past, and Harry races after it, evading the Bludgers targeted for his head. His broomstick goes out of control, shaking him violently from side to side and rotating him repeatedly. Through her binoculars, Hermione observes Snape in the instructors' grand stand with his lips moving, and she hands her binoculars to Ron. Harry clings frantically to the bucking broomstick, which spins him off, but he manages to grasp the handle and hang underneath, holding on with only one hand as Malfoy and his companions cheer. Snape is still murmuring to himself as Harry grabs the broomstick with both hands, which swings him backward and forward, trying to dislodge him. Ron observes through the binoculars as Hermione reaches the instructors' grand stand and dashes up the stairs, where Snape continues murmuring. She pulls out her wand and, crawling beneath the seats, gives it a flick, grinning as a blaze appears and Snape's cloak starts to burn. The instructors beat out the flames, knocking Quirrell off his feet, and Harry's broomstick suddenly steadies. Quirrell and Snape extinguish the fire and watch as Harry manages to regain control of the Nimbus 2000. He climbs onto the broomstick and zooms off to the Slytherin pursuer, who is close behind the Snitch. They fly shoulder to shoulder as the cunning Slytherin shoves Harry, trying to push him out of the path, but Harry circles around and then comes back, with the Slytherin thug shoving him again. The Snitch zips from tower to tower, suddenly altering its course and heading straight for the ground. The two pursuers follow, but the cowardly Slytherin withdraws at the last moment as they plunge headfirst. The Snitch levels out, skimming low along the ground, and standing precariously on the broomstick, Harry extends his hand to capture the Snitch. He takes a step forward, and the broom tips up, sending him somersaulting over onto the grass. He scrambles up, clutching his abdomen with both hands as his companions watch with concern. Hagrid peers through the binoculars as Harry spits out the Snitch. As Madam Hooch declares the victor, the Gryffindors leap for joy, with giant Hagrid punching the air triumphantly and Hermione shrieking at the top of her voice. Dumbledore and Professor McGonagall applaud enthusiastically, while Snape remains in his seat, expressionless. Standing in the center of the arena in his scarlet and gold cloak, Harry beams with pride and delight. As his teammates swoop around the arena on their broomsticks, celebrating their triumph, Harry holds the fluttering Golden Snitch victoriously above his head and slowly turns, displaying his trophy to his ecstatic supporters."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The professors are risen to their feet by the Slytherin chaser as the Quaffle is tossed into the air and fixed through the goal with his broomstick. Hovering high above the pitch, the game is anxiously followed by Harry. Suddenly, the Golden Snitch is swooped past by it, and it is sped after by Harry, who dodges the Bludgers aimed for his head. His broomstick is made to go out of control, shaking him violently from side to side and spinning him over and over. Through her binoculars, Snape is spotted by Hermione in the professors' grand stand with his lips moving, and Ron is given the binoculars by her. The bucking broomstick is clung to desperately by Harry, which spins him off, but the handle is managed to be grabbed by him and he hangs underneath, holding on with only one hand as Malfoy and his cronies cheer. Snape is still muttering to himself as the broomstick is grabbed by Harry with both hands, which swings him backward and forward, trying to shake him off. The binoculars are watched through by Ron as the professors' grand stand is reached by Hermione, who races up the stairs, where Snape continues muttering. Her wand is pulled out and, crawling beneath the seats, a flick is given to it by her, smiling as a flame is caused to appear and Snape's cloak starts to burn. The flames are beaten out by the professors, knocking Quirrell off his feet, and Harry's broomstick is suddenly calmed down. Quirrell and Snape put out the fire and watch as the Nimbus 2000 is managed to be regained control of by Harry. The broomstick is climbed onto by him and he zooms off to the Slytherin seeker, who is close behind the Snitch. Shoulder to shoulder, they fly as Harry is barged by the crafty Slytherin, trying to knock him out of the way, but Harry circles round and then comes back, with the Slytherin bully barging him again. From tower to tower, the Snitch is flipped by it, suddenly changing its course and heading straight for the ground. The two seekers follow, but at the last moment, the cowardly Slytherin pulls out as they are plummeted headfirst. The Snitch is leveled out, skimming low along the ground, and standing precariously on the broomstick, its hand is stretched out by Harry to catch the Snitch. A step forward is taken by him, and the broom is tipped up, sending him somersaulting over onto the grass. He scrambles up, clutching his stomach with both hands as concern is watched with by his friends. Through the binoculars, Hagrid peers as the Snitch is spat out by Harry. As the winner is declared by Madam Hooch, the Gryffindors are leaped for joy by them, with giant Hagrid punching the air victoriously and Hermione shrieking at the top of her voice. Dumbledore and Professor McGonagall applaud enthusiastically, while Snape remains expressionless in his seat. Standing in the middle of the arena in his scarlet and gold cloak, pride and pleasure are beamed with by Harry. As the arena is swooped around by his teammates on their broomsticks, their success celebrating, the fluttering Golden Snitch is held triumphantly above his head by Harry and he is slowly turned, displaying his prize to his ecstatic supporters."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The professors stand as a Slytherin chaser throws the Quaffle through the goal. High above, Harry anxiously follows the game. Suddenly, the Golden Snitch zooms past, and he speeds after it, dodging Bludgers. His broom goes out of control, violently shaking him. Hermione sees Snape muttering in the grandstand through her binoculars and gives them to Ron. Clinging desperately, Harry manages to grab the broom, hanging on with one hand as Malfoy cheers. Snape keeps muttering as Harry regains his grip. Ron watches Hermione reach the grandstand and flick her wand, igniting Snape's cloak. Professors extinguish the flames, knocking Quirrell down, and Harry's broom calms. Quirrell and Snape douse the fire, watching Harry control his Nimbus 2000. He zooms after the Slytherin seeker near the Snitch. They fly side by side as the Slytherin bumps Harry, but he circles back, the Slytherin barging again. The Snitch veers, heading to the ground, and the Slytherin pulls back. Harry stands on his broom, reaching for the Snitch, somersaulting onto the grass. He rises, clutching his stomach. Hagrid watches as Harry spits out the Snitch. Madam Hooch announces the winner, and Gryffindors cheer, with Hagrid and Hermione celebrating loudly. Dumbledore and McGonagall applaud, while Snape remains expressionless. In his scarlet and gold cloak, Harry beams with pride. As teammates celebrate, he holds the Golden Snitch aloft, displaying it to ecstatic supporters."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Professors stand as a Slytherin chaser throws the Quaffle and scores. Harry, high above, anxiously watches the game. The Golden Snitch appears, and Harry chases it, dodging Bludgers. His broom goes wild, shaking him. Hermione notices Snape muttering and alerts Ron. Harry clings to his broom with one hand as Malfoy cheers. Hermione reaches Snape, igniting his cloak with her wand, and the professors extinguish the flames, calming Harry's broom. Harry regains control and speeds after the Slytherin seeker near the Snitch. They fly closely, with the Slytherin ramming Harry. The Snitch descends, and the Slytherin pulls up, but Harry continues, catching the Snitch as he tumbles onto the grass. Hagrid sees Harry spit out the Snitch. Madam Hooch declares Gryffindor's victory, and the team celebrates. Dumbledore and McGonagall applaud, while Snape remains stoic. Proudly, Harry displays the Snitch to his jubilant fans."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As the dramatic scene unfolds, the esteemed professors rise to their feet in unison, their eyes fixed on the spectacle before them, as a determined Slytherin chaser confidently tosses the Quaffle high into the air and expertly maneuvers it through the goal while balancing on his broomstick. Hovering at a lofty height above the lively pitch, Harry watches the game with a growing sense of anxious anticipation. Without warning, the elusive Golden Snitch suddenly swoops past in a blur of gold, prompting Harry to speed after it with zealous determination, deftly dodging the intimidating Bludgers that are viciously aimed at his head. His trusty broomstick, however, betrays him, as it careens out of control, violently shaking Harry from side to side and spinning him over and over in a perilous dance. Through her binoculars, Hermione keenly observes Snape sitting in the professors' grand stand, his lips unmistakably moving, and she quickly hands her binoculars over to Ron. Desperately clinging to the wildly bucking broomstick, Harry is nearly spun off, but he miraculously manages to grab hold of the handle, hanging precariously underneath with only one hand, as Malfoy and his cronies cheer with unbridled enthusiasm. Meanwhile, Snape continues his muttering incantations as Harry struggles to secure both hands on the broomstick, which swings him mercilessly backward and forward, as if trying to shake him off. Ron peers through the binoculars just as Hermione reaches the professors' grand stand and hastily races up the stairs, where Snape is still lost in his muttering. She discreetly pulls out her wand and, crawling surreptitiously beneath the seats, gives it a deft flick, smiling with satisfaction as a small flame appears and Snape's cloak begins to burn. The attentive professors quickly beat out the flames, inadvertently knocking Quirrell off his feet in the process, and Harry's broomstick miraculously calms down. Quirrell and Snape efficiently extinguish the fire and watch in awe as Harry regains steady control of the Nimbus 2000. Once secure again, he swiftly climbs onto the broomstick and speeds off towards the Slytherin seeker, who is trailing close behind the elusive Snitch. The two seekers fly shoulder to shoulder, with the cunning Slytherin brazenly barging Harry, trying to push him out of the way, but Harry cleverly circles around and comes back, undeterred, with the Slytherin bully again attempting to barge him aside. The Snitch erratically flips from tower to tower, suddenly altering its course and heading straight down towards the ground. Both determined seekers follow in hot pursuit, but the cowardly Slytherin bails out at the very last moment as they both plummet headfirst. The Snitch levels out, skimming low along the ground, and with a daring move, Harry stands precariously on his broomstick, stretching out his hand to grasp the Snitch. He takes a precarious step forward, causing the broom to tip dramatically upward, sending him somersaulting over onto the grass. He quickly scrambles up, clutching his stomach with both hands as his friends watch on with growing concern. Hagrid, ever-watchful, peers through the binoculars as Harry triumphantly spits out the Snitch. As Madam Hooch declares the winner, the euphoric Gryffindors leap into the air with unrestrained joy, with the giant Hagrid joyously punching the air in victory, and Hermione shrieking with excitement at the top of her voice. Dumbledore and Professor McGonagall show their admiration, applauding enthusiastically, while Snape remains seated, his expression inscrutable. Standing proudly in the very center of the arena, adorned in his scarlet and gold cloak, Harry beams with a mix of pride and pleasure. As his jubilant teammates swoop around the arena on their broomsticks, rejoicing in their glorious success, Harry holds the fluttering Golden Snitch aloft in triumph above his head and slowly turns, showcasing his hard-won prize to his ecstatic supporters."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As the intense and dramatic scene unfolds before everyone present, the esteemed and distinguished professors all rise to their feet in perfect unison, their eyes riveted on the captivating spectacle unfolding before them. Their gaze is fixed and unwavering on the determined Slytherin chaser, who, with great confidence and precision, tosses the Quaffle high into the air. With expert maneuvering, he deftly directs it through the goal while maintaining balance on his broomstick. High above the lively, bustling pitch, hovering at a dizzying height, Harry watches the game unfold with a growing sense of anxious anticipation coursing through him. Without any warning, the elusive Golden Snitch suddenly races past in a blur of shimmering gold, prompting Harry to speed after it with zealous determination. He deftly dodges the intimidating Bludgers that are viciously aimed at his head. His trusty broomstick, however, betrays him in this critical moment, as it careens wildly out of control, violently shaking Harry from side to side. It spins him over and over in a perilous dance. Through her binoculars, Hermione keenly observes Snape sitting in the professors' grand stand, noticing his lips moving unmistakably, and she quickly hands her binoculars over to Ron. Desperately clinging to the wildly bucking broomstick, Harry is on the verge of being spun off, but he miraculously manages to grab hold of the handle, hanging precariously underneath with only one hand, while Malfoy and his cronies cheer with unbridled enthusiasm. Meanwhile, Snape continues his muttering incantations, as Harry struggles to secure both his hands on the broomstick, which swings him mercilessly backward and forward, as if trying with all its might to shake him off. Ron peers through the binoculars just as Hermione reaches the professors' grand stand. She hastily races up the stairs to where Snape is still lost in his muttering. In a discreet manner, she pulls out her wand and, crawling surreptitiously beneath the seats, gives it a deft flick, smiling with satisfaction as a small flame appears, causing Snape's cloak to begin to burn. The attentive professors quickly react, beating out the flames and inadvertently knocking Quirrell off his feet in the process. Miraculously, Harry's broomstick calms down. Quirrell and Snape efficiently extinguish the fire and watch in awe as Harry regains steady control of the Nimbus 2000. Once secure again, he swiftly climbs back onto the broomstick and speeds off toward the Slytherin seeker, who is trailing closely behind the elusive Snitch. The two seekers fly shoulder to shoulder, with the cunning Slytherin brazenly barging into Harry, trying to push him out of the way. Harry cleverly circles around and returns, undeterred, with the Slytherin bully once again attempting to barge him aside. The Snitch erratically flips from tower to tower, suddenly altering its course and heading straight down towards the ground. Both determined seekers follow in hot pursuit, but the cowardly Slytherin bails out at the very last moment as they plummet headfirst. The Snitch levels out, skimming low along the ground, and with a daring move, Harry precariously stands on his broomstick, stretching out his hand to grasp the Snitch. He takes a precarious step forward, causing the broom to tip dramatically upward, sending him somersaulting over onto the grass. He quickly scrambles up, clutching his stomach with both hands as his friends watch on with growing concern. Hagrid, ever-watchful and vigilant, peers through the binoculars as Harry triumphantly spits out the Snitch. As Madam Hooch declares the winner, the euphoric Gryffindors leap into the air with unrestrained joy, with the giant Hagrid joyously punching the air in victory, and Hermione shrieking with excitement at the top of her voice. Dumbledore and Professor McGonagall show their admiration by applauding enthusiastically, while Snape remains seated, his expression inscrutable. Standing proudly in the very center of the arena, adorned in his scarlet and gold cloak, Harry beams with a mix of pride and pleasure. As his jubilant teammates swoop around the arena on their broomsticks, rejoicing in their glorious success, Harry holds the fluttering Golden Snitch aloft in triumph above his head and slowly turns, showcasing his hard-won prize to his ecstatic and cheering supporters."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The professors rise to their feet, watching intently as a Slytherin chaser skillfully tosses the Quaffle into the air before expertly guiding it through the goal using his broomstick. High above the pitch, Harry hovers with nervous anticipation, his eyes following the game's progress. Suddenly, his focus shifts as the Golden Snitch bursts into view, swooping past him in a blur of gold. Without hesitation, Harry accelerates in pursuit, weaving and dodging the relentless Bludgers aimed for his head with precision. In an unexpected turn of events, his broomstick shudders violently, pulling him from side to side and spinning him uncontrollably. From the stands, Hermione peers through her binoculars, spotting Snape among the professors with his lips moving suspiciously. She passes the binoculars to Ron, allowing him to see as she does. Meanwhile, Harry clings tightly to the wildly bucking broomstick, his grip slipping until he finds himself hanging underneath the broom, holding on with just one hand as Malfoy and his companions cheer with malicious delight. Despite the chaos, Snape continues his muttering, seemingly unfazed. Harry manages to grasp the broomstick with both hands, attempting to steady himself as it swings him back and forth in a desperate attempt to unseat him. Ron views the scene through the binoculars, anxious for his friend, as Hermione makes her way up the stairs of the professors' stand where Snape is still quietly chanting. Hermione crawls beneath the seats, swiftly pulling out her wand and with a deft flick, conjures a small flame that sets Snape's cloak alight, prompting a satisfied smile from her. The professors react quickly, beating out the flames amidst the commotion, inadvertently knocking Quirrell off balance. Almost instantaneously, Harry's broomstick stabilizes, allowing him to regain control of his Nimbus 2000. With determination, he climbs back onto the broom and zooms towards the Slytherin seeker, who is rapidly gaining on the Snitch. The two seekers fly side by side, the Slytherin attempting to barge Harry out of his path, but Harry deftly maneuvers around, coming back into position as the Slytherin attempts another shove. The Snitch darts unpredictably from tower to tower, changing course abruptly and heading toward the ground. The seekers follow in a steep dive, but the Slytherin pulls away at the last moment, leaving Harry to plummet headfirst toward the Snitch, which skims low along the grass. In a daring move, Harry stands on his broomstick, reaching out with one hand to grasp the elusive Snitch. He takes a step forward, causing the broom to tip, and somersaults onto the grass. Quickly recovering, he scrambles to his feet, clutching his stomach as his friends watch anxiously, their concern evident. Hagrid peers through the binoculars, witnessing Harry spit out the Snitch triumphantly. As Madam Hooch announces the winner, euphoria erupts among the Gryffindors, who leap into the air with joy. Giant Hagrid punches the sky in victory, Hermione shrieks with excitement, and Dumbledore along with Professor McGonagall clap enthusiastically, while Snape remains seated, his face a mask of indifference. Standing proudly in his scarlet and gold cloak, Harry beams with satisfaction and joy. As his teammates soar around the arena on their broomsticks, celebrating their triumph, Harry holds the fluttering Golden Snitch high above his head, slowly turning to showcase his achievement to his cheering supporters."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The professors rise as a Slytherin chaser scores with the Quaffle. Overhead, Harry watches anxiously until the Golden Snitch appears, prompting him to chase it while avoiding Bludgers. His broomstick spins out of control, nearly throwing him off, but he manages to cling on. Hermione spots Snape muttering in the stands, hands Ron the binoculars, and hurries to him. She discretely sets Snape's cloak on fire, causing the professors to extinguish the flames, accidentally knocking Quirrell over. Harry's broom stabilizes, allowing him to regain control and resume the chase. He joins the Slytherin seeker in pursuit of the Snitch, enduring aggressive jostling. As the Snitch dives, both seekers follow, but the Slytherin withdrawals, leaving Harry to continue the pursuit. The Snitch levels out close to the ground, and Harry precariously reaches for it, ultimately somersaulting onto the grass. Rising with a grin, he spits out the Snitch as his friends express their concern and relief. Madam Hooch announces the winner, prompting Gryffindor's jubilant celebration, with Hagrid punching the air and Hermione cheering loudly. Dumbledore and Professor McGonagall applaud, while Snape remains aloof. In the arena, Harry stands proudly, displaying the Snitch triumphantly to his ecstatic supporters as his teammates celebrate by swooping around on their broomsticks."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The professors rise to their feet as a Slytherin chaser, representing one of the four houses at Hogwarts School of Witchcraft and Wizardry, tosses the Quaffle into the air and fixes it through the goal with his broomstick, a Nimbus 2001 known for its speed and agility. Hovering high above the pitch used for Quidditch matches, a popular wizarding sport, Harry follows the game anxiously. Suddenly, the Golden Snitch, a small, winged ball that ends the game when caught, swoops past, and Harry speeds after it, dodging the Bludgers, enchanted iron balls meant to knock players off their brooms, aimed for his head. His broomstick, the renowned Nimbus 2000, goes out of control, shaking him violently from side to side and spinning him over and over. Through her binoculars enchanted for superior vision, Hermione spots Snape in the professors' grand stand with his lips moving, known for his expertise in Potions and his role as head of Slytherin House, and she gives her binoculars to Ron. Harry clings desperately to the bucking broomstick, which spins him off, but he manages to grab the handle and hang underneath, holding on with only one hand as Malfoy and his cronies, notorious for their Slytherin allegiance, cheer. Snape is still muttering to himself, which Hermione suspects to be a spell, as Harry grabs the broomstick with both hands, which swings him backward and forward, trying to shake him off. Ron watches through the binoculars as Hermione reaches the professors' grand stand and races up the stairs, where Snape continues muttering. She pulls out her wand, crafted from vine wood and housing a dragon heartstring core, and, crawling beneath the seats, gives it a flick, smiling as a flame appears and Snape's cloak starts to burn subtly. The professors, startled by the sudden flames, beat out the fire, knocking Quirrell, the Defense Against the Dark Arts teacher, off his feet, and Harry's broomstick suddenly calms down. Quirrell and Snape put out the fire and watch as Harry manages to regain control of the Nimbus 2000. He climbs onto the broomstick and zooms off to the Slytherin seeker, who is close behind the Snitch, crucial in determining the victor of the match. They fly shoulder to shoulder as the crafty Slytherin barges Harry, trying to knock him out of the way, but Harry circles round and then comes back, with the Slytherin bully barging him again. The Snitch flips from tower to tower, suddenly changing its course and heading straight for the ground. The two seekers follow, but the cowardly Slytherin, intimidated by the impending collision with the field, pulls out at the last moment as they plummet headfirst. The Snitch levels out, skimming low along the ground, and standing precariously on the broomstick, Harry stretches out his hand to catch the Snitch. He takes a step forward, and the broom tips up, sending him somersaulting over onto the grass. He scrambles up, clutching his stomach with both hands as his friends watch with concern. Hagrid, the half-giant groundskeeper known for his warm heart, peers through the binoculars as Harry spits out the Snitch. As Madam Hooch, the flying instructor and Quidditch referee, declares the winner, the Gryffindors leap for joy, with giant Hagrid punching the air victoriously and Hermione shrieking at the top of her voice. Dumbledore, the esteemed headmaster known for his wisdom, and Professor McGonagall, the head of Gryffindor House, applaud enthusiastically, while Snape remains in his seat, expressionless. Standing in the middle of the arena in his scarlet and gold cloak, symbolizing Gryffindor's colors, Harry beams with pride and pleasure. As his teammates swoop around the arena on their broomsticks, celebrating their success, Harry holds the fluttering Golden Snitch triumphantly above his head and slowly turns, displaying his prize to his ecstatic supporters."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The two seekers follow but the cowardly Slytherin pulls out at the last moment as they plummet headfirst Ron watches through the binoculars as Hermione reaches the professors' grand stand and races up the stairs where Snape continues muttering The professors rise to their feet as a Slytherin chaser tosses the Quaffle into the air and fixes it through the goal with his broomstick Hovering high above the pitch Harry follows the game anxiously Suddenly the Golden Snitch swoops past and Harry speeds after it dodging the Bludgers aimed for his head His broomstick goes out of control shaking him violently from side to side and spinning him over and over Through her binoculars Hermione spots Snape in the professors' grand stand with his lips moving and she gives her binoculars to Ron Harry clings desperately to the bucking broomstick which spins him off but he manages to grab the handle and hang underneath holding on with only one hand as Malfoy and his cronies cheer As Madam Hooch declares the winner the Gryffindors leap for joy with giant Hagrid punching the air victoriously and Hermione shrieking at the top of her voice His broomstick goes out of control shaking him violently from side to side and spinning him over and over Hovering high above the pitch Harry follows the game anxiously Snape is still muttering to himself as Harry grabs the broomstick with both hands which swings him backward and forward trying to shake him off Ron watches through the binoculars as Hermione reaches the professors' grand stand and races up the stairs where Snape continues muttering She pulls out her wand and crawling beneath the seats gives it a flick smiling as a flame appears and Snape's cloak starts to burn Through her binoculars Hermione spots Snape in the professors' grand stand with his lips moving and she gives her binoculars to Ron The professors beat out the flames knocking Quirrell off his feet and Harry's broomstick suddenly calms down Suddenly the Golden Snitch swoops past and Harry speeds after it dodging the Bludgers aimed for his head Quirrell and Snape put out the fire and watch as Harry manages to regain control of the Nimbus 2000 He climbs onto the broomstick and zooms off to the Slytherin seeker who is close behind the Snitch Standing in the middle of the arena in his scarlet and gold cloak Harry beams with pride and pleasure They fly shoulder to shoulder as the crafty Slytherin barges Harry trying to knock him out of the way but Harry circles round and then comes back with the Slytherin bully barging him again The Snitch flips from tower to tower suddenly changing its course and heading straight for the ground Harry holds the fluttering Golden Snitch triumphantly above his head and slowly turns displaying his prize to his ecstatic supporters The professors rise to their feet as a Slytherin chaser tosses the Quaffle into the air and fixes it through the goal with his broomstick The two seekers follow but the cowardly Slytherin pulls out at the last moment as they plummet headfirst The Snitch levels out skimming low along the ground and standing precariously on the broomstick She pulls out her wand and crawling beneath the seats gives it a flick smiling as a flame appears and Snape's cloak starts to burn Harry stretches out his hand to catch the Snitch He takes a step forward and the broom tips up sending him somersaulting over onto the grass He scrambles up clutching his stomach with both hands as his friends watch with concern As his teammates swoop around the arena on their broomsticks celebrating their success The Snitch flips from tower to tower suddenly changing its course and heading straight for the ground Hagrid peers through the binoculars as Harry spits out the Snitch As Madam Hooch declares the winner the Gryffindors leap for joy with giant Hagrid punching the air victoriously and Hermione shrieking at the top of her voice Dumbledore and Professor McGonagall applaud enthusiastically while Snape remains in his seat expressionless Standing in the middle of the arena in his scarlet and gold cloak Harry beams with pride and pleasure As his teammates swoop around the arena on their broomsticks celebrating their success Harry holds the fluttering Golden Snitch triumphantly above his head and slowly turns displaying his prize to his ecstatic supporters"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The professors rise to their feet as a Slytherin chaser tosses the Quaffle into the air and fixes it through the goal with his broomstick. Hovering high above the pitch Harry follows the game anxiously. Suddenly the Golden Snitch swoops past and Harry speeds after it dodging the Bludgers aimed for his head. His broomstick goes out of control shaking him violently from side to side and spinning him over and over. Through her binoculars Hermione spots Snape in the professors' grand stand with his lips moving and she gives her binoculars to Ron. Harry clings desperately to the bucking broomstick which spins him off but he manages to grab the handle and hang underneath holding on with only one hand as Malfoy and his cronies cheer. Snape is still muttering to himself as Harry grabs the broomstick with both hands which swings him backward and forward trying to shake him off. Ron watches through the binoculars as Hermione reaches the professors' grand stand and races up the stairs where Snape continues muttering. She pulls out her wand and crawling beneath the seats gives it a flick smiling as a flame appears and Snape's cloak starts to burn. The professors beat out the flames knocking Quirrell off his feet and Harry's broomstick suddenly calms down. Quirrell and Snape put out the fire and watch as Harry manages to regain control of the Nimbus 2000. He climbs onto the broomstick and zooms off to the Slytherin seeker who is close behind the Snitch. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. They fly shoulder to shoulder as the crafty Slytherin barges Harry trying to knock him out of the way but Harry circles round and then comes back with the Slytherin bully barging him again. The Snitch flips from tower to tower suddenly changing its course and heading straight for the ground. The two seekers follow but the cowardly Slytherin pulls out at the last moment as they plummet headfirst. The Snitch levels out skimming low along the ground and standing precariously on the broomstick. Harry stretches out his hand to catch the Snitch. He takes a step forward and the broom tips up sending him somersaulting over onto the grass. He scrambles up clutching his stomach with both hands as his friends watch with concern. Hagrid peers through the binoculars as Harry spits out the Snitch. As Madam Hooch declares the winner the Gryffindors leap for joy with giant Hagrid punching the air victoriously and Hermione shrieking at the top of her voice. Dumbledore and Professor McGonagall applaud enthusiastically while Snape remains in his seat expressionless. Standing in the middle of the arena in his scarlet and gold cloak Harry beams with pride and pleasure. As his teammates swoop around the arena on their broomsticks celebrating their success. Harry holds the fluttering Golden Snitch triumphantly above his head and slowly turns displaying his prize to his ecstatic supporters."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The professors rise to their feet as a Slytherin chaser tosses the Quaffle into the air and fixes it through the goal with his broomstick. Hovering high above the pitch Harry follows the game anxiously. Suddenly the Golden Snitch swoops past and Harry speeds after it dodging the Bludgers aimed for his head. His broomstick goes out of control shaking him violently from side to side and spinning him over and over. Through her binoculars Hermione spots Snape in the professors' grand stand with his lips moving and she gives her binoculars to Ron. Harry clings desperately to the bucking broomstick which spins him off but he manages to grab the handle and hang underneath holding on with only one hand as Malfoy and his cronies cheer. Snape is still muttering to himself as Harry grabs the broomstick with both hands which swings him backward and forward trying to shake him off. Ron watches through the binoculars as Hermione reaches the professors' grand stand and races up the stairs where Snape continues muttering. She pulls out her wand and crawling beneath the seats gives it a flick smiling as a flame appears and Snape's cloak starts to burn. The professors beat out the flames knocking Quirrell off his feet and Harry's broomstick suddenly calms down. Quirrell and Snape put out the fire and watch as Harry manages to regain control of the Nimbus 2000. He climbs onto the broomstick and zooms off to the Slytherin seeker who is close behind the Snitch. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. They fly shoulder to shoulder as the crafty Slytherin barges Harry trying to knock him out of the way but Harry circles round and then comes back with the Slytherin bully barging him again. The Snitch flips from tower to tower suddenly changing its course and heading straight for the ground. The two seekers follow but the cowardly Slytherin pulls out at the last moment as they plummet headfirst. The Snitch levels out skimming low along the ground and standing precariously on the broomstick. Harry stretches out his hand to catch the Snitch. He takes a step forward and the broom tips up sending him somersaulting over onto the grass. He scrambles up clutching his stomach with both hands as his friends watch with concern. Hagrid peers through the binoculars as Harry spits out the Snitch. As Madam Hooch declares the winner the Gryffindors leap for joy with giant Hagrid punching the air victoriously and Hermione shrieking at the top of her voice. Dumbledore and Professor McGonagall applaud enthusiastically while Snape remains in his seat expressionless. Standing in the middle of the arena in his scarlet and gold cloak Harry beams with pride and pleasure. As his teammates swoop around the arena on their broomsticks celebrating their success. Harry holds the fluttering Golden Snitch triumphantly above his head and slowly turns displaying his prize to his ecstatic supporters."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The professors rise to their feet as a Slytherin chaser tosses the Quaffle into the air and fixes it through the goal with his broomstick. Hovering high above the pitch Harry follows the game anxiously. Suddenly the Golden Snitch swoops past and Harry speeds after it dodging the Bludgers aimed for his head. His broomstick goes out of control shaking him violently from side to side and spinning him over and over. Through her binoculars Hermione spots Snape in the professors' grand stand with his lips moving and she gives her binoculars to Ron. Harry clings desperately to the bucking broomstick which spins him off but he manages to grab the handle and hang underneath holding on with only one hand as Malfoy and his cronies cheer. He scrambles up clutching his stomach with both hands as his friends watch with concern. Hagrid peers through the binoculars as Harry spits out the Snitch. As Madam Hooch declares the winner the Gryffindors leap for joy with giant Hagrid punching the air victoriously and Hermione shrieking at the top of her voice. Dumbledore and Professor McGonagall applaud enthusiastically while Snape remains in his seat expressionless. Standing in the middle of the arena in his scarlet and gold cloak Harry beams with pride and pleasure. As his teammates swoop around the arena on their broomsticks celebrating their success. Harry holds the fluttering Golden Snitch triumphantly above his head and slowly turns displaying his prize to his ecstatic supporters."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The professors rise to their feet as a Slytherin chaser tosses the Quaffle into the air and fixes it through the goal with his broomstick. Hovering high above the pitch Harry follows the game anxiously. Standing in the middle of the arena in his scarlet and gold cloak Harry beams with pride and pleasure. As his teammates swoop around the arena on their broomsticks celebrating their success. Harry holds the fluttering Golden Snitch triumphantly above his head and slowly turns displaying his prize to his ecstatic supporters."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The giraffes rise to their feet as a dragonfly chaser tosses the Quaffle into the air and fixes it through the goal with her broomstick. Hovering high above the pitch, Luna follows the game anxiously. Suddenly, the Golden Snitch swoops past, and Luna speeds after it, dodging the Bludgers aimed for her head. Her broomstick goes out of control, shaking her violently from side to side and spinning her over and over. Through her binoculars, Draco spots Lupin in the giraffes' grand stand with his lips moving, and he gives his binoculars to Neville. Luna clings desperately to the bucking broomstick, which spins her off, but she manages to grab the handle and hang underneath, holding on with only one hand as Filch and his cronies cheer. Lupin is still muttering to himself as Luna grabs the broomstick with both hands, which swings her backward and forward, trying to shake her off. Neville watches through the binoculars as Draco reaches the giraffes' grand stand and races up the stairs, where Lupin continues muttering. He pulls out his wand and, crawling beneath the seats, gives it a flick, smiling as a flame appears and Lupin's cloak starts to burn. The giraffes beat out the flames, knocking Hoot off his feet, and Luna's broomstick suddenly calms down. Hoot and Lupin put out the fire and watch as Luna manages to regain control of the Nimbus 2000. She climbs onto the broomstick and zooms off to the dragonfly seeker, who is close behind the Snitch. They fly shoulder to shoulder as the crafty dragonfly barges Luna, trying to knock her out of the way, but Luna circles round and then comes back, with the dragonfly bully barging her again. The Snitch flips from tower to tower, suddenly changing its course and heading straight for the ground. The two seekers follow, but the cowardly dragonfly pulls out at the last moment as they plummet headfirst. The Snitch levels out, skimming low along the ground, and standing precariously on the broomstick, Luna stretches out her hand to catch the Snitch. She takes a step forward, and the broom tips up, sending her somersaulting over onto the grass. She scrambles up, clutching her stomach with both hands as her friends watch with concern. Buckbeak peers through the binoculars as Luna spits out the Snitch. As Madam Pomfrey declares the winner, the Ravenclaws leap for joy, with giant Buckbeak punching the air victoriously and Draco shrieking at the top of his voice. Trelawney and Professor Sprout applaud enthusiastically, while Lupin remains in his seat, expressionless. Standing in the middle of the arena in her scarlet and gold cloak, Luna beams with pride and pleasure. As her teammates swoop around the arena on their broomsticks, celebrating their success, Luna holds the fluttering Golden Snitch triumphantly above her head and slowly turns, displaying her prize to her ecstatic supporters."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The professors rise to their feet as a Slytherin forward tosses the basketball into the air and shoots it through the hoop with his skateboard. Hovering high above the court, Harry follows the game anxiously. Suddenly, the Silver Medal swoops past, and Harry speeds after it, dodging the tennis balls aimed for his head. His skateboard goes out of control, shaking him violently from side to side and spinning him over and over. Through her binoculars, Hermione spots Snape in the professors' pavilion with his lips moving, and she gives her binoculars to Ron. Harry clings desperately to the bucking skateboard, which spins him off, but he manages to grab the handle and hang underneath, holding on with only one hand as Malfoy and his cronies cheer. Snape is still muttering to himself as Harry grabs the skateboard with both hands, which swings him backward and forward, trying to shake him off. Ron watches through the binoculars as Hermione reaches the professors' pavilion and races up the stairs, where Snape continues muttering. She pulls out her wand and, crawling beneath the seats, gives it a flick, smiling as a flame appears and Snape's jacket starts to burn. The professors beat out the flames, knocking Quirrell off his feet, and Harry's skateboard suddenly calms down. Quirrell and Snape put out the fire and watch as Harry manages to regain control of the Lightning 2000. He climbs onto the skateboard and zooms off to the Slytherin runner, who is close behind the Medal. They fly shoulder to shoulder as the crafty Slytherin barges Harry, trying to knock him out of the way, but Harry circles round and then comes back, with the Slytherin bully barging him again. The Medal flips from tower to tower, suddenly changing its course and heading straight for the ground. The two runners follow, but the cowardly Slytherin pulls out at the last moment as they plummet headfirst. The Medal levels out, skimming low along the ground, and standing precariously on the skateboard, Harry stretches out his hand to catch the Medal. He takes a step forward, and the skateboard tips up, sending him somersaulting over onto the sand. He scrambles up, clutching his stomach with both hands as his friends watch with concern. Hagrid peers through the binoculars as Harry spits out the Medal. As Madam Hooch declares the winner, the Gryffindors leap for joy, with giant Hagrid punching the air victoriously and Hermione shrieking at the top of her voice. Dumbledore and Professor McGonagall applaud enthusiastically, while Snape remains in his seat, expressionless. Standing in the middle of the amphitheater in his crimson and yellow jacket, Harry beams with pride and pleasure. As his teammates swoop around the amphitheater on their skateboards, celebrating their success, Harry holds the fluttering Silver Medal triumphantly above his head and slowly turns, displaying his prize to his ecstatic supporters."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The professors leap to their feet as a Slytherin chaser flings the Quaffle into the air and slides it through the goal with his broomstick. Floating high above the pitch, Harry observes the game nervously. Suddenly, the Golden Snitch darts past, and Harry soars after it, weaving past the Bludgers aimed for his chest. His broomstick spins out of control, swinging him erratically from side to side and twirling him endlessly. Through her binoculars, Hermione identifies Snape in the professors' grand stand with his lips twitching, and she passes her binoculars to Ron. Harry grasps desperately at the bucking broomstick, which twists him off, but he succeeds in clutching the handle and dangles beneath, gripping with only one hand as Malfoy and his cronies jeer. Snape is still murmuring to himself as Harry clutches the broomstick with both hands, which dangles him backward and forward, attempting to unseat him. Ron observes through the binoculars as Hermione reaches the professors' grand stand and dashes up the stairs, where Snape continues murmuring. She pulls out her wand and, crouching beneath the seats, gives it a flick, grinning as a flame erupts and Snape's cloak catches fire. The professors extinguish the flames, sending Quirrell reeling off his feet, and Harry’s broomstick suddenly steadies. Quirrell and Snape extinguish the fire and watch as Harry manages to master the Nimbus 2000. He mounts the broomstick and darts off to the Slytherin seeker, who is trailing behind the Snitch. They glide side by side as the crafty Slytherin elbows Harry, attempting to nudge him aside, but Harry loops around and then returns, with the Slytherin bully elbowing him again. The Snitch bounces from tower to tower, abruptly shifting its path and diving straight for the ground. The two seekers pursue, but the cowardly Slytherin veers off at the last moment as they descend headfirst. The Snitch glides along, skimming close to the ground, and balancing precariously on the broomstick, Harry stretches out his hand to grasp the Snitch. He takes a leap forward, and the broom tilts up, sending him tumbling over onto the grass. He scrambles up, clutching his stomach with both hands as his friends watch with concern. Hagrid gazes through the binoculars as Harry coughs up the Snitch. As Madam Hooch announces the winner, the Gryffindors bounce for joy, with giant Hagrid waving his arms victoriously and Hermione shouting at the top of her voice. Dumbledore and Professor McGonagall applaud energetically, while Snape remains in his seat, impassive. Standing in the middle of the arena in his scarlet and gold cloak, Harry grins with pride and satisfaction. As his teammates glide around the arena on their broomsticks, rejoicing in their triumph, Harry holds the fluttering Golden Snitch triumphantly above his head and slowly revolves, showcasing his prize to his ecstatic supporters."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The lanterns rise to their feet as a Ravenclaw acrobat flings the tomato into the air and fixes it through the loop with his skateboard. Hovering high above the meadow, Jacob follows the concert anxiously. Suddenly, the Silver Beetle swoops past, and Jacob speeds after it, dodging the balloons aimed for his elbow. His skateboard goes out of control, shaking him violently from side to side and spinning him over and over. Through her telescope, Violet spots Frosty in the lanterns' sunflower patch with his lips moving, and she gives her telescope to Sam. Jacob clings desperately to the thrashing skateboard, which spins him off, but he manages to grab the handle and hang underneath, holding on with only one hand as Rex and his buddies cheer. Frosty is still muttering to himself as Jacob grabs the skateboard with both hands, which swings him backward and forward, trying to shake him off. Sam watches through the telescope as Violet reaches the lanterns' sunflower patch and races up the ladder, where Frosty continues muttering. She pulls out her wand and, crawling beneath the mushrooms, gives it a flick, smiling as a flame appears and Frosty’s shirt starts to burn. The lanterns beat out the flames, knocking Bob off his feet, and Jacob’s skateboard suddenly calms down. Bob and Frosty put out the fire and watch as Jacob manages to regain control of the Nimbus 3000. He climbs onto the skateboard and zooms off to the Ravenclaw sprinter, who is close behind the Beetle. They fly shoulder to shoulder as the crafty Ravenclaw nudges Jacob, trying to knock him out of the way, but Jacob circles round and then comes back, with the Ravenclaw pest nudging him again. The Beetle flips from boat to boat, suddenly changing its course and heading straight for the lake. The two sprinters follow, but the cowardly Ravenclaw pulls out at the last moment as they plummet headfirst. The Beetle levels out, skimming low along the lake, and standing precariously on the skateboard, Jacob stretches out his hand to catch the Beetle. He takes a step forward, and the skateboard tips up, sending him somersaulting over onto the sand. He scrambles up, clutching his knee with both hands as his flowers watch with concern. Yoda peers through the telescope as Jacob spits out the Beetle. As Lady Rose declares the winner, the Hufflepuffs leap for joy, with giant Yoda punching the air victoriously and Violet shrieking at the top of her voice. Gandalf and Lady Galadriel applaud enthusiastically, while Frosty remains in his seat, expressionless. Standing in the middle of the waterfall in his purple and silver shirt, Jacob beams with pride and pleasure. As his teammates swoop around the waterfall on their skateboards, celebrating their success, Jacob holds the fluttering Silver Beetle triumphantly above his head and slowly turns, displaying his prize to his ecstatic supporters."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The astronauts float into the air as a Gryffindor beater flings the Bludger into the clouds and slides it through the ring with his skateboard. Swimming far from the arena, Draco monitors the match excitedly. Instantly, the Silver Goblet dives past, and Draco glides toward it, weaving around the Quaffles thrown at his knees. His skateboard loses stability, whirling him softly up and down and twirling him round and round. Through her kaleidoscope, Luna catches sight of Filch in the students' side stand with his knees trembling, and she passes her kaleidoscope to Neville. Draco grips fiercely onto the shaking skateboard, which flips him off, yet he manages to catch the edge and dangle beneath, holding on with just one foot as Crabbe and his crew laugh. Filch is still trembling to himself as Draco snatches the skateboard with both feet, which swings him outward and inward, attempting to jostle him off. Neville observes through the kaleidoscope as Luna arrives at the students' side stand and tiptoes down the stairs, where Filch continues trembling. She draws out her book and, hopping over the seats, gives it a flip, giggling as a light erupts and Filch's hat begins to spark. The students extinguish the sparks, pushing Sprout from her seat, and Draco's skateboard abruptly stabilizes. Sprout and Filch douse the flare and see as Draco manages to take charge of the Nimbus 2001. He leaps onto the skateboard and dashes ahead to the Gryffindor keeper, who is trailing closely behind the Goblet. They soar elbow to elbow as the cunning Gryffindor nudges Draco, attempting to push him out of the path, but Draco twirls around and then pushes back, with the Gryffindor player nudging him once more. The Goblet darts from castle to castle, abruptly altering its direction and soaring directly toward the sky. The two keepers trail, but the timid Gryffindor retreats at the last minute as they dive skyward. The Goblet evens out, skimming high along the clouds, and balancing delicately on the skateboard, Draco reaches out his foot to snag the Goblet. He leaps a step onward, and the skateboard tips down, hurling him flipping over onto the clouds. He tumbles up, clutching his heart with both feet as his foes watch with interest. Dobby squints through the kaleidoscope as Draco spits out the Goblet. As Madam Pomfrey announces the winner, the Ravenclaws skip for joy, with massive Dobby waving the sky triumphantly and Luna singing at the peak of her voice. Flitwick and Professor Sprout cheer energetically, while Filch stays in his seat, indifferent. Standing before the crowd in his black and white robe, Draco grins with joy and satisfaction. As his competitors drift around the clouds on their skateboards, enjoying their victory, Draco holds the shimmering Silver Goblet proudly above his nose and swiftly spins, revealing his trophy to his thrilled admirers."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The professors jump into the air as a Slytherin chaser flips the Bludger into the clouds and balances it through the net with his paintbrush. Floating low beneath the water, Harry observes the match nervously. Suddenly, the Silver Beetle zooms by, and Harry dances after it, weaving around the Quaffles aimed for his knees. His paintbrush tumbles out of balance, swinging him gently from left to right and looping him up and down. Through her telescope, Hermione notices Snape in the professors' box with his nose twitching, and she passes her telescope to Ron. Harry swings cautiously on the rolling paintbrush, which tosses him up, but he manages to clutch the brim and dangle above, holding on with only one arm as Malfoy and his followers laugh. Snape is still mumbling to himself as Harry seizes the paintbrush with both arms, which twists him sideways and backward, attempting to nudge him off. Ron peers through the telescope as Hermione reaches the professors' box and slides down the steps, where Snape continues mumbling. She retrieves her stick and, sneaking between the chairs, gives it a wave, grinning as a bubble appears and Snape's robe starts to shrink. The professors stomp out the bubbles, bumping Quirrell off his shoes, and Harry's paintbrush suddenly straightens up. Quirrell and Snape dispel the bubble and gaze as Harry manages to regain balance on the Nimbus 2000. He crawls onto the paintbrush and drifts toward the Slytherin seeker, who trails behind the Beetle. They glide elbow to elbow as the sneaky Slytherin nudges Harry, attempting to trip him off the trail, but Harry spins around and then returns, with the Slytherin teaser pushing him again. The Beetle flits from branch to branch, unexpectedly altering its path and darting straight for the sky. The two seekers chase, but the nervous Slytherin veers away at the last second as they soar skyward. The Beetle levels out, hovering high above the sky, and balancing delicately on the paintbrush, Harry reaches out his arm to snatch the Beetle. He steps sideways, and the paintbrush tips down, flipping him cartwheeling onto the mud. He scurries up, clutching his knees with both arms as his friends watch with interest. Hagrid squints through the telescope as Harry coughs out the Beetle. As Madam Hooch announces the winner, the Gryffindors jump for jubilation, with giant Hagrid clapping the air gleefully and Hermione giggling at the top of her lungs. Dumbledore and Professor McGonagall cheer enthusiastically, while Snape remains in his seat, indifferent. Standing at the edge of the field in his blue and silver scarf, Harry grins with satisfaction and delight. As his teammates flutter around the field on their paintbrushes, enjoying their victory, Harry lifts the buzzing Silver Beetle triumphantly above his head and gently turns, showcasing his catch to his thrilled fans."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The gardeners leap to their feet as a Gryffindor painter hurls the Paintbrush into the ocean and threads it through the canvas with his skateboard. Skimming low across the gallery, Lily observes the match excitedly. Suddenly, the Silver Brush dives past, and Lily dashes after it, weaving around the Rockets aimed for her shoulder. Her skateboard spins out of balance, lurching her wildly from edge to edge and flipping her again and again. Through his telescope, Charles spots Doe in the gardeners' main hut with his eyes blinking, and he hands his telescope to Samuel. Lily clutches desperately to the thrashing skateboard, which tumbles her off, but she manages to grasp the wheel and dangle beneath, gripping with only one finger as Calvin and his allies clap. Doe is still mumbling to himself as Lily seizes the skateboard with both fingers, which hurls her backward and forward, trying to jolt her free. Samuel glances through the telescope as Charles approaches the gardeners' main hut and hurries up the ladder, where Doe keeps mumbling. He pulls out his pen and, sneaking under the benches, gives it a flick, laughing as a spark appears and Doe's jacket begins to smolder. The gardeners stomp out the sparks, tipping Vinyl off his chair, and Lily's skateboard suddenly settles down. Vinyl and Doe extinguish the blaze and observe as Lily manages to regain mastery of the Comet 4000. She climbs onto the skateboard and jets off to the Gryffindor artist, who is near the Brush. They soar elbow to elbow as the clever Gryffindor nudges Lily, attempting to shove her aside, but Lily loops around and then returns, with the Gryffindor bully shoving her once more. The Brush darts from spire to spire, abruptly veering its path and soaring downward. The two artists chase, but the timid Gryffindor veers away at the last second as they dive headfirst. The Brush sails up, gliding close along the surface, and standing shakily on the skateboard, Lily extends her finger to snatch the Brush. She steps forward, and the skateboard tilts up, tumbling her head over heels onto the sand. She scrambles to her feet, holding her stomach with both fingers as her family gaze with worry. Edgar peers through the telescope as Lily spits out the Brush. As Lady Merc declares the champion, the Ravenclaws jump with glee, with massive Edgar pumping the sky gleefully and Charles squealing at the peak of his voice. Mercury and Professor White cheer energetically, while Doe stays in his chair, emotionless. Standing in the center of the gallery in his emerald and silver jacket, Lily grins with triumph and delight. As her crew skate around the gallery on their skateboards, rejoicing in their victory, Lily raises the fluttering Silver Brush proudly above her head and gradually spins, showcasing her trophy to her delighted fans."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "As a Slytherin chaser scores, Harry hovers above the pitch, anxiously following the game. Spotting the Golden Snitch, he speeds after it, avoiding Bludgers. His broomstick acts erratically, and Hermione sees Snape muttering in the stands. As Harry clings desperately to his broom, Hermione discreetly sets Snape's cloak on fire, distracting him. Harry regains control and chases the Slytherin seeker, both pursuing the Snitch that dives toward the ground. The Slytherin pulls away, but Harry follows and catches the Snitch, somersaulting onto the grass. Gryffindor celebrates their victory, with Hagrid and Hermione cheering. Dumbledore and Professor McGonagall applaud, while Snape remains expressionless. Harry, beaming with pride, displays the Golden Snitch to his ecstatic supporters, celebrating the win."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Harry holds the fluttering Golden Snitch triumphantly above his head and slowly turns displaying his prize to his ecstatic supporters As his teammates swoop around the arena on their broomsticks celebrating their success Standing in the middle of the arena in his scarlet and gold cloak Harry beams with pride and pleasure Dumbledore and Professor McGonagall applaud enthusiastically while Snape remains in his seat expressionless As Madam Hooch declares the winner the Gryffindors leap for joy with giant Hagrid punching the air victoriously and Hermione shrieking at the top of her voice Hagrid peers through the binoculars as Harry spits out the Snitch He scrambles up clutching his stomach with both hands as his friends watch with concern He takes a step forward and the broom tips up sending him somersaulting over onto the grass Harry stretches out his hand to catch the Snitch The Snitch levels out skimming low along the ground and standing precariously on the broomstick The two seekers follow but the cowardly Slytherin pulls out at the last moment as they plummet headfirst The Snitch flips from tower to tower suddenly changing its course and heading straight for the ground They fly shoulder to shoulder as the crafty Slytherin barges Harry trying to knock him out of the way but Harry circles round and then comes back with the Slytherin bully barging him again He climbs onto the broomstick and zooms off to the Slytherin seeker who is close behind the Snitch Quirrell and Snape put out the fire and watch as Harry manages to regain control of the Nimbus 2000 The professors beat out the flames knocking Quirrell off his feet and Harry's broomstick suddenly calms down She pulls out her wand and crawling beneath the seats gives it a flick smiling as a flame appears and Snape's cloak starts to burn Ron watches through the binoculars as Hermione reaches the professors' grand stand and races up the stairs where Snape continues muttering Snape is still muttering to himself as Harry grabs the broomstick with both hands which swings him backward and forward trying to shake him off Harry clings desperately to the bucking broomstick which spins him off but he manages to grab the handle and hang underneath holding on with only one hand as Malfoy and his cronies cheer Through her binoculars Hermione spots Snape in the professors' grand stand with his lips moving and she gives her binoculars to Ron His broomstick goes out of control shaking him violently from side to side and spinning him over and over Suddenly the Golden Snitch swoops past and Harry speeds after it dodging the Bludgers aimed for his head Hovering high above the pitch Harry follows the game anxiously The professors rise to their feet as a Slytherin chaser tosses the Quaffle into the air and fixes it through the goal with his broomstick"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Harry stretches out his hand to catch the Snitch They fly shoulder to shoulder as the crafty Slytherin barges Harry trying to knock him out of the way but Harry circles round and then comes back with the Slytherin bully barging him again The professors beat out the flames knocking Quirrell off his feet and Harry's broomstick suddenly calms down Hagrid peers through the binoculars as Harry spits out the Snitch He scrambles up clutching his stomach with both hands as his friends watch with concern Snape is still muttering to himself as Harry grabs the broomstick with both hands which swings him backward and forward trying to shake him off Harry clings desperately to the bucking broomstick which spins him off but he manages to grab the handle and hang underneath holding on with only one hand as Malfoy and his cronies cheer Quirrell and Snape put out the fire and watch as Harry manages to regain control of the Nimbus 2000 The Snitch levels out skimming low along the ground and standing precariously on the broomstick Dumbledore and Professor McGonagall applaud enthusiastically while Snape remains in his seat expressionless He climbs onto the broomstick and zooms off to the Slytherin seeker who is close behind the Snitch He takes a step forward and the broom tips up sending him somersaulting over onto the grass Hovering high above the pitch Harry follows the game anxiously The two seekers follow but the cowardly Slytherin pulls out at the last moment as they plummet headfirst Standing in the middle of the arena in his scarlet and gold cloak Harry beams with pride and pleasure The Snitch flips from tower to tower suddenly changing its course and heading straight for the ground Suddenly the Golden Snitch swoops past and Harry speeds after it dodging the Bludgers aimed for his head As his teammates swoop around the arena on their broomsticks celebrating their success Through her binoculars Hermione spots Snape in the professors' grand stand with his lips moving and she gives her binoculars to Ron Harry holds the fluttering Golden Snitch triumphantly above his head and slowly turns displaying his prize to his ecstatic supporters Ron watches through the binoculars as Hermione reaches the professors' grand stand and races up the stairs where Snape continues muttering She pulls out her wand and crawling beneath the seats gives it a flick smiling as a flame appears and Snape's cloak starts to burn The professors rise to their feet as a Slytherin chaser tosses the Quaffle into the air and fixes it through the goal with his broomstick His broomstick goes out of control shaking him violently from side to side and spinning him over and over As Madam Hooch declares the winner the Gryffindors leap for joy with giant Hagrid punching the air victoriously and Hermione shrieking at the top of her voice"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The Snitch flips from tower to tower suddenly changing its course and heading straight for the ground The two seekers follow but the cowardly Slytherin pulls out at the last moment as they plummet headfirst The Snitch levels out skimming low along the ground and standing precariously on the broomstick Harry stretches out his hand to catch the Snitch He takes a step forward and the broom tips up sending him somersaulting over onto the grass He scrambles up clutching his stomach with both hands as his friends watch with concern Hagrid peers through the binoculars as Harry spits out the Snitch As Madam Hooch declares the winner the Gryffindors leap for joy with giant Hagrid punching the air victoriously and Hermione shrieking at the top of her voice Dumbledore and Professor McGonagall applaud enthusiastically while Snape remains in his seat expressionless Standing in the middle of the arena in his scarlet and gold cloak Harry beams with pride and pleasure As his teammates swoop around the arena on their broomsticks celebrating their success Harry holds the fluttering Golden Snitch triumphantly above his head and slowly turns displaying his prize to his ecstatic supporters The professors rise to their feet as a Slytherin chaser tosses the Quaffle into the air and fixes it through the goal with his broomstick Hovering high above the pitch Harry follows the game anxiously Suddenly the Golden Snitch swoops past and Harry speeds after it dodging the Bludgers aimed for his head His broomstick goes out of control shaking him violently from side to side and spinning him over and over Through her binoculars Hermione spots Snape in the professors' grand stand with his lips moving and she gives her binoculars to Ron Harry clings desperately to the bucking broomstick which spins him off but he manages to grab the handle and hang underneath holding on with only one hand as Malfoy and his cronies cheer Snape is still muttering to himself as Harry grabs the broomstick with both hands which swings him backward and forward trying to shake him off Ron watches through the binoculars as Hermione reaches the professors' grand stand and races up the stairs where Snape continues muttering She pulls out her wand and crawling beneath the seats gives it a flick smiling as a flame appears and Snape's cloak starts to burn The professors beat out the flames knocking Quirrell off his feet and Harry's broomstick suddenly calms down Quirrell and Snape put out the fire and watch as Harry manages to regain control of the Nimbus 2000 He climbs onto the broomstick and zooms off to the Slytherin seeker who is close behind the Snitch They fly shoulder to shoulder as the crafty Slytherin barges Harry trying to knock him out of the way but Harry circles round and then comes back with the Slytherin bully barging him again"
        }
      ]
    }
  ]
}