{
  "ground_truth": "He puts a huge black egg on the table. The huge egg shudders and twitches and suddenly bursts open. A strange little green-grey creature uncurls from the broken shell. Its long black leg slips on the surface of the table. It staggers and stretches spiky wings. The dragon shoots flame. Hagrid's beard catches fire. He puts it out with his over gloves. A face at the window. Back in school. Beside Professor McGonagall, Malfoy smirks. Malfoy scowls angrily. Carrying a lantern, Filch leads the four children out of the school. Hagrid comes out of his cottage. Hagrid picks up a crossbow. A shaft of moonlight shows the way, following Hagrid and his dog, Fang, along the edge of the forest. Even the huge giant is dwarfed by the tall trees, which rise up and disappear into the darkness above their heads. Hagrid's lamp throws a feeble beam, as he leads them amongst the trees, deeper and deeper into the dark forest. Twisted branches loom out of the darkness, throwing weird and frightening shadows. Hagrid suddenly stops. He bends down, and dips his fingers into a small pool of silvery liquid. The huge giant looks around wearily. They split up. Malfoy raises the lamp, and he and Harry continue along the path, looking around them cautiously. Fang keeps close beside them, then goes on ahead, his nose to the ground. Suddenly, the big dog stops and lifts his head. The boys catch up with him. A hooded figure is crouching over a large white animal lying on the ground. Harry clutches the scar on his forehead. The hooded figure lifts his head. Followed by Fang, Malfoy turns and runs, still carrying the lamp. In the shadowy moonlight, the hooded figure seems to rise up and hover above the dead unicorn. It spreads its arms wide and moves ominously towards Harry. Terrified, he backs away. The figure gets closer and closer. Harry trips over a twisted tree root and falls backwards. He lies helpless on the ground, as the hooded figure advances. Suddenly, something jumps over his head in a flurry of hooves. It attacks the dark figure, who turns and disappears into the mist. Harry scrambles to his feet and looks up at a dark-skinned centaur with a red beard, half man, half horse. Harry nods. As the centaur leaves them, they look sadly at the body of the dead unicorn. The common room. The boys look blank. Harry is not convinced. Crossing the courtyard. Harry sees Hagrid sitting outside his cottage playing a tune. Cloaks flying, they run towards the cottage. They look at each other. The children run back into the school and into Professor McGonagall's classroom.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He places a large ebony oval on the table. The large oval quakes and jerks and suddenly explodes open. A peculiar little verdant-grey being unfolds from the fractured shell. Its lengthy ebony limb slips on the surface of the table. It totters and extends spiky wings. The dragon ejects fire. Hagrid's beard ignites. He extinguishes it with his over mitts. A visage at the window. Back in school. Beside Professor McGonagall, Malfoy sneers. Malfoy frowns angrily. Carrying a lantern, Filch guides the four juveniles out of the school. Hagrid emerges from his hut. Hagrid seizes a crossbow. A beam of moonlight reveals the path, accompanying Hagrid and his canine, Fang, along the boundary of the woods. Even the large titan is dwarfed by the towering trees, which ascend and vanish into the obscurity above their heads. Hagrid's lamp casts a weak ray, as he guides them among the trees, deeper and deeper into the shadowy woods. Twisted branches loom out of the obscurity, casting strange and terrifying silhouettes. Hagrid suddenly halts. He bends down, and dips his digits into a small pool of silvery fluid. The large titan gazes around wearily. They divide up. Malfoy elevates the lamp, and he and Harry proceed along the path, gazing around them cautiously. Fang stays close beside them, then proceeds on ahead, his nose to the ground. Suddenly, the big hound halts and raises his head. The lads catch up with him. A hooded figure is crouching over a large alabaster creature lying on the ground. Harry grips the scar on his forehead. The hooded figure raises his head. Followed by Fang, Malfoy turns and flees, still carrying the lamp. In the shadowy moonlight, the hooded figure appears to rise up and hover above the deceased unicorn. It extends its arms wide and moves ominously towards Harry. Terrified, he retreats. The figure gets nearer and nearer. Harry stumbles over a twisted tree root and falls backwards. He lies powerless on the ground, as the hooded figure approaches. Suddenly, something leaps over his head in a flurry of hooves. It attacks the shadowy figure, who turns and vanishes into the mist. Harry scrambles to his feet and gazes up at a dark-skinned centaur with a crimson beard, half man, half horse. Harry nods. As the centaur departs from them, they look sadly at the form of the deceased unicorn. The common chamber. The lads look blank. Harry is not convinced. Crossing the courtyard. Harry observes Hagrid seated outside his hut playing a melody. Cloaks flying, they dash towards the hut. They gaze at each other. The juveniles rush back into the school and into Professor McGonagall's classroom."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A huge black egg is put on the table by him. The huge egg is shuddered and twitched and suddenly is burst open. From the broken shell, a strange little green-grey creature is uncurled. The surface of the table is slipped on by its long black leg. Spiky wings are staggered and stretched by it. Flame is shot by the dragon. Hagrid's beard is caught on fire. The fire is put out by him with his over gloves. A face is seen at the window. Back in school. Malfoy smirks beside Professor McGonagall. Malfoy angrily scowls. Filch, carrying a lantern, is leading the four children out of the school. Out of his cottage comes Hagrid. A crossbow is picked up by Hagrid. The way is shown by a shaft of moonlight, following Hagrid and his dog, Fang, along the edge of the forest. The tall trees, which rise up and disappear into the darkness above their heads, dwarf even the huge giant. A feeble beam is thrown by Hagrid's lamp, as they are led amongst the trees, deeper and deeper into the dark forest by him. Out of the darkness loom twisted branches, throwing weird and frightening shadows. Hagrid suddenly is stopped. Down he is bent, and a small pool of silvery liquid is dipped into by his fingers. Around, the huge giant is looked at wearily. Up, they are split. The lamp is raised by Malfoy, and along the path, he and Harry continue, looking cautiously around them. Close beside them is kept by Fang, then ahead he goes, his nose to the ground. Suddenly, the big dog is stopped and his head is lifted. With him, the boys are caught up. Over a large white animal lying on the ground, a hooded figure is crouching. The scar on his forehead is clutched by Harry. The hooded figure lifts his head. Malfoy, followed by Fang, turns and runs, the lamp still carried. In the shadowy moonlight, the hooded figure seems to rise up and is hovered above the dead unicorn. Wide, its arms are spread and towards Harry it moves ominously. Backing away terrified, Harry trips over a twisted tree root and is fallen backwards. Helpless on the ground he is laid, as the hooded figure advances. Over his head, in a flurry of hooves, something is jumped. The dark figure is attacked, who turns and into the mist disappears. To his feet, Harry scrambles and up at a dark-skinned centaur with a red beard, half man, half horse, he looks. A nod is made by Harry. As they are left by the centaur, at the body of the dead unicorn they sadly look. The common room. Blank looks are given by the boys. Convinced Harry is not. Crossing the courtyard. Outside his cottage Hagrid is seen by Harry sitting and playing a tune. Towards the cottage, cloaks flying, they are run. At each other, they look. Back into the school and into Professor McGonagall's classroom the children are run."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He places a huge black egg on the table, which shudders, twitches, and bursts open. A peculiar green-grey creature emerges, slipping its long black leg on the table and stretching spiky wings. The dragon breathes fire, setting Hagrid's beard ablaze, which he quickly extinguishes with over gloves. A face appears at the window; back in school, Malfoy smirks beside Professor McGonagall, then scowls angrily. Carrying a lantern, Filch leads the four children out. Hagrid exits his cottage, armed with a crossbow. Moonlight guides them as they follow Hagrid and Fang along the forest's edge. The towering trees dwarf even Hagrid, disappearing into the darkness. His lamp casts a weak beam as he leads them deeper into the forest. Twisted branches create eerie shadows. Hagrid stops, dips his fingers into a pool of silvery liquid, and looks around warily. They split up. Malfoy lifts the lamp, and he and Harry continue cautiously, with Fang close beside them. Suddenly, Fang halts, and they see a hooded figure over a large white animal. Harry clutches his scar. The figure raises his head. Malfoy, followed by Fang, flees with the lamp. In the moonlight, the figure looms over the dead unicorn, advancing ominously towards Harry, who retreats in terror. As Harry trips and falls, a creature with hooves attacks the figure, who vanishes into the mist. Harry stands and sees a dark-skinned centaur with a red beard. Harry nods. As the centaur departs, they look mournfully at the unicorn. In the common room, the boys appear bewildered, and Harry remains unconvinced. Crossing the courtyard, Harry spots Hagrid playing a tune outside his cottage. The children sprint towards him, cloaks flying, then return to Professor McGonagall's classroom."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He places a large black egg on the table, which shudders, twitches, and bursts open into a strange green-grey creature. Its long black leg slips, it staggers, stretches spiky wings, and shoots flame, igniting Hagrid's beard, which he puts out with his gloves. A face at the window. Back at school, Malfoy smirks beside Professor McGonagall, then scowls. Filch leads four children out with a lantern. Hagrid exits his cottage with a crossbow, following moonlight with Fang along the forest edge. The giant is dwarfed by towering trees, and Hagrid's lamp casts a weak beam as they delve into darkness. Twisted branches loom, casting eerie shadows. Hagrid suddenly stops, dips fingers into silvery liquid, then they split up. Malfoy and Harry continue with Fang, who stops and lifts his head. They see a hooded figure over a white animal. Harry clutches his scar, and Malfoy flees with Fang. The figure rises, approaching Harry, who backs away terrified, trips, and falls. A creature leaps over, attacking the figure, which disappears into mist. Harry meets a centaur, nods, and they solemnly view the dead unicorn. In the common room, the boys seem blank; Harry is unconvinced. Crossing the courtyard, Harry sees Hagrid playing music outside. Cloaks flying, they run toward the cottage, exchange looks, then return to Professor McGonagall's classroom."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He carefully places a massive, pitch-black egg on the table before him. The enormous egg quivers and shakes violently until, without warning, it bursts open. From the cracked shell emerges a peculiar, small creature of a greenish-grey hue. The creature uncurls itself slowly, and its lengthy black leg slips awkwardly on the smooth surface of the table. It staggers and begins to unfurl its spiky, imposing wings. Suddenly, the tiny dragon releases a burst of flame, which ignites Hagrid's beard. He quickly extinguishes the flames using his large, protective over gloves. A face appears at the window. Transitioning back to the school setting, Professor McGonagall stands nearby as Malfoy smirks with a sense of smug satisfaction. Malfoy then scowls, displaying his anger. Filch, carrying a lantern, leads the group of four children out of the school grounds. Exiting his cozy cottage, Hagrid joins them and picks up a sturdy crossbow. The bright beam of moonlight reveals the path ahead, guiding Hagrid and his dog, Fang, as they walk along the forest's edge. Even Hagrid, with his giant stature, appears small next to the towering trees that rise up and vanish into the darkness overhead. The dim light from Hagrid's lamp casts a weak beam as he guides them deeper and deeper into the dark, eerie forest, wandering among the twisted trees. The gnarled branches emerge from the shadows, casting weird and intimidating shapes. Suddenly, Hagrid stops in his tracks. He bends down and dips his fingers into a small pool of shimmering, silvery liquid on the ground. Looking around vigilantly, the giant appears weary. They decide to split into separate groups. Malfoy raises his lamp high, and he and Harry cautiously continue along the shadowy path, glancing nervously around them. Fang, staying close to their side, soon goes ahead, his nose sniffing along the ground. Suddenly, the large dog halts and lifts his head alertly. The boys catch up with the alert dog. A mysterious, hooded figure crouches over a large, lifeless white animal lying on the ground. Harry instinctively clutches the scar on his forehead. The hooded figure raises its head. Fang, followed by a frightened Malfoy, turns and bolts, still holding the lamp. In the dim, shadowy moonlight, the hooded figure appears to rise and hover ominously above the dead unicorn. With its arms spread wide, it moves menacingly toward Harry, who retreats in terror. The figure advances closer and closer. Harry stumbles over a gnarled tree root and falls backward. Helpless on the ground, he watches as the hooded figure draws nearer. Suddenly, something leaps over his head in a blur of hooves, attacking the dark figure, which quickly turns and vanishes into the misty forest. Harry scrambles unsteadily to his feet and looks up to see a centaur with dark skin and a striking red beard, a majestic creature half man, half horse, standing before him. Harry nods in acknowledgment. As the centaur departs, they gaze sadly at the body of the fallen unicorn. In the common room, the boys appear blank and lost in thought. Harry remains unconvinced. As they cross the courtyard, Harry notices Hagrid sitting outside his cottage, softly playing a tune. With cloaks billowing behind them, they sprint toward the cottage, exchanging worried glances. Quickly, the children rush back into the school and make their way to Professor McGonagall's classroom."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He meticulously places a massive, ominous pitch-black egg on the table positioned right before him. The enormous egg begins to quiver and shake violently, displaying an almost uncontrollable energy until, quite abruptly and without any warning, it bursts open with force. Emerging from the cracked and shattered shell appears a peculiar and small creature, possessing a greenish-grey hue. As the creature begins to uncurl itself slowly, its lengthy black leg slips awkwardly on the smooth surface of the table, struggling to maintain balance. It staggers slightly before it starts to unfurl its spiky and decidedly imposing wings. Then, quite suddenly, the tiny dragon unexpectedly releases a burst of flame that ignites Hagrid's beard. Reacting quickly, he extinguishes the flames with his large and protective over gloves. At that moment, a face becomes visible at the window. As the scene transitions back to the school setting, Professor McGonagall stands nearby, observing as Malfoy smirks with a sense of smug satisfaction. However, Malfoy soon scowls, his expression morphing to display his anger. Filch, holding a lantern to illuminate their way, leads the group of four children out of the school grounds. Exiting from his cozy, inviting cottage, Hagrid joins them and picks up a sturdy crossbow. The bright beam of moonlight shines down, revealing the path ahead and guiding Hagrid along with his faithful dog, Fang, as they continue their walk along the forest's edge. Even Hagrid, with his giant stature, appears small in comparison to the towering trees that rise up and vanish into the darkness overhead. The dim light emitted from Hagrid's lamp casts a weak beam, guiding them deeper and deeper into the dark and eerie forest, as they wander among the twisted and tangled trees. The gnarled branches emerge ominously from the shadows, casting weird and intimidating shapes. Suddenly, Hagrid comes to a halt. He bends downwards and dips his fingers into a small pool of shimmering, silvery liquid resting on the ground. Looking around vigilantly and alertly, the giant appears weary and cautious. They decide, in that moment, to split into separate groups. Malfoy raises his lamp high, and he, along with Harry, cautiously continues along the shadowy path, glancing nervously around them. Fang, staying close by their side, soon moves ahead, his nose actively sniffing along the ground. All of a sudden, the large dog halts and lifts his head, alert and attentive. The boys quickly catch up with the alert dog. There, a mysterious hooded figure crouches over a large, lifeless white animal lying on the ground. Harry instinctively clutches the scar on his forehead. The hooded figure then raises its head. Fang, followed swiftly by a frightened Malfoy, turns and bolts, still holding the lamp securely. In the dim and shadowy moonlight, the hooded figure appears to rise and hover ominously above the dead unicorn. With its arms spread wide, it begins to move menacingly toward Harry, who backs away, retreating in terror. The figure advances closer and closer. Harry stumbles over a gnarled tree root and falls backward. Helplessly lying on the ground, he watches as the hooded figure draws nearer. Suddenly, something leaps over his head in a blur of hooves, attacking the dark figure, which quickly turns and vanishes into the misty forest. Harry scrambles unsteadily to his feet and looks up to see a centaur with dark skin and a strikingly red beard—a majestic creature, half man and half horse—standing before him. Harry nods in acknowledgment, showing his gratitude silently. As the centaur departs, they gaze sadly at the body of the fallen unicorn. In the common room, the boys appear blank and lost in thought, clearly reflecting on the night's events. Harry remains unconvinced and pensive. As they cross the courtyard, Harry notices Hagrid sitting outside his cottage, softly playing a tune. With cloaks billowing dramatically behind them, they sprint toward the cottage, exchanging worried glances. In a hurry, the children rush back into the school building and make their way directly to Professor McGonagall's classroom."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He carefully sets down an enormous black egg on the table, ensuring it is stable before stepping back to observe what unfolds. The massive egg begins to shiver and jerk unexpectedly, its movements growing more intense until it suddenly bursts open with a loud crack, sending pieces of the shell scattering. From within the broken remnants, a peculiar little green-grey creature begins to unfurl itself, extending its body and limbs as it emerges. The creature, still unsteady, attempts to find its balance but slips slightly as one of its long black legs skids on the surface of the table. It struggles momentarily before righting itself and extending spiky wings, testing them by stretching them out wide. Without warning, the dragon lets out a fiery breath, and the flames leap towards Hagrid, igniting his beard. Hagrid, with quick reflexes, grabs his nearby over gloves and hastily pats down his now smoldering beard, extinguishing the flames. Meanwhile, unnoticed by them, a face appears at the window, peering in briefly. The scene transitions to a school setting where Professor McGonagall stands beside Malfoy, who initially smirks with a sense of satisfaction, only to have his expression shift into an angry scowl moments later. Carrying a lantern that casts flickering light, Filch leads four children out of the school, guiding them towards an unknown destination. They are soon joined by Hagrid, who emerges from his cottage hefting a crossbow, ready for what lies ahead. As they set off, a shaft of moonlight illuminates their path, guiding Hagrid and his loyal dog, Fang, along the periphery of the dense forest. The sheer scale of the towering trees makes even Hagrid, with his immense size, appear small in comparison as the trees stretch upwards into the obscurity of the night sky. Hagrid's lantern emits a weak beam, barely piercing the darkness as he leads them deeper into the forest. The twisted branches of the trees emerge from the shadows, casting eerie and unsettling silhouettes around them. Abruptly, Hagrid halts in his tracks, bending down to touch a small pool of luminous silvery liquid with his fingers, his gaze scanning their surroundings with caution. The group decides to split up, leading to Malfoy raising his lamp to better illuminate his way as he and Harry cautiously continue down a narrow path. Fang remains close by, sniffing the ground with intensity before moving ahead, his curiosity piqued. Suddenly, Fang halts abruptly and lifts his head, a signal that prompts Harry and Malfoy to catch up with the dog. There, they discover a hooded figure crouching over a large white animal that lies lifelessly on the ground. Instinctively, Harry reaches up to clutch the scar on his forehead, feeling a sharp pain. The hooded figure, sensing their presence, slowly lifts its head. Reacting quickly, Malfoy turns to flee, still clutching the lamp, with Fang following closely behind. In the dim, shadowy moonlight, the hooded figure appears to rise and hover ethereally above the dead unicorn, its arms spreading wide as it ominously advances toward Harry, who starts to retreat in fear. As the figure draws ever nearer, Harry backs away frantically but trips over a twisted tree root and falls heavily to the ground, lying there helplessly as the figure looms closer. Suddenly, a blur of motion sails over Harry's head as something with hooves charges at the dark figure, causing it to turn and vanish into the swirling mist. Harry scrambles up from the dirt, his heart racing, and looks up to see a dark-skinned centaur with a striking red beard, its body an extraordinary fusion of man and horse. He acknowledges the centaur with a nod of gratitude. As the centaur leaves, Harry and his companions glance back with somber expressions at the lifeless form of the unicorn lying on the forest floor. The scene shifts to the common room, where the boys sit with blank expressions, grappling with what they have just witnessed. Harry, deep in thought, is not convinced by the reassurances given. They leave the common room and cross the courtyard, where Harry catches sight of Hagrid sitting outside his cottage, gently playing a tune. With cloaks billowing behind them, they sprint towards the cottage, urgency in their steps. Upon reaching each other, they exchange a look of mutual understanding and concern. The children then rush back into the school, their destination set as Professor McGonagall's classroom, where their next actions and decisions will unfold."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He places a huge black egg on the table, which shudders, twitches, and suddenly bursts open, revealing a strange little green-grey creature. As the creature's leg slips on the table and it stretches its spiky wings, it shoots flames that catch Hagrid's beard on fire, which he quickly extinguishes with his gloves. A face appears at the window. Back at school, Malfoy smirks beside Professor McGonagall, then scowls angrily. Filch, carrying a lantern, leads the four children out of the school and Hagrid emerges from his cottage with a crossbow. Guided by a shaft of moonlight, Hagrid and his dog, Fang, lead the children along the edge of the forest. Even the huge giant is dwarfed by the towering trees that rise into the darkness. Hagrid's lamp casts a feeble beam as they venture deeper into the forest, where twisted branches create eerie shadows. Suddenly, Hagrid stops, bends down, and dips his fingers into a pool of silvery liquid, while they all look around warily. They decide to split up, with Malfoy raising the lamp as he and Harry proceed cautiously along the path, Fang close by. The big dog suddenly stops, raising his head, and the boys catch up with him, discovering a hooded figure crouched over a dead white unicorn. Harry clutches his forehead scar. As the hooded figure lifts its head, Malfoy flees with Fang, still carrying the lamp. In the moonlight, the figure appears to hover above the unicorn and advances towards Harry, who retreats in terror, trips over a tree root, and falls. As the figure bears down, something leaps over Harry, attacking the dark figure, which vanishes into the mist. Harry scrambles to his feet and sees a dark-skinned centaur with a red beard. Harry nods in acknowledgment. As the centaur departs, they look sadly at the unicorn's body. In the common room, the boys appear blank, while Harry remains unconvinced. As they cross the courtyard, Harry notices Hagrid playing a tune outside his cottage. The children, with cloaks flying, rush towards the cottage, exchange glances, and then run back into the school and into Professor McGonagall's classroom."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He puts a huge black egg, reminiscent of dragon eggs found in ancient mythologies known for their magical properties, on the table. The huge egg shudders and twitches and suddenly bursts open. A strange little green-grey creature, identified as a Norwegian Ridgeback dragon known for its aggressive nature, uncurls from the broken shell. Its long black leg slips on the surface of the table. It staggers and stretches spiky wings, typical of young dragons beginning to test their abilities. The dragon shoots flame. Hagrid's beard, bushy and unkempt due to his half-giant heritage, catches fire. He puts it out with his over gloves, specially designed to handle magical creatures. A face at the window. Back in school. Beside Professor McGonagall, renowned for her strict but fair demeanor and expertise in Transfiguration, Malfoy smirks. Malfoy scowls angrily. Carrying a lantern that cast elongated shadows in the dim corridors, Filch leads the four children out of the school. Hagrid comes out of his cottage, a small wooden house on the edge of the Hogwarts grounds. Hagrid picks up a crossbow, a hefty weapon he favors for protection and hunting in the forest. A shaft of moonlight shows the way, following Hagrid and his dog, Fang, a large boarhound loyal to his master, along the edge of the forest known as the Forbidden Forest, famous for its many magical creatures. Even the huge giant is dwarfed by the tall trees, which rise up and disappear into the darkness above their heads. Hagrid's lamp throws a feeble beam, as he leads them amongst the trees, deeper and deeper into the dark forest filled with mystery and danger. Twisted branches loom out of the darkness, throwing weird and frightening shadows reminiscent of ancient stories of haunted woods. Hagrid suddenly stops. He bends down, and dips his fingers into a small pool of silvery liquid, believed to be unicorn blood, which is rumored to offer a cursed half-life. The huge giant looks around wearily. They split up. Malfoy raises the lamp, and he and Harry continue along the path, looking around them cautiously. Fang keeps close beside them, then goes on ahead, his nose to the ground. Suddenly, the big dog stops and lifts his head, sensing something unusual. The boys catch up with him. A hooded figure is crouching over a large white animal, a unicorn known for its purity and rarity, lying on the ground. Harry clutches the scar on his forehead, a lightning-bolt mark known for its connection to Voldemort, the dark wizard. The hooded figure lifts his head. Followed by Fang, Malfoy turns and runs, still carrying the lamp. In the shadowy moonlight, the hooded figure seems to rise up and hover above the dead unicorn. It spreads its arms wide and moves ominously towards Harry. Terrified, he backs away. The figure gets closer and closer. Harry trips over a twisted tree root and falls backwards. He lies helpless on the ground, as the hooded figure advances. Suddenly, something jumps over his head in a flurry of hooves, revealing itself to be the centaur Firenze, a being of wisdom and prophecy in the wizarding world. It attacks the dark figure, who turns and disappears into the mist. Harry scrambles to his feet and looks up at a dark-skinned centaur with a red beard, half man, half horse, known for their unique place between human and nature. Harry nods. As the centaur leaves them, they look sadly at the body of the dead unicorn. The common room, a popular gathering spot for students in Hogwarts, is where the boys look blank. Harry is not convinced. Crossing the courtyard, a large open area in the center of the castle, Harry sees Hagrid sitting outside his cottage playing a tune on a flute he crafted. Cloaks flying, they run towards the cottage. They look at each other. The children run back into the school and into Professor McGonagall's classroom, seeking the wisdom and guidance of their esteemed teacher."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He puts a huge black egg on the table. The huge egg shudders and twitches and suddenly bursts open. A strange little greengrey creature uncurls from the broken she will. Its long black leg slips on the surface of the table. It staggers and stretches spiky wings. The dragon shoots flame. Hagrid's beard catches fire. He puts it out with his over gloves. A face at the window. Back in school. Beside Professor McGonagall. Malfoy smirks. Malfoy scowls angrily. Carrying a lantern. Filch leads the four children out of the school. Hagrid comes out of his cottage. Hagrid picks up a crossbow. A shaft of moonlight shows the way following Hagrid and his dog Fang along the edge of the forest. Even the huge giant is dwarfed by the tall trees which rise up and disappear into the darkness above their heads. Hagrid's lamp throws a feeble beam as he leads them amongst the trees deeper and deeper into the dark forest. Twisted branches loom out of the darkness throwing weird and frightening shadows. Hagrid suddenly stops. He bends down and dips his fingers into a small pool of silvery liquid. The huge giant looks around wearily. They split up. Malfoy raises the lamp and he and Harry continue along the path looking around them cautiously. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. Fang keeps close beside them then goes on ahead his nose to the ground. Suddenly the big dog stops and lifts his head. The boys catch up with him. A hooded figure is crouching over a large white animal lying on the ground. Harry clutches the scar on his forehead. The hooded figure lifts his head Followed by Fang. Malfoy turns and runs still carrying the lamp. In the shadowy moonlight the hooded figure seems to rise up and hover above the dead unicorn. It spreads its arms wide and moves ominously towards Harry. Terrified he backs away. The figure gets closer and closer. Harry trips over a twisted tree root and falls backwards. He lies helpless on the ground as the hooded figure advances. Suddenly something jumps over his head in a flurry of hooves. It attacks the dark figure who turns and disappears into the mist. Harry scrambles to his feet and looks up at a darkskinned centaur with a red beard. half man half horse. Harry nods. As the centaur leaves them they look sadly at the body of the dead unicorn. The common room. The boys look blank. Harry is not convinced. Crossing the courtyard Harry sees Hagrid sitting outside his cottage playing a tune. Cloaks flying. they run towards the cottage. They look at each other. The children run back into the school and into Professor McGonagall's classroom."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He puts a huge black egg on the table. The huge egg shudders and twitches and suddenly bursts open. A strange little greengrey creature uncurls from the broken she will. Its long black leg slips on the surface of the table. It staggers and stretches spiky wings. The dragon shoots flame. Hagrid's beard catches fire. He puts it out with his over gloves. A face at the window. Back in school. Beside Professor McGonagall. Malfoy smirks. Malfoy scowls angrily. Carrying a lantern. Filch leads the four children out of the school. Hagrid comes out of his cottage. Hagrid picks up a crossbow. A shaft of moonlight shows the way following Hagrid and his dog Fang along the edge of the forest. Even the huge giant is dwarfed by the tall trees which rise up and disappear into the darkness above their heads. Hagrid's lamp throws a feeble beam as he leads them amongst the trees deeper and deeper into the dark forest. Twisted branches loom out of the darkness throwing weird and frightening shadows. Hagrid suddenly stops. He bends down and dips his fingers into a small pool of silvery liquid. The huge giant looks around wearily. They split up. Malfoy raises the lamp and he and Harry continue along the path looking around them cautiously. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Fang keeps close beside them then goes on ahead his nose to the ground. Suddenly the big dog stops and lifts his head. The boys catch up with him. A hooded figure is crouching over a large white animal lying on the ground. Harry clutches the scar on his forehead. The hooded figure lifts his head Followed by Fang. Malfoy turns and runs still carrying the lamp. In the shadowy moonlight the hooded figure seems to rise up and hover above the dead unicorn. It spreads its arms wide and moves ominously towards Harry. Terrified he backs away. The figure gets closer and closer. Harry trips over a twisted tree root and falls backwards. He lies helpless on the ground as the hooded figure advances. Suddenly something jumps over his head in a flurry of hooves. It attacks the dark figure who turns and disappears into the mist. Harry scrambles to his feet and looks up at a darkskinned centaur with a red beard. half man half horse. Harry nods. As the centaur leaves them they look sadly at the body of the dead unicorn. The common room. The boys look blank. Harry is not convinced. Crossing the courtyard Harry sees Hagrid sitting outside his cottage playing a tune. Cloaks flying. they run towards the cottage. They look at each other. The children run back into the school and into Professor McGonagall's classroom."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He puts a huge black egg on the table. The huge egg shudders and twitches and suddenly bursts open. A strange little greengrey creature uncurls from the broken she will. Its long black leg slips on the surface of the table. It staggers and stretches spiky wings. The dragon shoots flame. Hagrid's beard catches fire. He puts it out with his over gloves. A face at the window. Back in school. Beside Professor McGonagall. Malfoy smirks. Malfoy scowls angrily. Suddenly something jumps over his head in a flurry of hooves. It attacks the dark figure who turns and disappears into the mist. Harry scrambles to his feet and looks up at a darkskinned centaur with a red beard. half man half horse. Harry nods. As the centaur leaves them they look sadly at the body of the dead unicorn. The common room. The boys look blank. Harry is not convinced. Crossing the courtyard Harry sees Hagrid sitting outside his cottage playing a tune. Cloaks flying. they run towards the cottage. They look at each other. The children run back into the school and into Professor McGonagall's classroom."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He puts a huge black egg on the table. The huge egg shudders and twitches and suddenly bursts open. A strange little greengrey creature uncurls from the broken she will. Its long black leg slips on the surface of the table. It staggers and stretches spiky wings. Harry is not convinced. Crossing the courtyard Harry sees Hagrid sitting outside his cottage playing a tune. Cloaks flying. they run towards the cottage. They look at each other. The children run back into the school and into Professor McGonagall's classroom."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "She balances an enormous red apple on the counter. The enormous apple quivers and wobbles and abruptly splits apart. A peculiar tiny orange-blue plant uncoils from the shattered skin. Its short white stem slides on the surface of the counter. It lurches and unfurls jagged leaves. The robot emits sparks. Gandalf's robe ignites. He extinguishes it with his oven mitts. A shadow at the porthole. Back in the office. Next to Manager Dumbledore, Dudley grins. Dudley frowns fiercely. Holding a candle, Jenkins guides the quartet out of the office. Gandalf walks out of his cabin. Gandalf grabs a fishing pole. A beam of sunlight indicates the path, guiding Gandalf and his parrot, Marbles, along the edge of the meadow. Even the tiny elf is overshadowed by the towering flowers, which ascend and fade into the brightness above their heads. Gandalf's flashlight casts a weak glow, as he guides them through the blossoms, further and further into the bright meadow. Bent stalks emerge from the luminosity, casting unusual and alarming silhouettes. Gandalf abruptly pauses. He kneels down, and dips his toes into a small puddle of golden syrup. The tiny elf glances around cautiously. They separate. Dudley lifts the torch, and he and Jerry proceed along the walkway, glancing around cautiously. Marbles stays close beside them, then moves on ahead, his beak to the earth. Abruptly, the small parrot halts and raises his beak. The kids catch up with him. A veiled shadow is crouching over a giant blue object resting on the ground. Jerry grips the hat on his head. The veiled shadow raises its gaze. Followed by Marbles, Dudley spins and dashes, still holding the torch. In the shimmering sunlight, the veiled shadow seems to elevate and float above the motionless pumpkin. It extends its limbs broadly and drifts menacingly toward Jerry. Frightened, he retreats. The shadow nears ever more. Jerry stumbles over a crooked vine and tumbles backwards. He lies immobilized on the ground, as the veiled shadow progresses. Unexpectedly, something leaps over his head in a flurry of wings. It confronts the shadowy figure, which rotates and vanishes into the fog. Jerry scrambles up and glances at a golden-skinned satyr with a purple mane, half human, half goat. Jerry acknowledges. As the satyr departs from them, they gaze somberly at the remains of the motionless pumpkin. The study room. The kids stare vacantly. Jerry remains skeptical. Crossing the garden. Jerry observes Gandalf seated outside his cabin playing a melody. Robes flapping, they sprint toward the cabin. They exchange glances. The students dash back into the office and into Manager Dumbledore's lecture hall."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A huge black egg bursts open on the table, revealing a peculiar green-grey dragon that sets Hagrid's beard on fire, which he extinguishes. Later, at school, Malfoy smirks beside Professor McGonagall. Filch leads four children, including Harry, into the dark forest with Hagrid and his dog, Fang. As they navigate the ominous woods, Hagrid dips his fingers into a pool of silvery liquid, then they split up. Malfoy and Harry, with Fang, encounter a hooded figure hovering over a dead unicorn. Terrified, Harry clutches his scar and backs away as the figure approaches until a centaur jumps in, causing the figure to disappear. Harry and the centaur exchange nods before leaving the scene. Back in the common room, the boys are perplexed, but Harry has doubts. Spotting Hagrid outside his cottage, Harry and friends hurry to him, then rush back to Professor McGonagall's classroom."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The children run back into the school and into Professor McGonagall's classroom They look at each other they run towards the cottage Cloaks flying Crossing the courtyard Harry sees Hagrid sitting outside his cottage playing a tune Harry is not convinced The boys look blank The common room As the centaur leaves them they look sadly at the body of the dead unicorn Harry nods half man half horse Harry scrambles to his feet and looks up at a darkskinned centaur with a red beard It attacks the dark figure who turns and disappears into the mist Suddenly something jumps over his head in a flurry of hooves He lies helpless on the ground as the hooded figure advances Harry trips over a twisted tree root and falls backwards The figure gets closer and closer Terrified he backs away It spreads its arms wide and moves ominously towards Harry In the shadowy moonlight the hooded figure seems to rise up and hover above the dead unicorn Malfoy turns and runs still carrying the lamp The hooded figure lifts his head Followed by Fang Harry clutches the scar on his forehead A hooded figure is crouching over a large white animal lying on the ground The boys catch up with him Suddenly the big dog stops and lifts his head Fang keeps close beside them then goes on ahead his nose to the ground Malfoy raises the lamp and he and Harry continue along the path looking around them cautiously They split up The huge giant looks around wearily He bends down and dips his fingers into a small pool of silvery liquid Hagrid suddenly stops Twisted branches loom out of the darkness throwing weird and frightening shadows Hagrid's lamp throws a feeble beam as he leads them amongst the trees deeper and deeper into the dark forest Even the huge giant is dwarfed by the tall trees which rise up and disappear into the darkness above their heads A shaft of moonlight shows the way following Hagrid and his dog Fang along the edge of the forest Hagrid picks up a crossbow Hagrid comes out of his cottage Filch leads the four children out of the school Carrying a lantern Malfoy scowls angrily Malfoy smirks Beside Professor McGonagall Back in school A face at the window He puts it out with his over gloves Hagrid's beard catches fire The dragon shoots flame It staggers and stretches spiky wings Its long black leg slips on the surface of the table A strange little greengrey creature uncurls from the broken she will The huge egg shudders and twitches and suddenly bursts open He puts a huge black egg on the table"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The huge egg shudders and twitches and suddenly bursts open He puts a huge black egg on the table Its long black leg slips on the surface of the table A strange little greengrey creature uncurls from the broken she will The dragon shoots flame It staggers and stretches spiky wings He puts it out with his over gloves Hagrid's beard catches fire Back in school A face at the window Malfoy smirks Beside Professor McGonagall Carrying a lantern Malfoy scowls angrily Hagrid comes out of his cottage Filch leads the four children out of the school A shaft of moonlight shows the way following Hagrid and his dog Fang along the edge of the forest Hagrid picks up a crossbow Hagrid's lamp throws a feeble beam as he leads them amongst the trees deeper and deeper into the dark forest Even the huge giant is dwarfed by the tall trees which rise up and disappear into the darkness above their heads Hagrid suddenly stops Twisted branches loom out of the darkness throwing weird and frightening shadows The huge giant looks around wearily He bends down and dips his fingers into a small pool of silvery liquid Malfoy raises the lamp and he and Harry continue along the path looking around them cautiously They split up Suddenly the big dog stops and lifts his head Fang keeps close beside them then goes on ahead his nose to the ground A hooded figure is crouching over a large white animal lying on the ground The boys catch up with him The hooded figure lifts his head Followed by Fang Harry clutches the scar on his forehead In the shadowy moonlight the hooded figure seems to rise up and hover above the dead unicorn Malfoy turns and runs still carrying the lamp Terrified he backs away It spreads its arms wide and moves ominously towards Harry Harry trips over a twisted tree root and falls backwards The figure gets closer and closer Suddenly something jumps over his head in a flurry of hooves He lies helpless on the ground as the hooded figure advances Harry scrambles to his feet and looks up at a darkskinned centaur with a red beard It attacks the dark figure who turns and disappears into the mist Harry nods half man half horse The common room As the centaur leaves them they look sadly at the body of the dead unicorn Harry is not convinced The boys look blank Cloaks flying Crossing the courtyard Harry sees Hagrid sitting outside his cottage playing a tune They look at each other they run towards the cottage The children run back into the school and into Professor McGonagall's classroom"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Suddenly the big dog stops and lifts his head The boys catch up with him A hooded figure is crouching over a large white animal lying on the ground Harry clutches the scar on his forehead The hooded figure lifts his head Followed by Fang Malfoy turns and runs still carrying the lamp In the shadowy moonlight the hooded figure seems to rise up and hover above the dead unicorn It spreads its arms wide and moves ominously towards Harry Terrified he backs away The figure gets closer and closer Harry trips over a twisted tree root and falls backwards He lies helpless on the ground as the hooded figure advances Suddenly something jumps over his head in a flurry of hooves It attacks the dark figure who turns and disappears into the mist Harry scrambles to his feet and looks up at a darkskinned centaur with a red beard half man half horse Harry nods As the centaur leaves them they look sadly at the body of the dead unicorn The common room The boys look blank Harry is not convinced Crossing the courtyard Harry sees Hagrid sitting outside his cottage playing a tune Cloaks flying they run towards the cottage They look at each other The children run back into the school and into Professor McGonagall's classroom He puts a huge black egg on the table The huge egg shudders and twitches and suddenly bursts open A strange little greengrey creature uncurls from the broken she will Its long black leg slips on the surface of the table It staggers and stretches spiky wings The dragon shoots flame Hagrid's beard catches fire He puts it out with his over gloves A face at the window Back in school Beside Professor McGonagall Malfoy smirks Malfoy scowls angrily Carrying a lantern Filch leads the four children out of the school Hagrid comes out of his cottage Hagrid picks up a crossbow A shaft of moonlight shows the way following Hagrid and his dog Fang along the edge of the forest Even the huge giant is dwarfed by the tall trees which rise up and disappear into the darkness above their heads Hagrid's lamp throws a feeble beam as he leads them amongst the trees deeper and deeper into the dark forest Twisted branches loom out of the darkness throwing weird and frightening shadows Hagrid suddenly stops He bends down and dips his fingers into a small pool of silvery liquid The huge giant looks around wearily They split up Malfoy raises the lamp and he and Harry continue along the path looking around them cautiously Fang keeps close beside them then goes on ahead his nose to the ground"
        }
      ]
    }
  ]
}