{
  "ground_truth": "They sheath their swords and join the black chess pieces. Ron climbs onto the stone horse of the black knight and looks across the board as a white pawn moves itself forward. Hermione looks at Ron anxiously, and obeying Ron's instructions, a black pawn moves forward and is sliced off by the white pawn. The game gets underway; a white bishop explodes, a white knight hits the dust, and a black pawn is destroyed. A white bishop and a white knight explode, and the white queen attacks a black castle, which explodes in a shower of stone fragments and collapses in a pile of rubble. The queen turns triumphantly. Ron contemplates his next move, and watching the merciless white queen, Harry suddenly understands the game that Ron is playing and nods. Taking a deep breath, Ron clutches the horse's reins, closes his eyes, and the black horse starts to move across the board between the remains of the shattered stone chess pieces. Ron looks nervously at the white king, who wears a silver helmet, clasping a powerful sword with his hands encased in metal armor. Ron braces himself as the white queen slowly turns and moves steadily across the board, heading straight towards Ron's black horse. He clings onto the reins, shaking with fear, as the queen gets closer and closer, gliding over the smooth marble floor. She stabs the black horse, causing Ron to fall off, and the horse crashes beside him. Hermione steps hurriedly back onto her square and looks anxiously towards Ron, who is lying unconscious. Harry moves into the winning position and confidently looks up at the white king, whose huge sword falls from his hands and lies on the marble floor at Harry's feet. He and Hermione run to Ron and kneel beside him. Harry gets to his feet, and still kneeling beside Ron, Hermione watches him go. Outside the chess room, Harry walks cautiously down a flight of white dimly lit stone steps. As he descends the stairs, he touches the scar on his forehead and sees a figure wearing a turban looking into the Mirror of Erised, Professor Quirrell. Harry touches his scar as Quirrell stares into it and stretches out his hand, drawing Harry reluctantly towards him. Harry looks into the Mirror of Erised and stares at his reflection, which stares back at him, then puts its hand in its pocket, takes out a red stone, winks at Harry, shows him the stone, and puts it back in its pocket. Secretly, Harry feels in his own pocket and finds something there. Quirrell looks impatient as Harry backs away, standing with his back to the mirror, and Quirrell unwinds the turban from his head.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "They encase their blades and ally the ebony chess figures. Ron ascends onto the stone steed of the ebony knight and gazes across the board as a pale pawn shifts itself onward. Hermione gazes at Ron apprehensively, and complying with Ron's directives, an ebony pawn shifts onward and is sliced off by the pale pawn. The match begins; a pale bishop detonates, a pale knight bites the dust, and an ebony pawn is obliterated. A pale bishop and a pale knight detonate, and the pale queen assaults an ebony rook, which detonates in a shower of stone shards and collapses in a heap of debris. The queen pivots victoriously. Ron ponders his next maneuver, and observing the ruthless pale queen, Harry suddenly comprehends the match that Ron is playing and nods. Inhaling deeply, Ron grips the steed's reins, shuts his eyes, and the ebony steed starts to shift across the board among the remnants of the shattered stone chess figures. Ron gazes nervously at the pale king, who wears a silver helm, holding a formidable blade with his hands encased in metal armor. Ron braces himself as the pale queen slowly pivots and shifts steadily across the board, heading straight towards Ron's ebony steed. He grips the reins, trembling with dread, as the queen approaches closer and closer, gliding over the smooth marble floor. She pierces the ebony steed, causing Ron to tumble off, and the steed crashes beside him. Hermione steps swiftly back onto her square and gazes anxiously towards Ron, who is lying unconscious. Harry shifts into the victorious position and confidently gazes up at the pale king, whose enormous blade falls from his hands and lies on the marble floor at Harry's feet. He and Hermione hurry to Ron and bend beside him. Harry rises to his feet, and still kneeling beside Ron, Hermione watches him depart. Outside the chess chamber, Harry walks cautiously down a flight of pale dimly lit stone steps. As he descends the stairs, he touches the scar on his forehead and sees a figure wearing a turban gazing into the Mirror of Erised, Professor Quirrell. Harry touches his scar as Quirrell peers into it and extends his hand, drawing Harry reluctantly towards him. Harry gazes into the Mirror of Erised and stares at his reflection, which gazes back at him, then places its hand in its pocket, retrieves a crimson stone, winks at Harry, shows him the stone, and places it back in its pocket. Secretly, Harry feels in his own pocket and discovers something there. Quirrell appears impatient as Harry retreats, standing with his back to the mirror, and Quirrell unwraps the turban from his head."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Their swords are sheathed, and the black chess pieces are joined by them. The stone horse of the black knight is climbed onto by Ron, and the board is looked across by him as a white pawn moves itself forward. Ron is looked at anxiously by Hermione, and following Ron's instructions, a black pawn is moved forward and sliced off by the white pawn. The game is underway; a white bishop is exploded by the board, a white knight is hit to the dust, and a black pawn is destroyed by the game. A white bishop and a white knight explode, and a black castle is attacked by the white queen, which then explodes in a shower of stone fragments and collapses in a pile of rubble. The queen is turned triumphantly. Ron's next move is contemplated by him, and as the merciless white queen is watched by Ron, Harry suddenly understands the game that is being played by Ron and nods. A deep breath is taken by Ron, the horse's reins are clutched by him, his eyes are closed, and the board is moved across by the black horse, between the remains of the shattered stone chess pieces. The white king, who wears a silver helmet and clasps a powerful sword with hands encased in metal armor, is looked at nervously by Ron. Ron braces himself as the white queen slowly turns and moves steadily across the board, heading straight towards the black horse. The reins are clung onto by him, shaking with fear, as the queen gets closer and closer, gliding over the smooth marble floor. The black horse is stabbed by her, causing Ron to fall off, and the horse crashes beside him. Hermione quickly steps back onto her square and looks anxiously towards Ron, who lies unconscious. The winning position is moved into by Harry, and he confidently looks up at the white king, whose huge sword falls from his hands and lies on the marble floor at Harry's feet. Ron is run to by him and Hermione, and they kneel beside him. Harry gets to his feet, and still kneeling beside Ron, Hermione watches him go. A flight of white dimly lit stone steps is cautiously walked down by Harry outside the chess room. As the stairs are descended by him, the scar on his forehead is touched by him, and a figure wearing a turban is seen looking into the Mirror of Erised, Professor Quirrell. Harry's scar is touched as Quirrell stares into it and stretches out his hand, drawing Harry reluctantly towards him. The Mirror of Erised is looked into by Harry, and he stares at his reflection, which stares back at him, then its hand is put in its pocket, a red stone is taken out, a wink is given at Harry, the stone is shown to him, and it is put back in its pocket. Secretly, his own pocket is felt by Harry, and something is found there by him. Quirrell looks impatient as Harry backs away, and Harry stands with his back to the mirror, while the turban is unwound from Quirrell's head."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "They sheath their swords and join the black chess pieces. Ron climbs onto the black knight's stone horse and watches as a white pawn advances. Hermione anxiously follows Ron's instructions, and a black pawn is taken by the white pawn. The game begins; a white bishop and knight explode, and a black pawn is destroyed. The white queen attacks a black castle, which collapses in rubble. Ron contemplates his next move, and Harry understands Ron's strategy, nodding. Ron clutches the reins, closes his eyes, and the black horse moves across the board. Ron nervously eyes the white king, who wields a powerful sword. The white queen advances toward Ron's horse, and he clings to the reins, trembling. The queen stabs the horse, causing Ron to fall. Hermione steps back onto her square, looking anxiously at unconscious Ron. Harry moves into the winning position, and the white king's sword falls at Harry's feet. He and Hermione rush to Ron. Harry stands, and Hermione watches him go. Outside, Harry cautiously descends white stone steps, touching his scar. He sees Professor Quirrell in the Mirror of Erised. Harry touches his scar as Quirrell draws him toward the mirror. Harry's reflection shows him a red stone, winks, and hides it. Harry secretly finds something in his pocket. Quirrell looks impatient as Harry backs away, and Quirrell unwinds his turban."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "They sheath their swords and join the black chess pieces. Ron climbs onto the black knight's stone horse, observing as a white pawn advances. Hermione anxiously follows Ron's instructions, and a black pawn is defeated by the white pawn. The game begins; a white bishop and knight explode, and a black pawn is destroyed. The white queen attacks a black castle, which collapses. Ron contemplates his move, and Harry understands Ron's strategy, nodding. Ron clutches the reins, closes his eyes, and the black horse moves across the board. Ron nervously watches the white king, who wields a sword. The white queen approaches Ron's horse, causing him to fall. Hermione steps back, looking anxiously at unconscious Ron. Harry moves into the winning position, and the white king drops his sword. Harry and Hermione rush to Ron. Harry leaves, descending dimly lit steps, touching his scar. He sees Professor Quirrell in the Mirror of Erised. Harry's reflection shows him a red stone. Secretly, Harry finds something in his pocket. Quirrell unwinds his turban impatiently as Harry backs away."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "They carefully sheath their swords and proceed to join the ranks of the black chess pieces. Ron, with determination, climbs onto the stone horse of the black knight and surveys the board intently as a white pawn autonomously advances forward. Hermione, filled with anxiety, looks at Ron, and following Ron's precise instructions, a black pawn advances forward only to be swiftly sliced off by the white pawn. The intense game begins in earnest; a white bishop erupts in an explosion, a white knight meets its end, and a black pawn is obliterated. A white bishop and a white knight both explode, and the white queen launches an attack on a black castle, which bursts into a shower of stone fragments and collapses into a pile of rubble. The queen turns with a sense of triumph. Ron, deep in thought, contemplates his next strategic move, and as he watches the relentless white queen, Harry suddenly grasps the game that Ron is orchestrating and nods in understanding. Taking a deep, steadying breath, Ron grips the horse's reins tightly, closes his eyes, and the black horse begins to move across the board, navigating through the remains of the shattered stone chess pieces. Ron casts a nervous glance at the white king, who is adorned with a silver helmet and holds a powerful sword in his hands, which are encased in metal armor. Ron braces himself as the white queen slowly turns and moves steadily across the board, heading directly towards Ron's black horse. He clings to the reins, trembling with fear, as the queen draws nearer and nearer, gliding effortlessly over the smooth marble floor. She strikes the black horse with precision, causing Ron to fall off, and the horse crashes to the ground beside him. Hermione quickly steps back onto her square and looks anxiously towards Ron, who is lying unconscious on the floor. Harry moves into the winning position and confidently gazes up at the white king, whose enormous sword slips from his grasp and lands on the marble floor at Harry's feet. He and Hermione rush to Ron's side and kneel beside him. Harry rises to his feet, and still kneeling beside Ron, Hermione watches him as he departs. Outside the chess room, Harry cautiously makes his way down a flight of white, dimly lit stone steps. As he descends the stairs, he touches the scar on his forehead and sees a figure wearing a turban gazing into the Mirror of Erised, Professor Quirrell. Harry touches his scar again as Quirrell stares into the mirror and extends his hand, drawing Harry reluctantly towards him. Harry looks into the Mirror of Erised and observes his reflection, which gazes back at him, then reaches into its pocket, retrieves a red stone, winks at Harry, shows him the stone, and returns it to its pocket. Secretly, Harry feels in his own pocket and discovers something there. Quirrell appears impatient as Harry backs away, standing with his back to the mirror, and Quirrell begins to unwind the turban from his head."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "They carefully sheath their gleaming swords with deliberate precision and proceed to join the ranks of the formidable black chess pieces. Ron, filled with unwavering determination, clambers onto the stone horse representing the black knight and surveys the entire chessboard with a focused and intense gaze, while a white pawn makes an autonomous advance forward. Hermione, who is filled with a palpable sense of anxiety, looks towards Ron. Following Ron's precise and calculated instructions, a black pawn advances forward only to be swiftly and efficiently sliced off by the advancing white pawn. The intense game truly begins in earnest; chaos ensues as a white bishop erupts in a sudden explosion, a white knight meets its untimely end, and a black pawn is completely obliterated. In this fierce battle, both a white bishop and a white knight explode, and the white queen launches an aggressive attack on a black castle, resulting in the castle bursting into a dramatic shower of stone fragments, collapsing into a heap of rubble. The queen turns triumphantly, exuding a sense of victory. Meanwhile, Ron, deep in thought and contemplation, considers his next strategic move, watching the relentless and menacing white queen. Suddenly, Harry grasps the complex game plan that Ron is orchestrating and nods in understanding. Taking a deep, steadying breath, Ron grips the horse's reins tightly, closes his eyes, and the black horse begins to move determinedly across the board, navigating through the scattered remains of the shattered stone chess pieces. Ron casts a nervous glance at the white king, who is adorned with a gleaming silver helmet and clutches a powerful sword in his hands, which are encased in cold, metal armor. Ron braces himself as the white queen slowly turns and moves steadily across the board, advancing directly towards Ron's black horse. Ron clings to the reins, trembling with fear, as the queen draws ever nearer, gliding effortlessly over the smooth, polished marble floor. She strikes the black horse with precision and force, causing Ron to fall off, and the horse crashes to the ground beside him. Hermione quickly retreats and steps back onto her designated square, looking anxiously towards Ron, who is now lying unconscious on the floor. Harry moves assertively into the winning position and confidently gazes up at the white king, whose enormous sword slips from his grasp and lands with a clang on the marble floor at Harry's feet. He and Hermione rush to Ron's side, kneeling protectively beside him. Harry rises to his feet, and while Hermione remains kneeling beside Ron, she watches him as he departs the room. Outside the chess room, Harry cautiously makes his way down a flight of white, dimly lit stone steps. As he carefully descends the stairs, he instinctively touches the scar on his forehead and sees a mysterious figure wearing a turban intensely gazing into the Mirror of Erised, revealing it to be Professor Quirrell. Harry touches his scar again for reassurance as Quirrell stares intently into the mirror and steadily extends his hand, drawing Harry reluctantly towards him. Harry looks deep into the Mirror of Erised and observes his own reflection, which gazes back confidently at him, then reaches into its pocket, retrieves a red stone, winks at Harry, shows him the stone, and deftly returns it to its pocket. Secretly, Harry feels inside his own pocket and is surprised to discover something mysterious there. Quirrell appears increasingly impatient as Harry cautiously backs away, standing with his back firmly against the mirror, while Quirrell begins to unwind the turban from his head, revealing his true intentions."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "They carefully slide their swords back into their sheaths, ensuring the blades are secure, and then move to join the ranks of the black chess pieces, blending into the strategic formation. Ron, with determination, climbs onto the stone horse of the black knight, positioning himself securely on its back, and casts his gaze across the expansive chessboard, observing as a white pawn autonomously advances forward. Hermione, filled with concern, glances at Ron with anxiety etched on her face, and following Ron's precise instructions, a black pawn advances forward, only to be swiftly sliced off by the white pawn, marking the beginning of the intense game. The match intensifies as a white bishop is obliterated in a sudden explosion, a white knight is knocked to the ground, and a black pawn meets its end. The chaos continues as another white bishop and a white knight are destroyed in explosive fashion, and the white queen launches a fierce attack on a black castle, resulting in a dramatic explosion of stone fragments that rain down as the castle collapses into a heap of rubble. The queen turns with a sense of triumph, surveying the board. Ron, deep in thought, contemplates his next strategic move, and as he watches the relentless white queen, Harry suddenly grasps the strategy Ron is employing and gives a nod of understanding. With a deep, steadying breath, Ron grips the reins of the horse tightly, closes his eyes to focus, and the black horse begins to move purposefully across the board, navigating through the debris of shattered stone chess pieces. Ron casts a nervous glance at the imposing white king, who stands with a silver helmet on his head, gripping a powerful sword with hands encased in gleaming metal armor. Bracing himself for the impending confrontation, Ron watches as the white queen slowly pivots and advances steadily across the board, her path set directly towards Ron's black horse. As she draws nearer, Ron clings to the reins, his body trembling with fear, while the queen glides effortlessly over the smooth marble floor. In a swift, decisive motion, she stabs the black horse, causing Ron to be thrown off, and the horse crashes heavily to the ground beside him. Hermione, reacting quickly, steps back onto her designated square, her eyes filled with worry as she looks towards Ron, who now lies unconscious on the board. Seizing the opportunity, Harry moves into the winning position, his confidence evident as he looks up at the white king, who, in a moment of defeat, lets his massive sword slip from his grasp, the weapon clattering onto the marble floor at Harry's feet. Harry and Hermione rush to Ron's side, kneeling beside him with concern. Harry then rises to his feet, and as he does, Hermione remains kneeling, her eyes following Harry as he departs. Exiting the chess room, Harry proceeds cautiously down a flight of white, dimly lit stone steps, each step echoing softly in the quiet. As he descends, he instinctively touches the scar on his forehead, a familiar sensation that coincides with the vision of a figure wearing a turban, Professor Quirrell, who is intently gazing into the Mirror of Erised. Harry's hand remains on his scar as Quirrell's eyes remain fixed on the mirror, and Quirrell extends his hand, compelling Harry to approach him, albeit reluctantly. Harry steps closer to the Mirror of Erised, his eyes locking onto his reflection, which mirrors his gaze. The reflection then reaches into its pocket, retrieves a red stone, winks at Harry, and discreetly returns the stone to its pocket. Feeling a surge of curiosity, Harry subtly checks his own pocket and discovers something hidden within. Meanwhile, Quirrell grows impatient, his demeanor tense as Harry cautiously backs away, positioning himself with his back to the mirror. In a dramatic reveal, Quirrell begins to unwind the turban from his head, the fabric slowly unraveling to expose what lies beneath."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "They sheath their swords and join the black chess pieces. Ron mounts the stone horse of the black knight, surveying the board as a white pawn advances. Following Ron's instructions, a black pawn moves forward and is taken by the white pawn. The game intensifies with pieces exploding and being destroyed, culminating in the white queen attacking and demolishing a black castle. As Ron strategizes, Harry grasps Ron's plan and nods in understanding. Ron, bracing himself, guides the black horse across the board amidst the debris. The white queen advances towards Ron, who clings to the reins in fear. She strikes the black horse, causing Ron to fall and the horse to crash beside him. Hermione quickly returns to her square, anxiously watching Ron, who lies unconscious. Harry seizes the opportunity to move into the winning position, prompting the white king to drop his sword at Harry's feet. Harry and Hermione rush to Ron's side. Harry then cautiously descends a dimly lit staircase, touching his scar as he sees Professor Quirrell, wearing a turban, gazing into the Mirror of Erised. As Quirrell reaches out, Harry is drawn towards him and sees his reflection in the mirror, which reveals a red stone. Secretly, Harry discovers the stone in his own pocket. Quirrell, growing impatient, unwinds his turban as Harry backs away from the mirror."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "They sheath their swords, symbols of both medieval warfare and strategic gamesmanship, and join the black chess pieces resembling those in the ancient game of strategy that dates back over a thousand years. Ron climbs onto the stone horse of the black knight, a formidable piece known for its unique movement in the game, and looks across the board as a white pawn, representing the common foot soldier in chess, moves itself forward. Hermione looks at Ron anxiously, and obeying Ron's instructions, a black pawn moves forward and is sliced off by the white pawn, emphasizing the pawn's role in initiating conflict. The game gets underway; a white bishop, a piece that represents the church's influence in medieval society, explodes, a white knight hits the dust, which signifies a cavalry piece's downfall, and a black pawn is destroyed. A white bishop and a white knight explode, illustrating the intensity of the battle, and the white queen, the most powerful piece on the board, attacks a black castle, also known as a rook, which explodes in a shower of stone fragments and collapses in a pile of rubble. The queen turns triumphantly, showcasing her dominance on the board. Ron contemplates his next move, and watching the merciless white queen, Harry suddenly understands the game that Ron is playing and nods. Taking a deep breath, Ron clutches the reins of the knight, which medieval knights used to direct their horses, closes his eyes, and the black horse starts to move across the board between the remains of the shattered stone chess pieces. Ron looks nervously at the white king, who wears a silver helmet reminiscent of the crowns worn by monarchs of old, clasping a powerful sword with his hands encased in metal armor, a symbol of royal authority and military power. Ron braces himself as the white queen slowly turns and moves steadily across the board, heading straight towards Ron's black horse. He clings onto the reins, shaking with fear, as the queen gets closer and closer, gliding over the smooth marble floor, reminiscent of the ancient game boards of old. She stabs the black horse, causing Ron to fall off, and the horse crashes beside him. Hermione steps hurriedly back onto her square and looks anxiously towards Ron, who is lying unconscious. Harry moves into the winning position and confidently looks up at the white king, whose huge sword falls from his hands and lies on the marble floor at Harry's feet, symbolizing the king's capture. He and Hermione run to Ron and kneel beside him. Harry gets to his feet, and still kneeling beside Ron, Hermione watches him go. Outside the chess room, Harry walks cautiously down a flight of white dimly lit stone steps, evoking the mysterious and ancient feel of a castle. As he descends the stairs, he touches the scar on his forehead, a mark left by a powerful curse, and sees a figure wearing a turban looking into the Mirror of Erised, a magical object that reveals the deepest desires of one's heart, which is being scrutinized by Professor Quirrell. Harry touches his scar as Quirrell stares into it and stretches out his hand, drawing Harry reluctantly towards him, emphasizing the ominous connection between them. Harry looks into the Mirror of Erised and stares at his reflection, which stares back at him, then puts its hand in its pocket, takes out a red stone, the Philosopher's Stone, known for its legendary ability to grant immortality, winks at Harry, shows him the stone, and puts it back in its pocket. Secretly, Harry feels in his own pocket and finds something there. Quirrell looks impatient as Harry backs away, standing with his back to the mirror, and Quirrell unwinds the turban from his head, revealing a hidden and sinister secret underneath."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "They sheath their swords and join the black chess pieces  Ron climbs onto the stone horse of the black knight and looks across the board as a white pawn moves itself forward  Hermione looks at Ron anxiously and obeying Ron's instructions  Taking a deep breath Ron clutches the horse's reins closes his eyes and the black horse starts to move across the board between the remains of the shattered stone chess pieces  Ron looks nervously at the white king who wears a silver helmet clasping a powerful sword with his hands encased in metal armor  Ron braces himself as the white queen slowly turns and moves steadily across the board heading straight towards Ron's black horse  He clings onto the reins shaking with fear as the queen gets closer and closer gliding over the smooth marble floor  She stabs the black horse causing Ron to fall off and the horse crashes beside him  Hermione steps hurriedly back onto her square and looks anxiously towards Ron who is lying unconscious  Harry moves into the winning position and confidently looks up at the white king whose huge sword falls from his hands and lies on the marble floor at Harry's feet  He and Hermione run to Ron and kneel beside him  Harry gets to his feet and still kneeling beside Ron  Hermione watches him go Outside the chess room  Harry walks cautiously down  a flight of white dimly lit stone steps  As he descends the stairs he touches the scar on his forehead and sees a figure wearing a turban looking into the Mirror of Erised Professor Quirrell  Harry touches his scar as Quirrell stares into it and stretches out his hand drawing Harry reluctantly towards him  Harry looks into the Mirror of Erised and stares at his reflection which stares back at him  a black pawn moves forward and is sliced off by the white pawn  The game gets underway  a white bishop explodes a white knight hits the dust and a black pawn is destroyed  A white bishop and a white knight explode and the white queen attacks a black castle which explodes in a shower of stone fragments and collapses in a pile of rubble  The queen turns triumphantly  Ron contemplates his next move and watching the merciless white queen  Harry suddenly understands the game that Ron is playing and nods  Taking a deep breath Ron clutches the horse's reins closes his eyes and the black horse starts to move across the board between the remains of the shattered stone chess pieces  Ron looks nervously at the white king who wears a silver helmet clasping a powerful sword with his hands encased in metal armor  Ron braces himself as the white queen slowly turns and moves steadily across the board heading straight towards Ron's black horse  He clings onto the reins shaking with fear as the queen gets closer and closer gliding over the smooth marble floor  She stabs the black horse causing Ron to fall off and the horse crashes beside him  Hermione steps hurriedly back onto her square and looks anxiously towards Ron who is lying unconscious  Harry moves into the winning position and confidently looks up at the white king whose huge sword falls from his hands and lies on the marble floor at Harry's feet  He and Hermione run to Ron and kneel beside him  Harry gets to his feet and still kneeling beside Ron  Hermione watches him go Outside the chess room  Harry walks cautiously down  a flight of white dimly lit stone steps  As he descends the stairs he touches the scar on his forehead and sees a figure wearing a turban looking into the Mirror of Erised Professor Quirrell  Harry touches his scar as Quirrell stares into it and stretches out his hand drawing Harry reluctantly towards him  Harry looks into the Mirror of Erised and stares at his reflection which stares back at him  then puts its hand in its pocket takes out a red stone winks at  Harry shows him the stone and puts it back in its pocket  Secretly Harry feels in his own pocket and finds something there  Quirrell looks impatient as Harry backs away standing with his back to the mirror and Quirrell unwinds the turban from his head"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "They sheath their swords and join the black chess pieces. Ron climbs onto the stone horse of the black knight and looks across the board as a white pawn moves itself forward. Hermione looks at Ron anxiously and obeying Ron's instructions. a black pawn moves forward and is sliced off by the white pawn. The game gets underway. a white bishop explodes a white knight hits the dust and a black pawn is destroyed. A white bishop and a white knight explode and the white queen attacks a black castle which explodes in a shower of stone fragments and collapses in a pile of rubble. The queen turns triumphantly. Ron contemplates his next move and watching the merciless white queen. Harry suddenly understands the game that Ron is playing and nods. Taking a deep breath Ron clutches the horse's reins closes his eyes and the black horse starts to move across the board between the remains of the shattered stone chess pieces. Ron looks nervously at the white king who wears a silver helmet clasping a powerful sword with his hands encased in metal armor. Ron braces himself as the white queen slowly turns and moves steadily across the board heading straight towards Ron's black horse. He clings onto the reins shaking with fear as the queen gets closer and closer gliding over the smooth marble floor. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. She stabs the black horse causing Ron to fall off and the horse crashes beside him. Hermione steps hurriedly back onto her square and looks anxiously towards Ron who is lying unconscious. Harry moves into the winning position and confidently looks up at the white king whose huge sword falls from his hands and lies on the marble floor at Harry's feet. He and Hermione run to Ron and kneel beside him. Harry gets to his feet and still kneeling beside Ron. Hermione watches him go Outside the chess room. Harry walks cautiously down. a flight of white dimly lit stone steps. As he descends the stairs he touches the scar on his forehead and sees a figure wearing a turban looking into the Mirror of Erised Professor Quirrell. Harry touches his scar as Quirrell stares into it and stretches out his hand drawing Harry reluctantly towards him. Harry looks into the Mirror of Erised and stares at his reflection which stares back at him. then puts its hand in its pocket takes out a red stone winks at. Harry shows him the stone and puts it back in its pocket. Secretly Harry feels in his own pocket and finds something there. Quirrell looks impatient as Harry backs away standing with his back to the mirror and Quirrell unwinds the turban from his head."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "They sheath their swords and join the black chess pieces. Ron climbs onto the stone horse of the black knight and looks across the board as a white pawn moves itself forward. Hermione looks at Ron anxiously and obeying Ron's instructions. a black pawn moves forward and is sliced off by the white pawn. The game gets underway. a white bishop explodes a white knight hits the dust and a black pawn is destroyed. A white bishop and a white knight explode and the white queen attacks a black castle which explodes in a shower of stone fragments and collapses in a pile of rubble. The queen turns triumphantly. Ron contemplates his next move and watching the merciless white queen. Harry suddenly understands the game that Ron is playing and nods. Taking a deep breath Ron clutches the horse's reins closes his eyes and the black horse starts to move across the board between the remains of the shattered stone chess pieces. Ron looks nervously at the white king who wears a silver helmet clasping a powerful sword with his hands encased in metal armor. Ron braces himself as the white queen slowly turns and moves steadily across the board heading straight towards Ron's black horse. He clings onto the reins shaking with fear as the queen gets closer and closer gliding over the smooth marble floor. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. She stabs the black horse causing Ron to fall off and the horse crashes beside him. Hermione steps hurriedly back onto her square and looks anxiously towards Ron who is lying unconscious. Harry moves into the winning position and confidently looks up at the white king whose huge sword falls from his hands and lies on the marble floor at Harry's feet. He and Hermione run to Ron and kneel beside him. Harry gets to his feet and still kneeling beside Ron. Hermione watches him go Outside the chess room. Harry walks cautiously down. a flight of white dimly lit stone steps. As he descends the stairs he touches the scar on his forehead and sees a figure wearing a turban looking into the Mirror of Erised Professor Quirrell. Harry touches his scar as Quirrell stares into it and stretches out his hand drawing Harry reluctantly towards him. Harry looks into the Mirror of Erised and stares at his reflection which stares back at him. then puts its hand in its pocket takes out a red stone winks at. Harry shows him the stone and puts it back in its pocket. Secretly Harry feels in his own pocket and finds something there. Quirrell looks impatient as Harry backs away standing with his back to the mirror and Quirrell unwinds the turban from his head."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "They sheath their swords and join the black chess pieces. Ron climbs onto the stone horse of the black knight and looks across the board as a white pawn moves itself forward. Hermione looks at Ron anxiously and obeying Ron's instructions. a black pawn moves forward and is sliced off by the white pawn. The game gets underway. a white bishop explodes a white knight hits the dust and a black pawn is destroyed. A white bishop and a white knight explode and the white queen attacks a black castle which explodes in a shower of stone fragments and collapses in a pile of rubble. a flight of white dimly lit stone steps. As he descends the stairs he touches the scar on his forehead and sees a figure wearing a turban looking into the Mirror of Erised Professor Quirrell. Harry touches his scar as Quirrell stares into it and stretches out his hand drawing Harry reluctantly towards him. Harry looks into the Mirror of Erised and stares at his reflection which stares back at him. then puts its hand in its pocket takes out a red stone winks at. Harry shows him the stone and puts it back in its pocket. Secretly Harry feels in his own pocket and finds something there. Quirrell looks impatient as Harry backs away standing with his back to the mirror and Quirrell unwinds the turban from his head."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "They sheath their swords and join the black chess pieces. Ron climbs onto the stone horse of the black knight and looks across the board as a white pawn moves itself forward. Hermione looks at Ron anxiously and obeying Ron's instructions. Harry shows him the stone and puts it back in its pocket. Secretly Harry feels in his own pocket and finds something there. Quirrell looks impatient as Harry backs away standing with his back to the mirror and Quirrell unwinds the turban from his head."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The elephants sheath their swords and join the black chess pieces. The dragon climbs onto the stone horse of the black knight and looks across the board as a white pawn moves itself forward. The unicorn looks at the dragon anxiously, and obeying the dragon's instructions, a black pawn moves forward and is sliced off by the white pawn. The game gets underway; a white bishop explodes, a white knight hits the dust, and a black pawn is destroyed. A white bishop and a white knight explode, and the white queen attacks a black castle, which explodes in a shower of stone fragments and collapses in a pile of rubble. The queen turns triumphantly. The dragon contemplates its next move, and watching the merciless white queen, the phoenix suddenly understands the game that the dragon is playing and nods. Taking a deep breath, the dragon clutches the horse's reins, closes its eyes, and the black horse starts to move across the board between the remains of the shattered stone chess pieces. The dragon looks nervously at the white king, who wears a silver helmet, clasping a powerful sword with his hands encased in metal armor. The dragon braces itself as the white queen slowly turns and moves steadily across the board, heading straight towards the dragon's black horse. It clings onto the reins, shaking with fear, as the queen gets closer and closer, gliding over the smooth marble floor. She stabs the black horse, causing the dragon to fall off, and the horse crashes beside it. The unicorn steps hurriedly back onto her square and looks anxiously towards the dragon, who is lying unconscious. The phoenix moves into the winning position and confidently looks up at the white king, whose huge sword falls from his hands and lies on the marble floor at the phoenix's feet. It and the unicorn run to the dragon and kneel beside it. The phoenix gets to its feet, and still kneeling beside the dragon, the unicorn watches it go. Outside the chess room, the phoenix walks cautiously down a flight of white dimly lit stone steps. As it descends the stairs, it touches the scar on its forehead and sees a figure wearing a turban looking into the Mirror of Erised, Professor Quirrell. The phoenix touches its scar as Quirrell stares into it and stretches out his hand, drawing the phoenix reluctantly towards him. The phoenix looks into the Mirror of Erised and stares at its reflection, which stares back at it, then puts its hand in its pocket, takes out a red stone, winks at the phoenix, shows it the stone, and puts it back in its pocket. Secretly, the phoenix feels in its own pocket and finds something there. Quirrell looks impatient as the phoenix backs away, standing with its back to the mirror, and Quirrell unwinds the turban from his head."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "They sheath their umbrellas and join the black domino pieces. Ron climbs onto the metal dolphin of the black rook and looks across the board as a white die moves itself forward. Hermione looks at Ron anxiously, and obeying Ron's instructions, a black marble moves forward and is sliced off by the white die. The game gets underway; a white rook explodes, a white bishop hits the dust, and a black marble is destroyed. A white rook and a white bishop explode, and the white empress attacks a black tower, which explodes in a shower of glass fragments and collapses in a pile of rubble. The empress turns triumphantly. Ron contemplates his next move, and watching the merciless white empress, Harry suddenly understands the game that Ron is playing and nods. Taking a deep breath, Ron clutches the dolphin's reins, closes his eyes, and the black dolphin starts to move across the board between the remains of the shattered metal domino pieces. Ron looks nervously at the white emperor, who wears a silver crown, clasping a powerful lance with his hands encased in golden armor. Ron braces himself as the white empress slowly turns and moves steadily across the board, heading straight towards Ron's black dolphin. He clings onto the reins, shaking with fear, as the empress gets closer and closer, gliding over the smooth granite floor. She stabs the black dolphin, causing Ron to fall off, and the dolphin crashes beside him. Hermione steps hurriedly back onto her hexagon and looks anxiously towards Ron, who is lying unconscious. Harry moves into the winning position and confidently looks up at the white emperor, whose huge lance falls from his hands and lies on the granite floor at Harry's feet. He and Hermione run to Ron and kneel beside him. Harry gets to his feet, and still kneeling beside Ron, Hermione watches him go. Outside the domino room, Harry walks cautiously down a flight of white dimly lit granite stairs. As he descends the stairs, he touches the tattoo on his forehead and sees a figure wearing a fedora looking into the Window of Shards, Professor Quirrell. Harry touches his tattoo as Quirrell stares into it and stretches out his hand, drawing Harry reluctantly towards him. Harry looks into the Window of Shards and stares at his reflection, which stares back at him, then puts its hand in its pocket, takes out a blue gem, winks at Harry, shows him the gem, and puts it back in its pocket. Secretly, Harry feels in his own pocket and finds something there. Quirrell looks impatient as Harry backs away, standing with his back to the window, and Quirrell removes the fedora from his head."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "They conceal their swords and blend with the black chess pieces. Ron hops onto the stone horse of the black knight and gazes across the board as a white pawn lifts itself upward. Hermione observes Ron anxiously, and following Ron's instructions, a black pawn advances hesitantly and is flattened by the white pawn. The game progresses; a white bishop vanishes, a white knight crumbles, and a black pawn disintegrates. A white bishop and a white knight shatter, and the white queen strikes a black castle, which vanishes in a burst of stone fragments and settles in a pile of rubble. The queen turns victoriously. Ron ponders his next move and, contemplating the relentless white queen, Harry suddenly perceives the game that Ron is orchestrating and nods. Inhaling deeply, Ron grips the horse's reins, shuts his eyes, and the black horse begins to glide across the board amid the debris of the fragmented stone chess pieces. Ron glances nervously at the white king, who wears a silver helmet, grasping a mighty sword with his hands enveloped in metal armor. Ron steadies himself as the white queen slowly pivots and moves deliberately across the board, advancing straight toward Ron's black horse. He grips the reins tightly, trembling with anxiety, as the queen draws nearer and nearer, gliding across the smooth marble floor. She pierces the black horse, causing Ron to tumble off, and the horse collapses beside him. Hermione steps briskly back onto her square and looks worriedly toward Ron, who is lying motionless. Harry steps into the triumphant position and confidently gazes up at the white king, whose colossal sword slips from his hands and rests on the marble floor at Harry's feet. He and Hermione dash to Ron and kneel beside him. Harry rises, and still kneeling beside Ron, Hermione observes him depart. Outside the chess room, Harry creeps cautiously down a flight of white dimly lit stone steps. As he descends the stairs, he brushes the scar on his forehead and observes a figure wearing a turban gazing into the Mirror of Erised, Professor Quirrell. Harry brushes his scar as Quirrell peers into it and extends his hand, drawing Harry unwillingly towards him. Harry gazes into the Mirror of Erised and regards his reflection, which regards him back, then slips its hand into its pocket, retrieves a red stone, winks at Harry, displays the stone, and returns it to its pocket. Secretly, Harry explores his own pocket and discovers something there. Quirrell appears impatient as Harry retreats, standing with his back to the mirror, and Quirrell unwraps the turban from his head."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "They cloak their shields and join the silver checkers. Molly climbs onto the marble cat of the silver rook and gazes across the field as a gray chip slides itself ahead. Elaine looks at Molly uneasily, and following Molly's guidance, a silver chip advances and is chopped off by the gray chip. The match takes off; a gray minister bursts, a gray rook bites the dirt, and a silver chip is shattered. A gray minister and a gray rook burst, and the gray queen assaults a silver tower, which bursts in a cascade of bronze splinters and collapses in a heap of debris. The queen spins victoriously. Molly considers her following step, and eyeing the ruthless gray queen, Sam suddenly grasps the match that Molly is engaging in and nods. Drawing a hefty breath, Molly grabs the cat's bridle, shuts her eyes, and the silver cat begins to glide across the field amid the fragments of the demolished marble checkers. Molly glances nervously at the gray monarch, who wears a bronze crown, gripping a mighty lance with his fingers encased in steel gloves. Molly girds herself as the gray queen gradually swivels and strides steadily across the field, advancing directly toward Molly's silver cat. She grips onto the bridle, quivering with dread, as the queen approaches closer and closer, sliding over the sleek granite floor. She pierces the silver cat, causing Molly to tumble off, and the cat smashes beside her. Elaine steps swiftly back onto her square and gazes worriedly towards Molly, who is lying insensible. Sam shifts into the winning spot and boldly gazes up at the gray monarch, whose enormous lance topples from his fingers and lies on the granite floor at Sam's toes. She and Elaine dash to Molly and kneel by her. Sam rises to his toes, and still kneeling by Molly, Elaine observes her depart. Beyond the checkers chamber, Sam ambles warily down a series of gray dimly lit marble ladders. While descending the steps, she touches the scar on her cheek and perceives a figure wearing a hat peering into the Panel of Destiny, Instructor Cork. Sam touches her scar as Cork peers into it and extends her fingers, pulling Sam unwillingly near her. Sam peers into the Panel of Destiny and gazes at her duplicate, which gazes back at her, then places its fingers in its satchel, withdraws a blue gem, blinks at Sam, displays her the gem, and places it back in its satchel. Covertly, Sam feels in her own satchel and discovers something there. Cork appears restless as Sam retreats, standing with her spine to the panel, and Cork unwraps the hat from her head."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "They pack their instruments and ally with the gray checkers. Ralph ascends onto the wooden donkey of the gray archer and glances over the board as a white rook dances itself forward. Beatrice gazes at Ralph worriedly, and following Ralph's guidance, a gray rook advances forward and is devoured by the white rook. The match commences; a white rook evaporates, a white knight crumbles, and a gray rook is annihilated. A white rook and a white knight disintegrate, and the white monarch charges a gray tower, which bursts in a shower of timber shards and collapses into a heap of debris. The monarch pivots victoriously. Ralph ponders his subsequent maneuver, and observing the relentless white monarch, Hugh suddenly perceives the strategy that Ralph is executing and winks. Inhaling deeply, Ralph grasps the donkey's bridle, shuts his eyes, and the gray donkey begins to trot across the board amidst the remains of the fragmented wooden checkers. Ralph peers nervously at the white emperor, who dons a golden diadem, gripping a formidable lance with his arms encased in steel armor. Ralph steadies himself as the white monarch gradually rotates and ambles steadily across the board, advancing directly towards Ralph's gray donkey. He grasps the bridle, trembling with dread, as the monarch approaches nearer and nearer, gliding across the polished marble surface. It thrusts at the gray donkey, causing Ralph to topple off, and the donkey tumbles beside him. Beatrice retreats hastily back onto her square and gazes worriedly towards Ralph, who is sprawled unconscious. Hugh strides into the victorious spot and confidently gazes up at the white emperor, whose enormous lance slips from his grip and lies on the marble surface at Hugh's feet. He and Beatrice rush to Ralph and crouch beside him. Hugh rises, and still kneeling beside Ralph, Beatrice observes him depart. Outside the checker room, Hugh ambles warily down a series of white softly lit stone stairs. As he descends the stairs, he touches the mark on his temple and sees a silhouette wearing a headdress gazing into the Mirror of Reflections, Tutor Quigley. Hugh touches his mark as Quigley peers into it and stretches out his arm, drawing Hugh hesitantly towards him. Hugh gazes into the Mirror of Reflections and examines his likeness, which regards him back, then places its hand in its pocket, retrieves a crimson gem, blinks at Hugh, displays the gem, and returns it to its pocket. Secretly, Hugh feels in his own pocket and discovers something there. Quigley appears irritated as Hugh retreats, standing with his back to the mirror, and Quigley removes the headdress from his crown."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "They holster their umbrellas and join the red dominos. Ron climbs onto the wooden giraffe of the red bishop and peers across the field as a blue marble slides itself sideways. Hermione looks at Ron nervously, and following Ron's suggestions, a red marble rolls sideways and is swept away by the blue marble. The activity gets underway; a blue rook disintegrates, a blue bishop bites the dirt, and a red marble is obliterated. A blue rook and a blue bishop disintegrate, and the blue monarch assaults a red palace, which disintegrates in a cascade of wooden splinters and collapses in a heap of debris. The monarch spins victoriously. Ron ponders his next tactic, and observing the relentless blue monarch, Harry suddenly grasps the strategy that Ron is executing and nods. Taking a deep breath, Ron grips the giraffe's mane, closes his eyes, and the red giraffe starts to slide across the field amidst the remnants of the broken wooden dominos. Ron glances anxiously at the blue emperor, who wears a golden mask, grasping a fierce lance with his hands wrapped in leather gloves. Ron steadies himself as the blue monarch slowly rotates and drifts steadily across the field, gliding directly toward Ron's red giraffe. He clutches the mane tightly, trembling with apprehension, as the monarch draws nearer and nearer, gliding over the smooth granite surface. She pierces the red giraffe, causing Ron to tumble off, and the giraffe collapses beside him. Hermione steps rapidly back onto her rectangle and gazes anxiously at Ron, who is lying unconscious. Harry slides into the victorious slot and confidently gazes up at the blue emperor, whose enormous lance slips from his grasp and rests on the granite surface at Harry's feet. He and Hermione rush to Ron and kneel beside him. Harry rises to his feet, and still kneeling next to Ron, Hermione watches him depart. Beyond the domino chamber, Harry tiptoes cautiously down a series of white dimly lit marble steps. As he descends the steps, he grazes the scar on his cheek and spots a figure wearing a headscarf gazing into the Window of Enigma, Professor Quirrell. Harry grazes his scar as Quirrell gazes into it and stretches out his hand, drawing Harry unwillingly towards him. Harry gazes into the Window of Enigma and looks at his reflection, which looks back at him, then places its hand in its coat, pulls out a blue crystal, winks at Harry, shows him the crystal, and puts it back in its coat. Secretly, Harry feels in his own coat and discovers something there. Quirrell looks impatient as Harry retreats, standing with his back to the window, and Quirrell unwraps the headscarf from his head."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "They lower their shields and join the green dominoes. Max ascends onto the plastic camel of the green cavalry and gazes across the field as a red token slides forward. Lucy glances at Max nervously, and following Max's guidance, a green token slides forward and is swept away by the red token. The match begins; a red rook implodes, a red dragon crashes, and a green token is eliminated. A red rook and a red dragon implode, and the red monarch assaults a green tower, which crumbles in a cascade of clay bits and disintegrates into a heap of debris. The monarch spins victoriously. Max ponders his upcoming maneuver, and observing the relentless red monarch, Sam abruptly grasps the strategy that Max is utilizing and nods. Drawing a deep breath, Max grips the camel's reins, shuts his eyes, and the green camel begins to glide across the field amidst the remnants of the demolished plastic dominoes. Max peers anxiously at the red emperor, who dons a golden crown, holding a mighty spear with his paws sheathed in bronze gauntlets. Max steels himself as the red monarch gradually pivots and slides smoothly across the field, advancing directly towards Max's green camel. He clutches the reins, trembling with dread, as the monarch advances nearer and nearer, skimming over the sleek granite ground. She pierces the green camel, causing Max to topple off, and the camel tumbles beside him. Lucy retreats hastily into her spot and peers worriedly at Max, who lies motionless. Sam steps into the victorious spot and boldly gazes at the red emperor, whose massive spear tumbles from his paws and rests on the granite ground at Sam's feet. He and Lucy dash to Max and crouch beside him. Sam rises, and still crouching beside Max, Lucy observes him depart. Outside the domino chamber, Sam ambles cautiously down a path of red softly lit concrete steps. As he descends the path, he grazes the mark on his chin and notices a silhouette wearing a bonnet contemplating into the Window of Fate, Doctor Keillor. Sam grazes his mark as Keillor glances into it and extends his arm, drawing Sam hesitantly towards him. Sam peers into the Window of Fate and scrutinizes his likeness, which scrutinizes back at him, then places its paw in its satchel, extracts a blue gem, blinks at Sam, displays the gem, and returns it to its satchel. Covertly, Sam probes his own satchel and discovers an object there. Keillor appears restless as Sam retreats, positioning himself with his back to the window, and Keillor unwraps the bonnet from his crown."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Ron, Hermione, and Harry participate in a giant chess game, joining the black pieces. Ron rides a black knight, directing moves while Hermione anxiously watches. The game intensifies as pieces are destroyed, and Ron's strategic play becomes apparent to Harry. In a tense moment, the white queen attacks, knocking Ron unconscious. Harry takes the winning position, prompting the white king's surrender. He and Hermione rush to Ron's side. Harry then cautiously descends dimly lit steps and encounters Professor Quirrell, who is gazing into the Mirror of Erised. Harry sees his reflection holding a red stone and secretly discovers it in his own pocket. As Quirrell unwinds his turban, Harry backs away, realizing the peril he's in."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Quirrell looks impatient as Harry backs away standing with his back to the mirror and Quirrell unwinds the turban from his head Secretly Harry feels in his own pocket and finds something there  Harry shows him the stone and puts it back in its pocket  then puts its hand in its pocket takes out a red stone winks at  Harry looks into the Mirror of Erised and stares at his reflection which stares back at him  Harry touches his scar as Quirrell stares into it and stretches out his hand drawing Harry reluctantly towards him  As he descends the stairs he touches the scar on his forehead and sees a figure wearing a turban looking into the Mirror of Erised Professor Quirrell  a flight of white dimly lit stone steps  Harry walks cautiously down  Hermione watches him go Outside the chess room  Harry gets to his feet and still kneeling beside Ron  He and Hermione run to Ron and kneel beside him  Harry moves into the winning position and confidently looks up at the white king whose huge sword falls from his hands and lies on the marble floor at Harry's feet  Hermione steps hurriedly back onto her square and looks anxiously towards Ron who is lying unconscious  She stabs the black horse causing Ron to fall off and the horse crashes beside him  He clings onto the reins shaking with fear as the queen gets closer and closer gliding over the smooth marble floor  Ron braces himself as the white queen slowly turns and moves steadily across the board heading straight towards Ron's black horse  Ron looks nervously at the white king who wears a silver helmet clasping a powerful sword with his hands encased in metal armor  Taking a deep breath Ron clutches the horse's reins closes his eyes and the black horse starts to move across the board between the remains of the shattered stone chess pieces  Harry suddenly understands the game that Ron is playing and nods  Ron contemplates his next move and watching the merciless white queen  The queen turns triumphantly  A white bishop and a white knight explode and the white queen attacks a black castle which explodes in a shower of stone fragments and collapses in a pile of rubble  a white bishop explodes a white knight hits the dust and a black pawn is destroyed  The game gets underway  a black pawn moves forward and is sliced off by the white pawn  Hermione looks at Ron anxiously and obeying Ron's instructions  Ron climbs onto the stone horse of the black knight and looks across the board as a white pawn moves itself forward  They sheath their swords and join the black chess pieces "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Hermione steps hurriedly back onto her square and looks anxiously towards Ron who is lying unconscious  He clings onto the reins shaking with fear as the queen gets closer and closer gliding over the smooth marble floor  A white bishop and a white knight explode and the white queen attacks a black castle which explodes in a shower of stone fragments and collapses in a pile of rubble  then puts its hand in its pocket takes out a red stone winks at  The queen turns triumphantly  a flight of white dimly lit stone steps  They sheath their swords and join the black chess pieces  He and Hermione run to Ron and kneel beside him  Harry moves into the winning position and confidently looks up at the white king whose huge sword falls from his hands and lies on the marble floor at Harry's feet  a white bishop explodes a white knight hits the dust and a black pawn is destroyed  Harry suddenly understands the game that Ron is playing and nods  Secretly Harry feels in his own pocket and finds something there  The game gets underway  Harry walks cautiously down  Harry gets to his feet and still kneeling beside Ron  Quirrell looks impatient as Harry backs away standing with his back to the mirror and Quirrell unwinds the turban from his head Harry touches his scar as Quirrell stares into it and stretches out his hand drawing Harry reluctantly towards him  She stabs the black horse causing Ron to fall off and the horse crashes beside him  Ron climbs onto the stone horse of the black knight and looks across the board as a white pawn moves itself forward  Ron contemplates his next move and watching the merciless white queen  Hermione watches him go Outside the chess room  As he descends the stairs he touches the scar on his forehead and sees a figure wearing a turban looking into the Mirror of Erised Professor Quirrell  Ron looks nervously at the white king who wears a silver helmet clasping a powerful sword with his hands encased in metal armor  Harry shows him the stone and puts it back in its pocket  Ron braces himself as the white queen slowly turns and moves steadily across the board heading straight towards Ron's black horse  Hermione looks at Ron anxiously and obeying Ron's instructions  a black pawn moves forward and is sliced off by the white pawn  Taking a deep breath Ron clutches the horse's reins closes his eyes and the black horse starts to move across the board between the remains of the shattered stone chess pieces  Harry looks into the Mirror of Erised and stares at his reflection which stares back at him "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Hermione steps hurriedly back onto her square and looks anxiously towards Ron who is lying unconscious  Harry moves into the winning position and confidently looks up at the white king whose huge sword falls from his hands and lies on the marble floor at Harry's feet  He and Hermione run to Ron and kneel beside him  Harry gets to his feet and still kneeling beside Ron  Hermione watches him go Outside the chess room  Harry walks cautiously down  a flight of white dimly lit stone steps  As he descends the stairs he touches the scar on his forehead and sees a figure wearing a turban looking into the Mirror of Erised Professor Quirrell  Harry touches his scar as Quirrell stares into it and stretches out his hand drawing Harry reluctantly towards him  Harry looks into the Mirror of Erised and stares at his reflection which stares back at him  then puts its hand in its pocket takes out a red stone winks at  Harry shows him the stone and puts it back in its pocket  Secretly Harry feels in his own pocket and finds something there  Quirrell looks impatient as Harry backs away standing with his back to the mirror and Quirrell unwinds the turban from his head They sheath their swords and join the black chess pieces  Ron climbs onto the stone horse of the black knight and looks across the board as a white pawn moves itself forward  Hermione looks at Ron anxiously and obeying Ron's instructions  a black pawn moves forward and is sliced off by the white pawn  The game gets underway  a white bishop explodes a white knight hits the dust and a black pawn is destroyed  A white bishop and a white knight explode and the white queen attacks a black castle which explodes in a shower of stone fragments and collapses in a pile of rubble  The queen turns triumphantly  Ron contemplates his next move and watching the merciless white queen  Harry suddenly understands the game that Ron is playing and nods  Taking a deep breath Ron clutches the horse's reins closes his eyes and the black horse starts to move across the board between the remains of the shattered stone chess pieces  Ron looks nervously at the white king who wears a silver helmet clasping a powerful sword with his hands encased in metal armor  Ron braces himself as the white queen slowly turns and moves steadily across the board heading straight towards Ron's black horse  He clings onto the reins shaking with fear as the queen gets closer and closer gliding over the smooth marble floor  She stabs the black horse causing Ron to fall off and the horse crashes beside him "
        }
      ]
    }
  ]
}