{
  "ground_truth": "A horrible face appears, growing out of the back of Quirrell's head, with eyes sunk in dark sockets, and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way, and they appear in the mirror. Harry takes the red stone in his pocket and looks at it as his parents disappear. Quirrell flies through the air and detects Harry, who falls over backwards, causing the glowing philosopher's stone to drop from his hand. He stretches out desperately to reach it, but Quirrell is trying to choke him. Harry grabs Quirrell's hand, which surprises him, causing Quirrell to pull away. Quirrell holds out his hand in front of him and sees it crumble into grey dust. Quirrell lurches towards the stone, and Harry's hands push against Quirrell's face, which also disintegrates into dust. Harry stares at his own hands in horror as Quirrell reaches out towards him and then crashes to the ground, his whole body turned to a pile of dust, and Voldemort has also disappeared. Puzzled, Harry stares at his hands again, then looks around for the philosopher's stone, seeing the dark red crystal lying on the stairs with a small flame flickering inside it. Harry picks it up, looks at it for a moment, smiles with relief, and clutches it tightly in his hand. He turns quickly as the cloud of swirling dust gathers behind him, and Voldemort's face appears and screams towards Harry in a violent rushing wind, knocking him off balance. The wind seems to pass through Harry's body, which whirls away like a tornado up the stone steps and disappears, leaving Harry unconscious but still holding in his hand the philosopher's stone, which flickers and glows a rich, deep red. When Harry wakes, he's in bed in the hospital wing. He rubs his eyes, with his face pale and a bandage on one hand. He sits up, reaches for his spectacles, puts them on, and smiles as he sees the get-well cards and the table at the bottom of his bed piled high with boxes of sweets. Professor Dumbledore walks in, sees the sweets, picks up an empty box, sits on Harry's bed, and Harry touches his scar. Dumbledore touches Harry's head, gets up, and chews thoughtfully. Wearing his black cloak, Harry walks along a corridor and sees Ron and Hermione talking together on an upper landing. Smiling happily, he stops and looks up at them. They catch sight of him, and Harry's smile gets even wider. At a bank within the great hall, the students are wearing their robes and pointed hats. At the high table, Professor Dumbledore gets to his feet and looks around, while Malfoy smirks and the Gryffindors join in the applause halfheartedly.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A dreadful visage emerges, developing out of the back of Quirrell's head, with eyes sunk in dusky sockets, and the hide taut over the bony cranium as Harry turns to flee. A sheet of blaze obstructs his path, and they materialize in the mirror. Harry takes the crimson gem in his pocket and gazes at it as his guardians vanish. Quirrell soars through the air and perceives Harry, who tumbles backward, causing the luminous philosopher's stone to plummet from his grip. He extends out urgently to grasp it, but Quirrell is attempting to throttle him. Harry seizes Quirrell's hand, which startles him, causing Quirrell to recoil. Quirrell extends his hand in front of him and witnesses it crumble into gray ash. Quirrell lunges towards the stone, and Harry's hands press against Quirrell's face, which also disintegrates into dust. Harry gazes at his own hands in horror as Quirrell reaches out towards him and then crashes to the ground, his entire form transformed to a heap of dust, and Voldemort has also vanished. Perplexed, Harry gazes at his hands again, then glances around for the philosopher's stone, observing the dark red crystal lying on the stairs with a small flame flickering within it. Harry retrieves it, looks at it for a moment, smiles with relief, and clasps it tightly in his hand. He turns swiftly as the cloud of swirling dust accumulates behind him, and Voldemort's visage appears and shrieks towards Harry in a fierce rushing gale, knocking him off equilibrium. The gale seems to move through Harry's form, which spins away like a cyclone up the stone steps and vanishes, leaving Harry insensate but still clutching in his hand the philosopher's stone, which flickers and glows a rich, deep red. When Harry wakes, he's in bed in the infirmary wing. He rubs his eyes, with his face pale and a bandage on one hand. He sits up, reaches for his spectacles, puts them on, and smiles as he sees the get-well cards and the table at the foot of his bed stacked high with boxes of candies. Professor Dumbledore walks in, sees the candies, picks up an empty box, sits on Harry's bed, and Harry touches his scar. Dumbledore touches Harry's head, rises, and chews pensively. Clad in his black cloak, Harry walks along a passageway and sees Ron and Hermione conversing together on an upper landing. Smiling joyfully, he halts and gazes up at them. They catch sight of him, and Harry's smile becomes even broader. At a bench within the great hall, the students are wearing their robes and pointed hats. At the high table, Professor Dumbledore rises to his feet and looks around, while Malfoy sneers and the Gryffindors join in the applause unenthusiastically."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A horrible face is seen, growing out of the back of Quirrell's head, with eyes sunk in dark sockets, and the skin stretched over the bony skull as Harry turns to run. His way is blocked by a sheet of flame, and they are reflected in the mirror. The red stone is taken by Harry in his pocket, and he looks at it as his parents disappear. Harry is detected by Quirrell, who flies through the air, causing the glowing philosopher's stone to be dropped from his hand as he falls over backwards. He stretches out desperately to reach it, but Quirrell tries to choke him. Quirrell's hand is grabbed by Harry, which surprises him, causing Quirrell to pull away. Quirrell holds out his hand in front of him and watches it crumble into grey dust. Towards the stone, Quirrell lurches, and Quirrell's face is pushed against by Harry's hands, which also disintegrate into dust. In horror, Quirrell is stared at by Harry as he reaches out towards him and then crashes to the ground, his whole body turned to a pile of dust, and Voldemort also disappears. Puzzled, his hands are stared at by Harry again, then he looks around for the philosopher's stone, seeing the dark red crystal lying on the stairs with a small flame flickering inside it. It is picked up by Harry, who looks at it for a moment, smiles with relief, and clutches it tightly in his hand. Quickly turning, he is gathered behind by the cloud of swirling dust, and towards Harry, Voldemort's face appears and screams in a violent rushing wind, knocking him off balance. The wind passes through Harry's body, which is whirled away like a tornado up the stone steps and disappears, leaving Harry unconscious but still holding in his hand the philosopher's stone, which flickers and glows a rich, deep red. When Harry wakes, he finds himself in bed in the hospital wing. His eyes are rubbed by him, with his face pale and a bandage on one hand. Sitting up, he reaches for his spectacles, puts them on, and smiles as he sees the get-well cards and the table at the bottom of his bed piled high with boxes of sweets. Professor Dumbledore walks in, sees the sweets, picks up an empty box, sits on Harry's bed, and is touched by Harry on his scar. Harry's head is touched by Dumbledore, who gets up and chews thoughtfully. Wearing his black cloak, Harry walks along a corridor and sees Ron and Hermione talking together on an upper landing. Happily smiling, he stops and looks up at them. Sight of him is caught by them, and even wider, Harry's smile gets. At a bank within the great hall, robes and pointed hats are worn by the students. At the high table, Professor Dumbledore gets to his feet and looks around, while Malfoy smirks, and the Gryffindors join in the applause halfheartedly."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A ghastly face emerges from the back of Quirrell's head, with sunken eyes and skin stretched over a bony skull as Harry turns to flee. Flames block his path, and they appear in the mirror. Harry finds the red stone in his pocket as his parents vanish. Quirrell detects Harry, who falls, dropping the glowing philosopher's stone. Desperately reaching for it, Harry is choked by Quirrell. Surprised, Quirrell pulls away when Harry grabs his hand, which crumbles into dust. Quirrell lunges for the stone, and Harry's touch causes his face to disintegrate. Quirrell collapses into dust, and Voldemort vanishes. Confused, Harry finds the philosopher's stone on the stairs, its flame flickering. He picks it up, smiles with relief, and clutches it tightly. A swirling dust cloud forms, and Voldemort's face screams at Harry, knocking him off balance. The wind passes through Harry, whirling away like a tornado, leaving him unconscious but still holding the stone, glowing deep red. Harry wakes in the hospital wing, pale with a bandaged hand. He puts on his glasses and smiles at the get-well cards and sweets. Professor Dumbledore enters, picks up an empty box, sits on Harry's bed, and Harry touches his scar. Dumbledore touches Harry's head, then leaves, chewing thoughtfully. In a black cloak, Harry walks along a corridor, sees Ron and Hermione, and smiles wider when they notice him. In the great hall, students in robes and hats watch as Professor Dumbledore stands, while Malfoy smirks and Gryffindors applaud halfheartedly."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A horrible face emerges from the back of Quirrell's head as Harry turns to flee. Flames block his path, and they appear in the mirror. Harry takes the red stone from his pocket as his parents vanish. Quirrell detects Harry, who falls, dropping the glowing philosopher's stone. Desperately reaching for it, Quirrell tries to choke him. Harry grabs Quirrell's hand, surprising him, and Quirrell's hand crumbles to dust. Quirrell lunges for the stone, and Harry's touch disintegrates Quirrell's face into dust. Quirrell collapses into a pile of dust, and Voldemort disappears. Harry finds the philosopher's stone on the stairs, smiles, and clutches it. A swirling dust cloud forms, and Voldemort's face screams at Harry, knocking him off balance. The wind passes through Harry, leaving him unconscious but holding the stone, which glows red. Harry wakes in the hospital wing, pale with a bandaged hand. He puts on his glasses, smiles at the get-well cards and sweets. Dumbledore enters, picks up an empty box, sits on Harry's bed, and touches Harry's head. Wearing a black cloak, Harry walks along a corridor, sees Ron and Hermione, and smiles wider. In the great hall, students in robes and hats watch as Dumbledore stands, Malfoy smirks, and Gryffindors applaud halfheartedly."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As Harry turns to flee, a terrifying visage emerges, grotesquely growing out of the back of Quirrell's head. This face is ghastly, with eyes deeply sunken into shadowy sockets and skin stretched taut over a skeletal frame. Just as Harry attempts to escape, a formidable sheet of flame suddenly blocks his path, and they both appear in the mirror's reflection. Harry reaches into his pocket and retrieves the red stone, gazing at it intently as the images of his parents fade away. In a sudden, swift motion, Quirrell is propelled through the air and becomes aware of Harry's presence. Harry, caught off guard, stumbles backward, causing the glowing philosopher's stone to slip from his grasp. Desperately, he stretches out his hand to retrieve it, but Quirrell is already upon him, attempting to choke him with a fierce grip. In a moment of desperation, Harry seizes Quirrell's hand, which startles Quirrell, prompting him to recoil. Quirrell extends his hand in front of him, only to watch in horror as it crumbles into grey dust. Determined, Quirrell lunges towards the stone, but Harry's hands press against Quirrell's face, which also disintegrates into dust. Harry, filled with shock and disbelief, stares at his own hands in horror. Quirrell, now reduced to a mere shadow of his former self, reaches out towards Harry before collapsing to the ground, his entire body transformed into a pile of dust, and Voldemort has vanished as well. Confused and bewildered, Harry examines his hands once more, then scans the area for the philosopher's stone, spotting the dark red crystal resting on the stairs with a small flame flickering within it. Harry picks it up, studies it for a moment, and smiles with a sense of relief, clutching it tightly in his hand. He turns swiftly as a swirling cloud of dust gathers ominously behind him, and Voldemort's face materializes, screaming towards Harry with a violent, rushing wind that knocks him off balance. The wind seems to pass through Harry's very being, swirling away like a tornado up the stone steps and vanishing, leaving Harry unconscious but still clutching the philosopher's stone, which flickers and glows with a rich, deep red hue. When Harry regains consciousness, he finds himself in bed within the hospital wing. He rubs his eyes, his face pale, and a bandage wrapped around one hand. Sitting up, he reaches for his spectacles, places them on his nose, and smiles as he notices the get-well cards and the table at the foot of his bed piled high with boxes of sweets. Professor Dumbledore enters the room, observes the sweets, picks up an empty box, and sits on Harry's bed. Harry touches his scar, and Dumbledore gently touches Harry's head before rising and chewing thoughtfully. Clad in his black cloak, Harry walks along a corridor and spots Ron and Hermione engaged in conversation on an upper landing. With a joyful smile, he pauses and looks up at them. They notice him, and Harry's smile broadens even further. In the great hall, the students, dressed in their robes and pointed hats, are gathered. At the high table, Professor Dumbledore stands and surveys the room, while Malfoy smirks and the Gryffindors join in the applause, albeit somewhat halfheartedly."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As Harry swiftly turns to flee from the scene, an utterly terrifying visage grotesquely appears, emerging from the back of Quirrell's head. This face is exceedingly ghastly, with eyes deeply set into shadowy sockets, and the skin stretched tightly over a skeletal framework. Just at the moment when Harry tries to make his escape, a formidable sheet of bright flame suddenly blocks his path, and they both become visible in the reflection of the mirror. Harry carefully reaches into his pocket and retrieves the red stone, gazing intently at it as the images of his parents slowly fade away.\n\nIn a sudden, swift motion, Quirrell finds himself propelled through the air and becomes acutely aware of Harry's presence there. Harry, caught entirely off guard, stumbles backward unexpectedly, causing the glowing philosopher's stone to slip right from his grasp. Desperately, he stretches out his hand in a frantic attempt to retrieve it, yet Quirrell is already upon him, attempting to choke him with a fierce and unrelenting grip. In a moment of sheer desperation, Harry seizes Quirrell's hand, an action which startles Quirrell profoundly, prompting him to recoil in fear. Quirrell extends his hand in front of him, only to watch in absolute horror as it crumbles away into grey dust before his very eyes. Determined beyond belief, Quirrell lunges with force toward the stone, but Harry's hands press firmly against Quirrell's face, which also disintegrates into a cloud of dust. Filled with immense shock and disbelief, Harry stares at his own hands in horror, unable to comprehend what has just occurred. Quirrell, now reduced to a mere shadow of his former self, reaches out futilely towards Harry before collapsing to the ground, his entire body transformed into a pile of dust, and Voldemort has vanished as well.\n\nConfused and utterly bewildered, Harry examines his hands once more, then scans the surroundings for the philosopher's stone, finally spotting the small dark red crystal resting on the stairs with a tiny flame flickering within it. Harry picks it up, studies the stone for a brief moment, and smiles with an overwhelming sense of relief, clutching it tightly in his hand. He turns swiftly just as a swirling, ominous cloud of dust gathers behind him, and Voldemort's face materializes, screaming with ferocity towards Harry with a violent, rushing wind that knocks him off balance. The fierce wind seems to pass directly through Harry's very being, swirling away like an unstoppable tornado up the cold stone steps and vanishing into thin air, leaving Harry unconscious but still clutching the philosopher's stone, which flickers and glows with a rich, deep red hue.\n\nWhen Harry finally regains consciousness, he finds himself lying in a comfortable bed within the hospital wing. He rubs his eyes, his face appearing pale, with a bandage neatly wrapped around one hand. Sitting up slowly, he reaches for his spectacles, places them on his nose, and smiles as he notices the get-well cards and the table at the foot of his bed piled high with boxes of sweets. Professor Dumbledore enters the room, observes the assortment of sweets, picks up an empty box, and sits down on Harry's bed. Harry touches his scar, and Dumbledore gently touches Harry's head before rising and chewing thoughtfully. Clad in his black cloak, Harry walks along a corridor and spots Ron and Hermione engaged in cheerful conversation on an upper landing. With a joyful smile, he pauses and looks up at them. They notice him, and Harry's smile broadens even further.\n\nIn the great hall, a gathering of students, dressed neatly in their robes and pointed hats, fills the room. At the high table, Professor Dumbledore stands with authority and surveys the room, while Malfoy smirks with a smug expression and the Gryffindors join in the applause, albeit somewhat halfheartedly."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A horrible face emerges slowly, growing grotesquely out of the back of Quirrell's head, its eyes deeply sunken into dark sockets, and the skin stretched taut over the bony skull, as Harry, filled with fear, turns swiftly to run away. Suddenly, a sheet of flame erupts in front of him, blocking his path, and they both appear reflected in the mirror. Harry, feeling the weight of the red stone in his pocket, reaches in and takes it out, gazing at it intently as the comforting images of his parents fade away. In a sudden, violent motion, Quirrell flies through the air, his eyes locking onto Harry, who stumbles backward in shock, causing the glowing philosopher's stone to slip from his grasp and fall to the ground. Desperately, Harry stretches out his hand, trying to retrieve it, but Quirrell lunges at him, attempting to choke him with a fierce grip. In a moment of instinct, Harry grabs Quirrell's hand, which startles Quirrell, causing him to recoil in surprise. Quirrell then holds out his hand in front of him, watching in horror as it crumbles into grey dust. Determined, Quirrell lurches towards the stone, but Harry, acting quickly, presses his hands against Quirrell's face, which begins to disintegrate into dust as well. Harry stares at his own hands in disbelief and horror as Quirrell reaches out one last time before collapsing to the ground, his entire body reduced to a pile of dust, and Voldemort vanishes from sight. Confused, Harry examines his hands again, then scans the area for the philosopher's stone, spotting the dark red crystal lying on the stairs with a small flame flickering inside it. He picks it up, studies it for a moment, smiles with relief, and clutches it tightly in his hand. As he turns quickly, a swirling cloud of dust gathers behind him, and Voldemort's face materializes, screaming towards Harry with a violent, rushing wind that knocks him off balance. The wind seems to pass through Harry's body, which is swept away like a tornado up the stone steps and disappears, leaving Harry unconscious but still holding the philosopher's stone, which flickers and glows a rich, deep red. When Harry regains consciousness, he finds himself in bed in the hospital wing. He rubs his eyes, noticing his pale face and the bandage wrapped around one hand. Sitting up, he reaches for his spectacles, places them on his nose, and smiles as he sees the get-well cards and the table at the foot of his bed piled high with boxes of sweets. Professor Dumbledore enters the room, notices the sweets, picks up an empty box, and sits on Harry's bed, prompting Harry to touch his scar. Dumbledore gently touches Harry's head, then stands up and chews thoughtfully. Later, wearing his black cloak, Harry walks along a corridor and spots Ron and Hermione engaged in conversation on an upper landing. Smiling happily, he pauses and looks up at them. They catch sight of him, and Harry's smile broadens even more. In the great hall, at a bank, the students are dressed in their robes and pointed hats. At the high table, Professor Dumbledore rises to his feet and surveys the room, while Malfoy smirks and the Gryffindors join in the applause, albeit halfheartedly."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As Harry turns to flee, a terrifying face emerges from the back of Quirrell's head, but a sheet of flame blocks Harry's path. In the mirror, Harry sees his parents vanish as he clutches the red stone in his pocket. Quirrell, detecting Harry, causes him to fall, dropping the glowing philosopher's stone. As Harry desperately reaches for it, Quirrell attempts to choke him, but Harry's touch causes Quirrell's hand to crumble into dust. Quirrell lunges for the stone, but Harry's touch disintegrates his face, and Quirrell collapses into a pile of dust, with Voldemort disappearing as well. Confused, Harry retrieves the philosopher's stone from the stairs, smiling with relief as he clutches it. Suddenly, a swirling dust cloud forms behind him, and Voldemort's face emerges, screaming and knocking Harry off balance. The wind rushes through Harry, who then falls unconscious, still holding the stone, which glows a deep red. \n\nWhen Harry awakens in the hospital wing, he finds himself bandaged and surrounded by get-well cards and sweets. After putting on his spectacles, he smiles at the sight. Professor Dumbledore enters, inspects the sweets, and sits on Harry's bed, prompting Harry to touch his scar. Dumbledore touches Harry's head thoughtfully before leaving. Later, Harry, wearing his black cloak, walks down a corridor and spots Ron and Hermione on an upper landing. They exchange smiles, and Harry's grin widens. In the great hall, students in robes and pointed hats gather as Professor Dumbledore rises at the high table. Malfoy smirks while the Gryffindors join in the applause halfheartedly."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A horrible face appears, growing out of the back of Quirrell's head, revealing Voldemort with eyes sunk in dark sockets, and the skin stretched over the bony skull as Harry turns to run. A sheet of flame, conjured by Quirrell's magical abilities, blocks his way, and they appear in the Mirror of Erised, a magical mirror that shows one's deepest desires. Harry takes the red stone, known as the philosopher's stone, in his pocket and looks at it as his parents disappear. Quirrell, driven by Voldemort's will, flies through the air and detects Harry, who falls over backwards, causing the glowing philosopher's stone to drop from his hand. He stretches out desperately to reach it, but Quirrell is trying to choke him. Harry grabs Quirrell's hand, which surprises him, as Harry's touch burns Quirrell due to the ancient magic left by Harry's mother's sacrifice, causing Quirrell to pull away. Quirrell holds out his hand in front of him and sees it crumble into grey dust. Quirrell lurches towards the stone, and Harry's hands push against Quirrell's face, which also disintegrates into dust, an effect of Voldemort's partial possession. Harry stares at his own hands in horror as Quirrell reaches out towards him and then crashes to the ground, his whole body turned to a pile of dust, and Voldemort has also disappeared, fleeing in spirit form. Puzzled, Harry stares at his hands again, then looks around for the philosopher's stone, seeing the dark red crystal lying on the stairs with a small flame flickering inside it. This stone, created by Nicolas Flamel, is capable of producing the Elixir of Life. Harry picks it up, looks at it for a moment, smiles with relief, and clutches it tightly in his hand. He turns quickly as the cloud of swirling dust, remnants of Voldemort's weakened presence, gathers behind him, and Voldemort's face appears and screams towards Harry in a violent rushing wind, knocking him off balance. The wind seems to pass through Harry's body, which whirls away like a tornado up the stone steps of Hogwarts and disappears, leaving Harry unconscious but still holding in his hand the philosopher's stone, which flickers and glows a rich, deep red. When Harry wakes, he's in bed in the hospital wing of Hogwarts. He rubs his eyes, with his face pale and a bandage on one hand. He sits up, reaches for his spectacles, puts them on, and smiles as he sees the get-well cards from his friends and the table at the bottom of his bed piled high with boxes of sweets, gifts from well-wishers. Professor Dumbledore walks in, sees the sweets, picks up an empty box, sits on Harry's bed, and Harry touches his scar, which has been a mark of Voldemort's failed curse. Dumbledore touches Harry's head, gets up, and chews thoughtfully on a lemon drop, his favorite candy. Wearing his black cloak, Harry walks along a corridor and sees Ron and Hermione talking together on an upper landing of the castle. Smiling happily, he stops and looks up at them. They catch sight of him, and Harry's smile gets even wider. At a bank within the great hall of Hogwarts, the students are wearing their robes and pointed hats, a tradition for formal occasions. At the high table, Professor Dumbledore gets to his feet and looks around, presiding over the event, while Malfoy smirks and the Gryffindors join in the applause halfheartedly, as tensions linger between the houses."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "A horrible face appears growing out of the back of Quirrell's head with eyes sunk in dark sockets and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way and they appear in the mirror. Harry takes the red stone in his pocket and looks at it as his parents disappear. Quirrell flies through the air and detects Harry who falls over backwards causing the glowing philosopher's stone to drop from his hand. He stretches out desperately to reach it but Quirrell is trying to choke him. Harry grabs Quirrell's hand which surprises him causing Quirrell to pull away. Quirrell holds out his hand in front of him and sees it crumble into grey dust. Quirrell lurches towards the stone and Harry's hands push against Quirrell's face which also disintegrates into dust. Harry stares at his own hands in horror as Quirrell reaches out towards him and then crashes to the ground. his whole body turned to a pile of dust and Voldemort has also disappeared. Puzzled Harry stares at his hands again then looks around for the philosopher's stone seeing the dark red crystal lying on the stairs with a small flame flickering inside it. Harry picks it up looks at it for a moment smiles with relief and clutches it tightly in his hand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. He turns quickly as the cloud of swirling dust gathers behind him and Voldemort's face appears and screams towards Harry in a violent rushing wind knocking him off balance. The wind seems to pass through Harry's body which whirls away like a tornado up the stone steps and disappears leaving Harry unconscious but still holding in his hand. the philosopher's stone which flickers and glows a rich deep red. When Harry wakes he is in bed in the hospital wing. He rubs his eyes with his face pale and a bandage on one hand. He sits up reaches for his spectacles puts them on and smiles as he sees the getwell cards and the table at the bottom of his bed piled high with boxes of sweets. Professor Dumbledore walks in sees the sweets picks up an empty box sits on Harry's bed and Harry touches his scar. Dumbledore touches Harry's head gets up and chews thoughtfully. Wearing his black cloak Harry walks along a corridor and sees Ron and Hermione talking together on an upper landing. Smiling happily he stops and looks up at them. They catch sight of him and Harry's smile gets even wider. At a bank within the great hall the students are wearing their robes and pointed hats. At the high table Professor Dumbledore gets to his feet and looks around while Malfoy smirks and the Gryffindors join in the applause halfheartedly."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "A horrible face appears growing out of the back of Quirrell's head with eyes sunk in dark sockets and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way and they appear in the mirror. Harry takes the red stone in his pocket and looks at it as his parents disappear. Quirrell flies through the air and detects Harry who falls over backwards causing the glowing philosopher's stone to drop from his hand. He stretches out desperately to reach it but Quirrell is trying to choke him. Harry grabs Quirrell's hand which surprises him causing Quirrell to pull away. Quirrell holds out his hand in front of him and sees it crumble into grey dust. Quirrell lurches towards the stone and Harry's hands push against Quirrell's face which also disintegrates into dust. Harry stares at his own hands in horror as Quirrell reaches out towards him and then crashes to the ground. his whole body turned to a pile of dust and Voldemort has also disappeared. Puzzled Harry stares at his hands again then looks around for the philosopher's stone seeing the dark red crystal lying on the stairs with a small flame flickering inside it. Harry picks it up looks at it for a moment smiles with relief and clutches it tightly in his hand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. He turns quickly as the cloud of swirling dust gathers behind him and Voldemort's face appears and screams towards Harry in a violent rushing wind knocking him off balance. The wind seems to pass through Harry's body which whirls away like a tornado up the stone steps and disappears leaving Harry unconscious but still holding in his hand. the philosopher's stone which flickers and glows a rich deep red. When Harry wakes he is in bed in the hospital wing. He rubs his eyes with his face pale and a bandage on one hand. He sits up reaches for his spectacles puts them on and smiles as he sees the getwell cards and the table at the bottom of his bed piled high with boxes of sweets. Professor Dumbledore walks in sees the sweets picks up an empty box sits on Harry's bed and Harry touches his scar. Dumbledore touches Harry's head gets up and chews thoughtfully. Wearing his black cloak Harry walks along a corridor and sees Ron and Hermione talking together on an upper landing. Smiling happily he stops and looks up at them. They catch sight of him and Harry's smile gets even wider. At a bank within the great hall the students are wearing their robes and pointed hats. At the high table Professor Dumbledore gets to his feet and looks around while Malfoy smirks and the Gryffindors join in the applause halfheartedly."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "A horrible face appears growing out of the back of Quirrell's head with eyes sunk in dark sockets and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way and they appear in the mirror. Harry takes the red stone in his pocket and looks at it as his parents disappear. Quirrell flies through the air and detects Harry who falls over backwards causing the glowing philosopher's stone to drop from his hand. He stretches out desperately to reach it but Quirrell is trying to choke him. Harry grabs Quirrell's hand which surprises him causing Quirrell to pull away. Professor Dumbledore walks in sees the sweets picks up an empty box sits on Harry's bed and Harry touches his scar. Dumbledore touches Harry's head gets up and chews thoughtfully. Wearing his black cloak Harry walks along a corridor and sees Ron and Hermione talking together on an upper landing. Smiling happily he stops and looks up at them. They catch sight of him and Harry's smile gets even wider. At a bank within the great hall the students are wearing their robes and pointed hats. At the high table Professor Dumbledore gets to his feet and looks around while Malfoy smirks and the Gryffindors join in the applause halfheartedly."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "A horrible face appears growing out of the back of Quirrell's head with eyes sunk in dark sockets and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way and they appear in the mirror. They catch sight of him and Harry's smile gets even wider. At a bank within the great hall the students are wearing their robes and pointed hats. At the high table Professor Dumbledore gets to his feet and looks around while Malfoy smirks and the Gryffindors join in the applause halfheartedly."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "A terrifying mask emerges, expanding out of the back of Henderson's broom, with lenses buried in bright helmets, and the fabric draped over the metallic vessel as Lucas spins to leap. A curtain of smoke obstructs his path, and they emerge in the pond. Lucas places the blue feather in his sock and gazes at it while his friends vanish. Henderson sails through the garage and uncovers Lucas, who tumbles forward, causing the shimmering explorer's feather to slip from his grip. He lunges out reluctantly to grasp it, but Henderson is trying to tickle him. Lucas clutches Henderson's elbow, which shocks him, causing Henderson to jerk aside. Henderson holds out his shoulder in front of him and watches it crumble into blue ash. Henderson staggers toward the feather, and Lucas's elbows press against Henderson's mask, which then disintegrates into ash. Lucas gawks at his own elbows in fright as Henderson reaches out toward him and then crashes into the floor, his entire entity turned to a heap of ash, and Mortimer has also vanished. Bewildered, Lucas gawks at his elbows again, then scans for the explorer's feather, noticing the bright blue gem lying on the chairs with a small spark glowing inside it. Lucas scoops it up, inspects it briefly, grins with excitement, and grips it firmly in his elbow. He turns swiftly as the mist of spinning ash assembles behind him, and Mortimer's mask pops up and shouts toward Lucas in a fierce swirling breeze, toppling him over. The breeze seems to glide through Lucas's entity, which twirls away like a whirlwind up the wooden chairs and vanishes, leaving Lucas unconscious but still clutching in his elbow the explorer's feather, which glimmers and shimmers a vivid, bright blue. When Lucas stirs, he's on a mattress in the rescue tent. He rubs his goggles, with his mask faded and a plaster on one elbow. He rises up, reaches for his binoculars, puts them on, and beams as he sees the greeting balloons and the stand at the foot of his mattress piled high with jars of fruit. Captain Starling strolls in, notices the fruit, picks up an empty jar, sits on Lucas's mattress, and Lucas brushes his bruise. Starling brushes Lucas's goggle, stands up, and munches thoughtfully. Wearing his red scarf, Lucas strolls along a landing and notices Arlo and Felicity chatting together on a lower perch. Grinning joyfully, he pauses and gazes down at them. They notice him, and Lucas's grin expands even further. In a courtroom inside the large cave, the crew are wearing their goggles and curved scarves. At the long counter, Captain Starling rises to his toes and surveys the scene, while Bartley sneers and the Ravens join in the laughter lackadaisically."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A grotesque face emerges from the back of Quirrell's head, terrifying Harry as flames block his escape. In a frantic struggle, the philosopher's stone drops from Harry's hand as Quirrell attacks him. Harry's touch causes Quirrell to disintegrate into dust, and Voldemort vanishes. Confused but relieved, Harry retrieves the stone, witnessing Voldemort's face vanish in a whirlwind. Harry is left unconscious but clutching the stone. He wakes in the hospital wing, surrounded by get-well cards and sweets, as Dumbledore visits. Later, wearing his cloak, Harry smiles at Ron and Hermione. At the great hall, students applaud as Professor Dumbledore stands, while Malfoy smirks."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "At the high table Professor Dumbledore gets to his feet and looks around while Malfoy smirks and the Gryffindors join in the applause halfheartedly At a bank within the great hall the students are wearing their robes and pointed hats  They catch sight of him and Harry's smile gets even wider  Smiling happily he stops and looks up at them  Wearing his black cloak Harry walks along a corridor and sees Ron and Hermione talking together on an upper landing  Dumbledore touches Harry's head gets up and chews thoughtfully  Professor Dumbledore walks in sees the sweets picks up an empty box sits on Harry's bed and Harry touches his scar  He sits up reaches for his spectacles puts them on and smiles as he sees the getwell cards and the table at the bottom of his bed piled high with boxes of sweets  He rubs his eyes with his face pale and a bandage on one hand  When Harry wakes he's in bed in the hospital wing  the philosopher's stone which flickers and glows a rich deep red  The wind seems to pass through Harry's body which whirls away like a tornado up the stone steps and disappears leaving Harry unconscious but still holding in his hand  He turns quickly as the cloud of swirling dust gathers behind him and Voldemort's face appears and screams towards Harry in a violent rushing wind knocking him off balance  Harry picks it up looks at it for a moment smiles with relief and clutches it tightly in his hand  Puzzled Harry stares at his hands again then looks around for the philosopher's stone seeing the dark red crystal lying on the stairs with a small flame flickering inside it  his whole body turned to a pile of dust and Voldemort has also disappeared  Harry stares at his own hands in horror as Quirrell reaches out towards him and then crashes to the ground  Quirrell lurches towards the stone and Harry's hands push against Quirrell's face which also disintegrates into dust  Quirrell holds out his hand in front of him and sees it crumble into grey dust  Harry grabs Quirrell's hand which surprises him causing Quirrell to pull away  He stretches out desperately to reach it but Quirrell is trying to choke him  Quirrell flies through the air and detects Harry who falls over backwards causing the glowing philosopher's stone to drop from his hand  Harry takes the red stone in his pocket and looks at it as his parents disappear  A sheet of flame blocks his way and they appear in the mirror  A horrible face appears growing out of the back of Quirrell's head with eyes sunk in dark sockets and the skin stretched over the bony skull as Harry turns to run "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "A sheet of flame blocks his way and they appear in the mirror A horrible face appears growing out of the back of Quirrell's head with eyes sunk in dark sockets and the skin stretched over the bony skull as Harry turns to run Quirrell flies through the air and detects Harry who falls over backwards causing the glowing philosopher's stone to drop from his hand Harry takes the red stone in his pocket and looks at it as his parents disappear Harry grabs Quirrell's hand which surprises him causing Quirrell to pull away He stretches out desperately to reach it but Quirrell is trying to choke him Quirrell lurches towards the stone and Harry's hands push against Quirrell's face which also disintegrates into dust Quirrell holds out his hand in front of him and sees it crumble into grey dust his whole body turned to a pile of dust and Voldemort has also disappeared Harry stares at his own hands in horror as Quirrell reaches out towards him and then crashes to the ground Harry picks it up looks at it for a moment smiles with relief and clutches it tightly in his hand Puzzled Harry stares at his hands again then looks around for the philosopher's stone seeing the dark red crystal lying on the stairs with a small flame flickering inside it The wind seems to pass through Harry's body which whirls away like a tornado up the stone steps and disappears leaving Harry unconscious but still holding in his hand He turns quickly as the cloud of swirling dust gathers behind him and Voldemort's face appears and screams towards Harry in a violent rushing wind knocking him off balance When Harry wakes he is in bed in the hospital wing the philosopher's stone which flickers and glows a rich deep red He sits up reaches for his spectacles puts them on and smiles as he sees the getwell cards and the table at the bottom of his bed piled high with boxes of sweets He rubs his eyes with his face pale and a bandage on one hand Dumbledore touches Harry's head gets up and chews thoughtfully Professor Dumbledore walks in sees the sweets picks up an empty box sits on Harry's bed and Harry touches his scar Smiling happily he stops and looks up at them Wearing his black cloak Harry walks along a corridor and sees Ron and Hermione talking together on an upper landing At a bank within the great hall the students are wearing their robes and pointed hats They catch sight of him and Harry's smile gets even wider At the high table Professor Dumbledore gets to his feet and looks around while Malfoy smirks and the Gryffindors join in the applause halfheartedly"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The wind seems to pass through Harry's body which whirls away like a tornado up the stone steps and disappears leaving Harry unconscious but still holding in his hand  the philosopher's stone which flickers and glows a rich deep red  When Harry wakes he's in bed in the hospital wing  He rubs his eyes with his face pale and a bandage on one hand  He sits up reaches for his spectacles puts them on and smiles as he sees the getwell cards and the table at the bottom of his bed piled high with boxes of sweets  Professor Dumbledore walks in sees the sweets picks up an empty box sits on Harry's bed and Harry touches his scar  Dumbledore touches Harry's head gets up and chews thoughtfully  Wearing his black cloak Harry walks along a corridor and sees Ron and Hermione talking together on an upper landing  Smiling happily he stops and looks up at them  They catch sight of him and Harry's smile gets even wider  At a bank within the great hall the students are wearing their robes and pointed hats  At the high table Professor Dumbledore gets to his feet and looks around while Malfoy smirks and the Gryffindors join in the applause halfheartedly A horrible face appears growing out of the back of Quirrell's head with eyes sunk in dark sockets and the skin stretched over the bony skull as Harry turns to run  A sheet of flame blocks his way and they appear in the mirror  Harry takes the red stone in his pocket and looks at it as his parents disappear  Quirrell flies through the air and detects Harry who falls over backwards causing the glowing philosopher's stone to drop from his hand  He stretches out desperately to reach it but Quirrell is trying to choke him  Harry grabs Quirrell's hand which surprises him causing Quirrell to pull away  Quirrell holds out his hand in front of him and sees it crumble into grey dust  Quirrell lurches towards the stone and Harry's hands push against Quirrell's face which also disintegrates into dust  Harry stares at his own hands in horror as Quirrell reaches out towards him and then crashes to the ground  his whole body turned to a pile of dust and Voldemort has also disappeared  Puzzled Harry stares at his hands again then looks around for the philosopher's stone seeing the dark red crystal lying on the stairs with a small flame flickering inside it  Harry picks it up looks at it for a moment smiles with relief and clutches it tightly in his hand  He turns quickly as the cloud of swirling dust gathers behind him and Voldemort's face appears and screams towards Harry in a violent rushing wind knocking him off balance "
        }
      ]
    }
  ]
}