{
  "ground_truth": "Harry looks on in amazement as the boy lines up his trolley and disappears through the wall followed by his identical twin brother. The little girl smiles at him while Harry looks at the solid brick wall. He aims his trolley, takes a deep breath, runs straight at the wall, and finds himself safely on the other side, where he pushes his trolley on to Platform 9 and three-quarters. Harry smiles with delight beside the platform, where a handsome steam engine stands. The train steams through the countryside, and Harry has a carriage to himself. He sits by the window looking out at the passing scenery. A red-haired boy has a smudge of dirt on his nose, and Ron's eyes widen. Harry pushes back his hair as Ron holds up a bag of squashed sandwiches. Harry pulls out a handful of gold coins, and the boys share the sweets. Harry pulls a face as he takes a bean out of his mouth then opens a box marked chocolate frog. The frog jumps and leaps through the open window. Harry sees a hologram on the card and looks again. A rat appears, and Ron takes out a wand. A girl at the door pulls a wand out of her cloak and points it at Harry, mending his broken spectacles. Harry glances at Ron as Hermione looks disapprovingly at Ron on her way out, and he rubs his nose. The train draws into a small country station where Hagrid is waiting on the platform, holding a powerful lamp. Wearing black cloaks over their school uniforms, the pupils are dwarfed by the giant Hagrid, and Ron gazes up at him in amazement. Hagrid leads the way to the shores of a mysterious pitch-black lake, where four at a time, the children crawl into small, wooden boats, each softly lit by lamps suspended by a pole. The boats start to move, and half hidden by clouds, the moon casts a faint blue light. Mist rises from the water as the tiny wooden boats drift silently across the lake. In the distance, the children see the turrets and towers of a vast castle perched high on the other side. Light sparkles from hundreds of windows, and the children gaze in wonder at the huge imposing building. It towers above them as the fleet of little boats glides closer to the cliff on which it stands. Safely disembarked, the crowd of new students follow each other into the castle and up a wide marble staircase. On the upper landing, long, thin fingers tap the stone balustrade patiently. Standing in front of huge oak doors, the tall figure of Professor McGonagall faces the first-years as they reach the top of the stairs. Neville Longbottom picks up his lost brown toad and looks up at Professor McGonagall nervously.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Harry observes on in astonishment as the lad aligns up his cart and vanishes through the barrier followed by his duplicate twin sibling. The little lass beams at him while Harry glances at the sturdy brick partition. He targets his cart, inhales a profound breath, dashes straight at the barrier, and discovers himself securely on the other flank, where he pushes his cart on to Platform 9 and three-quarters. Harry grins with pleasure beside the platform, where a striking steam locomotive stands. The locomotive chugs through the countryside, and Harry has a compartment to himself. He reclines by the pane watching out at the passing landscape. A red-haired lad has a smear of soil on his snout, and Ron's eyes widen. Harry tugs back his mane as Ron lifts up a sack of crushed sandwiches. Harry extracts a fistful of gold coins, and the lads divide the confections. Harry grimaces as he removes a bean out of his mouth then unseals a carton labeled chocolate frog. The frog hops and springs through the open pane. Harry perceives a hologram on the card and glances again. A rodent appears, and Ron removes a wand. A lass at the entryway extracts a wand out of her cloak and directs it at Harry, repairing his fractured spectacles. Harry peeks at Ron as Hermione looks reproachfully at Ron on her path out, and he rubs his snout. The locomotive pulls into a petite rural depot where Hagrid is waiting on the platform, holding a powerful lantern. Wearing black cloaks over their school uniforms, the pupils are overshadowed by the colossal Hagrid, and Ron stares up at him in amazement. Hagrid leads the path to the banks of a mysterious pitch-black lake, where four at a time, the juveniles clamber into small, wooden boats, each gently lit by lanterns suspended by a pole. The boats start to move, and half concealed by clouds, the moon casts a faint blue glow. Fog rises from the liquid as the tiny wooden vessels drift silently across the lake. In the distance, the juveniles see the turrets and spires of a vast fortress perched high on the other side. Light twinkles from hundreds of apertures, and the juveniles gaze in wonder at the enormous imposing structure. It towers above them as the fleet of little vessels glides closer to the cliff on which it stands. Safely disembarked, the throng of new scholars follow each other into the fortress and up a wide marble staircase. On the upper landing, long, thin digits tap the stone balustrade patiently. Standing in front of huge oak doors, the tall figure of Professor McGonagall faces the first-years as they reach the top of the stairs. Neville Longbottom picks up his lost brown toad and glances up at Professor McGonagall nervously."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Harry is looked on in amazement by the boy as his trolley is lined up and the wall is disappeared through by him, followed by his identical twin brother. A smile is given to him by the little girl while the solid brick wall is looked at by Harry. The trolley is aimed, a deep breath is taken, the wall is run at straight, and the other side is safely found by him, where Platform 9 and three-quarters is pushed onto by him. Delight is smiled with by Harry beside the platform, where a handsome steam engine is stood. The countryside is steamed through by the train, and a carriage is had to himself by Harry. The window is sat by by him, looking out at the scenery that is passed. A smudge of dirt is had on his nose by a red-haired boy, and Ron widens his eyes. Harry's hair is pushed back as a bag of squashed sandwiches is held up by Ron. A handful of gold coins is pulled out by Harry, and the sweets are shared by the boys. A face is pulled by Harry as a bean is taken out of his mouth then a box marked chocolate frog is opened. Through the open window, the frog is jumped and leaped. A hologram is seen on the card by Harry and again he looks. A rat is appeared by, and a wand is taken out by Ron. A wand is pulled out of her cloak by a girl at the door and is pointed at Harry, mending his broken spectacles. Harry's glance goes to Ron as Hermione disapproves by looking at Ron on her way out, and his nose is rubbed by him. A small country station is drawn into by the train where Hagrid is waited for on the platform, holding a powerful lamp. Wearing black cloaks over their school uniforms, the giant Hagrid dwarfs the pupils, and Ron is gazed up at him in amazement. The way to the shores of a mysterious pitch-black lake is led by Hagrid, where four at a time, the children crawl into small, wooden boats, each softly lit by lamps suspended by a pole. The boats are started to move, and the moon, half hidden by clouds, casts a faint blue light. The water rises with mist as the tiny wooden boats drift silently across the lake. The turrets and towers of a vast castle on the other side are seen in the distance by the children. Light sparkles from hundreds of windows, and wonder is gazed in at the huge imposing building by the children. It is towered above them by as the fleet of little boats glides closer to the cliff on which it stands. The new students, safely disembarked, are followed by each other into the castle and up a wide marble staircase. Long, thin fingers tap the stone balustrade patiently on the upper landing. Facing the first-years as the top of the stairs is reached by them, the huge oak doors are stood in front of by the tall figure of Professor McGonagall. Neville Longbottom's lost brown toad is picked up by him and nervous looks are given to Professor McGonagall."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Harry watches amazed as a boy lines up his trolley and vanishes through the wall followed by his twin. A little girl smiles while Harry stares at the solid brick wall. He aims his trolley, breathes deeply, runs at the wall, and finds himself safely on the other side, pushing his trolley to Platform 9¾. Harry grins beside the platform where a steam engine stands. The train travels through the countryside, Harry has a carriage to himself, and he gazes at the passing scenery. A red-haired boy, with dirt on his nose, widens his eyes. Harry moves his hair as Ron holds squashed sandwiches. Harry pulls out gold coins, and they share sweets. Grimacing at a bean, Harry opens a chocolate frog box, and the frog leaps through the window. Harry examines a hologram card. A rat appears, and Ron takes out a wand. A girl fixes Harry’s spectacles with her wand, looks disapprovingly at Ron, and leaves as he rubs his nose. The train reaches a small station where Hagrid waits with a lamp. Wearing black cloaks, students are dwarfed by Hagrid, and Ron gazes at him amazed. Hagrid leads them to a pitch-black lake, where four at a time, they enter small, lamp-lit boats. The boats move, and the moon casts faint blue light. Mist rises as boats drift across the lake. In the distance, the children see a massive castle with towers and turrets. Light sparkles from windows, and they gaze in awe at the imposing building towering above as boats glide closer to the cliff. Disembarked, new students follow each other into the castle up a marble staircase. On the upper landing, fingers tap the stone balustrade. Professor McGonagall stands before huge oak doors facing the first-years. Neville Longbottom picks up his lost toad and looks up nervously at Professor McGonagall."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Harry watches in amazement as a boy disappears through a wall with his twin. A girl smiles at him, and he runs at the brick wall, reaching Platform 9¾. Harry, delighted, sees a steam engine and has a carriage to himself. A red-haired boy named Ron offers Harry squashed sandwiches. Harry shares sweets, pulling a face at a jelly bean, then opens a chocolate frog box; the frog escapes through the window. He notices a hologram card, and Ron uses a wand. A girl mends Harry's glasses, looks disapprovingly at Ron, and leaves. At a station, Hagrid waits with a lamp. Students in black cloaks look up in awe at him. Hagrid leads them to a dark lake, where they board lamp-lit boats that glide across the misty water. They spot a large castle in the distance, its windows sparkling. The boats approach the cliffs. Disembarked, the new students enter the castle and ascend a marble staircase. Professor McGonagall stands before the first-years as Neville picks up his toad, looking nervous."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Harry gazes on in absolute amazement and wonder as he watches the boy carefully line up his trolley and, with confidence, disappear through the seemingly solid wall. He is quickly followed by his identical twin brother. A little girl, standing nearby, smiles warmly at Harry while he continues to stare at the solid brick wall in front of him. Girding himself for the task, Harry aims his trolley, inhales deeply, and then, with determination, runs straight at the wall. Much to his relief and astonishment, he finds himself safely on the other side, emerging onto Platform 9 and three-quarters. Joy fills Harry as he stands beside the platform, where a handsome and grand steam engine awaits them. As the train steams through the rolling countryside, Harry finds himself fortunate enough to have a carriage all to himself. He sits beside the window, gazing out at the beautiful, passing scenery. Meanwhile, a red-haired boy who has a noticeable smudge of dirt on his nose comes into view, and Ron’s eyes widen with excitement. As Harry pushes back his hair, Ron holds up a bag filled with squashed sandwiches. Harry, in turn, pulls out a handful of shimmering gold coins, and the two boys share a delightful collection of sweets. Harry makes a face as he extracts an unusual bean from his mouth and then proceeds to open a box labeled chocolate frog. To his surprise, the frog jumps and leaps energetically through the open window. Harry's attention is caught by a hologram on the card, and he looks again in disbelief. Suddenly, a rat appears, and Ron swiftly takes out a wand. At the door, a girl draws a wand from her cloak and, with a quick movement, points it at Harry, expertly mending his broken spectacles. Harry glances curiously at Ron while Hermione casts a disapproving look at Ron before leaving, and he rubs his nose thoughtfully. Eventually, the train slowly draws into a quaint, small country station where the towering figure of Hagrid waits on the platform, holding a powerful, glowing lamp. Wearing black cloaks over their school uniforms, the pupils appear small compared to the gigantic Hagrid, and Ron looks up at him in utter amazement. Hagrid leads the way, guiding them to the shores of a mysterious, pitch-black lake, where, in groups of four at a time, the children climb into small wooden boats. Each boat is softly illuminated by lamps dangling from poles. As the boats begin to move, the moon, half hidden by clouds, casts a gentle blue light across the scene. Mist elegantly rises from the water as the tiny wooden boats drift silently and smoothly across the lake. In the distance, the children catch their first glimpse of the turrets and towers of a vast and magnificent castle, majestically perched high on the opposite side. Light sparkles and dances from hundreds of windows, and the children gaze in awe and wonder at the mighty, imposing building that towers above them. The fleet of little boats glides ever closer to the cliff on which the castle stands. Once safely disembarked, the crowd of new students follows each other up into the castle and onto a wide, grand marble staircase. On the upper landing, long, thin fingers tap the stone balustrade patiently. Standing in front of huge, imposing oak doors, the tall and formidable figure of Professor McGonagall faces the first-years as they finally reach the top of the stairs. Neville Longbottom bends down to pick up his lost brown toad and glances nervously up at Professor McGonagall."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Harry stands transfixed, gazing with absolute amazement and pure wonderment as he observes the young boy methodically line up his trolley, exuding confidence, before astonishingly disappearing through what appears to be a solid wall. He is promptly followed by his identical twin brother, moving quickly in succession. Nearby, a little girl, standing just a short distance away, graces Harry with a warm smile while he continues to stare somewhat incredulously at the brick wall before him. Gathering his courage for the daunting task at hand, Harry carefully aims his trolley, takes a deep, steadying breath, and then runs headlong at the wall with determination. To his immense relief and utter astonishment, he finds himself safely emerging on the other side, stepping onto the renowned Platform 9 and three-quarters. Joy bubbles up within Harry as he stands beside the platform, where a handsome and grand steam engine waits majestically. \n\nAs the train embarks on its journey, steaming through the picturesque and rolling countryside, Harry considers himself quite fortunate to have a carriage all to himself. He takes a seat beside the window, allowing himself to gaze out at the beautiful, ever-changing scenery that flows before him. Meanwhile, a red-haired boy, whose nose bears a noticeable smudge of dirt, comes into view, and Ron's eyes widen with visible excitement. As Harry pushes back his unruly hair, Ron holds up a bag packed with squashed sandwiches. In response, Harry reveals a handful of shimmering gold coins, and the two boys share an endearing collection of delightful sweets. Harry scrunches his face in reaction as he pulls an unusual bean from his mouth, then proceeds to open a box labeled 'chocolate frog.' To his surprise, the frog springs to life, energetically leaping through the open window. Harry's attention is captured by a hologram on the card, and he looks once more in disbelief. \n\nSuddenly, a rat makes an appearance, prompting Ron to swiftly retrieve a wand. At the carriage door, a girl draws a wand from within her cloak and, with a swift, expert movement, points it at Harry, skillfully mending his broken spectacles. Harry casts a curious glance at Ron while Hermione throws a disapproving look Ron’s way before departing, leaving Ron to thoughtfully rub his nose. Eventually, the train slows and comes to a stop at a charming, quaint country station, where the towering figure of Hagrid awaits on the platform, holding a powerful, glowing lamp in hand. Wearing their black cloaks over school uniforms, the pupils appear remarkably small in comparison to the gigantic Hagrid, prompting Ron to look up at him in sheer amazement. Hagrid leads the way, guiding them toward the shores of a mysterious, pitch-black lake, where, in groups of four at a time, the children clamber into small wooden boats. Each boat is gently illuminated by delicate lamps dangling from poles. As these boats begin their journey across the water, the moon, partially obscured by clouds, casts a gentle, ethereal blue light over the scene. Mist rises elegantly from the water as the modest wooden boats glide silently and smoothly across the lake. In the distance, the children catch their first awe-inspiring glimpse of the turrets and towers of a vast, magnificent castle, proudly perched high on the opposite side. Light sparkles and dances magically from hundreds of windows, and the children gaze in awe and wonder at the mighty, imposing building that looms majestically above them.\n\nThe fleet of little boats continues its approach, drawing ever closer to the cliff upon which the grand castle stands. Once they have safely disembarked, the crowd of new students follows one another up into the castle, ascending a wide, grand marble staircase. On the upper landing, long, thin fingers tap the stone balustrade patiently. Standing in front of the large, imposing oak doors, the tall and formidable figure of Professor McGonagall faces the first-year students as they finally reach the top of the stairs. Neville Longbottom bends down to retrieve his lost brown toad and glances nervously up at the authoritative figure of Professor McGonagall."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Harry watches in awe as he sees the boy carefully line up his trolley and, with a firm determination, walk directly toward the seemingly solid wall, only to vanish as if by magic. His identical twin brother follows suit, disappearing in the same manner, leaving Harry intrigued. A little girl standing nearby gives Harry a reassuring smile as he stares at the brick wall in disbelief. Summoning his courage, Harry positions his trolley, inhales deeply to steady his nerves, and charges forward with resolve toward the wall. To his astonishment, he emerges unharmed on the other side, where he continues to push his trolley until he arrives at Platform 9 and three-quarters. Standing beside the platform, Harry's face lights up with delight as he takes in the sight of an impressive and handsome steam engine. As the train departs and cuts through the picturesque countryside, Harry finds himself alone in a carriage, seated comfortably by the window, captivated by the scenery that slides by. Meanwhile, a red-haired boy with a noticeable smudge of dirt on his nose enters, and his eyes widen with curiosity. Observing this, Harry casually brushes his hair back, making way for Ron, who eagerly presents a bag filled with squashed sandwiches. Harry kindly retrieves a handful of gold coins from his pocket, and together, the boys delve into a shared assortment of sweets. Experimenting with one of the beans, Harry makes a grimace and swiftly removes it from his mouth, leading him to open a box labeled chocolate frog. As soon as the box is opened, the frog springs to life, making a daring leap through the open window. Intrigued, Harry examines a holographic card and peers at it with keen interest. Amidst this, a rat pops into view, prompting Ron to retrieve his wand in anticipation. Suddenly, a girl appears at the door, confidently drawing her wand from her cloak, and with a deft flick, she repairs Harry's broken spectacles. As Harry exchanges a glance with Ron, he notices Hermione casting a disapproving look at Ron while exiting the carriage, to which Ron responds by rubbing his nose sheepishly. The train slows and finally pulls into a quaint country station, where Hagrid stands waiting, holding a powerful lamp that casts a warm glow. The pupils, clad in black cloaks over their school uniforms, appear diminutive next to the towering giant Hagrid, who captures Ron's stunned attention as he gazes up at him in awe. Taking the lead, Hagrid guides the students to the edge of a mysterious, inky-black lake, where they gently clamber into small wooden boats, each subtly illuminated by lamps hanging from a slender pole. As the boats begin to glide across the tranquil water, the moon, partially obscured by clouds, casts a faint bluish light upon the scene. Mist delicately rises from the lake's surface as the modest vessels silently drift along. In the distance, the children marvel at the sight of the majestic turrets and towers of a sprawling castle perched atop the far side. The castle's windows glimmer with light, painting a picture of wonder as the children gaze at the immense and commanding structure. Approaching the cliff, the little fleet of boats continues forward, bringing the children to the base of the towering fortress. Once safely ashore, the new students follow one another into the castle, their footsteps echoing as they ascend a wide marble staircase. Reaching the upper landing, they observe long, thin fingers rhythmically tapping the stone balustrade in patient anticipation. Standing authoritatively before the massive oak doors, Professor McGonagall faces the group of eager first-years as they arrive at the top of the stairs. Among them, Neville Longbottom bends down to retrieve his misplaced brown toad and then looks up at Professor McGonagall with a touch of nervousness."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Harry is amazed as he observes a boy and his twin brother disappear through a wall with their trolley. A nearby girl smiles at him, prompting Harry to line up his own trolley, take a deep breath, and charge at the wall. He emerges safely on Platform 9 and three-quarters, delighted by the sight of a handsome steam engine. As the train steams through the countryside, Harry enjoys the scenery from his private carriage. He encounters a red-haired boy, Ron, who has dirt on his nose and offers a bag of squashed sandwiches. In return, Harry shares his sweets. They explore various treats, with Harry being caught off-guard by a lively chocolate frog that leaps out of the window. Amidst their journey, Ron attempts to use his wand, and a girl named Hermione arrives, mending Harry's broken spectacles with her own wand. As the train approaches a small station, Hagrid waits on the platform with a powerful lamp. The students, dressed in black cloaks over their uniforms, are led by Hagrid to a pitch-black lake. There, they board small, lamp-lit wooden boats and drift across the misty waters. The moonlight reveals the vast castle perched on the opposite side, its imposing structure sparkling with light from hundreds of windows. Upon reaching the shore, the students disembark and ascend a wide marble staircase inside the castle. At the top, they are greeted by Professor McGonagall as Neville Longbottom retrieves his lost toad, casting nervous glances at her."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Harry looks on in amazement as the boy, dressed in the distinctive Hogwarts school uniform, lines up his trolley and disappears through the wall of King's Cross Station, a bustling hub in London, followed by his identical twin brother. The little girl, wearing a scarf with the Gryffindor house colors, smiles at him while Harry looks at the solid brick wall that separates the magical platform from the rest of the station. He aims his trolley, takes a deep breath, runs straight at the wall, and finds himself safely on the other side, where he pushes his trolley onto Platform 9 and three-quarters, a secret magical platform hidden from non-wizarding folk. Harry smiles with delight beside the platform, where a handsome steam engine, The Hogwarts Express, stands ready to take students to their school. The train steams through the picturesque countryside of Scotland, and Harry has a carriage to himself. He sits by the window looking out at the passing scenery of rolling hills and dense forests. A red-haired boy, Ron Weasley, who comes from a long line of wizards, has a smudge of dirt on his nose, and Ron's eyes widen in surprise as he spots Harry. Harry pushes back his hair, revealing his famous lightning-shaped scar, as Ron holds up a bag of squashed sandwiches. Harry pulls out a handful of gold coins, wizarding currency known as Galleons, and the boys share the sweets, which include Bertie Bott's Every Flavour Beans, notorious for their unpredictable flavors. Harry pulls a face as he takes a bean out of his mouth then opens a box marked chocolate frog, a popular wizarding treat that, to his amazement, comes to life and leaps through the open window. Harry sees a hologram on the collectible card featuring a famous witch or wizard and looks again in disbelief. A rat, Scabbers, appears, and Ron takes out a wand, gifted by his brother, trying to cast a small spell. A girl at the door, Hermione Granger, known for her academic prowess, pulls a wand out of her cloak and points it at Harry, mending his broken spectacles with a spell. Harry glances at Ron as Hermione looks disapprovingly at Ron on her way out, and he rubs his nose, embarrassed. The train draws into a small country station known as Hogsmeade, the only all-wizarding village in Britain, where Hagrid is waiting on the platform, holding a powerful lamp that illuminates the misty night. Wearing black cloaks over their school uniforms, the pupils are dwarfed by the giant Hagrid, the Keeper of Keys and Grounds at Hogwarts, and Ron gazes up at him in amazement. Hagrid leads the way to the shores of a mysterious pitch-black lake known as the Great Lake, where four at a time, the children crawl into small, wooden boats, each softly lit by lamps suspended by a pole. The boats start to move, and half hidden by clouds, the moon casts a faint blue light. Mist rises from the water as the tiny wooden boats drift silently across the lake. In the distance, the children see the turrets and towers of a vast castle, Hogwarts School of Witchcraft and Wizardry, perched high on the other side. Light sparkles from hundreds of windows, and the children gaze in wonder at the huge, imposing building. It towers above them as the fleet of little boats glides closer to the cliff on which it stands. Safely disembarked, the crowd of new students follow each other into the castle and up a wide marble staircase. On the upper landing, long, thin fingers tap the stone balustrade patiently. Standing in front of huge oak doors, the tall figure of Professor McGonagall, the Deputy Headmistress known for her stern demeanor, faces the first-years as they reach the top of the stairs. Neville Longbottom, a shy and forgetful boy, picks up his lost brown toad named Trevor and looks up at Professor McGonagall nervously."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Harry looks on in amazement as the boy lines up his trolley and disappears through the wall followed by his identical twin brother. The little girl smiles at him while Harry looks at the solid brick wall. He aims his trolley takes a deep breath runs straight at the wall and finds himself safely on the other side where he pushes his trolley on to Platform 9 and threequarters. Harry smiles with delight beside the platform where a handsome steam engine stands. The train steams through the countryside and Harry has a carriage to himself. He sits by the window looking out at the passing scenery. A redhaired boy has a smudge of dirt on his nose and Ron's eyes widen. Harry pushes back his hair as Ron holds up a bag of squashed sandwiches. Harry pulls out a handful of gold coins and the boys share the sweets. Harry pulls a face as he takes a bean out of his mouth then opens a box marked chocolate frog. The frog jumps and leaps through the open window. Harry sees a hologram on the card and looks again. A rat appears and Ron takes out a wand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. A girl at the door pulls a wand out of her cloak and points it at Harry mending his broken spectacles. Harry glances at Ron as Hermione looks disapprovingly at Ron on her way out and he rubs his nose. The train draws into a small country station where Hagrid is waiting on the platform holding a powerful lamp. Wearing black cloaks over their school uniforms the pupils are dwarfed by the giant Hagrid and Ron gazes up at him in amazement. Hagrid leads the way to the shores of a mysterious pitchblack lake where four at a time the children crawl into small wooden boats each softly lit by lamps suspended by a pole. The boats start to move and half hidden by clouds the moon casts a faint blue light. Mist rises from the water as the tiny wooden boats drift silently across the lake. In the distance the children see the turrets and towers of a vast castle perched high on the other side. Light sparkles from hundreds of windows and the children gaze in wonder at the huge imposing building. It towers above them as the fleet of little boats glides closer to the cliff on which it stands. Safely disembarked the crowd of new students follow each other into the castle and up a wide marble staircase. On the upper landing long thin fingers tap the stone balustrade patiently Standing in front of huge oak doors. the tall figure of Professor McGonagall faces the firstyears as they reach the top of the stairs. Neville Longbottom picks up his lost brown toad and looks up at Professor McGonagall nervously."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Harry looks on in amazement as the boy lines up his trolley and disappears through the wall followed by his identical twin brother. The little girl smiles at him while Harry looks at the solid brick wall. He aims his trolley takes a deep breath runs straight at the wall and finds himself safely on the other side where he pushes his trolley on to Platform 9 and threequarters. Harry smiles with delight beside the platform where a handsome steam engine stands. The train steams through the countryside and Harry has a carriage to himself. He sits by the window looking out at the passing scenery. A redhaired boy has a smudge of dirt on his nose and Ron's eyes widen. Harry pushes back his hair as Ron holds up a bag of squashed sandwiches. Harry pulls out a handful of gold coins and the boys share the sweets. Harry pulls a face as he takes a bean out of his mouth then opens a box marked chocolate frog. The frog jumps and leaps through the open window. Harry sees a hologram on the card and looks again. A rat appears and Ron takes out a wand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. A girl at the door pulls a wand out of her cloak and points it at Harry mending his broken spectacles. Harry glances at Ron as Hermione looks disapprovingly at Ron on her way out and he rubs his nose. The train draws into a small country station where Hagrid is waiting on the platform holding a powerful lamp. Wearing black cloaks over their school uniforms the pupils are dwarfed by the giant Hagrid and Ron gazes up at him in amazement. Hagrid leads the way to the shores of a mysterious pitchblack lake where four at a time the children crawl into small wooden boats each softly lit by lamps suspended by a pole. The boats start to move and half hidden by clouds the moon casts a faint blue light. Mist rises from the water as the tiny wooden boats drift silently across the lake. In the distance the children see the turrets and towers of a vast castle perched high on the other side. Light sparkles from hundreds of windows and the children gaze in wonder at the huge imposing building. It towers above them as the fleet of little boats glides closer to the cliff on which it stands. Safely disembarked the crowd of new students follow each other into the castle and up a wide marble staircase. On the upper landing long thin fingers tap the stone balustrade patiently Standing in front of huge oak doors. the tall figure of Professor McGonagall faces the firstyears as they reach the top of the stairs. Neville Longbottom picks up his lost brown toad and looks up at Professor McGonagall nervously."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Harry looks on in amazement as the boy lines up his trolley and disappears through the wall followed by his identical twin brother. The little girl smiles at him while Harry looks at the solid brick wall. He aims his trolley takes a deep breath runs straight at the wall and finds himself safely on the other side where he pushes his trolley on to Platform 9 and threequarters. Harry smiles with delight beside the platform where a handsome steam engine stands. The train steams through the countryside and Harry has a carriage to himself. He sits by the window looking out at the passing scenery. A redhaired boy has a smudge of dirt on his nose and Ron's eyes widen. In the distance the children see the turrets and towers of a vast castle perched high on the other side. Light sparkles from hundreds of windows and the children gaze in wonder at the huge imposing building. It towers above them as the fleet of little boats glides closer to the cliff on which it stands. Safely disembarked the crowd of new students follow each other into the castle and up a wide marble staircase. On the upper landing long thin fingers tap the stone balustrade patiently Standing in front of huge oak doors. the tall figure of Professor McGonagall faces the firstyears as they reach the top of the stairs. Neville Longbottom picks up his lost brown toad and looks up at Professor McGonagall nervously."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Harry looks on in amazement as the boy lines up his trolley and disappears through the wall followed by his identical twin brother. The little girl smiles at him while Harry looks at the solid brick wall. He aims his trolley takes a deep breath runs straight at the wall and finds himself safely on the other side where he pushes his trolley on to Platform 9 and threequarters. On the upper landing long thin fingers tap the stone balustrade patiently Standing in front of huge oak doors. the tall figure of Professor McGonagall faces the firstyears as they reach the top of the stairs. Neville Longbottom picks up his lost brown toad and looks up at Professor McGonagall nervously."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Barry blinks in bewilderment as the cat lines up its skateboard and vanishes into the hedge followed by its mirror-image twin sister. The small monkey cheers at Barry while he stares at the solid iron gate. He aligns his skateboard, exhales deeply, dashes directly at the gate, and finds himself securely on the other side, where he rolls his skateboard onto Platform 8 and a fifth. Barry grins with joy beside the platform, where a magnificent wooden ship waits. The vessel sails through the desert, and Barry has a cabin to himself. He lounges by the porthole gazing out at the passing dunes. A blonde dog has a smudge of paint on her paw, and Tim's ears twitch. Barry adjusts his cape as Tim holds up a box of squished cupcakes. Barry pulls out a pouch of silver marbles, and the dogs share the pastries. Barry winces as he spits out a gummy worm then reveals a package labeled peppermint lizard. The lizard springs and hops through the open hatch. Barry spots a picture on the poster and squints again. A parrot emerges, and Tim retrieves a flute. A parrot at the entrance draws a flute out of its satchel and aims it at Barry, fixing his cracked helmet. Barry peeks at Tim as Geraldine gazes disapprovingly at Tim on her way out, and he scratches his paw. The ship docks at a quaint mountain harbor where Gandalf waits on the pier, clutching a glowing torch. Wearing white cloaks over their school blazers, the rabbits are overshadowed by the enormous Gandalf, and Tim stares up at him in wonder. Gandalf directs the path to the edge of an enchanting white pond, where six at a time, the pandas slide into large, silver sleds, each dimly lit by candles hanging from a branch. The sleds begin to glide, and veiled by mist, the sun casts a faint red glow. Fog drifts from the ice as the small silver sleds coast quietly across the pond. In the distance, the pandas see the spires and domes of an enormous palace perched high on the opposite shore. Fireworks flicker from hundreds of turrets, and the pandas stare in awe at the gigantic formidable structure. It looms above them as the convoy of small sleds drifts nearer to the hillside on which it stands. Safely alighted, the throng of young learners trails each other into the palace and up a narrow wooden escalator. On the upper platform, short, thick hooves tap the metal railing with impatience. Standing before massive glass doors, the short entity of Headmaster Marmaduke faces the newcomers as they reach the summit of the escalator. Trevor Bigbottom collects his missing green frog and glances up at Headmaster Marmaduke nervously."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Harry watches in awe as a boy and his twin vanish through a wall. He follows suit, emerging on Platform 9 and three-quarters. Delighted, Harry sees a steam engine and boards the train, enjoying the countryside view from his carriage. He meets Ron, a red-haired boy with a dirty nose, and they share sweets purchased with Harry's gold coins. Harry is amused by a jumping chocolate frog and intrigued by a hologram card. A girl named Hermione fixes Harry’s glasses with her wand, then leaves, casting a disapproving glance at Ron. The train arrives at a small station where Hagrid, a giant holding a lamp, awaits. Wearing school cloaks, the students follow Hagrid to a dark lake, boarding small lit boats. The boats glide silently across the misty water, revealing a vast castle with sparkling lights. Awestruck, the students disembark and enter the castle, ascending a marble staircase. On the upper landing, Professor McGonagall waits by huge oak doors as nervous first-years, including Neville Longbottom, gather at the top."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Neville Longbottom picks up his lost brown toad and looks up at Professor McGonagall nervously the tall figure of Professor McGonagall faces the firstyears as they reach the top of the stairs On the upper landing long thin fingers tap the stone balustrade patiently Standing in front of huge oak doors Safely disembarked the crowd of new students follow each other into the castle and up a wide marble staircase It towers above them as the fleet of little boats glides closer to the cliff on which it stands Light sparkles from hundreds of windows and the children gaze in wonder at the huge imposing building In the distance the children see the turrets and towers of a vast castle perched high on the other side Mist rises from the water as the tiny wooden boats drift silently across the lake The boats start to move and half hidden by clouds the moon casts a faint blue light Hagrid leads the way to the shores of a mysterious pitchblack lake where four at a time the children crawl into small wooden boats each softly lit by lamps suspended by a pole Wearing black cloaks over their school uniforms the pupils are dwarfed by the giant Hagrid and Ron gazes up at him in amazement The train draws into a small country station where Hagrid is waiting on the platform holding a powerful lamp Harry glances at Ron as Hermione looks disapprovingly at Ron on her way out and he rubs his nose A girl at the door pulls a wand out of her cloak and points it at Harry mending his broken spectacles A rat appears and Ron takes out a wand Harry sees a hologram on the card and looks again The frog jumps and leaps through the open window Harry pulls a face as he takes a bean out of his mouth then opens a box marked chocolate frog Harry pulls out a handful of gold coins and the boys share the sweets Harry pushes back his hair as Ron holds up a bag of squashed sandwiches A redhaired boy has a smudge of dirt on his nose and Ron's eyes widen He sits by the window looking out at the passing scenery The train steams through the countryside and Harry has a carriage to himself Harry smiles with delight beside the platform where a handsome steam engine stands He aims his trolley takes a deep breath runs straight at the wall and finds himself safely on the other side where he pushes his trolley on to Platform 9 and threequarters The little girl smiles at him while Harry looks at the solid brick wall Harry looks on in amazement as the boy lines up his trolley and disappears through the wall followed by his identical twin brother"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The little girl smiles at him while Harry looks at the solid brick wall Harry looks on in amazement as the boy lines up his trolley and disappears through the wall followed by his identical twin brother Harry smiles with delight beside the platform where a handsome steam engine stands He aims his trolley takes a deep breath runs straight at the wall and finds himself safely on the other side where he pushes his trolley on to Platform 9 and threequarters He sits by the window looking out at the passing scenery The train steams through the countryside and Harry has a carriage to himself Harry pushes back his hair as Ron holds up a bag of squashed sandwiches A redhaired boy has a smudge of dirt on his nose and Ron's eyes widen Harry pulls a face as he takes a bean out of his mouth then opens a box marked chocolate frog Harry pulls out a handful of gold coins and the boys share the sweets Harry sees a hologram on the card and looks again The frog jumps and leaps through the open window A girl at the door pulls a wand out of her cloak and points it at Harry mending his broken spectacles A rat appears and Ron takes out a wand The train draws into a small country station where Hagrid is waiting on the platform holding a powerful lamp Harry glances at Ron as Hermione looks disapprovingly at Ron on her way out and he rubs his nose Hagrid leads the way to the shores of a mysterious pitchblack lake where four at a time the children crawl into small wooden boats each softly lit by lamps suspended by a pole Wearing black cloaks over their school uniforms the pupils are dwarfed by the giant Hagrid and Ron gazes up at him in amazement Mist rises from the water as the tiny wooden boats drift silently across the lake The boats start to move and half hidden by clouds the moon casts a faint blue light Light sparkles from hundreds of windows and the children gaze in wonder at the huge imposing building In the distance the children see the turrets and towers of a vast castle perched high on the other side Safely disembarked the crowd of new students follow each other into the castle and up a wide marble staircase It towers above them as the fleet of little boats glides closer to the cliff on which it stands the tall figure of Professor McGonagall faces the firstyears as they reach the top of the stairs On the upper landing long thin fingers tap the stone balustrade patiently Standing in front of huge oak doors Neville Longbottom picks up his lost brown toad and looks up at Professor McGonagall nervously"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Harry glances at Ron as Hermione looks disapprovingly at Ron on her way out and he rubs his nose The train draws into a small country station where Hagrid is waiting on the platform holding a powerful lamp Wearing black cloaks over their school uniforms the pupils are dwarfed by the giant Hagrid and Ron gazes up at him in amazement Hagrid leads the way to the shores of a mysterious pitchblack lake where four at a time the children crawl into small wooden boats each softly lit by lamps suspended by a pole The boats start to move and half hidden by clouds the moon casts a faint blue light Mist rises from the water as the tiny wooden boats drift silently across the lake In the distance the children see the turrets and towers of a vast castle perched high on the other side Light sparkles from hundreds of windows and the children gaze in wonder at the huge imposing building It towers above them as the fleet of little boats glides closer to the cliff on which it stands Safely disembarked the crowd of new students follow each other into the castle and up a wide marble staircase On the upper landing long thin fingers tap the stone balustrade patiently Standing in front of huge oak doors the tall figure of Professor McGonagall faces the firstyears as they reach the top of the stairs Neville Longbottom picks up his lost brown toad and looks up at Professor McGonagall nervously Harry looks on in amazement as the boy lines up his trolley and disappears through the wall followed by his identical twin brother The little girl smiles at him while Harry looks at the solid brick wall He aims his trolley takes a deep breath runs straight at the wall and finds himself safely on the other side where he pushes his trolley on to Platform 9 and threequarters Harry smiles with delight beside the platform where a handsome steam engine stands The train steams through the countryside and Harry has a carriage to himself He sits by the window looking out at the passing scenery A redhaired boy has a smudge of dirt on his nose and Ron's eyes widen Harry pushes back his hair as Ron holds up a bag of squashed sandwiches Harry pulls out a handful of gold coins and the boys share the sweets Harry pulls a face as he takes a bean out of his mouth then opens a box marked chocolate frog The frog jumps and leaps through the open window Harry sees a hologram on the card and looks again A rat appears and Ron takes out a wand A girl at the door pulls a wand out of her cloak and points it at Harry mending his broken spectacles"
        }
      ]
    }
  ]
}