{
  "ground_truth": "A tiny, silvery breath floats back into Sirius' mouth, and his chest heaves as he gives a great sigh. The light draws back across the lake while Harry watches the bright light fade away, leaving only the faint image of a figure standing on the far shore. He falls back beside his godfather, and they lie next to each other, sprawled unconscious on the stony beach. In the hospital wing, he pats Ron's bandaged leg and walks to the door. Hermione is wearing a long chain necklace, and she puts it around Harry's neck as well and spins its golden pendant. The room is filled with people moving backwards very fast, and she replaces the necklace. The wheels of the great clock turn as they cross the quadrangle below and run along the cloister. She shows him the pendant, and they hide. Harry and Hermione creep out from their hiding place, and Harry looks around nervously as they run towards a huge stone. Standing behind it, they look down the hill and watch themselves running along the path below towards Hagrid's cottage and the pumpkin patch. Harry and Hermione hurry down the path and hide behind the pile of pumpkins as Dumbledore, Fudge, and the Executioner arrive. She pulls him back out of sight when Hermione sees a pebble lying on the pumpkin in front of her and throws it through the window, then throws another as Harry rubs his head. Dumbledore knocks at the front door, and as the three men go inside, the back door opens. Quickly, they run into the forest and observe themselves and Ron leave the cottage and hide behind the pumpkins. Pushing aside a branch, Hermione stares at herself in the past, and the branch springs back. Hermione and Harry watch themselves and Ron run back up the hill, then they creep back into the garden and peer towards the cottage. Crows peck at Harry's feet as he steals across the garden, and Harry bows to Buckbeak, who lowers his head in return. Harry stretches towards the post where Buckbeak is chained, and a crow pecks his hand as he undoes the chain. Buckbeak won't move, so Harry hauls on the chain. Hermione throws the ferret, and Buckbeak follows them into the forest. Fudge turns as the Executioner raises his axe and splits a pumpkin in frustration. Harry and Hermione use the dead ferrets to lure Buckbeak deeper and deeper into the safety of the forest. Leaving the hippogriff in a clearing, they run out of the trees until they see the Whomping Willow in the distance, flailing its branches. Lupin points his wand, and the tree falls still before he goes down under the roots. Snape follows Lupin, and they sit down beside each other on the grass. As darkness falls, a swarm of bats flutters through the forest.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A small, argent exhalation drifts back into Sirius' mouth, and his torso rises as he gives a significant breath. The illumination retracts across the lake while Harry observes the vivid light diminish, leaving only the dim outline of a silhouette standing on the distant shore. He collapses beside his godparent, and they recline next to each other, sprawled senseless on the rocky shore. In the infirmary, he pats Ron's wrapped limb and strolls to the entrance. Hermione is wearing a lengthy chain locket, and she places it around Harry's neck as well and spins its aureate medallion. The chamber is filled with individuals moving in reverse very swiftly, and she replaces the locket. The gears of the enormous timepiece rotate as they traverse the courtyard beneath and dash along the walkway. She reveals to him the medallion, and they conceal themselves. Harry and Hermione sneak out from their hiding spot, and Harry glances around anxiously as they sprint towards a massive boulder. Positioned behind it, they gaze down the incline and observe their own forms running along the trail below towards Hagrid's cabin and the gourd patch. Harry and Hermione hasten down the pathway and conceal behind the stack of gourds as Dumbledore, Fudge, and the Executioner arrive. She pulls him back out of sight when Hermione notices a stone lying on the gourd in front of her and hurls it through the window, then hurls another as Harry massages his head. Dumbledore taps at the main entrance, and as the three men proceed inside, the rear door opens. Swiftly, they dash into the woodland and watch themselves and Ron exit the cabin and hide behind the gourds. Shoving aside a branch, Hermione gazes at herself in the past, and the branch recoils. Hermione and Harry observe themselves and Ron sprint back up the incline, then they stealthily re-enter the yard and peer towards the cabin. Corvids peck at Harry's feet as he sneaks across the yard, and Harry bows to Buckbeak, who lowers his head in response. Harry extends towards the post where Buckbeak is tethered, and a corvid pecks his hand as he loosens the chain. Buckbeak will not move, so Harry pulls on the chain. Hermione throws the weasel, and Buckbeak follows them into the woodland. Fudge turns as the Executioner lifts his blade and cleaves a gourd in exasperation. Harry and Hermione utilize the deceased weasels to entice Buckbeak further and further into the safety of the forest. Leaving the hippogriff in a glade, they sprint out of the woods until they see the Whomping Willow in the expanse, thrashing its branches. Lupin directs his wand, and the tree becomes motionless before he goes down under the roots. Snape pursues Lupin, and they sit down beside each other on the grass. As nightfall descends, a swarm of nocturnal flying mammals flutters through the forest."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A tiny, silvery breath is floated back into Sirius' mouth, and a great sigh is given by him as his chest heaves. The light is drawn back across the lake while the bright light is watched by Harry as it fades away, leaving only the faint image of a figure standing on the far shore. He falls back beside his godfather, and they are lain next to each other, sprawled unconscious on the stony beach. In the hospital wing, Ron’s bandaged leg is patted by him, and he walks to the door. A long chain necklace is worn by Hermione, and it is put around Harry's neck as well, and its golden pendant is spun by her. The room is filled with people moving backwards very fast, and the necklace is replaced by her. The wheels of the great clock are turned as the quadrangle below is crossed by them and the cloister is run along. The pendant is shown to him, and they are hidden by her. Harry and Hermione are crept out from by their hiding place, and the area is looked around nervously by Harry as a huge stone is run towards by them. Standing behind it, the hill is looked down by them and themselves are watched running along the path below towards Hagrid's cottage and the pumpkin patch. The path is hurriedly gone down by Harry and Hermione, and the pile of pumpkins is hidden behind by them as Dumbledore, Fudge, and the Executioner arrive. He is pulled back out of sight by her when a pebble lying on the pumpkin in front of her is seen by Hermione, and it is thrown through the window, then another is thrown as his head is rubbed by Harry. The front door is knocked at by Dumbledore, and as the three men go inside, the back door is opened. Quickly, the forest is run into by them, and themselves and Ron are observed leaving the cottage and hiding behind the pumpkins. A branch is pushed aside by Hermione, and herself in the past is stared at, and the branch springs back. Hermione and Harry watch themselves and Ron run back up the hill, then the garden is crept back into by them and the cottage is peered towards. Harry's feet are pecked at by crows as the garden is stolen across by him, and Buckbeak is bowed to by Harry, who lowers his head in return. The post where Buckbeak is chained is stretched towards by Harry, and his hand is pecked by a crow as the chain is undone by him. Buckbeak won't move, so the chain is hauled on by Harry. The ferret is thrown by Hermione, and Buckbeak is followed by them into the forest. Fudge turns as the axe is raised by the Executioner and a pumpkin is split in frustration. Buckbeak is lured deeper and deeper into the safety of the forest by Harry and Hermione using the dead ferrets. Leaving the hippogriff in a clearing, the trees are run out of by them until the Whomping Willow in the distance is seen by them, flailing its branches. Lupin points his wand, and the tree is made to fall still before he goes down under the roots. Lupin is followed by Snape, and they sit down beside each other on the grass. As darkness falls, a swarm of bats is fluttered through by the forest."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A silvery breath floats back into Sirius' mouth, causing his chest to heave with a sigh. The light retreats across the lake as Harry watches it fade, leaving a faint figure on the far shore. Harry falls beside his godfather, and both lie unconscious on the stony beach. In the hospital wing, Harry pats Ron's bandaged leg and walks to the door. Hermione, wearing a long chain necklace, places it around Harry's neck and spins the golden pendant. People move backward quickly as the necklace is replaced. The great clock's wheels turn as they cross the quadrangle and run along the cloister. She shows him the pendant, and they hide. Emerging from hiding, they run toward a huge stone. From there, they watch themselves running towards Hagrid's cottage and the pumpkin patch. Harry and Hermione hurry down the path, hiding behind the pumpkins as Dumbledore, Fudge, and the Executioner arrive. When Hermione spots a pebble, she throws it at the window, then another as Harry rubs his head. The back door opens, and they quickly run into the forest, observing themselves and Ron leaving the cottage. Hermione stares at her past self, and the branch she pushed springs back. They watch themselves and Ron run back up the hill, then return to the garden, peering towards the cottage. Crows peck at Harry's feet as he sneaks across the garden and bows to Buckbeak, who responds in kind. Harry stretches to the post where Buckbeak is chained, a crow pecking his hand as he undoes it. Buckbeak won't budge, so Harry pulls on the chain. Hermione throws the ferret to lure Buckbeak into the forest. Fudge turns as the Executioner splits a pumpkin in frustration. Harry and Hermione use the ferrets to lure Buckbeak deeper into the forest. Leaving the hippogriff in a clearing, they run until they see the Whomping Willow thrashing in the distance. Lupin points his wand, calming the tree, and goes down under the roots. Snape follows him, and they sit on the grass. As night falls, bats flutter through the forest."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A silvery breath floats into Sirius' mouth, and his chest heaves with a sigh. The light withdraws across the lake as Harry watches it fade, leaving a faint figure on the far shore. He collapses beside his godfather, both unconscious on the beach. In the hospital wing, Harry pats Ron's bandaged leg, walks to the door, and Hermione, wearing a chain necklace, places it around Harry's neck, spinning its pendant. The room fills with people moving backwards fast, and she removes the necklace. The great clock's wheels turn as they cross the quadrangle and run along the cloister. She shows him the pendant, and they hide. Harry and Hermione sneak out, running towards a stone. Hidden behind it, they watch themselves running to Hagrid's cottage. Rushing down, they hide behind pumpkins as Dumbledore, Fudge, and the Executioner arrive. Hermione throws pebbles through the window, and Harry rubs his head. They run into the forest, observing themselves and Ron leaving the cottage to hide behind the pumpkins. Hermione stares at herself in the past, the branch springs back. Watching themselves run up the hill, they creep back into the garden, peering at the cottage. Crows peck at Harry's feet as he bows to Buckbeak, who returns the gesture. Harry stretches towards Buckbeak's chain, a crow pecks his hand. Buckbeak won't move, so Harry pulls the chain. Hermione throws a ferret to lure Buckbeak into the forest. Fudge turns as the Executioner's axe splits a pumpkin. Using ferrets, they lure Buckbeak deeper into the forest. Leaving the hippogriff in a clearing, they run until seeing the Whomping Willow. Lupin points his wand, calming the tree before going under its roots, followed by Snape, sitting on the grass. As darkness falls, bats flutter through the forest."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A delicate, silvery breath slowly floats back into the mouth of Sirius, and his chest rises and falls dramatically as he lets out a great, relieved sigh. Meanwhile, the bright light gradually retracts across the expansive lake while Harry intently observes the vivid light slowly fade away, leaving only the faint and hazy image of a solitary figure standing solemnly on the distant shore. Exhausted, he collapses back beside his beloved godfather, and together they lie side by side, sprawled and unconscious, on the rough, stony beach.\n\nLater, in the quiet hospital wing, Harry gently pats Ron's bandaged leg before making his way toward the door. Hermione, adorned with a long, elegant chain necklace, places it carefully around Harry's neck as well, giving its golden pendant a purposeful spin. The room around them seems to be filled with people moving rapidly backward, as if in fast motion, and she replaces the necklace delicately. As they cross the quadrangle below, with the wheels of the great clock turning with purpose, they sprint along the cloister. She discreetly shows him the pendant, and together they hide.\n\nWith cautious steps, Harry and Hermione stealthily emerge from their concealed hiding place, and Harry nervously surveys the surroundings as they dash towards an enormous stone for cover. Positioned behind it, they peer down the hill and keenly observe their own figures running along the path below, heading towards Hagrid's quaint cottage and the adjacent pumpkin patch. In a hurry, Harry and Hermione make their way down the path and take cover behind the pile of pumpkins, just as Dumbledore, Fudge, and the menacing Executioner arrive.\n\nWhen Hermione notices a small pebble resting on a pumpkin in front of her, she pulls Harry back out of sight and skillfully tosses it through the window, following up with another as Harry rubs his head in response. At that moment, Dumbledore knocks on the front door, and as the three men venture inside, the back door quietly opens. In a split second, they dash into the forest, where they watch themselves and Ron leave the cottage, hiding behind the pumpkins in the process. Pushing aside a low-hanging branch, Hermione intently stares at herself in the past, and the branch springs back into place.\n\nHermione and Harry watch as their past selves and Ron hurry back up the hill, then they discreetly creep back into the garden, peering closely toward the cottage. Crows peck persistently at Harry's feet as he carefully crosses the garden, and Harry respectfully bows to Buckbeak, who lowers his head in acknowledgment. Harry stretches purposefully towards the post where Buckbeak is securely chained, only to have a pesky crow peck at his hand as he works to undo the chain. Buckbeak remains hesitant to move, so Harry pulls with determination on the chain. Hermione skillfully throws the ferret, and, at last, Buckbeak follows them into the safety of the forest. Fudge turns just as the Executioner raises his axe in frustration, splitting a nearby pumpkin. Harry and Hermione cleverly use the deceased ferrets to coax Buckbeak deeper and deeper into the protective embrace of the forest. Leaving the hippogriff in a secluded clearing, they race out of the trees until they spot the formidable Whomping Willow in the distance, its branches flailing wildly.\n\nLupin raises his wand with precision, and the tree suddenly falls still before he disappears down under its roots. Snape cautiously follows Lupin, and the two settle beside each other on the soft grass. As darkness envelops the forest, a swarm of bats flutters restlessly through the trees, adding to the atmosphere of suspense."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A delicate, shimmering, and silvery breath slowly and gracefully floats back into the open mouth of Sirius, and with this breath, his chest rises and falls dramatically, as though marking his return to life. He lets out a deep, great sigh of relief that echoes the sentiment of being freed from an invisible weight. Meanwhile, the bright, luminous light gradually retracts and withdraws across the expansive, seemingly boundless lake, while Harry intently observes this vivid, glowing light slowly fade away into the distance. It leaves behind only the faint and hazy image of a solitary figure, standing solemnly and contemplatively on the distant shore. Exhausted and utterly spent, Harry collapses back beside his beloved godfather, and together the two lie side by side, sprawled out and unconscious, on the rough, stony beach, like two weary travelers who have reached their journey's end.\n\nLater, in the quiet and serene atmosphere of the hospital wing, Harry gently and with care pats Ron's bandaged leg before he makes his way cautiously toward the door. Hermione, adorned with a beautiful, long, elegant chain necklace, places it carefully and thoughtfully around Harry's neck as well. She gives its golden pendant a purposeful, deliberate spin. The room around them seems to be filled with people moving rapidly backward, as if in fast motion, creating a surreal scene, and she then replaces the necklace delicately. As they cross the quadrangle below, with the wheels of the great clock turning with precision and purpose, they sprint along the cloister with urgency. She discreetly reveals to him the pendant, and together they retreat into their hiding spot.\n\nWith cautious and deliberate steps, Harry and Hermione stealthily emerge from their concealed hiding place, and Harry nervously surveys the surrounding area as they dash with speed towards an enormous, protective stone for cover. Safely positioned behind it, they peer down the hill and keenly observe their own figures running along the path below, heading toward Hagrid's quaint and rustic cottage and the adjacent pumpkin patch, which is full of vibrant colors. In a hurry and with purpose, Harry and Hermione make their way swiftly down the path and take cover behind the pile of pumpkins, just as Dumbledore, Fudge, and the menacing, stern Executioner arrive.\n\nWhen Hermione notices a small, insignificant pebble resting on a pumpkin in front of her, she quickly pulls Harry back out of sight and skillfully tosses it through the open window, following up with another as Harry rubs his head in response to the distraction. At that moment, Dumbledore knocks on the front door, and as the three men venture inside, the back door quietly creaks open. In a split second, they dash into the depths of the forest, where they watch themselves and Ron leave the cozy cottage, hiding behind the protective pumpkins in the process. Pushing aside a low-hanging branch, Hermione intently and thoughtfully stares at herself in the past, and the branch springs back into its original place.\n\nHermione and Harry watch intently as their past selves and Ron hurry back up the hill, then they discreetly creep back into the lush garden, peering closely and cautiously toward the cottage. Crows peck persistently at Harry's feet as he carefully and deliberately crosses the garden, and Harry respectfully and ceremoniously bows to Buckbeak, who lowers his mighty head in acknowledgment. Harry stretches with purpose towards the post where Buckbeak is securely and tightly chained, only to have a persistent and pesky crow peck at his hand as he works diligently to undo the stubborn chain. Buckbeak remains hesitant and unsure to move, so Harry pulls with determination and resolve on the chain. Hermione skillfully and cleverly throws the ferret, and, at last, Buckbeak follows them into the safety and cover of the forest. Fudge turns just as the Executioner raises his axe in palpable frustration, splitting a nearby pumpkin in two. Harry and Hermione cleverly use the deceased ferrets to coax Buckbeak deeper and deeper into the protective and comforting embrace of the forest until they leave the majestic hippogriff in a secluded, hidden clearing. They race out of the dense trees until they spot the formidable, towering Whomping Willow in the distance, its menacing branches flailing wildly in every direction.\n\nLupin raises his wand with precision and intent, and the great tree suddenly falls still and silent before he disappears down under its ancient roots. Snape cautiously follows Lupin, and the two settle beside each other on the soft, lush grass. As darkness envelops the forest, a swarm of bats flutters restlessly through the trees, adding to the atmosphere of suspense and mystery that surrounds them."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A tiny, silvery breath floats gracefully back into Sirius' mouth, and as it enters, his chest rises and falls with a deep, life-infusing sigh. Meanwhile, the light draws itself back across the lake, shrinking gradually in intensity as Harry watches intently, focusing on the bright light until it dims completely, leaving only a faint silhouette of a person standing on the far shore. Overwhelmed by the events, Harry collapses beside his godfather, their bodies lying next to each other, both sprawling unconscious on the rough, stony beach. Transitioning to the hospital wing, Harry gently pats Ron's bandaged leg as a gesture of encouragement and then turns to walk towards the door, his movements purposeful and deliberate. As he approaches, Hermione, wearing a long chain necklace, steps forward, placing the chain around Harry's neck as well, and with a deft motion, she spins its golden pendant, initiating its mysterious power. The room around them fills with the surreal sight of people moving backwards at a rapid pace, creating a dizzying effect, and with a sense of completion, she carefully returns the necklace to its place. Moving in unison, they cross the quadrangle below, the wheels of the great clock ticking in synchrony with their steps as they run briskly along the cloister. Hermione shows Harry the pendant once more, ensuring he understands its significance, and they discreetly find a place to hide. Emerging cautiously from their hiding spot, Harry and Hermione scan their surroundings nervously, ensuring they remain unseen, as they dash towards a large stone. Stationed behind it, they peer down the hill, observing themselves running along the path below towards Hagrid's cottage and the nearby pumpkin patch. With urgency, Harry and Hermione hurry down the path and conceal themselves behind the pile of pumpkins, using the large gourds as effective cover while Dumbledore, Fudge, and the Executioner arrive on the scene. Alert to the situation, Hermione swiftly pulls Harry back out of sight when something catches her attention—a small pebble resting on the pumpkin in front of her. She picks it up and throws it through a window, the sound serving as a strategic distraction, then tosses another as Harry instinctively rubs his head. Dumbledore knocks at the front door, and as the three men enter the cottage, the back door opens, creating an opportunity for quick action. Seizing the moment, they dart into the forest, pausing to watch their past selves along with Ron leave the cottage and find cover behind the pumpkins. Pushing aside a branch to get a more unobstructed view, Hermione catches sight of her past self, the branch springing back as she lets go. Observing from a distance, Hermione and Harry watch their past selves and Ron make their way back up the hill, and once they are safely out of view, they stealthily re-enter the garden and peer cautiously towards the cottage. As they move across the garden, crows peck at Harry's feet, prompting him to tread carefully, and he respectfully bows to Buckbeak, who responds by lowering his head in acknowledgment. Determined to free the creature, Harry stretches his hand towards the post where Buckbeak is chained, wincing as a crow pecks at his hand while he skillfully undoes the chain. Initially reluctant to move, Buckbeak stands firm, but Harry, showing resolve, tugs the chain with more force. To encourage Buckbeak, Hermione throws the ferret, enticing the hippogriff to follow them into the safety of the forest. Meanwhile, Fudge turns back as the Executioner raises his axe, only to release his frustration by splitting a pumpkin instead. Together, Harry and Hermione resourcefully use the dead ferrets to lure Buckbeak deeper and deeper into the forest's protective cover. Once they have securely left the hippogriff in a clearing, they sprint out from the trees, their eyes set on the distant silhouette of the Whomping Willow, its branches flailing wildly. At the right moment, Lupin arrives and deftly points his wand at the tree, bringing it to an immediate standstill before he descends under its massive roots. Snape follows right after, tracing Lupin's steps, and the two sit down beside each other on the grass. As darkness blankets the landscape, a swarm of bats takes to the air, flapping through the dense forest with chaotic elegance."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A tiny, silvery breath floats back into Sirius' mouth, reviving him momentarily before the light withdraws across the lake, leaving the faint image of a figure on the far shore while Harry falls unconscious beside his godfather on the stony beach. Later, in the hospital wing, Harry pats Ron's bandaged leg and heads to the door, where Hermione puts a long chain necklace around both their necks, spins its golden pendant, and reverses time, transporting them to an earlier moment. The wheels of the great clock tick as they cross the quadrangle and hurry along the cloister to hide. Observing their past selves running toward Hagrid's cottage, they race down the path and conceal themselves behind the pumpkins as Dumbledore, Fudge, and the Executioner arrive. Hermione throws pebbles through the window to create a distraction, allowing them to slip into the forest and watch their past selves and Ron hide behind the pumpkins. As they navigate the forest, they stealthily watch the events unfold, creeping back into the garden to free Buckbeak by undoing his chain. Harry bows to Buckbeak while crows peck nearby, and Hermione helps lure the hippogriff into the forest using dead ferrets. After leaving Buckbeak safely in a clearing, they run toward the Whomping Willow, where Lupin stills the tree with his wand and descends under the roots, followed by Snape. As darkness falls, a swarm of bats flutters through the forest."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A tiny, silvery breath floats back into Sirius' mouth, a magical phenomenon known as a \"soul restoration\" in the wizarding world, and his chest heaves as he gives a great sigh. The light, part of a complex charm, draws back across the lake known for its serene and magical properties, while Harry watches the bright light fade away, leaving only the faint image of a figure standing on the far shore, a mysterious presence tied to their past adventures. He falls back beside his godfather, and they lie next to each other, sprawled unconscious on the stony beach, a common feature of the area around Hogwarts School of Witchcraft and Wizardry. In the hospital wing, a place of healing within the castle, he pats Ron's bandaged leg, injured from a recent encounter, and walks to the door. Hermione is wearing a long chain necklace, an object known as a Time-Turner that enables time travel, and she puts it around Harry's neck as well and spins its golden pendant, which acts as a control mechanism. The room is filled with people moving backwards very fast, in the peculiar manner of time being reversed, and she replaces the necklace. The wheels of the great clock, a prominent magical device, turn as they cross the quadrangle below and run along the cloister, an ancient passageway used by students for centuries. She shows him the pendant, and they hide, ensuring they remain unseen during their time-traveling escapade. Harry and Hermione creep out from their hiding place, and Harry looks around nervously as they run towards a huge stone that provides cover from watchful eyes. Standing behind it, they look down the hill and watch themselves running along the path below towards Hagrid's cottage, home to the gentle giant and Keeper of Keys and Grounds at Hogwarts, and the pumpkin patch. Harry and Hermione hurry down the path and hide behind the pile of pumpkins as Dumbledore, Fudge, and the Executioner arrive, moments before carrying out an important mission. She pulls him back out of sight when Hermione sees a pebble lying on the pumpkin in front of her and throws it through the window, then throws another as Harry rubs his head, realizing their past selves are within earshot. Dumbledore knocks at the front door, and as the three men go inside, the back door opens, offering them a narrow escape. Quickly, they run into the forest and observe themselves and Ron leave the cottage and hide behind the pumpkins, reliving their earlier actions. Pushing aside a branch, Hermione stares at herself in the past, and the branch springs back, a reminder of the time paradox they are navigating. Hermione and Harry watch themselves and Ron run back up the hill, then they creep back into the garden and peer towards the cottage, careful not to alter the timeline. Crows peck at Harry's feet as he steals across the garden, and Harry bows to Buckbeak, a proud hippogriff awaiting rescue who lowers his head in return. Harry stretches towards the post where Buckbeak is chained, and a crow pecks his hand as he undoes the chain, a small reminder of the danger surrounding them. Buckbeak won't move, so Harry hauls on the chain, urging him to trust them. Hermione throws the ferret, often used as prey in magical care scenarios, and Buckbeak follows them into the forest, now docile and cooperative. Fudge turns as the Executioner raises his axe and splits a pumpkin in frustration, his failed mission a sign of things not going as planned. Harry and Hermione use the dead ferrets, a crafty lure in magical creature handling, to lure Buckbeak deeper and deeper into the safety of the forest. Leaving the hippogriff in a clearing, they run out of the trees until they see the Whomping Willow, a notorious and violent tree at Hogwarts, in the distance, flailing its branches wildly. Lupin points his wand, using a specialized spell, and the tree falls still before he goes down under the roots, pursuing elusive secrets held beneath. Snape follows Lupin, carrying his own agenda, and they sit down beside each other on the grass, their intentions hidden. As darkness falls, a swarm of bats flutters through the forest, adding to the eerie atmosphere of the night."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He falls back beside his godfather and they lie next to each other sprawled unconscious on the stony beach A tiny silvery breath floats back into Sirius' mouth and his chest heaves as he gives a great sigh Harry and Hermione creep out from their hiding place and Harry looks around nervously as they run towards a huge stone The light draws back across the lake while Harry watches the bright light fade away leaving only the faint image of a figure standing on the far shore Hermione throws the ferret and Buckbeak follows them into the forest He falls back beside his godfather and they lie next to each other sprawled unconscious on the stony beach In the hospital wing he pats Ron's bandaged leg and walks to the door Hermione is wearing a long chain necklace and she puts it around Harry's neck as well and spins its golden pendant In the hospital wing he pats Ron's bandaged leg and walks to the door A tiny silvery breath floats back into Sirius' mouth and his chest heaves as he gives a great sigh Quickly they run into the forest and observe themselves and Ron leave the cottage and hide behind the pumpkins The room is filled with people moving backwards very fast and she replaces the necklace The wheels of the great clock turn as they cross the quadrangle below and run along the cloister She shows him the pendant and they hide She shows him the pendant and they hide Harry and Hermione creep out from their hiding place and Harry looks around nervously as they run towards a huge stone Hermione is wearing a long chain necklace and she puts it around Harry's neck as well and spins its golden pendant Standing behind it they look down the hill and watch themselves running along the path below towards Hagrid's cottage and the pumpkin patch Harry and Hermione hurry down the path and hide behind the pile of pumpkins as Dumbledore Fudge and the Executioner arrive Crows peck at Harry's feet as he steals across the garden and Harry bows to Buckbeak who lowers his head in return She pulls him back out of sight when Hermione sees a pebble lying on the pumpkin in front of her and throws it through the window then throws another as Harry rubs his head Pushing aside a branch Hermione stares at herself in the past and the branch springs back Dumbledore knocks at the front door and as the three men go inside the back door opens Leaving the hippogriff in a clearing they run out of the trees until they see the Whomping Willow in the distance flailing its branches Quickly they run into the forest and observe themselves and Ron leave the cottage and hide behind the pumpkins Pushing aside a branch Hermione stares at herself in the past and the branch springs back Hermione and Harry watch themselves and Ron run back up the hill then they creep back into the garden and peer towards the cottage Lupin points his wand and the tree falls still before he goes down under the roots Crows peck at Harry's feet as he steals across the garden and Harry bows to Buckbeak who lowers his head in return Harry stretches towards the post where Buckbeak is chained and a crow pecks his hand as he undoes the chain Buckbeak will not move so Harry hauls on the chain Fudge turns as the Executioner raises his axe and splits a pumpkin in frustration Snape follows Lupin and they sit down beside each other on the grass Hermione throws the ferret and Buckbeak follows them into the forest Fudge turns as the Executioner raises his axe and splits a pumpkin in frustration Harry and Hermione use the dead ferrets to lure Buckbeak deeper and deeper into the safety of the forest Leaving the hippogriff in a clearing they run out of the trees until they see the Whomping Willow in the distance flailing its branches Lupin points his wand and the tree falls still before he goes down under the roots Snape follows Lupin and they sit down beside each other on the grass As darkness falls a swarm of bats flutters through the forest"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "A tiny silvery breath floats back into Sirius' mouth and his chest heaves as he gives a great sigh. The light draws back across the lake while Harry watches the bright light fade away leaving only the faint image of a figure standing on the far shore. He falls back beside his godfather and they lie next to each other sprawled unconscious on the stony beach. In the hospital wing he pats Ron's bandaged leg and walks to the door. Hermione is wearing a long chain necklace and she puts it around Harry's neck as well and spins its golden pendant. The room is filled with people moving backwards very fast and she replaces the necklace. The wheels of the great clock turn as they cross the quadrangle below and run along the cloister. She shows him the pendant and they hide. Harry and Hermione creep out from their hiding place and Harry looks around nervously as they run towards a huge stone. Standing behind it they look down the hill and watch themselves running along the path below towards Hagrid's cottage and the pumpkin patch. Harry and Hermione hurry down the path and hide behind the pile of pumpkins as Dumbledore Fudge and the Executioner arrive. She pulls him back out of sight when Hermione sees a pebble lying on the pumpkin in front of her and throws it through the window then throws another as Harry rubs his head. Dumbledore knocks at the front door and as the three men go inside the back door opens. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Quickly they run into the forest and observe themselves and Ron leave the cottage and hide behind the pumpkins. Pushing aside a branch Hermione stares at herself in the past and the branch springs back. Hermione and Harry watch themselves and Ron run back up the hill. then they creep back into the garden and peer towards the cottage. Crows peck at Harry's feet as he steals across the garden and Harry bows to Buckbeak who lowers his head in return. Harry stretches towards the post where Buckbeak is chained and a crow pecks his hand as he undoes the chain. Buckbeak will not move so Harry hauls on the chain. Hermione throws the ferret and Buckbeak follows them into the forest. Fudge turns as the Executioner raises his axe and splits a pumpkin in frustration. Harry and Hermione use the dead ferrets to lure Buckbeak deeper and deeper into the safety of the forest. Leaving the hippogriff in a clearing they run out of the trees until they see the Whomping Willow in the distance flailing its branches. Lupin points his wand and the tree falls still before he goes down under the roots. Snape follows Lupin and they sit down beside each other on the grass. As darkness falls a swarm of bats flutters through the forest."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "A tiny silvery breath floats back into Sirius' mouth and his chest heaves as he gives a great sigh. The light draws back across the lake while Harry watches the bright light fade away leaving only the faint image of a figure standing on the far shore. He falls back beside his godfather and they lie next to each other sprawled unconscious on the stony beach. In the hospital wing he pats Ron's bandaged leg and walks to the door. Hermione is wearing a long chain necklace and she puts it around Harry's neck as well and spins its golden pendant. The room is filled with people moving backwards very fast and she replaces the necklace. The wheels of the great clock turn as they cross the quadrangle below and run along the cloister. She shows him the pendant and they hide. Harry and Hermione creep out from their hiding place and Harry looks around nervously as they run towards a huge stone. Standing behind it they look down the hill and watch themselves running along the path below towards Hagrid's cottage and the pumpkin patch. Harry and Hermione hurry down the path and hide behind the pile of pumpkins as Dumbledore Fudge and the Executioner arrive. She pulls him back out of sight when Hermione sees a pebble lying on the pumpkin in front of her and throws it through the window then throws another as Harry rubs his head. Dumbledore knocks at the front door and as the three men go inside the back door opens. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. Quickly they run into the forest and observe themselves and Ron leave the cottage and hide behind the pumpkins. Pushing aside a branch Hermione stares at herself in the past and the branch springs back. Hermione and Harry watch themselves and Ron run back up the hill. then they creep back into the garden and peer towards the cottage. Crows peck at Harry's feet as he steals across the garden and Harry bows to Buckbeak who lowers his head in return. Harry stretches towards the post where Buckbeak is chained and a crow pecks his hand as he undoes the chain. Buckbeak will not move so Harry hauls on the chain. Hermione throws the ferret and Buckbeak follows them into the forest. Fudge turns as the Executioner raises his axe and splits a pumpkin in frustration. Harry and Hermione use the dead ferrets to lure Buckbeak deeper and deeper into the safety of the forest. Leaving the hippogriff in a clearing they run out of the trees until they see the Whomping Willow in the distance flailing its branches. Lupin points his wand and the tree falls still before he goes down under the roots. Snape follows Lupin and they sit down beside each other on the grass. As darkness falls a swarm of bats flutters through the forest."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "A tiny silvery breath floats back into Sirius' mouth and his chest heaves as he gives a great sigh. The light draws back across the lake while Harry watches the bright light fade away leaving only the faint image of a figure standing on the far shore. He falls back beside his godfather and they lie next to each other sprawled unconscious on the stony beach. In the hospital wing he pats Ron's bandaged leg and walks to the door. Hermione is wearing a long chain necklace and she puts it around Harry's neck as well and spins its golden pendant. The room is filled with people moving backwards very fast and she replaces the necklace. The wheels of the great clock turn as they cross the quadrangle below and run along the cloister. Hermione throws the ferret and Buckbeak follows them into the forest. Fudge turns as the Executioner raises his axe and splits a pumpkin in frustration. Harry and Hermione use the dead ferrets to lure Buckbeak deeper and deeper into the safety of the forest. Leaving the hippogriff in a clearing they run out of the trees until they see the Whomping Willow in the distance flailing its branches. Lupin points his wand and the tree falls still before he goes down under the roots. Snape follows Lupin and they sit down beside each other on the grass. As darkness falls a swarm of bats flutters through the forest."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "A tiny silvery breath floats back into Sirius' mouth and his chest heaves as he gives a great sigh. The light draws back across the lake while Harry watches the bright light fade away leaving only the faint image of a figure standing on the far shore. He falls back beside his godfather and they lie next to each other sprawled unconscious on the stony beach. Lupin points his wand and the tree falls still before he goes down under the roots. Snape follows Lupin and they sit down beside each other on the grass. As darkness falls a swarm of bats flutters through the forest."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A tiny, silvery breath floats back into the owl's mouth, and its chest heaves as it gives a great sigh. The light draws back across the lake while the dragon watches the bright light fade away, leaving only the faint image of a figure standing on the far shore. The cat falls back beside its godfather, and they lie next to each other, sprawled unconscious on the stony beach. In the hospital wing, the squirrel pats the mouse's bandaged leg and walks to the door. The rabbit is wearing a long chain necklace, and it puts it around the dragon's neck as well and spins its golden pendant. The room is filled with people moving backward very fast, and the rabbit replaces the necklace. The wheels of the great clock turn as they cross the quadrangle below and run along the cloister. The rabbit shows the dragon the pendant, and they hide. The dragon and the rabbit creep out from their hiding place, and the dragon looks around nervously as they run towards a huge stone. Standing behind it, they look down the hill and watch themselves running along the path below towards Hagrid's cottage and the pumpkin patch. The dragon and the rabbit hurry down the path and hide behind the pile of pumpkins as the phoenix, the troll, and the Executioner arrive. The rabbit pulls the dragon back out of sight when the rabbit sees a pebble lying on the pumpkin in front of it and throws it through the window, then throws another as the dragon rubs its head. The phoenix knocks at the front door, and as the three beings go inside, the back door opens. Quickly, they run into the forest and observe themselves and the mouse leave the cottage and hide behind the pumpkins. Pushing aside a branch, the rabbit stares at itself in the past, and the branch springs back. The rabbit and the dragon watch themselves and the mouse run back up the hill, then they creep back into the garden and peer towards the cottage. Crows peck at the dragon's feet as it steals across the garden, and the dragon bows to Buckbeak, who lowers his head in return. The dragon stretches towards the post where Buckbeak is chained, and a crow pecks its hand as it undoes the chain. Buckbeak won't move, so the dragon hauls on the chain. The rabbit throws the ferret, and Buckbeak follows them into the forest. The troll turns as the Executioner raises his axe and splits a pumpkin in frustration. The dragon and the rabbit use the dead ferrets to lure Buckbeak deeper and deeper into the safety of the forest. Leaving the hippogriff in a clearing, they run out of the trees until they see the Whomping Willow in the distance, flailing its branches. The werewolf points its wand, and the tree falls still before it goes down under the roots. The goblin follows the werewolf, and they sit down beside each other on the grass. As darkness falls, a swarm of bats flutters through the forest."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "A tiny, golden leaf floats back into Sirius' mouth, and his chest heaves as he gives a great sigh. The light draws back across the river while Harry watches the bright light fade away, leaving only the faint image of a figure standing on the far shore. He falls back beside his godfather, and they lie next to each other, sprawled unconscious on the sandy dune. In the infirmary, he pats Ron's bandaged arm and walks to the door. Hermione is wearing a long wool scarf, and she puts it around Harry's neck as well and spins its silver pendant. The room is filled with people moving backwards very fast, and she replaces the scarf. The gears of the great watch turn as they cross the courtyard below and run along the corridor. She shows him the pendant, and they hide. Harry and Hermione creep out from their hiding place, and Harry looks around nervously as they run towards a huge tree. Standing behind it, they look down the hill and watch themselves running along the path below towards Hagrid's barn and the carrot patch. Harry and Hermione hurry down the path and hide behind the pile of carrots as Dumbledore, Fudge, and the Butcher arrive. She pulls him back out of sight when Hermione sees a stone lying on the carrot in front of her and throws it through the window, then throws another as Harry rubs his head. Dumbledore knocks at the front door, and as the three men go inside, the back door opens. Quickly, they run into the meadow and observe themselves and Ron leave the barn and hide behind the carrots. Pushing aside a vine, Hermione stares at herself in the past, and the vine swings back. Hermione and Harry watch themselves and Ron run back up the hill, then they creep back into the orchard and peer towards the barn. Sparrows peck at Harry's feet as he steals across the orchard, and Harry bows to Buckbeak, who lowers his head in return. Harry stretches towards the stake where Buckbeak is tied, and a sparrow pecks his hand as he undoes the rope. Buckbeak won't move, so Harry hauls on the rope. Hermione throws the apple, and Buckbeak follows them into the meadow. Fudge turns as the Butcher raises his axe and splits a carrot in frustration. Harry and Hermione use the dead apples to lure Buckbeak deeper and deeper into the safety of the meadow. Leaving the hippogriff in a glade, they run out of the trees until they see the Shaking Oak in the distance, flailing its branches. Lupin points his wand, and the tree falls still before he goes down under the roots. Snape follows Lupin, and they sit down beside each other on the moss. As darkness falls, a swarm of moths flutters through the meadow."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "A tiny, silvery breath bounces back into Sirius' mouth, and his chest inflates as he lets out a great laugh. The light pulls back across the lake while Harry observes the bright light disappear, leaving only the faint image of a figure seated on the far shore. He collapses beside his godfather, and they lie next to each other, sprawled unconscious on the stony beach. In the hospital wing, he nudges Ron's bandaged leg and skips to the door. Hermione is wearing a long chain necklace, and she drapes it around Harry's neck as well and rotates its golden pendant. The room is filled with people drifting backwards very fast, and she removes the necklace. The wheels of the great clock shift as they glide across the quadrangle below and stroll along the cloister. She exhibits the pendant, and they retreat. Harry and Hermione sneak out from their hiding place, and Harry peers around nervously as they dash towards a huge stone. Standing behind it, they glance down the hill and witness themselves ambling along the path below towards Hagrid's cottage and the pumpkin patch. Harry and Hermione scamper down the path and perch behind the pile of pumpkins as Dumbledore, Fudge, and the Executioner appear. She pushes him out of vision when Hermione notices a pebble resting on the pumpkin in front of her and rolls it through the window, then tosses another as Harry scratches his head. Dumbledore taps at the front door, and as the three men enter, the back door swings open. Swiftly, they dart into the forest and monitor themselves and Ron leave the cottage and crouch behind the pumpkins. Pushing aside a branch, Hermione gazes at herself in the past, and the branch snaps back. Hermione and Harry view themselves and Ron wander back up the hill, then they tiptoe back into the garden and peek towards the cottage. Crows scuttle at Harry's feet as he tiptoes across the garden, and Harry nods to Buckbeak, who raises his head in acknowledgment. Harry leans towards the post where Buckbeak is chained, and a crow nips his hand as he unties the chain. Buckbeak refuses to move, so Harry tugs on the chain. Hermione flings the ferret, and Buckbeak trails them into the forest. Fudge glances as the Executioner lifts his axe and smashes a pumpkin in irritation. Harry and Hermione use the deceased ferrets to entice Buckbeak deeper and deeper into the sanctuary of the forest. Leaving the hippogriff in a clearing, they jog out of the trees until they see the Whomping Willow in the distance, flinging its branches. Lupin waves his wand, and the tree stands still before he slides down under the roots. Snape shadows Lupin, and they lean down beside each other on the grass. As darkness envelops, a swarm of bats flits through the forest."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A massive, golden butterfly drifts back into Pluto's ear, and his leg twitches as he lets out a great cough. The darkness creeps back across the desert while Napoleon observes the dim shadow disappear, leaving only the blurry silhouette of a creature standing on the distant cliff. He collapses beside his uncle, and they rest next to one another, sprawled unconscious on the sandy hill. In the garden shed, he taps Fred's colorful boot and strolls to the gate. Luna is wearing a short cord bracelet, and she places it around Napoleon's wrist as well and spins its silver charm. The alley is filled with cars moving forwards very slowly, and she swaps the bracelet. The hands of the small watch turn as they cross the bridge above and stroll along the walkway. She displays the charm to him, and they hide. Napoleon and Luna sneak out from their hiding spot, and Napoleon glances around anxiously as they jog towards a tiny pebble. Concealed behind it, they peer down the valley and observe themselves sprinting along the road below towards Tom's cabin and the cornfield. Napoleon and Luna dash down the road and hide behind the heap of corncobs as Binns, Figg, and the Gardener arrive. He pulls her back out of sight when Luna finds a leaf lying on the corncob in front of her and flicks it through the window, then flicks another as Napoleon scratches his nose. Binns taps at the side door, and as the three individuals enter inside, the front gate swings open. Swiftly, they dash into the meadow and witness themselves and Fred exit the cabin and hide behind the corncobs. Parting a twig, Luna observes herself in the past, and the twig bounces back. Luna and Napoleon witness themselves and Fred sprint back up the valley, then they tiptoe back into the orchard and gaze towards the cabin. Owls peck at Napoleon's fingers as he skips across the orchard, and Napoleon nods to Stormwing, who dips his beak in reply. Napoleon reaches towards the tree where Stormwing is tied, and an owl nips his foot as he unties the rope. Stormwing hesitates, so Napoleon tugs on the rope. Luna tosses the squirrel, and Stormwing trails them into the meadow. Figg turns as the Gardener hoists his shovel and cracks a corncob in exasperation. Napoleon and Luna use the lifeless squirrels to entice Stormwing further and further into the protection of the meadow. Leaving the griffin in a glade, they sprint out of the bushes until they notice the Howling Oak in the distance, swinging its limbs. Salazar waves his staff, and the oak falls silent before he slips down under the boughs. Blackjack shadows Salazar, and they lounge beside each other on the moss. As dusk arrives, a host of moths flits through the meadow."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "A large, golden feather glides back into Regulus' hand, and his eyes widen as he releases a loud chuckle. The shadow slides back across the ocean while Neville observes the dark shadow emerge away, leaving only the faint outline of a creature standing on the opposite cliff. He tumbles forward beside his aunt, and they rest beside each other, sprawled awake on the sandy dune. In the library room, he nudges Luna's cloaked arm and skips to the window. Ginny is holding a short rope bracelet, and she wraps it around Neville's wrist as well and twists its silver charm. The hallway is filled with animals moving forwards very slowly, and she removes the bracelet. The gears of the small watch spin as they wander through the meadow below and jog across the bridge. She explains to him the charm, and they reveal themselves. Neville and Ginny tiptoe out from their hiding place, and Neville glances around anxiously as they jog towards a large tree. Standing beside it, they gaze across the meadow and observe themselves strolling along the trail below towards Filch's hut and the vegetable patch. Neville and Ginny rush down the trail and crouch beneath the stack of logs as Trelawney, Binns, and the Gardener arrive. He drags her further into sight when Ginny notices a twig resting on the log in front of her and slides it through the door, then tosses another as Neville scratches his arm. Trelawney taps at the side door, and as the three people step outside, the front gate closes. Slowly, they sprint across the field and view themselves and Luna exit the hut and reveal themselves behind the logs. Shoving away a twig, Ginny examines herself in the present, and the twig snaps forward. Ginny and Neville observe themselves and Luna walk forward down the meadow, then they sneak forward into the yard and gaze towards the hut. Ravens peck at Neville's coat as he tiptoes beyond the yard, and Neville nods to Buckbeak, who tilts his wing in response. Neville reaches towards the cage where Buckbeak is bound, and a raven pecks his arm as he fastens the cage. Buckbeak won't budge, so Neville tugs on the cage. Ginny tosses the squirrel, and Buckbeak follows them beyond the field. Binns turns as the Gardener swings his hammer and shatters a log in exasperation. Neville and Ginny use the lifeless cats to draw Buckbeak higher and higher towards the safety of the field. Leaving the hippogriff in a meadow, they walk beyond the bushes until they spot the Shrieking Shack in the distance, shaking its windows. Tonks waves her hat, and the shack grows quiet before she descends beneath the stairs. Flitwick chases after Tonks, and they lay down beside each other on the pathway. As dawn breaks, a flock of sparrows flutters beyond the field."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "A tiny, golden whisper drifts back into Sirius' ear, and his chest shudders as he emits a gentle sneeze. The shadow glides forward across the field while Harry observes the dim shadow disappear, leaving only the blurred image of a silhouette standing on the distant hill. He collapses forward beside his godfather, and they lie next to each other, sprawled asleep on the sandy shore. In the infirmary, he taps Ron's bandaged arm and dances to the window. Hermione is wearing a thick leather belt, and she places it around Harry's waist as well and twirls its silver buckle. The hall is filled with people gliding forwards quite slowly, and she removes the belt. The gears of the giant watch spin as they skip over the courtyard below and jog along the corridor. She reveals the buckle to him, and they conceal themselves. Harry and Hermione tiptoe out from their hiding spot, and Harry glances around nervously as they dash towards a tiny bush. Standing beside it, they peer up the slope and watch themselves strolling along the trail below towards Hagrid's hut and the vegetable patch. Harry and Hermione scamper up the trail and crouch behind the heap of gourds as Dumbledore, Fudge, and the Hunter arrive. She pulls him out of view when Hermione notices a petal resting on the gourd in front of her and flicks it through the door, then flicks another as Harry scratches his chin. Dumbledore taps at the back door, and as the three men step outside, the front door shuts. Hastily, they wander into the meadow and observe themselves and Ron exit the hut and crouch behind the gourds. Pushing aside a twig, Hermione gazes at herself in the past, and the twig sways back. Hermione and Harry observe themselves and Ron stroll up the slope, then they tiptoe back into the field and gaze towards the hut. Spiders scamper over Harry's shoes as he tiptoes across the field, and Harry nods to Buckbeak, who lowers his gaze in return. Harry leans towards the trough where Buckbeak is leashed, and a spider bites his finger as he unfastens the leash. Buckbeak stays put, so Harry tugs on the leash. Hermione tosses the squirrel, and Buckbeak trails them into the meadow. Fudge glances as the Hunter hoists his club and crushes a gourd in anger. Harry and Hermione use the sleepy squirrels to entice Buckbeak farther and farther into the safety of the meadow. Leaving the hippogriff in a glade, they stroll out of the brush until they spot the Whomping Willow in the distance, wagging its leaves. Lupin waves his broomstick, and the tree doubles over before he descends under the branches. Snape trails Lupin, and they rest beside each other on the moss. As twilight descends, a flock of moths dances through the meadow."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A tiny, golden feather drifts back into Draco's ear, and his shoulders shrug as he makes a loud groan. The shadow slides forward across the river while Luna observes the dim glow vanish, leaving only the blurred outline of a creature perched on the near bank. She tumbles forward beside her mentor, and they rest next to one another, curled awake on the soft meadow. In the library, she kicks Neville's broken arm and strolls to the window. Ginny is wearing a short rope bracelet, and she places it around Luna's wrist as well and twirls its silver charm. The field is crowded with animals sprinting forwards very slowly, and she removes the bracelet. The cogs of the tiny watch whirl as they jump the creek above and fly under the bridge. She waves him the charm, and they emerge. Luna and Ginny dash in from their shelter, and Luna glances about confidently as they leap towards an old tree. Crouching before it, they gaze up the slope and observe themselves sprinting along the track above towards Flitwick's shed and the carrot field. Luna and Ginny stroll up the track and crouch before the cluster of carrots as Seamus, Moody, and the Gardener appear. He pushes her forward into sight when Ginny spies a twig lying under the carrot beside her and tosses it against the wall, then hurls another as Luna scratches her arm. Seamus taps on the back wall, and as the trio depart outside, the front wall opens. Gradually, they stroll from the desert and watch each other and Neville enter the shed and reveal the carrots. Pulling away a strand, Ginny glares at herself in the present, and the strand snaps forward. Ginny and Luna observe themselves and Neville walk down the slope, then they dash back from the field and glance towards the shed. Pigeons scratch at Luna's knees as she rolls across the field, and Luna nods to Aragog, who raises his leg in reply. Luna reaches for the bush where Aragog is tied, and a pigeon scratches her shoulder as she unfastens the rope. Aragog can't leap, so Luna tugs on the rope. Ginny hurls the rabbit, and Aragog follows them from the desert. Moody spins as the Gardener lowers his shovel and shatters a carrot in excitement. Luna and Ginny use the live rabbits to push Aragog higher and higher into the danger of the desert. Abandoning the spider in a cave, they stroll into the bushes until they find the Burrowing Badger in the distance, shaking its twigs. Hagrid drops his rake, and the bush stands upright before he climbs up above the branches. Dobby trails Hagrid, and they lie down across one another on the earth. As daylight rises, a colony of moths flutters above the desert."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A silvery breath returns to Sirius, reviving him as Harry watches a fading light across the lake, ending with the faint figure on the shore. Harry and Sirius lie unconscious on the beach. In the hospital wing, Harry pats Ron's bandaged leg and joins Hermione, who places a necklace on him. She spins its pendant, and they move backwards in time, then hide, watching themselves near Hagrid's cottage. Dumbledore, Fudge, and the Executioner arrive, and Hermione throws pebbles at the window. As the men enter the cottage, Harry and Hermione escape to the forest, observing past events. Harry bows to Buckbeak, undoes its chain, and they lure Buckbeak with ferrets into the forest as Fudge turns and the Executioner smashes a pumpkin. They leave Buckbeak in a clearing, head toward the Whomping Willow, and watch as Lupin and Snape settle nearby, all while bats flutter as darkness falls."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "As darkness falls a swarm of bats flutters through the forest Snape follows Lupin and they sit down beside each other on the grass Lupin points his wand and the tree falls still before he goes down under the roots Leaving the hippogriff in a clearing they run out of the trees until they see the Whomping Willow in the distance flailing its branches Harry and Hermione use the dead ferrets to lure Buckbeak deeper and deeper into the safety of the forest Fudge turns as the Executioner raises his axe and splits a pumpkin in frustration Hermione throws the ferret and Buckbeak follows them into the forest Buckbeak will not move so Harry hauls on the chain Harry stretches towards the post where Buckbeak is chained and a crow pecks his hand as he undoes the chain Crows peck at Harry's feet as he steals across the garden and Harry bows to Buckbeak who lowers his head in return then they creep back into the garden and peer towards the cottage Hermione and Harry watch themselves and Ron run back up the hill Pushing aside a branch Hermione stares at herself in the past and the branch springs back Quickly they run into the forest and observe themselves and Ron leave the cottage and hide behind the pumpkins Dumbledore knocks at the front door and as the three men go inside the back door opens She pulls him back out of sight when Hermione sees a pebble lying on the pumpkin in front of her and throws it through the window then throws another as Harry rubs his head Harry and Hermione hurry down the path and hide behind the pile of pumpkins as Dumbledore Fudge and the Executioner arrive Standing behind it they look down the hill and watch themselves running along the path below towards Hagrid's cottage and the pumpkin patch Harry and Hermione creep out from their hiding place and Harry looks around nervously as they run towards a huge stone She shows him the pendant and they hide The wheels of the great clock turn as they cross the quadrangle below and run along the cloister The room is filled with people moving backwards very fast and she replaces the necklace Hermione is wearing a long chain necklace and she puts it around Harry's neck as well and spins its golden pendant In the hospital wing he pats Ron's bandaged leg and walks to the door He falls back beside his godfather and they lie next to each other sprawled unconscious on the stony beach The light draws back across the lake while Harry watches the bright light fade away leaving only the faint image of a figure standing on the far shore A tiny silvery breath floats back into Sirius' mouth and his chest heaves as he gives a great sigh"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "then they creep back into the garden and peer towards the cottage Dumbledore knocks at the front door and as the three men go inside the back door opens Standing behind it they look down the hill and watch themselves running along the path below towards Hagrid's cottage and the pumpkin patch As darkness falls a swarm of bats flutters through the forest Buckbeak will not move so Harry hauls on the chain The wheels of the great clock turn as they cross the quadrangle below and run along the cloister The room is filled with people moving backwards very fast and she replaces the necklace Harry and Hermione hurry down the path and hide behind the pile of pumpkins as Dumbledore Fudge and the Executioner arrive Hermione and Harry watch themselves and Ron run back up the hill Harry and Hermione use the dead ferrets to lure Buckbeak deeper and deeper into the safety of the forest She pulls him back out of sight when Hermione sees a pebble lying on the pumpkin in front of her and throws it through the window then throws another as Harry rubs his head Harry stretches towards the post where Buckbeak is chained and a crow pecks his hand as he undoes the chain The light draws back across the lake while Harry watches the bright light fade away leaving only the faint image of a figure standing on the far shore Pushing aside a branch Hermione stares at herself in the past and the branch springs back Lupin points his wand and the tree falls still before he goes down under the roots Quickly they run into the forest and observe themselves and Ron leave the cottage and hide behind the pumpkins He falls back beside his godfather and they lie next to each other sprawled unconscious on the stony beach Crows peck at Harry's feet as he steals across the garden and Harry bows to Buckbeak who lowers his head in return Snape follows Lupin and they sit down beside each other on the grass Hermione is wearing a long chain necklace and she puts it around Harry's neck as well and spins its golden pendant Fudge turns as the Executioner raises his axe and splits a pumpkin in frustration She shows him the pendant and they hide Harry and Hermione creep out from their hiding place and Harry looks around nervously as they run towards a huge stone Leaving the hippogriff in a clearing they run out of the trees until they see the Whomping Willow in the distance flailing its branches A tiny silvery breath floats back into Sirius' mouth and his chest heaves as he gives a great sigh In the hospital wing he pats Ron's bandaged leg and walks to the door Hermione throws the ferret and Buckbeak follows them into the forest"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Pushing aside a branch Hermione stares at herself in the past and the branch springs back Hermione and Harry watch themselves and Ron run back up the hill then they creep back into the garden and peer towards the cottage Crows peck at Harry's feet as he steals across the garden and Harry bows to Buckbeak who lowers his head in return Harry stretches towards the post where Buckbeak is chained and a crow pecks his hand as he undoes the chain Buckbeak will not move so Harry hauls on the chain Hermione throws the ferret and Buckbeak follows them into the forest Fudge turns as the Executioner raises his axe and splits a pumpkin in frustration Harry and Hermione use the dead ferrets to lure Buckbeak deeper and deeper into the safety of the forest Leaving the hippogriff in a clearing they run out of the trees until they see the Whomping Willow in the distance flailing its branches Lupin points his wand and the tree falls still before he goes down under the roots Snape follows Lupin and they sit down beside each other on the grass As darkness falls a swarm of bats flutters through the forest A tiny silvery breath floats back into Sirius' mouth and his chest heaves as he gives a great sigh The light draws back across the lake while Harry watches the bright light fade away leaving only the faint image of a figure standing on the far shore He falls back beside his godfather and they lie next to each other sprawled unconscious on the stony beach In the hospital wing he pats Ron's bandaged leg and walks to the door Hermione is wearing a long chain necklace and she puts it around Harry's neck as well and spins its golden pendant The room is filled with people moving backwards very fast and she replaces the necklace The wheels of the great clock turn as they cross the quadrangle below and run along the cloister She shows him the pendant and they hide Harry and Hermione creep out from their hiding place and Harry looks around nervously as they run towards a huge stone Standing behind it they look down the hill and watch themselves running along the path below towards Hagrid's cottage and the pumpkin patch Harry and Hermione hurry down the path and hide behind the pile of pumpkins as Dumbledore Fudge and the Executioner arrive She pulls him back out of sight when Hermione sees a pebble lying on the pumpkin in front of her and throws it through the window then throws another as Harry rubs his head Dumbledore knocks at the front door and as the three men go inside the back door opens Quickly they run into the forest and observe themselves and Ron leave the cottage and hide behind the pumpkins"
        }
      ]
    }
  ]
}