{
  "ground_truth": "The cylinder goes on revolving, but no more voice comes—only the whir of the needle on the empty record. At last, he remembers to replace the horn. Neff has just come out of Keyes' office. He walks slowly back towards the reception room entrance, then stands there looking out through the glass doors. All the employees have now left. Neff is entirely alone. He moves as if to go out, then stops rigidly as his face lights up with the excitement of a sudden idea. He turns quickly and walks on to his own office and enters. Neff walks across to his desk, lifts the telephone, and dials a number. Neff hangs up and stands beside the desk with a grim expression on his face, takes a handkerchief out, and wipes perspiration from his forehead and the palms of his hands. The gesture has a symbolic quality, as if he were trying to wipe away the murder. Over his face comes the commentary. The lights are turned on. Phyllis is coming down the stairs. She wears white lounging pajamas, and she is carrying something small and heavy concealed in a scarf in her right hand. She reaches the front door, opens it slightly, fixes the catch so that the door can be opened from outside. She switches off the porch light and the hall light. She moves towards the living room, where there is still light on. Neff comes through the arch and walks slowly towards her. Neff sits down on the arm of the davenport, close to her. Neff gets up from the davenport. He listens to the music for a moment. Phyllis just stares at him. He goes quietly over to the window, shuts it, and draws the curtain. Neff takes a few more steps towards her and stops again. Phyllis is silent. Her expression is tortured. Neff goes on until he is close to her. Quietly, he takes the gun out of her unresisting hand. Phyllis puts her arms around him in complete surrender. Neff draws her close to him. As she comes out of the kiss, there is realization in her eyes that this is the final moment. Out of the shot, the gun explodes once, twice. Phyllis quivers in his arms. Her eyes fill with tears. Her head falls limp against his shoulder. Slowly, he lifts her and carries her to the davenport. He lays her down on it carefully, almost tenderly. The moonlight coming in at the French doors shines on the anklet. He looks at it for the last time and slowly turns away. As he does so, he puts his hand inside his coat, and it comes out with blood on it.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The tube continues on rotating, but no additional voice emerges—only the buzz of the needle on the vacant disc. Eventually, he recalls to restore the horn. Neff has just emerged from Keyes' office. He strolls leisurely back towards the reception room entry, then stands there peering out through the glass portals. All the workers have now departed. Neff is completely solitary. He moves as if to exit, then halts stiffly as his face illuminates with the exhilaration of a sudden notion. He turns swiftly and strides on to his own office and enters. Neff walks across to his desk, raises the telephone, and dials a numeral. Neff hangs up and stands beside the desk with a stern expression on his face, takes a handkerchief out, and wipes sweat from his brow and the palms of his hands. The action has a symbolic characteristic, as if he were striving to wipe away the homicide. Over his face comes the narration. The lights are switched on. Phyllis is descending the stairs. She wears white lounging pajamas, and she is holding something small and heavy hidden in a scarf in her right hand. She reaches the front door, opens it slightly, secures the catch so that the door can be opened from outside. She switches off the porch light and the hall light. She moves towards the living room, where there is still light on. Neff enters through the arch and strolls leisurely towards her. Neff sits down on the arm of the sofa, near to her. Neff rises from the sofa. He listens to the melody for a moment. Phyllis just gazes at him. He goes quietly over to the window, closes it, and draws the drape. Neff takes a few more strides towards her and pauses again. Phyllis is mute. Her expression is anguished. Neff advances until he is near to her. Silently, he takes the gun out of her compliant hand. Phyllis puts her arms around him in complete capitulation. Neff pulls her near to him. As she emerges from the embrace, there is awareness in her eyes that this is the ultimate moment. Out of the frame, the gun detonates once, twice. Phyllis trembles in his arms. Her eyes fill with tears. Her head falls limp against his shoulder. Gradually, he lifts her and bears her to the sofa. He lays her down on it carefully, almost tenderly. The moonlight entering through the French doors gleams on the anklet. He gazes at it for the last time and slowly turns away. As he does so, he places his hand inside his coat, and it emerges with blood on it."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The cylinder continues to be revolved, but only the whir of the needle on the empty record is heard—no more voice is produced. At last, the horn is replaced by him. Neff has just emerged from Keyes' office. The reception room entrance is walked slowly back towards by him, then he stands there looking out through the glass doors. The employees have now all left. Neff finds himself entirely alone. He is moved as if to go out, then he stops rigidly as the excitement of a sudden idea lights up his face. He quickly turns and continues on to his own office and enters. Neff crosses to his desk, the telephone is lifted by him, and a number is dialed. Neff stands beside the desk with a grim expression on his face after hanging up, takes out a handkerchief, and wipes perspiration from his forehead and the palms of his hands. The gesture carries a symbolic quality, as if trying to wipe away the murder were his intent. The commentary comes over his face. Someone turns on the lights. Phyllis descends the stairs. White lounging pajamas are worn by her, and something small and heavy is carried, concealed in a scarf in her right hand. The front door is reached by her, slightly opened, and the catch is fixed so that the door can be opened from outside. She switches off the porch light and the hall light. She moves towards the living room, where light is still present. Neff enters through the arch and walks slowly towards her. The arm of the davenport is sat down upon by Neff, sitting close to her. Neff rises from the davenport. He listens to the music momentarily. Phyllis merely stares at him. The window is quietly approached by him, shut, and the curtain is drawn. Neff takes a few more steps towards her and stops again. Silence is maintained by Phyllis. Her expression appears tortured. Neff continues on until he is close to her. Quietly, the gun is taken out of her unresisting hand by him. Phyllis wraps her arms around him in complete surrender. Neff draws her close to himself. As she emerges from the kiss, realization dawns in her eyes that this is the final moment. Out of the shot, the gun is fired once, twice. Phyllis quivers in his arms. Tears fill her eyes. Her head falls limp against his shoulder. Slowly, she is lifted by him and carried to the davenport. He lays her down on it carefully, almost with tenderness. The anklet is illuminated by the moonlight coming in at the French doors. He looks at it for the last time and turns away slowly. As this is done by him, a hand is put inside his coat, and it comes out with blood on it."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The cylinder keeps revolving, but no voice comes—only the whir of the needle on the empty record. Neff, just out of Keyes' office, walks slowly toward the reception room entrance and stands by the glass doors, now alone. He pauses as a sudden idea excites him, turns, and enters his office. He dials a number, then wipes perspiration from his forehead and hands, symbolically trying to wipe away the murder. Phyllis descends the stairs in white pajamas, carrying something concealed in a scarf. She opens the door slightly, adjusts the catch, and switches off the lights. Neff enters the living room and walks toward her, sitting on the arm of the davenport. He listens to the music, then quietly shuts the window and draws the curtain. He approaches Phyllis, who remains silent, her expression tortured. He takes the gun from her hand, and she surrenders. After a kiss, the gun explodes twice. Phyllis quivers in his arms, her eyes filled with tears as her head falls limp. Neff gently lays her on the davenport. The moonlight shines on her anklet. He gazes at it one last time before turning away, his hand revealing blood"
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The cylinder keeps revolving, but only the needle's whir is heard. He remembers to replace the horn. Neff exits Keyes' office, walks to the reception entrance, and looks out. All employees have left; Neff is alone. He starts to leave, stops with a sudden idea, and heads to his office. Neff dials a number, hangs up, and wipes sweat from his face and hands, symbolically erasing the murder. Phyllis descends the stairs in white pajamas, carrying something heavy in a scarf. She opens the front door slightly, fixes the catch, and turns off the lights. Neff enters, sits on the davenport arm, then rises, listens to music, and closes the window. He approaches Phyllis, who is silent and tortured. Neff takes the gun from her hand. Phyllis surrenders, embracing him. After a kiss, she realizes it's the end. The gun fires twice. Phyllis quivers, tears in her eyes, and her head falls limp. Neff gently lays her on the davenport. Moonlight shines on her anklet. He looks at it, turns away, and finds blood on his hand."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The cylinder continues its relentless revolving, yet no further voice emerges—only the persistent whirring sound of the needle as it glides over the empty record. Eventually, he recalls the need to replace the horn. Neff has just exited Keyes' office. He ambles slowly back towards the entrance of the reception room, then pauses there, gazing out through the transparent glass doors. By this time, all the employees have departed. Neff finds himself completely alone. He makes a motion as if to leave, but then halts abruptly, his face suddenly illuminated with the excitement of a new and unexpected idea. He swiftly turns and proceeds to his own office, entering with purpose. Neff strides across to his desk, picks up the telephone, and dials a number. After hanging up, he stands beside the desk, his expression grim and determined. He retrieves a handkerchief and uses it to wipe the perspiration from his forehead and the palms of his hands. This gesture carries a symbolic weight, as though he is attempting to cleanse himself of the murder. Over his face, a commentary unfolds. The lights are switched on. Phyllis is descending the stairs. She is dressed in white lounging pajamas and is carrying something small yet heavy, concealed within a scarf in her right hand. She reaches the front door, opens it slightly, and adjusts the catch so that the door can be opened from the outside. She then switches off both the porch light and the hall light. She moves towards the living room, where a light remains on. Neff enters through the archway and approaches her slowly. Neff perches on the arm of the davenport, sitting close to her. He then rises from the davenport. He pauses to listen to the music for a brief moment. Phyllis simply stares at him, her gaze unwavering. He quietly crosses over to the window, closes it, and draws the curtain shut. Neff takes a few more steps in her direction and pauses once more. Phyllis remains silent, her expression one of torment. Neff continues until he is very near to her. Gently, he removes the gun from her unresisting hand. Phyllis wraps her arms around him in a gesture of complete surrender. Neff draws her close to him. As she pulls away from the kiss, a realization dawns in her eyes that this is indeed the final moment. Out of the frame, the gun fires once, then again. Phyllis quivers in his arms, her eyes brimming with tears. Her head falls limply against his shoulder. Slowly, he lifts her and carries her to the davenport, laying her down with care, almost tenderly. The moonlight streaming in through the French doors casts a glow on the anklet. He gazes at it for the last time and then slowly turns away. As he does so, he places his hand inside his coat, withdrawing it to find it stained with blood."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The cylinder proceeds in its unceasing, relentless motion, revolving without pause, yet no additional voice emerges—only the ongoing, persistent whirring sound of the needle as it glides effortlessly over the now-empty record. Eventually, it occurs to him that the horn needs to be replaced. Neff has just recently exited from Keyes' office. He ambles slowly and deliberately back towards the entrance of the reception room, then comes to a halt there, casting his gaze out through the transparent glass doors. By this point in time, all the other employees have departed and gone home. Neff finds himself completely and utterly alone. He makes a movement as if he intends to leave, but then he halts abruptly, his face suddenly illuminated with the excitement and inspiration of a new and unexpected idea. He swiftly turns on his heel and proceeds with a sense of urgency to his own office, entering with a clear sense of purpose. Neff strides with resolve across to his desk, picks up the telephone, and dials a number. After hanging up the receiver, he stands beside the desk, his expression grim and determined. He retrieves a handkerchief from his pocket and uses it to wipe the perspiration from his forehead and the palms of his hands. This gesture carries a symbolic weight, as though he is attempting to cleanse himself of any guilt associated with the murder. Over his face, a silent commentary unfolds. The lights in the room are switched on. Phyllis is descending the stairs gracefully. She is dressed in elegant white lounging pajamas and is carrying something small yet noticeably heavy, concealed within a scarf in her right hand. As she reaches the front door, she opens it slightly and adjusts the catch so that the door can conveniently be opened from the outside. She then switches off both the porch light and the hall light, casting the area into shadow. She moves purposefully towards the living room, where a single light remains on. Neff enters the room through the archway and approaches her slowly and deliberately. Neff perches himself on the arm of the davenport, sitting close to her. Subsequently, he rises from the davenport. He pauses momentarily to listen to the soft strains of music. Phyllis simply stares at him, her gaze unwavering and intense. He quietly crosses over to the window, closes it, and draws the curtain shut with care. Neff takes a few more measured steps in her direction and pauses once again. Phyllis remains silent, her expression one of deep torment. Neff continues until he is very near to her. Gently, with a tender touch, he removes the gun from her unresisting hand. Phyllis wraps her arms around him in a gesture of complete and unconditional surrender. Neff draws her even closer to him. As she pulls away from the kiss, a realization dawns in her eyes that this is indeed the final, conclusive moment. Out of the frame, the gun fires once, then fires again. Phyllis quivers in his arms, her eyes brimming with unshed tears. Her head, devoid of strength, falls limply against his shoulder. Slowly, with deliberation, he lifts her and carries her to the davenport, laying her down with care, almost tenderly. The moonlight streaming in through the French doors casts a soft glow on the anklet. He gazes at it for the last time and then slowly turns away. As he does so, he places his hand inside his coat, withdrawing it only to find it stained with blood."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The cylinder continues its relentless spinning, producing no sound other than the persistent whirring of the needle skimming over the empty record. Eventually, he recalls the need to replace the horn, a task he completes with a sense of routine. Meanwhile, Neff emerges from Keyes' office, his steps deliberate and unhurried as he makes his way back towards the entrance of the reception room. Upon reaching the glass doors, he pauses, gazing out at the now deserted office space, realizing he is completely alone. As he contemplates leaving, a sudden idea electrifies his mind, causing him to halt abruptly, his face alight with newfound excitement. With renewed purpose, he pivots swiftly and strides towards his own office, entering with determination. Once inside, Neff crosses the room to his desk, where he picks up the telephone and dials a number with intent. After the call, he replaces the receiver, standing beside the desk with a grim expression etched on his face. He retrieves a handkerchief, using it to methodically wipe the perspiration from his forehead and the palms of his hands, a gesture that seems to symbolize an attempt to cleanse himself of the murder. As his face becomes a canvas for his internal commentary, the lights flicker on, illuminating Phyllis as she descends the stairs. She is clad in white lounging pajamas, her right hand clutching something small and heavy, discreetly wrapped in a scarf. Reaching the front door, she opens it slightly, adjusting the catch to ensure it can be opened from the outside, before extinguishing the porch and hall lights. She proceeds towards the living room, where a solitary light remains on. Neff enters through the archway, advancing slowly towards her. He perches on the arm of the davenport, positioning himself close to her. Rising from the davenport, he pauses to listen to the music momentarily, while Phyllis fixes her gaze on him, her expression unchanging. He moves quietly to the window, closing it and drawing the curtain with care. Taking a few more steps towards her, he halts once more, observing her silence and the torment etched on her face. Neff continues his approach until he is near her, gently extracting the gun from her unresisting hand. In a gesture of complete surrender, Phyllis wraps her arms around him, and Neff draws her close. As they part from the kiss, realization dawns in her eyes, acknowledging the finality of the moment. Off-screen, the gun discharges twice, and Phyllis quivers in his embrace, tears welling in her eyes as her head falls limply against his shoulder. With deliberate care, he lifts her, carrying her to the davenport and laying her down with tenderness. The moonlight streaming through the French doors casts a glow on the anklet, capturing his gaze for the last time before he turns away. As he does so, he slips his hand inside his coat, withdrawing it to find it stained with blood."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The cylinder continues to revolve with only the whir of the needle on the empty record, prompting Neff to replace the horn. After leaving Keyes' office, Neff walks slowly to the reception room entrance, observing the empty space as he stands alone. Suddenly inspired by an idea, he quickly heads to his office, dials a number, and hangs up with a grim expression. He wipes perspiration from his face and hands, symbolically attempting to erase the murder. Meanwhile, Phyllis descends the stairs in white lounging pajamas, carrying a small, heavy object concealed in a scarf. She secures the front door to open from outside, switches off the lights, and moves to the lit living room. Neff enters, approaches her, and sits on the arm of the davenport. After listening to the music briefly, he closes the window and draws the curtain. Moving closer, he quietly takes the gun from her unresisting hand. Phyllis surrenders, embracing him, and as they kiss, she realizes this is the end. The gun fires twice, and Phyllis quivers, tears filling her eyes as her head falls limp against his shoulder. Neff gently lays her on the davenport, the moonlight highlighting her anklet. He looks at it one last time, turns away, and discovers blood on his hand as he withdraws it from his coat."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The cylinder of the old phonograph goes on revolving, but no more voice comes—only the whir of the needle on the empty record, a sound that once signaled the end of a musical performance in the early 20th century. At last, he remembers to replace the horn, a crucial part of acoustic phonographs used to amplify sound. Neff has just come out of Keyes' office, the head of claims at the insurance company where they work. He walks slowly back towards the reception room entrance, a place usually bustling with activity, then stands there looking out through the glass doors that offer a view of the dimming city streets. All the employees have now left. Neff is entirely alone in the office building. He moves as if to go out, then stops rigidly as his face lights up with the excitement of a sudden idea, akin to the eureka moments experienced by inventors. He turns quickly and walks on to his own office and enters, seeking a private space to act on his thoughts. Neff walks across to his desk, lifts the telephone, a rotary model common in mid-20th century offices, and dials a number. Neff hangs up and stands beside the desk with a grim expression on his face, takes a handkerchief out, an item indicative of the era's emphasis on gentility, and wipes perspiration from his forehead and the palms of his hands. The gesture has a symbolic quality, as if he were trying to wipe away the murder that haunts his conscience. Over his face comes the commentary. The lights are turned on, brightening the room. Phyllis is coming down the stairs of her lavish home. She wears white lounging pajamas, a fashion choice popular among affluent women in the 1940s, and she is carrying something small and heavy concealed in a scarf in her right hand. She reaches the front door, opens it slightly, fixes the catch so that the door can be opened from outside, a precaution for those expecting secretive visitors. She switches off the porch light and the hall light, casting the house into darkness. She moves towards the living room, where there is still light on, perhaps to create a semblance of normalcy. Neff comes through the arch and walks slowly towards her, the tension between them palpable. Neff sits down on the arm of the davenport, close to her, a move that shrinks the physical distance between them yet emphasizes the emotional chasm. Neff gets up from the davenport. He listens to the music for a moment, possibly drawing courage or clarity from its notes. Phyllis just stares at him, her eyes reflecting turmoil. He goes quietly over to the window, shuts it, and draws the curtain, as if drawing a veil over the world outside. Neff takes a few more steps towards her and stops again, sensing the weight of the moment. Phyllis is silent. Her expression is tortured, a silent scream of inner conflict. Neff goes on until he is close to her. Quietly, he takes the gun out of her unresisting hand, a gesture that signals the surrender of her plans. Phyllis puts her arms around him in complete surrender, an act of final acceptance. Neff draws her close to him. As she comes out of the kiss, there is realization in her eyes that this is the final moment of their doomed partnership. Out of the shot, the gun explodes once, twice, a sound that echoes the fatal decisions they've made. Phyllis quivers in his arms. Her eyes fill with tears. Her head falls limp against his shoulder. Slowly, he lifts her and carries her to the davenport. He lays her down on it carefully, almost tenderly, as if providing a final gesture of compassion. The moonlight coming in at the French doors shines on the anklet, a piece of jewelry she wore as a talisman of allure and deception. He looks at it for the last time and slowly turns away. As he does so, he puts his hand inside his coat, and it comes out with blood on it, a visual metaphor for the stained path he has chosen."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The cylinder goes on revolving but no more voice comes—only the whir of the needle on the empty record  At last he remembers to replace the horn  Neff has just come out of Keyes' office  He walks slowly back towards the reception room entrance then stands there looking out through the glass doors  All the employees have now left  Neff is entirely alone  He moves as if to go out then stops rigidly as his face lights up with the excitement of a sudden idea  Neff gets up from the davenport  He listens to the music for a moment  Phyllis just stares at him  He goes quietly over to the window shuts it and draws the curtain  Neff takes a few more steps towards her and stops again  Phyllis is silent  Her expression is tortured  Neff goes on until he is close to her  Quietly he takes the gun out of her unresisting hand  Phyllis puts her arms around him in complete surrender  Neff draws her close to him  As she comes out of the kiss there is realization in her eyes that this is the final moment  Out of the shot the gun explodes once twice  Phyllis quivers in his arms  Her eyes fill with tears  Her head falls limp against his shoulder  Slowly he lifts her and carries her to the davenport  He lays her down on it carefully almost tenderly  The moonlight coming in at the French doors shines on the anklet  He looks at it for the last time and slowly turns away  As he does so he puts his hand inside his coat and it comes out with blood on it He turns quickly and walks on to his own office and enters  Neff walks across to his desk lifts the telephone and dials a number  Neff hangs up and stands beside the desk with a grim expression on his face takes a handkerchief out and wipes perspiration from his forehead and the palms of his hands  The gesture has a symbolic quality as if he were trying to wipe away the murder  Over his face comes the commentary  The lights are turned on  Phyllis is coming down the stairs  She wears white lounging pajamas and she is carrying something small and heavy concealed in a scarf in her right hand  She reaches the front door opens it slightly fixes the catch so that the door can be opened from outside  She switches off the porch light and the hall light  She moves towards the living room where there is still light on  Neff comes through the arch and walks slowly towards her  Neff sits down on the arm of the davenport close to her  Neff gets up from the davenport  He listens to the music for a moment  Phyllis just stares at him  He goes quietly over to the window shuts it and draws the curtain  Neff takes a few more steps towards her and stops again  Phyllis is silent  Her expression is tortured  Neff goes on until he is close to her  Quietly he takes the gun out of her unresisting hand  Phyllis puts her arms around him in complete surrender  Neff draws her close to him  As she comes out of the kiss there is realization in her eyes that this is the final moment  Out of the shot the gun explodes once twice  Phyllis quivers in his arms  Her eyes fill with tears  Her head falls limp against his shoulder  Slowly he lifts her and carries her to the davenport  He lays her down on it carefully almost tenderly  The moonlight coming in at the French doors shines on the anklet  He looks at it for the last time and slowly turns away  As he does so he puts his hand inside his coat and it comes out with blood on it"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The cylinder goes on revolving but no more voice comes—only the whir of the needle on the empty record. At last he remembers to replace the horn. Neff has just come out of Keyes' office. He walks slowly back towards the reception room entrance then stands there looking out through the glass doors. All the employees have now left. Neff is entirely alone. He moves as if to go out then stops rigidly as his face lights up with the excitement of a sudden idea. He turns quickly and walks on to his own office and enters. Neff walks across to his desk lifts the telephone and dials a number. Neff hangs up and stands beside the desk with a grim expression on his face takes a handkerchief out and wipes perspiration from his forehead and the palms of his hands. The gesture has a symbolic quality as if he were trying to wipe away the murder. Over his face comes the commentary. The lights are turned on. Phyllis is coming down the stairs. She wears white lounging pajamas and she is carrying something small and heavy concealed in a scarf in her right hand. She reaches the front door opens it slightly fixes the catch so that the door can be opened from outside. She switches off the porch light and the hall light. She moves towards the living room where there is still light on. Neff comes through the arch and walks slowly towards her. Neff sits down on the arm of the davenport close to her. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Neff gets up from the davenport. He listens to the music for a moment. Phyllis just stares at him. He goes quietly over to the window shuts it and draws the curtain. Neff takes a few more steps towards her and stops again. Phyllis is silent. Her expression is tortured. Neff goes on until he is close to her. Quietly he takes the gun out of her unresisting hand. Phyllis puts her arms around him in complete surrender. Neff draws her close to him. As she comes out of the kiss there is realization in her eyes that this is the final moment. Out of the shot the gun explodes once twice. Phyllis quivers in his arms. Her eyes fill with tears. Her head falls limp against his shoulder. Slowly he lifts her and carries her to the davenport. He lays her down on it carefully almost tenderly. The moonlight coming in at the French doors shines on the anklet. He looks at it for the last time and slowly turns away. As he does so he puts his hand inside his coat and it comes out with blood on it."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The cylinder goes on revolving but no more voice comes—only the whir of the needle on the empty record. At last he remembers to replace the horn. Neff has just come out of Keyes' office. He walks slowly back towards the reception room entrance then stands there looking out through the glass doors. All the employees have now left. Neff is entirely alone. He moves as if to go out then stops rigidly as his face lights up with the excitement of a sudden idea. He turns quickly and walks on to his own office and enters. Neff walks across to his desk lifts the telephone and dials a number. Neff hangs up and stands beside the desk with a grim expression on his face takes a handkerchief out and wipes perspiration from his forehead and the palms of his hands. The gesture has a symbolic quality as if he were trying to wipe away the murder. Over his face comes the commentary. The lights are turned on. Phyllis is coming down the stairs. She wears white lounging pajamas and she is carrying something small and heavy concealed in a scarf in her right hand. She reaches the front door opens it slightly fixes the catch so that the door can be opened from outside. She switches off the porch light and the hall light. She moves towards the living room where there is still light on. Neff comes through the arch and walks slowly towards her. Neff sits down on the arm of the davenport close to her. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. Neff gets up from the davenport. He listens to the music for a moment. Phyllis just stares at him. He goes quietly over to the window shuts it and draws the curtain. Neff takes a few more steps towards her and stops again. Phyllis is silent. Her expression is tortured. Neff goes on until he is close to her. Quietly he takes the gun out of her unresisting hand. Phyllis puts her arms around him in complete surrender. Neff draws her close to him. As she comes out of the kiss there is realization in her eyes that this is the final moment. Out of the shot the gun explodes once twice. Phyllis quivers in his arms. Her eyes fill with tears. Her head falls limp against his shoulder. Slowly he lifts her and carries her to the davenport. He lays her down on it carefully almost tenderly. The moonlight coming in at the French doors shines on the anklet. He looks at it for the last time and slowly turns away. As he does so he puts his hand inside his coat and it comes out with blood on it."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The cylinder goes on revolving but no more voice comes—only the whir of the needle on the empty record. At last he remembers to replace the horn. Neff has just come out of Keyes' office. He walks slowly back towards the reception room entrance then stands there looking out through the glass doors. All the employees have now left. Neff is entirely alone. He moves as if to go out then stops rigidly as his face lights up with the excitement of a sudden idea. He turns quickly and walks on to his own office and enters. Neff walks across to his desk lifts the telephone and dials a number. Neff hangs up and stands beside the desk with a grim expression on his face takes a handkerchief out and wipes perspiration from his forehead and the palms of his hands. Neff draws her close to him. As she comes out of the kiss there is realization in her eyes that this is the final moment. Out of the shot the gun explodes once twice. Phyllis quivers in his arms. Her eyes fill with tears. Her head falls limp against his shoulder. Slowly he lifts her and carries her to the davenport. He lays her down on it carefully almost tenderly. The moonlight coming in at the French doors shines on the anklet. He looks at it for the last time and slowly turns away. As he does so he puts his hand inside his coat and it comes out with blood on it."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The cylinder goes on revolving but no more voice comes—only the whir of the needle on the empty record. At last he remembers to replace the horn. Neff has just come out of Keyes' office. He walks slowly back towards the reception room entrance then stands there looking out through the glass doors. Slowly he lifts her and carries her to the davenport. He lays her down on it carefully almost tenderly. The moonlight coming in at the French doors shines on the anklet. He looks at it for the last time and slowly turns away. As he does so he puts his hand inside his coat and it comes out with blood on it."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The cylinder goes on revolving, but no more voice comes—only the whir of the needle on the empty record. At last, the giraffe remembers to replace the horn. The lighthouse keeper has just come out of Keyes' office. The lighthouse keeper walks slowly back towards the reception room entrance, then stands there looking out through the glass doors. All the employees have now left. The lighthouse keeper is entirely alone. The lighthouse keeper moves as if to go out, then stops rigidly as the lighthouse keeper's face lights up with the excitement of a sudden idea. The lighthouse keeper turns quickly and walks on to the lighthouse keeper's own office and enters. The lighthouse keeper walks across to the lighthouse keeper's desk, lifts the telephone, and dials a number. The lighthouse keeper hangs up and stands beside the desk with a grim expression on the lighthouse keeper's face, takes a handkerchief out, and wipes perspiration from the lighthouse keeper's forehead and the palms of the lighthouse keeper's hands. The gesture has a symbolic quality, as if the lighthouse keeper were trying to wipe away the murder. Over the lighthouse keeper's face comes the commentary. The lights are turned on. The chef is coming down the stairs. The chef wears white lounging pajamas, and the chef is carrying something small and heavy concealed in a scarf in the chef's right hand. The chef reaches the front door, opens it slightly, fixes the catch so that the door can be opened from outside. The chef switches off the porch light and the hall light. The chef moves towards the living room, where there is still light on. The lighthouse keeper comes through the arch and walks slowly towards the chef. The lighthouse keeper sits down on the arm of the davenport, close to the chef. The lighthouse keeper gets up from the davenport. The lighthouse keeper listens to the music for a moment. The chef just stares at the lighthouse keeper. The lighthouse keeper goes quietly over to the window, shuts it, and draws the curtain. The lighthouse keeper takes a few more steps towards the chef and stops again. The chef is silent. The chef's expression is tortured. The lighthouse keeper goes on until the lighthouse keeper is close to the chef. Quietly, the lighthouse keeper takes the gun out of the chef's unresisting hand. The chef puts the chef's arms around the lighthouse keeper in complete surrender. The lighthouse keeper draws the chef close to the lighthouse keeper. As the chef comes out of the kiss, there is realization in the chef's eyes that this is the final moment. Out of the shot, the gun explodes once, twice. The chef quivers in the lighthouse keeper's arms. The chef's eyes fill with tears. The chef's head falls limp against the lighthouse keeper's shoulder. Slowly, the lighthouse keeper lifts the chef and carries the chef to the davenport. The lighthouse keeper lays the chef down on it carefully, almost tenderly. The moonlight coming in at the French doors shines on the anklet. The lighthouse keeper looks at it for the last time and slowly turns away. As the lighthouse keeper does so, the lighthouse keeper puts the lighthouse keeper's hand inside the lighthouse keeper's coat, and it comes out with blood on it."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The spool goes on spinning, but no more voice comes—only the hum of the quill on the vacant slate. At last, he remembers to replace the lantern. Neff has just come out of Keyes' pantry. He walks slowly back towards the conservatory entrance, then stands there looking out through the stained-glass windows. All the guests have now left. Neff is entirely alone. He moves as if to go out, then stops rigidly as his face lights up with the excitement of a sudden idea. He turns quickly and walks on to his own parlor and enters. Neff walks across to his bureau, lifts the intercom, and dials a number. Neff hangs up and stands beside the bureau with a grim expression on his face, takes a napkin out, and wipes perspiration from his forehead and the palms of his hands. The gesture has a symbolic quality, as if he were trying to wipe away the theft. Over his face comes the commentary. The chandeliers are turned on. Phyllis is coming down the ladder. She wears white lounging robes, and she is carrying something small and heavy concealed in a kerchief in her right hand. She reaches the garden gate, opens it slightly, fixes the latch so that the gate can be opened from outside. She switches off the patio light and the corridor light. She moves towards the drawing room, where there is still light on. Neff comes through the portico and walks slowly towards her. Neff sits down on the arm of the chaise, close to her. Neff gets up from the chaise. He listens to the symphony for a moment. Phyllis just stares at him. He goes quietly over to the vent, shuts it, and draws the blind. Neff takes a few more steps towards her and stops again. Phyllis is silent. Her expression is anguished. Neff goes on until he is close to her. Quietly, he takes the dagger out of her unresisting hand. Phyllis puts her arms around him in complete surrender. Neff draws her close to him. As she comes out of the embrace, there is realization in her eyes that this is the final moment. Out of the shot, the dagger plunges once, twice. Phyllis quivers in his arms. Her eyes fill with tears. Her head falls limp against his shoulder. Slowly, he lifts her and carries her to the chaise. He lays her down on it carefully, almost tenderly. The starlight coming in at the bay windows shines on the bracelet. He looks at it for the last time and slowly turns away. As he does so, he puts his hand inside his coat, and it comes out with paint on it."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The cylinder continues to spinning, but no more voice emerges—only the whir of the needle on the empty record. At last, he recalls to adjust the horn. Neff has just exited Keyes' office. He strolls leisurely back towards the reception room entrance, then pauses there gazing out through the glass doors. All the employees have now departed. Neff is entirely alone. He hesitates as if to leave, then freezes rigidly as his face brightens with the excitement of a sudden idea. He pivots quickly and marches on to his own office and enters. Neff strides across to his desk, grabs the telephone, and presses a number. Neff disconnects and stands beside the desk with a grim expression on his face, pulls a handkerchief out, and cleans perspiration from his forehead and the palms of his hands. The gesture has a symbolic quality, as if he were attempting to wipe away the murder. Across his face comes the commentary. The lights are switched on. Phyllis is descending the stairs. She wears white lounging pajamas, and she is clutching something small and heavy concealed in a scarf in her right hand. She approaches the front door, opens it slightly, fixes the catch so that the door can be opened from outside. She turns off the porch light and the hall light. She drifts towards the living room, where there is still light on. Neff comes through the arch and ambles slowly towards her. Neff perches on the arm of the davenport, close to her. Neff rises from the davenport. He tunes into the music for a moment. Phyllis just gazes at him. He moves quietly over to the window, seals it, and closes the curtain. Neff takes a few more steps towards her and halts again. Phyllis is silent. Her expression is tormented. Neff continues until he is close to her. Quietly, he extracts the gun from her unresisting hand. Phyllis wraps her arms around him in complete surrender. Neff pulls her close to him. As she emerges from the kiss, there is realization in her eyes that this is the final moment. Out of the shot, the gun fires once, twice. Phyllis shudders in his arms. Her eyes well with tears. Her head droops limp against his shoulder. Gradually, he hoists her and carries her to the davenport. He places her down on it carefully, almost tenderly. The moonlight pouring in at the French doors glimmers on the anklet. He gazes at it for the last time and slowly turns away. As he does so, he slips his hand inside his coat, and it emerges with blood on it."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The toaster goes on revolving, but no more drum comes—only the whir of the needle on the empty envelope. At last, the mailbox remembers to replace the kite. The chair has just come out of the flower's drawer. It walks slowly back towards the garden room entrance, then stands there looking out through the glass cupcakes. All the suns have now left. The chair is entirely alone. It moves as if to go out, then stops rigidly as its face lights up with the excitement of a sudden idea. It turns quickly and walks on to its own drawer and enters. The chair walks across to its lamp, lifts the camera, and dials a leaf. The chair hangs up and stands beside the lamp with a grim expression on its face, takes a shoe out, and wipes glitter from its forehead and the palms of its hands. The gesture has a symbolic quality, as if it were trying to wipe away the necklace. Over its face comes the kettle. The stars are turned on. The violin is coming down the mountains. It wears blue dancing pajamas, and it is carrying something small and heavy concealed in a cane in its right hand. It reaches the back elevator, opens it slightly, fixes the latch so that the elevator can be opened from outside. It switches off the porch candle and the hall candle. It moves towards the kitchen, where there is still candle on. The chair comes through the tunnel and walks slowly towards it. The chair sits down on the arm of the bicycle, close to it. The chair gets up from the bicycle. It listens to the river for a moment. The violin just stares at it. It goes quietly over to the bottle, shuts it, and draws the curtain. The chair takes a few more steps towards it and stops again. The violin is silent. Its expression is tortured. The chair goes on until it is close to it. Quietly, it takes the book out of its unresisting hand. The violin puts its arms around it in complete surrender. The chair draws it close to it. As it comes out of the kiss, there is realization in its eyes that this is the final moment. Out of the shot, the brick explodes once, twice. The violin quivers in its arms. Its eyes fill with tears. Its head falls limp against its shoulder. Slowly, it lifts it and carries it to the bicycle. It lays it down on it carefully, almost tenderly. The sunlight coming in at the French bottles shines on the bracelet. It looks at it for the last time and slowly turns away. As it does so, it puts its hand inside its coat, and it comes out with chocolate on it."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The sphere continues rotating, but no more sound appears—only the hum of the stylus on the vacant record. Eventually, she realizes to adjust the microphone. Doyle has just exited Marlowe's office. She trudges slowly back towards the waiting area entrance, then pauses there staring out through the glass windows. All the visitors have now departed. Doyle is completely solitary. She maneuvers as if to depart, then halts stiffly as her face illuminates with the thrill of an abrupt notion. She pivots swiftly and strides on to her own workspace and crosses. Doyle marches over to the table, picks up the calculator, and taps a sequence. Doyle sets it down and stands beside the table with a stern look on her face, pulls a tissue out, and dabs moisture from her brow and the tips of her fingers. The motion has a metaphorical essence, as if she were attempting to erase the guilt. Across her face drifts the narration. The lamps are switched on. Bart is descending the stairs. He wears black lounging robes, and he is holding something tiny and hefty wrapped in a cloth in his left hand. He reaches the back entrance, opens it narrowly, adjusts the latch so that the door can be accessed from outside. He switches off the patio light and the corridor light. He heads towards the study, where there is still a glow on. Doyle arrives through the doorway and paces slowly towards him. Doyle perches down on the arm of the couch, near him. Doyle rises from the couch. She listens to the melody for a moment. Bart merely gazes at her. She strides silently over to the balcony, closes it, and pulls the drapes. Doyle advances a few more steps towards him and halts again. Bart is wordless. His expression is tortured. Doyle advances until she is near him. Gently, she retrieves the book from his passive hand. Bart wraps his arms around her in total submission. Doyle draws him near to her. As he emerges from the hug, there is awareness in his eyes that this is the ultimate moment. Out of the frame, the book thuds once, twice. Bart shivers in her embrace. His eyes swell with tears. His head droops against her shoulder. Gradually, she hoists him and carries him to the couch. She places him down on it gently, almost lovingly. The starlight filtering in through the sliding doors glimmers on the bracelet. She observes it for the final time and gradually turns away. As she does so, she inserts her hand into her jacket, and it emerges with ink on it."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The sphere continues rotating, but no more melody emerges—only the hum of the stylus on the blank disc. Finally, he recalls to reposition the megaphone. Neff has just departed from Keyes' workspace. He ambles leisurely back towards the waiting area threshold, then pauses there peering out through the transparent panels. All the assistants have now departed. Neff is completely solitary. He gestures as if to step out, then halts stiffly as his face illuminates with the thrill of a sudden concept. He pivots swiftly and strides on to his private chamber and steps in. Neff saunters over to his table, picks up the receiver, and taps a sequence. Neff disconnects and stands beside the table with a stern look on his face, pulls a napkin out, and pats moisture from his brow and the tips of his fingers. The motion has a metaphorical essence, as if he were attempting to erase the betrayal. Over his visage comes the narrative. The lamps are switched on. Phyllis is ascending the staircase. She wears white silk pajamas, and she is holding something small and dense hidden in a shawl in her right hand. She approaches the entrance, pushes it ajar, adjusts the latch so that the gate can be opened from outside. She turns off the patio bulb and the foyer lamp. She drifts towards the parlor, where there is still illumination on. Neff comes through the doorway and steps slowly towards her. Neff perches on the edge of the sofa, close to her. Neff rises from the sofa. He listens to the symphony for a moment. Phyllis merely gazes at him. He moves quietly over to the aperture, closes it, and pulls the shade. Neff takes a few more paces towards her and halts again. Phyllis remains mute. Her look is agonized. Neff continues until he is near her. Gently, he takes the dagger out of her unresisting grip. Phyllis wraps her arms around him in utter capitulation. Neff holds her near to him. As she emerges from the embrace, there is recognition in her gaze that this is the concluding moment. Off-camera, the dagger pierces once, twice. Phyllis shudders in his arms. Her eyes well up with tears. Her head droops limp against his shoulder. Gradually, he lifts her and carries her to the sofa. He places her down on it gently, almost tenderly. The starlight coming in at the bay windows glistens on the bracelet. He examines it for the last time and leisurely turns away. As he does so, he places his hand inside his jacket, and it emerges with ink on it."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The elephant spins around continually, but no more wind appears—only the buzz of the pencil on the blank slate. Eventually, she recalls to replace the trumpet. Mars has just emerged from Luna's atrium. She crawls rapidly back towards the pantry doorway, then pauses there gazing out through the velvet curtains. All the penguins have now flown. Mars is utterly solitary. She leaps as if to fly out, then halts stiffly as her eyes glow with the thrill of a sudden nightmare. She swivels swiftly and saunters to her personal chamber and enters. Mars skips towards her bookshelf, raises the lantern, and twists a knob. Mars suspends the lantern and ponders beside the bookshelf with a stern expression on her face, pulls a bandana out, and cleans dust from her cheeks and the soles of her feet. The action holds an emblematic essence, as if she were attempting to erase the storm. Across her cheeks crawls the narrative. The shadows are turned off. Venus is gliding up the ladder. She wears black marching boots, and she is wielding something enormous and soft shrouded in a cloak in her left hand. She reaches the back window, nudges it broadly, secures the latch so that the window can be pushed from inside. She extinguishes the hallway light and the attic light. She glides towards the kitchen, where there is still music on. Mars leaps through the doorway and hops swiftly towards her. Mars perches on the edge of the trampoline, adjacent to her. Mars jumps off the trampoline. She hums to the silence for an eternity. Venus just blinks at her. She shuffles noisily over to the chimney, shuts it, and draws the curtain. Mars bounces a few more paces near her and halts once more. Venus is singing. Her demeanor is ecstatic. Mars bounces on until she is next to her. Stealthily, she snatches the sword out of her yielding paw. Venus wraps her legs around him in complete triumph. Mars pulls her near to him. As she steps into the hug, there is enlightenment in her gaze that this is the first breath. Out of the scene, the sword flashes once, thrice. Venus shivers in her grasp. Her eyelids brim with laughter. Her chin droops stiff against his elbow. Gently, she nudges her and hauls her to the trampoline. She plants her atop it thoughtfully, almost warmly. The starlight peeking through the velvet curtains glitters on the bracelet. She eyes it for the initial moment and briskly swivels forward. As she shuffles away, she pats her paw inside her pocket, and it emerges with paint on it."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Neff, having just left Keyes' office, stands alone in the empty reception area, deep in thought. His face lights up with an idea, and he returns to his office to make a phone call. Hanging up, he wipes his sweaty hands, symbolizing an attempt to erase his guilt. Meanwhile, Phyllis descends the stairs carrying a concealed object, fixes the front door, and turns off the lights. Neff approaches her, sits beside her on the davenport, then closes the window curtain. He quietly takes the gun from her hand as she surrenders to him. They kiss, but Phyllis realizes it’s their final moment. The gun fires twice, and Phyllis quivers, tears in her eyes, before going limp. Neff carefully lays her on the davenport and, seeing her anklet in the moonlight, turns away. As he withdraws his hand from his coat, it's stained with blood."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "As he does so he puts his hand inside his coat and it comes out with blood on it He looks at it for the last time and slowly turns away  The moonlight coming in at the French doors shines on the anklet  He lays her down on it carefully almost tenderly  Slowly he lifts her and carries her to the davenport  Her head falls limp against his shoulder  Her eyes fill with tears  Phyllis quivers in his arms  Out of the shot the gun explodes once twice  As she comes out of the kiss there is realization in her eyes that this is the final moment  Neff draws her close to him  Phyllis puts her arms around him in complete surrender  Quietly he takes the gun out of her unresisting hand  Neff goes on until he is close to her  Her expression is tortured  Phyllis is silent  Neff takes a few more steps towards her and stops again  He goes quietly over to the window shuts it and draws the curtain  Phyllis just stares at him  He listens to the music for a moment  Neff gets up from the davenport  Neff sits down on the arm of the davenport close to her  Neff comes through the arch and walks slowly towards her  She moves towards the living room where there is still light on  She switches off the porch light and the hall light  She reaches the front door opens it slightly fixes the catch so that the door can be opened from outside  She wears white lounging pajamas and she is carrying something small and heavy concealed in a scarf in her right hand  Phyllis is coming down the stairs  The lights are turned on  Over his face comes the commentary  The gesture has a symbolic quality as if he were trying to wipe away the murder  Neff hangs up and stands beside the desk with a grim expression on his face takes a handkerchief out and wipes perspiration from his forehead and the palms of his hands  Neff walks across to his desk lifts the telephone and dials a number  He turns quickly and walks on to his own office and enters  He moves as if to go out then stops rigidly as his face lights up with the excitement of a sudden idea  Neff is entirely alone  All the employees have now left  He walks slowly back towards the reception room entrance then stands there looking out through the glass doors  Neff has just come out of Keyes' office  At last he remembers to replace the horn  The cylinder goes on revolving but no more voice comes—only the whir of the needle on the empty record "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "She wears white lounging pajamas and she is carrying something small and heavy concealed in a scarf in her right hand  She reaches the front door opens it slightly fixes the catch so that the door can be opened from outside  Phyllis is coming down the stairs  The cylinder goes on revolving but no more voice comes—only the whir of the needle on the empty record  Out of the shot the gun explodes once twice  The lights are turned on  Neff goes on until he is close to her  Neff walks across to his desk lifts the telephone and dials a number  Phyllis is silent  Neff draws her close to him  As she comes out of the kiss there is realization in her eyes that this is the final moment  The gesture has a symbolic quality as if he were trying to wipe away the murder  He lays her down on it carefully almost tenderly  All the employees have now left  He goes quietly over to the window shuts it and draws the curtain  He walks slowly back towards the reception room entrance then stands there looking out through the glass doors  Quietly he takes the gun out of her unresisting hand  He listens to the music for a moment  Her head falls limp against his shoulder  Phyllis quivers in his arms  At last he remembers to replace the horn  Slowly he lifts her and carries her to the davenport  He looks at it for the last time and slowly turns away  He moves as if to go out then stops rigidly as his face lights up with the excitement of a sudden idea  Neff comes through the arch and walks slowly towards her  Over his face comes the commentary  Neff sits down on the arm of the davenport close to her  Neff gets up from the davenport  Her expression is tortured  Neff hangs up and stands beside the desk with a grim expression on his face takes a handkerchief out and wipes perspiration from his forehead and the palms of his hands  She moves towards the living room where there is still light on  Neff is entirely alone  Neff takes a few more steps towards her and stops again  He turns quickly and walks on to his own office and enters  Her eyes fill with tears  Phyllis puts her arms around him in complete surrender  Neff has just come out of Keyes' office  She switches off the porch light and the hall light  The moonlight coming in at the French doors shines on the anklet  As he does so he puts his hand inside his coat and it comes out with blood on it Phyllis just stares at him "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He listens to the music for a moment  Phyllis just stares at him  He goes quietly over to the window shuts it and draws the curtain  Neff takes a few more steps towards her and stops again  Phyllis is silent  Her expression is tortured  Neff goes on until he is close to her  Quietly he takes the gun out of her unresisting hand  Phyllis puts her arms around him in complete surrender  Neff draws her close to him  As she comes out of the kiss there is realization in her eyes that this is the final moment  Out of the shot the gun explodes once twice  Phyllis quivers in his arms  Her eyes fill with tears  Her head falls limp against his shoulder  Slowly he lifts her and carries her to the davenport  He lays her down on it carefully almost tenderly  The moonlight coming in at the French doors shines on the anklet  He looks at it for the last time and slowly turns away  As he does so he puts his hand inside his coat and it comes out with blood on it The cylinder goes on revolving but no more voice comes—only the whir of the needle on the empty record  At last he remembers to replace the horn  Neff has just come out of Keyes' office  He walks slowly back towards the reception room entrance then stands there looking out through the glass doors  All the employees have now left  Neff is entirely alone  He moves as if to go out then stops rigidly as his face lights up with the excitement of a sudden idea  He turns quickly and walks on to his own office and enters  Neff walks across to his desk lifts the telephone and dials a number  Neff hangs up and stands beside the desk with a grim expression on his face takes a handkerchief out and wipes perspiration from his forehead and the palms of his hands  The gesture has a symbolic quality as if he were trying to wipe away the murder  Over his face comes the commentary  The lights are turned on  Phyllis is coming down the stairs  She wears white lounging pajamas and she is carrying something small and heavy concealed in a scarf in her right hand  She reaches the front door opens it slightly fixes the catch so that the door can be opened from outside  She switches off the porch light and the hall light  She moves towards the living room where there is still light on  Neff comes through the arch and walks slowly towards her  Neff sits down on the arm of the davenport close to her  Neff gets up from the davenport "
        }
      ]
    }
  ]
}