{
  "ground_truth": "Harry jumps up onto the bed, and the book scurries underneath in a flurry of torn paper. Harry lies down and peers under the bed, watching the book, which lies still, then snaps once more and slithers out, turning this way and that before it slides back under the bed. Harry quickly unties his shoelace and dangles his shoe over the edge of the bed, dropping his shoe onto the floor, prompting the book to hurtle out, snapping its covers, as Harry jumps onto the book with both feet. In the corridor, a maid knocks at the room next door, and Harry goes downstairs. A ginger cat chases a rat down the corridor, passing a wanted poster for Sirius Black. On the Hogwarts Express, Mrs. Weasley passes Ron his rat, and a man is asleep in a compartment. Harry slides the door closed as steam billows from the funnel while the Hogwarts Express travels through the rain beside the edge of a vast lake. Harry peers along the corridor, and the door slides shut as the lights go out. Ron stares out the window into the rain as the Express stops on a viaduct, and one by one, the carriages go dark. The train lurches again, and the air turns so cold that they can see their breath. Ron pulls his hand away from the window as frost spreads across the glass, and ice forms in Professor Lupin's bottle of water while he remains asleep in the corner, wrapped in his cloak. The train lurches again, and Hermione shivers. Something appears out in the corridor, floating towards the door, something black, shapeless, and mysterious. It reaches out as the door slides open, revealing a horrible hand with long fingers like crooked, dead twigs reaching into the compartment. A hooded black shape looms in the doorway, as Hermione's cat spits and Ron's rat, Scabbers, hides under his coat. The hideous cloaked figure floats into the compartment and faces Harry, who stares helplessly at the terrifying creature that seems to draw the energy out of him, making his body go stiff. Professor Lupin throws off his cloak and points his wand at the threatening figure, which, in a flash of light, hurtles backwards and disappears. Harry loses consciousness and then opens his eyes, finding himself lying on the seat. Hermione hands him his glasses, which he puts on, and looking confused, he takes a piece of chocolate from Professor Lupin. He gets up, turns, and smiles as Ron and Hermione stare at him. Harry looks at the rain teeming down outside the window and stares at his own worried face reflected in the glass. Horseless carriages take the students up to Hogwarts Castle, where they assemble in the Great Hall for the welcoming feast, sitting at long tables with lighted candles hanging above their heads as they listen to the choir.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Harry leaps up onto the cot, and the tome darts below in a burst of shredded parchment. Harry reclines and gazes under the cot, observing the tome, which remains still, then snaps once more and slithers out, twisting this way and that before it glides back under the cot. Harry swiftly loosens his shoelace and suspends his shoe over the brink of the cot, dropping his shoe onto the ground, prompting the tome to race out, snapping its covers, as Harry leaps onto the tome with both feet. In the hallway, a domestic knocks at the chamber next door, and Harry descends downstairs. A ginger feline pursues a rodent down the hallway, passing a wanted poster for Sirius Black. On the Hogwarts Express, Mrs. Weasley hands Ron his rodent, and a gentleman is asleep in a compartment. Harry slides the door shut as vapor billows from the funnel while the Hogwarts Express journeys through the rain beside the margin of a vast lake. Harry gazes along the hallway, and the door slides shut as the lights go out. Ron stares out the window into the rain as the Express halts on a bridge, and one by one, the carriages go dim. The train lurches again, and the air turns so frigid that they can see their breath. Ron pulls his hand away from the window as frost spreads across the pane, and ice forms in Professor Lupin's flask of water while he remains asleep in the corner, wrapped in his cloak. The train lurches again, and Hermione shivers. Something materializes out in the hallway, gliding towards the door, something black, formless, and enigmatic. It reaches out as the door slides open, revealing a dreadful hand with long digits like twisted, dead twigs reaching into the compartment. A hooded black form looms in the doorway, as Hermione's feline spits and Ron's rodent, Scabbers, conceals under his coat. The ghastly cloaked entity floats into the compartment and faces Harry, who stares helplessly at the frightening creature that seems to draw the vigor out of him, making his body go rigid. Professor Lupin throws off his cloak and aims his wand at the menacing entity, which, in a burst of light, hurtles backwards and vanishes. Harry loses consciousness and then opens his eyes, finding himself reclining on the seat. Hermione hands him his spectacles, which he puts on, and looking bewildered, he takes a piece of chocolate from Professor Lupin. He rises, turns, and grins as Ron and Hermione stare at him. Harry looks at the rain teeming down outside the window and gazes at his own anxious face mirrored in the pane. Horseless carriages convey the students up to Hogwarts Castle, where they gather in the Great Hall for the welcoming banquet, sitting at long tables with lighted candles hanging above their heads as they listen to the choir."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The bed is jumped up onto by Harry, and a flurry of torn paper scurries underneath the book. Under the bed, Harry lies down and peers, watching the book, which is still, then once more snaps and is slithered out, with it being turned this way and that before it is slid back under the bed. Harry’s shoelace is quickly untied and his shoe is dangled over the bed's edge, his shoe is dropped onto the floor, prompting the book to be hurtled out, snapping its covers, as the book is jumped onto by Harry with both feet. In the corridor, the room next door is knocked at by a maid, and downstairs, Harry goes. A rat is chased down the corridor by a ginger cat, passing a wanted poster for Sirius Black. On the Hogwarts Express, Ron is passed his rat by Mrs. Weasley, and in a compartment, a man sleeps. The door is slid closed by Harry as steam is billowed from the funnel while the Hogwarts Express is traveled through the rain beside the edge of a vast lake. The corridor is peered along by Harry, and the door is slid shut as the lights are gone out. Out the window into the rain, Ron stares as the Express is stopped on a viaduct, and the carriages, one by one, are darkened. Again, the train is lurched, and the air is turned so cold that their breath can be seen. Ron’s hand is pulled away from the window as the glass is spread with frost, and in Professor Lupin's bottle of water, ice forms while he stays asleep in the corner, wrapped in his cloak. Again, the train is lurched, and Hermione shivers. In the corridor, something appears, floating towards the door, something black, shapeless, and mysterious. Out, it reaches as the door is slid open, revealing a horrible hand with long fingers like crooked, dead twigs reaching into the compartment. In the doorway, a hooded black shape looms, as Hermione's cat spits and under his coat, Ron’s rat, Scabbers, is hidden. Into the compartment, the hideous cloaked figure floats and faces Harry, who helplessly stares at the terrifying creature that seems to draw the energy out of him, making his body stiff. Professor Lupin's cloak is thrown off and his wand is pointed at the threatening figure by him, which, in a flash of light, is hurtled backwards and disappears. Consciousness is lost by Harry and then his eyes are opened, finding himself lying on the seat. His glasses are handed to him by Hermione, which he puts on, and looking confused, a piece of chocolate is taken from Professor Lupin by him. Up, he gets, turns, and smiles as he is stared at by Ron and Hermione. At the rain teeming down outside the window, Harry looks and at his own worried face reflected in the glass, he stares. The students up to Hogwarts Castle, where, in the Great Hall, the welcoming feast is assembled for, are taken by horseless carriages, sitting at long tables with lighted candles hanging above their heads as the choir is listened to by them."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Harry leaps onto the bed, scattering the book beneath it in a flurry of torn paper. He peers under the bed at the still book, which then snaps and slithers out before sliding back. Harry unties his shoelace, drops his shoe to coax the book out, and jumps on it with both feet. A maid knocks next door as a ginger cat chases a rat past a wanted poster for Sirius Black. On the Hogwarts Express, Mrs. Weasley hands Ron his rat, and a man sleeps in a compartment. Harry closes the door as steam billows from the funnel, watching rain beside a vast lake. The lights go out as the train stops on a viaduct, Ron sees frost form on the window, and ice appears in Professor Lupin's bottle while he sleeps. The train lurches, Hermione shivers, and a black, shapeless figure floats to the door, revealing a hand with twig-like fingers. The cloaked figure faces Harry, who feels energy drain from him. Professor Lupin, now awake, repels it with his wand, and Harry faints. Awaking, he finds Hermione handing him his glasses and takes chocolate from Lupin. Ron and Hermione stare as he smiles, gazing at his reflection in the rain-soaked window. Horseless carriages carry students to Hogwarts Castle. They gather in the Great Hall for a feast, sitting at long tables with candles overhead as a choir sings."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Harry jumps onto the bed, and a book scurries underneath amid torn paper. He peers under and watches as it snaps, slithers out, then back under. Harry unties his shoelace, drops his shoe, prompting the book to snap out, and he jumps on it. A maid knocks next door, and Harry goes downstairs. A cat chases a rat, passing a Sirius Black poster. On the Hogwarts Express, Mrs. Weasley gives Ron his rat, and a man sleeps in a compartment. Harry closes the door as steam billows outside, and the train rides through rain by a vast lake. As the lights go out, Ron stares at the rain when the Express stops on a viaduct. The air turns cold, breath visible, frost spreads, and ice forms in Lupin's bottle. The train lurches, Hermione shivers, and a black, shapeless figure approaches the door, reaching in with a horrible hand. A hooded shape looms, Hermione's cat spits, and Ron's rat hides. The cloaked figure faces Harry, who goes stiff. Professor Lupin casts a spell, the figure disappears, and Harry loses consciousness. He wakes, takes his glasses from Hermione, eats chocolate from Lupin, smiles at Ron and Hermione, then watches the rain. Horseless carriages take students to Hogwarts for a feast in the Great Hall with candles and choir."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Harry energetically jumps up onto the soft, inviting bed, and the book beneath it scurries away in a chaotic flurry of torn paper. Harry lies down comfortably on the bed and peers underneath it, intently watching the book. The book, lying still for a moment, suddenly snaps once more and slithers out, unpredictably turning this way and that before swiftly sliding back under the bed again. Harry, thinking quickly, unties his shoelace with deft fingers and dangles his shoe provocatively over the edge of the bed, dropping it onto the floor with purpose. This prompt action causes the book to hurtle out again, snapping its covers, just as Harry leaps onto the book with both feet, trapping it effectively. In the corridor outside, a diligent maid knocks at the room next door, signaling her presence, and Harry makes his way downstairs. A ginger cat energetically chases a rat down the corridor, rushing past a wanted poster for Sirius Black that hangs ominously on the wall. On the Hogwarts Express, Mrs. Weasley, ever attentive, passes Ron his rat, and in one compartment, a man remains asleep, undisturbed. Harry quietly slides the compartment door closed as steam billows dramatically from the funnel while the Hogwarts Express travels through the rain beside the edge of a vast lake. Harry peers curiously along the corridor, and the door slides shut as abruptly the lights go out. Ron stares intently out the window into the pouring rain as the Express comes to a halt on a viaduct, and one by one, the carriages are plunged into darkness. The train lurches once more, and the air turns so cold that both Harry and Ron can see their breath materializing in the icy air. Ron hurriedly pulls his hand away from the window as frost spreads quickly across the glass, and ice forms in Professor Lupin's bottle of water, even as he remains asleep in the corner, snugly wrapped in his cloak. The train lurches yet again, and Hermione shivers visibly. Something mysterious appears out in the corridor, eerily floating toward the door, a black, formless enigma. It reaches out as the door slides open, revealing a ghastly hand, its long fingers resembling crooked, dead twigs reaching ominously into the compartment. A hooded black shape looms threateningly in the doorway, as Hermione's cat spits defensively and Ron's rat, Scabbers, quickly hides under his coat for protection. The hideous, cloaked figure floats ominously into the compartment, facing Harry, who stares helplessly at the terrifying creature that seems to draw all the energy out of him, rendering his body rigid and unresponsive. Professor Lupin springs into action, throwing off his cloak and pointing his wand decisively at the threatening figure, which, in a blinding flash of light, hurtles backward and disappears without a trace. Harry loses consciousness, but when he opens his eyes again, he finds himself lying on the seat. Hermione compassionately hands him his glasses, which he puts on gratefully, and looking somewhat confused, he accepts a piece of chocolate from Professor Lupin. He gets up, turns around, and smiles warmly as Ron and Hermione gaze intently at him. Harry then looks out at the rain pouring down heavily outside the window, and stares at his own worried face reflected in the glass. Horseless carriages transport the students up to the majestic Hogwarts Castle, where they assemble eagerly in the Great Hall for the welcoming feast, sitting at long, communal tables adorned with lighted candles hanging magically above their heads as they listen to the enchanting choir."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a burst of energy, Harry enthusiastically leaps onto the plush and welcoming bed, causing the book that was hiding beneath it to dart away in a chaotic flurry of torn paper fragments. He then settles himself comfortably on the bed, lying down as he casts a focused gaze underneath, intently observing the book's movements. After lying still for a brief moment, the book suddenly snaps its covers once again and unpredictably slithers out from its hiding place, twisting this way and that, before swiftly sliding back under the bed. Reacting swiftly, Harry unties his shoelace with nimble fingers and provocatively dangles his shoe over the edge of the bed, letting it drop with deliberate purpose onto the floor. This quick action prompts the book to rush out once more, snapping its covers excitedly, just as Harry pounces onto it with both feet, effectively trapping it beneath him. Meanwhile, in the corridor outside, a conscientious maid knocks at the room next door, signaling her presence as Harry makes his way downstairs. A lively ginger cat energetically dashes down the corridor, in pursuit of a fleeing rat, racing past a wanted poster for Sirius Black that hangs ominously on the wall. On the Hogwarts Express, Mrs. Weasley, ever attentive to her children, hands Ron his rat, and in one of the train's compartments, a man remains asleep, completely undisturbed by the commotion around him. Quietly, Harry slides the compartment door closed, as dramatic steam billows from the funnel while the Hogwarts Express travels through the rain, skimming the edge of a vast and sprawling lake. As Harry peers curiously along the corridor, the door slides shut, and unexpectedly, the lights extinguish entirely. Ron stares intently out the window into the relentless downpour as the Express grinds to a halt on a viaduct, and one by one, the carriages are suddenly plunged into darkness. With another lurch, the train shudders, and the air becomes so frigid that both Harry and Ron can see their breath materializing in the icy atmosphere. Ron hastily pulls his hand away from the window as frost rapidly spreads across the pane, ice forming in Professor Lupin's bottle of water, even as the professor remains asleep in the corner, snugly wrapped in his warm cloak. The train lurches yet again, causing Hermione to shiver visibly. Out in the corridor, something strange and mysterious appears, floating eerily toward the compartment door, a dark and formless enigma. As the door slides open, it reveals a ghastly hand, with long fingers that resemble crooked, lifeless twigs, ominously reaching into the compartment. A hooded, black figure looms threateningly in the doorway, and Hermione's cat spits defensively while Ron's rat, Scabbers, quickly burrows under his coat for protection. The grotesque, cloaked figure floats menacingly into the compartment, confronting Harry, who watches helplessly as the terrifying creature seems to sap all the energy from him, leaving his body rigid and unresponsive. Professor Lupin springs into decisive action, casting off his protective cloak and pointing his wand resolutely at the threatening figure, which, with a blinding flash of light, is propelled backward and disappears without a trace. Harry loses consciousness, but when he opens his eyes once more, he finds himself lying on the seat. Hermione compassionately offers him his glasses, which he gratefully puts on, and looking somewhat bewildered, he accepts a piece of chocolate from Professor Lupin. Rising to his feet, he turns around and smiles warmly as Ron and Hermione gaze at him with concern. Harry then directs his attention outside, observing the rain pouring down heavily, and stares at his own worried reflection in the windowpane. Horseless carriages transport the students up to the grand and majestic Hogwarts Castle, where they eagerly assemble in the Great Hall for the welcoming feast. They sit at long, communal tables adorned with lighted candles that hang magically above their heads as they listen to the enchanting choir perform."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Harry energetically leaps onto the bed, where the book beneath him hurriedly moves away in a flurry of torn paper. He then lies down on the bed and peers underneath, observing the book as it initially lies still but suddenly snaps to life, slithering out from under the bed, twisting and turning erratically before it swiftly retreats back into its hiding place. In a bid to lure it out again, Harry quickly unties his shoelace, allowing his shoe to dangle precariously over the bed's edge before letting it fall to the floor. This action successfully entices the book to dart out, its covers snapping fiercely, prompting Harry to leap onto it with both feet. Meanwhile, in the corridor, a maid knocks at the room next door, while Harry descends the stairs. A ginger cat, in an energetic pursuit, chases a rat down the corridor, past a wanted poster for Sirius Black. Transitioning to another scene on the Hogwarts Express, Mrs. Weasley passes Ron his rat, while a man remains asleep in one of the train's compartments. Harry gently slides the compartment door closed as steam surges from the funnel, the Hogwarts Express continuing its journey through the rain beside a vast lake. As Harry peers down the corridor, the door slides shut, and the lights abruptly go out. Ron gazes out the rain-drenched window as the Express comes to a halt on a viaduct, and the carriages darken one by one. The train lurches once more, the temperature drops sharply, allowing them to see their breath mist in the chilly air. Ron hastily pulls his hand away as frost begins to crawl across the glass, while ice forms in Professor Lupin's bottle of water, though he remains asleep, cocooned in his cloak. The train lurches once again, causing Hermione to shiver. Suddenly, something appears in the corridor, floating ominously toward the door—a black, amorphous, and mysterious presence. It reaches out, and as the door smoothly slides open, it reveals a ghastly hand with long, gnarled fingers resembling twisted, dead twigs, reaching menacingly into the compartment. A hooded, black figure looms in the doorway, causing Hermione's cat to hiss and Ron's rat, Scabbers, to scurry under his coat. The dreadful cloaked figure drifts into the compartment, facing Harry, who stands paralyzed by the sight of the terrifying creature that seems to drain the energy from his body, rendering him stiff. In this dire moment, Professor Lupin swiftly removes his cloak and points his wand at the spectral figure, which, in a brilliant flash of light, is sent hurtling backward and vanishes. Harry loses consciousness in the aftermath but soon regains awareness, finding himself lying on the seat. Hermione offers him his glasses, which he carefully puts on, and, feeling bewildered, accepts a piece of chocolate from Professor Lupin. Rising to his feet, he turns and smiles at Ron and Hermione, who gaze at him intently. Harry then redirects his gaze to the rain pouring relentlessly outside the window, contemplating his own anxious reflection in the glass. As the scene shifts, horseless carriages transport the students to Hogwarts Castle, where they gather in the Great Hall for the welcoming feast. They sit at long tables beneath an enchanted ceiling with lit candles floating overhead, all the while listening to the melodious performance of the choir."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Harry jumps onto the bed, causing the book to dart underneath amidst torn paper. He lies down to watch it briefly emerge and retreat under the bed again. Quickly, he unties his shoelace, uses his shoe to lure the book out, and jumps on it with both feet. Meanwhile, a maid knocks next door, and Harry heads downstairs, passing a ginger cat chasing a rat by a Sirius Black wanted poster.\n\nOn the Hogwarts Express, Mrs. Weasley hands Ron his rat, while a man sleeps in the compartment. After closing the door, Harry watches as the train travels through the rain by a vast lake. As the lights go out, Ron stares at the rain until the train's viaduct stop turns each carriage dark. The air grows cold enough to show their breath, frost forms on the windows, and ice appears in Professor Lupin's water bottle as he sleeps. The train lurches, and Hermione shivers while a mysterious figure floats towards their door. It opens, revealing a hooded figure with long, twig-like fingers. Hermione's cat and Ron's rat react defensively as the figure enters and confronts Harry, draining his energy and making him stiff. Professor Lupin awakens, repels the figure with his wand, and it vanishes in a flash of light. \n\nHarry loses consciousness but soon awakens to Hermione handing him his glasses. He takes chocolate from Professor Lupin, stands up, and smiles at Ron and Hermione. He gazes at the rain and his worried reflection outside. Finally, horseless carriages carry the students to Hogwarts Castle, where they gather in the Great Hall for the welcoming feast, seated at long tables with candles floating above as they listen to the choir."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Harry jumps up onto the bed, and the enchanted book, a magical tome known to react violently when provoked, scurries underneath in a flurry of torn paper. Harry lies down and peers under the bed, watching the book, which lies still, then snaps once more and slithers out, turning this way and that before it slides back under the bed. Not wanting to lose it, Harry quickly unties his shoelace, which he learned in Professor Flitwick's Charms class can be used to lure magical objects, and dangles his shoe over the edge of the bed, dropping his shoe onto the floor, prompting the book to hurtle out, snapping its covers, as Harry jumps onto the book with both feet. In the corridor of the inn known as the Leaky Cauldron, a maid knocks at the room next door, and Harry goes downstairs. A ginger cat, known as Crookshanks in the wizarding world, chases a rat down the corridor, passing a wanted poster for Sirius Black, a notorious wizard believed to have escaped from Azkaban. On the Hogwarts Express, which is the train that takes students to Hogwarts School of Witchcraft and Wizardry, Mrs. Weasley passes Ron his rat, Scabbers, unaware it is actually the Animagus Peter Pettigrew, and a man is asleep in a compartment. Harry slides the door closed as steam billows from the funnel of the train while the Hogwarts Express travels through the rain beside the edge of a vast lake, part of the scenic route to Hogwarts. Harry peers along the corridor, and the door slides shut as the lights go out, a signal of the impending arrival of the Dementors. Ron stares out the window into the rain as the Express stops on a viaduct, a high bridge spanning the valley, and one by one, the carriages go dark. The train lurches again, and the air turns so cold that they can see their breath, a common effect of Dementor presence. Ron pulls his hand away from the window as frost, unusual for the season, spreads across the glass, and ice forms in Professor Lupin's bottle of water while he remains asleep in the corner, wrapped in his cloak, known for its protective enchantments. The train lurches again, and Hermione shivers. Something appears out in the corridor, floating towards the door, something black, shapeless, and mysterious, a Dementor, a dark creature that feeds on human happiness. It reaches out as the door slides open, revealing a horrible hand with long fingers like crooked, dead twigs reaching into the compartment. A hooded black shape looms in the doorway, as Hermione's cat Crookshanks spits and Ron's rat, Scabbers, hides under his coat. The hideous cloaked figure floats into the compartment and faces Harry, who stares helplessly at the terrifying creature, known to cause despair and hopelessness, that seems to draw the energy out of him, making his body go stiff. Professor Lupin throws off his cloak and points his wand at the threatening figure, which, in a flash of light, hurtles backwards and disappears. Harry loses consciousness and then opens his eyes, finding himself lying on the seat. Hermione hands him his glasses, which he puts on, and looking confused, he takes a piece of chocolate from Professor Lupin, a remedy known to help recover from a Dementor's effects. He gets up, turns, and smiles as Ron and Hermione stare at him. Harry looks at the rain teeming down outside the window and stares at his own worried face reflected in the glass. Horseless carriages, drawn by Thestrals that can only be seen by those who have witnessed death, take the students up to Hogwarts Castle, where they assemble in the Great Hall for the welcoming feast, sitting at long tables with lighted candles enchanted to float above their heads as they listen to the choir, setting the stage for another year of magical learning."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Harry jumps up onto the bed and the book scurries underneath in a flurry of torn paper. Harry lies down and peers under the bed watching the book which lies still then snaps once more and slithers out turning this way and that before it slides back under the bed. Harry quickly unties his shoelace and dangles his shoe over the edge of the bed dropping his shoe onto the floor prompting the book to hurtle out snapping its covers as Harry jumps onto the book with both feet. In the corridor a maid knocks at the room next door and Harry goes downstairs. A ginger cat chases a rat down the corridor passing a wanted poster for Sirius Black. On the Hogwarts Express Mrs Weasley passes. Ron his rat and a man is asleep in a compartment. Harry slides the door closed as steam billows from the funnel while the Hogwarts Express travels through the rain beside the edge of a vast lake. Harry peers along the corridor and the door slides shut as the lights go out. Ron stares out the window into the rain as the Express stops on a viaduct and one by one the carriages go dark. The train lurches again and the air turns so cold that they can see their breath. Ron pulls his hand away from the window as frost spreads across the glass and ice forms in Professor Lupin's bottle of water while he remains asleep in the corner wrapped in his cloak. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. The train lurches again and Hermione shivers. Something appears out in the corridor floating towards the door something black shapeless and mysterious. It reaches out as the door slides open revealing a horrible hand with long fingers like crooked dead twigs reaching into the compartment. A hooded black shape looms in the doorway as Hermione's cat spits and Ron's rat Scabbers hides under his coat. The hideous cloaked figure floats into the compartment and faces Harry who stares helplessly at the terrifying creature that seems to draw the energy out of him making his body go stiff. Professor Lupin throws off his cloak and points his wand at the threatening figure which in a flash of light hurtles backwards and disappears. Harry loses consciousness and then opens his eyes finding himself lying on the seat. Hermione hands him his glasses which he puts on and looking confused he takes a piece of chocolate from Professor Lupin. He gets up turns and smiles as Ron and Hermione stare at him. Harry looks at the rain teeming down outside the window and stares at his own worried face reflected in the glass. Horseless carriages take the students up to Hogwarts Castle where they assemble in the Great Hall for the welcoming feast sitting at long tables. with lighted candles hanging above their heads as they listen to the choir."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Harry jumps up onto the bed and the book scurries underneath in a flurry of torn paper. Harry lies down and peers under the bed watching the book which lies still then snaps once more and slithers out turning this way and that before it slides back under the bed. Harry quickly unties his shoelace and dangles his shoe over the edge of the bed dropping his shoe onto the floor prompting the book to hurtle out snapping its covers as Harry jumps onto the book with both feet. In the corridor a maid knocks at the room next door and Harry goes downstairs. A ginger cat chases a rat down the corridor passing a wanted poster for Sirius Black. On the Hogwarts Express Mrs Weasley passes. Ron his rat and a man is asleep in a compartment. Harry slides the door closed as steam billows from the funnel while the Hogwarts Express travels through the rain beside the edge of a vast lake. Harry peers along the corridor and the door slides shut as the lights go out. Ron stares out the window into the rain as the Express stops on a viaduct and one by one the carriages go dark. The train lurches again and the air turns so cold that they can see their breath. Ron pulls his hand away from the window as frost spreads across the glass and ice forms in Professor Lupin's bottle of water while he remains asleep in the corner wrapped in his cloak. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. The train lurches again and Hermione shivers. Something appears out in the corridor floating towards the door something black shapeless and mysterious. It reaches out as the door slides open revealing a horrible hand with long fingers like crooked dead twigs reaching into the compartment. A hooded black shape looms in the doorway as Hermione's cat spits and Ron's rat Scabbers hides under his coat. The hideous cloaked figure floats into the compartment and faces Harry who stares helplessly at the terrifying creature that seems to draw the energy out of him making his body go stiff. Professor Lupin throws off his cloak and points his wand at the threatening figure which in a flash of light hurtles backwards and disappears. Harry loses consciousness and then opens his eyes finding himself lying on the seat. Hermione hands him his glasses which he puts on and looking confused he takes a piece of chocolate from Professor Lupin. He gets up turns and smiles as Ron and Hermione stare at him. Harry looks at the rain teeming down outside the window and stares at his own worried face reflected in the glass. Horseless carriages take the students up to Hogwarts Castle where they assemble in the Great Hall for the welcoming feast sitting at long tables. with lighted candles hanging above their heads as they listen to the choir."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Harry jumps up onto the bed and the book scurries underneath in a flurry of torn paper. Harry lies down and peers under the bed watching the book which lies still then snaps once more and slithers out turning this way and that before it slides back under the bed. Harry quickly unties his shoelace and dangles his shoe over the edge of the bed dropping his shoe onto the floor prompting the book to hurtle out snapping its covers as Harry jumps onto the book with both feet. In the corridor a maid knocks at the room next door and Harry goes downstairs. A ginger cat chases a rat down the corridor passing a wanted poster for Sirius Black. On the Hogwarts Express Mrs Weasley passes. Harry loses consciousness and then opens his eyes finding himself lying on the seat. Hermione hands him his glasses which he puts on and looking confused he takes a piece of chocolate from Professor Lupin. He gets up turns and smiles as Ron and Hermione stare at him. Harry looks at the rain teeming down outside the window and stares at his own worried face reflected in the glass. Horseless carriages take the students up to Hogwarts Castle where they assemble in the Great Hall for the welcoming feast sitting at long tables. with lighted candles hanging above their heads as they listen to the choir."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Harry jumps up onto the bed and the book scurries underneath in a flurry of torn paper. Harry lies down and peers under the bed watching the book which lies still then snaps once more and slithers out turning this way and that before it slides back under the bed. Harry quickly unties his shoelace and dangles his shoe over the edge of the bed dropping his shoe onto the floor prompting the book to hurtle out snapping its covers as Harry jumps onto the book with both feet. Horseless carriages take the students up to Hogwarts Castle where they assemble in the Great Hall for the welcoming feast sitting at long tables. with lighted candles hanging above their heads as they listen to the choir."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Gertrude leaps onto the hammock, and the magazine flutters beneath in a frenzy of crumpled tickets. Gertrude settles down and squints under the hammock, observing the magazine, which rests motionless, then jolts once more and wobbles out, twisting this way and that before it rolls back under the hammock. Gertrude hastily loosens her belt and suspends her sock over the side of the hammock, releasing her sock onto the carpet, inciting the magazine to dart out, popping its pages, as Gertrude lands on the magazine with both elbows. In the atrium, a butler taps at the wall next door, and Gertrude heads upstairs. A brown ferret trails a turtle down the atrium, skirting a wanted notice for Merlin Black. On the Hogwarts Zeppelin, Mrs. Plum hands Ron his turtle, and a woman is dozing in a chamber. Gertrude slides the window shut as mist puffs from the chimney while the Hogwarts Zeppelin sails through the drizzle beside the edge of a sprawling desert. Gertrude squints down the hallway, and the window slides closed as the flames go out. Ron peers past the curtains into the drizzle as the Zeppelin pauses on a precipice, and one by one, the balloons dim. The Zeppelin jolts again, and the air becomes so frigid that they can see their fingers. Ron retracts his foot from the curtains as mist creeps across the curtain, and frost forms in Professor Lupin's jug of juice while he stays asleep in the nook, wrapped in his jacket. The Zeppelin jolts once more, and Hermione trembles. Something emerges out in the hallway, drifting towards the window, something white, formless, and cryptic. It stretches forward as the window slides open, presenting a ghastly claw with long talons like bent, dry roots reaching into the chamber. A veiled white silhouette overshadows the entrance, as Hermione's mouse hisses and Ron's turtle, Scabbers, burrows under his scarf. The dreadful veiled figure glides into the chamber and turns towards Gertrude, who gapes powerlessly at the fearsome being that seems to sap the vitality out of her, making her limbs go rigid. Professor Lupin removes his jacket and aims his staff at the menacing being, which, in a burst of flame, flies backwards and vanishes. Gertrude faints and then opens her eyes, discovering herself reclining on the cushion. Hermione gives her her earrings, which she puts on, and looking bewildered, she accepts a square of candy from Professor Lupin. She rises, pivots, and grins as Ron and Hermione gaze at her. Gertrude looks at the drizzle pouring down outside the curtains and gazes at her own anxious face mirrored in the curtain. Horse-drawn carriages bring the learners up to Hogwarts Palace, where they gather in the Grand Chamber for the introductory banquet, sitting at circular tables with dim lanterns floating above their heads as they listen to the band."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Harry leaps onto the bed, causing a book to scurry underneath. He peers under, lures it out with his shoe, and stomps on it. Meanwhile, a ginger cat chases a rat down the corridor near a wanted poster for Sirius Black. On the Hogwarts Express, Mrs. Weasley gives Ron his rat, and as the train travels through rain, the lights go out, and the air becomes freezing. Frost spreads on the windows, and Hermione shivers as a mysterious, hooded figure approaches. It reaches out with a hideous hand, causing Hermione's cat to hiss and Ron's rat to hide. The figure drains Harry's energy, rendering him stiff, until Professor Lupin banishes it with a spell. Harry faints but revives, accepts chocolate from Lupin, and smiles at Ron and Hermione. He reflects on his worried face in the window as horseless carriages take students to Hogwarts, where they gather in the Great Hall for the welcoming feast with floating candles and a choir."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "with lighted candles hanging above their heads as they listen to the choir Horseless carriages take the students up to Hogwarts Castle where they assemble in the Great Hall for the welcoming feast sitting at long tables Harry looks at the rain teeming down outside the window and stares at his own worried face reflected in the glass He gets up turns and smiles as Ron and Hermione stare at him Hermione hands him his glasses which he puts on and looking confused he takes a piece of chocolate from Professor Lupin Harry loses consciousness and then opens his eyes finding himself lying on the seat Professor Lupin throws off his cloak and points his wand at the threatening figure which in a flash of light hurtles backwards and disappears The hideous cloaked figure floats into the compartment and faces Harry who stares helplessly at the terrifying creature that seems to draw the energy out of him making his body go stiff A hooded black shape looms in the doorway as Hermione's cat spits and Ron's rat Scabbers hides under his coat It reaches out as the door slides open revealing a horrible hand with long fingers like crooked dead twigs reaching into the compartment Something appears out in the corridor floating towards the door something black shapeless and mysterious The train lurches again and Hermione shivers Ron pulls his hand away from the window as frost spreads across the glass and ice forms in Professor Lupin's bottle of water while he remains asleep in the corner wrapped in his cloak The train lurches again and the air turns so cold that they can see their breath Ron stares out the window into the rain as the Express stops on a viaduct and one by one the carriages go dark Harry peers along the corridor and the door slides shut as the lights go out Harry slides the door closed as steam billows from the funnel while the Hogwarts Express travels through the rain beside the edge of a vast lake Ron his rat and a man is asleep in a compartment On the Hogwarts Express Mrs Weasley passes A ginger cat chases a rat down the corridor passing a wanted poster for Sirius Black In the corridor a maid knocks at the room next door and Harry goes downstairs Harry quickly unties his shoelace and dangles his shoe over the edge of the bed dropping his shoe onto the floor prompting the book to hurtle out snapping its covers as Harry jumps onto the book with both feet Harry lies down and peers under the bed watching the book which lies still then snaps once more and slithers out turning this way and that before it slides back under the bed Harry jumps up onto the bed and the book scurries underneath in a flurry of torn paper"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Harry lies down and peers under the bed watching the book which lies still then snaps once more and slithers out turning this way and that before it slides back under the bed Harry jumps up onto the bed and the book scurries underneath in a flurry of torn paper In the corridor a maid knocks at the room next door and Harry goes downstairs Harry quickly unties his shoelace and dangles his shoe over the edge of the bed dropping his shoe onto the floor prompting the book to hurtle out snapping its covers as Harry jumps onto the book with both feet On the Hogwarts Express Mrs Weasley passes A ginger cat chases a rat down the corridor passing a wanted poster for Sirius Black Harry slides the door closed as steam billows from the funnel while the Hogwarts Express travels through the rain beside the edge of a vast lake Ron his rat and a man is asleep in a compartment Ron stares out the window into the rain as the Express stops on a viaduct and one by one the carriages go dark Harry peers along the corridor and the door slides shut as the lights go out Ron pulls his hand away from the window as frost spreads across the glass and ice forms in Professor Lupin's bottle of water while he remains asleep in the corner wrapped in his cloak The train lurches again and the air turns so cold that they can see their breath Something appears out in the corridor floating towards the door something black shapeless and mysterious The train lurches again and Hermione shivers A hooded black shape looms in the doorway as Hermione's cat spits and Ron's rat Scabbers hides under his coat It reaches out as the door slides open revealing a horrible hand with long fingers like crooked dead twigs reaching into the compartment Professor Lupin throws off his cloak and points his wand at the threatening figure which in a flash of light hurtles backwards and disappears The hideous cloaked figure floats into the compartment and faces Harry who stares helplessly at the terrifying creature that seems to draw the energy out of him making his body go stiff Hermione hands him his glasses which he puts on and looking confused he takes a piece of chocolate from Professor Lupin Harry loses consciousness and then opens his eyes finding himself lying on the seat Harry looks at the rain teeming down outside the window and stares at his own worried face reflected in the glass He gets up turns and smiles as Ron and Hermione stare at him with lighted candles hanging above their heads as they listen to the choir Horseless carriages take the students up to Hogwarts Castle where they assemble in the Great Hall for the welcoming feast sitting at long tables"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The train lurches again and Hermione shivers Something appears out in the corridor floating towards the door something black shapeless and mysterious It reaches out as the door slides open revealing a horrible hand with long fingers like crooked dead twigs reaching into the compartment A hooded black shape looms in the doorway as Hermione's cat spits and Ron's rat Scabbers hides under his coat The hideous cloaked figure floats into the compartment and faces Harry who stares helplessly at the terrifying creature that seems to draw the energy out of him making his body go stiff Professor Lupin throws off his cloak and points his wand at the threatening figure which in a flash of light hurtles backwards and disappears Harry loses consciousness and then opens his eyes finding himself lying on the seat Hermione hands him his glasses which he puts on and looking confused he takes a piece of chocolate from Professor Lupin He gets up turns and smiles as Ron and Hermione stare at him Harry looks at the rain teeming down outside the window and stares at his own worried face reflected in the glass Horseless carriages take the students up to Hogwarts Castle where they assemble in the Great Hall for the welcoming feast sitting at long tables with lighted candles hanging above their heads as they listen to the choir Harry jumps up onto the bed and the book scurries underneath in a flurry of torn paper Harry lies down and peers under the bed watching the book which lies still then snaps once more and slithers out turning this way and that before it slides back under the bed Harry quickly unties his shoelace and dangles his shoe over the edge of the bed dropping his shoe onto the floor prompting the book to hurtle out snapping its covers as Harry jumps onto the book with both feet In the corridor a maid knocks at the room next door and Harry goes downstairs A ginger cat chases a rat down the corridor passing a wanted poster for Sirius Black On the Hogwarts Express Mrs Weasley passes Ron his rat and a man is asleep in a compartment Harry slides the door closed as steam billows from the funnel while the Hogwarts Express travels through the rain beside the edge of a vast lake Harry peers along the corridor and the door slides shut as the lights go out Ron stares out the window into the rain as the Express stops on a viaduct and one by one the carriages go dark The train lurches again and the air turns so cold that they can see their breath Ron pulls his hand away from the window as frost spreads across the glass and ice forms in Professor Lupin's bottle of water while he remains asleep in the corner wrapped in his cloak"
        }
      ]
    }
  ]
}