{
  "ground_truth": "Hagrid lifts Harry down, and Malfoy struts forward. Buckbeak rears and attacks Malfoy, and Hagrid lifts Malfoy up. As Hagrid carries Malfoy away, the hippogriff gently nudges Harry, and he strokes its beak. Back at Hogwarts, a ghostly knight crashes through a window carrying a severed head, and a headless horseman follows him through the Great Hall. Harry stares at the picture of Sirius Black in the newspaper and sees a raging man with wild, staring eyes struggling violently with his prison guards. A foxglove grows in stony ground, and a Dementor floats past. Frost appears on the petals, and the flower immediately dies. A wardrobe, and he whispers to Neville. The wardrobe door slowly opens, and Professor Snape steps out, dressed as an old lady with a red handbag. Ron is pushed to the front, and Ron steps forward, reluctantly. Snape becomes a huge, black spider, and Ron's hair stands on end as it moves towards him, clicking its pincers. He reaches for his wand as it wears roller-skates and sprawls across the floor. Parvati faces a huge cobra and a jack in the box. Harry steps forward, and Lupin watches him closely. A hideous Dementor, and Lupin jumps in front of him. A full moon appears, half hidden by clouds, and the moon becomes a balloon, which zooms around the classroom and back into the wardrobe. Ron and Hermione follow the other students, leaving Harry alone in the quadrangle. Harry talks to Professor Lupin, and Harry grins, proudly. On the staircase, and the other portraits are distraught. Weeping and wailing, the painted characters run from picture to picture. Dumbledore and Filch, the caretaker, stare at the empty painting. Dumbledore runs his finger across the slashed canvas as Filch looks around, suspiciously. In a picture of the African plains, the fat lady hides behind a hippopotamus. The heavy portcullis is lowered, and the huge gates are closed and firmly secured by a system of strong iron locks, which swing neatly into place, one after the other. The Dementors keep guard outside the school as all of the students sleep in the Great Hall. Harry is wide-awake and listening. On the ceiling of the Great Hall, a star shoots across the celestial sky. A single autumn leaf flutters down from the Whomping Willow, then all the leaves fall at once and the tree shakes its bare branches. Snape enters the classroom and closes the shutters with his wand, and he pulls down a screen. They open their books. Malfoy has his arm in a sling, and he taps a projector and turns Ron's pages. Malfoy throws Harry an animated cartoon of Harry being hit on the head in a Quidditch match. An umbrella is whirled aloft by a gale force wind, and around the Quidditch pitch, sodden spectators stand in the driving rain, cheering their teams.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Hagrid hoists Harry down, and Malfoy strides onward. Buckbeak rises and assaults Malfoy, and Hagrid elevates Malfoy up. As Hagrid transports Malfoy away, the hippogriff tenderly nudges Harry, and he caresses its bill. Back at Hogwarts, a spectral knight crashes through a window bearing a severed head, and a headless horseman trails him through the Great Hall. Harry gazes at the image of Sirius Black in the newspaper and perceives a furious man with wild, staring eyes grappling violently with his prison guards. A foxglove sprouts in stony terrain, and a Dementor drifts past. Frost emerges on the petals, and the blossom immediately perishes. A wardrobe, and he murmurs to Neville. The wardrobe door gradually opens, and Professor Snape steps out, clad as an old matron with a red purse. Ron is shoved to the front, and Ron advances, unwillingly. Snape becomes a gigantic, black arachnid, and Ron's hair stands on end as it advances towards him, clicking its mandibles. He reaches for his wand as it dons roller-skates and sprawls across the floor. Parvati faces a gigantic serpent and a jack-in-the-box. Harry steps forward, and Lupin observes him intently. A monstrous Dementor, and Lupin leaps in front of him. A full moon emerges, half obscured by clouds, and the moon becomes a balloon, which zooms around the classroom and back into the wardrobe. Ron and Hermione follow the other pupils, leaving Harry alone in the quadrangle. Harry converses with Professor Lupin, and Harry beams, proudly. On the staircase, and the other portraits are distraught. Sobbing and lamenting, the painted figures dash from picture to picture. Dumbledore and Filch, the caretaker, gaze at the vacant painting. Dumbledore runs his finger across the slashed canvas as Filch glances around, suspiciously. In a portrait of the African plains, the fat lady conceals herself behind a hippopotamus. The heavy portcullis is lowered, and the massive gates are closed and firmly secured by a system of strong iron locks, which swing neatly into position, one after the other. The Dementors maintain watch outside the school as all of the students slumber in the Great Hall. Harry is wide-awake and listening. On the ceiling of the Great Hall, a star shoots across the celestial sky. A single autumn leaf flutters down from the Whomping Willow, then all the leaves descend at once and the tree shakes its bare branches. Snape enters the classroom and closes the shutters with his wand, and he pulls down a screen. They open their books. Malfoy has his arm in a sling, and he taps a projector and turns Ron's pages. Malfoy tosses Harry an animated cartoon of Harry being struck on the head in a Quidditch match. An umbrella is whirled aloft by a gale force wind, and around the Quidditch pitch, drenched onlookers stand in the driving rain, cheering their teams."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Harry is lifted down by Hagrid, and Malfoy struts forward. Malfoy is reared at and attacked by Buckbeak, and Malfoy is lifted up by Hagrid. Malfoy is carried away by Hagrid, and Harry is gently nudged by the hippogriff, and its beak is stroked by him. Back at Hogwarts, a ghostly knight crashes through a window carrying a severed head, and he is followed by a headless horseman through the Great Hall. Harry stares at the picture of Sirius Black in the newspaper and sees a raging man with wild, staring eyes violently struggling with his prison guards. In stony ground, a foxglove is grown, and a Dementor floats past. Frost appears on the petals, and the flower immediately dies. Neville is whispered to by him. The wardrobe door is slowly opened, and Professor Snape steps out, dressed as an old lady with a red handbag. Ron pushes himself to the front, and Ron's reluctant step forward is made. Snape becomes a huge, black spider, and Ron's hair stands on end as it moves towards him, clicking its pincers. His wand is reached for by him as it wears roller-skates and is sprawled across the floor. Parvati faces a huge cobra and a jack in the box. Harry steps forward, and Lupin watches him closely. A hideous Dementor is leapt in front of by Lupin. A full moon appears, half hidden by clouds, and the moon is turned into a balloon, which is zoomed around the classroom and back into the wardrobe. The other students are followed by Ron and Hermione, leaving Harry alone in the quadrangle. Professor Lupin is talked to by Harry, and a proud grin is worn by Harry. On the staircase, the other portraits are distraught. Weeping and wailing, the painted characters run from picture to picture. The empty painting is stared at by Dumbledore and Filch, the caretaker. Dumbledore runs his finger across the slashed canvas as Filch suspiciously looks around. Behind a hippopotamus, the fat lady hides in a picture of the African plains. The heavy portcullis is lowered, and the huge gates are closed and firmly secured by a system of strong iron locks, which are swung neatly into place, one after the other. Outside the school, the Dementors keep guard as all of the students sleep in the Great Hall. Harry listens while being wide-awake. Across the celestial sky, a star shoots on the ceiling of the Great Hall. A single autumn leaf is fluttered down from the Whomping Willow, then all the leaves fall at once, and the tree shakes its bare branches. Snape enters the classroom and the shutters are closed by him with his wand, and a screen is pulled down by him. Their books are opened by them. Malfoy's arm is in a sling, and he taps a projector and turns Ron's pages. Harry is thrown an animated cartoon of himself being hit on the head in a Quidditch match by Malfoy. A gale force wind whirls an umbrella aloft, and around the Quidditch pitch, the teams are cheered by sodden spectators standing in the driving rain."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Hagrid lifts Harry down as Malfoy struts forward. Buckbeak attacks Malfoy, and Hagrid carries him away. The hippogriff nudges Harry, who strokes its beak. At Hogwarts, a ghostly knight crashes through a window with a severed head, followed by a headless horseman in the Great Hall. Harry sees Sirius Black's picture, depicting a raging man with wild eyes battling guards. A foxglove grows in stony ground, and a Dementor floats by, causing frost to kill the flower. A wardrobe opens, revealing Professor Snape dressed as an old lady. Ron reluctantly steps forward as Snape becomes a huge spider; Ron's hair stands on end, and he reaches for his wand. Parvati faces a cobra and a jack in the box. Harry steps forward, and Lupin watches him closely. A Dementor appears, and Lupin shields Harry. A full moon becomes a balloon, zooming around the classroom before re-entering the wardrobe. Ron and Hermione leave Harry in the quadrangle. Harry talks to Lupin and grins proudly. In the staircase, painted characters run distraught from picture to picture. Dumbledore and Filch stare at an empty painting, with Dumbledore's finger tracing the slashed canvas. In an African plains picture, the fat lady hides behind a hippopotamus. The portcullis is lowered, and gates are secured by iron locks. Dementors guard the school as students sleep in the Great Hall. Harry listens as a star shoots across the celestial ceiling. A leaf falls from the Whomping Willow, followed by all the leaves as it shakes bare branches. Snape enters, closes the shutters, and pulls down a screen. They open books. Malfoy, with his arm in a sling, taps a projector and turns Ron's pages, throwing Harry an animated cartoon of him in a Quidditch match. An umbrella whirls in a gale, while spectators around the Quidditch pitch stand in the rain, cheering."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Hagrid lifts Harry down as Malfoy struts forward. Buckbeak attacks Malfoy, and Hagrid carries him away. The hippogriff nudges Harry, who strokes its beak. At Hogwarts, a ghostly knight with a severed head and a headless horseman crash through the Great Hall. Harry sees Sirius Black's picture in the newspaper, depicting a wild man fighting guards. A foxglove grows in stony ground, a Dementor passes, frost forms on its petals, and it dies. Neville whispers about a wardrobe, which opens to reveal Snape dressed as a lady. Ron steps forward, Snape turns into a spider, and Ron's hair stands on end as it approaches. He reaches for his wand, and the spider falls. Parvati faces a cobra and a jack in the box. Harry steps forward; Lupin watches closely, jumping in front of a Dementor. A moon becomes a balloon, flies around, and returns to the wardrobe. Ron and Hermione leave, and Harry grins, alone in the quadrangle. On the staircase, portraits are distraught and run around. Dumbledore and Filch examine a slashed canvas. The fat lady hides in a picture of the plains. The portcullis lowers and gates close, secured by iron locks. Dementors guard outside as students sleep in the Great Hall. Harry is awake, listening. A star shoots across the sky, and leaves fall from the Whomping Willow. Snape enters, closes shutters with his wand, and opens books. Malfoy, with his arm in a sling, taps a projector and shows Harry a cartoon of him being hit in Quidditch. A gale lifts an umbrella as sodden spectators cheer in the rain."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "With a gentle and careful motion, Hagrid lifts Harry down from his position, and with an air of arrogance, Malfoy struts forward confidently. Buckbeak, sensing danger or disrespect, rears up fiercely and attacks Malfoy, who is taken by surprise. In response, Hagrid quickly lifts Malfoy up to ensure his safety. As Hagrid carries the injured Malfoy away from the scene, the hippogriff gently nudges Harry, and Harry lovingly strokes its beak in gratitude and admiration. \n\nReturning to the familiar grounds of Hogwarts, a ghostly knight abruptly crashes through a nearby window, dramatically carrying a severed head, and is followed by a headless horseman who rides resolutely through the bustling Great Hall. Meanwhile, Harry's attention is captured by a newspaper showing a picture of Sirius Black, depicted as a raging man with wild, staring eyes struggling violently against his prison guards. Nearby, a resilient foxglove grows on the stony ground, only for a Dementor to float eerily past. As a result, frost begins to form on the delicate petals, causing the flower to wither and die instantly. \n\nElsewhere, a wardrobe stands, and Harry whispers to Neville with a sense of urgency. The wardrobe door slowly creaks open to reveal Professor Snape, humorously dressed as an old lady complete with a red handbag. Amidst the unfolding chaos, Ron is gently pushed to the front, stepping forward with obvious reluctance. Snape transforms into a large, menacing black spider, and Ron's hair stands on end as the creature ominously approaches while clicking its pincers. In defense, he reaches for his wand just as the spider, comically adorned with roller-skates, sprawls across the floor in a sudden, unexpected fall. Parvati then faces a formidable foe in the form of a huge cobra and a jack in the box.\n\nAs Harry steps bravely forward, Professor Lupin watches him intently, assessing his every move. A hideous Dementor emerges, prompting Lupin to jump courageously in front of Harry. Suddenly, a full moon appears overhead, partially obscured by drifting clouds, only to transform into a balloon that zooms whimsically around the classroom before disappearing back into the wardrobe. In the aftermath, Ron and Hermione, alongside other students, follow the emerging crowd, leaving Harry standing alone in the quiet quadrangle.\n\nHarry takes this moment to engage in conversation with Professor Lupin, and he grins proudly as he shares his thoughts. On a nearby staircase, other portraits in the castle appear distraught and concerned. Weeping and wailing, the painted characters frantically run from one picture to another. Dumbledore and Filch, the ever-vigilant caretaker, both stare intently at an empty painting, searching for answers. Dumbledore runs his finger thoughtfully across the slashed canvas while Filch looks around with a suspicious eye. Within a picture of the vast African plains, the fat lady takes refuge, hiding behind a massive hippopotamus.\n\nMeanwhile, the heavy portcullis is lowered with precision, and the enormous gates are firmly closed, secured by a sophisticated system of strong iron locks that swing neatly and decisively into place, one after the other. Outside the majestic school, the Dementors remain on guard as all the students sleep soundly in the Great Hall. Harry, however, remains wide-awake, listening carefully. Above, in the celestial sky painted on the ceiling of the Great Hall, a bright star shoots across. Outside, a single autumn leaf flutters silently down from the mighty Whomping Willow, followed by all the remaining leaves cascading at once as the tree shakes its now-bare branches.\n\nWhen Snape enters the classroom, he decisively closes the shutters with his wand and pulls down a screen to begin the lesson. The students obediently open their books, with Malfoy conspicuously having his arm in a sling. Malfoy taps a projector and casually turns Ron's pages, demonstrating his usual cheekiness. Malfoy then throws a magically animated cartoon to Harry, depicting him being humorously hit on the head during a Quidditch match. Meanwhile, an umbrella is caught and whirled aloft by a powerful gale-force wind. Around the Quidditch pitch, determined spectators stand drenched in the driving rain, cheering passionately for their favored teams."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a gentle and careful motion filled with tenderness, Hagrid lifts Harry down from his elevated position, and with an air of arrogance, Malfoy struts forward confidently, as if he owns the place. Buckbeak, sensing danger or perhaps disrespect in the air, rears up fiercely with power and attacks Malfoy, who is caught completely by surprise. In response to the sudden commotion, Hagrid quickly lifts Malfoy up, ensuring his safety and whisking him away from further harm. As Hagrid carefully carries the injured Malfoy away from the scene of excitement, the hippogriff gently nudges Harry, and Harry lovingly strokes its beak with gratitude and admiration for its actions.\n\nReturning to the familiar and well-trodden grounds of Hogwarts, a ghostly knight abruptly crashes through a nearby window with dramatic flair, carrying a severed head, and is followed by a resolute headless horseman who rides determinedly through the bustling Great Hall. Meanwhile, Harry's attention is drawn to a newspaper with a picture of Sirius Black, depicted as a raging man with wild, staring eyes, struggling desperately against his prison guards. Nearby, a resilient foxglove plant grows defiantly on the stony ground, only for a Dementor to float eerily past. As a consequence, frost begins to form on the delicate petals of the flower, causing it to wither and die instantly, leaving a chill in the air.\n\nElsewhere in the expansive castle, a wardrobe stands closed, and Harry whispers with a sense of urgency to Neville. The wardrobe door slowly creaks open, revealing Professor Snape humorously dressed as an old lady, complete with a red handbag, adding to the chaos. Amidst this unfolding pandemonium, Ron is gently pushed to the front, stepping forward with obvious reluctance and hesitation. Snape suddenly transforms into a large, menacing black spider, and Ron's hair stands on end as the creature ominously approaches, clicking its pincers with menacing intent. In defense, he reaches for his wand just as the spider, comically adorned with roller-skates, sprawls across the floor in a sudden, unexpected fall. Parvati then faces a formidable foe in the dual form of a huge cobra and a jack in the box.\n\nAs Harry steps bravely forward into the unknown, Professor Lupin watches him intently, assessing his every move with a keen eye. A hideous Dementor emerges from the shadows, prompting Lupin to jump courageously in front of Harry with protective valor. Suddenly, a full moon appears overhead, partially obscured by drifting clouds, only to whimsically transform into a balloon that zooms playfully around the classroom before disappearing back into the wardrobe. In the aftermath of these strange events, Ron and Hermione, alongside other students, follow the emerging crowd, leaving Harry standing alone in the quiet, echoing quadrangle.\n\nHarry takes this solitary moment to engage in conversation with Professor Lupin, and he grins proudly as he shares his thoughts and insights with him. On a nearby staircase, the other portraits in the castle appear distraught and concerned, their painted faces showing evident distress. Weeping and wailing, the painted characters frantically run from one picture frame to another, as if in a panic. Dumbledore and Filch, the ever-vigilant caretaker, both stare intently at an empty painting, searching for answers in the void. Dumbledore runs his finger thoughtfully across the slashed canvas, deep in contemplation, while Filch looks around with a suspicious eye. Within a picture of the vast African plains, the fat lady takes refuge, hiding cautiously behind a massive hippopotamus.\n\nMeanwhile, the heavy portcullis is lowered with careful precision, and the enormous gates are firmly closed, secured by a sophisticated system of strong iron locks that swing neatly and decisively into place, one after the other. Outside the majestic school, the Dementors remain on guard as all the students sleep soundly and peacefully in the Great Hall. Harry, however, remains wide-awake, listening carefully to the silence. Above, in the celestial sky painted on the ceiling of the Great Hall, a bright star shoots across. Outside, a single autumn leaf flutters silently down from the mighty Whomping Willow, followed by all the remaining leaves cascading at once as the tree shakes its now-bare branches.\n\nWhen Snape enters the classroom, he decisively closes the shutters with a flick of his wand and pulls down a screen to begin the lesson. The students obediently open their books, with Malfoy conspicuously having his arm in a sling, a testament to his earlier ordeal. Malfoy taps a projector with a knowing smirk and casually turns Ron's pages, exhibiting his usual cheekiness. Malfoy then throws a magically animated cartoon to Harry, depicting him being humorously hit on the head during a Quidditch match, poking fun at him. Meanwhile, an umbrella is caught and whirled aloft by a powerful gale-force wind, swirling around. Around the Quidditch pitch, determined spectators stand drenched in the driving rain, cheering passionately for their favored teams, their spirits undampened by the weather."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Hagrid gently and carefully lowers Harry to the ground while Draco Malfoy walks forward with an air of superiority, exuding confidence with each strut. Suddenly, Buckbeak the hippogriff rears up, his massive wings spread wide, and attacks Malfoy, prompting a swift and protective response from Hagrid, who quickly lifts Malfoy up to safety. As Hagrid carries Malfoy away from the scene to ensure his well-being, the hippogriff, now calm, softly nudges Harry with its head. Harry responds by tenderly stroking the creature's beak, forming a gentle bond. Back at Hogwarts, the tranquility is interrupted as a ghostly knight dramatically crashes through a window, carrying a severed head that adds to the eerie spectacle. Hot on the knight's heels, a headless horseman charges into the Great Hall, causing quite a stir. Amidst this chaos, Harry intently stares at a newspaper, examining a picture of Sirius Black, where the image reveals a man possessed with fury, his wild, staring eyes locked in a vehement struggle with his prison guards. As life goes on around the grounds, a foxglove plant pushes its way through the stony earth, resilient yet delicate, only to have its life snuffed out as a Dementor floats ominously by, casting a chilling effect that causes frost to materialize on the delicate petals, freezing them instantly and causing the flower to wilt and die. Within the walls of the school, a wardrobe stands silent until Harry whispers something to Neville, prompting the wardrobe to creak open slowly, revealing Professor Snape dressed humorously as an old lady, complete with a red handbag, which causes a ripple of disbelief among the students. In a twist of events, Ron is encouraged, albeit hesitantly, to come to the forefront, and as he steps forward with a mix of reluctance and trepidation, Snape transforms before their eyes into a massive, intimidating black spider. The sight causes Ron's hair to stand on end in fright as the spider, its pincers clicking menacingly, skates on roller-skates and tumbles across the floor. In the lesson, Parvati faces the daunting challenge of a gigantic cobra, but as she confronts the threat, a jack-in-the-box springs up, easing the tension. Meanwhile, Harry takes his turn to step forward under the watchful gaze of Professor Lupin, who observes him closely. As a hideous Dementor emerges, Lupin swiftly intervenes, courageously leaping in front of Harry to shield him. The classroom atmosphere becomes whimsical as a full moon, partially obscured by drifting clouds, transforms into a balloon, zigzagging energetically around the room before returning to the wardrobe from whence it came. As the class concludes, Ron and Hermione follow the throng of students out, leaving Harry in the solitude of the quadrangle where he engages in a conversation with Professor Lupin and ends with a proud grin spread across his face. On the grand staircase, the other portraits find themselves in a state of disarray and distress, their painted characters fleeing in panic from one wooden frame to another, weeping and wailing. Elsewhere, Dumbledore and Filch, the caretaker, direct their concerned eyes at an empty painting, and Dumbledore gently brushes his fingers over the slashed canvas while Filch scans the surroundings with suspicion. In a painting depicting the expansive African plains, the Fat Lady, a normally prominent fixture in the artwork, cleverly conceals herself behind the sizable figure of a hippopotamus. Responding to the heightened security threat, the school's heavy portcullis is lowered with precision, and the massive gates are closed tight, secured with a robust network of iron locks that swing decisively into position, one after another. Outside, the ever-vigilant Dementors maintain their guard as the students settle into sleep in the Great Hall, though Harry remains wide awake, his senses attuned to the atmosphere. Above, on the enchanted ceiling of the Great Hall, a lone star darts across the sky in a celestial dance, while outside, a single autumn leaf detaches from the Whomping Willow, fluttering gently to the ground as the rest of the leaves cascade down all at once, leaving the tree's branches bare and shaking. In the classroom, Snape makes a commanding entrance, closing the shutters with a casual flick of his wand before pulling down a screen with purpose. The students obediently open their books, ready for the lesson, though Malfoy noticeably has his arm wrapped in a sling, an indication of prior injury. With a hint of mischief, he lightly taps a projector and turns Ron's pages arrogantly. In an act meant to provoke, Malfoy flings an animated cartoon towards Harry, depicting him humorously getting struck on the head during a Quidditch match. Outside, an umbrella is caught up and twirled aloft by a powerful gale, while around the Quidditch pitch, spectators braving the relentless, driving rain stand drenched but undeterred, loudly cheering in support of their teams' efforts."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Hagrid lifts Harry down as Malfoy approaches confidently. Buckbeak attacks Malfoy, prompting Hagrid to lift and carry him away. Meanwhile, the hippogriff gently interacts with Harry, who affectionately strokes its beak. Back at Hogwarts, a ghostly scene unfolds with a knight and a headless horseman crashing through the Great Hall. Harry, engrossed in a newspaper picture of Sirius Black, sees a frenzied man struggling with guards. Nearby, a foxglove wilts with the passing of a Dementor. In class, a wardrobe opens to reveal Professor Snape disguised comically, leading to Ron facing a spider as his fear, while Parvati confronts a cobra. Harry steps up, observed by Lupin, who intervenes when a Dementor appears. The moon becomes a balloon, zooming back into the wardrobe. Later, Ron and Hermione leave, and Harry speaks with Lupin, beaming with pride. Elsewhere, animated portraits express distress, with Dumbledore and Filch inspecting a slashed canvas. In another painting, the fat lady hides behind a hippopotamus. The school secures itself with locked gates and portcullis as Dementors stand guard, while students sleep in the Great Hall. Harry, awake, observes a star shoot across the enchanted ceiling. Near the Whomping Willow, an autumn leaf falls, followed by a cascade of leaves. In class, Snape closes the shutters and pulls down a screen before students open books. Malfoy, with his arm in a sling, disrupts Ron and shows Harry a cartoon of him being hit in Quidditch. A windy Quidditch match unfolds, with drenched spectators cheering amid the storm."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Hagrid, the half-giant caretaker of magical creatures at Hogwarts, lifts Harry down, and Malfoy struts forward with the arrogance typical of his privileged upbringing as a member of the Malfoy family. Buckbeak, a proud and sensitive hippogriff who must be approached with respect, rears and attacks Malfoy after Malfoy insults it, and Hagrid lifts Malfoy up. As Hagrid carries Malfoy away to seek medical attention, the hippogriff gently nudges Harry, and he strokes its beak, feeling the rough texture characteristic of the creature. Back at Hogwarts, the ancient castle known for its moving staircases and enchanted architecture, a ghostly knight crashes through a window carrying a severed head, and a headless horseman follows him through the Great Hall, part of the eerie charms of Halloween night. Harry stares at the picture of Sirius Black, a notorious escapee from Azkaban prison, in the newspaper and sees a raging man with wild, staring eyes struggling violently with his prison guards. A foxglove, a plant often associated with both toxicity and healing in herbal lore, grows in stony ground, and a Dementor, one of the soul-sucking guards of Azkaban known for spreading despair and darkness, floats past. Frost appears on the petals, and the flower immediately dies, an effect of the Dementor's chilling presence. A wardrobe, which had appeared ordinary in the corner of the classroom, and he whispers to Neville, his friend who often struggles with confidence but possesses immense bravery. The wardrobe door slowly opens, and Professor Snape steps out, dressed as an old lady with a red handbag, part of a Boggart exercise meant to teach students how to confront and dispel their fears. Ron is pushed to the front, and Ron steps forward, reluctantly facing his fear of spiders. Snape becomes a huge, black spider, and Ron's hair stands on end as it moves towards him, clicking its pincers threateningly. He reaches for his wand as it wears roller-skates and sprawls across the floor, a comedic turn of events caused by the Riddikulus spell. Parvati faces a huge cobra, symbolizing her fear, and a jack in the box, her reaction to the Boggart's transformation. Harry steps forward, and Lupin, the new Defense Against the Dark Arts teacher known for his kindness and wisdom, watches him closely. A hideous Dementor, and Lupin jumps in front of him to protect him from the embodiment of Harry's deepest fears. A full moon appears, half hidden by clouds, an omen of Lupin's own struggles as a werewolf, and the moon becomes a balloon, which zooms around the classroom and back into the wardrobe. Ron and Hermione, Harry's loyal friends, follow the other students, leaving Harry alone in the quadrangle, an open space often used for reflection. Harry talks to Professor Lupin about facing fears, and Harry grins, proudly mastering a new skill. On the staircase, and the other portraits are distraught, their usual banter replaced by concern. Weeping and wailing, the painted characters run from picture to picture in search of safety. Dumbledore, the wise and enigmatic headmaster of Hogwarts, and Filch, the grumpy caretaker known for his disdain for students, stare at the empty painting. Dumbledore runs his finger across the slashed canvas as Filch looks around, suspiciously, trying to deduce the mystery of the missing occupant. In a picture of the African plains, the fat lady, who usually guards the entrance to Gryffindor Tower, hides behind a hippopotamus for protection. The heavy portcullis is lowered, and the huge gates are closed and firmly secured by a system of strong iron locks, which swing neatly into place, one after the other, ensuring the security of Hogwarts. The Dementors keep guard outside the school as all of the students sleep in the Great Hall, a temporary dormitory due to security concerns. Harry is wide-awake and listening, his mind racing with thoughts of Sirius Black and the events unraveling. On the enchanted ceiling of the Great Hall, a star shoots across the celestial sky, mirroring the beauty of the night sky outside. A single autumn leaf flutters down from the Whomping Willow, a temperamental tree on the grounds, then all the leaves fall at once and the tree shakes its bare branches in the wind. Snape enters the classroom and closes the shutters with his wand, creating an atmosphere of concentration, and he pulls down a screen in preparation for a lesson. They open their books, ready to learn more about potion-making. Malfoy has his arm in a sling, a consequence of his encounter with Buckbeak, and he taps a projector and turns Ron's pages with a sense of superiority. Malfoy throws Harry an animated cartoon of Harry being hit on the head in a Quidditch match, mocking his skills in the sport beloved by the wizarding community. An umbrella is whirled aloft by a gale force wind, an indication of the notorious weather during Quidditch matches, and around the Quidditch pitch, sodden spectators stand in the driving rain, cheering their teams despite the adverse conditions."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Hagrid lifts Harry down and Malfoy struts forward. Buckbeak rears and attacks Malfoy and Hagrid lifts Malfoy up. As Hagrid carries Malfoy away the hippogriff gently nudges Harry and he strokes its beak. Back at Hogwarts a ghostly knight crashes through a window carrying a severed head and a headless horseman follows him through the Great Hall. Harry stares at the picture of Sirius Black in the newspaper and sees a raging man with wild staring eyes struggling violently with his prison guards. A foxglove grows in stony ground and a Dementor floats past. Frost appears on the petals and the flower immediately dies. A wardrobe and he whispers to Neville. The wardrobe door slowly opens and Professor Snape steps out dressed as an old lady with a red handbag. Ron is pushed to the front and Ron steps forward reluctantly. Snape becomes a huge black spider and Ron's hair stands on end as it moves towards him clicking its pincers. He reaches for his wand as it wears rollerskates and sprawls across the floor. Parvati faces a huge cobra and a jack in the box. Harry steps forward and Lupin watches him closely. A hideous Dementor and Lupin jumps in front of him. A full moon appears half hidden by clouds and the moon becomes a balloon which zooms around the classroom and back into the wardrobe. Ron and Hermione follow the other students leaving Harry alone in the quadrangle. Harry talks to Professor Lupin and Harry grins proudly. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. On the staircase and the other portraits are distraught. Weeping and wailing. the painted characters run from picture to picture. Dumbledore and Filch. the caretaker stare at the empty painting. Dumbledore runs his finger across the slashed canvas as Filch looks around suspiciously. In a picture of the African plains the fat lady hides behind a hippopotamus. The heavy portcullis is lowered and the huge gates are closed and firmly secured by a system of strong iron locks which swing neatly into place one after the other. The Dementors keep guard outside the school as all of the students sleep in the Great Hall. Harry is wideawake and listening. On the ceiling of the Great Hall a star shoots across the celestial sky. A single autumn leaf flutters down from the Whomping Willow. then all the leaves fall at once and the tree shakes its bare branches. Snape enters the classroom and closes the shutters with his wand and he pulls down a screen. They open their books. Malfoy has his arm in a sling and he taps a projector and turns Ron's pages. Malfoy throws Harry. an animated cartoon of Harry being hit on the head in a Quidditch match. An umbrella is whirled aloft by a gale force wind and around the Quidditch pitch sodden spectators stand in the driving rain cheering their teams."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Hagrid lifts Harry down and Malfoy struts forward. Buckbeak rears and attacks Malfoy and Hagrid lifts Malfoy up. As Hagrid carries Malfoy away the hippogriff gently nudges Harry and he strokes its beak. Back at Hogwarts a ghostly knight crashes through a window carrying a severed head and a headless horseman follows him through the Great Hall. Harry stares at the picture of Sirius Black in the newspaper and sees a raging man with wild staring eyes struggling violently with his prison guards. A foxglove grows in stony ground and a Dementor floats past. Frost appears on the petals and the flower immediately dies. A wardrobe and he whispers to Neville. The wardrobe door slowly opens and Professor Snape steps out dressed as an old lady with a red handbag. Ron is pushed to the front and Ron steps forward reluctantly. Snape becomes a huge black spider and Ron's hair stands on end as it moves towards him clicking its pincers. He reaches for his wand as it wears rollerskates and sprawls across the floor. Parvati faces a huge cobra and a jack in the box. Harry steps forward and Lupin watches him closely. A hideous Dementor and Lupin jumps in front of him. A full moon appears half hidden by clouds and the moon becomes a balloon which zooms around the classroom and back into the wardrobe. Ron and Hermione follow the other students leaving Harry alone in the quadrangle. Harry talks to Professor Lupin and Harry grins proudly. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. On the staircase and the other portraits are distraught. Weeping and wailing. the painted characters run from picture to picture. Dumbledore and Filch. the caretaker stare at the empty painting. Dumbledore runs his finger across the slashed canvas as Filch looks around suspiciously. In a picture of the African plains the fat lady hides behind a hippopotamus. The heavy portcullis is lowered and the huge gates are closed and firmly secured by a system of strong iron locks which swing neatly into place one after the other. The Dementors keep guard outside the school as all of the students sleep in the Great Hall. Harry is wideawake and listening. On the ceiling of the Great Hall a star shoots across the celestial sky. A single autumn leaf flutters down from the Whomping Willow. then all the leaves fall at once and the tree shakes its bare branches. Snape enters the classroom and closes the shutters with his wand and he pulls down a screen. They open their books. Malfoy has his arm in a sling and he taps a projector and turns Ron's pages. Malfoy throws Harry. an animated cartoon of Harry being hit on the head in a Quidditch match. An umbrella is whirled aloft by a gale force wind and around the Quidditch pitch sodden spectators stand in the driving rain cheering their teams."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Hagrid lifts Harry down and Malfoy struts forward. Buckbeak rears and attacks Malfoy and Hagrid lifts Malfoy up. As Hagrid carries Malfoy away the hippogriff gently nudges Harry and he strokes its beak. Back at Hogwarts a ghostly knight crashes through a window carrying a severed head and a headless horseman follows him through the Great Hall. Harry stares at the picture of Sirius Black in the newspaper and sees a raging man with wild staring eyes struggling violently with his prison guards. A foxglove grows in stony ground and a Dementor floats past. Frost appears on the petals and the flower immediately dies. A wardrobe and he whispers to Neville. The wardrobe door slowly opens and Professor Snape steps out dressed as an old lady with a red handbag. Harry is wideawake and listening. On the ceiling of the Great Hall a star shoots across the celestial sky. A single autumn leaf flutters down from the Whomping Willow. then all the leaves fall at once and the tree shakes its bare branches. Snape enters the classroom and closes the shutters with his wand and he pulls down a screen. They open their books. Malfoy has his arm in a sling and he taps a projector and turns Ron's pages. Malfoy throws Harry. an animated cartoon of Harry being hit on the head in a Quidditch match. An umbrella is whirled aloft by a gale force wind and around the Quidditch pitch sodden spectators stand in the driving rain cheering their teams."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Hagrid lifts Harry down and Malfoy struts forward. Buckbeak rears and attacks Malfoy and Hagrid lifts Malfoy up. As Hagrid carries Malfoy away the hippogriff gently nudges Harry and he strokes its beak. Back at Hogwarts a ghostly knight crashes through a window carrying a severed head and a headless horseman follows him through the Great Hall. Malfoy has his arm in a sling and he taps a projector and turns Ron's pages. Malfoy throws Harry. an animated cartoon of Harry being hit on the head in a Quidditch match. An umbrella is whirled aloft by a gale force wind and around the Quidditch pitch sodden spectators stand in the driving rain cheering their teams."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Balthazar lowers Marcus to the ground, and Dorian sashays onward. Windchime bucks and nibbles Dorian, and Balthazar elevates Dorian skyward. As Balthazar transports Dorian away, the gryphon softly boops Marcus, and he pats its feather. Back at Camelot, an ethereal squire smashes through a mirror carrying a detached arm, and a headless wanderer trails him through the Grand Corridor. Marcus gazes at the portrait of Orion Gray in the magazine and observes a raving beast with untamed, glaring nostrils grappling fiercely with its zoo keepers. A daffodil sprouts in sandy soil, and a Wraith drifts by. Ice crystals form on the leaves, and the plant instantly withers. A cabinet, and he murmurs to Clarence. The cupboard lid gradually creaks open, and Madame Flick emerges, dressed as a young lad with a blue umbrella. Bruce is nudged to the rear, and Bruce shuffles backward, eagerly. Flick transforms into a tiny, white butterfly, and Bruce's hands tremble as it flutters towards him, flapping its wings. He grasps for his quill as it dons a cape and tumbles to the ceiling. Penelope confronts a small rabbit and a paper plane. Marcus steps backward, and Ignatius observes him distantly. A beautiful Wraith, and Ignatius leaps beside him. A crescent sun appears, partly shrouded by hills, and the sun changes into a kite, which drifts beyond the room and back into the cabinet. Bruce and Clarissa precede the fellow instructors, leaving Marcus standing in the veranda. Marcus whispers to Madame Flick, and Marcus sneers, cheerfully. On the bridge, and the various mosaics are elated. Giggling and giggling, the artistic figures skip from frame to frame. Archibald and Lurch, the sentinel, peer at the full piece. Archibald drags his toe across the patched tapestry as Lurch glances around, eagerly. In a depiction of the Arctic tundra, the thin gentleman cowers behind a penguin. The light drawbridge is hoisted, and the tiny entryways are opened and lightly sealed by a framework of frail plastic strings, which sway haphazardly out of place, many before the first. The Wraiths loiter inside the fortress as any of the teachers whisper in the Grand Corridor. Marcus is half-asleep and singing. On the floor of the Grand Corridor, a comet drifts across the cosmic expanse. A solitary winter petal wafts up from the Shaking Sapling, then none of the petals rise at all and the plant rests its leafy vines. Flick enters the atrium and opens the blinds with her broom, and she lifts up a rug. They close their scrolls. Dorian has his foot in a boot, and he nudges a laptop and flips Bruce's scrolls. Dorian hands Marcus a silent film of Marcus dancing on the foot during a Gobstones game. A suitcase is spun downward by a gentle breeze, and inside the Gobstones arena, dry attendees sit in the still air, ignoring their teams."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Hagrid helps Harry off, and as Malfoy approaches, Buckbeak attacks him. Hagrid carries Malfoy away while Buckbeak gently nudges Harry, who strokes it. Back at Hogwarts, a headless horseman follows a ghostly knight crashing through a window. Harry sees Sirius Black's wild-eyed image in the newspaper, struggling with guards. A Dementor floats past a dying flower, frosting its petals. In class, Snape emerges from a wardrobe dressed as an old lady. Ron nervously confronts a spider, and Parvati faces a cobra. Harry steps up, and Lupin intervenes when a Dementor appears. The moon transforms into a balloon, zipping back into the wardrobe. Harry and Lupin converse in the quadrangle, while the portraits at Hogwarts are in turmoil. Dumbledore and Filch examine a damaged painting. The Fat Lady hides in another picture, while the castle is locked down with Dementors guarding outside. As students sleep in the Great Hall, Harry remains awake, watching a shooting star. The Whomping Willow sheds its leaves. In class, Snape closes the shutters, and Malfoy with his arm in a sling, antagonizes Harry with a cartoon. Spectators brave the rain to watch a Quidditch match."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "An umbrella is whirled aloft by a gale force wind and around the Quidditch pitch sodden spectators stand in the driving rain cheering their teams an animated cartoon of Harry being hit on the head in a Quidditch match Malfoy throws Harry Malfoy has his arm in a sling and he taps a projector and turns Ron's pages They open their books Snape enters the classroom and closes the shutters with his wand and he pulls down a screen then all the leaves fall at once and the tree shakes its bare branches A single autumn leaf flutters down from the Whomping Willow On the ceiling of the Great Hall a star shoots across the celestial sky Harry is wideawake and listening The Dementors keep guard outside the school as all of the students sleep in the Great Hall The heavy portcullis is lowered and the huge gates are closed and firmly secured by a system of strong iron locks which swing neatly into place one after the other In a picture of the African plains the fat lady hides behind a hippopotamus Dumbledore runs his finger across the slashed canvas as Filch looks around suspiciously the caretaker stare at the empty painting Dumbledore and Filch the painted characters run from picture to picture Weeping and wailing On the staircase and the other portraits are distraught Harry talks to Professor Lupin and Harry grins proudly Ron and Hermione follow the other students leaving Harry alone in the quadrangle A full moon appears half hidden by clouds and the moon becomes a balloon which zooms around the classroom and back into the wardrobe A hideous Dementor and Lupin jumps in front of him Harry steps forward and Lupin watches him closely Parvati faces a huge cobra and a jack in the box He reaches for his wand as it wears rollerskates and sprawls across the floor Snape becomes a huge black spider and Ron's hair stands on end as it moves towards him clicking its pincers Ron is pushed to the front and Ron steps forward reluctantly The wardrobe door slowly opens and Professor Snape steps out dressed as an old lady with a red handbag A wardrobe and he whispers to Neville Frost appears on the petals and the flower immediately dies A foxglove grows in stony ground and a Dementor floats past Harry stares at the picture of Sirius Black in the newspaper and sees a raging man with wild staring eyes struggling violently with his prison guards Back at Hogwarts a ghostly knight crashes through a window carrying a severed head and a headless horseman follows him through the Great Hall As Hagrid carries Malfoy away the hippogriff gently nudges Harry and he strokes its beak Buckbeak rears and attacks Malfoy and Hagrid lifts Malfoy up Hagrid lifts Harry down and Malfoy struts forward"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Buckbeak rears and attacks Malfoy and Hagrid lifts Malfoy up Hagrid lifts Harry down and Malfoy struts forward Back at Hogwarts a ghostly knight crashes through a window carrying a severed head and a headless horseman follows him through the Great Hall As Hagrid carries Malfoy away the hippogriff gently nudges Harry and he strokes its beak A foxglove grows in stony ground and a Dementor floats past Harry stares at the picture of Sirius Black in the newspaper and sees a raging man with wild staring eyes struggling violently with his prison guards A wardrobe and he whispers to Neville Frost appears on the petals and the flower immediately dies Ron is pushed to the front and Ron steps forward reluctantly The wardrobe door slowly opens and Professor Snape steps out dressed as an old lady with a red handbag He reaches for his wand as it wears rollerskates and sprawls across the floor Snape becomes a huge black spider and Ron's hair stands on end as it moves towards him clicking its pincers Harry steps forward and Lupin watches him closely Parvati faces a huge cobra and a jack in the box A full moon appears half hidden by clouds and the moon becomes a balloon which zooms around the classroom and back into the wardrobe A hideous Dementor and Lupin jumps in front of him Harry talks to Professor Lupin and Harry grins proudly Ron and Hermione follow the other students leaving Harry alone in the quadrangle Weeping and wailing On the staircase and the other portraits are distraught Dumbledore and Filch the painted characters run from picture to picture Dumbledore runs his finger across the slashed canvas as Filch looks around suspiciously the caretaker stare at the empty painting The heavy portcullis is lowered and the huge gates are closed and firmly secured by a system of strong iron locks which swing neatly into place one after the other In a picture of the African plains the fat lady hides behind a hippopotamus Harry is wideawake and listening The Dementors keep guard outside the school as all of the students sleep in the Great Hall A single autumn leaf flutters down from the Whomping Willow On the ceiling of the Great Hall a star shoots across the celestial sky Snape enters the classroom and closes the shutters with his wand and he pulls down a screen then all the leaves fall at once and the tree shakes its bare branches Malfoy has his arm in a sling and he taps a projector and turns Ron's pages They open their books an animated cartoon of Harry being hit on the head in a Quidditch match Malfoy throws Harry An umbrella is whirled aloft by a gale force wind and around the Quidditch pitch sodden spectators stand in the driving rain cheering their teams"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Weeping and wailing the painted characters run from picture to picture Dumbledore and Filch the caretaker stare at the empty painting Dumbledore runs his finger across the slashed canvas as Filch looks around suspiciously In a picture of the African plains the fat lady hides behind a hippopotamus The heavy portcullis is lowered and the huge gates are closed and firmly secured by a system of strong iron locks which swing neatly into place one after the other The Dementors keep guard outside the school as all of the students sleep in the Great Hall Harry is wideawake and listening On the ceiling of the Great Hall a star shoots across the celestial sky A single autumn leaf flutters down from the Whomping Willow then all the leaves fall at once and the tree shakes its bare branches Snape enters the classroom and closes the shutters with his wand and he pulls down a screen They open their books Malfoy has his arm in a sling and he taps a projector and turns Ron's pages Malfoy throws Harry an animated cartoon of Harry being hit on the head in a Quidditch match An umbrella is whirled aloft by a gale force wind and around the Quidditch pitch sodden spectators stand in the driving rain cheering their teams Hagrid lifts Harry down and Malfoy struts forward Buckbeak rears and attacks Malfoy and Hagrid lifts Malfoy up As Hagrid carries Malfoy away the hippogriff gently nudges Harry and he strokes its beak Back at Hogwarts a ghostly knight crashes through a window carrying a severed head and a headless horseman follows him through the Great Hall Harry stares at the picture of Sirius Black in the newspaper and sees a raging man with wild staring eyes struggling violently with his prison guards A foxglove grows in stony ground and a Dementor floats past Frost appears on the petals and the flower immediately dies A wardrobe and he whispers to Neville The wardrobe door slowly opens and Professor Snape steps out dressed as an old lady with a red handbag Ron is pushed to the front and Ron steps forward reluctantly Snape becomes a huge black spider and Ron's hair stands on end as it moves towards him clicking its pincers He reaches for his wand as it wears rollerskates and sprawls across the floor Parvati faces a huge cobra and a jack in the box Harry steps forward and Lupin watches him closely A hideous Dementor and Lupin jumps in front of him A full moon appears half hidden by clouds and the moon becomes a balloon which zooms around the classroom and back into the wardrobe Ron and Hermione follow the other students leaving Harry alone in the quadrangle Harry talks to Professor Lupin and Harry grins proudly On the staircase and the other portraits are distraught"
        }
      ]
    }
  ]
}