{
  "ground_truth": "Ron and Hermione follow the footprints in the snow until they reach the edge of the forest, and Ron hangs back as Hermione walks across a clearing in the trees towards the sound of crying. Falling snow deadens her footsteps. Kneeling beside her friend, Hermione puts out a hand and pulls off the invisibility cloak, revealing Harry, who looks at her miserably. A yellow butterfly flutters above the emerging snowdrops. The Whomping Willow twists its trunk and shakes the snow from its branches. In Lupin's room, Harry nods and grasps his wand. Unlocking a trunk, Lupin releases a Dementor, and Harry collapses into blackness. Chocolate. Harry nods again. Lupin opens the trunk, and a powerful silver mist flows from Harry's wand, shielding him from the terrifying power of the threatening Dementor. With determination and willpower, he gradually forces it to retreat inside the open trunk. Laughing with delight, Lupin slams down the lid. In the quadrangle, and then at the lake, Hagrid skims a stone, skims another, and then his face crumples as he hurls a stone into the water, distraught. The school corridors are dark and deserted. In the boys' dormitory, Harry is sitting up in bed eating a biscuit and reading the Marauder's Map by the light of his wand. Ron half-wakes from a bad dream, goes back to sleep. Harry tracks Filch the caretaker's footprints around the map, then spots another name, Peter Pettigrew, and he stares in surprise. Harry goes into the corridor, where an old man in a portrait shields his eyes from Harry's brightly lit wand. Harry consults the map, and as he walks along the corridor, his own name and footprints appear on the parchment. Moving cautiously, Harry shines the lighted wand into dark, empty corners and checks the map. Peter Pettigrew's footprints move erratically across the map, and Harry watches them as they run this way and that, then appear to be heading down the corridor straight towards him. He swings round in a panic, holding up the wand. He sees his own reflection in a mirror, and more portraits object to the light as Harry taps the map and puts out his wand. Snape points his lighted wand at Harry, who opens the map. Snape touches it with his wand, and writing appears on the parchment, grabbing the map. As Harry follows Lupin, the portraits glare at Snape. In a classroom, he indicates the Marauder's Map, and Lupin stares in disbelief. A crystal ball. Hermione knocks the crystal ball onto the floor, picks up her bag, and marches out of the room as the crystal ball rolls after her down the corridor. Later, on a circular staircase, carrying the crystal ball, Harry goes back up the stairs and along the corridor. He goes back into Professor Trelawney's cluttered classroom and looks around at the overstuffed furniture and shelves of teacups.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Ron and Hermione trail the tracks in the snow until they arrive at the boundary of the woodland, and Ron lingers as Hermione strides across a clearing in the trees towards the noise of weeping. Descending snow muffles her footfalls. Kneeling beside her companion, Hermione extends a hand and removes the invisibility cloak, uncovering Harry, who gazes at her sorrowfully. A yellow butterfly flits above the emerging snowdrops. The Whomping Willow contorts its trunk and shakes the snow from its limbs. In Lupin's chamber, Harry nods and clutches his wand. Unlocking a chest, Lupin releases a Dementor, and Harry collapses into darkness. Chocolate. Harry nods again. Lupin opens the chest, and a potent silver mist emanates from Harry's wand, shielding him from the terrifying might of the menacing Dementor. With determination and resolve, he gradually compels it to withdraw inside the open chest. Laughing with joy, Lupin slams down the lid. In the courtyard, and then at the lake, Hagrid skips a stone, skips another, and then his face crumples as he throws a stone into the water, despairing. The school corridors are dim and deserted. In the boys' dormitory, Harry is sitting up in bed eating a biscuit and reading the Marauder's Map by the light of his wand. Ron half-wakes from a bad dream, goes back to sleep. Harry tracks Filch the caretaker's footprints around the map, then notices another name, Peter Pettigrew, and he stares in astonishment. Harry goes into the corridor, where an old man in a portrait shields his eyes from Harry's brightly shining wand. Harry consults the map, and as he walks along the corridor, his own name and footprints appear on the parchment. Moving cautiously, Harry illuminates the dark, empty corners with his wand and checks the map. Peter Pettigrew's footprints move erratically across the map, and Harry watches them as they run this way and that, then seem to be heading down the corridor directly towards him. He swings round in a panic, holding up the wand. He sees his own reflection in a mirror, and more portraits object to the light as Harry taps the map and extinguishes his wand. Snape points his illuminated wand at Harry, who opens the map. Snape touches it with his wand, and writing emerges on the parchment, seizing the map. As Harry follows Lupin, the portraits glare at Snape. In a classroom, he indicates the Marauder's Map, and Lupin stares in incredulity. A crystal sphere. Hermione knocks the crystal sphere onto the floor, lifts her bag, and marches out of the room as the crystal sphere rolls after her down the corridor. Later, on a circular staircase, carrying the crystal sphere, Harry ascends the stairs and along the corridor. He goes back into Professor Trelawney's cluttered classroom and looks around at the overstuffed furniture and shelves of teacups."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Ron and Hermione follow the footprints in the snow until the edge of the forest is reached by them, and as the sound of crying is walked towards by Hermione across a clearing in the trees, Ron hangs back. Her footsteps are deadened by the falling snow. Kneeling beside her friend, a hand is put out by Hermione, and the invisibility cloak is pulled off by her, revealing Harry, who miserably looks at her. Above the emerging snowdrops flutters a yellow butterfly. The trunk of the Whomping Willow is twisted, and the snow is shaken from its branches by the tree. In Lupin's room, Harry nods and grasps his wand. A Dementor is released from a trunk by Lupin, and Harry collapses into blackness. Chocolate. Again, Harry nods. Lupin opens the trunk, and from Harry's wand flows a powerful silver mist, which shields him from the terrifying power of the threatening Dementor. With determination and willpower, it is gradually forced by him to retreat inside the open trunk. With delight, Lupin slams down the lid while laughing. In the quadrangle, and then at the lake, a stone is skimmed by Hagrid, another is skimmed by him, and then as he hurls a stone into the water, his face crumples, distraught. The school corridors are dark and deserted. In the boys' dormitory, a biscuit is being eaten by Harry, who is sitting up in bed while reading the Marauder's Map by the light of his wand. Ron half-wakes from a bad dream and goes back to sleep. Filch the caretaker's footprints are tracked around the map by Harry, then another name, Peter Pettigrew, is spotted by him, and in surprise, he stares. Into the corridor, Harry goes, where an old man in a portrait shields his eyes from Harry's brightly lit wand. The map is consulted by Harry, and as the corridor is walked along by him, his own name and footprints appear on the parchment. Moving cautiously, the lighted wand is shone by Harry into dark, empty corners as the map is checked by him. Peter Pettigrew's footprints move erratically across the map, and them running this way and that is watched by Harry, then they appear to be heading down the corridor straight towards him. In a panic, he swings around, holding up the wand. In a mirror, his own reflection is seen by him, and as Harry taps the map and puts out his wand, more portraits object to the light. His lighted wand is pointed at Harry by Snape, who opens the map. It is touched with his wand by Snape, and writing appears on the parchment as he grabs the map. Lupin is followed by Harry as the portraits glare at Snape. In a classroom, the Marauder's Map is indicated by him, and in disbelief, Lupin stares. A crystal ball. The crystal ball is knocked onto the floor by Hermione, who picks up her bag and marches out of the room as the crystal ball rolls after her down the corridor. Later, on a circular staircase, the crystal ball is carried by Harry, who goes back up the stairs and along the corridor. Back into Professor Trelawney's cluttered classroom he goes and looks around at the overstuffed furniture and shelves of teacups."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Ron and Hermione follow footprints in the snow to the forest's edge. Ron stays back as Hermione crosses a clearing toward crying sounds. Snow muffles her steps. Kneeling, she removes the invisibility cloak, revealing a miserable Harry. A yellow butterfly flutters above snowdrops. The Whomping Willow shakes snow from its branches. In Lupin's room, Harry nods, grasps his wand, and Lupin releases a Dementor. Harry collapses into darkness. Chocolate. Harry nods again. Lupin opens the trunk, and silver mist from Harry's wand shields him from the Dementor, forcing it back inside. Laughing, Lupin slams the lid. At the lake, Hagrid skims stones, then throws one, distraught. The school corridors are dark. In the boys' dormitory, Harry eats a biscuit and reads the Marauder's Map by wand light. Ron half-wakes from a bad dream. Harry tracks Filch's footprints, then sees Peter Pettigrew's name and stares in surprise. In the corridor, a portrait shields his eyes from Harry's wand. Harry checks the map, and his name and footprints appear. Cautiously, he shines the wand into dark corners. Pettigrew's footprints move erratically, heading toward Harry. Panicked, he swings around, seeing his reflection. More portraits object to the light as he taps the map and extinguishes his wand. Snape points his wand at Harry, who opens the map. Snape touches it, and writing appears. Following Lupin, portraits glare at Snape. In a classroom, Lupin stares at the Marauder's Map in disbelief. Hermione knocks a crystal ball to the floor, picks up her bag, and leaves as it rolls after her. Later, on a staircase, Harry carries the crystal ball back to Professor Trelawney's cluttered classroom, looking around at the furniture and teacups."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Ron and Hermione follow footprints in the snow to the forest's edge. Ron stays back as Hermione approaches crying sounds, her steps muffled by snow. She kneels, removes the invisibility cloak, revealing a miserable Harry. A yellow butterfly flutters above snowdrops. The Whomping Willow shakes snow from its branches. In Lupin's room, Harry nods, grasps his wand. Lupin releases a Dementor; Harry collapses. Chocolate. Harry nods again. Lupin opens the trunk, and silver mist from Harry's wand repels the Dementor. Laughing, Lupin slams the lid. At the lake, Hagrid skims stones, then throws one, distraught. School corridors are dark. In the dormitory, Harry eats a biscuit, reads the Marauder's Map by wand light. Ron half-wakes, sleeps. Harry tracks Filch's footprints, spots Peter Pettigrew, surprised. In the corridor, a portrait shields his eyes from Harry's wand. Harry checks the map; his name and footprints appear. Cautiously, he shines his wand into corners. Pettigrew's footprints move erratically, heading towards Harry. Panicked, he sees his reflection, taps the map, extinguishes his wand. Snape points his wand at Harry, who opens the map. Snape touches it, writing appears. Following Lupin, portraits glare at Snape. In a classroom, Lupin stares at the Marauder's Map. Hermione knocks a crystal ball, leaves as it rolls after her. Later, Harry carries the ball up a staircase, returns to Trelawney's classroom, observing the cluttered room."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Ron and Hermione, determined to uncover the mystery, carefully follow the trail of footprints imprinted in the freshly fallen snow. Their journey leads them to the very edge of the dense forest. At this point, Ron decides to hang back, allowing Hermione to bravely walk across a clearing in the trees, drawn by the distant, haunting sound of someone crying. The gently falling snow muffles her footsteps, creating an eerie silence. Kneeling beside her distressed friend, Hermione reaches out a comforting hand and gently pulls off the invisibility cloak, revealing Harry, who looks up at her with a miserable expression. Above them, a delicate yellow butterfly flutters gracefully over the emerging snowdrops, adding a touch of color to the wintry scene. Nearby, the Whomping Willow twists its gnarled trunk and shakes the accumulated snow from its branches with a vigorous motion.\n\nIn the quiet of Lupin's room, Harry nods with determination and firmly grasps his wand. As Lupin unlocks a trunk, a Dementor emerges, and Harry collapses into a terrifying blackness. The word \"chocolate\" echoes in his mind. Harry nods once more, resolute. Lupin opens the trunk again, and a powerful, shimmering silver mist flows from Harry's wand, forming a protective barrier that shields him from the terrifying power of the menacing Dementor. With unwavering determination and sheer willpower, he gradually forces the dark creature to retreat back inside the open trunk. Laughing with delight and relief, Lupin slams down the lid with a satisfying thud.\n\nIn the quadrangle, and later by the lake, Hagrid skims a stone across the water's surface, then skims another, before his face crumples with emotion as he hurls a stone into the water, clearly distraught. The school corridors are dark and eerily deserted. In the boys' dormitory, Harry is sitting up in bed, munching on a biscuit while reading the Marauder's Map by the soft glow of his wand. Ron, half-awake from a bad dream, mumbles something incoherent before drifting back to sleep. Harry tracks the footprints of Filch, the caretaker, around the map, then suddenly spots another name, Peter Pettigrew, and stares in surprise and disbelief.\n\nHarry ventures into the dimly lit corridor, where an old man in a portrait shields his eyes from the bright light of Harry's wand. Consulting the map, Harry walks along the corridor, watching as his own name and footprints appear on the parchment. Moving cautiously, he shines the lighted wand into dark, empty corners and checks the map again. Peter Pettigrew's footprints move erratically across the map, and Harry watches them as they dart this way and that, then appear to be heading straight down the corridor towards him. In a panic, he swings around, holding up the wand defensively. He sees his own reflection in a mirror, and more portraits object to the intrusive light as Harry taps the map and extinguishes his wand.\n\nSnape appears, pointing his lighted wand at Harry, who quickly opens the map. Snape touches it with his wand, and writing magically appears on the parchment, as he grabs the map. As Harry follows Lupin, the portraits glare disapprovingly at Snape. In a classroom, Snape indicates the Marauder's Map, and Lupin stares at it in disbelief. A crystal ball sits nearby. Hermione, in a moment of frustration, knocks the crystal ball onto the floor, then picks up her bag and marches out of the room as the crystal ball rolls after her down the corridor.\n\nLater, on a circular staircase, carrying the crystal ball, Harry makes his way back up the stairs and along the corridor. He re-enters Professor Trelawney's cluttered classroom and looks around at the overstuffed furniture and shelves filled with teacups, taking in the chaotic yet familiar surroundings."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Ron and Hermione, resolute in their mission to solve the perplexing mystery before them, cautiously follow the trail of footsteps that are clearly imprinted in the fresh layer of newly fallen snow. Their meticulous journey eventually guides them to the very edge of the thick, dense forest. At this pivotal moment, Ron makes the decision to remain behind, allowing Hermione to courageously venture across a small clearing in the trees. She is drawn irresistibly by the faint yet haunting sound of someone weeping in the distance. The snowflakes gently falling from the sky serve to muffle her footsteps, creating an ambiance of eerie silence all around. As she kneels compassionately beside her distressed friend, Hermione extends a hand filled with comfort and gently removes the invisibility cloak, revealing Harry. He looks up at her with an expression of utter misery etched across his face. High above them, a delicate yellow butterfly flutters gracefully, adding a vibrant touch of color to the wintry scene as it hovers over the newly emerging snowdrops. Nearby, the Whomping Willow twists its gnarled, ancient trunk and vigorously shakes the snow that has accumulated from its snow-laden branches.\n\nIn the quiet and solitude of Lupin's room, Harry, with determination in his eyes, gives a firm nod and resolutely grasps hold of his wand. As Lupin proceeds to unlock a large trunk, a menacing Dementor emerges, causing Harry to collapse into a terrifying abyss of blackness. The word \"chocolate\" echoes persistently in his thoughts. Harry nods once more, steeling himself with resolve. When Lupin reopens the trunk, a powerful, shimmering silver mist flows forcefully from Harry's wand, forming a protective barrier that effectively shields him from the terrifying presence and power of the malevolent Dementor. With unwavering determination and through sheer force of will, he gradually succeeds in pushing the dark creature to retreat back into the depths of the open trunk. Laughing with both delight and relief, Lupin brings down the lid with a resounding, satisfying thud.\n\nIn the quadrangle, and later by the lake, Hagrid skims a stone across the water's surface, watching it ripple, then skims another. His face crumples with a visible wave of emotion as he hurls a stone into the water, clearly distraught and upset. The school corridors, usually bustling with activity, now stand dark and eerily deserted. In the boys' dormitory, Harry is sitting upright in his bed, nibbling on a biscuit while engrossed in the Marauder's Map, illuminated by the soft glow of his wand. Ron, only half-awake from a troubling dream, mumbles something that is entirely incoherent before drifting back into sleep. Harry tracks the footprints of Filch, the caretaker, as they meander around the map, and then, quite suddenly, he spots another name, Peter Pettigrew, staring in surprise and disbelief at what he's seeing.\n\nHarry ventures cautiously into the dimly lit corridor, where an old man within a portrait shields his eyes against the brightness of Harry's illuminated wand. Consulting the map with a keen eye, Harry moves along the corridor, observing as his own name and set of footprints appear right there on the parchment. Moving cautiously, he shines the light from his wand into the shadowy, empty corners, occasionally checking the map. Peter Pettigrew's footprints move chaotically across the map, and Harry watches with heightened anxiety as they dart unpredictably this way and that, then appear to be heading straight down the corridor, directly towards him. Overcome with panic, he swings around quickly, holding up the wand defensively. He catches sight of his own reflection in a mirror, while more portraits express their displeasure at the intrusive light as Harry taps the map and extinguishes his wand.\n\nSnape appears suddenly, pointing his own lighted wand directly at Harry, who reacts quickly by opening the map. As Snape touches it with his wand, writing begins to magically emerge on the parchment, just as he seizes the map. As Harry follows Lupin, the portraits around them regard Snape with disapproving glares. In a classroom, Snape draws attention to the Marauder's Map, and Lupin stares at it in utter disbelief. Nearby, a crystal ball rests quietly. In a moment of irritation, Hermione knocks the crystal ball onto the floor, then picks up her bag with a determined air and marches out of the room, the crystal ball rolling after her down the corridor as if in pursuit.\n\nLater on, ascending a circular staircase while carrying the crystal ball, Harry makes his way back up the stairs and continues along the corridor. He steps back into Professor Trelawney's cluttered classroom, taking in the familiar chaos of overstuffed furniture and shelves brimming with teacups, absorbing the chaotic yet somehow familiar surroundings."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Ron and Hermione carefully follow the distinct footprints imprinted in the snow, their eyes tracing each step until they reach the edge of the dense forest. At this point, Ron decides to hang back, allowing Hermione to continue alone as she cautiously walks across a clearing in the trees, her ears attuned to the faint sound of crying. The falling snow muffles her footsteps, creating a serene silence around her. As she reaches her destination, she kneels beside her friend, extending a hand to gently pull off the invisibility cloak, revealing Harry, who looks up at her with a miserable expression. Nearby, a yellow butterfly flutters gracefully above the emerging snowdrops, adding a touch of color to the wintry scene. Meanwhile, the Whomping Willow twists its massive trunk and shakes the accumulated snow from its branches, creating a small flurry. In Lupin's room, Harry nods in understanding and firmly grasps his wand. Lupin unlocks a trunk, releasing a Dementor, and Harry immediately collapses into a state of blackness. The mention of chocolate brings him back, and he nods once more. Lupin opens the trunk again, and this time, a powerful silver mist flows from Harry's wand, forming a protective shield against the terrifying power of the threatening Dementor. With determination and sheer willpower, Harry gradually forces the Dementor to retreat back inside the open trunk. Laughing with delight at their success, Lupin slams down the lid. In the quadrangle, and later at the lake, Hagrid skims a stone across the water, then skims another, but his face crumples with emotion as he hurls a stone into the water, clearly distraught. The school corridors are dark and deserted, creating an eerie atmosphere. In the boys' dormitory, Harry sits up in bed, munching on a biscuit while reading the Marauder's Map by the light of his wand. Ron, half-awake from a bad dream, stirs briefly before going back to sleep. Harry's eyes track Filch the caretaker's footprints around the map, then widen in surprise as he spots another name, Peter Pettigrew. Intrigued, Harry ventures into the corridor, where an old man in a portrait shields his eyes from the bright light of Harry's wand. Consulting the map, Harry walks along the corridor, watching as his own name and footprints appear on the parchment. Moving cautiously, he shines the lighted wand into dark, empty corners, checking the map for any signs of movement. Peter Pettigrew's footprints move erratically across the map, and Harry watches them intently as they dart this way and that, eventually appearing to head straight down the corridor towards him. In a panic, he swings around, holding up his wand defensively. He catches sight of his own reflection in a mirror, while more portraits object to the light, prompting Harry to tap the map and extinguish his wand. Suddenly, Snape appears, pointing his lighted wand at Harry, who quickly opens the map. Snape touches it with his wand, causing writing to appear on the parchment as he grabs the map. As Harry follows Lupin, the portraits glare disapprovingly at Snape. In a classroom, Harry indicates the Marauder's Map, and Lupin stares at it in disbelief. Meanwhile, Hermione knocks a crystal ball onto the floor, then picks up her bag and marches out of the room, the crystal ball rolling after her down the corridor. Later, on a circular staircase, Harry carries the crystal ball back up the stairs and along the corridor. He re-enters Professor Trelawney's cluttered classroom, taking a moment to look around at the overstuffed furniture and shelves filled with teacups."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Ron and Hermione trace the footprints in the snow to the forest's edge, where Ron pauses as Hermione approaches the sound of crying. She kneels, removes the invisibility cloak, and reveals a despondent Harry. Nearby, a yellow butterfly flutters above snowdrops, and the Whomping Willow shakes snow from its branches. In Lupin's room, Harry nods, grasps his wand, and Lupin releases a Dementor from a trunk. Harry collapses but recovers with chocolate, then successfully repels the Dementor with a silver mist from his wand, forcing it back into the trunk, which Lupin closes with delight. At the lake, Hagrid skims stones before throwing one in frustration. In the dark school corridors, Harry sits in bed, eating a biscuit and reading the Marauder's Map by wand light. Ron stirs from a bad dream and returns to sleep. Harry tracks Filch's footprints on the map and is surprised to see Peter Pettigrew's name. He ventures into the corridor, where a portrait shields its eyes from his wand. As he walks, his name and footprints appear on the map. Cautiously, he checks dark corners and watches Pettigrew's erratic footprints approach him. Panicked, he swings around, sees his reflection, and extinguishes his wand as portraits protest. Snape confronts Harry, who opens the map, and Snape's wand reveals writing on it. Following Lupin, Harry sees portraits glare at Snape. In a classroom, Lupin is shocked by the Marauder's Map. Hermione knocks a crystal ball to the floor, picks up her bag, and leaves as it rolls after her. Later, Harry carries the crystal ball up a staircase, returns to Professor Trelawney's classroom, and surveys the cluttered room."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Ron and Hermione, navigating through the snow using the footprints as their guide, eventually reach the edge of the Forbidden Forest, a notorious and mysterious region on the grounds of Hogwarts School known for its dangerous creatures and dark secrets. Ron hesitates, allowing Hermione to walk across a clearing in the trees toward the sound of crying. Falling snow muffles her footsteps in this serene yet foreboding place. Kneeling beside her friend, Hermione reaches out her hand and pulls off the invisibility cloak, a rare and prized magical artifact handed down through generations, revealing Harry, who looks at her miserably. A yellow butterfly flutters above the emerging snowdrops, early blooms that signal the approaching spring in the otherwise wintry landscape. The Whomping Willow, an ancient and aggressive tree planted to protect secret passages, twists its trunk and shakes the snow from its branches. \n\nIn Lupin's room, Harry nods and grasps his wand, a tool made from holly and phoenix feather core that chooses its wizard, preparing for a difficult task. Unlocking a trunk, Lupin releases a Dementor, a dark creature that feeds on human happiness, and Harry collapses into blackness, overwhelmed by despair. Chocolate, a remedy against the cold effects of Dementors due to its mood-lifting properties, is offered. Harry nods again, and Lupin opens the trunk, releasing a powerful silver mist known as a Patronus, which flows from Harry's wand, shielding him from the terrifying power of the threatening Dementor. With determination and willpower, he gradually forces it to retreat inside the open trunk. Laughing with delight, Lupin slams down the lid, having successfully taught Harry the Patronus Charm.\n\nIn the quadrangle, a central courtyard known for its tranquil atmosphere, and then at the lake, a vast body of water home to magical creatures like the giant squid, Hagrid skims a stone, skims another, and then his face crumples as he hurls a stone into the water, distraught over his friend Buckbeak's impending fate. The school corridors are dark and deserted, echoing the ancient and labyrinthine architecture of Hogwarts. In the boys' dormitory, Harry is sitting up in bed eating a biscuit, a common British snack, and reading the Marauder's Map, a magical document that reveals every person's movements within Hogwarts, by the light of his wand. Ron half-wakes from a bad dream, mumbles about spiders, then goes back to sleep. Harry tracks Filch the caretaker's footprints around the map, then spots another name, Peter Pettigrew, a supposed dead man whose betrayal led to Harry's parents' deaths, and he stares in surprise.\n\nHarry goes into the corridor, where an old man in a portrait, one of the many enchanted paintings that adorn the walls of Hogwarts, shields his eyes from Harry's brightly lit wand. Harry consults the map, and as he walks along the corridor, his own name and footprints appear on the parchment. Moving cautiously, Harry shines the lighted wand into dark, empty corners and checks the map. Peter Pettigrew's footprints move erratically across the map, and Harry watches them as they run this way and that, then appear to be heading down the corridor straight towards him. He swings round in a panic, holding up the wand. He sees his own reflection in a mirror, one of the many used by students for mundane grooming tasks, and more portraits object to the light as Harry taps the map and puts out his wand. Snape, the intimidating Potions Master known for his deep knowledge of the Dark Arts, points his lighted wand at Harry, who opens the map. Snape touches it with his wand, and writing appears on the parchment, grabbing the map. As Harry follows Lupin, the portraits glare at Snape, disapproving of his intrusion.\n\nIn a classroom, he indicates the Marauder's Map, and Lupin stares in disbelief, recognizing the clever work of his own youth. A crystal ball, used in Divination class for scrying, is knocked by Hermione, who has little patience for the subject, onto the floor. She picks up her bag and marches out of the room as the crystal ball rolls after her down the corridor. Later, on a circular staircase, part of the school's ever-shifting architecture, carrying the crystal ball, Harry goes back up the stairs and along the corridor. He goes back into Professor Trelawney's cluttered classroom, filled with the scent of incense and crammed with mystical objects, and looks around at the overstuffed furniture and shelves of teacups used for reading fortunes."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Ron and Hermione follow the footprints in the snow until they reach the edge of the forest and Ron hangs back as Hermione walks across a clearing in the trees towards the sound of crying. Falling snow deadens her footsteps. Kneeling beside her friend Hermione puts out a hand and pulls off the invisibility cloak revealing Harry who looks at her miserably. A yellow butterfly flutters above the emerging snowdrops. The Whomping Willow twists its trunk and shakes the snow from its branches. In Lupin's room Harry nods and grasps his wand. Unlocking a trunk Lupin releases a Dementor and Harry collapses into blackness. Chocolate. Harry nods again. Lupin opens the trunk and a powerful silver mist flows from Harry's wand shielding him from the terrifying power of the threatening Dementor. With determination and willpower he gradually forces it to retreat inside the open trunk. Laughing with delight Lupin slams down the lid. In the quadrangle and then at the lake Hagrid skims a stone skims another and then his face crumples as he hurls a stone into the water distraught. The school corridors are dark and deserted. In the boys' dormitory Harry is sitting up in bed eating a biscuit and reading the Marauder's Map by the light of his wand. Ron halfwakes from a bad dream goes back to sleep. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Harry tracks Filch the caretaker's footprints around the map then spots another name Peter Pettigrew and he stares in surprise. Harry goes into the corridor where an old man in a portrait shields his eyes from Harry's brightly lit wand. Harry consults the map and as he walks along the corridor his own name and footprints appear on the parchment. Moving cautiously Harry shines the lighted wand into dark empty corners and checks the map. Peter Pettigrew's footprints move erratically across the map and Harry watches them as they run this way and that then appear to be heading down the corridor straight towards him. He swings round in a panic holding up the wand. He sees his own reflection in a mirror and more portraits object to the light as Harry taps the map and puts out his wand. Snape points his lighted wand at Harry who opens the map. Snape touches it with his wand and writing appears on the parchment grabbing the map. As Harry follows Lupin the portraits glare at Snape. In a classroom he indicates the Marauder's Map and Lupin stares in disbelief. A crystal ball. Hermione knocks the crystal ball onto the floor picks up her bag and marches out of the room as the crystal ball rolls after her down the corridor. Later on a circular staircase carrying the crystal ball. Harry goes back up the stairs and along the corridor. He goes back into Professor Trelawney's cluttered classroom and looks around at the overstuffed furniture and shelves of teacups."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Ron and Hermione follow the footprints in the snow until they reach the edge of the forest and Ron hangs back as Hermione walks across a clearing in the trees towards the sound of crying. Falling snow deadens her footsteps. Kneeling beside her friend Hermione puts out a hand and pulls off the invisibility cloak revealing Harry who looks at her miserably. A yellow butterfly flutters above the emerging snowdrops. The Whomping Willow twists its trunk and shakes the snow from its branches. In Lupin's room Harry nods and grasps his wand. Unlocking a trunk Lupin releases a Dementor and Harry collapses into blackness. Chocolate. Harry nods again. Lupin opens the trunk and a powerful silver mist flows from Harry's wand shielding him from the terrifying power of the threatening Dementor. With determination and willpower he gradually forces it to retreat inside the open trunk. Laughing with delight Lupin slams down the lid. In the quadrangle and then at the lake Hagrid skims a stone skims another and then his face crumples as he hurls a stone into the water distraught. The school corridors are dark and deserted. In the boys' dormitory Harry is sitting up in bed eating a biscuit and reading the Marauder's Map by the light of his wand. Ron halfwakes from a bad dream goes back to sleep. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Harry tracks Filch the caretaker's footprints around the map then spots another name Peter Pettigrew and he stares in surprise. Harry goes into the corridor where an old man in a portrait shields his eyes from Harry's brightly lit wand. Harry consults the map and as he walks along the corridor his own name and footprints appear on the parchment. Moving cautiously Harry shines the lighted wand into dark empty corners and checks the map. Peter Pettigrew's footprints move erratically across the map and Harry watches them as they run this way and that then appear to be heading down the corridor straight towards him. He swings round in a panic holding up the wand. He sees his own reflection in a mirror and more portraits object to the light as Harry taps the map and puts out his wand. Snape points his lighted wand at Harry who opens the map. Snape touches it with his wand and writing appears on the parchment grabbing the map. As Harry follows Lupin the portraits glare at Snape. In a classroom he indicates the Marauder's Map and Lupin stares in disbelief. A crystal ball. Hermione knocks the crystal ball onto the floor picks up her bag and marches out of the room as the crystal ball rolls after her down the corridor. Later on a circular staircase carrying the crystal ball. Harry goes back up the stairs and along the corridor. He goes back into Professor Trelawney's cluttered classroom and looks around at the overstuffed furniture and shelves of teacups."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Ron and Hermione follow the footprints in the snow until they reach the edge of the forest and Ron hangs back as Hermione walks across a clearing in the trees towards the sound of crying. Falling snow deadens her footsteps. Kneeling beside her friend Hermione puts out a hand and pulls off the invisibility cloak revealing Harry who looks at her miserably. A yellow butterfly flutters above the emerging snowdrops. The Whomping Willow twists its trunk and shakes the snow from its branches. In Lupin's room Harry nods and grasps his wand. Unlocking a trunk Lupin releases a Dementor and Harry collapses into blackness. Chocolate. Snape touches it with his wand and writing appears on the parchment grabbing the map. As Harry follows Lupin the portraits glare at Snape. In a classroom he indicates the Marauder's Map and Lupin stares in disbelief. A crystal ball. Hermione knocks the crystal ball onto the floor picks up her bag and marches out of the room as the crystal ball rolls after her down the corridor. Later on a circular staircase carrying the crystal ball. Harry goes back up the stairs and along the corridor. He goes back into Professor Trelawney's cluttered classroom and looks around at the overstuffed furniture and shelves of teacups."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Ron and Hermione follow the footprints in the snow until they reach the edge of the forest and Ron hangs back as Hermione walks across a clearing in the trees towards the sound of crying. Falling snow deadens her footsteps. Kneeling beside her friend Hermione puts out a hand and pulls off the invisibility cloak revealing Harry who looks at her miserably. A yellow butterfly flutters above the emerging snowdrops. Later on a circular staircase carrying the crystal ball. Harry goes back up the stairs and along the corridor. He goes back into Professor Trelawney's cluttered classroom and looks around at the overstuffed furniture and shelves of teacups."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Dexter and Clarissa trace the tire tracks in the mud until they reach the edge of the canyon, and Dexter lingers back as Clarissa dances across a meadow towards the sound of laughter. Drifting mist silences her tiptoeing. Stooping beside her companion, Clarissa extends a foot and kicks off the magical scarf, unveiling Arthur, who gazes at her wistfully. A blue dragonfly flutters above the emerging lilies. The Whispering Oak bends its limbs and scatters the mud from its leaves. In Franklin's lounge, Arthur bows and grabs his flute. Cracking open a suitcase, Franklin unleashes a Banshee, and Arthur crashes into silence. Marshmallow. Arthur bows again. Franklin shuts the suitcase, and a dazzling golden fog streams from Arthur’s flute, protecting him from the sinister force of the looming Banshee. With grit and fortitude, he steadily compels it to retreat into the closed suitcase. Chuckling with joy, Franklin snaps shut the cover. In the plaza, and then by the pond, Gerald skips a pebble, skips another, and then his face falls as he tosses a pebble into the water, desolate. The castle hallways are dim and empty. In the youngsters' chamber, Arthur is lounging in a hammock munching on a pretzel and studying the Voyager's Journal by the glow of his lantern. Dexter half-wakes from a bizarre thought, returns to dreamland. Arthur follows Nelson the janitor’s bike tracks around the journal, then discovers another alias, David Danforth, and he gapes in awe. Arthur steps into the hallway, where an elderly woman in a picture shields her ears from Arthur’s brightly glowing lantern. Arthur reviews the journal, and as he strides along the hallway, his own alias and footsteps surface on the manuscript. Moving warily, Arthur beams the glowing lantern into dim, vacant alcoves and consults the journal. David Danforth’s tracks zigzag erratically across the journal, and Arthur observes them as they dart this way and that, then seem to be heading up the hallway straight towards him. He whirls around in alarm, holding up the lantern. He glimpses his own image in a window, and more pictures disapprove of the brightness as Arthur taps the journal and extinguishes his lantern. Theodore aims his glowing lantern at Arthur, who opens the journal. Theodore taps it with his lantern, and etching emerges on the manuscript, snatching the journal. As Arthur shadows Franklin, the pictures glower at Theodore. In a lecture hall, he gestures to the Voyager’s Journal, and Franklin gawks in astonishment. A diamond orb. Clarissa bumps the diamond orb onto the ground, gathers her satchel, and strides out of the hall as the diamond orb trails after her down the hallway. Later, on a spiraling escalator, clutching the diamond orb, Arthur ascends the escalator and along the hallway. He returns into Professor Eldridge’s cluttered studio and scans the overstuffed futons and stacks of goblets."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Ron and Hermione follow footprints in the snow to a forest's edge. Hermione approaches the sound of crying and finds Harry, hidden under an invisibility cloak. In Lupin's room, Harry battles a Dementor with his wand and successfully forces it back into a trunk with Lupin's help. At the lake, Hagrid, distraught, skims stones. In the boys' dormitory, Harry, reading the Marauder's Map, spots Peter Pettigrew's name and is surprised. Exploring the corridors, Harry follows Pettigrew's erratic footprints on the map, which seem to head towards him. Panicking, he checks his surroundings only to encounter Snape, who examines the map. Harry and Lupin discuss the map, shocking Lupin. Meanwhile, Hermione knocks over a crystal ball, exits a classroom, and it rolls after her. Later, Harry returns to the classroom, navigating through Trelawney's clutter."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He goes back into Professor Trelawney's cluttered classroom and looks around at the overstuffed furniture and shelves of teacups Harry goes back up the stairs and along the corridor  Later on a circular staircase carrying the crystal ball  Hermione knocks the crystal ball onto the floor picks up her bag and marches out of the room as the crystal ball rolls after her down the corridor  A crystal ball  In a classroom he indicates the Marauder's Map and Lupin stares in disbelief  As Harry follows Lupin the portraits glare at Snape  Snape touches it with his wand and writing appears on the parchment grabbing the map  Snape points his lighted wand at Harry who opens the map  He sees his own reflection in a mirror and more portraits object to the light as Harry taps the map and puts out his wand  He swings round in a panic holding up the wand  Peter Pettigrew's footprints move erratically across the map and Harry watches them as they run this way and that then appear to be heading down the corridor straight towards him  Moving cautiously Harry shines the lighted wand into dark empty corners and checks the map  Harry consults the map and as he walks along the corridor his own name and footprints appear on the parchment  Harry goes into the corridor where an old man in a portrait shields his eyes from Harry's brightly lit wand  Harry tracks Filch the caretaker's footprints around the map then spots another name Peter Pettigrew and he stares in surprise  Ron halfwakes from a bad dream goes back to sleep  In the boys' dormitory Harry is sitting up in bed eating a biscuit and reading the Marauder's Map by the light of his wand  The school corridors are dark and deserted  In the quadrangle and then at the lake Hagrid skims a stone skims another and then his face crumples as he hurls a stone into the water distraught  Laughing with delight Lupin slams down the lid  With determination and willpower he gradually forces it to retreat inside the open trunk  Lupin opens the trunk and a powerful silver mist flows from Harry's wand shielding him from the terrifying power of the threatening Dementor  Harry nods again  Chocolate  Unlocking a trunk Lupin releases a Dementor and Harry collapses into blackness  In Lupin's room Harry nods and grasps his wand  The Whomping Willow twists its trunk and shakes the snow from its branches  A yellow butterfly flutters above the emerging snowdrops  Kneeling beside her friend Hermione puts out a hand and pulls off the invisibility cloak revealing Harry who looks at her miserably  Falling snow deadens her footsteps  Ron and Hermione follow the footprints in the snow until they reach the edge of the forest and Ron hangs back as Hermione walks across a clearing in the trees towards the sound of crying "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Falling snow deadens her footsteps Ron and Hermione follow the footprints in the snow until they reach the edge of the forest and Ron hangs back as Hermione walks across a clearing in the trees towards the sound of crying A yellow butterfly flutters above the emerging snowdrops Kneeling beside her friend Hermione puts out a hand and pulls off the invisibility cloak revealing Harry who looks at her miserably In Lupin's room Harry nods and grasps his wand The Whomping Willow twists its trunk and shakes the snow from its branches Chocolate Unlocking a trunk Lupin releases a Dementor and Harry collapses into blackness Lupin opens the trunk and a powerful silver mist flows from Harry's wand shielding him from the terrifying power of the threatening Dementor Harry nods again Laughing with delight Lupin slams down the lid With determination and willpower he gradually forces it to retreat inside the open trunk The school corridors are dark and deserted In the quadrangle and then at the lake Hagrid skims a stone skims another and then his face crumples as he hurls a stone into the water distraught Ron halfwakes from a bad dream goes back to sleep In the boys' dormitory Harry is sitting up in bed eating a biscuit and reading the Marauder's Map by the light of his wand Harry goes into the corridor where an old man in a portrait shields his eyes from Harry's brightly lit wand Harry tracks Filch the caretaker's footprints around the map then spots another name Peter Pettigrew and he stares in surprise Moving cautiously Harry shines the lighted wand into dark empty corners and checks the map Harry consults the map and as he walks along the corridor his own name and footprints appear on the parchment He swings round in a panic holding up the wand Peter Pettigrew's footprints move erratically across the map and Harry watches them as they run this way and that then appear to be heading down the corridor straight towards him Snape points his lighted wand at Harry who opens the map He sees his own reflection in a mirror and more portraits object to the light as Harry taps the map and puts out his wand As Harry follows Lupin the portraits glare at Snape Snape touches it with his wand and writing appears on the parchment grabbing the map A crystal ball In a classroom he indicates the Marauder's Map and Lupin stares in disbelief Later on a circular staircase carrying the crystal ball Hermione knocks the crystal ball onto the floor picks up her bag and marches out of the room as the crystal ball rolls after her down the corridor He goes back into Professor Trelawney's cluttered classroom and looks around at the overstuffed furniture and shelves of teacups Harry goes back up the stairs and along the corridor"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Harry tracks Filch the caretaker's footprints around the map then spots another name Peter Pettigrew and he stares in surprise  Harry goes into the corridor where an old man in a portrait shields his eyes from Harry's brightly lit wand  Harry consults the map and as he walks along the corridor his own name and footprints appear on the parchment  Moving cautiously Harry shines the lighted wand into dark empty corners and checks the map  Peter Pettigrew's footprints move erratically across the map and Harry watches them as they run this way and that then appear to be heading down the corridor straight towards him  He swings round in a panic holding up the wand  He sees his own reflection in a mirror and more portraits object to the light as Harry taps the map and puts out his wand  Snape points his lighted wand at Harry who opens the map  Snape touches it with his wand and writing appears on the parchment grabbing the map  As Harry follows Lupin the portraits glare at Snape  In a classroom he indicates the Marauder's Map and Lupin stares in disbelief  A crystal ball  Hermione knocks the crystal ball onto the floor picks up her bag and marches out of the room as the crystal ball rolls after her down the corridor  Later on a circular staircase carrying the crystal ball  Harry goes back up the stairs and along the corridor  He goes back into Professor Trelawney's cluttered classroom and looks around at the overstuffed furniture and shelves of teacups Ron and Hermione follow the footprints in the snow until they reach the edge of the forest and Ron hangs back as Hermione walks across a clearing in the trees towards the sound of crying  Falling snow deadens her footsteps  Kneeling beside her friend Hermione puts out a hand and pulls off the invisibility cloak revealing Harry who looks at her miserably  A yellow butterfly flutters above the emerging snowdrops  The Whomping Willow twists its trunk and shakes the snow from its branches  In Lupin's room Harry nods and grasps his wand  Unlocking a trunk Lupin releases a Dementor and Harry collapses into blackness  Chocolate  Harry nods again  Lupin opens the trunk and a powerful silver mist flows from Harry's wand shielding him from the terrifying power of the threatening Dementor  With determination and willpower he gradually forces it to retreat inside the open trunk  Laughing with delight Lupin slams down the lid  In the quadrangle and then at the lake Hagrid skims a stone skims another and then his face crumples as he hurls a stone into the water distraught  The school corridors are dark and deserted  In the boys' dormitory Harry is sitting up in bed eating a biscuit and reading the Marauder's Map by the light of his wand  Ron halfwakes from a bad dream goes back to sleep "
        }
      ]
    }
  ]
}