{
  "ground_truth": "Harry sees something swirling around inside the crystal ball, and as he moves closer and peers into the mist, he sees the face of Sirius Black. A hand claps him on the shoulder, and bemused, Professor Trelawney gazes at Harry. With a worried look on his face, he runs out of the room and hurries away down the circular staircase. Outside, in a ruined part of the castle, crows alight on the fallen masonry. Hermione, Harry, and Ron peer through a ruined archway at a man wearing a black hood, sharpening the curved blade of a huge axe. They leave the school, walk through the cloister and into the grounds, where Malfoy and his cronies are on the slope above Hagrid's cottage. Furious, Hermione threatens Malfoy, her wand at his throat, and he's terrified. As she turns away, Malfoy smirks, but she turns back and punches him full in the face. Malfoy and his cronies make a run for it, and she smiles at Ron. Ron, Harry, and Hermione run down the steep steps cut into the grassy slope towards Hagrid's cottage, finding him gazing sadly out of the window at Buckbeak, who is chained to a post in the pumpkin patch. A line of dead ferrets is hanging nearby, and he feeds a small creature, opens a small blue tin, and takes out Ron's rat. Another pebble hits Harry, and they look out of the window to see Fudge, Dumbledore, and the Executioner making their way towards the cottage. Hagrid ushers them out, and they peer out of the back door as, at the front door, Hagrid welcomes his guests. Harry, Ron, and Hermione escape from the cottage and run down the garden path, hiding behind a huge pile of giant orange pumpkins. A crow lands beside them as they anxiously watch the cottage. Hermione spins around and peers into the forest, and they run as fast as they can away from the cottage and up the grassy slope. Buckbeak watches them go, and Harry glances back at the hippogriff still chained to a post in the pumpkin patch, then follows his friends. Halfway up the hill, they stop and look back towards the cottage, seeing smoke rising from the stone chimney. Dumbledore, Fudge, and Hagrid come out of the cottage with the Executioner, who walks across the garden carrying his sharp axe over his shoulder. He moves through the pumpkin patch towards Buckbeak, and they watch horrified as the Executioner raises his axe and the huge blade swings down. Hermione hides her face on Ron's shoulder, putting her arms around his neck. Suddenly, Ron drops his rat, blood on his finger, and chases the rat, with Harry and Hermione following him. Ron catches Scabbers and slumps down near the Whomping Willow with its twisted trunk.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Harry observes something spinning around inside the glass orb, and as he approaches nearer and peers into the fog, he perceives the visage of Sirius Black. A hand grips him on the shoulder, and perplexed, Professor Trelawney stares at Harry. With a troubled expression on his face, he dashes out of the chamber and rushes away down the circular stairway. Outside, in a ruined section of the fortress, ravens settle on the collapsed stonework. Hermione, Harry, and Ron gaze through a ruined archway at a man wearing a black hood, honing the curved edge of a massive axe. They depart the academy, stroll through the cloister and into the grounds, where Malfoy and his accomplices are on the incline above Hagrid's cabin. Enraged, Hermione menaces Malfoy, her wand at his neck, and he's frightened. As she turns away, Malfoy sneers, but she turns back and strikes him squarely in the face. Malfoy and his accomplices take flight, and she grins at Ron. Ron, Harry, and Hermione dash down the steep steps carved into the grassy incline towards Hagrid's cabin, finding him looking sorrowfully out of the window at Buckbeak, who is tethered to a stake in the squash patch. A line of dead weasels is hanging nearby, and he feeds a small animal, opens a small blue canister, and takes out Ron's rodent. Another stone strikes Harry, and they look out of the window to see Fudge, Dumbledore, and the Executioner making their way towards the cabin. Hagrid ushers them out, and they peer out of the rear door as, at the front door, Hagrid greets his visitors. Harry, Ron, and Hermione escape from the cabin and dash down the garden path, concealing themselves behind a huge pile of giant orange squashes. A raven lands beside them as they nervously watch the cabin. Hermione spins around and peers into the woodland, and they sprint as quickly as they can away from the cabin and up the grassy incline. Buckbeak watches them depart, and Harry glimpses back at the hippogriff still tethered to a stake in the squash patch, then follows his companions. Midway up the hill, they stop and look back towards the cabin, seeing smoke rising from the stone chimney. Dumbledore, Fudge, and Hagrid exit the cabin with the Executioner, who strides across the garden carrying his sharp axe over his shoulder. He moves through the squash patch towards Buckbeak, and they watch aghast as the Executioner lifts his axe and the massive edge swings down. Hermione shields her face on Ron's shoulder, wrapping her arms around his neck. Abruptly, Ron drops his rodent, blood on his finger, and pursues the rodent, with Harry and Hermione trailing him. Ron catches Scabbers and slumps down near the Whomping Willow with its gnarled trunk."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Something swirling around inside the crystal ball is seen by Harry, and as he moves closer and peers into the mist, the face of Sirius Black is seen by him. A hand is clapped on his shoulder, and bemused, Harry is gazed at by Professor Trelawney. With a worried look on his face, the room is run out of by him, and he hurries away down the circular staircase. Outside, in a ruined part of the castle, the fallen masonry is alighted on by crows. Hermione, Harry, and Ron peer through a ruined archway at a man who wears a black hood and sharpens the curved blade of a huge axe. The school is left, and they walk through the cloister and into the grounds, where Malfoy and his cronies stand on the slope above Hagrid's cottage. Furious, Malfoy is threatened by Hermione, her wand at his throat, and terror fills him. As she turns away, Malfoy smirks, but turning back, she punches him full in the face. Malfoy and his cronies run for it, and Ron is smiled at by her. Down the steep steps cut into the grassy slope, Ron, Harry, and Hermione run towards Hagrid’s cottage, finding him gazing sadly out of the window at Buckbeak, who is chained to a post in the pumpkin patch. A line of dead ferrets is seen hanging nearby, and he feeds a small creature, opens a small blue tin, and Ron's rat is taken out by him. Another pebble hits Harry, and out of the window, they look to see Fudge, Dumbledore, and the Executioner make their way towards the cottage. Hagrid ushers them out, and out of the back door, they peer as, at the front door, his guests are welcomed by Hagrid. The cottage is escaped from by Harry, Ron, and Hermione, and down the garden path, they run, hiding behind a huge pile of giant orange pumpkins. A crow lands beside them as the cottage is anxiously watched by them. Hermione spins around and peers into the forest, and the cottage is run away from by them as fast as they can and up the grassy slope. Buckbeak watches them go, and the hippogriff still chained to a post in the pumpkin patch is glanced back at by Harry, then he follows his friends. Halfway up the hill, the cottage is looked back towards, smoke rising from the stone chimney is seen by them. The cottage is exited by Dumbledore, Fudge, and Hagrid with the Executioner, who carries his sharp axe over his shoulder across the garden. Through the pumpkin patch, he moves towards Buckbeak, and with horror, they watch as the Executioner raises his axe and the huge blade swings down. Her face is hidden on Ron’s shoulder by Hermione, and his neck is encircled by her arms. Suddenly, the rat is dropped by Ron, blood on his finger, and it is chased by him, with Harry and Hermione following. Scabbers is caught by Ron, and near the Whomping Willow with its twisted trunk, he slumps down."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Harry sees something swirling in the crystal ball and, moving closer, he identifies Sirius Black's face. Professor Trelawney, bemused, claps his shoulder. Worried, Harry runs out and down the circular staircase. Outside, in a ruined castle section, crows perch on fallen masonry. Hermione, Harry, and Ron peer through an archway at a hooded man sharpening an axe. They leave school, cross the cloister, and spot Malfoy above Hagrid's cottage. Furious, Hermione threatens him with her wand, punches him, and he flees. Ron, Harry, and Hermione descend to Hagrid’s cottage, where he gazes at Buckbeak chained in the pumpkin patch. Nearby hang dead ferrets. Hagrid feeds a creature and finds Ron's rat in a blue tin. A pebble hits Harry, and outside, they see Fudge, Dumbledore, and the Executioner heading towards them. Hagrid ushers them out a back door. Hiding behind pumpkins, they watch the cottage. As the Executioner approaches Buckbeak, Harry and friends run away. Buckbeak watches them leave. Halfway up a hill, they see smoke from the chimney and the Executioner raise his axe. Horrified, Hermione hides her face on Ron’s shoulder. Ron’s rat bites him, and he chases it near the Whomping Willow."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Harry sees Sirius Black's face in the swirling mist of the crystal ball. Professor Trelawney taps Harry's shoulder, bemused, and he, worried, quickly exits down the circular staircase. Outside, crows settle on ruined masonry near a man sharpening an axe. Hermione, Harry, and Ron leave school grounds, encountering Malfoy above Hagrid's cottage. Hermione, furious, threatens him with her wand, then punches him when he smirks. Malfoy flees, and they proceed to Hagrid's, where he gazes sadly at Buckbeak, chained in the pumpkin patch. Hagrid feeds a creature, retrieving Ron's rat from a blue tin. As Fudge, Dumbledore, and the Executioner approach, Hagrid ushers them out. They hide by pumpkins, watching the cottage. Hermione glances into the forest, prompting them to flee as the Executioner raises his axe over Buckbeak. Hermione clutches Ron's shoulder, hiding her face. Ron suddenly drops his rat, chasing it with Harry and Hermione to the Whomping Willow."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Harry sees something swirling around inside the crystal ball, and as he moves in closer, straining his eyes to peer deeply into the enigmatic mist, he catches sight of the familiar face of Sirius Black. Suddenly, a hand claps him gently on the shoulder, and as he turns, he finds himself under the bemused gaze of Professor Trelawney. With a worried look etched on his face, he hastily runs out of the room, his footsteps echoing as he hurries away down the winding circular staircase. Outside, in a dilapidated section of the ancient castle, crows land gracefully on the fallen and weathered masonry. Hermione, Harry, and Ron take a cautious look through a ruined archway to see a figure cloaked in a black hood, methodically sharpening the curved blade of a formidable and huge axe. They decide to leave the school, walking purposefully through the cloister and onto the grounds. There, they catch sight of Malfoy and his cronies loitering on the slope above Hagrid's rustic cottage. Filled with fury, Hermione confronts Malfoy, thrusting her wand threateningly at his throat, leaving him visibly terrified. As she turns away with a sense of triumph, Malfoy dares to smirk, but she swiftly turns back and, with determination, punches him squarely in the face. Startled, Malfoy and his cronies hastily retreat, running away, while Hermione smiles with satisfaction at Ron. Together, Ron, Harry, and Hermione quickly descend the steep steps cut into the lush, grassy slope towards Hagrid's cottage, where they find him gazing with a sad expression out of the window at Buckbeak, now chained wearily to a post in the pumpkin patch. Nearby, a line of dead ferrets is hanging ominously, and Hagrid busies himself by feeding a small creature, then opens a small blue tin to take out Ron's wayward rat. Another pebble strikes Harry, catching his attention, and they all look out the window to see Fudge, Dumbledore, and the Executioner steadily making their way towards Hagrid’s abode. Quickly, Hagrid ushers them out discreetly through the back door as, at the front door, he warmly welcomes his guests. Taking advantage of the distraction, Harry, Ron, and Hermione make a swift escape from the cottage, dashing down the garden path, and hide behind a towering pile of giant orange pumpkins. A crow lands beside them, its presence adding to their anxiety as they nervously watch the cottage. Hermione spins around, alert, and peers cautiously into the forest before they all run as fast as they can away from the cottage, racing up the grassy slope. Buckbeak watches with interest as they go, and Harry, casting a swift glance back, notices the majestic hippogriff still chained forlornly to the post in the pumpkin patch, then turns to follow his friends. Halfway up the hill, they stop to catch their breath and look back towards the cottage, where thin wisps of smoke are rising from the stone chimney. Dumbledore, Fudge, and Hagrid emerge from the cottage with the Executioner, who strides across the garden, carrying his gleaming, sharp axe slung over his shoulder. He moves purposefully through the pumpkin patch towards Buckbeak, and they watch in horror as the Executioner raises his axe, and the massive blade swings down ominously. Overcome, Hermione hides her face on Ron's shoulder, wrapping her arms tightly around his neck. Suddenly, in a flurry of movement, Ron drops his rat as blood appears on his finger, and he chases after the elusive creature, with Harry and Hermione following hastily behind him. Ron manages to catch Scabbers and slumps down, exhausted, near the Whomping Willow, with its twisted, formidable trunk looming over them."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Harry observes something swirling mysteriously within the depths of the crystal ball, and as his curiosity propels him to inch closer, he strains his eyes to delve deeply into the enigmatic mist. Within it, he discerns the familiar and striking visage of Sirius Black. Suddenly, a hand descends softly yet unexpectedly upon his shoulder, and as he turns around, he finds himself gazing into the bemused expression of Professor Trelawney. With a sense of urgency etched on his worried face, he quickly dashes out of the room, his footsteps echoing ominously as he hurries down the winding, circular staircase. Outside, in a decrepit section of the ancient and storied castle, crows descend gracefully onto the crumbling and weather-worn masonry. Hermione, Harry, and Ron cautiously peer through a ruined archway to behold a figure enveloped in a black hood, methodically sharpening the imposing, curved blade of a formidable, enormous axe. They resolve to leave the school, striding purposefully through the cloister and onto the expansive grounds. There, they spot Malfoy and his cronies lingering idly on the slope above Hagrid's quaint, rustic cottage. Overcome with fury, Hermione confronts Malfoy, brandishing her wand threateningly at his throat, leaving him visibly terrified. As she turns away, exuding a sense of triumph, Malfoy dares to smirk, but she quickly spins back around and, with determined resolve, punches him squarely in the face. Startled and taken aback, Malfoy and his cronies swiftly retreat, running away in haste, while Hermione looks on with satisfaction, sharing a knowing smile with Ron. Together, Ron, Harry, and Hermione make their way rapidly down the steep steps carved into the lush, verdant grassy slope towards Hagrid's cottage, where they find him gazing out of the window with a sorrowful expression, looking at Buckbeak, now resignedly chained to a post in the pumpkin patch. Nearby, a string of dead ferrets dangles ominously, and Hagrid busies himself by feeding a small creature, then opens a small blue tin to retrieve Ron's elusive, wayward rat. Another pebble strikes Harry, drawing his attention, and they all peer out the window to see Fudge, Dumbledore, and the Executioner making their steady approach towards Hagrid’s humble abode. In haste, Hagrid discreetly ushers them out through the back door while, at the front, he warmly greets his guests. Taking advantage of this distraction, Harry, Ron, and Hermione make a rapid and stealthy escape from the cottage, sprinting down the garden path and hiding behind a towering mound of gigantic orange pumpkins. A crow alights beside them, its presence amplifying their anxiety as they nervously keep watch on the cottage. Hermione spins around, alert and vigilant, peering cautiously into the depths of the forest before they all take off, running as swiftly as possible away from the cottage, racing up the grassy slope. Buckbeak watches them go with interest, and Harry, casting a quick glance back, notices the majestic hippogriff still chained forlornly to the post in the pumpkin patch, then turns to follow his friends. Halfway up the hill, they pause to catch their breath, looking back towards the cottage, where thin wisps of smoke curl up from the stone chimney. Dumbledore, Fudge, and Hagrid emerge from the cottage alongside the Executioner, who strides purposefully across the garden, his gleaming, sharp axe slung ominously over his shoulder. He makes his determined way through the pumpkin patch towards Buckbeak, and they watch in horror as the Executioner raises his axe, the massive blade swinging down with ominous intent. Overcome with emotion, Hermione buries her face against Ron's shoulder, wrapping her arms tightly around his neck for comfort. Suddenly, in a dramatic flurry of movement, Ron drops his rat as blood appears on his finger, compelling him to chase after the elusive creature, with Harry and Hermione following closely and hastily behind him. Ron manages to capture Scabbers, then slumps down, utterly exhausted, near the Whomping Willow, with its twisted, formidable trunk looming menacingly over them."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As Harry stands before the crystal ball, he notices something swirling inside its depths and starts to feel an inexplicable pull. Compelled by this mysterious activity, he moves closer, his steps deliberate and filled with anticipation. Peering intently into the misty sphere, his eyes focus on the emerging visage that becomes clear—it is the face of Sirius Black, staring back at him. Just as the recognition sets in, a hand lands suddenly on his shoulder, causing him to flinch slightly. Turning to his side, he is met with the bemused gaze of Professor Trelawney, who looks at him with an unreadable expression. Feeling a wave of worry wash over him, Harry's face reflects his concern, and with urgency, he bolts from the room. His feet carry him swiftly down the circular staircase, each step echoing with haste. Once outside, he emerges into a ruined section of the castle. Here, amidst the fallen masonry, crows descend and settle, their presence adding to the air of desolation. Meanwhile, Hermione, Harry, and Ron find themselves peering through a ruined archway. Their eyes fix on a man clad in a black hood, engrossed in sharpening the intimidating, curved blade of a massive axe. After witnessing this unsettling scene, they depart from the school premises, traversing through the cloister and stepping onto the expansive grounds. It is here that they encounter Malfoy and his cronies positioned on the slope above Hagrid's cottage. Fired up with anger, Hermione confronts Malfoy, her wand poised threateningly at his throat, making his bravado crumble into terror. As she turns to leave, Malfoy allows a smirk to curl on his lips, but Hermione's quick moment of reconsideration leads her to spin back and deliver a solid punch to his face. Malfoy and his companions, defeated and shocked, flee the scene, and Hermione turns to Ron with a smile of satisfaction. United, Ron, Harry, and Hermione race down the steep steps carved into the grassy incline, their destination Hagrid's cottage, where they find Hagrid standing, his attention fixed wistfully out of the window at Buckbeak, who stands tethered to a post in the pumpkin patch. Nearby, a line of dead ferrets hangs ominously, a testament to the grimness of the moment. Hagrid busies himself with feeding a small creature, and from a small blue tin, he retrieves Ron's rat. Abruptly, a pebble strikes Harry, diverting his attention to the window, where they see Fudge, Dumbledore, and the Executioner advancing towards the cottage with purpose. Hagrid, sensing the urgency, ushers them out quickly, and they hasten to the back door, where they peer out cautiously as Hagrid steps forward to greet his guests at the front door. Seizing the opportunity, Harry, Ron, and Hermione make their escape from the cottage. They sprint down the garden path and take cover behind an imposing pile of giant orange pumpkins. As they anxiously keep watch on the cottage, a crow lands beside them, adding to their tension. Suddenly, Hermione spins around, scrutinizing the forest for any signs of danger, and deciding not to linger, they dash away from the cottage, sprinting up the grassy slope. The ever-watchful Buckbeak looks on as they leave, while Harry takes a moment to glance back, seeing the majestic hippogriff still chained, before resuming his run to catch up with his friends. Halfway up the hill, they pause, their breath heavy, and turn their gaze back towards the cottage to witness smoke billowing gently from the stone chimney. From the doorway, Dumbledore, Fudge, and Hagrid emerge, accompanied by the Executioner, who strides purposefully across the garden, his sharp axe hefted over his shoulder. Approaching the pumpkin patch where Buckbeak is bound, they watch in horror as the Executioner raises his axe, the massive blade poised to fall. Overcome with emotion, Hermione buries her face into Ron's shoulder, closing her eyes tightly as she wraps her arms around his neck for comfort. Suddenly, Ron's grip on his rat falters, and he feels the sting of blood on his finger. Reacting instinctively, he darts after the escaping rat, with Harry and Hermione quickly following his lead. Determined, Ron manages to catch Scabbers, and with relief, he collapses on the ground near the imposing Whomping Willow, its twisted trunk offering a momentary shelter."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Harry sees something swirling inside the crystal ball and moves closer to discover the face of Sirius Black in the mist. Suddenly, Professor Trelawney clasps his shoulder, prompting Harry, with a worried expression, to leave the room hastily and descend the circular staircase. Outside, amidst the castle ruins where crows settle on fallen masonry, Harry, Hermione, and Ron look through an archway to observe a hooded man sharpening a large axe. They proceed through the cloister to the school grounds, encountering Malfoy and his friends above Hagrid's cottage. Furious, Hermione confronts Malfoy with her wand at his throat, making him retreat in fear. As Malfoy mocks her, Hermione punches him, causing him and his cronies to flee. Smiling at Ron, she joins him and Harry as they rush down to Hagrid's cottage, where Hagrid stares sadly at Buckbeak chained in the pumpkin patch. Nearby, Hagrid feeds a small creature and retrieves Ron's rat from a tin. When another pebble hits the window, they see Fudge, Dumbledore, and the Executioner approaching, prompting Hagrid to usher them out through the back door. They hide behind large pumpkins, watching as Hagrid greets his guests at the front. Harry, Ron, and Hermione then dash through the garden, past Buckbeak, and up the grassy slope. Midway, they pause to see smoke rising from the cottage chimney as Dumbledore and the others emerge, with the Executioner proceeding toward Buckbeak. In horror, they witness the axe being raised and swing down, leading Hermione to turn into Ron's shoulder in distress. Abruptly, Ron drops his rat, which has bitten him, and the trio chases after it, with Ron catching Scabbers near the Whomping Willow."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Harry sees something swirling around inside the crystal ball, a mystical object often used by seers in attempts to foresee the future, and as he moves closer and peers into the mist created by the enchanted orb, he sees the face of Sirius Black, a notorious wizard known for his escape from the wizarding prison Azkaban. A hand claps him on the shoulder, and bemused, Professor Trelawney, the Divination teacher with a reputation for making dramatic predictions, gazes at Harry. With a worried look on his face, he runs out of the room and hurries away down the circular staircase, a defining architectural feature often found in medieval castles. Outside, in a ruined part of the castle that had been damaged in a historic battle years ago, crows alight on the fallen masonry. Hermione, Harry, and Ron peer through a ruined archway at a man wearing a black hood, an attire often associated with executioners in history, sharpening the curved blade of a huge axe. They leave the school, an ancient institution renowned for teaching young witches and wizards, walk through the cloister, a covered walkway typically found in monastic settings, and into the grounds, where Malfoy and his cronies are on the slope above Hagrid's cottage, home to the gentle but imposing gamekeeper. Furious, Hermione threatens Malfoy, her wand at his throat, a symbol of power in their magical world, and he's terrified. As she turns away, Malfoy smirks, but she turns back and punches him full in the face. Malfoy and his cronies make a run for it, and she smiles at Ron. Ron, Harry, and Hermione run down the steep steps cut into the grassy slope towards Hagrid's cottage, finding him gazing sadly out of the window at Buckbeak, a hippogriff known for its proud and noble nature, who is chained to a post in the pumpkin patch. A line of dead ferrets, often used as a treat for certain magical creatures, is hanging nearby, and he feeds a small creature, opens a small blue tin, and takes out Ron's rat, known as Scabbers. Another pebble hits Harry, and they look out of the window to see Fudge, the Minister of Magic, Dumbledore, the wise and respected headmaster, and the Executioner making their way towards the cottage. Hagrid ushers them out, and they peer out of the back door as, at the front door, Hagrid welcomes his guests. Harry, Ron, and Hermione escape from the cottage and run down the garden path, hiding behind a huge pile of giant orange pumpkins, a seasonal crop grown by Hagrid. A crow lands beside them as they anxiously watch the cottage. Hermione spins around and peers into the forest, a forbidden and magical place teeming with mysterious creatures, and they run as fast as they can away from the cottage and up the grassy slope. Buckbeak watches them go, his fierce eyes following their retreat, and Harry glances back at the hippogriff still chained to a post in the pumpkin patch, then follows his friends. Halfway up the hill, they stop and look back towards the cottage, seeing smoke rising from the stone chimney, a sign that a fire is burning inside. Dumbledore, Fudge, and Hagrid come out of the cottage with the Executioner, who walks across the garden carrying his sharp axe over his shoulder. He moves through the pumpkin patch towards Buckbeak, and they watch horrified as the Executioner raises his axe, a chilling symbol of impending doom, and the huge blade swings down. Hermione hides her face on Ron's shoulder, putting her arms around his neck. Suddenly, Ron drops his rat, blood on his finger, and chases the rat, with Harry and Hermione following him. Ron catches Scabbers and slumps down near the Whomping Willow, a violent tree known for attacking anyone who gets too close, with its twisted trunk."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Harry sees something swirling around inside the crystal ball and as he moves closer and peers into the mist he sees the face of Sirius Black. A hand claps him on the shoulder and bemused Professor Trelawney gazes at Harry. With a worried look on his face he runs out of the room and hurries away down the circular staircase. Outside in a ruined part of the castle crows alight on the fallen masonry. Hermione. Harry and Ron peer through a ruined archway at a man wearing a black hood sharpening the curved blade of a huge axe. They leave the school walk through the cloister and into the grounds where Malfoy and his cronies are on the slope above Hagrid's cottage. Furious Hermione threatens Malfoy her wand at his throat and he is terrified. As she turns away Malfoy smirks but she turns back and punches him full in the face. Malfoy and his cronies make a run for it and she smiles at Ron. Ron Harry and Hermione run down the steep steps cut into the grassy slope towards Hagrid's cottage finding him gazing sadly out of the window at Buckbeak who is chained to a post in the pumpkin patch. A line of dead ferrets is hanging nearby and he feeds a small creature opens a small blue tin and takes out Ron's rat. Another pebble hits Harry and they look out of the window to see Fudge. Dumbledore and the Executioner making their way towards the cottage. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Hagrid ushers them out and they peer out of the back door as at the front door. Hagrid welcomes his guests. Harry. Ron and Hermione escape from the cottage and run down the garden path hiding behind a huge pile of giant orange pumpkins. A crow lands beside them as they anxiously watch the cottage. Hermione spins around and peers into the forest and they run as fast as they can away from the cottage and up the grassy slope. Buckbeak watches them go and Harry glances back at the hippogriff still chained to a post in the pumpkin patch then follows his friends. Halfway up the hill they stop and look back towards the cottage seeing smoke rising from the stone chimney. Dumbledore. Fudge and Hagrid come out of the cottage with the Executioner who walks across the garden carrying his sharp axe over his shoulder. He moves through the pumpkin patch towards Buckbeak and they watch horrified as the Executioner raises his axe and the huge blade swings down. Hermione hides her face on Ron's shoulder putting her arms around his neck. Suddenly Ron drops his rat blood on his finger and chases the rat with Harry and Hermione following him. Ron catches Scabbers and slumps down near the Whomping Willow with its twisted trunk."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Harry sees something swirling around inside the crystal ball and as he moves closer and peers into the mist he sees the face of Sirius Black. A hand claps him on the shoulder and bemused Professor Trelawney gazes at Harry. With a worried look on his face he runs out of the room and hurries away down the circular staircase. Outside in a ruined part of the castle crows alight on the fallen masonry. Hermione. Harry and Ron peer through a ruined archway at a man wearing a black hood sharpening the curved blade of a huge axe. They leave the school walk through the cloister and into the grounds where Malfoy and his cronies are on the slope above Hagrid's cottage. Furious Hermione threatens Malfoy her wand at his throat and he is terrified. As she turns away Malfoy smirks but she turns back and punches him full in the face. Malfoy and his cronies make a run for it and she smiles at Ron. Ron Harry and Hermione run down the steep steps cut into the grassy slope towards Hagrid's cottage finding him gazing sadly out of the window at Buckbeak who is chained to a post in the pumpkin patch. A line of dead ferrets is hanging nearby and he feeds a small creature opens a small blue tin and takes out Ron's rat. Another pebble hits Harry and they look out of the window to see Fudge. Dumbledore and the Executioner making their way towards the cottage. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. Hagrid ushers them out and they peer out of the back door as at the front door. Hagrid welcomes his guests. Harry. Ron and Hermione escape from the cottage and run down the garden path hiding behind a huge pile of giant orange pumpkins. A crow lands beside them as they anxiously watch the cottage. Hermione spins around and peers into the forest and they run as fast as they can away from the cottage and up the grassy slope. Buckbeak watches them go and Harry glances back at the hippogriff still chained to a post in the pumpkin patch then follows his friends. Halfway up the hill they stop and look back towards the cottage seeing smoke rising from the stone chimney. Dumbledore. Fudge and Hagrid come out of the cottage with the Executioner who walks across the garden carrying his sharp axe over his shoulder. He moves through the pumpkin patch towards Buckbeak and they watch horrified as the Executioner raises his axe and the huge blade swings down. Hermione hides her face on Ron's shoulder putting her arms around his neck. Suddenly Ron drops his rat blood on his finger and chases the rat with Harry and Hermione following him. Ron catches Scabbers and slumps down near the Whomping Willow with its twisted trunk."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Harry sees something swirling around inside the crystal ball and as he moves closer and peers into the mist he sees the face of Sirius Black. A hand claps him on the shoulder and bemused Professor Trelawney gazes at Harry. With a worried look on his face he runs out of the room and hurries away down the circular staircase. Outside in a ruined part of the castle crows alight on the fallen masonry. Hermione. Harry and Ron peer through a ruined archway at a man wearing a black hood sharpening the curved blade of a huge axe. They leave the school walk through the cloister and into the grounds where Malfoy and his cronies are on the slope above Hagrid's cottage. Halfway up the hill they stop and look back towards the cottage seeing smoke rising from the stone chimney. Dumbledore. Fudge and Hagrid come out of the cottage with the Executioner who walks across the garden carrying his sharp axe over his shoulder. He moves through the pumpkin patch towards Buckbeak and they watch horrified as the Executioner raises his axe and the huge blade swings down. Hermione hides her face on Ron's shoulder putting her arms around his neck. Suddenly Ron drops his rat blood on his finger and chases the rat with Harry and Hermione following him. Ron catches Scabbers and slumps down near the Whomping Willow with its twisted trunk."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Harry sees something swirling around inside the crystal ball and as he moves closer and peers into the mist he sees the face of Sirius Black. A hand claps him on the shoulder and bemused Professor Trelawney gazes at Harry. With a worried look on his face he runs out of the room and hurries away down the circular staircase. Hermione hides her face on Ron's shoulder putting her arms around his neck. Suddenly Ron drops his rat blood on his finger and chases the rat with Harry and Hermione following him. Ron catches Scabbers and slumps down near the Whomping Willow with its twisted trunk."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Larry notices something floating inside the snow globe, and as he strolls closer and gazes into the fog, he spots the outline of a racing car. A paw taps him on the knee, and bewildered, Coach Maple stares at Larry. With a curious expression on his face, he skips out of the tent and races away down the spiral gangway. Outside, in a collapsed part of the fortress, pigeons settle on the broken pillars. Bethany, Larry, and Tom peer through a shattered window at a robot wearing a red cape, polishing the sharp edge of a large dagger. They exit the library, stroll through the arcade and onto the field, where Lucy and her friends are on the hill above Barnaby's workshop. Frustrated, Bethany warns Lucy, her stick at her nose, and she's startled. As she spins around, Lucy grins, but she pivots back and kicks her square in the shin. Lucy and her friends dash away, and she winks at Tom. Tom, Larry, and Bethany jog down the narrow steps carved into the rocky hill towards Barnaby's workshop, finding him staring thoughtfully out of the window at Stormwing, who is tethered to a stake in the cabbage patch. A row of frozen lizards is hanging nearby, and he offers food to a tiny beast, pulls out a small red box, and retrieves Tom's hamster. Another stone strikes Larry, and they glance out of the window to spot Falco, Greybeard, and the Operator heading towards the workshop. Barnaby shuffles them out, and they peek out of the rear entrance as, at the front entrance, Barnaby greets his visitors. Larry, Tom, and Bethany slip away from the workshop and dash down the trail, hiding behind an enormous stack of giant blue boulders. A pigeon perches beside them as they nervously observe the workshop. Bethany twirls around and glances into the grove, and they sprint as swiftly as they can away from the workshop and up the rocky hill. Stormwing observes them leave, and Larry casts one last look at the gryphon still tethered to a stake in the cabbage patch, then trails after his companions. Midway up the incline, they halt and peer back towards the workshop, observing steam curling from the brick chimney. Greybeard, Falco, and Barnaby emerge from the workshop with the Operator, who strides across the meadow carrying his gleaming sword over his back. He strides through the cabbage patch towards Stormwing, and they gape in shock as the Operator lifts his sword and the massive edge arcs downward. Bethany buries her face on Tom's shoulder, wrapping her around his neck. Suddenly, Tom releases his hamster, a scratch on his thumb, and sprints after the hamster, with Larry and Bethany trailing him. Tom snatches Whiskers and collapses down near the Whipping Oak with its gnarled branches."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Harry sees Sirius Black's face in a crystal ball and runs out, worried. He meets Hermione and Ron, and they spot a hooded man sharpening an axe near the ruined castle. They confront Malfoy near Hagrid's cottage; Hermione punches him and he flees. At Hagrid’s, they find Buckbeak chained and moments later see Fudge, Dumbledore, and an Executioner approaching. Hagrid ushers them out, and they hide behind pumpkins, watching from a distance as the Executioner raises his axe over Buckbeak. Disturbed, Hermione clings to Ron. Ron's rat, Scabbers, bites him, causing Ron to chase after it with Harry and Hermione in pursuit. Ron eventually catches Scabbers near the Whomping Willow."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Ron catches Scabbers and slumps down near the Whomping Willow with its twisted trunk Suddenly Ron drops his rat blood on his finger and chases the rat with Harry and Hermione following him Hermione hides her face on Ron's shoulder putting her arms around his neck He moves through the pumpkin patch towards Buckbeak and they watch horrified as the Executioner raises his axe and the huge blade swings down Fudge and Hagrid come out of the cottage with the Executioner who walks across the garden carrying his sharp axe over his shoulder Dumbledore Halfway up the hill they stop and look back towards the cottage seeing smoke rising from the stone chimney Buckbeak watches them go and Harry glances back at the hippogriff still chained to a post in the pumpkin patch then follows his friends Hermione spins around and peers into the forest and they run as fast as they can away from the cottage and up the grassy slope A crow lands beside them as they anxiously watch the cottage Ron and Hermione escape from the cottage and run down the garden path hiding behind a huge pile of giant orange pumpkins Harry Hagrid welcomes his guests Hagrid ushers them out and they peer out of the back door as at the front door Dumbledore and the Executioner making their way towards the cottage Another pebble hits Harry and they look out of the window to see Fudge A line of dead ferrets is hanging nearby and he feeds a small creature opens a small blue tin and takes out Ron's rat Ron Harry and Hermione run down the steep steps cut into the grassy slope towards Hagrid's cottage finding him gazing sadly out of the window at Buckbeak who is chained to a post in the pumpkin patch Malfoy and his cronies make a run for it and she smiles at Ron As she turns away Malfoy smirks but she turns back and punches him full in the face Furious Hermione threatens Malfoy her wand at his throat and he is terrified They leave the school walk through the cloister and into the grounds where Malfoy and his cronies are on the slope above Hagrid's cottage Harry and Ron peer through a ruined archway at a man wearing a black hood sharpening the curved blade of a huge axe Hermione Outside in a ruined part of the castle crows alight on the fallen masonry With a worried look on his face he runs out of the room and hurries away down the circular staircase A hand claps him on the shoulder and bemused Professor Trelawney gazes at Harry Harry sees something swirling around inside the crystal ball and as he moves closer and peers into the mist he sees the face of Sirius Black"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "A hand claps him on the shoulder and bemused Professor Trelawney gazes at Harry Harry sees something swirling around inside the crystal ball and as he moves closer and peers into the mist he sees the face of Sirius Black Outside in a ruined part of the castle crows alight on the fallen masonry With a worried look on his face he runs out of the room and hurries away down the circular staircase Harry and Ron peer through a ruined archway at a man wearing a black hood sharpening the curved blade of a huge axe Hermione Furious Hermione threatens Malfoy her wand at his throat and he is terrified They leave the school walk through the cloister and into the grounds where Malfoy and his cronies are on the slope above Hagrid's cottage Malfoy and his cronies make a run for it and she smiles at Ron As she turns away Malfoy smirks but she turns back and punches him full in the face A line of dead ferrets is hanging nearby and he feeds a small creature opens a small blue tin and takes out Ron's rat Ron Harry and Hermione run down the steep steps cut into the grassy slope towards Hagrid's cottage finding him gazing sadly out of the window at Buckbeak who is chained to a post in the pumpkin patch Dumbledore and the Executioner making their way towards the cottage Another pebble hits Harry and they look out of the window to see Fudge Hagrid welcomes his guests Hagrid ushers them out and they peer out of the back door as at the front door Ron and Hermione escape from the cottage and run down the garden path hiding behind a huge pile of giant orange pumpkins Harry Hermione spins around and peers into the forest and they run as fast as they can away from the cottage and up the grassy slope A crow lands beside them as they anxiously watch the cottage Halfway up the hill they stop and look back towards the cottage seeing smoke rising from the stone chimney Buckbeak watches them go and Harry glances back at the hippogriff still chained to a post in the pumpkin patch then follows his friends Fudge and Hagrid come out of the cottage with the Executioner who walks across the garden carrying his sharp axe over his shoulder Dumbledore Hermione hides her face on Ron's shoulder putting her arms around his neck He moves through the pumpkin patch towards Buckbeak and they watch horrified as the Executioner raises his axe and the huge blade swings down Ron catches Scabbers and slumps down near the Whomping Willow with its twisted trunk Suddenly Ron drops his rat blood on his finger and chases the rat with Harry and Hermione following him"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Hagrid ushers them out and they peer out of the back door as at the front door Hagrid welcomes his guests Harry Ron and Hermione escape from the cottage and run down the garden path hiding behind a huge pile of giant orange pumpkins A crow lands beside them as they anxiously watch the cottage Hermione spins around and peers into the forest and they run as fast as they can away from the cottage and up the grassy slope Buckbeak watches them go and Harry glances back at the hippogriff still chained to a post in the pumpkin patch then follows his friends Halfway up the hill they stop and look back towards the cottage seeing smoke rising from the stone chimney Dumbledore Fudge and Hagrid come out of the cottage with the Executioner who walks across the garden carrying his sharp axe over his shoulder He moves through the pumpkin patch towards Buckbeak and they watch horrified as the Executioner raises his axe and the huge blade swings down Hermione hides her face on Ron's shoulder putting her arms around his neck Suddenly Ron drops his rat blood on his finger and chases the rat with Harry and Hermione following him Ron catches Scabbers and slumps down near the Whomping Willow with its twisted trunk Harry sees something swirling around inside the crystal ball and as he moves closer and peers into the mist he sees the face of Sirius Black A hand claps him on the shoulder and bemused Professor Trelawney gazes at Harry With a worried look on his face he runs out of the room and hurries away down the circular staircase Outside in a ruined part of the castle crows alight on the fallen masonry Hermione Harry and Ron peer through a ruined archway at a man wearing a black hood sharpening the curved blade of a huge axe They leave the school walk through the cloister and into the grounds where Malfoy and his cronies are on the slope above Hagrid's cottage Furious Hermione threatens Malfoy her wand at his throat and he is terrified As she turns away Malfoy smirks but she turns back and punches him full in the face Malfoy and his cronies make a run for it and she smiles at Ron Ron Harry and Hermione run down the steep steps cut into the grassy slope towards Hagrid's cottage finding him gazing sadly out of the window at Buckbeak who is chained to a post in the pumpkin patch A line of dead ferrets is hanging nearby and he feeds a small creature opens a small blue tin and takes out Ron's rat Another pebble hits Harry and they look out of the window to see Fudge Dumbledore and the Executioner making their way towards the cottage"
        }
      ]
    }
  ]
}