{
  "ground_truth": "Phyllis' shot did hit Neff, and he realizes this as he looks at the blood on his fingers with a dazed expression. He quickly leaves the room the way he came and exits the house, closing the front door with his right hand while his left arm hangs limp. Neff takes a few steps down the walk before hearing someone approaching, prompting him to move behind a nearby palm tree. A man, Zachetti, comes up the steps towards the front door, but Neff calls to him, causing Zachetti to turn and approach slowly. Neff then takes some loose change out of his pocket and tries to drop a nickel into Zachetti's handkerchief pocket, but Zachetti knocks his hand away and just stares at him. Neff attempts again to put the nickel into his pocket, and this time, Zachetti allows him to do so before going slowly past Neff. Neff then grabs Zachetti and pushes him almost violently down the walk, watching as Zachetti goes out of shot and the sound of his steps fades away. Neff then moves through the shrubbery toward the side of the house where his car is parked. Meanwhile, the desk lamp remains lit while the dawn breaks outside the windows. Neff, still clutching the horn of the dictaphone, is very weak, and his voice is filled with exhaustion. He suddenly stops his dictation, sensing he is not alone in the room, and as he turns in his chair, the camera pulls back to reveal the office door wide open. Keyes stands a few steps inside, with the night watchman and the colored janitor peering curiously over Keyes’ shoulder. Keyes slowly, without taking his eyes off Neff's face, reaches back and shuts the door. Neff hangs up the dictaphone horn and looks at Keyes with a faint, tired grin, speaking very slowly. Keyes moves a few steps closer, staring at Neff without responding. Neff indicates the used cylinders on the desk, and they stare at each other for a long moment. With immense effort, Neff stands up, swaying slightly, his face covered in sweat and his shoulder bleeding. He is on the verge of collapse but manages to stagger towards the door, holding himself upright with great effort. Upon reaching the door, he twists the knob and drags it open, then turns to look back at Keyes' implacable face.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Phyllis' shot did hit Neff, and he comprehends this as he gazes at the blood on his digits with a dazed countenance. He swiftly departs the chamber the way he arrived and exits the dwelling, closing the front portal with his right hand while his left limb dangles limp. Neff takes a few strides down the path before hearing someone nearing, prompting him to move behind a nearby palm. A man, Zachetti, comes up the steps toward the front portal, but Neff calls to him, causing Zachetti to turn and approach gradually. Neff then takes some loose coins out of his pocket and tries to drop a nickel into Zachetti's handkerchief pocket, but Zachetti bats his hand away and just stares at him. Neff endeavors again to put the nickel into his pocket, and this time, Zachetti permits him to do so before going slowly past Neff. Neff then seizes Zachetti and thrusts him almost violently down the path, observing as Zachetti goes out of frame and the sound of his steps fades away. Neff then moves through the shrubbery toward the flank of the dwelling where his automobile is stationed. Meanwhile, the desk lamp remains illuminated while the dawn breaks outside the panes. Neff, still clutching the horn of the dictaphone, is very frail, and his voice is filled with exhaustion. He abruptly stops his dictation, sensing he is not alone in the chamber, and as he turns in his chair, the camera pulls back to reveal the office portal wide open. Keyes stands a few steps inside, with the night watchman and the colored janitor peering curiously over Keyes' shoulder. Keyes slowly, without taking his eyes off Neff's visage, reaches back and shuts the portal. Neff hangs up the dictaphone horn and looks at Keyes with a faint, tired grin, speaking very slowly. Keyes moves a few steps closer, staring at Neff without responding. Neff indicates the used cylinders on the desk, and they stare at each other for a long moment. With immense effort, Neff stands up, swaying slightly, his face covered in perspiration and his shoulder bleeding. He is on the verge of collapse but manages to stagger toward the portal, holding himself upright with great effort. Upon reaching the portal, he twists the knob and drags it open, then turns to look back at Keyes' implacable visage."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Neff was hit by Phyllis' shot, and this is realized by him as the blood on his fingers is looked at with a dazed expression. The room is quickly left by him the way he came, and the house is exited, with the front door being closed by his right hand while his left arm hangs limp. A few steps down the walk are taken by Neff before someone approaching is heard by him, prompting him to move behind a nearby palm tree. The steps towards the front door are taken by a man, Zachetti, but he is called to by Neff, causing him to turn and approach slowly. Some loose change is then taken out of Neff's pocket, and a nickel is tried to be dropped into Zachetti's handkerchief pocket by him, but Zachetti knocks his hand away and just stares at him. The nickel is attempted again to be put into his pocket by Neff, and this time, he is allowed by Zachetti to do so before Zachetti slowly goes past Neff. Zachetti is then grabbed by Neff, and he is almost violently pushed down the walk, as Zachetti goes out of shot and the sound of his steps fades away. The shrubbery is moved through by Neff toward the side of the house where the car is parked by him. Meanwhile, the desk lamp remains lit while the dawn breaks outside the windows. The horn of the dictaphone is clutched by Neff, who is very weak, and exhaustion fills his voice. The dictation is suddenly stopped by him, sensing he is not alone in the room, and as his chair is turned in by him, the office door is revealed wide open as the camera pulls back. Keyes stands a few steps inside, with the night watchman and the colored janitor peering curiously over Keyes’ shoulder. The door is slowly shut by Keyes, without taking his eyes off Neff's face. The dictaphone horn is hung up by Neff, and Keyes is looked at with a faint, tired grin, as he speaks very slowly. A few steps closer are moved by Keyes, staring at Neff without responding. The used cylinders on the desk are indicated by Neff, and they stare at each other for a long moment. With immense effort, Neff stands up, sways slightly, his face covered in sweat and his shoulder bleeding. On the verge of collapse, he manages to stagger towards the door, holding himself upright with great effort. Upon reaching the door, the knob is twisted by him and it is dragged open, then he turns to look back at Keyes' implacable face."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Phyllis' shot hits Neff, who notices the blood on his fingers with a dazed look. He exits the house, closing the front door with his right hand as his left arm hangs limp. Hearing someone approaching, Neff hides behind a palm tree. Zachetti comes up the steps, and Neff calls him over. Neff tries to drop a nickel into Zachetti's handkerchief pocket, but Zachetti knocks it away, staring. Neff tries again, succeeds, and Zachetti slowly walks past him. Neff then forcefully pushes Zachetti down the walk and watches him disappear. Neff moves through the shrubbery to his car. Meanwhile, a desk lamp stays lit as dawn breaks. Neff, weak and exhausted, clutches the dictaphone horn. He halts his dictation, sensing he is not alone, and turns to see the office door open. Keyes stands inside, with the night watchman and janitor peering over his shoulder. Keyes shuts the door without breaking eye contact with Neff. Neff hangs up the dictaphone horn, grinning faintly and speaking slowly. Keyes approaches, silent and staring. Neff gestures to the used cylinders on the desk, and they share a long look. Neff, sweating and bleeding, struggles to stand and stagger towards the door. He opens it with effort, then turns back to look at Keyes' unyielding face."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Phyllis' shot hits Neff, and he notices the blood on his fingers. He quickly exits the house, closing the door with his right hand while his left arm hangs limp. Hearing someone, Neff hides behind a palm tree. Zachetti approaches the door, but Neff calls him over. Neff attempts to drop a nickel into Zachetti's pocket, but Zachetti resists. On his second attempt, Zachetti lets him. Neff then pushes Zachetti away and watches him leave. Neff heads through the shrubs to his parked car. Inside, dawn breaks while the desk lamp remains lit. Clutching the dictaphone horn, Neff is weak and exhausted. He pauses, sensing someone in the room, and sees Keyes at the door with others peering in. Keyes, without breaking eye contact, shuts the door. Neff hangs up the dictaphone horn and exchanges a look with Keyes. Neff, sweating and bleeding, struggles to stand, swaying as he moves towards the door. He opens it, turning back to see Keyes' unwavering gaze."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Phyllis' shot, indeed, found its mark and struck Neff, a fact he quickly comes to terms with as he glances down at his fingers, now stained with blood. A dazed expression settles on his face, reflecting his realization of the gravity of the situation. With urgency, he retraces his steps, swiftly leaving the room exactly the way he entered, and makes his way out of the house. Using his right hand to firmly close the front door behind him, his left arm remains hanging uselessly at his side, a stark reminder of his injury. \n\nGathering his resolve, Neff takes several tentative steps down the path, only to be alerted by the sound of approaching footsteps. Instinctively, he seeks the cover of a nearby palm tree, moving behind it to avoid detection. As he peers out, he sees a man, identified as Zachetti, ascend the steps towards the front entrance. Neff seizes the moment, calling out to Zachetti, which causes him to halt and then slowly turn around, making his way cautiously toward Neff. \n\nNeff, in an attempt to communicate, reaches into his pocket, withdrawing some loose change. He tries to deposit a nickel into Zachetti's handkerchief pocket, but Zachetti is not receptive to the gesture, swatting Neff's hand away and fixing him with an intense stare. Undeterred, Neff makes another attempt, and this time, Zachetti allows the nickel to be placed securely in his pocket, before proceeding past Neff with deliberate slowness. With a sudden and forceful motion, Neff grabs Zachetti, shoving him almost violently down the walkway. Neff stands there, observing as Zachetti recedes from view, his footsteps gradually fading into silence.\n\nDetermined to reach his vehicle, Neff navigates through the tangled shrubbery towards the side of the house where his car awaits. Meanwhile, back inside, a desk lamp casts a steady glow, defying the first light of dawn that breaks through the windows. Neff, gripping the horn of the dictaphone tightly, is overcome with weakness. His voice, heavy with exhaustion, trembles as he pauses his dictation, suddenly sensing another presence in the room. As he turns slowly in his chair, the camera lens widens to reveal the office door standing wide open. Keyes stands only a few steps inside, the night watchman and the colored janitor peering over his shoulder with curiosity. With deliberate slowness, keeping his unwavering gaze on Neff's face, Keyes reaches back to softly shut the door.\n\nNeff sets down the dictaphone horn, meeting Keyes’ gaze with a faint, weary smile, and speaks in a manner that is noticeably deliberate and slow. Keyes advances a few steps closer, maintaining an intense stare at Neff without uttering a word. Neff gestures towards the used cylinders spread out on the desk, and they engage in a silent yet profound exchange, locking eyes for what seems like an eternity. Summoning every ounce of strength, Neff manages to rise to his feet, though he wobbles unsteadily, his face glistening with perspiration and his shoulder still bleeding. He teeters on the brink of collapse but somehow staggers determinedly toward the door, struggling to remain upright with considerable effort. Upon reaching the door, he twists the knob with difficulty, pulling it open, and then glances back at Keyes’ unyielding expression."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Phyllis' shot, indeed, found its mark with a chilling precision and unmistakably struck Neff. This stark reality, he quickly comes to terms with as he glances downward at his fingers, now stained with the crimson of his own blood. A dazed expression soon settles upon his face, reflecting back to him the realization of the full gravity of the situation he finds himself in. Driven by urgency, he retraces his steps with haste, swiftly exiting the room in exactly the same manner as he had entered, making his determined way out of the house entirely. Utilizing his right hand with determination, he firmly closes the front door behind him; meanwhile, his left arm remains hanging uselessly at his side, a stark and sobering reminder of his injury.\n\nWith renewed determination, Neff gathers his resolve, taking several tentative steps down the path, only to be alerted by the distinct sound of footsteps approaching. Acting instinctively, he seeks the cover provided by a nearby palm tree, moving cautiously behind it to avoid detection. As he carefully peers out from his hiding spot, he observes a man, identified as Zachetti, ascending the steps toward the front entrance. Seizing the opportune moment, Neff calls out to Zachetti, prompting him to halt in his tracks and then slowly turn around, making his way cautiously toward Neff with measured steps.\n\nIn an attempt to communicate, Neff reaches into his pocket, extracting some loose change. He endeavors to deposit a nickel into Zachetti's handkerchief pocket, yet Zachetti is initially unreceptive to this gesture, swatting Neff's hand aside and fixing him with an intense, unyielding stare. However, undeterred by this setback, Neff makes another attempt, and on this occasion, Zachetti allows the nickel to be placed securely in his pocket, before he proceeds past Neff with deliberate slowness. With a sudden and forceful motion that exudes determination, Neff grabs Zachetti, shoving him almost violently down the walkway. Neff stands there, watching intently as Zachetti recedes from view, his footsteps gradually fading away into an encompassing silence.\n\nResolute in his determination to reach his vehicle, Neff navigates through the tangled thicket of shrubbery towards the side of the house where his car awaits his arrival. Meanwhile, back inside, a desk lamp casts a steady and unwavering glow, defiantly illuminating the space despite the first light of dawn that begins to break through the windows. Neff, gripping the horn of the dictaphone with all his strength, finds himself overcome with weakness. His voice, laden with exhaustion, trembles noticeably as he pauses in his dictation, suddenly sensing another presence within the room. As he turns slowly in his chair, the camera lens widens to reveal the office door standing wide open. Keyes stands only a few steps inside, while the night watchman and the colored janitor peer over his shoulder with unabashed curiosity. With deliberate slowness, keeping his unwavering gaze fixed on Neff's face, Keyes reaches back to softly and securely shut the door.\n\nNeff sets down the dictaphone horn, meeting Keyes’ gaze with a faint, weary smile etched across his face, and speaks in a manner that is noticeably deliberate and slow. Keyes advances a few careful steps closer, maintaining an intense, unwavering stare at Neff without uttering a single word. Neff gestures toward the used cylinders that are spread out on the desk, and they engage in a silent yet profoundly meaningful exchange, locking eyes for what seems like an eternity stretches before them. Summoning every ounce of remaining strength, Neff manages to rise to his feet, though he wobbles unsteadily, his face glistening with perspiration, and his shoulder continuing to bleed. He teeters precariously on the brink of collapse but somehow staggers determinedly toward the door, struggling to remain upright with considerable effort. Upon reaching the door, he twists the knob with palpable difficulty, pulling it open, and then glances back at Keyes’ unyielding expression."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Phyllis' shot struck Neff, and as he feels the impact, he instinctively brings his fingers to the wound, his dazed mind processing the sight of blood smeared across them. In a hurried, almost reflexive motion, he pivots around, retracing his initial steps with urgency, swiftly making his way out of the room. Upon reaching the door, with his right hand, he pulls it open and steps through, ensuring it's securely closed behind him, all while his left arm dangles uselessly by his side. As he proceeds down the walkway, his ears detect the sound of someone approaching, causing a spike of adrenaline to course through him. Reacting quickly, Neff ducks behind a nearby palm tree to conceal himself. From his hiding spot, he watches as a man named Zachetti climbs the steps toward the front door, each step bringing him closer. Summoning his voice, Neff calls out to Zachetti, who responds by halting in his tracks and slowly turning in Neff's direction. As Zachetti approaches warily, Neff fishes in his pocket, extracting loose change, and attempts to slip a nickel into Zachetti's handkerchief pocket. Zachetti's initial reaction is to deflect Neff's hand away, staring at him with suspicion. Undeterred, Neff makes a second attempt, this time successfully depositing the nickel into Zachetti's pocket, after which Zachetti allows himself to pass by Neff slowly. In a sudden, forceful motion, Neff seizes Zachetti, propelling him almost violently down the walkway, observing as Zachetti disappears from view, the sound of his retreating footsteps fading into the distance. With Zachetti gone, Neff slips through the dense shrubbery, making his way around the side of the house where his car awaits. Meanwhile, back inside, a desk lamp casts a soft glow, combating the encroaching dawn that peeks through the windows, illuminating the room in a mix of artificial light and early morning hues. Neff, clutching tightly to the horn of the dictaphone, battles with his waning strength as his voice betrays the exhaustion he can no longer hide. A sudden pause punctuates his dictation as a creeping awareness alerts him to another presence. As he swivels in his chair, the camera lens slowly expands its focus, unveiling the office door swung wide open. Standing a few steps inside the threshold is Keyes, with the night watchman and the colored janitor curiously peering over Keyes' shoulder. Without breaking eye contact with Neff, Keyes methodically extends his arm behind him, gripping the edge of the door and swinging it shut, sealing the room. Neff, acknowledging this, deliberately places the dictaphone horn down, meeting Keyes' gaze with a faint, tired smile that stretches across his weary features. In deliberate silence, Keyes edges closer with each step, his unwavering stare fixed on Neff, who in turn gestures toward the used cylinders scattered across the desk. They lock eyes in a silent exchange, the weight of unspoken words hanging between them. Mustering every ounce of strength, Neff rises unsteadily to his feet, his entire frame swaying under the combined weight of fatigue and pain, evident in the sweat glistening on his brow and the bleeding wound on his shoulder. As he teeters on the brink of collapse, sheer willpower propels him toward the door, each step a testament to his determination to remain upright. Upon reaching the door, he painstakingly twists the knob and tugs it open, pausing momentarily to cast one final glance at Keyes' unwavering expression, etching the image into his memory before stepping through."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Phyllis' shot hits Neff, who realizes this as he notices blood on his fingers with a dazed expression. He quickly exits the house, closing the door with his right hand while his left arm hangs limp. Hearing someone approaching, Neff hides behind a nearby palm tree. When Zachetti comes up the steps, Neff calls him over, attempts to put a nickel into Zachetti's pocket, and despite initial resistance, manages to do so. Neff then forcibly pushes Zachetti down the walk, watching as he leaves. He then moves through the shrubbery towards his parked car. Meanwhile, dawn breaks outside the lit office, where Neff, exhausted and weak, clutches the dictaphone horn. Sensing he is not alone, Neff stops his dictation as the camera reveals Keyes standing with the night watchman and janitor at the open door. Keyes, without breaking eye contact, shuts the door and moves closer. Neff, with a faint, tired grin, indicates the used cylinders on the desk. After a prolonged stare, Neff stands with immense effort, swaying and sweating, his shoulder bleeding. On the brink of collapse, he staggers to the door, opens it, and turns back to meet Keyes' unwavering gaze."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Phyllis' shot did hit Neff, and he realizes this as he looks at the blood on his fingers with a dazed expression, reminiscent of a character caught in a classic film noir scene where betrayal and violence intertwine. He quickly leaves the room the way he came and exits the Los Angeles-style suburban house, closing the ornate front door with his right hand while his left arm hangs limp due to the injury. Neff takes a few steps down the walk, lined with neatly trimmed hedges common in 1940s residential neighborhoods, before hearing someone approaching. This prompts him to move behind a nearby palm tree, typical of Southern California landscaping. A man, Zachetti, known for his shady dealings around the city, comes up the steps towards the front door, but Neff calls to him, causing Zachetti to turn and approach slowly, as if wary of his surroundings. Neff then takes some loose change out of his pocket and tries to drop a nickel into Zachetti's handkerchief pocket, a gesture that could signify paying off or distracting someone in a tense situation, but Zachetti knocks his hand away and just stares at him with suspicion. Neff attempts again to put the nickel into his pocket, and this time, Zachetti allows him to do so before going slowly past Neff, like a reluctant participant in a dangerous game. Neff then grabs Zachetti and pushes him almost violently down the walk, watching as Zachetti goes out of shot and the sound of his steps fades away, a cinematic fade-out typical of noir films. Neff then moves through the shrubbery toward the side of the house where his sleek black car, an icon of 1940s elegance, is parked. Meanwhile, the desk lamp remains lit while the dawn breaks outside the windows, casting long shadows across the room. Neff, still clutching the horn of the dictaphone, which was cutting-edge office technology of the time, is very weak, and his voice is filled with exhaustion from his recent ordeal. He suddenly stops his dictation, sensing he is not alone in the room, and as he turns in his chair, the camera pulls back to reveal the office door wide open. Keyes, his trusted colleague known for his sharp intuition, stands a few steps inside, with the night watchman and the colored janitor—terms reflecting the period's social and racial climate—peering curiously over Keyes’ shoulder. Keyes slowly, without taking his eyes off Neff's face, reaches back and shuts the door with a sense of finality. Neff hangs up the dictaphone horn and looks at Keyes with a faint, tired grin, speaking very slowly, as if savoring their longstanding friendship. Keyes moves a few steps closer, staring at Neff without responding, perhaps contemplating the gravity of the situation. Neff indicates the used cylinders on the desk, a testament to his recorded confession, and they stare at each other for a long moment, the weight of the moment hanging heavily in the air. With immense effort, Neff stands up, swaying slightly, his face covered in sweat and his shoulder bleeding, clearly struggling against his fading strength. He is on the verge of collapse but manages to stagger towards the door, holding himself upright with great effort, a testament to his determination. Upon reaching the door, he twists the knob and drags it open, then turns to look back at Keyes' implacable face, knowing that their fates are now inexorably linked."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Neff then moves through the shrubbery toward the side of the house where his car is parked Neff indicates the used cylinders on the desk and they stare at each other for a long moment Phyllis' shot did hit Neff and he realizes this as he looks at the blood on his fingers with a dazed expression Keyes moves a few steps closer staring at Neff without responding Meanwhile the desk lamp remains lit while the dawn breaks outside the windows He quickly leaves the room the way he came and exits the house closing the front door with his right hand while his left arm hangs limp Upon reaching the door he twists the knob and drags it open then turns to look back at Keyes' implacable face Neff takes a few steps down the walk before hearing someone approaching prompting him to move behind a nearby palm tree he is not alone in the room and as he turns in his chair the camera pulls back to reveal the office door wide open Neff takes a few steps down the walk before hearing someone approaching prompting him to move behind a nearby palm tree A man Zachetti comes up the steps towards the front door but Neff calls to him causing Zachetti to turn and approach slowly Neff then takes some loose change out of his pocket and tries to drop a nickel into Zachetti's handkerchief pocket but Zachetti knocks his hand away and just stares at him Neff attempts again to put the nickel into his pocket and this time Zachetti allows him to do so before going slowly past Neff Neff then grabs Zachetti and pushes him almost violently down the walk watching as Zachetti goes out of shot and the sound of his steps fades away Neff then moves through the shrubbery toward the side of the house where his car is parked Meanwhile the desk lamp remains lit while the dawn breaks outside the windows Neff still clutching the horn of the dictaphone is very weak and his voice is filled with exhaustion He quickly leaves the room the way he came and exits the house closing the front door with his right hand while his left arm hangs limp He suddenly stops his dictation sensing he is not alone in the room and as he turns in his chair the camera pulls back to reveal the office door wide open He suddenly stops his dictation sensing Phyllis' shot did hit Neff and he realizes this as he looks at the blood on his fingers with a dazed expression Keyes stands a few steps inside with the night watchman and the colored janitor peering curiously over Keyes’ shoulder Keyes slowly without taking his eyes off Neff's face reaches back and shuts the door Neff hangs up the dictaphone horn and looks at Keyes with a faint tired grin speaking very slowly Keyes moves a few steps closer staring at Neff without responding A man Zachetti comes up the steps towards the front door but Neff calls to him causing Zachetti to turn and approach slowly Neff indicates the used cylinders on the desk and they stare at each other for a long moment With immense effort Neff stands up swaying slightly his face covered in sweat and his shoulder bleeding He is on the verge of collapse but manages to stagger towards the door holding himself upright with great effort Upon reaching the door he twists the knob and drags it open then turns to look back at Keyes' implacable face"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Phyllis' shot did hit Neff and he realizes this as he looks at the blood on his fingers with a dazed expression. He quickly leaves the room the way he came and exits the house closing the front door with his right hand while his left arm hangs limp. Neff takes a few steps down the walk before hearing someone approaching prompting him to move behind a nearby palm tree. A man Zachetti comes up the steps towards the front door but Neff calls to him causing Zachetti to turn and approach slowly. Neff then takes some loose change out of his pocket and tries to drop a nickel into Zachetti's handkerchief pocket but Zachetti knocks his hand away and just stares at him. Neff attempts again to put the nickel into his pocket and this time Zachetti allows him to do so before going slowly past Neff. Neff then grabs Zachetti and pushes him almost violently down the walk watching as Zachetti goes out of shot and the sound of his steps fades away. Neff then moves through the shrubbery toward the side of the house where his car is parked. Meanwhile the desk lamp remains lit while the dawn breaks outside the windows. Neff still clutching the horn of the dictaphone is very weak and his voice is filled with exhaustion. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. He suddenly stops his dictation sensing. he is not alone in the room and as he turns in his chair the camera pulls back to reveal the office door wide open. Keyes stands a few steps inside with the night watchman and the colored janitor peering curiously over Keyes’ shoulder. Keyes slowly without taking his eyes off. Neff's face reaches back and shuts the door. Neff hangs up the dictaphone horn and looks at Keyes with a faint tired grin speaking very slowly. Keyes moves a few steps closer staring at Neff without responding. Neff indicates the used cylinders on the desk and they stare at each other for a long moment. With immense effort Neff stands up swaying slightly his face covered in sweat and his shoulder bleeding. He is on the verge of collapse but manages to stagger towards the door holding himself upright with great effort. Upon reaching the door he twists the knob and drags it open then turns to look back at Keyes' implacable face."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Phyllis' shot did hit Neff and he realizes this as he looks at the blood on his fingers with a dazed expression. He quickly leaves the room the way he came and exits the house closing the front door with his right hand while his left arm hangs limp. Neff takes a few steps down the walk before hearing someone approaching prompting him to move behind a nearby palm tree. A man Zachetti comes up the steps towards the front door but Neff calls to him causing Zachetti to turn and approach slowly. Neff then takes some loose change out of his pocket and tries to drop a nickel into Zachetti's handkerchief pocket but Zachetti knocks his hand away and just stares at him. Neff attempts again to put the nickel into his pocket and this time Zachetti allows him to do so before going slowly past Neff. Neff then grabs Zachetti and pushes him almost violently down the walk watching as Zachetti goes out of shot and the sound of his steps fades away. Neff then moves through the shrubbery toward the side of the house where his car is parked. Meanwhile the desk lamp remains lit while the dawn breaks outside the windows. Neff still clutching the horn of the dictaphone is very weak and his voice is filled with exhaustion. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. He suddenly stops his dictation sensing. he is not alone in the room and as he turns in his chair the camera pulls back to reveal the office door wide open. Keyes stands a few steps inside with the night watchman and the colored janitor peering curiously over Keyes’ shoulder. Keyes slowly without taking his eyes off. Neff's face reaches back and shuts the door. Neff hangs up the dictaphone horn and looks at Keyes with a faint tired grin speaking very slowly. Keyes moves a few steps closer staring at Neff without responding. Neff indicates the used cylinders on the desk and they stare at each other for a long moment. With immense effort Neff stands up swaying slightly his face covered in sweat and his shoulder bleeding. He is on the verge of collapse but manages to stagger towards the door holding himself upright with great effort. Upon reaching the door he twists the knob and drags it open then turns to look back at Keyes' implacable face."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Phyllis' shot did hit Neff and he realizes this as he looks at the blood on his fingers with a dazed expression. He quickly leaves the room the way he came and exits the house closing the front door with his right hand while his left arm hangs limp. Neff takes a few steps down the walk before hearing someone approaching prompting him to move behind a nearby palm tree. A man Zachetti comes up the steps towards the front door but Neff calls to him causing Zachetti to turn and approach slowly. Neff then takes some loose change out of his pocket and tries to drop a nickel into Zachetti's handkerchief pocket but Zachetti knocks his hand away and just stares at him. Neff hangs up the dictaphone horn and looks at Keyes with a faint tired grin speaking very slowly. Keyes moves a few steps closer staring at Neff without responding. Neff indicates the used cylinders on the desk and they stare at each other for a long moment. With immense effort Neff stands up swaying slightly his face covered in sweat and his shoulder bleeding. He is on the verge of collapse but manages to stagger towards the door holding himself upright with great effort. Upon reaching the door he twists the knob and drags it open then turns to look back at Keyes' implacable face."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Phyllis' shot did hit Neff and he realizes this as he looks at the blood on his fingers with a dazed expression. He quickly leaves the room the way he came and exits the house closing the front door with his right hand while his left arm hangs limp. With immense effort Neff stands up swaying slightly his face covered in sweat and his shoulder bleeding. He is on the verge of collapse but manages to stagger towards the door holding himself upright with great effort. Upon reaching the door he twists the knob and drags it open then turns to look back at Keyes' implacable face."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Zelda's shot did hit the librarian, and the librarian realizes this as they look at the blood on their fingers with a dazed expression. The librarian quickly leaves the room the way they came and exits the house, closing the front door with their right hand while their left arm hangs limp. The librarian takes a few steps down the walk before hearing someone approaching, prompting them to move behind a nearby palm tree. An artist, Montgomery, comes up the steps towards the front door, but the librarian calls to Montgomery, causing Montgomery to turn and approach slowly. The librarian then takes some loose change out of their pocket and tries to drop a nickel into Montgomery's handkerchief pocket, but Montgomery knocks their hand away and just stares at the librarian. The librarian attempts again to put the nickel into Montgomery’s pocket, and this time, Montgomery allows them to do so before going slowly past the librarian. The librarian then grabs Montgomery and pushes them almost violently down the walk, watching as Montgomery goes out of shot and the sound of their steps fades away. The librarian then moves through the shrubbery toward the side of the house where their car is parked. Meanwhile, the desk lamp remains lit while the dawn breaks outside the windows. The librarian, still clutching the horn of the dictaphone, is very weak, and their voice is filled with exhaustion. The librarian suddenly stops their dictation, sensing they are not alone in the room, and as they turn in their chair, the camera pulls back to reveal the office door wide open. A detective stands a few steps inside, with the night watchman and the colored janitor peering curiously over the detective’s shoulder. The detective slowly, without taking their eyes off the librarian's face, reaches back and shuts the door. The librarian hangs up the dictaphone horn and looks at the detective with a faint, tired grin, speaking very slowly. The detective moves a few steps closer, staring at the librarian without responding. The librarian indicates the used cylinders on the desk, and they stare at each other for a long moment. With immense effort, the librarian stands up, swaying slightly, their face covered in sweat and their shoulder bleeding. They are on the verge of collapse but manage to stagger towards the door, holding themselves upright with great effort. Upon reaching the door, they twist the knob and drag it open, then turn to look back at the detective's implacable face."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Phyllis' shot did hit Neff, and he realizes this as he looks at the ink on his fingers with a dazed expression. He quickly leaves the cabin the way he came and exits the shed, closing the screen door with his right hand while his left arm hangs limp. Neff takes a few steps down the trail before hearing someone approaching, prompting him to move behind a nearby oak tree. A man, Zachetti, comes up the ramp towards the screen door, but Neff calls to him, causing Zachetti to turn and approach slowly. Neff then takes some loose buttons out of his pocket and tries to drop a dime into Zachetti's satchel pocket, but Zachetti knocks his hand away and just stares at him. Neff attempts again to put the dime into his pocket, and this time, Zachetti allows him to do so before going slowly past Neff. Neff then grabs Zachetti and pushes him almost violently down the trail, watching as Zachetti goes out of shot and the sound of his steps fades away. Neff then moves through the hedges toward the side of the shed where his bicycle is parked. Meanwhile, the ceiling fan remains spinning while the dusk breaks outside the curtains. Neff, still clutching the handle of the megaphone, is very weak, and his voice is filled with exhaustion. He suddenly stops his announcement, sensing he is not alone in the space, and as he turns in his chair, the camera pulls back to reveal the garage door wide open. Keyes stands a few steps inside, with the day watchman and the red-haired porter peering curiously over Keyes’ shoulder. Keyes slowly, without taking his eyes off Neff's face, reaches back and shuts the gate. Neff hangs up the megaphone handle and looks at Keyes with a faint, tired grin, speaking very slowly. Keyes moves a few steps closer, staring at Neff without responding. Neff indicates the used scrolls on the table, and they stare at each other for a long moment. With immense effort, Neff stands up, swaying slightly, his face covered in sweat and his ankle bleeding. He is on the verge of collapse but manages to stagger towards the gate, holding himself upright with great effort. Upon reaching the gate, he twists the latch and drags it open, then turns to look back at Keyes' implacable face."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Phyllis' shot did miss Neff, and he notices this as he glances at the dust on his fingers with a calm expression. He lazily enters the room the same way he came and enters the house, swinging the front door with his right hand while his left arm dangles. Neff hops a few steps down the walk before noticing someone arriving, prompting him to skip behind a nearby palm tree. A man, Zachetti, glides up the steps towards the front door, but Neff whistles to him, causing Zachetti to pause and retreat slowly. Neff then pulls some loose change out of his pocket and tries to toss a nickel into Zachetti's handkerchief pocket, but Zachetti deflects his hand away and just gazes at him. Neff attempts again to fling the nickel into his pocket, and this time, Zachetti allows him to do so before drifting slowly past Neff. Neff then releases Zachetti and nudges him gently down the walk, observing as Zachetti disappears out of shot and the sound of his steps diminishes. Neff then sneaks through the shrubbery toward the side of the house where his car is stationed. Meanwhile, the desk lamp flickers while the dawn rises outside the windows. Neff, still holding onto the horn of the dictaphone, is very weary, and his voice is filled with fatigue. He abruptly halts his dictation, perceiving he is not alone in the room, and as he spins in his chair, the camera moves back to uncover the office door ajar. Keyes stands a few steps inside, with the night watchman and the colored janitor peeping curiously over Keyes’ shoulder. Keyes casually, without removing his eyes from Neff's face, reaches back and swings the door shut. Neff lays down the dictaphone horn and looks at Keyes with a faint, tired grin, speaking very slowly. Keyes drifts a few steps closer, gazing at Neff without reacting. Neff gestures towards the used cylinders on the desk, and they gaze at each other for a long moment. With immense effort, Neff rises up, teetering slightly, his face covered in sweat and his shoulder bleeding. He is on the brink of collapse but manages to lurch towards the door, holding himself steady with great effort. Upon reaching the door, he pushes the knob and swings it open, then turns to gaze back at Keyes' stoic face."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Margaret's violin did strike Thompson, and he realizes this as he looks at the coffee on his toes with a dazed expression. She quickly leaves the garden the way she came and exits the apartment, closing the garage door with her right elbow while her left shoe hangs limp. Thompson takes a few steps down the ladder before hearing someone approaching, prompting him to move behind a nearby bookshelf. A cat, Jennings, comes up the escalator towards the garage door, but Thompson calls to it, causing Jennings to turn and approach slowly. Thompson then takes some loose marbles out of his backpack and tries to drop a penny into Jennings' scarf pocket, but Jennings knocks his thumb away and just stares at it. Thompson attempts again to put the penny into its pocket, and this time, Jennings allows him to do so before going slowly past Thompson. Thompson then grabs Jennings and pushes it almost violently down the ladder, watching as Jennings goes out of shot and the sound of its steps fades away. Thompson then moves through the curtains toward the side of the apartment where his bicycle is parked. Meanwhile, the flower pot remains lit while the dawn breaks outside the curtains. Thompson, still clutching the beak of the typewriter, is very weak, and his voice is filled with exhaustion. He suddenly stops his typing, sensing he is not alone in the kitchen, and as he turns in his stool, the bookshelf pulls back to reveal the basement door wide open. Fergus stands a few steps inside, with the librarian and the striped baker peering curiously over Fergus’ shoulder. Fergus slowly, without taking his eyes off Thompson's ankle, reaches back and shuts the door. Thompson hangs up the typewriter beak and looks at Fergus with a faint, tired grin, speaking very slowly. Fergus moves a few steps closer, staring at Thompson without responding. Thompson indicates the used violins on the bookshelf, and they stare at each other for a long moment. With immense effort, Thompson stands up, swaying slightly, his ankle covered in steam and his elbow bleeding. He is on the verge of collapse but manages to stagger towards the basement door, holding himself upright with great effort. Upon reaching the basement door, he twists the paperclip and drags it open, then turns to look back at Fergus' implacable elbow."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Matilda's arrow did miss Jensen, and she discovers this as she gazes at the ink on her toes with a puzzled expression. She slowly enters the hallway the way she left and enters the garden, swinging the gate with her left foot while her right leg dangles loose. Jensen takes a few hops down the patio before seeing someone departing, prompting him to duck behind a nearby rose bush. A woman, Marlowe, comes down the trail towards the garden gate, but Jensen whistles to her, causing Marlowe to pause and meander quickly. Jensen then pulls some marbles out of his pocket and attempts to fling a marble into Marlowe's hatband, but Marlowe brushes his arm away and just frowns at him. Jensen attempts once more to toss the marble into her hatband, and this time, Marlowe allows him to succeed before hurrying rapidly past Jensen. Jensen then nudges Marlowe and shoves her almost gently up the patio, observing as Marlowe moves out of vision and the sound of her footsteps increases. Jensen then strolls through the roses toward the back of the garden where his bicycle is leaning. Meanwhile, the ceiling fan stays on while the moon sets outside the windows. Jensen, still gripping the side of the typewriter, is quite energetic, and his eyes are filled with anticipation. He suddenly starts his dictation, sensing he is not alone outdoors, and as he glances from his hammock, the camera zooms in to reveal the garden gate slightly ajar. Grayson stands a few strides outside, with the morning courier and the nosy neighbor whispering secretly near Grayson’s side. Grayson rapidly, without taking her gaze off Jensen's nose, closes in and opens the gate. Jensen puts down the typewriter horn and laughs at Grayson with a broad, exciting grin, speaking quite rapidly. Grayson steps a few inches closer, glaring at Jensen without noticing. Jensen gestures to the shiny trophies on the bench, and they smile at each other for a brief moment. With boundless strength, Jensen jumps up, balancing unnervingly, his hands covered in paint and his elbow shaking. He is on the brink of enthusiasm but manages to romp towards the fence, balancing himself swiftly with little strain. Upon reaching the fence, he lifts the latch and swings it closed, then turns to wave back at Grayson’s delighted expression."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Phyllis' toss did strike Neff, and he notices this as he glances at the paint on his palm with a bewildered look. He hurriedly enters the hallway the way he came and enters the shed, swinging the side gate with his left foot while his right leg hangs loose. Neff marches a few strides down the path before overhearing someone singing, prompting him to slip behind a nearby lamppost. A man, Zachetti, steps down the ladder toward the back gate, but Neff whispers to him, causing Zachetti to pivot and wander leisurely. Neff then pulls some paperclips out of his bag and attempts to toss a penny into Zachetti's jacket collar, but Zachetti swats his wrist away and simply glares at him. Neff tries once more to drop the penny into his necktie, and this time, Zachetti lets him proceed before strolling briskly past Neff. Neff then seizes Zachetti and nudges him almost gracefully up the path, observing as Zachetti disappears from view and the echo of his steps dwindles. Neff then slides through the hedges toward the rear of the barn where his scooter is parked. Meanwhile, the flashlight remains shining while the dusk settles outside the curtains. Neff, still gripping the mouthpiece of the gramophone, is very feeble, and his tone is filled with weariness. He abruptly halts his recording, sensing he is not alone in the attic, and as he spins in his stool, the camera zooms back to reveal the hatch wide open. Keyes stands a few strides inside, with the security officer and the elderly gardener peeking curiously over Keyes’ arm. Keyes slowly, without diverting his gaze from Neff's eyes, reaches back and latches the hatch. Neff places the gramophone mouthpiece down and gazes at Keyes with a faint, weary smirk, speaking very softly. Keyes inches a few paces forward, gazing at Neff without speaking. Neff gestures toward the empty jars on the bench, and they lock eyes for a prolonged instant. With tremendous exertion, Neff rises up, teetering slightly, his face beaded in moisture and his forearm dripping. He is on the brink of fainting but manages to hobble toward the hatch, balancing himself with immense effort. Upon arriving at the hatch, he turns the handle and pulls it shut, then spins to glance back at Keyes' unyielding visage."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Agnes' arrow did miss Tripp, and she realizes this as she glances at the juice on her toes with a bewildered expression. She slowly enters the tunnel the way she exited and enters the barn, opening the attic trapdoor with her left foot while her right leg dangles heavy. Tripp hops a few jumps up the stairs before spotting somebody flying, prompting him to hide behind a distant oak bench. A parrot, Vinnie, floats down the slide towards the attic trapdoor, but Tripp whispers to it, causing Vinnie to alight and glide swiftly. Tripp then fishes out some paperclips from his backpack and attempts to toss a dime into Vinnie's glove compartment, but Vinnie swats his foot away and just glares at her. Tripp tries again to slot the dime into the compartment, and this instance, Vinnie permits her to succeed before flying quickly over Tripp. Tripp then clutches Vinnie and flings it almost delicately up the stairs, watching as Vinnie drifts out of sight and the flutter of its wings vanishes. Tripp then wanders through the brambles toward the back of the barn where her bicycle is perched. Meanwhile, the floor lamp stays off while the dusk erupts inside the walls. Tripp, still gripping the tail of the megaphone, is very energetic, and her voice is laced with enthusiasm. She suddenly resumes her speech, suspecting she is accompanied in the barn, and as she spins in her seat, the screen zooms forward to disclose the workshop entrance wide shut. Janus stands a few jumps outside, with the day gardener and the spotted dancer leaning eagerly under Janus’ elbow. Janus quickly, without averting her gaze from Tripp's feet, gestures forward and opens the entrance. Tripp sets down the megaphone tail and gazes at Janus with a bright, lively frown, chatting very quickly. Janus steps a few hops backward, glaring at Tripp without reacting. Tripp points to the blank canvases on the wall, and they glare at each other for a brief second. With little effort, Tripp sits down, swaying slightly, her feet drenched in lava and her elbow trembling. She is far from exhaustion and manages to leap towards the entrance, holding herself airborne with no effort. Upon reaching the entrance, she slams the latch and yanks it shut, then spins to glance forward at Janus' cheerful eyes."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Neff realizes Phyllis' shot hit him as he sees blood on his fingers. Dazed, he exits her house, his arm limp, and hides behind a palm tree upon hearing footsteps. Zachetti approaches, and Neff calls to him, attempting to place a nickel in Zachetti's pocket. After initial resistance, Zachetti allows it and walks past. Neff then forcibly pushes him down the walk. Neff moves through the shrubbery to his car. In his office, Neff, weak and exhausted, stops dictating as he senses someone. The camera reveals Keyes in the doorway, with others peering over his shoulder. Keyes shuts the door, and Neff, grinning faintly, indicates the used cylinders. They exchange a long look. Despite being on the brink of collapse, Neff stands, sways, and heads to the door. Reaching it, he opens it and looks back at Keyes' implacable face."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Upon reaching the door he twists the knob and drags it open then turns to look back at Keyes' implacable face He is on the verge of collapse but manages to stagger towards the door holding himself upright with great effort With immense effort Neff stands up swaying slightly his face covered in sweat and his shoulder bleeding Neff indicates the used cylinders on the desk and they stare at each other for a long moment Keyes moves a few steps closer staring at Neff without responding Neff hangs up the dictaphone horn and looks at Keyes with a faint tired grin speaking very slowly Neff's face reaches back and shuts the door Keyes slowly without taking his eyes off Keyes stands a few steps inside with the night watchman and the colored janitor peering curiously over Keyes’ shoulder he is not alone in the room and as he turns in his chair the camera pulls back to reveal the office door wide open He suddenly stops his dictation sensing Neff still clutching the horn of the dictaphone is very weak and his voice is filled with exhaustion Meanwhile the desk lamp remains lit while the dawn breaks outside the windows Neff then moves through the shrubbery toward the side of the house where his car is parked Neff then grabs Zachetti and pushes him almost violently down the walk watching as Zachetti goes out of shot and the sound of his steps fades away Neff attempts again to put the nickel into his pocket and this time Zachetti allows him to do so before going slowly past Neff Neff then takes some loose change out of his pocket and tries to drop a nickel into Zachetti's handkerchief pocket but Zachetti knocks his hand away and just stares at him A man Zachetti comes up the steps towards the front door but Neff calls to him causing Zachetti to turn and approach slowly Neff takes a few steps down the walk before hearing someone approaching prompting him to move behind a nearby palm tree He quickly leaves the room the way he came and exits the house closing the front door with his right hand while his left arm hangs limp Phyllis' shot did hit Neff and he realizes this as he looks at the blood on his fingers with a dazed expression"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He is on the verge of collapse but manages to stagger towards the door holding himself upright with great effort Neff attempts again to put the nickel into his pocket and this time Zachetti allows him to do so before going slowly past Neff Neff's face reaches back and shuts the door Neff then takes some loose change out of his pocket and tries to drop a nickel into Zachetti's handkerchief pocket but Zachetti knocks his hand away and just stares at him Neff still clutching the horn of the dictaphone is very weak and his voice is filled with exhaustion Keyes slowly without taking his eyes off Neff hangs up the dictaphone horn and looks at Keyes with a faint tired grin speaking very slowly With immense effort Neff stands up swaying slightly his face covered in sweat and his shoulder bleeding Neff then grabs Zachetti and pushes him almost violently down the walk watching as Zachetti goes out of shot and the sound of his steps fades away Keyes stands a few steps inside with the night watchman and the colored janitor peering curiously over Keyes’ shoulder Neff indicates the used cylinders on the desk and they stare at each other for a long moment He suddenly stops his dictation sensing He quickly leaves the room the way he came and exits the house closing the front door with his right hand while his left arm hangs limp he is not alone in the room and as he turns in his chair the camera pulls back to reveal the office door wide open Neff takes a few steps down the walk before hearing someone approaching prompting him to move behind a nearby palm tree Keyes moves a few steps closer staring at Neff without responding Neff then moves through the shrubbery toward the side of the house where his car is parked Meanwhile the desk lamp remains lit while the dawn breaks outside the windows Phyllis' shot did hit Neff and he realizes this as he looks at the blood on his fingers with a dazed expression A man Zachetti comes up the steps towards the front door but Neff calls to him causing Zachetti to turn and approach slowly Upon reaching the door he twists the knob and drags it open then turns to look back at Keyes' implacable face"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "he is not alone in the room and as he turns in his chair the camera pulls back to reveal the office door wide open Keyes stands a few steps inside with the night watchman and the colored janitor peering curiously over Keyes’ shoulder Keyes slowly without taking his eyes off Neff's face reaches back and shuts the door Neff hangs up the dictaphone horn and looks at Keyes with a faint tired grin speaking very slowly Keyes moves a few steps closer staring at Neff without responding Neff indicates the used cylinders on the desk and they stare at each other for a long moment With immense effort Neff stands up swaying slightly his face covered in sweat and his shoulder bleeding He is on the verge of collapse but manages to stagger towards the door holding himself upright with great effort Upon reaching the door he twists the knob and drags it open then turns to look back at Keyes' implacable face Phyllis' shot did hit Neff and he realizes this as he looks at the blood on his fingers with a dazed expression He quickly leaves the room the way he came and exits the house closing the front door with his right hand while his left arm hangs limp Neff takes a few steps down the walk before hearing someone approaching prompting him to move behind a nearby palm tree A man Zachetti comes up the steps towards the front door but Neff calls to him causing Zachetti to turn and approach slowly Neff then takes some loose change out of his pocket and tries to drop a nickel into Zachetti's handkerchief pocket but Zachetti knocks his hand away and just stares at him Neff attempts again to put the nickel into his pocket and this time Zachetti allows him to do so before going slowly past Neff Neff then grabs Zachetti and pushes him almost violently down the walk watching as Zachetti goes out of shot and the sound of his steps fades away Neff then moves through the shrubbery toward the side of the house where his car is parked Meanwhile the desk lamp remains lit while the dawn breaks outside the windows Neff still clutching the horn of the dictaphone is very weak and his voice is filled with exhaustion He suddenly stops his dictation sensing"
        }
      ]
    }
  ]
}