{
  "ground_truth": "He looks around the beach at the other owners with their dogs on leashes. He unclips the leash and Marley bounds down to the water. Other owners look at John, and with a smile, the tanned bikini beauty unclips the leash on her pet boxer. Others follow suit and a huge Rottweiler charges into the surf. John grins as the dogs play together in the shallows and more join the fun. An owner throws a Frisbee for his border collie. John grins as the dogs splash around. Bikini girl looks concerned. Marley is circling in the shallows, preparing to poop. Other owners watch in horror. The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley. The big man summons the Rottweiler and a police 4x4 noses onto the beach. The officers, in shorts and ball caps, get out of the vehicle. At night, John arrives home in the Volvo with Marley. Marley and John enter the darkened house. Grinning with embarrassed delight, John scoops up Connor as his two boys run forward to greet him. Jenny comes forward, holding Colleen and kisses him and brings in a huge square cake covered in candles. Marley immediately puts his paws on the table and starts eating the cake. The pool is covered with floating flower candles. John feeds Marley cake. She takes off her dress and grins, naked, in front of him. He grins as she takes a running jump into the pool. He unbuttons his shirt. He cannonballs in, surfaces and swims towards her. As they cuddle naked, Marley swims past. John's putting items from his desk into a box. He hefts the box under his arm and walks towards Arnie, who's standing outside his office. He pats Arnie on the shoulder and the older man leans forward and gives him a half hug. John walks away, grinning. Their people carrier drives through green fields and lush woodland. Marley is leaning out of the window as the Grogans drive down a country road. Marley bounds up the steps to the large stone-built house and headbutts a stone bird table. He knocked the table off the porch. John's at his desk in the cavernous offices of the Philadelphia Inquirer daily news. John joins the kids and Marley at the bedroom window. Huge garden is covered in snow. They all pile outside wrapped up for the cold. A snowball fight starts, then Jenny and John pull the children on a sledge while Marley trots alongside. Little Colleen falls off. Marley attacks their snowman. John looks at his wife, then they smile and hug. John walks upstairs and switches off the lights. He looks in on sleeping Colleen, then checks on the boys in their bunks.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He observes around the shore at the other proprietors with their canines on tethers. He detaches the tether and Marley leaps down to the sea. Other proprietors gaze at John, and with a grin, the bronzed swimsuit beauty detaches the tether on her pet boxer. Others follow similarly and a vast Rottweiler rushes into the waves. John smiles as the canines frolic together in the shallows and more join the merriment. An proprietor tosses a disc for his border collie. John smiles as the canines splash about. Swimsuit girl appears worried. Marley is circling in the shallows, preparing to defecate. Other proprietors observe in fright. The large Rottweiler owner shuts his eyes in stunned incredulity as John lunges for Marley. The large man calls the Rottweiler and a police 4x4 noses onto the shore. The officers, in shorts and ball caps, get out of the vehicle. At night, John arrives home in the Volvo with Marley. Marley and John enter the darkened abode. Smiling with self-conscious joy, John lifts up Connor as his two boys rush forward to greet him. Jenny comes forward, holding Colleen and kisses him and brings in a huge square confection covered in candles. Marley immediately places his paws on the table and starts consuming the confection. The pool is covered with floating flower candles. John feeds Marley confection. She removes her dress and smiles, unclothed, in front of him. He smiles as she takes a running leap into the pool. He unfastens his shirt. He cannonballs in, emerges and swims towards her. As they cuddle unclothed, Marley swims past. John's putting pieces from his desk into a box. He hefts the box under his arm and walks towards Arnie, who's standing outside his office. He pats Arnie on the shoulder and the older man leans forward and gives him a half embrace. John walks away, smiling. Their people carrier drives through verdant fields and lush woodland. Marley is leaning out of the window as the Grogans drive down a rural road. Marley leaps up the steps to the large stone-built dwelling and headbutts a stone bird stand. He knocked the stand off the porch. John's at his desk in the cavernous offices of the Philadelphia Inquirer daily news. John joins the children and Marley at the bedroom window. Huge garden is covered in frost. They all pile outside wrapped up for the cold. A snowball skirmish starts, then Jenny and John pull the children on a toboggan while Marley trots alongside. Little Colleen tumbles off. Marley attacks their snowman. John gazes at his spouse, then they smile and embrace. John walks upstairs and switches off the lights. He looks in on slumbering Colleen, then checks on the boys in their bunks."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He looks around the beach at the other owners with their dogs on leashes. The leash is unclipped by him and Marley bounds down to the water. John is looked at by other owners, and with a smile, the tanned bikini beauty unclipped the leash on her pet boxer. The suit is followed by others and a huge Rottweiler charges into the surf. The dogs are watched by John as they play together in the shallows and more join the fun. A Frisbee is thrown by an owner for his border collie. The dogs are watched by John as they splash around. Concern is shown by Bikini girl. Marley is circling in the shallows, preparing to poop. Horror is felt by the other owners as they watch. The big Rottweiler owner closes his eyes in shocked disbelief as Marley is lunged at by John. The Rottweiler is summoned by the big man and a police 4x4 noses onto the beach. The vehicle is exited by officers, in shorts and ball caps. At night, home is arrived at by John in the Volvo with Marley. The darkened house is entered by Marley and John. Grinning with embarrassed delight, Connor is scooped up by John as his two boys run forward to greet him. Jenny, holding Colleen, comes forward and kisses him and brings in a huge square cake covered in candles. Marley immediately puts his paws on the table and starts eating the cake. Floating flower candles cover the pool. Cake is fed to Marley by John. Her dress is taken off, and grinning, naked, in front of him stands she. As she takes a running jump into the pool, he grins. His shirt is unbuttoned by him. A cannonball is made by him into the pool; he surfaces and swims towards her. As they cuddle naked, Marley swims past. Items from his desk are being put by John into a box. The box is hefted under his arm and Arnie, who's standing outside his office, is walked towards by him. Arnie is patted on the shoulder by him and a half hug is given to him by the older man, who leans forward. Away walks John, grinning. Through green fields and lush woodland drives their people carrier. Marley leans out of the window as the country road is driven down by the Grogans. Marley bounds up the steps to the large stone-built house and a stone bird table is headbutted by him. The table was knocked off the porch by him. John's at his desk in the cavernous offices of the Philadelphia Inquirer daily news. The kids and Marley are joined by John at the bedroom window. Huge garden is covered in snow. Outside, wrapped up for the cold, they all pile. A snowball fight starts, then the children on a sledge are pulled by Jenny and John while Marley trots alongside. Little Colleen falls off. Their snowman is attacked by Marley. John's wife is looked at by him, then a smile and hug are shared by them. Upstairs walks John and the lights are switched off. Sleeping Colleen is looked in on by him, then the boys in their bunks are checked on."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "John observes other dog owners on the beach. He releases Marley, who dashes to the water. A bikini-clad woman smiles and unleashes her boxer, prompting others to follow. A Rottweiler charges into the surf. John grins as the dogs play. An owner throws a Frisbee for his border collie. Bikini girl looks worried as Marley circles to poop. Owners watch in horror. The Rottweiler's owner closes his eyes as John lunges for Marley. A police 4x4 arrives. Officers in shorts and caps exit the vehicle. At night, John returns home with Marley. In the dark house, John joyfully greets his kids. Jenny, holding Colleen, kisses him and presents a cake. Marley jumps on the table and eats it. The pool is adorned with floating candles. John feeds Marley cake. Jenny disrobes and jumps into the pool. John follows, cannonballing in. They cuddle as Marley swims by. John packs his desk into a box, pats Arnie on the shoulder, and leaves, grinning. The family drives through fields and woodland, Marley leaning out the window. Marley bounds up to their stone house, knocking over a bird table. At the Philadelphia Inquirer, John joins his kids and Marley at the window, overlooking a snowy garden. They head outside for a snowball fight. Jenny and John pull the kids on a sledge, with Marley trotting alongside. Colleen falls off, and Marley attacks the snowman. John and Jenny smile and hug. John checks on sleeping Colleen and the boys before turning off the lights."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He observes other dog owners on the beach. Unleashing Marley, the dog races to the water. A bikini-clad woman smiles and unleashes her boxer, followed by others, including a Rottweiler. John grins as the dogs play. A border collie chases a Frisbee. Bikini girl looks worried as Marley prepares to poop. Owners watch in horror. The Rottweiler's owner is shocked as John lunges for Marley. A police 4x4 arrives. At night, John returns home with Marley. They enter the dark house, and John, grinning, greets his kids. Jenny kisses him, holding Colleen, and presents a cake. Marley eats the cake. She undresses and jumps into the pool. John follows, and they cuddle as Marley swims by. John packs his desk, hugs Arnie, and leaves grinning. Their car drives through fields. Marley knocks over a bird table at their new stone house. At the Philadelphia Inquirer, John joins his family at the window. They play in the snow, pulling a sledge. Colleen falls, and Marley attacks the snowman. John and Jenny smile and hug. John checks on the sleeping kids and turns off the lights."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He takes a moment to survey the lively beach scene, observing the other dog owners who are scattered along the sandy shore, each with their dogs securely fastened on leashes. With a decisive motion, he unclips the leash from Marley, who eagerly bounds down the beach towards the inviting water. As Marley makes his way to the surf, other dog owners cast glances in John's direction. Among them, a tanned beauty in a bikini, with a friendly smile, follows John's lead and unclips the leash from her energetic pet boxer. Inspired by this, more owners decide to do the same, and soon a large Rottweiler charges enthusiastically into the waves. John can't help but grin as he watches the dogs joyfully play together in the shallow waters, with more dogs joining in the fun-filled frolic. An owner nearby throws a Frisbee, which his agile border collie eagerly chases. John continues to grin, enjoying the sight of the dogs splashing around in the water. However, the bikini-clad girl suddenly looks concerned. Marley is circling in the shallows, clearly preparing to relieve himself. The other owners watch in horror at the unfolding scene. The owner of the big Rottweiler closes his eyes, unable to believe what he is witnessing, as John quickly lunges towards Marley. Meanwhile, the large man calls his Rottweiler back, just as a police 4x4 vehicle makes its way onto the beach. The officers, dressed casually in shorts and ball caps, step out of the vehicle to assess the situation.\n\nLater that night, John arrives home in his trusty Volvo with Marley by his side. Together, they enter the dimly lit house. With a grin of embarrassed delight, John scoops up Connor as his two boys eagerly run forward to greet him. Jenny approaches, holding little Colleen, and kisses John warmly. She then brings in a large, square cake adorned with a multitude of candles. Without hesitation, Marley places his paws on the table and begins to devour the cake. The pool outside is beautifully decorated with floating flower candles. John feeds Marley some cake, and Jenny, with a playful grin, removes her dress and stands naked in front of him. She then takes a running leap into the pool. John, grinning, unbuttons his shirt and follows her with a cannonball dive. He surfaces and swims towards her, and as they cuddle together in the water, Marley swims past them.\n\nIn another scene, John is seen placing items from his desk into a box. He hefts the box under his arm and walks towards Arnie, who is standing just outside his office. John gives Arnie a friendly pat on the shoulder, and the older man leans forward to offer a half hug. With a grin, John walks away. Their family vehicle, a people carrier, drives through picturesque green fields and lush woodland. Marley leans out of the window, enjoying the breeze as the Grogans travel down a scenic country road. Marley eagerly bounds up the steps to their large, stone-built house and accidentally headbutts a stone bird table, knocking it off the porch.\n\nJohn is later seen at his desk in the expansive offices of the Philadelphia Inquirer daily news. He joins the kids and Marley at the bedroom window, where they gaze out at the huge garden now blanketed in snow. They all bundle up in warm clothes and head outside to enjoy the winter wonderland. A playful snowball fight ensues, and then Jenny and John take turns pulling the children on a sledge, with Marley happily trotting alongside. Little Colleen takes a tumble off the sledge, and Marley playfully attacks their snowman. John exchanges a loving look with his wife, and they share a warm hug. As the day winds down, John walks upstairs and switches off the lights. He checks in on sleeping Colleen and then looks in on the boys, who are snug in their bunks."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He pauses for a brief moment to take in the bustling and lively beach scene before him. As he surveys the vibrant surroundings, he observes the other dog owners who are scattered along the expansive sandy shore. Each of these individuals stands with their dogs securely fastened on leashes, exchanging smiles and small talk. With a decisive and purposeful motion, he unclips the leash from Marley, who eagerly and energetically bounds down the beach towards the inviting, glistening water. As Marley makes his way enthusiastically to the surf, other dog owners cast curious glances in John's direction. Among them is a tanned beauty clad in a bikini, who, with a friendly and inviting smile, follows John's lead by unfastening the leash from her own energetic pet boxer. Inspired by this act, more owners decide to do the same, and soon a large Rottweiler charges enthusiastically into the refreshing waves. John can't help but grin widely as he watches the dogs joyfully playing together in the shallow waters. More dogs eagerly join in the fun-filled frolic, creating a heartwarming sight. An owner nearby throws a Frisbee, which his agile border collie eagerly chases. John continues to grin, thoroughly enjoying the spectacle of the dogs splashing around gleefully in the water. However, the bikini-clad girl suddenly looks concerned and distressed. Marley is circling in the shallows, clearly preparing to relieve himself, to the horror of the onlookers. The other owners watch in horror at the unfolding scene. The owner of the big Rottweiler closes his eyes, unable to believe what he is witnessing, as John quickly lunges towards Marley. Meanwhile, the large man calls his Rottweiler back, just as a police 4x4 vehicle makes its way onto the bustling beach. The officers, dressed casually in shorts and ball caps, step out of the vehicle to assess the situation.\n\nLater that night, John arrives home in his trusty Volvo with Marley faithfully by his side. Together, they enter the dimly lit house, greeted by an atmosphere of warmth and family. With a grin of embarrassed delight, John scoops up Connor, as his two boys eagerly run forward to greet him with open arms. Jenny, holding little Colleen, approaches and kisses John warmly, her affection evident. She then brings in a large, square cake adorned with a multitude of colorful candles. Without any hesitation, Marley places his paws on the table, eagerly beginning to devour the cake. The pool outside is beautifully decorated with floating flower candles, adding a serene ambiance to the evening. John feeds Marley some cake, and Jenny, wearing a playful grin, removes her dress and stands confidently naked in front of him. She then takes a running leap into the inviting pool. John, grinning with joy, unbuttons his shirt and, with a playful cannonball dive, follows her into the water. He surfaces and begins to swim towards her, and as they cuddle together intimately in the water, Marley swims past them, joining in the fun.\n\nIn another scene, John is seen meticulously placing items from his desk into a cardboard box, preparing for a change. He hefts the box under his arm and walks towards Arnie, who is standing just outside his office. John gives Arnie a friendly pat on the shoulder, and the older man leans forward to offer a half hug and words of farewell. With a grin and a sense of anticipation, John walks away. Their family vehicle, a comfortable people carrier, drives through picturesque green fields and lush woodland, painting a scene of tranquility. Marley leans out of the window, joyfully enjoying the breeze as the Grogan family travels down a scenic country road. Marley eagerly bounds up the steps to their large, stone-built house, brimming with excitement, only to accidentally headbutt a stone bird table, knocking it off the porch.\n\nLater, John is seen diligently working at his desk in the expansive offices of the Philadelphia Inquirer daily news, a place bustling with activity and purpose. He joins the kids and Marley at the bedroom window, where they gaze out with wonder at the huge garden now completely blanketed in a pristine layer of snow. Together, they all bundle up in warm clothes and step outside to enjoy the enchanting winter wonderland. A playful snowball fight ensues, filling the air with laughter, and then Jenny and John take turns pulling the children on a sledge, with Marley happily trotting alongside them. Little Colleen takes a tumble off the sledge, and Marley playfully attacks their snowman, adding to the delight of the day. John exchanges a loving look with his wife, and they share a warm and comforting hug, savoring the day's joys. As the day winds down, John walks upstairs and thoughtfully switches off the lights, ensuring the house is peaceful. He checks in on sleeping Colleen and then looks in on the boys, who are snug and secure in their bunks, content and at rest."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He surveys the beach, taking in the sight of other dog owners with their pets securely fastened on leashes. With a deliberate motion, he unclips the leash from Marley, who immediately springs into action, bounding energetically down towards the inviting water. As Marley makes his way to the surf, other owners cast glances in John's direction, and among them, a tanned beauty in a bikini returns his look with a smile before she, too, unclips the leash from her pet boxer. This act seems to set off a chain reaction, as more owners follow suit, and soon a massive Rottweiler charges enthusiastically into the surf. John watches with a grin as the dogs frolic together in the shallows, their numbers growing as more join in the playful scene. An owner nearby decides to add to the excitement by throwing a Frisbee for his eager border collie. John's grin widens as he observes the dogs splashing around joyfully. However, the bikini-clad girl suddenly appears concerned as Marley begins circling in the shallows, clearly preparing to relieve himself. The other owners, noticing this, watch in horror, and the owner of the large Rottweiler closes his eyes in shocked disbelief. In a swift reaction, John lunges towards Marley, attempting to prevent any mishap. Meanwhile, the big man calls his Rottweiler back, and just then, a police 4x4 makes its way onto the beach. The officers, dressed casually in shorts and ball caps, step out of the vehicle, surveying the scene. Later that night, John arrives home in his Volvo with Marley by his side. Together, they enter the dimly lit house, where John, grinning with a mix of embarrassment and delight, scoops up Connor as his two boys rush forward to greet him. Jenny approaches, holding Colleen, and kisses John before presenting a large square cake adorned with candles. Marley, unable to resist, immediately places his paws on the table and begins devouring the cake. Outside, the pool is beautifully decorated with floating flower candles. John indulges Marley with more cake, and in a playful moment, Jenny removes her dress, grinning as she stands naked before him. With a shared grin, she takes a running leap into the pool. John, not to be outdone, unbuttons his shirt and follows suit, executing a cannonball into the water. He surfaces and swims towards her, and as they embrace, Marley swims past them. In another scene, John is seen placing items from his desk into a box, which he then hefts under his arm. He walks towards Arnie, who stands outside his office, and gives him a friendly pat on the shoulder. Arnie, the older man, leans in for a half hug, and John walks away, grinning. Their people carrier is then seen driving through picturesque green fields and lush woodland, with Marley joyfully leaning out of the window as the Grogans travel down a country road. Upon arrival, Marley bounds up the steps to a large stone-built house and, in his excitement, headbutts a stone bird table, knocking it off the porch. John is later at his desk in the expansive offices of the Philadelphia Inquirer daily news. He joins the kids and Marley at the bedroom window, where they gaze out at the huge garden blanketed in snow. They all bundle up for the cold and head outside, where a lively snowball fight ensues. Jenny and John then take turns pulling the children on a sledge, with Marley trotting happily alongside. Little Colleen tumbles off the sledge, and Marley, in his playful manner, attacks their snowman. John exchanges a look with his wife, and they share a smile and a hug. As the day winds down, John walks upstairs, switching off the lights as he goes. He pauses to look in on sleeping Colleen and then checks on the boys in their bunks, ensuring all is well before retiring for the night."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "John observes other dog owners on the beach before unclipping Marley's leash, allowing him to dash to the water. Inspired by John's actions, a tanned woman and other owners release their dogs, leading to a playful scene in the surf. As the dogs frolic, John notices Marley preparing to poop, causing concern among the owners. A Rottweiler's owner calls his dog back as a police 4x4 arrives. Later, John returns home with Marley, greeted warmly by his family. Jenny presents a cake, which Marley eagerly begins to eat. After feeding Marley, John and Jenny enjoy a playful swim in the pool. The next day, John packs his desk at work, shares a farewell moment with Arnie, and leaves with a smile. The family drives through scenic countryside, with Marley excitedly leaning out the window. At their new stone-built house, Marley accidentally knocks over a bird table. In winter, John joins his family and Marley for a snowball fight and sledding in their snowy garden. Afterward, John checks on his sleeping children before turning off the lights for the night."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He looks around the beach at the other owners with their dogs on leashes, a popular local spot for pet owners to gather and socialize. He unclips the leash and Marley bounds down to the water, a Labrador known for its love of swimming. Other owners look at John, and with a smile, the tanned bikini beauty, a regular beachgoer named Stephanie, unclips the leash on her pet boxer named Bruno. Others follow suit and a huge Rottweiler, known for its intimidating size but gentle nature, charges into the surf. John grins as the dogs play together in the shallows and more join the fun, transforming the beach into a lively canine playground. An owner throws a Frisbee, a classic dog toy invented in the 1950s, for his border collie known for its agility and intelligence. John grins as the dogs splash around. Bikini girl looks concerned. Marley is circling in the shallows, preparing to poop. Other owners watch in horror, mindful of the beach's cleanliness rules. The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley. The big man summons the Rottweiler and a police 4x4, assigned to patrol the area for safety and order, noses onto the beach. The officers, in shorts and ball caps to match the casual beach environment, get out of the vehicle. At night, John arrives home in the Volvo, a reliable Swedish car known for its safety, with Marley. Marley and John enter the darkened house. Grinning with embarrassed delight, John scoops up Connor as his two boys run forward to greet him. Jenny, his wife who has an eye for festive details, comes forward holding Colleen and kisses him, then brings in a huge square cake covered in candles, a tradition for birthday celebrations in their family. Marley immediately puts his paws on the table and starts eating the cake. The pool is covered with floating flower candles, creating a romantic ambiance. John feeds Marley cake. She takes off her dress and grins, naked, in front of him. He grins as she takes a running jump into the pool, a spontaneous display of joy. He unbuttons his shirt. He cannonballs in, surfaces and swims towards her. As they cuddle naked, Marley swims past, ever the water-loving dog. John's putting items from his desk into a box, signaling a transition or new chapter in his career. He hefts the box under his arm and walks towards Arnie, his longtime mentor who's standing outside his office. He pats Arnie on the shoulder and the older man leans forward and gives him a half hug. John walks away, grinning with the satisfaction of a well-spent career. Their people carrier, a vehicle often used for family trips, drives through green fields and lush woodland, part of the scenic Pennsylvania countryside. Marley is leaning out of the window as the Grogans drive down a country road. Marley bounds up the steps to the large stone-built house, a charming historic home they've recently moved into, and headbutts a stone bird table. He knocked the table off the porch. John's at his desk in the cavernous offices of the Philadelphia Inquirer, a historic and respected daily news organization. John joins the kids and Marley at the bedroom window. The huge garden is covered in snow, creating a winter wonderland. They all pile outside wrapped up for the cold, prepared for an afternoon in the snow. A snowball fight starts, then Jenny and John pull the children on a sledge while Marley trots alongside, embodying the perfect family moment. Little Colleen falls off. Marley attacks their snowman. John looks at his wife, then they smile and hug, sharing a moment of contentment. John walks upstairs and switches off the lights. He looks in on sleeping Colleen, then checks on the boys in their bunks, ending the day with the comfort of his family's presence."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He looks around the beach at the other owners with their dogs on leashes  He unclips the leash and Marley bounds down to the water  Other owners look at John and with a smile the tanned bikini beauty unclips the leash on her pet boxer  Others follow suit and a huge Rottweiler charges into the surf  John grins as the dogs play together in the shallows and more join the fun  An owner throws a Frisbee for his border collie  John grins as the dogs splash around  She takes off her dress and grins naked in front of him  He grins as she takes a running jump into the pool  He unbuttons his shirt  He cannonballs in surfaces and swims towards her  As they cuddle naked Marley swims past John's putting items from his desk into a box  He hefts the box under his arm and walks towards Arnie who's standing outside his office  He pats Arnie on the shoulder and the older man leans forward and gives him a half hug  John walks away grinning  Their people carrier drives through green fields and lush woodland  Marley is leaning out of the window as the Grogans drive down a country road  Marley bounds up the steps to the large stonebuilt house and headbutts a stone bird table  He knocked the table off the porch  John's at his desk in the cavernous offices of the Philadelphia Inquirer  daily news  John joins the kids and Marley at the bedroom window  Huge garden is covered in snow  They all pile outside wrapped up for the cold  A snowball fight starts then  Jenny and John pull the children on a sledge while Marley trots alongside  Little Colleen falls off  Marley attacks their snowman  John looks at his wife then they smile and hug  John walks upstairs and switches off the lights  Bikini girl looks concerned  Marley is circling in the shallows preparing to poop  Other owners watch in horror  The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley  The big man summons the Rottweiler and a police 4x4 noses onto the beach  The officers in shorts and ball caps get out of the vehicle  At night John arrives home in the Volvo with Marley  Marley and John enter the darkened house  Grinning with embarrassed delight John scoops up Connor as his two boys run forward to greet him  Jenny comes forward holding Colleen and kisses him and brings in a huge square cake covered in candles  Marley immediately puts his paws on the table and starts eating the cake  The pool is covered with floating flower candles  John feeds Marley cake  She takes off her dress and grins naked in front of him  He grins as she takes a running jump into the pool  He unbuttons his shirt  He cannonballs in surfaces and swims towards her  As they cuddle naked Marley swims past John's putting items from his desk into a box  He hefts the box under his arm and walks towards Arnie who's standing outside his office  He pats Arnie on the shoulder and the older man leans forward and gives him a half hug  John walks away grinning  Their people carrier drives through green fields and lush woodland  Marley is leaning out of the window as the Grogans drive down a country road  Marley bounds up the steps to the large stonebuilt house and headbutts a stone bird table  He knocked the table off the porch  John's at his desk in the cavernous offices of the Philadelphia Inquirer  daily news  John joins the kids and Marley at the bedroom window  Huge garden is covered in snow  They all pile outside wrapped up for the cold  A snowball fight starts then  Jenny and John pull the children on a sledge while Marley trots alongside  Little Colleen falls off  Marley attacks their snowman  John looks at his wife then they smile and hug  John walks upstairs and switches off the lights  He looks in on sleeping  Colleen then checks on the boys in their bunks"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He looks around the beach at the other owners with their dogs on leashes. He unclips the leash and Marley bounds down to the water. Other owners look at John and with a smile the tanned bikini beauty unclips the leash on her pet boxer. Others follow suit and a huge Rottweiler charges into the surf. John grins as the dogs play together in the shallows and more join the fun. An owner throws a Frisbee for his border collie. John grins as the dogs splash around. Bikini girl looks concerned. Marley is circling in the shallows preparing to poop. Other owners watch in horror. The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley. The big man summons the Rottweiler and a police 4x4 noses onto the beach. The officers in shorts and ball caps get out of the vehicle. At night John arrives home in the Volvo with Marley. Marley and John enter the darkened house. Grinning with embarrassed delight John scoops up Connor as his two boys run forward to greet him. Jenny comes forward holding Colleen and kisses him and brings in a huge square cake covered in candles. Marley immediately puts his paws on the table and starts eating the cake. The pool is covered with floating flower candles. John feeds Marley cake. She takes off her dress and grins naked in front of him. He grins as she takes a running jump into the pool. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. He unbuttons his shirt. He cannonballs in surfaces and swims towards her. As they cuddle naked Marley swims past John's putting items from his desk into a box. He hefts the box under his arm and walks towards Arnie who is standing outside his office. He pats Arnie on the shoulder and the older man leans forward and gives him a half hug. John walks away grinning. Their people carrier drives through green fields and lush woodland. Marley is leaning out of the window as the Grogans drive down a country road. Marley bounds up the steps to the large stonebuilt house and headbutts a stone bird table. He knocked the table off the porch. John's at his desk in the cavernous offices of the Philadelphia Inquirer. daily news. John joins the kids and Marley at the bedroom window. Huge garden is covered in snow. They all pile outside wrapped up for the cold. A snowball fight starts then. Jenny and John pull the children on a sledge while Marley trots alongside. Little Colleen falls off. Marley attacks their snowman. John looks at his wife then they smile and hug. John walks upstairs and switches off the lights. He looks in on sleeping. Colleen then checks on the boys in their bunks."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He looks around the beach at the other owners with their dogs on leashes. He unclips the leash and Marley bounds down to the water. Other owners look at John and with a smile the tanned bikini beauty unclips the leash on her pet boxer. Others follow suit and a huge Rottweiler charges into the surf. John grins as the dogs play together in the shallows and more join the fun. An owner throws a Frisbee for his border collie. John grins as the dogs splash around. Bikini girl looks concerned. Marley is circling in the shallows preparing to poop. Other owners watch in horror. The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley. The big man summons the Rottweiler and a police 4x4 noses onto the beach. The officers in shorts and ball caps get out of the vehicle. At night John arrives home in the Volvo with Marley. Marley and John enter the darkened house. Grinning with embarrassed delight John scoops up Connor as his two boys run forward to greet him. Jenny comes forward holding Colleen and kisses him and brings in a huge square cake covered in candles. Marley immediately puts his paws on the table and starts eating the cake. The pool is covered with floating flower candles. John feeds Marley cake. She takes off her dress and grins naked in front of him. He grins as she takes a running jump into the pool. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. He unbuttons his shirt. He cannonballs in surfaces and swims towards her. As they cuddle naked Marley swims past John's putting items from his desk into a box. He hefts the box under his arm and walks towards Arnie who is standing outside his office. He pats Arnie on the shoulder and the older man leans forward and gives him a half hug. John walks away grinning. Their people carrier drives through green fields and lush woodland. Marley is leaning out of the window as the Grogans drive down a country road. Marley bounds up the steps to the large stonebuilt house and headbutts a stone bird table. He knocked the table off the porch. John's at his desk in the cavernous offices of the Philadelphia Inquirer. daily news. John joins the kids and Marley at the bedroom window. Huge garden is covered in snow. They all pile outside wrapped up for the cold. A snowball fight starts then. Jenny and John pull the children on a sledge while Marley trots alongside. Little Colleen falls off. Marley attacks their snowman. John looks at his wife then they smile and hug. John walks upstairs and switches off the lights. He looks in on sleeping. Colleen then checks on the boys in their bunks."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He looks around the beach at the other owners with their dogs on leashes. He unclips the leash and Marley bounds down to the water. Other owners look at John and with a smile the tanned bikini beauty unclips the leash on her pet boxer. Others follow suit and a huge Rottweiler charges into the surf. John grins as the dogs play together in the shallows and more join the fun. An owner throws a Frisbee for his border collie. John grins as the dogs splash around. Bikini girl looks concerned. Marley is circling in the shallows preparing to poop. Other owners watch in horror. The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley. daily news. John joins the kids and Marley at the bedroom window. Huge garden is covered in snow. They all pile outside wrapped up for the cold. A snowball fight starts then. Jenny and John pull the children on a sledge while Marley trots alongside. Little Colleen falls off. Marley attacks their snowman. John looks at his wife then they smile and hug. John walks upstairs and switches off the lights. He looks in on sleeping. Colleen then checks on the boys in their bunks."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He looks around the beach at the other owners with their dogs on leashes. He unclips the leash and Marley bounds down to the water. Other owners look at John and with a smile the tanned bikini beauty unclips the leash on her pet boxer. Others follow suit and a huge Rottweiler charges into the surf. Marley attacks their snowman. John looks at his wife then they smile and hug. John walks upstairs and switches off the lights. He looks in on sleeping. Colleen then checks on the boys in their bunks."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The cat looks around the beach at the other teachers with their dogs on leashes. The cat unclips the leash and Marley bounds down to the water. Other teachers look at the raccoon, and with a smile, the tanned bikini astronaut unclips the leash on her pet boxer. Others follow suit and a huge Rottweiler charges into the surf. The raccoon grins as the dogs play together in the shallows and more join the fun. A tree throws a Frisbee for his border collie. The raccoon grins as the dogs splash around. Bikini astronaut looks concerned. Marley is circling in the shallows, preparing to poop. Other teachers watch in horror. The big Rottweiler teacher closes his eyes in shocked disbelief as the raccoon lunges for Marley. The big man summons the Rottweiler and a police 4x4 noses onto the beach. The giraffes, in shorts and ball caps, get out of the vehicle. At night, the raccoon arrives home in the Volvo with Marley. Marley and the raccoon enter the darkened house. Grinning with embarrassed delight, the raccoon scoops up the dolphin as his two boys run forward to greet the raccoon. An elephant comes forward, holding Colleen and kisses the raccoon and brings in a huge square cake covered in candles. Marley immediately puts his paws on the table and starts eating the cake. The pool is covered with floating flower candles. The raccoon feeds Marley cake. The hawk takes off her dress and grins, naked, in front of the raccoon. The raccoon grins as the hawk takes a running jump into the pool. The cat unbuttons his shirt. The cat cannonballs in, surfaces and swims towards the hawk. As they cuddle naked, Marley swims past. The raccoon is putting items from his desk into a box. The raccoon hefts the box under his arm and walks towards a dragon, who's standing outside his office. The raccoon pats the dragon on the shoulder and the older dragon leans forward and gives the raccoon a half hug. The raccoon walks away, grinning. Their rhino drives through green fields and lush woodland. Marley is leaning out of the window as the penguins drive down a country road. Marley bounds up the steps to the large stone-built house and headbutts a stone bird table. Marley knocked the table off the porch. The raccoon is at his desk in the cavernous offices of the Philadelphia Inquirer daily news. The raccoon joins the kids and Marley at the bedroom window. Huge garden is covered in snow. They all pile outside wrapped up for the cold. A snowball fight starts, then an elephant and the raccoon pull the children on a sledge while Marley trots alongside. Little Colleen falls off. Marley attacks their snowman. The raccoon looks at his wife, then they smile and hug. The raccoon walks upstairs and switches off the lights. The raccoon looks in on sleeping Colleen, then checks on the boys in their bunks."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He looks around the forest at the other owners with their parrots on perches. He unclips the perch and Marley flutters down to the pond. Other owners look at John, and with a smile, the tanned sundress beauty unclips the perch on her pet ferret. Others follow suit and a huge iguana scurries into the water. John grins as the animals play together in the shallows and more join the fun. An owner throws a rubber ball for his llama. John grins as the animals splash around. Sundress girl looks concerned. Marley is circling in the shallows, preparing to poop. Other owners watch in horror. The big iguana owner closes his eyes in shocked disbelief as John lunges for Marley. The big man summons the iguana and a police motorcycle noses onto the forest path. The officers, in jeans and baseball helmets, get off the vehicle. At night, John arrives home in the pickup with Marley. Marley and John enter the darkened cabin. Grinning with embarrassed delight, John scoops up Connor as his two boys run forward to greet him. Jenny comes forward, holding Colleen and kisses him and brings in a huge round pie covered in candles. Marley immediately puts his paws on the table and starts eating the pie. The fireplace is covered with floating wooden sculptures. John feeds Marley pie. She takes off her cover-up and grins, naked, in front of him. He grins as she takes a running jump into the koi pond. He unbuttons his jacket. He cannonballs in, surfaces and swims towards her. As they cuddle naked, Marley swims past. John's putting items from his backpack into a crate. He hefts the crate under his arm and walks towards Arnie, who's standing outside his cabin. He pats Arnie on the shoulder and the older man leans forward and gives him a half hug. John walks away, grinning. Their convertible drives through golden deserts and sandy dunes. Marley is leaning out of the window as the Grogans drive down a desert road. Marley bounds up the steps to the large wooden-built house and headbutts a carved stone bust. He knocked the bust off the porch. John's at his desk in the cavernous offices of the New York Times daily news. John joins the kids and Marley at the attic window. Vast backyard is covered in leaves. They all pile outside wrapped up for the wind. A leaf fight starts, then Jenny and John pull the children on a wagon while Marley trots alongside. Little Colleen falls off. Marley attacks their leaf pile. John looks at his wife, then they smile and hug. John walks upstairs and switches off the lamps. He looks in on sleeping Colleen, then checks on the boys in their hammocks."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He scans the beach at the other owners with their dogs on leashes. He fastens the leash and Marley skips up to the water. Other owners nod at John, and with a grin, the tanned bikini beauty fastens the leash on her pet boxer. Others hesitate and a huge Rottweiler strolls into the surf. John chuckles as the dogs rest together in the shallows and more observe the fun. An owner hurls a Frisbee for his border collie. John laughs as the dogs wade around. Bikini girl looks intrigued. Marley is pacing in the shallows, preparing to nap. Other owners watch in curiosity. The big Rottweiler owner opens his eyes in amused surprise as John waves at Marley. The big man beckons the Rottweiler and a police 4x4 rolls onto the beach. The officers, in shorts and ball caps, climb back into the vehicle. At night, John departs home in the Volvo with Marley. Marley and John exit the darkened house. Smiling with amused delight, John lifts up Connor as his two boys march forward to greet him. Jenny steps back, holding Colleen, and hugs him and carries in a huge square cake covered in candies. Marley immediately places his paws on the chair and starts sniffing the cake. The pool is surrounded with floating flower candles. John shares Marley cake. She throws on her dress and smirks, clothed, in front of him. He frowns as she takes a slow walk into the pool. He buttons his shirt. He skydives in, lands, and swims away from her. As they drift clothed, Marley floats past. John's throwing items from his desk into a sack. He pushes the sack under his arm and rushes towards Arnie, who's sitting outside his office. He taps Arnie on the elbow and the older man leans back and offers him a high five. John sits down, frowning. Their people carrier stops through green fields and lush woodland. Marley is climbing out of the window as the Grogans arrive up a country road. Marley crawls up the steps to the large stone-built house and leans against a stone bird table. He nudged the table off the porch. John's at his desk in the tiny offices of the Philadelphia Inquirer daily news. John leaves the kids and Marley at the bedroom window. Huge garden is covered in leaves. They all rush inside wrapped up for the cold. A snowball fight ends, then Jenny and John push the children on a sledge while Marley dances alongside. Little Colleen holds on. Marley avoids their snowman. John gazes at his wife, then they frown and hug. John jogs downstairs and switches on the lights. He glances at sleeping Colleen, then glances at the boys in their bunks."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The mailbox looks around the airplane at the other cacti with their parrots on ladders. The mailbox unclips the ladder and Tulip bounds down to the fireplace. Other cacti look at Michael, and with a smile, the tanned penguin toaster unclips the ladder on her pet iguana. Others follow suit and a huge giraffe charges into the orchestra. Michael grins as the parrots play together in the shallows and more join the fun. A cactus throws a banana for his hamster. Michael grins as the parrots splash around. Penguin toaster looks concerned. Tulip is circling in the shallows, preparing to laugh. Other cacti watch in horror. The big giraffe cactus closes his eyes in shocked disbelief as Michael lunges for Tulip. The big ant summons the giraffe and a pirate 4x4 noses onto the airplane. The bakers, in shorts and ball caps, get out of the submarine. At night, Michael arrives home in the tractor with Tulip. Tulip and Michael enter the darkened tent. Grinning with embarrassed delight, Michael scoops up Oliver as his two trombones run forward to greet him. Emily comes forward, holding Samantha and kisses him and brings in a huge square pizza covered in buttons. Tulip immediately puts his paws on the trampoline and starts eating the pizza. The fountain is covered with floating cupcake stars. Michael feeds Tulip pizza. The mailbox takes off its scarf and grins, naked, in front of him. The mailbox grins as it takes a running jump into the fountain. The mailbox unbuttons its jacket. The mailbox cannonballs in, surfaces and swims towards the mailbox. As they cuddle naked, Tulip swims past. Michael's putting items from his drum into a basket. He hefts the basket under his foot and walks towards Felix, who's standing outside his zoo. He pats Felix on the elbow and the older piano leans forward and gives him a half hug. Michael walks away, grinning. Their concert hall drives through green fields and lush woodland. Tulip is leaning out of the window as the Marshalls drive down a country road. Tulip bounds up the steps to the large stone-built bookstore and headbutts a stone violin case. He knocked the case off the porch. Michael's at his drum in the cavernous spaces of the Philadelphia Inquirer daily zoo. Michael joins the trombones and Tulip at the bedroom drawer. Huge swing is covered in sand. They all pile outside wrapped up for the rain. A snowball laugh starts, then Emily and Michael pull the trombones on a sofa while Tulip trots alongside. Little Samantha falls off. Tulip attacks their iceberg. Michael looks at his guitar, then they smile and hug. Michael walks upstairs and switches off the songs. The desk looks in on sleeping Samantha, then checks on the trombones in their buckets."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The squirrel scans the forest at the other librarians with their cats on blankets. The squirrel fastens the hat and Whiskers scampers up to the tree. Other librarians glance at Gary, and with a chuckle, the freckled swimsuit lifeguard fastens the harness on their pet iguana. Others follow suit and a massive rabbit hops into the bush. Gary chuckles as the animals frolic together in the underbrush and more join the excitement. A librarian tosses a ball for their ferret. Gary chuckles as the animals leap around. Swimsuit lifeguard appears worried. Whiskers is hopping in the bush, preparing to nap. Other librarians stare in disgust. The massive rabbit librarian covers his face in bewildered amazement as Gary sprints for Whiskers. The tall woman signals the rabbit and a parade float ambles onto the forest edge. The performers, in jumpsuits and top hats, jump out of the vehicle. In the evening, Gary arrives home in the Jeep with Whiskers. Whiskers and Gary enter the dimly lit cabin. Smirking with sheepish amusement, Gary lifts up Alex as his two daughters rush forward to welcome him. Rachel steps forward, holding Clarissa and hugs him and carries in a massive circular pie adorned with sparklers. Whiskers instinctively places his paws on the countertop and begins devouring the pie. The pond is adorned with floating lily pads. Gary feeds Whiskers pie. She takes off her scarf and smirks, clothed, in front of him. He smirks as she takes a graceful dive into the pond. He removes his jacket. He belly flops in, surfaces and wades towards her. As they embrace clothed, Whiskers paddles past. Gary's placing files from his chair into a backpack. He balances the backpack on his shoulder and strides towards Betty, who's lounging outside his cubicle. He taps Betty on the wrist and the gentlewoman leans backward and gives him a slight wave. Gary strides away, smirking. Their station wagon cruises through dusty paths and barren desert. Whiskers is peering out of the sunroof as the Harrisons drive along a desert highway. Whiskers scurries up the ladder to the small wood-built cabin and nudges a wooden birdhouse. He pushed the birdhouse off the railing. Gary's at his lounge chair in the sparse rooms of the Boston Globe weekly magazine. Gary joins the daughters and Whiskers at the kitchen table. Vast yard is blanketed in leaves. They all pour outside bundled up for the wind. A leaf pile brawl ensues, then Rachel and Gary pull the daughters on a wagon while Whiskers trots nearby. Little Clarissa tumbles off. Whiskers dismantles their leaf pile. Gary glances at his husband, then they giggle and snuggle. Gary strolls downstairs and powers off the lanterns. He peeks in on slumbering Clarissa, then checks on the daughters in their cribs."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He scans the festival at the other participants with their parrots on perches. He detaches the perch and Marley glides down to the stage. Other participants glance at John, and with a wink, the freckled dress dancer detaches the perch on her pet rabbit. Others follow suit, and a massive tortoise lumbers into the spotlight. John chuckles as the animals prance together in the decorations and more join the spectacle. A participant tosses a rubber ball for his tabby cat. John chuckles as the animals glide around. Dress dancer looks worried. Marley is floating in the decorations, preparing to sing. Other participants watch in disbelief. The big tortoise handler shuts his eyes in astonished denial as John darts toward Marley. The large woman beckons the tortoise, and a golf cart glides onto the festival grounds. The organizers, in vests and straw hats, step out of the cart. At night, John arrives home in the tractor with Marley. Marley and John enter the dimly lit cottage. Smiling with awkward delight, John lifts Connor as his two boys rush forward to greet him. Jenny steps forward, holding Colleen, kisses him, and brings in a colossal rectangular pie covered in berries. Marley immediately places his paws on the counter and starts devouring the pie. The lawn is scattered with floating lanterns. John offers Marley pie. She takes off her shoes and smiles, barefoot, in front of him. He smiles as she takes a brisk leap into the fountain. He removes his tie. He belly flops in, emerges, and paddles toward her. As they embrace joyfully, Marley paddles by. John’s packing documents from his shelf into a crate. He lifts the crate onto his shoulder and strolls toward Arnie, who's standing outside his workspace. He taps Arnie on the elbow, and the older man leans down and gives him a light handshake. John strolls away, smiling. Their minivan rolls through golden fields and dense forests. Marley is leaning out of the sunroof as the Grogans coast along a rural trail. Marley scampers up the path to the large brick-built manor and bumps into a stone statue. He toppled the statue off the veranda. John's at his workstation in the vast offices of the Philadelphia Journal evening paper. John gathers with the kids and Marley at the attic skylight. Expansive backyard is blanketed in frost. They all bundle outside, wrapped up for the freeze. A pillow fight begins, then Jenny and John pull the children on a wagon while Marley ambles nearby. Little Colleen tumbles off. Marley dismantles their igloo. John glances at his wife, then they laugh and clench each other. John walks upstairs and dims the lights. He peeks in on snoozing Colleen, then checks on the boys in their hammocks."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat observes the orchard at the other gardeners with their rabbits on strings. The cat unties the string and Whiskers gallops down to the pond. Other gardeners glance at Mike, and with a smirk, the pale clown chef unties the string on her pet hamster. Others mimic the action and a massive elephant sprints into the stream. Mike chuckles as the rabbits frolic together in the puddles and more join the spectacle. A gardener flings a boomerang for his parrot. Mike chuckles as the rabbits splash around. Clown chef looks worried. Whiskers is spinning in the puddles, preparing to nap. Other gardeners watch in confusion. The massive elephant keeper closes his eyes in baffled disbelief as Mike dashes for Whiskers. The tall woman calls the elephant and a sheriff's buggy rolls onto the orchard. The deputies, in sandals and cowboy hats, step out of the transport. By dusk, Mike reaches home in the sedan with Whiskers. Whiskers and Mike wander into the dim barn. Smirking with shy glee, Mike lifts up Max as his two daughters dash forward to greet him. Lisa steps forward, holding Patrick and hugs him and brings in a giant circular pie covered in lanterns. Whiskers promptly places his nose on the bench and starts devouring the pie. The patio is adorned with floating glass lanterns. Mike serves Whiskers pie. She slips off her hat and laughs, clothed, in front of him. He laughs as she takes a marching leap into the pond. He slips off his scarf. He belly flops in, emerges and paddles towards her. As they embrace clothed, Whiskers paddles by. Mike's placing objects from his shelf into a crate. He hoists the crate under his hand and strolls towards Barry, who's waiting outside his garage. He taps Barry on the wrist and the younger woman bends forward and gives him a half wave. Mike strolls away, smirking. Their tricycle rolls through bare deserts and dry meadows. Whiskers is leaning out of the hatch as the Smiths pedal down a dusty lane. Whiskers prances up the ladder to the small wooden-built shed and nudges a plastic owl perch. He toppled the perch off the deck. Mike's at his shelf in the tiny garages of the Seattle Courier weekly news. Mike joins the girls and Whiskers at the attic window. Small backyard is draped in fog. They all pile inside bundled up for the warmth. A pillow fight erupts, then Lisa and Mike drag the daughters on a wagon while Whiskers skips alongside. Tiny Patrick tumbles off. Whiskers demolishes their igloo. Mike glances at his husband, then they grin and cuddle. Mike strolls downstairs and turns on the lamps. He checks on snoozing Patrick, then glances at the girls in their cribs."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "John is at the beach with his dog, Marley, and observes other dog owners. After unleashing Marley, a chain reaction follows, and many dogs join in a playful romp. However, chaos ensues when Marley attempts to poop in the shallow water, alarming other dog owners. A police 4x4 arrives, adding to the tension. Later, John returns home to his family, where a celebration awaits with cake, which Marley eagerly devours. The pool is decorated with floating candles, and John and his wife, Jenny, enjoy a playful swim. At work, John packs his desk and shares a moment with his colleague, Arnie, before leaving. The family moves through scenic countryside, with Marley energetically exploring their new stone-built home. They enjoy a snowy day at their garden, engaging in a snowball fight, sledding, and building a snowman. As night falls, John lovingly checks on his sleeping children before joining his wife, and they share a smile and hug."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Colleen then checks on the boys in their bunks He looks in on sleeping  John walks upstairs and switches off the lights  John looks at his wife then they smile and hug  Marley attacks their snowman  Little Colleen falls off  Jenny and John pull the children on a sledge while Marley trots alongside  A snowball fight starts then  They all pile outside wrapped up for the cold  Huge garden is covered in snow  John joins the kids and Marley at the bedroom window  daily news  John's at his desk in the cavernous offices of the Philadelphia Inquirer  He knocked the table off the porch  Marley bounds up the steps to the large stonebuilt house and headbutts a stone bird table  Marley is leaning out of the window as the Grogans drive down a country road  Their people carrier drives through green fields and lush woodland  John walks away grinning  He pats Arnie on the shoulder and the older man leans forward and gives him a half hug  He hefts the box under his arm and walks towards Arnie who's standing outside his office  As they cuddle naked Marley swims past John's putting items from his desk into a box  He cannonballs in surfaces and swims towards her  He unbuttons his shirt  He grins as she takes a running jump into the pool  She takes off her dress and grins naked in front of him  John feeds Marley cake  The pool is covered with floating flower candles  Marley immediately puts his paws on the table and starts eating the cake  Jenny comes forward holding Colleen and kisses him and brings in a huge square cake covered in candles  Grinning with embarrassed delight John scoops up Connor as his two boys run forward to greet him  Marley and John enter the darkened house  At night John arrives home in the Volvo with Marley  The officers in shorts and ball caps get out of the vehicle  The big man summons the Rottweiler and a police 4x4 noses onto the beach  The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley  Other owners watch in horror  Marley is circling in the shallows preparing to poop  Bikini girl looks concerned  John grins as the dogs splash around  An owner throws a Frisbee for his border collie  John grins as the dogs play together in the shallows and more join the fun  Others follow suit and a huge Rottweiler charges into the surf  Other owners look at John and with a smile the tanned bikini beauty unclips the leash on her pet boxer  He unclips the leash and Marley bounds down to the water  He looks around the beach at the other owners with their dogs on leashes "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Grinning with embarrassed delight John scoops up Connor as his two boys run forward to greet him  He looks around the beach at the other owners with their dogs on leashes  At night John arrives home in the Volvo with Marley  Little Colleen falls off  John walks upstairs and switches off the lights  John walks away grinning  He pats Arnie on the shoulder and the older man leans forward and gives him a half hug  daily news  He hefts the box under his arm and walks towards Arnie who's standing outside his office  Marley bounds up the steps to the large stonebuilt house and headbutts a stone bird table  He looks in on sleeping  She takes off her dress and grins naked in front of him  John looks at his wife then they smile and hug  He knocked the table off the porch  The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley  John grins as the dogs splash around  Marley immediately puts his paws on the table and starts eating the cake  John feeds Marley cake  Huge garden is covered in snow  The big man summons the Rottweiler and a police 4x4 noses onto the beach  Marley and John enter the darkened house  Marley is circling in the shallows preparing to poop  John's at his desk in the cavernous offices of the Philadelphia Inquirer  Others follow suit and a huge Rottweiler charges into the surf  Their people carrier drives through green fields and lush woodland  Marley attacks their snowman  Other owners watch in horror  They all pile outside wrapped up for the cold  A snowball fight starts then  He grins as she takes a running jump into the pool  He unclips the leash and Marley bounds down to the water  John grins as the dogs play together in the shallows and more join the fun  The officers in shorts and ball caps get out of the vehicle  He cannonballs in surfaces and swims towards her  The pool is covered with floating flower candles  An owner throws a Frisbee for his border collie  As they cuddle naked Marley swims past John's putting items from his desk into a box  Bikini girl looks concerned  John joins the kids and Marley at the bedroom window  Marley is leaning out of the window as the Grogans drive down a country road  Other owners look at John and with a smile the tanned bikini beauty unclips the leash on her pet boxer  Jenny comes forward holding Colleen and kisses him and brings in a huge square cake covered in candles  Jenny and John pull the children on a sledge while Marley trots alongside  Colleen then checks on the boys in their bunks He unbuttons his shirt "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He cannonballs in surfaces and swims towards her  As they cuddle naked Marley swims past John's putting items from his desk into a box  He hefts the box under his arm and walks towards Arnie who's standing outside his office  He pats Arnie on the shoulder and the older man leans forward and gives him a half hug  John walks away grinning  Their people carrier drives through green fields and lush woodland  Marley is leaning out of the window as the Grogans drive down a country road  Marley bounds up the steps to the large stonebuilt house and headbutts a stone bird table  He knocked the table off the porch  John's at his desk in the cavernous offices of the Philadelphia Inquirer  daily news  John joins the kids and Marley at the bedroom window  Huge garden is covered in snow  They all pile outside wrapped up for the cold  A snowball fight starts then  Jenny and John pull the children on a sledge while Marley trots alongside  Little Colleen falls off  Marley attacks their snowman  John looks at his wife then they smile and hug  John walks upstairs and switches off the lights  He looks in on sleeping  Colleen then checks on the boys in their bunks He looks around the beach at the other owners with their dogs on leashes  He unclips the leash and Marley bounds down to the water  Other owners look at John and with a smile the tanned bikini beauty unclips the leash on her pet boxer  Others follow suit and a huge Rottweiler charges into the surf  John grins as the dogs play together in the shallows and more join the fun  An owner throws a Frisbee for his border collie  John grins as the dogs splash around  Bikini girl looks concerned  Marley is circling in the shallows preparing to poop  Other owners watch in horror  The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley  The big man summons the Rottweiler and a police 4x4 noses onto the beach  The officers in shorts and ball caps get out of the vehicle  At night John arrives home in the Volvo with Marley  Marley and John enter the darkened house  Grinning with embarrassed delight John scoops up Connor as his two boys run forward to greet him  Jenny comes forward holding Colleen and kisses him and brings in a huge square cake covered in candles  Marley immediately puts his paws on the table and starts eating the cake  The pool is covered with floating flower candles  John feeds Marley cake  She takes off her dress and grins naked in front of him  He grins as she takes a running jump into the pool  He unbuttons his shirt "
        }
      ]
    }
  ]
}