{
  "ground_truth": "By its red glow, the mercenaries check their watches en masse. Lewis pulls a hood over his head. The team, including Rambo, make ready. His head covered by a black hat, School Boy stealthily climbs the wooden steps of the camp watch tower. He pulls out a vicious-looking knife with a serrated blade from a sheath. A guard in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance. He walks into the rain-soaked road as the truck approaches the camp. BN is at the wheel, dressed as a soldier. School Boy steals onto the watch tower platform where a lookout sits in a chair, oblivious to his presence. On the tower, School Boy clamps a hand over the guard's mouth and plunges the serrated blade into the soldier. He rests his rifle on the timbers of the watch tower. In the truck, Rambo's eye-line and bandana are reflected in BN's driving mirror. BN wears a frown of concentration as the camp nears the camp guard post. The guard waves them through, a cigarette ember glowing between his fingers. On the tower, School Boy checks his watch, nine minutes to two. In the still-moving truck, Rambo signals to Reese. Reese jumps off the truck, rolls, and hides. En-Joo jumps off, rounds the corner of a hut with his weapon raised, and takes cover. Rambo clamps Lewis on the shoulder and the hooded man jumps off, taking cover between the two huts. The troops enjoy the exotic dance show. Diaz leaps from the truck and rolls uncomfortably. As the truck passes over a low wooden bridge above a stream, Rambo jumps off, rolls in the mud, and takes position at the side of a hut. He looks through the wooden slats at the hut wall. A figure is inscribing a tattoo on another's back with black ink. Rambo hurries away. At the dance show, some of the watching soldiers rock drunkenly back and forth in time with the music. BN brings the truck to a halt and gets out of the cab. He pauses near the truck's bonnet. The dancing women are peasants. Their eyes are dull and uninterested. En-Joo nears a hut and peers inside. Someone sits in front of a nude female, his hands on her waist. En-Joo moves on. Reese approaches a hut and checks inside in the same way. Rambo checks the luminous dial of his analog watch, seven minutes to two. A man hangs crucified on a timber frame. Above him, the caged volunteers are blindfolded. One of the prisoners hears his approach. Pigs are tearing flesh from the crucified man's leg. Rambo draws his homemade machete and runs up to the cage.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "By its crimson glow, the hired soldiers inspect their wristwatches collectively. Lewis drags a covering over his head. The squad, including Rambo, prepare. His head covered by a black cap, School Boy furtively ascends the wooden stairs of the camp watch tower. He extracts a menacing-looking dagger with a jagged blade from a scabbard. A sentry in a rain poncho smokes a cigarette and notices the headlights of the lorry in the distance. He strides into the rain-soaked path as the lorry nears the camp. BN is at the wheel, dressed as a warrior. School Boy slips onto the watch tower platform where a lookout reclines in a seat, unaware of his existence. On the tower, School Boy clasps a hand over the sentry's mouth and thrusts the jagged blade into the warrior. He rests his firearm on the timbers of the watch tower. In the lorry, Rambo's eye-line and bandana are mirrored in BN's driving reflector. BN wears a frown of focus as the camp approaches the camp sentry post. The sentry waves them through, a cigarette ember glowing between his digits. On the tower, School Boy inspects his wristwatch, nine minutes to two. In the still-moving lorry, Rambo signals to Reese. Reese leaps off the lorry, rolls, and conceals. En-Joo leaps off, rounds the corner of a shack with his firearm elevated, and takes shelter. Rambo clasps Lewis on the shoulder and the shrouded man leaps off, taking shelter between the two shacks. The soldiers enjoy the foreign dance performance. Diaz springs from the lorry and rolls awkwardly. As the lorry crosses over a low wooden bridge above a stream, Rambo leaps off, rolls in the sludge, and assumes position at the flank of a shack. He gazes through the wooden slats at the shack wall. A figure is engraving a tattoo on another's back with ebony ink. Rambo hastens away. At the dance performance, some of the observing soldiers sway drunkenly back and forth in sync with the melody. BN brings the lorry to a stop and exits the cab. He pauses near the lorry's hood. The dancing females are peasants. Their eyes are dull and uninterested. En-Joo approaches a shack and peers within. Someone perches in front of a nude woman, his hands on her waist. En-Joo moves on. Reese nears a shack and inspects within in the same manner. Rambo inspects the glowing dial of his analog wristwatch, seven minutes to two. A man hangs crucified on a splinter frame. Above him, the caged captives are blindfolded. One of the captives hears his approach. Swine are ripping flesh from the crucified man's limb. Rambo draws his homemade machete and dashes up to the cage."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Text to transform:\n\nBy its red glow, the watches are checked en masse by the mercenaries. A hood is pulled over his head by Lewis. Ready is made by the team, including Rambo. A black hat covers his head as the wooden steps of the camp watch tower are stealthily climbed by School Boy. A vicious-looking knife with a serrated blade is pulled out from a sheath by him. A guard in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance. He walks into the rain-soaked road as the camp is approached by the truck. BN dresses as a soldier and is at the wheel. The watch tower platform is stolen onto by School Boy where a lookout sits in a chair, oblivious to his presence. On the tower, the guard's mouth is clamped by School Boy, and the serrated blade is plunged into the soldier. His rifle is rested on the timbers of the watch tower. In the truck, BN reflects Rambo's eye-line and bandana in the driving mirror. As the camp nears the camp guard post, BN concentrates with a frown. They are waved through by the guard, a cigarette ember glowing between his fingers. On the tower, his watch is checked by School Boy, nine minutes to two. In the still-moving truck, Reese is signaled by Rambo. The truck is jumped off by Reese, he rolls and hides. En-Joo jumps off, rounds the corner of a hut with his weapon raised, and takes cover. Lewis is clamped on the shoulder by Rambo and the hooded man jumps off, taking cover between the two huts. The exotic dance show is enjoyed by the troops. The truck is leapt from by Diaz, and he rolls uncomfortably. As a low wooden bridge above a stream is passed over by the truck, Rambo jumps off, rolls in the mud, and takes position at the side of a hut. The wooden slats at the hut wall are looked through by him. A tattoo is inscribed on another's back with black ink by a figure. Away hurries Rambo. At the dance show, the music is rocked drunkenly back and forth in time with by some of the watching soldiers. The truck is brought to a halt by BN, and he gets out of the cab. He pauses near the truck's bonnet. The peasants are the dancing women. Their eyes are dull and uninterested. A hut is neared by En-Joo, and he peers inside. A nude female is sat in front of, with his hands on her waist. On moves En-Joo. A hut is approached by Reese, and inside is checked in the same way. The luminous dial of his analog watch is checked by Rambo, seven minutes to two. A man hangs crucified on a timber frame. The caged volunteers are blindfolded above him. One of the prisoners hears his approach. Flesh from the crucified man's leg is torn by pigs. A homemade machete is drawn by Rambo, and he runs up to the cage."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "By its red glow, the mercenaries check their watches. Lewis pulls a hood over his head as the team, including Rambo, prepares. School Boy, with a black hat, stealthily climbs the camp watchtower and draws a serrated knife. A guard in a rain poncho sees truck headlights approaching. BN, dressed as a soldier, drives the truck. School Boy sneaks onto the platform, silences the lookout, and kills him. He rests his rifle on the tower timbers. In the truck, Rambo's reflection is visible in BN's mirror. BN concentrates as they near the guard post, who waves them through. School Boy checks his watch—nine minutes to two. Rambo signals Reese, who jumps off the truck and hides. En-Joo jumps off, rounds a hut, and takes cover. Rambo taps Lewis, who jumps off and hides between huts. Troops enjoy an exotic dance show. Diaz leaps from the truck and rolls. As the truck crosses a wooden bridge, Rambo jumps off, rolls in mud, and takes position by a hut. He peers through slats at a tattoo being inscribed. Rambo hurries away. At the dance show, soldiers sway drunkenly. BN stops the truck and exits. The dancing women are peasants with dull eyes. En-Joo peers inside a hut, sees a man with a nude female, and moves on. Reese checks another hut. Rambo checks his watch—seven minutes to two. A man hangs crucified, with caged, blindfolded volunteers above. A prisoner hears Rambo's approach. Pigs tear flesh from the crucified man's leg. Rambo draws his machete and runs to the cage."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "By its red glow, mercenaries check their watches. Lewis pulls up his hood. The team, including Rambo, prepares. School Boy, in a black hat, stealthily climbs the camp watchtower, drawing a serrated knife. A guard in a rain poncho sees truck headlights and approaches the camp. BN, dressed as a soldier, drives. School Boy silently reaches the lookout, silences him with the knife, and rests his rifle. In the truck, Rambo's reflection is in BN's mirror. BN concentrates as they near the guard post, who waves them through. School Boy checks his watch, nine minutes to two. Rambo signals Reese, who jumps off and hides. En-Joo jumps off, rounds a hut, and takes cover. Rambo taps Lewis, who jumps off and hides between huts. Troops enjoy an exotic dance show. Diaz jumps off and rolls. Rambo jumps off the truck, rolls in mud, and takes position by a hut, observing a tattoo being inscribed. He hurries away. Soldiers drunkenly sway to music. BN stops the truck and exits. The dancing women are disinterested peasants. En-Joo peers into a hut, sees a man with a nude female, and moves on. Reese checks another hut. Rambo checks his watch, seven minutes to two. A man is crucified, pigs tear at his leg. Rambo draws his machete and runs to the cage."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Under the dim, red glow of the surrounding environment, the group of mercenaries collectively glance down at their watches, checking the time in unison. Lewis, with a deliberate motion, pulls a hood over his head, concealing his features. The entire team, which includes the formidable Rambo, begins to prepare themselves for the task ahead. School Boy, his head discreetly covered by a black hat, stealthily ascends the wooden steps leading up to the camp's watchtower. From a sheath, he carefully extracts a menacing knife, its blade serrated and vicious-looking. Meanwhile, a guard, clad in a rain poncho, casually smokes a cigarette and notices the distant headlamps of an approaching truck. He steps onto the rain-soaked road as the truck draws nearer to the camp. Behind the wheel, BN, dressed convincingly as a soldier, drives with purpose. \n\nSchool Boy silently makes his way onto the watchtower platform, where a lookout sits in a chair, completely unaware of School Boy's presence. On the tower, School Boy swiftly clamps a hand over the guard's mouth and plunges the serrated blade into the unsuspecting soldier. He then rests his rifle on the sturdy timbers of the watchtower. Inside the truck, Rambo's intense gaze and iconic bandana are reflected in BN's driving mirror. BN maintains a frown of deep concentration as they approach the camp's guard post. The guard, with a cigarette ember glowing between his fingers, waves them through without suspicion. On the tower, School Boy checks his watch, noting that it is nine minutes to two.\n\nIn the still-moving truck, Rambo signals to Reese, who promptly jumps off, rolls skillfully, and finds a hiding spot. En-Joo follows suit, leaping off the truck, rounding the corner of a nearby hut with his weapon raised, and taking cover. Rambo gives Lewis a firm clamp on the shoulder, prompting the hooded man to jump off and take cover between two huts. Meanwhile, the troops are distracted, enjoying an exotic dance show. Diaz leaps from the truck, rolling awkwardly as he lands. As the truck crosses a low wooden bridge spanning a stream, Rambo jumps off, rolls in the mud, and positions himself strategically at the side of a hut. He peers through the wooden slats of the hut wall, observing a figure inscribing a tattoo on another's back with black ink. Rambo quickly moves away from the scene.\n\nAt the dance show, some of the soldiers watching sway drunkenly back and forth, moving in time with the music. BN brings the truck to a stop and exits the cab, pausing momentarily near the truck's bonnet. The women performing the dance are peasants, their eyes dull and uninterested. En-Joo approaches a hut and peers inside, observing someone sitting in front of a nude female, his hands resting on her waist. En-Joo continues on his way. Reese approaches another hut, checking inside in a similar manner. Rambo glances at the luminous dial of his analog watch, noting that it is seven minutes to two. Nearby, a man hangs crucified on a timber frame, and above him, caged volunteers are blindfolded. One of the prisoners hears Rambo's approach. Pigs are gruesomely tearing flesh from the crucified man's leg. Rambo, with determination, draws his homemade machete and swiftly runs up to the cage."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Under the dim and eerie, red-tinted glow permeating the surrounding environment, the group of hardened mercenaries collectively glance down at their watches, synchronizing the time in unison. With a slow and deliberate motion, Lewis raises his hand and pulls a hood over his head, effectively concealing his features from view. The entire assembled team, which prominently includes the formidable and legendary Rambo, begins to methodically prepare themselves for the daunting task that lies ahead. School Boy, with his head discreetly covered by a black hat, stealthily and quietly ascends the creaking wooden steps that lead up to the camp's watchtower. With precision, he carefully extracts a menacing knife from its sheath, its blade serrated and vicious-looking in the dim light. Meanwhile, a guard, clad in a rain poncho to ward off the elements, casually smokes a cigarette while noticing the distant, approaching headlamps of a truck. He steps casually onto the rain-soaked road as the truck steadily draws nearer to the camp. Behind the wheel, BN, dressed convincingly and deceptively as a soldier, drives with a clear sense of purpose.\n\nWith silent footsteps, School Boy makes his way onto the watchtower platform, where a lookout, completely unaware of School Boy's stealthy presence, sits in a chair. Upon reaching the unsuspecting lookout, School Boy swiftly clamps a firm hand over the guard's mouth and plunges the serrated blade into the unsuspecting soldier with practiced efficiency. He then rests his rifle securely on the sturdy timbers of the watchtower. Inside the approaching truck, Rambo's intense gaze, accentuated by his iconic bandana, is reflected in the mirror BN uses to keep driving. BN maintains a deep frown of concentration, determined as they approach the camp's seemingly oblivious guard post. The guard, with the ember of his cigarette glowing between his fingers, casually waves them through without a hint of suspicion. On the tower, School Boy checks his watch once again, noting that it is precisely nine minutes to two.\n\nInside the still-moving truck, Rambo signals quietly to Reese, who promptly jumps off, executing a skillful roll before finding a hiding spot. En-Joo follows suit, leaping off the truck, quickly rounding the corner of a nearby hut with his weapon raised, and taking cover. Rambo gives Lewis a firm clamp on the shoulder, prompting the hooded man to jump off and take immediate cover between two adjacent huts. Meanwhile, the troops are distracted, engrossed in enjoying an exotic dance show. Diaz, in his turn, leaps from the truck, rolling a bit awkwardly as he lands. As the truck crosses a low wooden bridge that spans a stream, Rambo leaps off, skillfully rolling in the mud, and positions himself strategically near the side of a hut. Peering through the wooden slats of the hut wall, he observes a figure painstakingly inscribing a tattoo on another's back with dark black ink, quickly moving away from the scene afterward.\n\nAt the ongoing dance show, some soldiers in attendance sway drunkenly back and forth, moving rhythmically in time with the music. BN brings the truck to a definitive stop and exits the cab, pausing momentarily near the truck's bonnet. The women who perform the dance are peasants, their eyes appearing dull and uninterested as they move. En-Joo approaches a nearby hut and peers cautiously inside, observing someone sitting in front of a nude female, his hands resting casually on her waist before moving on. Meanwhile, Reese approaches another hut, checking inside in a similar, careful manner. Rambo takes a moment to glance at the luminous dial of his analog watch, noting with precision that it is now seven minutes to two. Nearby, a man hangs in a crucified position on a timber frame, while above him, caged volunteers are blindfolded. One of the prisoners hears the subtle sound of Rambo’s approach. Gruesomely, pigs are tearing flesh from the crucified man's leg. With determination, Rambo draws his homemade machete and swiftly runs up to the cage."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the red glow illuminates the area, the mercenaries collectively glance down at their watches, synchronizing their actions. Lewis, feeling the chill of the night, pulls a hood over his head, ensuring he is concealed. The team, including the formidable Rambo, prepares themselves for the mission ahead. Meanwhile, School Boy, with his head discreetly covered by a black hat, stealthily ascends the wooden steps leading to the camp's watchtower. Upon reaching the top, he carefully extracts a vicious-looking knife with a serrated blade from its sheath, readying himself for what is to come. Down below, a guard clad in a rain poncho casually smokes a cigarette, his attention momentarily captured by the distant headlamps of an approaching truck. He steps onto the rain-soaked road, his eyes fixed on the vehicle as it nears the camp. Behind the wheel, BN, dressed convincingly as a soldier, maintains his composure. Unnoticed, School Boy silently makes his way onto the watchtower platform, where a lookout sits in a chair, completely unaware of the impending danger. With swift precision, School Boy clamps a hand over the guard's mouth, simultaneously driving the serrated blade into the soldier, ensuring silence. He then rests his rifle on the sturdy timbers of the watchtower, ready for further action. Inside the truck, Rambo's intense gaze and signature bandana are reflected in BN's driving mirror, while BN, wearing a frown of concentration, navigates the vehicle closer to the camp guard post. The guard, cigarette ember glowing between his fingers, casually waves them through. On the tower, School Boy checks his watch, noting the time as nine minutes to two. As the truck continues to move, Rambo discreetly signals to Reese, who promptly jumps off, executing a roll before finding a hiding spot. En-Joo follows suit, leaping off the truck, rounding the corner of a hut with his weapon at the ready, and taking cover. Rambo, with a firm grip, clamps Lewis on the shoulder, prompting the hooded man to jump off and take cover between two huts. Meanwhile, the troops are engrossed in an exotic dance show, oblivious to the unfolding operation. Diaz, with less grace, leaps from the truck and rolls awkwardly. As the truck traverses a low wooden bridge above a stream, Rambo seizes the moment to jump off, rolling in the mud before positioning himself at the side of a hut. Peering through the wooden slats of the hut wall, he observes a figure inscribing a tattoo on another's back with black ink, then quickly moves on. At the dance show, some soldiers, inebriated, sway back and forth in rhythm with the music. BN brings the truck to a halt and exits the cab, pausing momentarily near the truck's bonnet. The dancing women, mere peasants, perform with eyes that are dull and uninterested. En-Joo approaches a hut, cautiously peering inside to find someone seated in front of a nude female, hands resting on her waist, before moving on. Reese, too, approaches a hut, checking inside in a similar manner. Rambo, ever vigilant, checks the luminous dial of his analog watch, noting the time as seven minutes to two. Nearby, a man hangs crucified on a timber frame, while above him, caged volunteers remain blindfolded. One of the prisoners, sensing Rambo's approach, stirs. Pigs, in a gruesome scene, tear flesh from the crucified man's leg. With determination, Rambo draws his homemade machete and swiftly runs up to the cage, ready to take action."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As the mercenaries synchronize their watches by the red glow, Lewis pulls up his hood, and the team, including Rambo, prepares for action. School Boy, with his head covered by a black hat, stealthily ascends the camp watch tower, drawing a serrated knife. Meanwhile, a guard in a rain poncho notices the truck's headlamps and steps onto the rain-soaked road as BN, dressed as a soldier, drives the truck toward the camp. School Boy silently reaches the watch tower platform, where he swiftly neutralizes the lookout with his knife and positions his rifle. In the truck, Rambo's reflection is visible in BN's mirror as they near the guard post, where the guard waves them through. School Boy checks his watch, noting the time as nine minutes to two. Rambo signals to Reese, who jumps off the moving truck, rolls, and hides, followed by En-Joo, who takes cover with his weapon ready. Rambo taps Lewis, who jumps off and takes cover between huts. As the troops enjoy an exotic dance show, Diaz awkwardly disembarks. Rambo jumps off the truck as it crosses a bridge, rolls in the mud, and takes position by a hut, observing a tattoo being inscribed inside before moving on. BN halts the truck and exits, pausing near the bonnet. The dancing women, dull-eyed peasants, perform for the drunken soldiers. En-Joo and Reese check inside huts, finding unsettling scenes. Rambo checks his watch, noting seven minutes to two, and approaches a crucified man and caged, blindfolded volunteers. As pigs tear at the crucified man's leg, Rambo draws his homemade machete and rushes to the cage."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "By its red glow, the mercenaries, seasoned soldiers from various parts of the world, check their watches en masse. Lewis, who served in the special forces of the British Army, pulls a hood over his head. The team, including Rambo, a legendary figure among mercenaries with a history of successful but dangerous missions, make ready. His head covered by a black hat that was once part of an elite military uniform, School Boy stealthily climbs the wooden steps of the camp watch tower, a relic from a bygone era of conflict. He pulls out a vicious-looking knife with a serrated blade from a sheath, a design favored for its ability to cut through tough materials with ease. A guard in a rain poncho, standard issue in this tropical region, smokes a cigarette and sees the headlamps of the truck in the distance. He walks into the rain-soaked road as the truck approaches the camp, an outpost used for illicit operations. BN is at the wheel, dressed as a soldier from a local militia, to avoid suspicion. School Boy steals onto the watch tower platform where a lookout sits in a chair, oblivious to his presence despite the recent increase in security alerts. On the tower, School Boy clamps a hand over the guard's mouth and plunges the serrated blade into the soldier, a swift, lethal move learned in covert training. He rests his rifle on the timbers of the watch tower. In the truck, Rambo's eye-line and bandana, a trademark of his renowned exploits, are reflected in BN's driving mirror. BN wears a frown of concentration as the camp nears the camp guard post, knowing this checkpoint is critical for their mission. The guard waves them through, a cigarette ember glowing between his fingers. On the tower, School Boy checks his watch, nine minutes to two, synchronizing with the planned operation's timeline. In the still-moving truck, Rambo signals to Reese. Reese, an expert in infiltration, jumps off the truck, rolls, and hides. En-Joo, trained in guerrilla tactics, jumps off, rounds the corner of a hut with his weapon raised, and takes cover. Rambo clamps Lewis on the shoulder, and the hooded man jumps off, taking cover between the two huts. The troops, momentarily distracted by the exotic dance show, are unaware of the encroaching threat. Diaz, a veteran of many conflicts, leaps from the truck and rolls uncomfortably. As the truck passes over a low wooden bridge above a stream, Rambo jumps off, rolls in the mud, and takes position at the side of a hut. He looks through the wooden slats at the hut wall. Inside, a figure is inscribing a tattoo on another's back with black ink, a mark of allegiance to a local warlord. Rambo hurries away, understanding the significance. At the dance show, some of the watching soldiers rock drunkenly back and forth in time with the music, a brief escape from their harsh reality. BN brings the truck to a halt and gets out of the cab. He pauses near the truck's bonnet, checking for any immediate threats. The dancing women are peasants, forced to entertain the troops. Their eyes are dull and uninterested. En-Joo nears a hut and peers inside. Someone sits in front of a nude female, his hands on her waist, a scene of exploitation common in these camps. En-Joo moves on. Reese approaches a hut and checks inside in the same way, ensuring no one is left unaccounted for. Rambo checks the luminous dial of his analog watch, seven minutes to two, the mission's countdown pressing on him. A man hangs crucified on a timber frame, a gruesome punishment for dissenters. Above him, the caged volunteers, who were captured during earlier raids, are blindfolded. One of the prisoners hears his approach, sensing a glimmer of hope. Pigs, scavenging creatures common in the area, are tearing flesh from the crucified man's leg. Rambo draws his homemade machete, a tool and weapon forged in the jungles he knows so well, and runs up to the cage, intent on freeing the prisoners."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "By its red glow the mercenaries check their watches en masse  Lewis pulls a hood over his head  The team including Rambo make ready  His head covered by a black hat  School Boy stealthily climbs the wooden steps of the camp watch tower  He pulls out a viciouslooking knife with a serrated blade from a sheath  A guard in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance  EnJoo jumps off rounds the corner of a hut with his weapon raised and takes cover  Rambo clamps Lewis on the shoulder and the hooded man jumps off taking cover between the two huts  The troops enjoy the exotic dance show  Diaz leaps from the truck and rolls uncomfortably  As the truck passes over a low wooden bridge above a stream Rambo jumps off rolls in the mud and takes position at the side of a hut  He looks through the wooden slats at the hut wall  A figure is inscribing a tattoo on another's back with black ink  Rambo hurries away  At the dance show some of the watching soldiers rock drunkenly back and forth in time with the music  BN brings the truck to a halt and gets out of the cab  He pauses near the truck's bonnet  The dancing women are peasants  Their eyes are dull and uninterested  EnJoo nears a hut and peers inside  Someone sits in front of a nude female his hands on her waist  EnJoo moves on  Reese approaches a hut and checks inside in the same way  Rambo checks the luminous dial of his analog watch  seven minutes to two  A man hangs crucified on a timber frame  Above him the caged volunteers are blindfolded  One of the prisoners hears his approach  He walks into the rainsoaked road  as the truck approaches the camp  BN is at the wheel dressed as a soldier  School Boy steals onto the watch tower platform where a lookout sits in a chair oblivious to his presence  On the tower School Boy clamps a hand over the guard's mouth and plunges the serrated blade into the soldier  He rests his rifle on the timbers of the watch tower  In the truck Rambo's eyeline and bandana are reflected in BN's driving mirror  BN wears a frown of concentration as the camp nears the camp guard post  The guard waves them through a cigarette ember glowing between his fingers  On the tower School Boy checks his watch  nine minutes to two  In the stillmoving truck Rambo signals to Reese  Reese jumps off the truck rolls and hides  EnJoo jumps off rounds the corner of a hut with his weapon raised and takes cover  Rambo clamps Lewis on the shoulder and the hooded man jumps off taking cover between the two huts  The troops enjoy the exotic dance show  Diaz leaps from the truck and rolls uncomfortably  As the truck passes over a low wooden bridge above a stream Rambo jumps off rolls in the mud and takes position at the side of a hut  He looks through the wooden slats at the hut wall  A figure is inscribing a tattoo on another's back with black ink  Rambo hurries away  At the dance show some of the watching soldiers rock drunkenly back and forth in time with the music  BN brings the truck to a halt and gets out of the cab  He pauses near the truck's bonnet  The dancing women are peasants  Their eyes are dull and uninterested  EnJoo nears a hut and peers inside  Someone sits in front of a nude female his hands on her waist  EnJoo moves on  Reese approaches a hut and checks inside in the same way  Rambo checks the luminous dial of his analog watch  seven minutes to two  A man hangs crucified on a timber frame  Above him the caged volunteers are blindfolded  One of the prisoners hears his approach  Pigs are tearing flesh from the crucified man's leg  Rambo draws his homemade machete and runs up to the cage"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "By its red glow the mercenaries check their watches en masse. Lewis pulls a hood over his head. The team including Rambo make ready. His head covered by a black hat. School Boy stealthily climbs the wooden steps of the camp watch tower. He pulls out a viciouslooking knife with a serrated blade from a sheath. A guard in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance. He walks into the rainsoaked road. as the truck approaches the camp. BN is at the wheel dressed as a soldier. School Boy steals onto the watch tower platform where a lookout sits in a chair oblivious to his presence. On the tower School Boy clamps a hand over the guard's mouth and plunges the serrated blade into the soldier. He rests his rifle on the timbers of the watch tower. In the truck Rambo's eyeline and bandana are reflected in BN's driving mirror. BN wears a frown of concentration as the camp nears the camp guard post. The guard waves them through a cigarette ember glowing between his fingers. On the tower School Boy checks his watch. nine minutes to two. In the stillmoving truck Rambo signals to Reese. Reese jumps off the truck rolls and hides. EnJoo jumps off rounds the corner of a hut with his weapon raised and takes cover. Rambo clamps Lewis on the shoulder and the hooded man jumps off taking cover between the two huts. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. The troops enjoy the exotic dance show. Diaz leaps from the truck and rolls uncomfortably. As the truck passes over a low wooden bridge above a stream Rambo jumps off rolls in the mud and takes position at the side of a hut. He looks through the wooden slats at the hut wall. A figure is inscribing a tattoo on another's back with black ink. Rambo hurries away. At the dance show some of the watching soldiers rock drunkenly back and forth in time with the music. BN brings the truck to a halt and gets out of the cab. He pauses near the truck's bonnet. The dancing women are peasants. Their eyes are dull and uninterested. EnJoo nears a hut and peers inside. Someone sits in front of a nude female his hands on her waist. EnJoo moves on. Reese approaches a hut and checks inside in the same way. Rambo checks the luminous dial of his analog watch. seven minutes to two. A man hangs crucified on a timber frame. Above him the caged volunteers are blindfolded. One of the prisoners hears his approach. Pigs are tearing flesh from the crucified man's leg. Rambo draws his homemade machete and runs up to the cage."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "By its red glow the mercenaries check their watches en masse. Lewis pulls a hood over his head. The team including Rambo make ready. His head covered by a black hat. School Boy stealthily climbs the wooden steps of the camp watch tower. He pulls out a viciouslooking knife with a serrated blade from a sheath. A guard in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance. He walks into the rainsoaked road. as the truck approaches the camp. BN is at the wheel dressed as a soldier. School Boy steals onto the watch tower platform where a lookout sits in a chair oblivious to his presence. On the tower School Boy clamps a hand over the guard's mouth and plunges the serrated blade into the soldier. He rests his rifle on the timbers of the watch tower. In the truck Rambo's eyeline and bandana are reflected in BN's driving mirror. BN wears a frown of concentration as the camp nears the camp guard post. The guard waves them through a cigarette ember glowing between his fingers. On the tower School Boy checks his watch. nine minutes to two. In the stillmoving truck Rambo signals to Reese. Reese jumps off the truck rolls and hides. EnJoo jumps off rounds the corner of a hut with his weapon raised and takes cover. Rambo clamps Lewis on the shoulder and the hooded man jumps off taking cover between the two huts. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. The troops enjoy the exotic dance show. Diaz leaps from the truck and rolls uncomfortably. As the truck passes over a low wooden bridge above a stream Rambo jumps off rolls in the mud and takes position at the side of a hut. He looks through the wooden slats at the hut wall. A figure is inscribing a tattoo on another's back with black ink. Rambo hurries away. At the dance show some of the watching soldiers rock drunkenly back and forth in time with the music. BN brings the truck to a halt and gets out of the cab. He pauses near the truck's bonnet. The dancing women are peasants. Their eyes are dull and uninterested. EnJoo nears a hut and peers inside. Someone sits in front of a nude female his hands on her waist. EnJoo moves on. Reese approaches a hut and checks inside in the same way. Rambo checks the luminous dial of his analog watch. seven minutes to two. A man hangs crucified on a timber frame. Above him the caged volunteers are blindfolded. One of the prisoners hears his approach. Pigs are tearing flesh from the crucified man's leg. Rambo draws his homemade machete and runs up to the cage."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "By its red glow the mercenaries check their watches en masse. Lewis pulls a hood over his head. The team including Rambo make ready. His head covered by a black hat. School Boy stealthily climbs the wooden steps of the camp watch tower. He pulls out a viciouslooking knife with a serrated blade from a sheath. A guard in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance. He walks into the rainsoaked road. as the truck approaches the camp. BN is at the wheel dressed as a soldier. School Boy steals onto the watch tower platform where a lookout sits in a chair oblivious to his presence. EnJoo nears a hut and peers inside. Someone sits in front of a nude female his hands on her waist. EnJoo moves on. Reese approaches a hut and checks inside in the same way. Rambo checks the luminous dial of his analog watch. seven minutes to two. A man hangs crucified on a timber frame. Above him the caged volunteers are blindfolded. One of the prisoners hears his approach. Pigs are tearing flesh from the crucified man's leg. Rambo draws his homemade machete and runs up to the cage."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "By its red glow the mercenaries check their watches en masse. Lewis pulls a hood over his head. The team including Rambo make ready. His head covered by a black hat. School Boy stealthily climbs the wooden steps of the camp watch tower. Above him the caged volunteers are blindfolded. One of the prisoners hears his approach. Pigs are tearing flesh from the crucified man's leg. Rambo draws his homemade machete and runs up to the cage."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "By its red glow, the dolphins check their watches en masse. A squirrel pulls a hood over its head. The orchestra, including Beethoven, make ready. Its head covered by a black hat, a kangaroo stealthily climbs the wooden steps of the camp watch tower. It pulls out a vicious-looking knife with a serrated blade from a sheath. A giraffe in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance. It walks into the rain-soaked road as the truck approaches the camp. A rabbit is at the wheel, dressed as a soldier. A kangaroo steals onto the watch tower platform where a lookout sits in a chair, oblivious to its presence. On the tower, a kangaroo clamps a hand over the guard's mouth and plunges the serrated blade into the soldier. It rests its rifle on the timbers of the watch tower. In the truck, Beethoven's eye-line and bandana are reflected in the rabbit's driving mirror. The rabbit wears a frown of concentration as the camp nears the camp guard post. The guard waves them through, a cigarette ember glowing between its fingers. On the tower, a kangaroo checks its watch, nine minutes to two. In the still-moving truck, Beethoven signals to a pirate. A pirate jumps off the truck, rolls, and hides. A leopard jumps off, rounds the corner of a hut with its weapon raised, and takes cover. Beethoven clamps a squirrel on the shoulder and the hooded creature jumps off, taking cover between the two huts. The dolphins enjoy the exotic dance show. A zebra leaps from the truck and rolls uncomfortably. As the truck passes over a low wooden bridge above a stream, Beethoven jumps off, rolls in the mud, and takes position at the side of a hut. It looks through the wooden slats at the hut wall. An owl is inscribing a tattoo on another's back with black ink. Beethoven hurries away. At the dance show, some of the watching donkeys rock drunkenly back and forth in time with the music. The rabbit brings the truck to a halt and gets out of the cab. It pauses near the truck's bonnet. The dancing women are kangaroos. Their eyes are dull and uninterested. A leopard nears a hut and peers inside. Someone sits in front of a nude female, its hands on her waist. A leopard moves on. A pirate approaches a hut and checks inside in the same way. Beethoven checks the luminous dial of its analog watch, seven minutes to two. A turtle hangs crucified on a timber frame. Above it, the caged volunteers are blindfolded. One of the prisoners hears its approach. Pigs are tearing flesh from the crucified turtle's leg. Beethoven draws its homemade machete and runs up to the cage."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "By its red hue, the mercenaries check their compasses en masse. Lewis pulls a scarf over his head. The team, including Rambo, make ready. His head covered by a black cap, School Boy stealthily climbs the stone steps of the encampment watch tower. He pulls out a brutal-looking hammer with a serrated handle from a holster. A guard in a raincoat smokes a pipe and sees the lanterns of the jeep in the distance. He walks into the rain-soaked path as the jeep approaches the encampment. BN is at the wheel, dressed as an officer. School Boy steals onto the watch tower platform where a lookout sits on a stool, oblivious to his presence. On the tower, School Boy clamps a hand over the guard's mouth and plunges the serrated hammer into the officer. He rests his crossbow on the stones of the watch tower. In the jeep, Rambo's eye-line and beret are reflected in BN's rearview mirror. BN wears a look of concentration as the encampment nears the encampment guard post. The guard waves them through, a pipe ember glowing between his fingers. On the tower, School Boy checks his compass, nine minutes to two. In the still-moving jeep, Rambo signals to Reese. Reese jumps off the jeep, rolls, and hides. En-Joo jumps off, rounds the corner of a tent with his weapon raised, and takes cover. Rambo clamps Lewis on the shoulder and the scarfed man jumps off, taking cover between the two tents. The troops enjoy the exotic puppet show. Diaz leaps from the jeep and rolls uncomfortably. As the jeep passes over a low wooden bridge above a ditch, Rambo jumps off, rolls in the mud, and takes position at the side of a tent. He looks through the cloth slats at the tent wall. A figure is painting a mural on another's back with black paint. Rambo hurries away. At the puppet show, some of the watching soldiers sway drunkenly back and forth in time with the music. BN brings the jeep to a halt and gets out of the cabin. He pauses near the jeep's hood. The dancing figures are mannequins. Their eyes are dull and uninterested. En-Joo nears a tent and peers inside. Someone sits in front of an animal, his hands on its pelt. En-Joo moves on. Reese approaches a tent and checks inside in the same way. Rambo checks the luminous dial of his analog clock, seven minutes to two. A man hangs suspended on a wooden structure. Above him, the caged hostages are blindfolded. One of the prisoners hears his approach. Goats are tearing foliage from the suspended man's leg. Rambo draws his homemade lance and runs up to the cage."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "By its red glow, the mercenaries synchronize their watches en masse. Lewis adjusts a hood over his head. The team, including Rambo, prepare themselves. His head covered by a black hat, School Boy quietly descends the wooden steps of the camp watch tower. He retrieves a vicious-looking knife with a serrated blade from a sheath. A guard in a rain poncho chews gum and notices the headlamps of the truck in the distance. He steps onto the rain-soaked road as the truck advances toward the camp. BN is at the wheel, attired as a soldier. School Boy slips onto the watch tower platform where a lookout reclines in a chair, unaware of his presence. On the tower, School Boy places a hand over the guard's mouth and thrusts the serrated blade into the soldier. He balances his rifle on the timbers of the watch tower. In the truck, Rambo's eye-line and bandana reflect in BN's driving mirror. BN wears a look of determination as the camp approaches the camp guard post. The guard nods them through, a cigarette ember glowing between his fingers. On the tower, School Boy sets his watch, nine minutes to two. In the still-moving truck, Rambo gestures to Reese. Reese hops off the truck, crouches, and conceals himself. En-Joo hops off, rounds the corner of a hut with his weapon at the ready, and finds shelter. Rambo taps Lewis on the shoulder and the hooded man hops off, taking shelter between the two huts. The troops cheer for the exotic dance show. Diaz leaps from the truck and stumbles awkwardly. As the truck rolls over a low wooden bridge above a stream, Rambo hops off, slips in the mud, and situates himself at the side of a hut. He peers through the wooden slats at the hut wall. A figure is etching a tattoo on another's back with black ink. Rambo scurries away. At the dance show, some of the watching soldiers sway drunkenly back and forth in time with the music. BN halts the truck and exits the cab. He lingers near the truck's bonnet. The dancing women are locals. Their eyes are vacant and unengaged. En-Joo approaches a hut and glances inside. Someone perches in front of a nude female, his hands on her waist. En-Joo moves along. Reese nears a hut and glances inside in the same way. Rambo examines the luminous dial of his analog watch, seven minutes to two. A man hangs bound on a timber frame. Above him, the caged volunteers are blindfolded. One of the prisoners perceives his approach. Pigs are gnawing at the bound man's leg. Rambo brandishes his homemade machete and dashes up to the cage."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "By its blue flicker, the librarians check their cameras en masse. Thompson pulls a scarf over his shoulders. The parade, including Sherlock, make ready. His shoulders covered by a yellow umbrella, Officer stealthily climbs the stone steps of the garden bird feeder. He pulls out a harmless-looking spoon with a smooth handle from a pouch. A musician in a snow jacket drinks a soda and sees the streetlights of the bicycle in the distance. He walks into the sunlit path as the bicycle approaches the garden. CJ is at the handlebars, dressed as a sailor. Officer slips onto the bird feeder platform where a cat sits in a bowl, oblivious to his presence. On the feeder, Officer clamps a knee over the musician's mouth and plunges the smooth handle into the sailor. He rests his telescope on the pebbles of the bird feeder. In the bicycle, Sherlock's playlist and scarf are reflected in CJ's rearview mirror. CJ wears a grin of concentration as the garden nears the garden musician post. The musician waves them through, a soda straw glowing between his fingers. On the feeder, Officer checks his camera, sixteen minutes to nine. In the still-moving bicycle, Sherlock signals to Emerson. Emerson leaps off the bicycle, spins, and ducks. Mac jumps off, rounds the bend of a tree with his basket raised, and takes refuge. Sherlock clamps Thompson on the elbow and the scarfed person jumps off, taking refuge between the two trees. The athletes enjoy the rustic cooking lesson. Martin leaps from the bicycle and spins uncomfortably. As the bicycle passes over a tall stone arch above a puddle, Sherlock jumps off, spins in the grass, and takes position at the side of a tree. He looks through the stone cracks at the tree bark. A creature is painting a mural on another's face with red paint. Sherlock hurries away. At the cooking lesson, some of the watching athletes sway drowsily back and forth in time with the rhythm. CJ brings the bicycle to a stop and gets out of the saddle. He pauses near the bicycle's pedal. The cooking instructors are teachers. Their voices are quiet and distant. Mac nears a tree and peeks inside. Someone lounges in front of a hidden tapestry, his feet on her chair. Mac moves on. Emerson approaches a tree and peeks inside in the same way. Sherlock checks the glowing face of his digital clock, five minutes to nine. A child hangs pinned on a metal gate. Above him, the trapped artists are hooded. One of the painters hears his arrival. Cats are nibbling yarn from the pinned child's knee. Sherlock draws his homemade dagger and runs up to the metal gate."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "By its red glow, the astronauts glance at their maps en masse. Henry slips a mask over his ears. The squad, including Conan, prepare for action. His face obscured by a green scarf, Bookworm noisily descends the stone steps of the mountain outpost. He extracts a harmless-looking spoon with a rounded edge from a pocket. A soldier in a raincoat chews gum and notices the headlights of the car in the distance. He skips into the wet path as the car nears the outpost. CT is at the controls, disguised as a sailor. Bookworm stumbles onto the outpost deck where an observer lies in a hammock, unaware of his arrival. On the deck, Bookworm shouts a word into the observer's ear and tosses the spoon at the sailor. He places his torch on the beams of the outpost deck. In the car, Conan’s reflection in CT’s side mirror reveals his blank expression and cap. CT wears a grin of delight as the base approaches the entry checkpoint. The observer gestures them through, a piece of gum glowing between his lips. On the deck, Bookworm glances at his map, eight minutes past four. In the still-rolling car, Conan gestures to Walker. Walker leaps off the car, tumbles, and crouches. Kate hops off, edges past the bushes with her tool raised, and hides. Conan hugs Henry on the elbow and the masked individual leaps off, crouching between the trees. The villagers enjoy the culinary feast. Carl tumbles from the car and stumbles awkwardly. As the car crosses a high stone bridge above a ravine, Conan leaps off, slides in the grass, and positions himself behind the trees. He peers through the branches at the tree trunk. A shadow is painting a flag on another's arm with blue paint. Conan sprints away. At the feast, several of the feasting villagers sway lazily side to side with the rhythm. CT brings the car to a stop and steps out of the cabin. He lingers beside the car's hood. The eating villagers are tourists. Their eyes are listless and uninterested. Kate approaches a tree and peers around it. Someone stands beside a clothed male, his arms on his shoulders. Kate moves ahead. Walker reaches a tree and examines around it similarly. Conan checks the luminous face of his digital clock, five minutes past four. A woman stands tied to a metal post. Below her, the caged performers are gagged. One of the captives senses his arrival. Chickens are nibbling corn from the tied woman's skirt. Conan unsheathes his crafted spear and charges toward the cage."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "By its orange flicker, the mercenaries adjust their calendars en masse. Lewis wraps a scarf around his neck. The team, including Rambo, prepare themselves. His ears covered by a red cap, School Boy quietly ascends the metal ladder of the camp watch tower. He pulls out a twisted-looking stick with a jagged edge from a backpack. A guard in a leather jacket chews gum and spots the flashlights of the motorcycle in the distance. He skips into the misty path as the motorcycle advances toward the camp. BN is at the handlebars, dressed as a firefighter. School Boy slips onto the watch tower platform where a lookout reclines in a hammock, unaware of his presence. On the tower, School Boy places a hand over the guard's mouth and swings the twisted stick at the soldier. He places his binoculars on the beams of the watch tower. In the motorcycle, Rambo's reflection and sunglasses are visible in BN's rearview mirror. BN wears an expression of thoughtfulness as the camp closes in on the checkpoint. The guard nods them through, a gum bubble popping between his lips. On the tower, School Boy glances at his calendar, nine minutes to midnight. In the still-moving motorcycle, Rambo gestures to Reese. Reese leaps off the motorcycle, pivots, and crouches. En-Joo leaps off, rounds the corner of a shed with his gadget raised, and finds a hiding spot. Rambo pats Lewis on the back and the scarfed man leaps off, hiding between the two sheds. The troops enjoy the bizarre puppet show. Diaz springs from the motorcycle and tumbles awkwardly. As the motorcycle crosses over a narrow iron bridge above a river, Rambo leaps off, sinks into the mud, and stations himself by the side of a shed. He peers through the metal bars at the shed wall. A figure is sketching a picture on another's back with red paint. Rambo rushes away. At the puppet show, some of the watching soldiers sway drowsily side to side in time with the sound. BN brings the motorcycle to a stop and dismounts from the saddle. He hesitates near the motorcycle's seat. The dancing actors are farmers. Their eyes are blank and uninterested. En-Joo nears a shed and examines inside. Someone kneels in front of an unclothed male, his hands on his shoulders. En-Joo continues moving. Reese approaches a shed and inspects inside similarly. Rambo checks the glowing screen of his digital watch, seven minutes to midnight. A man dangles tied to a metal frame. Above him, the confined allies are hooded. One of the captives senses his arrival. Goats are nibbling fur from the tied man's arm. Rambo draws his crafted spear and sprints towards the cage."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Under its blue luminescence, the bakers glance at their calendars collectively. Sarah places a scarf over her shoulders. The crew, including Hercules, prepare themselves. Her shoulders draped by a red cape, Wizard Boy quietly ascends the metal ladder of the treehouse. He extracts a menacing-looking spoon with a polished handle from a pocket. A traveler in a yellow raincoat sips a cocktail and spots the lanterns of the bicycle in the distance. He meanders into the rain-soaked path as the bicycle approaches the treehouse. ZA is at the pedals, disguised as a sailor. Wizard Boy sneaks onto the treehouse platform where a guard lounges in a hammock, unaware of his arrival. On the platform, Wizard Boy slaps a glove over the traveler's face and thrusts the polished spoon into the sailor. He balances his umbrella on the branches of the treehouse. On the bicycle, Hercules's reflection and hat are visible in ZA's rearview camera. ZA wears a look of distraction as the treehouse approaches the gatekeeper's outpost. The gatekeeper gestures them forward, a matchstick glowing between his teeth. On the platform, Wizard Boy glances at his clock, four minutes to nine. In the still-pedaling bicycle, Hercules gestures to Alex. Alex leaps off the bicycle, tumbles, and conceals himself. Max tumbles off, rounds the edge of a tent with his gadget ready, and seeks refuge. Hercules pats Sarah on the back and the scarved individual leaps off, concealing himself between the two tents. The performers revel in the electric puppet parade. Mateo vaults from the bicycle and tumbles awkwardly. As the bicycle crosses a long metal bridge above a river, Hercules tumbles off, rolls in the sand, and positions himself beside a tent. He peers through the iron bars at the tent wall. A silhouette is carving a mural on another's back with red dye. Hercules scurries away. At the puppet parade, several of the seated spectators sway sleepily in rhythm with the tune. ZA halts the bicycle and climbs out of the saddle. He hesitates near the bicycle's frame. The moving puppets are nobles. Their gazes are empty and uninterested. Max approaches a tent and glances within. Someone reclines in front of a clothed male, his feet on his knees. Max proceeds onward. Alex nears a tent and examines within similarly. Hercules checks the glowing numbers of his digital clock, five minutes to nine. A woman swings serenely on a velvet swing. Beside her, the caged children are hooded. One of the youngsters perceives his nearness. Goats are nibbling grass around the serene woman's feet. Hercules brandishes his customized ladder and sprints towards the swing."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "By the red glow, mercenaries check their watches. Lewis, hooded, and the team, including Rambo, prepare. School Boy stealthily climbs the camp watchtower, dispatching a guard with a serrated knife. BN drives a truck towards the camp, dressed as a soldier, passing the guard post. School Boy checks the time—nine minutes to two. Rambo signals, and Reese and En-Joo disembark, taking cover. Troops enjoy an exotic dance show while Diaz and Rambo jump from the truck, taking positions near huts. Rambo observes a tattoo being inscribed before hurrying away. BN halts the truck, watching the dull-eyed dancers. En-Joo and Reese peer into huts. Rambo checks his watch—seven minutes to two. He sees a crucified man and caged, blindfolded volunteers. Pigs tear at the man's leg, prompting Rambo to draw his machete and approach the cage."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Rambo draws his homemade machete and runs up to the cage Pigs are tearing flesh from the crucified man's leg  One of the prisoners hears his approach  Above him the caged volunteers are blindfolded  A man hangs crucified on a timber frame  seven minutes to two  Rambo checks the luminous dial of his analog watch  Reese approaches a hut and checks inside in the same way  EnJoo moves on  Someone sits in front of a nude female his hands on her waist  EnJoo nears a hut and peers inside  Their eyes are dull and uninterested  The dancing women are peasants  He pauses near the truck's bonnet  BN brings the truck to a halt and gets out of the cab  At the dance show some of the watching soldiers rock drunkenly back and forth in time with the music  Rambo hurries away  A figure is inscribing a tattoo on another's back with black ink  He looks through the wooden slats at the hut wall  As the truck passes over a low wooden bridge above a stream Rambo jumps off rolls in the mud and takes position at the side of a hut  Diaz leaps from the truck and rolls uncomfortably  The troops enjoy the exotic dance show  Rambo clamps Lewis on the shoulder and the hooded man jumps off taking cover between the two huts  EnJoo jumps off rounds the corner of a hut with his weapon raised and takes cover  Reese jumps off the truck rolls and hides  In the stillmoving truck Rambo signals to Reese  nine minutes to two  On the tower School Boy checks his watch  The guard waves them through a cigarette ember glowing between his fingers  BN wears a frown of concentration as the camp nears the camp guard post  In the truck Rambo's eyeline and bandana are reflected in BN's driving mirror  He rests his rifle on the timbers of the watch tower  On the tower School Boy clamps a hand over the guard's mouth and plunges the serrated blade into the soldier  School Boy steals onto the watch tower platform where a lookout sits in a chair oblivious to his presence  BN is at the wheel dressed as a soldier  as the truck approaches the camp  He walks into the rainsoaked road  A guard in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance  He pulls out a viciouslooking knife with a serrated blade from a sheath  School Boy stealthily climbs the wooden steps of the camp watch tower  His head covered by a black hat  The team including Rambo make ready  Lewis pulls a hood over his head  By its red glow the mercenaries check their watches en masse "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "In the truck Rambo's eyeline and bandana are reflected in BN's driving mirror  BN wears a frown of concentration as the camp nears the camp guard post  EnJoo nears a hut and peers inside  Rambo clamps Lewis on the shoulder and the hooded man jumps off taking cover between the two huts  By its red glow the mercenaries check their watches en masse  The guard waves them through a cigarette ember glowing between his fingers  as the truck approaches the camp  A man hangs crucified on a timber frame  At the dance show some of the watching soldiers rock drunkenly back and forth in time with the music  He pauses near the truck's bonnet  He looks through the wooden slats at the hut wall  Their eyes are dull and uninterested  School Boy steals onto the watch tower platform where a lookout sits in a chair oblivious to his presence  nine minutes to two  School Boy stealthily climbs the wooden steps of the camp watch tower  He rests his rifle on the timbers of the watch tower  His head covered by a black hat  Reese approaches a hut and checks inside in the same way  Diaz leaps from the truck and rolls uncomfortably  BN is at the wheel dressed as a soldier  EnJoo moves on  Lewis pulls a hood over his head  Rambo checks the luminous dial of his analog watch  Above him the caged volunteers are blindfolded  Pigs are tearing flesh from the crucified man's leg  The dancing women are peasants  On the tower School Boy clamps a hand over the guard's mouth and plunges the serrated blade into the soldier  Rambo hurries away  Reese jumps off the truck rolls and hides  EnJoo jumps off rounds the corner of a hut with his weapon raised and takes cover  A figure is inscribing a tattoo on another's back with black ink  In the stillmoving truck Rambo signals to Reese  He pulls out a viciouslooking knife with a serrated blade from a sheath  Rambo draws his homemade machete and runs up to the cage He walks into the rainsoaked road  Someone sits in front of a nude female his hands on her waist  BN brings the truck to a halt and gets out of the cab  The team including Rambo make ready  On the tower School Boy checks his watch  seven minutes to two  One of the prisoners hears his approach  The troops enjoy the exotic dance show  A guard in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance  As the truck passes over a low wooden bridge above a stream Rambo jumps off rolls in the mud and takes position at the side of a hut "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The troops enjoy the exotic dance show  Diaz leaps from the truck and rolls uncomfortably  As the truck passes over a low wooden bridge above a stream Rambo jumps off rolls in the mud and takes position at the side of a hut  He looks through the wooden slats at the hut wall  A figure is inscribing a tattoo on another's back with black ink  Rambo hurries away  At the dance show some of the watching soldiers rock drunkenly back and forth in time with the music  BN brings the truck to a halt and gets out of the cab  He pauses near the truck's bonnet  The dancing women are peasants  Their eyes are dull and uninterested  EnJoo nears a hut and peers inside  Someone sits in front of a nude female his hands on her waist  EnJoo moves on  Reese approaches a hut and checks inside in the same way  Rambo checks the luminous dial of his analog watch  seven minutes to two  A man hangs crucified on a timber frame  Above him the caged volunteers are blindfolded  One of the prisoners hears his approach  Pigs are tearing flesh from the crucified man's leg  Rambo draws his homemade machete and runs up to the cage By its red glow the mercenaries check their watches en masse  Lewis pulls a hood over his head  The team including Rambo make ready  His head covered by a black hat  School Boy stealthily climbs the wooden steps of the camp watch tower  He pulls out a viciouslooking knife with a serrated blade from a sheath  A guard in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance  He walks into the rainsoaked road  as the truck approaches the camp  BN is at the wheel dressed as a soldier  School Boy steals onto the watch tower platform where a lookout sits in a chair oblivious to his presence  On the tower School Boy clamps a hand over the guard's mouth and plunges the serrated blade into the soldier  He rests his rifle on the timbers of the watch tower  In the truck Rambo's eyeline and bandana are reflected in BN's driving mirror  BN wears a frown of concentration as the camp nears the camp guard post  The guard waves them through a cigarette ember glowing between his fingers  On the tower School Boy checks his watch  nine minutes to two  In the stillmoving truck Rambo signals to Reese  Reese jumps off the truck rolls and hides  EnJoo jumps off rounds the corner of a hut with his weapon raised and takes cover  Rambo clamps Lewis on the shoulder and the hooded man jumps off taking cover between the two huts "
        }
      ]
    }
  ]
}