{
  "ground_truth": "The soldier with the dancing girl drags her towards his hut, and she struggles. He slaps her, causing her to fall to the ground, then gestures to the hut and crawls underneath it. Unseen by the soldier, En-Joo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl, and En-Joo dives towards him, plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it, seeing Sarah lying prone in the pig sty. He throws open a wooden bolt, opens a gate, and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious, and Rambo rushes over to the partition between them, pushing pigs out of the way. En-Joo checks his watch—10 seconds to 2. On the watch tower, School Boy has a soldier in the site of his weapon, and his watch shows 2 AM. He fires, starting by picking off the guard below and the guards in two adjacent watch towers. En-Joo and the girl exchange glances and move, but the boozy soldier has gotten to Sarah first. The hidden Rambo watches as she's dragged away, waits a few seconds, then follows them. BN's party joins En-Joo and the girls in a dark clearing beyond the camp gate. The soldier emerges from between two huts, dragging Sarah along by her hair, her arms tightly bound behind her back. Unseen, Rambo runs behind them. At the dance, one of the women is being held down and throttled by a soldier, and another trooper runs through the throng, brandishing a flare billowing red smoke. Lewis joins the other mercenaries, and Louis throws Michael to the ground and pulls a knife on him. BN leads them away, while School Boy shoots Lewis a murderous look. At the dance, the smoke from the flare is everywhere, and one of the women's dresses is torn away, leaving her topless. Rambo follows Sarah and the soldier, who drags her into his hut and throws her to the floor, with the door swinging closed behind them. At the dance, a struggling woman has her face slapped by one of the drunken crowd, and at the same time, Sarah suffers the same abuse at the hands of a soldier who bears down on her, reaching for his belt buckle. Rambo takes the officer from behind, grabbing a clump of the man's hair in his right hand and clutching the throat with his left, as the officer's face becomes a rictus grimace while Rambo's fingers dig deep into the cartilage and bone at the man's neck.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The warrior with the gyrating maiden pulls her towards his shack, and she resists. He smacks her, causing her to crash to the earth, then signals to the shack and crawls beneath it. Unseen by the warrior, En-Joo clamps a hand over her mouth and holds a digit to his lips. The warrior looks beneath the shack for the maiden, and En-Joo lunges towards him, thrusting a dagger into his neck and stabbing repeatedly. He hauls the warrior's corpse out of view. Rambo rushes out to a shack and lunges beneath it, spying Sarah lying prone in the swine pen. He flings open a wooden latch, opens a gate, and crawls inside. He looks out through the timbers and sees the warrior with the bottle of spirits returning. Sarah is asleep or insensible, and Rambo dashes over to the partition between them, shoving swine out of the way. En-Joo verifies his timepiece—10 seconds to 2. On the watch tower, School Boy has a warrior in the site of his firearm, and his timepiece shows 2 AM. He discharges, starting by picking off the sentry below and the sentries in two neighboring watch towers. En-Joo and the maiden exchange glances and move, but the inebriated warrior has reached Sarah first. The concealed Rambo observes as she's pulled away, waits a few seconds, then trails them. BN's group joins En-Joo and the maidens in a dim clearing beyond the camp gate. The warrior emerges from between two shacks, pulling Sarah along by her tresses, her limbs tightly bound behind her back. Unseen, Rambo dashes behind them. At the dance, one of the females is being held down and choked by a warrior, and another trooper runs through the cluster, brandishing a flare emitting crimson smoke. Lewis joins the other mercenaries, and Louis hurls Michael to the earth and pulls a dagger on him. BN leads them away, while School Boy shoots Lewis a murderous look. At the dance, the smoke from the flare is everywhere, and one of the females' garments is torn away, leaving her topless. Rambo follows Sarah and the warrior, who pulls her into his shack and throws her to the ground, with the portal swinging closed behind them. At the dance, a struggling woman has her visage slapped by one of the intoxicated crowd, and at the same time, Sarah suffers the same abuse at the hands of a warrior who bears down on her, reaching for his belt buckle. Rambo takes the officer from behind, grabbing a tuft of the man's hair in his right hand and clutching the throat with his left, as the officer's visage becomes a rictus grimace while Rambo's fingers dig deep into the cartilage and bone at the man's neck."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The soldier with the dancing girl is dragged by her towards his hut, and she is struggled with. She is slapped by him, causing her to fall to the ground, then the hut is gestured to by him and he crawls underneath it. Unseen by the soldier, a hand is clamped over her mouth by En-Joo, who holds a finger to his lips. The girl is looked for underneath the hut by the soldier, and En-Joo dives towards him, plunging a knife into his throat while he stabs repeatedly. The soldier's body is dragged by him out of sight. A hut is run to by Rambo, and it is dived underneath by him, seeing Sarah lying prone in the pig sty. A wooden bolt is thrown open by him, a gate is opened, and he crawls inside. The timbers are looked out through by him, and he sees the soldier with the bottle of spirits returning. Sarah, who is asleep or unconscious, is rushed to by Rambo, who pushes pigs out of the way at the partition between them. His watch is checked by En-Joo—10 seconds to 2. On the watch tower, a soldier is kept in the site of his weapon by School Boy, and 2 AM is shown on his watch. He starts firing by picking off the guard below and the guards in two adjacent watch towers. Glances are exchanged by En-Joo and the girl, and they move, but Sarah is gotten to by the boozy soldier first. Rambo, hidden, watches as she's dragged away, waits a few seconds, then them is followed by him. En-Joo and the girls in a dark clearing beyond the camp gate are joined by BN's party. The soldier emerges from between two huts, dragging Sarah along by her hair, her arms tightly bound behind her back. Unseen, they are run behind by Rambo. At the dance, a woman is held down and throttled by a soldier, and through the throng runs another trooper, brandishing a flare billowing red smoke. The other mercenaries are joined by Lewis, and Michael is thrown to the ground by Louis and has a knife pulled on him. They are led away by BN, while Lewis is shot a murderous look by School Boy. At the dance, the smoke from the flare is everywhere, and the dress of one of the women is torn away, leaving her topless. Sarah and the soldier are followed by Rambo, who drags her into his hut and her is thrown to the floor by him, with the door swinging closed behind them. At the dance, the face of a struggling woman is slapped by one of the drunken crowd, and at the same time, the same abuse is suffered by Sarah at the hands of a soldier who bears down on her, his belt buckle being reached for. The officer is taken from behind by Rambo, as a clump of the man's hair is grabbed in his right hand and the throat is clutched with his left by Rambo, while the officer's face becomes a rictus grimace as Rambo's fingers dig deep into the cartilage and bone at the man's neck."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The soldier drags the dancing girl to his hut, and she resists. He slaps her, causing her to fall, then gestures to the hut and crawls underneath. Unseen, En-Joo covers her mouth and signals for silence. The soldier searches under the hut, and En-Joo attacks, stabbing him repeatedly and hiding the body. Rambo finds Sarah in a pig sty, opens a gate, and crawls inside. He sees a soldier returning with spirits. Sarah is unconscious, and Rambo pushes pigs aside to reach her. En-Joo checks his watch—10 seconds to 2. On the watchtower, School Boy targets a soldier, and his watch shows 2 AM. He fires, taking out guards. En-Joo and the girl move, but the soldier reaches Sarah first. Rambo follows them. BN's group joins En-Joo and the girls in a clearing. A soldier drags Sarah by her hair, arms bound. Rambo follows unseen. At the dance, a woman is throttled by a soldier, and another runs with a flare emitting red smoke. Lewis joins the mercenaries, and Louis threatens Michael. BN leads them away, while School Boy glares at Lewis. Smoke fills the dance, and a woman's dress is torn, leaving her topless. Rambo follows Sarah and the soldier into a hut. At the dance, a woman is slapped, and Sarah suffers the same from a soldier reaching for his belt. Rambo attacks, grabbing the officer's hair and throat, his fingers digging into the man's neck."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The soldier drags the dancing girl to his hut, slaps her, and she falls. He gestures to the hut and crawls underneath. Unseen, En-Joo covers her mouth, signaling silence. The soldier searches under the hut, and En-Joo stabs him, dragging the body away. Rambo finds Sarah in a pig sty, opens a gate, and crawls inside. He sees a soldier returning with spirits. Sarah is unconscious, and Rambo pushes pigs aside to reach her. En-Joo checks his watch—10 seconds to 2. School Boy targets a soldier at 2 AM, shooting guards in watch towers. En-Joo and the girl move, but a soldier reaches Sarah first. Rambo follows them. BN's party joins En-Joo and the girls in a clearing. A soldier drags Sarah by her hair, unseen by Rambo. At the dance, a woman is throttled, and a trooper with a flare runs through. Lewis joins mercenaries, and Louis threatens Michael. BN leads them away, while School Boy glares at Lewis. Smoke fills the dance, and a woman's dress is torn. Rambo follows Sarah and the soldier into a hut. At the dance, a woman is slapped, and Sarah is abused by a soldier. Rambo attacks the officer, gripping his hair and throat, causing a grimace as his fingers dig into the neck."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The soldier, accompanied by the dancing girl, forcefully drags her towards his small, dimly lit hut, while she desperately struggles against his grip. In a moment of violence, he slaps her hard, causing her to fall heavily to the ground. He then gestures towards the hut and crawls underneath it. Unbeknownst to the soldier, En-Joo is hidden there, silently clamping a hand over her mouth and holding a finger to his lips, signaling her to remain quiet. The soldier peers underneath the hut, searching for the girl, but En-Joo swiftly dives towards him, plunging a sharp knife into his throat and stabbing repeatedly with fierce determination. He then drags the soldier's lifeless body out of sight, ensuring it remains hidden. Meanwhile, Rambo runs out to another hut and dives underneath it, where he finds Sarah lying prone in the filthy pig sty. He quickly throws open a wooden bolt, opens a gate, and crawls inside the enclosure. Peering out through the timbers, he sees the soldier with the bottle of spirits making his return. Sarah appears to be either asleep or unconscious, and Rambo rushes over to the partition separating them, pushing the pigs out of his way. En-Joo checks his watch, noting that there are only 10 seconds until 2 AM. Up in the watch tower, School Boy has a soldier in the sights of his weapon, and his watch confirms the time as 2 AM. He fires his weapon, starting by picking off the guard below and then targeting the guards in two adjacent watch towers. En-Joo and the girl exchange meaningful glances and begin to move, but the inebriated soldier reaches Sarah first. Hidden from view, Rambo watches intently as she is dragged away, waits a few tense seconds, and then follows them stealthily. BN's party joins En-Joo and the girls in a dark, secluded clearing beyond the camp gate. A soldier emerges from between two huts, dragging Sarah along by her hair, her arms tightly bound behind her back. Unseen, Rambo runs silently behind them. At the chaotic dance, one of the women is being held down and throttled by a soldier, while another trooper runs through the throng, brandishing a flare that billows red smoke into the air. Lewis joins the other mercenaries, and Louis aggressively throws Michael to the ground, pulling a knife on him threateningly. BN leads them away, while School Boy shoots Lewis a murderous look filled with disdain. At the dance, the smoke from the flare envelops the area, and one of the women's dresses is torn away, leaving her exposed and topless. Rambo continues to follow Sarah and the soldier, who drags her into his hut and throws her roughly to the floor, with the door swinging closed behind them. Back at the dance, a struggling woman has her face slapped by one of the drunken crowd, and simultaneously, Sarah suffers the same abuse at the hands of a soldier who looms over her, reaching for his belt buckle with malicious intent. Rambo takes the officer by surprise from behind, grabbing a clump of the man's hair in his right hand and clutching his throat with his left. The officer's face contorts into a rictus grimace as Rambo's fingers dig deep into the cartilage and bone at the man's neck, exerting a relentless grip."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The soldier, accompanied by the dancing girl, forcefully drags her towards his small, dimly lit hut, a place that seems to grow more foreboding with each step, as she desperately struggles against his unyielding grip. In a sudden and brutal moment of violence, he delivers a harsh slap across her face, causing her to fall heavily and painfully to the ground. He then gestures towards the entrance of the hut and proceeds to crawl underneath it. Unbeknownst to the soldier, En-Joo is already hidden there, silently clamping a hand over her mouth and holding a finger to his lips, signaling her with urgency and caution to remain quiet and not make a sound. The soldier peers underneath the hut, searching intently for the girl, but En-Joo quickly dives towards him, plunging a sharp, lethal knife into his throat and stabbing repeatedly with fierce determination and unwavering resolve. He then drags the soldier's lifeless body out of sight, ensuring it remains completely hidden from view. Meanwhile, Rambo runs out to another hut and dives underneath it, where he finds Sarah lying prone in the filthy pig sty. He quickly, yet carefully, throws open a wooden bolt, opens a gate, and crawls inside the enclosure. Peering out through the rough timbers, he sees the soldier with the bottle of spirits making his return. Sarah appears to be either asleep or unconscious, and Rambo rushes over to the partition separating them, pushing the pigs out of his way with urgency. En-Joo checks his watch, noting with precision that there are only 10 seconds remaining until 2 AM. Up in the watch tower, School Boy has a soldier within the deadly sights of his weapon, and his watch confirms the precise, critical time as 2 AM. He fires his weapon, starting by picking off the guard below with deadly accuracy and then targeting the guards in two adjacent watch towers. En-Joo and the girl exchange meaningful, determined glances and begin to move, but the inebriated soldier manages to reach Sarah first. Hidden from view, Rambo watches with intense focus as she is dragged away, waits a few tense, heart-pounding seconds, and then follows them stealthily, like a shadow. BN's party joins En-Joo and the girls in a dark, secluded clearing beyond the camp gate. A soldier emerges from between two huts, dragging Sarah along by her hair, her arms cruelly and tightly bound behind her back. Unseen and unnoticed, Rambo runs silently behind them with the stealth of a predator. At the chaotic dance, one of the women is being held down and throttled by a soldier, while another trooper runs frantically through the throng, brandishing a flare that billows red smoke dramatically into the air. Lewis joins the other mercenaries, and Louis aggressively throws Michael to the ground, pulling a knife on him with a threatening demeanor. BN leads them away, while School Boy shoots Lewis a murderous look filled with disdain and seething contempt. At the dance, the smoke from the flare envelops the chaotic area, and one of the women's dresses is torn away, leaving her exposed and topless, vulnerable to the prying eyes of the crowd. Rambo continues to follow Sarah and the soldier, who drags her into his hut with force and throws her roughly to the floor, with the door swinging closed ominously behind them. Back at the chaotic dance, a struggling woman has her face slapped by one of the drunken crowd, and simultaneously, Sarah suffers the same abuse at the hands of a soldier who looms maliciously over her, reaching for his belt buckle with sinister intent. Rambo takes the officer by complete surprise from behind, grabbing a clump of the man's hair in his right hand and clutching his throat with his left, exerting a relentless and unyielding grip. The officer's face contorts into a rictus grimace as Rambo's fingers dig deep into the cartilage and bone at the man's neck, emphasizing his power and control."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The soldier, gripping the dancing girl firmly, begins to drag her towards his hut, her resistance evident as she struggles against his hold. In response to her defiance, he delivers a sharp slap to her face, causing her to lose her balance and fall to the ground. He then gestures towards the hut, indicating where he intends to take her, and proceeds to crawl underneath it. Unbeknownst to the soldier, En-Joo is already hidden there, and he swiftly clamps a hand over the girl's mouth to silence her, simultaneously holding a finger to his lips to signal her to remain quiet. As the soldier peers underneath the hut in search of the girl, En-Joo seizes the opportunity to dive towards him, plunging a knife into the soldier's throat and repeatedly stabbing him to ensure he is incapacitated. He then drags the soldier's lifeless body out of sight to prevent detection. Meanwhile, Rambo makes his way to a nearby hut, diving underneath it to find Sarah lying prone in the pig sty. He quickly throws open a wooden bolt, opens a gate, and crawls inside to reach her. Peering out through the timbers, he spots a soldier returning with a bottle of spirits. Observing that Sarah is either asleep or unconscious, Rambo rushes over to the partition separating them, pushing pigs aside to clear his path. En-Joo checks his watch, noting that there are only 10 seconds until 2 AM. In the watch tower, School Boy has a soldier in the sights of his weapon, and as his watch strikes 2 AM, he fires, starting by picking off the guard below and then targeting the guards in two adjacent watch towers. En-Joo and the girl exchange glances, understanding the need to move quickly, but the boozy soldier reaches Sarah first. Hidden from view, Rambo watches as she is dragged away, waiting a few seconds before stealthily following them. BN's party joins En-Joo and the girls in a dark clearing beyond the camp gate, coordinating their escape. The soldier emerges from between two huts, dragging Sarah by her hair, her arms tightly bound behind her back, while Rambo, unseen, runs behind them, ready to intervene. At the dance, chaos ensues as one of the women is held down and throttled by a soldier, while another trooper runs through the crowd, brandishing a flare that billows red smoke. Lewis joins the other mercenaries, and in a tense confrontation, Louis throws Michael to the ground and menacingly pulls a knife on him. BN leads the group away, while School Boy shoots Lewis a murderous look, indicating the tension among them. Amidst the dance, the smoke from the flare envelops the area, and one of the women's dresses is torn away, leaving her exposed. Rambo continues to follow Sarah and the soldier, who drags her into his hut and throws her to the floor, the door swinging closed behind them. At the dance, a struggling woman is slapped across the face by one of the drunken crowd, and simultaneously, Sarah endures the same abuse at the hands of a soldier who looms over her, reaching for his belt buckle with malicious intent. Rambo seizes the moment to take the officer by surprise, grabbing a clump of the man's hair with his right hand and clutching his throat with his left. The officer's face contorts into a rictus grimace as Rambo's fingers dig deep into the cartilage and bone at the man's neck, effectively neutralizing the threat."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The soldier drags the dancing girl toward his hut, and when she struggles, he slaps her to the ground before gesturing to the hut and crawling underneath it. Unseen, En-Joo silences her and signals for quiet. As the soldier searches beneath the hut, En-Joo swiftly attacks, stabbing him in the throat and dragging the body out of sight. Meanwhile, Rambo reaches a hut, finds Sarah in a pig sty, and enters by opening a gate. Observing the returning soldier with spirits, he pushes through pigs to reach Sarah. En-Joo checks his watch, noting it's nearly 2 AM. On the watch tower, School Boy targets and shoots guards, initiating the attack. En-Joo and the girl move as the soldier reaches Sarah first. Rambo, hidden, follows them. BN's group joins En-Joo and the girls in a clearing. The soldier drags Sarah by her hair, arms bound, as Rambo stealthily follows. At the dance, chaos ensues with a soldier throttling a woman and another brandishing a flare. Lewis confronts Michael with a knife, and BN leads the group away while School Boy glares at Lewis. Amidst the flare's smoke, a woman's dress is torn, leaving her exposed. Rambo trails Sarah and the soldier into a hut, where she's thrown to the floor. Simultaneously, a woman at the dance and Sarah are slapped by soldiers. Rambo seizes the officer from behind, gripping his hair and throat, as the officer's face contorts in pain."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The soldier with the dancing girl, who was one of the local performers brought in to entertain the troops, drags her towards his hut, and she struggles. He slaps her, causing her to fall to the ground, then gestures to the hut, a rudimentary shelter made from bamboo and thatch, and crawls underneath it. Unseen by the soldier, En-Joo, a seasoned operative known for his stealth, clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl, and En-Joo, trained in close combat techniques, dives towards him, plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight, hiding it in the thick underbrush surrounding the camp. Rambo, a former Green Beret with a reputation for his survival skills, runs out to a hut and dives underneath it, seeing Sarah lying prone in the pig sty, which is filled with mud and filth. He throws open a wooden bolt, opens a gate, and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits, a contraband item among the troops, returning. Sarah is asleep or unconscious, possibly from the physical exhaustion of captivity, and Rambo rushes over to the partition between them, pushing pigs out of the way. En-Joo checks his watch—10 seconds to 2, knowing they have to synchronize their moves with the planned attack. On the watch tower, a strategic vantage point within the camp, School Boy has a soldier in the site of his weapon, and his watch shows 2 AM, the designated time for their operation. He fires, starting by picking off the guard below and the guards in two adjacent watch towers, ensuring a clear path for his comrades. En-Joo and the girl exchange glances and move, but the boozy soldier has gotten to Sarah first. The hidden Rambo watches as she's dragged away, waits a few seconds, then follows them. BN's party, a group of mercenaries hired for their expertise, joins En-Joo and the girls in a dark clearing beyond the camp gate, a prearranged rallying point. The soldier emerges from between two huts, dragging Sarah along by her hair, her arms tightly bound behind her back. Unseen, Rambo runs behind them, mindful of the silent approach needed. At the dance, one of the women, captured along with Sarah, is being held down and throttled by a soldier, and another trooper runs through the throng, brandishing a flare billowing red smoke, a signal to alert others of an emergency. Lewis joins the other mercenaries, known for their ruthless efficiency, and Louis throws Michael to the ground and pulls a knife on him, driven by simmering tensions in the group. BN leads them away, while School Boy shoots Lewis a murderous look, reflecting internal conflicts. At the dance, the smoke from the flare is everywhere, and one of the women's dresses is torn away, leaving her topless, adding to the chaos and fear. Rambo follows Sarah and the soldier, who drags her into his hut and throws her to the floor, with the door swinging closed behind them. At the dance, a struggling woman has her face slapped by one of the drunken crowd, and at the same time, Sarah suffers the same abuse at the hands of a soldier who bears down on her, reaching for his belt buckle in a predatory manner. Rambo takes the officer from behind, grabbing a clump of the man's hair in his right hand and clutching the throat with his left, as the officer's face becomes a rictus grimace while Rambo's fingers, honed by years of combat experience, dig deep into the cartilage and bone at the man's neck."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The soldier with the dancing girl drags her towards his hut and she struggles. He slaps her causing her to fall to the ground then gestures to the hut and crawls underneath it. Unseen by the soldier EnJoo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl and EnJoo dives towards him plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it seeing Sarah lying prone in the pig sty. He throws open a wooden bolt opens a gate and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious and Rambo rushes over to the partition between them pushing pigs out of the way. EnJoo checks his watch—10 seconds to 2. On the watch tower School Boy has a soldier in the site of his weapon and his watch shows 2 AM. He fires starting by picking off the guard below and the guards in two adjacent watch towers. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. EnJoo and the girl exchange glances and move but the boozy soldier has gotten to Sarah first. The hidden Rambo watches as she is dragged away waits a few seconds then follows them. BN's party joins EnJoo and the girls in a dark clearing beyond the camp gate. The soldier emerges from between two huts dragging Sarah along by her hair her arms tightly bound behind her back. Unseen Rambo runs behind them. At the dance one of the women is being held down and throttled by a soldier and another trooper runs through the throng brandishing a flare billowing red smoke. Lewis joins the other mercenaries and Louis throws Michael to the ground and pulls a knife on him. BN leads them away while School Boy shoots Lewis a murderous look. At the dance the smoke from the flare is everywhere and one of the women's dresses is torn away leaving her topless. Rambo follows Sarah and the soldier who drags her into his hut and throws her to the floor with the door swinging closed behind them. At the dance a struggling woman has her face slapped by one of the drunken crowd and at the same time Sarah suffers the same abuse at the hands of a soldier who bears down on her reaching for his belt buckle. Rambo takes the officer from behind grabbing a clump of the man's hair in his right hand and clutching the throat with his left as the officer's face becomes a rictus grimace while Rambo's fingers dig deep into the cartilage and bone at the man's neck."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The soldier with the dancing girl drags her towards his hut and she struggles. He slaps her causing her to fall to the ground then gestures to the hut and crawls underneath it. Unseen by the soldier EnJoo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl and EnJoo dives towards him plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it seeing Sarah lying prone in the pig sty. He throws open a wooden bolt opens a gate and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious and Rambo rushes over to the partition between them pushing pigs out of the way. EnJoo checks his watch—10 seconds to 2. On the watch tower School Boy has a soldier in the site of his weapon and his watch shows 2 AM. He fires starting by picking off the guard below and the guards in two adjacent watch towers. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. EnJoo and the girl exchange glances and move but the boozy soldier has gotten to Sarah first. The hidden Rambo watches as she is dragged away waits a few seconds then follows them. BN's party joins EnJoo and the girls in a dark clearing beyond the camp gate. The soldier emerges from between two huts dragging Sarah along by her hair her arms tightly bound behind her back. Unseen Rambo runs behind them. At the dance one of the women is being held down and throttled by a soldier and another trooper runs through the throng brandishing a flare billowing red smoke. Lewis joins the other mercenaries and Louis throws Michael to the ground and pulls a knife on him. BN leads them away while School Boy shoots Lewis a murderous look. At the dance the smoke from the flare is everywhere and one of the women's dresses is torn away leaving her topless. Rambo follows Sarah and the soldier who drags her into his hut and throws her to the floor with the door swinging closed behind them. At the dance a struggling woman has her face slapped by one of the drunken crowd and at the same time Sarah suffers the same abuse at the hands of a soldier who bears down on her reaching for his belt buckle. Rambo takes the officer from behind grabbing a clump of the man's hair in his right hand and clutching the throat with his left as the officer's face becomes a rictus grimace while Rambo's fingers dig deep into the cartilage and bone at the man's neck."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The soldier with the dancing girl drags her towards his hut and she struggles. He slaps her causing her to fall to the ground then gestures to the hut and crawls underneath it. Unseen by the soldier EnJoo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl and EnJoo dives towards him plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it seeing Sarah lying prone in the pig sty. Lewis joins the other mercenaries and Louis throws Michael to the ground and pulls a knife on him. BN leads them away while School Boy shoots Lewis a murderous look. At the dance the smoke from the flare is everywhere and one of the women's dresses is torn away leaving her topless. Rambo follows Sarah and the soldier who drags her into his hut and throws her to the floor with the door swinging closed behind them. At the dance a struggling woman has her face slapped by one of the drunken crowd and at the same time Sarah suffers the same abuse at the hands of a soldier who bears down on her reaching for his belt buckle. Rambo takes the officer from behind grabbing a clump of the man's hair in his right hand and clutching the throat with his left as the officer's face becomes a rictus grimace while Rambo's fingers dig deep into the cartilage and bone at the man's neck."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The soldier with the dancing girl drags her towards his hut and she struggles. He slaps her causing her to fall to the ground then gestures to the hut and crawls underneath it. Unseen by the soldier EnJoo clamps a hand over her mouth and holds a finger to his lips. At the dance a struggling woman has her face slapped by one of the drunken crowd and at the same time Sarah suffers the same abuse at the hands of a soldier who bears down on her reaching for his belt buckle. Rambo takes the officer from behind grabbing a clump of the man's hair in his right hand and clutching the throat with his left as the officer's face becomes a rictus grimace while Rambo's fingers dig deep into the cartilage and bone at the man's neck."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The rooster with the bouncing balloon slides it towards his cave, and it bobs. He kicks it, causing it to drift to the ceiling, then points to the cave and skips around it. Unseen by the rooster, Fern clamps a lid over its spout and holds a wrench to his ears. The rooster peers around the cave for the balloon, and Fern jumps towards it, plunging a pencil into its fabric and poking repeatedly. He pulls the rooster's body out of view. Baxter runs out to a cave and jumps around it, seeing Wendy lying supine in the sand trap. He throws open a rusty lever, opens a fence, and skulks inside. He peers out through the vines and sees the rooster with the bottle of milk scampering. Wendy is snoring or daydreaming, and Baxter dashes over to the wall between them, shoving guinea pigs aside. Fern checks his compass—10 seconds to breakfast. On the tower, Sunny has a rooster in the path of his flashlight, and his compass shows lunchtime. He shines, starting by dazzling the gardener below and the tourists in two neighboring towers. Fern and the balloon exchange nods and leap, but the sleepy rooster has gotten to Wendy first. The lurking Baxter observes as she's tugged away, waits a few moments, then mimics them. RN's band joins Fern and the balloons in a shadowy meadow beyond the zoo fence. The rooster pops out from between two caves, tugging Wendy along by her tail, her toenails loosely tied in front of her stomach. Unseen, Baxter prances behind them. At the ceremony, one of the balloons is being inflated and flattened by a rooster, and another duck flaps through the throng, waving a candle emitting blue sparks. Trevor joins the other adventurers, and Jerry ducts Michael to the ceiling and brandishes a spoon at him. RN guides them astray, while Sunny sends Trevor a tender glance. At the ceremony, the sparks from the candle are lost, and one of the balloons' strings is snapped away, leaving it floating freely. Baxter mimics Wendy and the rooster, who tugs her into his cave and flips her to the ceiling, with the windows creaking shut behind them. At the ceremony, a bobbing balloon has its top flicked by one of the dancing crew, and meanwhile, Wendy encounters the same nuisance at the hands of a rooster who charges down towards her, grasping for his belt loop. Baxter seizes the mechanic from below, grasping a handful of the man's coat in his right hand and squeezing the chin with his left, as the mechanic's eyes become a twisted sneer while Baxter's knuckles press hard into the cheekbones and jaw at the man's neck."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The soldier drags the dancing girl towards his hut, slapping her as she struggles. En-Joo, unnoticed, hides with her beneath the hut. When the soldier searches for her, En-Joo kills him. Meanwhile, Rambo finds Sarah in a pig sty, but a soldier returns for her. Rambo watches unseen as she's dragged away. En-Joo checks his watch as School Boy, from a watch tower, begins shooting guards at 2 AM. En-Joo and the girl move, but Sarah is taken by a boozy soldier. Rambo follows stealthily. In the camp, chaos ensues as Lewis confronts Michael, while BN leads others away and School Boy glares at Lewis. Amidst the smoky dance, a woman is assaulted. Rambo trails Sarah to a hut where she's abused by a soldier. He attacks the soldier from behind, gripping his throat fiercely."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Rambo takes the officer from behind grabbing a clump of the man's hair in his right hand and clutching the throat with his left as the officer's face becomes a rictus grimace while Rambo's fingers dig deep into the cartilage and bone at the man's neck At the dance a struggling woman has her face slapped by one of the drunken crowd and at the same time Sarah suffers the same abuse at the hands of a soldier who bears down on her reaching for his belt buckle  Rambo follows Sarah and the soldier who drags her into his hut and throws her to the floor with the door swinging closed behind them  At the dance the smoke from the flare is everywhere and one of the women's dresses is torn away leaving her topless  BN leads them away while School Boy shoots Lewis a murderous look  Lewis joins the other mercenaries and Louis throws Michael to the ground and pulls a knife on him  At the dance one of the women is being held down and throttled by a soldier and another trooper runs through the throng brandishing a flare billowing red smoke  Unseen Rambo runs behind them  The soldier emerges from between two huts dragging Sarah along by her hair her arms tightly bound behind her back  BN's party joins EnJoo and the girls in a dark clearing beyond the camp gate  The hidden Rambo watches as she's dragged away waits a few seconds then follows them  EnJoo and the girl exchange glances and move but the boozy soldier has gotten to Sarah first  He fires starting by picking off the guard below and the guards in two adjacent watch towers  On the watch tower School Boy has a soldier in the site of his weapon and his watch shows 2 AM  EnJoo checks his watch—10 seconds to 2  Sarah is asleep or unconscious and Rambo rushes over to the partition between them pushing pigs out of the way  He looks out through the timbers and sees the soldier with the bottle of spirits returning  He throws open a wooden bolt opens a gate and crawls inside  Rambo runs out to a hut and dives underneath it seeing Sarah lying prone in the pig sty  He drags the soldier's body out of sight  The soldier looks underneath the hut for the girl and EnJoo dives towards him plunging a knife into his throat and stabbing repeatedly  Unseen by the soldier EnJoo clamps a hand over her mouth and holds a finger to his lips  He slaps her causing her to fall to the ground then gestures to the hut and crawls underneath it  The soldier with the dancing girl drags her towards his hut and she struggles "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He slaps her causing her to fall to the ground then gestures to the hut and crawls underneath it The soldier with the dancing girl drags her towards his hut and she struggles The soldier looks underneath the hut for the girl and EnJoo dives towards him plunging a knife into his throat and stabbing repeatedly Unseen by the soldier EnJoo clamps a hand over her mouth and holds a finger to his lips Rambo runs out to a hut and dives underneath it seeing Sarah lying prone in the pig sty He drags the soldier's body out of sight He looks out through the timbers and sees the soldier with the bottle of spirits returning He throws open a wooden bolt opens a gate and crawls inside EnJoo checks his watch—10 seconds to 2 Sarah is asleep or unconscious and Rambo rushes over to the partition between them pushing pigs out of the way He fires starting by picking off the guard below and the guards in two adjacent watch towers On the watch tower School Boy has a soldier in the site of his weapon and his watch shows 2 AM The hidden Rambo watches as she is dragged away waits a few seconds then follows them EnJoo and the girl exchange glances and move but the boozy soldier has gotten to Sarah first The soldier emerges from between two huts dragging Sarah along by her hair her arms tightly bound behind her back BN's party joins EnJoo and the girls in a dark clearing beyond the camp gate At the dance one of the women is being held down and throttled by a soldier and another trooper runs through the throng brandishing a flare billowing red smoke Unseen Rambo runs behind them BN leads them away while School Boy shoots Lewis a murderous look Lewis joins the other mercenaries and Louis throws Michael to the ground and pulls a knife on him Rambo follows Sarah and the soldier who drags her into his hut and throws her to the floor with the door swinging closed behind them At the dance the smoke from the flare is everywhere and one of the women's dresses is torn away leaving her topless Rambo takes the officer from behind grabbing a clump of the man's hair in his right hand and clutching the throat with his left as the officer's face becomes a rictus grimace while Rambo's fingers dig deep into the cartilage and bone at the man's neck At the dance a struggling woman has her face slapped by one of the drunken crowd and at the same time Sarah suffers the same abuse at the hands of a soldier who bears down on her reaching for his belt buckle"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "EnJoo and the girl exchange glances and move but the boozy soldier has gotten to Sarah first  The hidden Rambo watches as she's dragged away waits a few seconds then follows them  BN's party joins EnJoo and the girls in a dark clearing beyond the camp gate  The soldier emerges from between two huts dragging Sarah along by her hair her arms tightly bound behind her back  Unseen Rambo runs behind them  At the dance one of the women is being held down and throttled by a soldier and another trooper runs through the throng brandishing a flare billowing red smoke  Lewis joins the other mercenaries and Louis throws Michael to the ground and pulls a knife on him  BN leads them away while School Boy shoots Lewis a murderous look  At the dance the smoke from the flare is everywhere and one of the women's dresses is torn away leaving her topless  Rambo follows Sarah and the soldier who drags her into his hut and throws her to the floor with the door swinging closed behind them  At the dance a struggling woman has her face slapped by one of the drunken crowd and at the same time Sarah suffers the same abuse at the hands of a soldier who bears down on her reaching for his belt buckle  Rambo takes the officer from behind grabbing a clump of the man's hair in his right hand and clutching the throat with his left as the officer's face becomes a rictus grimace while Rambo's fingers dig deep into the cartilage and bone at the man's neck The soldier with the dancing girl drags her towards his hut and she struggles  He slaps her causing her to fall to the ground then gestures to the hut and crawls underneath it  Unseen by the soldier EnJoo clamps a hand over her mouth and holds a finger to his lips  The soldier looks underneath the hut for the girl and EnJoo dives towards him plunging a knife into his throat and stabbing repeatedly  He drags the soldier's body out of sight  Rambo runs out to a hut and dives underneath it seeing Sarah lying prone in the pig sty  He throws open a wooden bolt opens a gate and crawls inside  He looks out through the timbers and sees the soldier with the bottle of spirits returning  Sarah is asleep or unconscious and Rambo rushes over to the partition between them pushing pigs out of the way  EnJoo checks his watch—10 seconds to 2  On the watch tower School Boy has a soldier in the site of his weapon and his watch shows 2 AM  He fires starting by picking off the guard below and the guards in two adjacent watch towers "
        }
      ]
    }
  ]
}