{
  "ground_truth": "Rambo rips out his throat and throws him to the floor, and Sarah looks up. Soldiers fight over women at the dance as Rambo leads Sarah from the officer's hut and across the compound. The dance hut is engulfed in red smoke, and boozy soldiers stagger from it, grinning; one taps another on the shoulders. Rambo leads Sarah under the wooden bridge over the stream, and they hide there briefly, as drunken troopers stagger over it. From below, Sarah and Rambo watch their solid army boots go by. A woman is dragged from the smoky dance hut. Rambo leads Sarah up the stream as the party is all over, and the last of the soldiers stagger away from the dance hut. Sarah and Rambo climb up the banks of the stream and into the road, and she falls in the mud. They're spotted by patrolling guards who raise their rifles, and Rambo leaps onto Sarah to shield her. School Boy shoots one of them and then aims again, and the second guard's head explodes and he flies through a nearby fence to join his fallen comrade. Rambo and Sarah leave as School Boy closes a night-vision sight on his weapon. The rain has stopped, and the moon appears from behind a bank of cloud. The commander emerges from his hut in his vest, pushing the small boy before him. He stands on his veranda, watching the boy trudge away across the compound before turning and heading back inside, closing the hut door behind him. Rambo, Sarah, and School Boy run through the forest and pause breathlessly at a tree trunk. Rambo turns to School Boy, and they exchange stares before they move away. A golden sun peaks over the tops of trees, and the camp is a hive of activity. Tracker dogs sniff around clothing for scents, and they're lifted into the backs of trucks. The commander strides angrily out of his hut, exchanges words with a junior before stalking across the compound to the soldier's hut, and goes inside to stare wide-eyed in horror at the sight of the soldier's corpse on the hut floor, with blood either wet or caked about the man's dead neck or pooling on the floor. The commander takes a few short breaths and leaves again. Rambo, Sarah, and School Boy run past a wall of rock. The commander stands in the passenger seat of the truck with a mounted machine-gun and leads a small convoy out of the camp, followed by a pair of open-topped lorries packed with troopers. Lewis leads his party of mercenaries and rescued peasants through the forest, and some way behind him are Rambo, Sarah, and School Boy. On a dirt road, one of the lorries pulls up and a bunch of troopers dismount with weapons primed.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Rambo tears out his larynx and hurls him to the ground, and Sarah glances upward. Warriors battle over females at the festivity as Rambo guides Sarah from the officer's bungalow and across the enclosure. The festivity cabin is consumed in crimson fumes, and inebriated warriors lurch out of it, smiling; one taps another on the shoulder. Rambo guides Sarah beneath the timber bridge over the creek, and they conceal there briefly, as intoxicated soldiers lurch over it. From underneath, Sarah and Rambo observe their sturdy military footwear pass by. A woman is hauled from the misty festivity cabin. Rambo guides Sarah up the brook as the celebration is entirely finished, and the final of the warriors lurch away from the festivity cabin. Sarah and Rambo ascend the sides of the creek and onto the roadway, and she tumbles in the muck. They're noticed by patrolling sentinels who lift their firearms, and Rambo leaps onto Sarah to shield her. School Boy shoots one of them and then targets again, and the second sentinel's cranium detonates and he flies through a nearby barrier to join his fallen companion. Rambo and Sarah depart as School Boy closes a night-vision view on his firearm. The precipitation has ceased, and the satellite emerges from behind a bank of vapors. The leader emerges from his cabin in his undershirt, pushing the small child before him. He stands on his balcony, watching the child slog away across the enclosure before turning and heading back inside, closing the cabin door behind him. Rambo, Sarah, and School Boy dash through the woodland and pause breathlessly at a tree trunk. Rambo turns to School Boy, and they exchange glances before they move away. A golden star emerges over the tops of trees, and the encampment is a hive of activity. Tracker hounds sniff around garments for odors, and they're lifted into the backs of vehicles. The leader strides angrily out of his cabin, exchanges words with a junior before stalking across the enclosure to the warrior's cabin, and enters to stare wide-eyed in horror at the sight of the warrior's corpse on the cabin ground, with gore either moist or crusted about the man's deceased neck or pooling on the ground. The leader takes a few short breaths and departs again. Rambo, Sarah, and School Boy run past a wall of stone. The leader stands in the co-driver's seat of the vehicle with a mounted machine-gun and leads a small caravan out of the encampment, followed by a pair of open-topped lorries packed with soldiers. Lewis leads his group of mercenaries and rescued villagers through the woodland, and some way behind him are Rambo, Sarah, and School Boy. On a dirt roadway, one of the lorries halts and a bunch of soldiers disembark with weapons primed."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Rambo's throat is ripped out, and he is thrown to the floor by him, and Sarah is looked up by her. Women are fought over by soldiers at the dance as Sarah is led by Rambo from the officer's hut and across the compound. Red smoke engulfs the dance hut, and it is staggered from by boozy soldiers, grinning; another is tapped on the shoulders by one. Sarah is led by Rambo under the wooden bridge over the stream, and there they are hidden briefly by them, as drunken troopers stagger over it. Their solid army boots are watched by Sarah and Rambo from below. A woman drags a soldier from the smoky dance hut. Sarah is led up the stream by Rambo as the party is all over, and the dance hut is staggered away from by the last of the soldiers. The banks of the stream are climbed up by Sarah and Rambo and into the road, and the mud is fallen in by her. Patroling guards spot them, and their rifles are raised by them, and Sarah is leapt onto by Rambo to shield her. One of them is shot by School Boy, and then he aims again, and he explodes the second guard's head, and the guard is flown through a nearby fence by him to join his fallen comrade. Sarah and Rambo are left by School Boy as a night-vision sight is closed on his weapon by him. The rain has stopped, and a bank of cloud is emerged from behind by the moon. From his hut in his vest, the commander emerges, and the small boy is pushed before him. On his veranda, he stands, and the boy is watched by him trudge away across the compound before he turns and heads back inside, and the hut door is closed behind him by him. Through the forest, Rambo, Sarah, and School Boy run, and at a tree trunk, they pause breathlessly. School Boy is turned to by Rambo, and stares are exchanged by them before they move away. Over the tops of trees, a golden sun peeks, and a hive of activity is the camp. Clothing is sniffed around by tracker dogs for scents, and into the backs of trucks, they are lifted. Out of his hut strides the commander angrily, words are exchanged by him with a junior before the compound is stalked across to the soldier's hut, and inside he goes to stare wide-eyed in horror at the sight of the soldier's corpse on the hut floor, with blood either wet or caked about the man's dead neck or pooling on the floor. A few short breaths are taken, and again he leaves. Past a wall of rock, Rambo, Sarah, and School Boy run. In the passenger seat of the truck with a mounted machine gun, the commander stands, and a small convoy is led out of the camp by him, and by a pair of open-topped lorries packed with troopers, he is followed. Through the forest, Lewis leads his party of mercenaries and rescued peasants, and some way behind him are Rambo, Sarah, and School Boy. On a dirt road, one of the lorries pulls up, and weapons are primed by a bunch of troopers who dismount."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Rambo rips out his throat and throws him to the floor as Sarah looks up. Soldiers brawl over women at the dance while Rambo leads Sarah from the officer's hut across the compound. The dance hut is engulfed in red smoke, and boozy soldiers stagger out, grinning; one taps another on the shoulder. Rambo and Sarah briefly hide under a wooden bridge as drunken troopers stagger above. From below, they watch army boots pass by. A woman is dragged from the smoky hut. Rambo leads Sarah up the stream as the party ends, and soldiers stagger away. They climb the stream banks to the road, and Sarah falls in the mud. Spotted by guards, Rambo shields her. School Boy shoots one guard, then the second's head explodes, sending him through a fence. Rambo and Sarah leave as School Boy closes a night-vision sight on his weapon. The rain stops, and the moon emerges from clouds. The commander, in his vest, pushes a small boy across the compound before returning inside. Rambo, Sarah, and School Boy run through the forest, pausing breathlessly at a tree trunk. Rambo and School Boy exchange stares before moving on. A golden sun rises over the trees, and the camp buzzes with activity. Tracker dogs sniff clothing for scents and are loaded into trucks. The commander angrily leaves his hut, speaks with a junior, then enters the soldier's hut, horrified by the corpse with blood around the neck. He takes short breaths and exits. Rambo, Sarah, and School Boy run past a rock wall. The commander stands in a truck's passenger seat with a mounted machine gun, leading a convoy out of the camp, followed by lorries packed with troopers. Lewis leads mercenaries and rescued peasants through the forest, with Rambo, Sarah, and School Boy trailing. On a dirt road, a lorry stops, and troopers dismount with weapons ready."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Rambo rips out a man's throat and throws him down as Sarah looks up. Soldiers fight over women at the dance while Rambo leads Sarah from the officer's hut across the compound. Red smoke engulfs the dance hut, and drunken soldiers stagger out, grinning. Rambo and Sarah hide under a wooden bridge as troopers stagger over it. They watch army boots pass by. A woman is dragged from the smoky hut. Rambo leads Sarah up the stream as the party ends, and soldiers stagger away. They climb the stream banks to the road, where Sarah falls in the mud. Guards spot them and raise rifles, but Rambo shields Sarah. School Boy shoots one guard, then the second, whose head explodes. Rambo and Sarah leave as School Boy uses a night-vision sight. The rain stops, and the moon appears. The commander emerges, pushing a boy, watches him leave, then returns inside. Rambo, Sarah, and School Boy run through the forest, pausing at a tree trunk. Rambo and School Boy exchange stares before moving on. A golden sun rises, and the camp is active. Tracker dogs sniff clothing and are loaded into trucks. The commander angrily leaves his hut, speaks with a junior, then enters the soldier's hut, horrified by the corpse. He takes short breaths and exits. Rambo, Sarah, and School Boy run past a rock wall. The commander stands in a truck with a machine gun, leading a convoy out of camp, followed by lorries with troopers. Lewis leads mercenaries and rescued peasants through the forest, with Rambo, Sarah, and School Boy behind. On a dirt road, a lorry stops, and troopers dismount with weapons ready."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In a swift and brutal motion, Rambo tears out the man's throat and hurls him forcefully to the ground, causing Sarah to glance upward in shock. Meanwhile, chaos ensues as soldiers engage in a frenzied struggle over women at the lively dance. Amidst this turmoil, Rambo takes charge, guiding Sarah away from the officer's hut and leading her across the sprawling compound. The dance hut is shrouded in a thick cloud of red smoke, and intoxicated soldiers stumble out, grinning widely; one of them playfully taps another on the shoulder. Rambo continues to lead Sarah, taking her beneath the wooden bridge that spans the stream, where they pause momentarily, concealed from view, as the inebriated troopers stagger noisily above them. From their hidden vantage point below, Sarah and Rambo watch the soldiers' sturdy army boots march past. A woman is forcibly dragged from the smoke-filled dance hut, adding to the chaos. Rambo then guides Sarah along the stream as the festivities come to an end, and the last of the soldiers stagger away from the dance hut, their revelry concluded. Together, Sarah and Rambo climb up the banks of the stream and onto the road, where Sarah slips and falls into the mud. At that moment, they are spotted by patrolling guards who quickly raise their rifles in alarm. In a protective gesture, Rambo leaps onto Sarah to shield her from harm. School Boy, positioned nearby, takes swift action, shooting one of the guards and then aiming again with precision. The second guard's head explodes in a violent burst, and he is propelled through a nearby fence, joining his fallen comrade on the ground. With the immediate threat neutralized, Rambo and Sarah make their escape as School Boy closes the night-vision sight on his weapon, ensuring their path is clear. The rain has ceased, and the moon emerges from behind a bank of clouds, casting an eerie glow over the scene. The commander steps out of his hut, clad in a vest, and pushes a small boy ahead of him. He stands on his veranda, watching the boy trudge away across the compound before turning back inside and closing the hut door behind him. Meanwhile, Rambo, Sarah, and School Boy dash through the dense forest, pausing breathlessly at the base of a large tree trunk. Rambo turns to School Boy, and they exchange intense stares before continuing on their way. As a golden sun begins to rise over the tops of the trees, the camp becomes a hive of activity. Tracker dogs sniff around clothing, searching for scents, and are then lifted into the backs of trucks. The commander, filled with anger, strides out of his hut and exchanges terse words with a junior officer before marching across the compound to the soldier's hut. Inside, he stares wide-eyed in horror at the gruesome sight of the soldier's lifeless body on the hut floor, with blood either wet or caked around the man's dead neck or pooling ominously on the floor. Taking a few short, shallow breaths, the commander exits the hut once more. Rambo, Sarah, and School Boy continue their flight, running past a towering wall of rock. The commander stands in the passenger seat of a truck equipped with a mounted machine gun, leading a small convoy out of the camp. This convoy is followed by a pair of open-topped lorries packed with troopers, ready for action. Meanwhile, Lewis leads his group of mercenaries and rescued peasants through the forest, with Rambo, Sarah, and School Boy trailing some distance behind. On a dusty dirt road, one of the lorries comes to a halt, and a group of troopers dismount, weapons at the ready, prepared for whatever lies ahead."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In a swift yet utterly brutal motion, Rambo violently tears out the throat of the man before hurling him forcefully to the ground, causing Sarah to glance upward in complete shock and disbelief. Meanwhile, chaos and confusion burst forth as soldiers become embroiled in a frenzied struggle over the women at the lively and energetic dance. Amidst this unbelievable turmoil, Rambo takes command of the situation, guiding Sarah away from the looming threat of the officer's hut and leading her swiftly across the expansive, sprawling compound. The dance hut is shrouded in a thick, enveloping cloud of red smoke, while intoxicated soldiers stumble clumsily out, grinning widely like jesters; one of them playfully taps another on the shoulder, adding to the scene's bizarre nature. Rambo maintains his protective hold on Sarah, taking her beneath the sturdy wooden bridge that spans the gently flowing stream. Here, they pause momentarily, concealed from view, as the inebriated troopers stagger noisily above them, unaware of their presence. From their hidden vantage point below, Sarah and Rambo watch with bated breath as the soldiers' sturdy army boots march ominously past. A woman is forcibly dragged from the smoke-filled dance hut, adding a horrifying layer to the ongoing chaos. Rambo then guides Sarah along the winding stream as the raucous festivities gradually come to an end, and the last of the drunken soldiers stagger away from the chaotic dance hut, their revelry finally concluded. Together, Sarah and Rambo climb up the slippery banks of the stream and onto the muddy road, where Sarah unexpectedly slips and falls into the soggy mud. At that very moment, they are spotted by vigilant patrolling guards who quickly raise their rifles in alarm, acting on instinct. In an instinctive and protective gesture, Rambo leaps onto Sarah, shielding her body from harm. Nearby, School Boy, positioned with a keen eye, takes swift and decisive action, shooting one of the guards with expert precision before aiming again with deadly accuracy. The second guard's head explodes in a violent burst, and he is propelled through a nearby fence, joining his fallen comrade on the cold, hard ground. With the immediate and grave threat now neutralized, Rambo and Sarah seize the opportunity to make their escape, as School Boy efficiently closes the night-vision sight on his weapon, ensuring their path remains clear and safe. The rain, which had been a constant presence, has ceased, allowing the moon to emerge from behind a bank of clouds, casting an eerie and haunting glow over the entire scene. The commander steps out of his hut, clad in a simple vest, and pushes a small boy ahead of him. He stands on his veranda, watching the boy trudge away dejectedly across the compound before turning back inside and closing the hut door firmly behind him. Meanwhile, Rambo, Sarah, and School Boy dash through the dense, foreboding forest, pausing breathlessly at the base of a large and imposing tree trunk. Rambo turns to School Boy, and they exchange intense, meaningful stares before continuing on their way through the wilderness. As a golden sun begins to rise over the tops of the towering trees, the camp becomes a hive of frantic activity. Tracker dogs sniff around discarded clothing, searching diligently for scents, before being lifted into the backs of waiting trucks. The commander, filled with seething anger, strides out of his hut and exchanges terse, clipped words with a junior officer before marching purposefully across the compound to the soldier's hut. Inside, he stares wide-eyed in horror and disbelief at the gruesome sight of the soldier's lifeless body sprawled on the hut floor, with blood either wet or caked around the man's dead neck or ominously pooling on the cold floor. Taking a few short, shallow breaths to compose himself, the commander exits the hut once more, grim determination etched on his face. Rambo, Sarah, and School Boy continue their urgent flight, running past a towering, imposing wall of rock. The commander stands in the passenger seat of a truck equipped with a mounted machine gun, leading a small convoy out of the camp. This convoy is followed closely by a pair of open-topped lorries packed with eager troopers, ready for action at a moment's notice. Meanwhile, Lewis leads his group of mercenaries and rescued peasants through the dense forest, with Rambo, Sarah, and School Boy trailing some distance behind. On a dusty, winding dirt road, one of the lorries comes to an abrupt halt, and a group of troopers dismount, weapons at the ready, fully prepared for whatever lies ahead on their perilous journey."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Rambo, with a swift and forceful motion, tears out the man's throat and lets his lifeless body drop heavily to the floor, causing Sarah to lift her gaze in shock. Meanwhile, chaos erupts as soldiers engage in a frenzied struggle over women at the dance, creating a scene of disorder. Amidst this turmoil, Rambo takes charge, guiding Sarah out of the officer's hut and leading her purposefully across the compound. The dance hut becomes a scene of pandemonium, engulfed in swirling red smoke, while inebriated soldiers stumble out, their faces plastered with grins; one soldier playfully taps another on the shoulder, adding to the chaotic atmosphere. Rambo, maintaining his focus, leads Sarah beneath the wooden bridge that spans the stream, where they take a moment to hide, crouching low as drunken troopers stagger noisily above them. From their concealed position, Sarah and Rambo watch the solid army boots of the soldiers pass by, each step echoing ominously. The scene intensifies as a woman is forcibly dragged from the smoky dance hut, her cries mingling with the sounds of the dissipating party. As the last of the soldiers stagger away from the dance hut, Rambo seizes the opportunity to lead Sarah up the stream, navigating the uneven terrain with urgency. They climb the banks of the stream, emerging onto the road, where Sarah loses her footing and falls into the mud, her clothes splattered with dirt. At that moment, patrolling guards spot them, their rifles raised in alarm, prompting Rambo to leap protectively onto Sarah, shielding her from harm. In a swift and precise action, School Boy, positioned strategically, fires his weapon, taking down one guard before quickly aiming again, causing the second guard's head to explode with a violent impact, sending him crashing through a nearby fence to join his fallen comrade. With the immediate threat neutralized, Rambo and Sarah make their escape, while School Boy, with practiced efficiency, closes the night-vision sight on his weapon, ready for any further danger. The rain has ceased, and the moon emerges from behind a bank of clouds, casting an eerie glow over the scene. The commander, clad in his vest, emerges from his hut, pushing a small boy ahead of him. He stands on his veranda, watching the boy's reluctant steps as he trudges away across the compound, before turning back inside and closing the hut door with a sense of finality. In the forest, Rambo, Sarah, and School Boy run with urgency, their breaths coming in quick gasps as they pause momentarily at a tree trunk. Rambo turns to School Boy, and they exchange a silent understanding through their stares before continuing their flight. As dawn breaks, a golden sun peeks over the tops of the trees, illuminating the camp, which buzzes with activity. Tracker dogs, eager and alert, sniff around clothing for scents, their handlers lifting them into the backs of trucks with practiced efficiency. The commander, exuding anger, strides out of his hut, exchanging terse words with a junior officer before marching across the compound to the soldier's hut. Inside, he is confronted with a gruesome sight: the soldier's corpse lies on the floor, blood either wet or caked around the man's neck or pooling ominously on the floor. The commander takes a few short, sharp breaths, his expression a mix of horror and determination, before exiting the hut. Meanwhile, Rambo, Sarah, and School Boy continue their flight, running past a formidable wall of rock. The commander, now standing in the passenger seat of a truck equipped with a mounted machine gun, leads a small convoy out of the camp, followed closely by a pair of open-topped lorries packed with troopers, their weapons at the ready. In the forest, Lewis leads his party of mercenaries and rescued peasants, moving with purpose, while some distance behind, Rambo, Sarah, and School Boy follow, their pace steady and determined. On a dirt road, one of the lorries comes to a halt, and a group of troopers dismount, their weapons primed and ready for action, as the tension in the air continues to build."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Rambo eliminates an adversary and escorts Sarah from the officer's hut across the compound, where soldiers are causing chaos at a dance. They navigate through red smoke and drunken soldiers, briefly hiding under a bridge as troopers stagger above. After witnessing a woman being dragged from the dance hut, Rambo and Sarah move along the stream, avoiding the last of the departing soldiers. As they climb the stream bank to the road, Sarah slips in the mud, attracting the attention of patrolling guards. Rambo shields her as School Boy intervenes, eliminating the threat. With the rain stopped and the moon emerging, they escape while the commander, having pushed a boy across the compound, retreats into his hut. Rambo, Sarah, and School Boy pause in the forest, exchanging glances before continuing. As dawn breaks, the camp becomes active with tracker dogs and soldiers. The commander, angered by the discovery of a soldier's corpse, leads a convoy out of the camp. Meanwhile, Lewis guides his group of mercenaries and rescued peasants through the forest, with Rambo, Sarah, and School Boy following behind. On a dirt road, a lorry halts, and armed troopers disembark, ready for action."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Rambo, a seasoned veteran skilled in guerrilla tactics, rips out his throat in a swift motion and throws him to the floor, and Sarah looks up in shock. Soldiers, in a scene reminiscent of the chaos often found in conflict zones, fight over women at the dance as Rambo leads Sarah from the officer's hut, a structure typically reserved for command personnel, and across the compound. The dance hut is engulfed in red smoke, a byproduct of the celebratory but reckless use of flares, and boozy soldiers stagger from it, grinning; one taps another on the shoulders, sharing a moment of drunken camaraderie. Rambo leads Sarah under the wooden bridge, originally constructed by local villagers using native timber, over the stream, and they hide there briefly, as drunken troopers stagger over it. From below, Sarah and Rambo watch their solid army boots, standard issue in the military, go by. A woman, likely a local caught in the conflict, is dragged from the smoky dance hut. Rambo leads Sarah up the stream, taking advantage of the natural cover, as the party is all over, and the last of the soldiers stagger away from the dance hut. Sarah and Rambo climb up the banks of the stream and into the road, a dirt path used by military vehicles, and she falls in the mud. They're spotted by patrolling guards who raise their rifles, weapons commonly used by soldiers in this region, and Rambo leaps onto Sarah to shield her from the gunfire. School Boy, a sharpshooting ally with a talent for precise shots, shoots one of them and then aims again, and the second guard's head explodes and he flies through a nearby fence to join his fallen comrade. Rambo and Sarah leave as School Boy closes a night-vision sight on his weapon, a tool that gives him an edge in the dark. The rain has stopped, and the moon appears from behind a bank of cloud, illuminating the ground with a silvery glow. The commander emerges from his hut in his vest, a garment worn due to the oppressive heat, pushing the small boy, a likely hostage or messenger, before him. He stands on his veranda, watching the boy trudge away across the compound, a scene of ongoing military operations, before turning and heading back inside, closing the hut door behind him with a resounding thud. Rambo, Sarah, and School Boy run through the forest, a dense thicket providing both cover and danger, and pause breathlessly at a tree trunk. Rambo turns to School Boy, and they exchange stares, a silent understanding passing between them, before they move away. A golden sun peaks over the tops of trees, signaling the start of a new day, and the camp is a hive of activity as soldiers prepare for their next move. Tracker dogs, trained to follow human scents, sniff around clothing for scents, and they're lifted into the backs of trucks, ready to pursue escapees. The commander strides angrily out of his hut, exchanges words with a junior officer, his subordinate, before stalking across the compound to the soldier's hut, and goes inside to stare wide-eyed in horror at the sight of the soldier's corpse on the hut floor, with blood either wet or caked about the man's dead neck or pooling on the floor, a grim reminder of the night's violence. The commander takes a few short breaths and leaves again, his mind racing with thoughts of reprisal. Rambo, Sarah, and School Boy run past a wall of rock, a natural barrier formed over millennia. The commander stands in the passenger seat of the truck with a mounted machine-gun, an imposing weapon capable of rapid fire, and leads a small convoy out of the camp, followed by a pair of open-topped lorries packed with troopers ready for pursuit. Lewis leads his party of mercenaries, hired guns with a reputation for ruthlessness, and rescued peasants, civilians caught in the crossfire, through the forest, and some way behind him are Rambo, Sarah, and School Boy. On a dirt road, one of the lorries pulls up and a bunch of troopers dismount with weapons primed, prepared for a potential skirmish."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Rambo rips out his throat and throws him to the floor and Sarah looks up  Soldiers fight over women at the dance as Rambo leads Sarah from the officer's hut and across the compound  The dance hut is engulfed in red smoke and boozy soldiers stagger from it grinning  School Boy shoots one of them and then aims again and the second guard's head explodes and he flies through a nearby fence to join his fallen comrade  Rambo and Sarah leave as School Boy closes a nightvision sight on his weapon  The rain has stopped and the moon appears from behind a bank of cloud  The commander emerges from his hut in his vest pushing the small boy before him  He stands on his veranda watching the boy trudge away across the compound before turning and heading back inside closing the hut door behind him  Rambo Sarah and School Boy run through the forest and pause breathlessly at a tree trunk  Rambo turns to School Boy and they exchange stares before they move away  A golden sun peaks over the tops of trees and the camp is a hive of activity  Tracker dogs sniff around clothing for scents and they're lifted into the backs of trucks  The commander strides angrily out of his hut exchanges words with a junior before stalking across the compound to the soldier's hut and goes inside to stare wideeyed in horror at the sight of the soldier's corpse on the hut floor with blood either wet or caked about the man's dead neck or pooling on the floor  The commander takes a few short breaths and leaves again Rambo Sarah and School Boy run past a wall of rock  The commander stands in the passenger seat of the truck with a mounted machinegun and leads a small convoy out of the camp followed by a pair of opentopped lorries packed with troopers  one taps another on the shoulders  Rambo leads Sarah under the wooden bridge over the stream and they hide there briefly as drunken troopers stagger over it  From below Sarah and Rambo watch their solid army boots go by  A woman is dragged from the smoky dance hut  Rambo leads Sarah up the stream as the party is all over and the last of the soldiers stagger away from the dance hut  Sarah and Rambo climb up the banks of the stream and into the road and she falls in the mud  They're spotted by patrolling guards who raise their rifles and Rambo leaps onto Sarah to shield her  School Boy shoots one of them and then aims again and the second guard's head explodes and he flies through a nearby fence to join his fallen comrade  Rambo and Sarah leave as School Boy closes a nightvision sight on his weapon  The rain has stopped and the moon appears from behind a bank of cloud  The commander emerges from his hut in his vest pushing the small boy before him  He stands on his veranda watching the boy trudge away across the compound before turning and heading back inside closing the hut door behind him  Rambo Sarah and School Boy run through the forest and pause breathlessly at a tree trunk  Rambo turns to School Boy and they exchange stares before they move away  A golden sun peaks over the tops of trees and the camp is a hive of activity  Tracker dogs sniff around clothing for scents and they're lifted into the backs of trucks  The commander strides angrily out of his hut exchanges words with a junior before stalking across the compound to the soldier's hut and goes inside to stare wideeyed in horror at the sight of the soldier's corpse on the hut floor with blood either wet or caked about the man's dead neck or pooling on the floor  The commander takes a few short breaths and leaves again Rambo Sarah and School Boy run past a wall of rock  The commander stands in the passenger seat of the truck with a mounted machinegun and leads a small convoy out of the camp followed by a pair of opentopped lorries packed with troopers  Lewis leads his party of mercenaries and rescued peasants through the forest and some way behind him are Rambo Sarah and School Boy  On a dirt road one of the lorries pulls up and a bunch of troopers dismount with weapons primed"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Rambo rips out his throat and throws him to the floor and Sarah looks up. Soldiers fight over women at the dance as Rambo leads Sarah from the officer's hut and across the compound. The dance hut is engulfed in red smoke and boozy soldiers stagger from it grinning. one taps another on the shoulders. Rambo leads Sarah under the wooden bridge over the stream and they hide there briefly as drunken troopers stagger over it. From below Sarah and Rambo watch their solid army boots go by. A woman is dragged from the smoky dance hut. Rambo leads Sarah up the stream as the party is all over and the last of the soldiers stagger away from the dance hut. Sarah and Rambo climb up the banks of the stream and into the road and she falls in the mud. They are spotted by patrolling guards who raise their rifles and Rambo leaps onto Sarah to shield her. School Boy shoots one of them and then aims again and the second guard's head explodes and he flies through a nearby fence to join his fallen comrade. Rambo and Sarah leave as School Boy closes a nightvision sight on his weapon. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. The rain has stopped and the moon appears from behind a bank of cloud. The commander emerges from his hut in his vest pushing the small boy before him. He stands on his veranda watching the boy trudge away across the compound before turning and heading back inside closing the hut door behind him. Rambo Sarah and School Boy run through the forest and pause breathlessly at a tree trunk. Rambo turns to School Boy and they exchange stares before they move away. A golden sun peaks over the tops of trees and the camp is a hive of activity. Tracker dogs sniff around clothing for scents and they are lifted into the backs of trucks. The commander strides angrily out of his hut exchanges words with a junior before stalking across the compound to the soldier's hut and goes inside to stare wideeyed in horror at the sight of the soldier's corpse on the hut floor with blood either wet or caked about the man's dead neck or pooling on the floor. The commander takes a few short breaths and leaves again Rambo Sarah and School Boy run past a wall of rock. The commander stands in the passenger seat of the truck with a mounted machinegun and leads a small convoy out of the camp followed by a pair of opentopped lorries packed with troopers. Lewis leads his party of mercenaries and rescued peasants through the forest and some way behind him are Rambo Sarah and School Boy. On a dirt road one of the lorries pulls up and a bunch of troopers dismount with weapons primed."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Rambo rips out his throat and throws him to the floor and Sarah looks up. Soldiers fight over women at the dance as Rambo leads Sarah from the officer's hut and across the compound. The dance hut is engulfed in red smoke and boozy soldiers stagger from it grinning. one taps another on the shoulders. Rambo leads Sarah under the wooden bridge over the stream and they hide there briefly as drunken troopers stagger over it. From below Sarah and Rambo watch their solid army boots go by. A woman is dragged from the smoky dance hut. Rambo leads Sarah up the stream as the party is all over and the last of the soldiers stagger away from the dance hut. Sarah and Rambo climb up the banks of the stream and into the road and she falls in the mud. They are spotted by patrolling guards who raise their rifles and Rambo leaps onto Sarah to shield her. School Boy shoots one of them and then aims again and the second guard's head explodes and he flies through a nearby fence to join his fallen comrade. Rambo and Sarah leave as School Boy closes a nightvision sight on his weapon. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. The rain has stopped and the moon appears from behind a bank of cloud. The commander emerges from his hut in his vest pushing the small boy before him. He stands on his veranda watching the boy trudge away across the compound before turning and heading back inside closing the hut door behind him. Rambo Sarah and School Boy run through the forest and pause breathlessly at a tree trunk. Rambo turns to School Boy and they exchange stares before they move away. A golden sun peaks over the tops of trees and the camp is a hive of activity. Tracker dogs sniff around clothing for scents and they are lifted into the backs of trucks. The commander strides angrily out of his hut exchanges words with a junior before stalking across the compound to the soldier's hut and goes inside to stare wideeyed in horror at the sight of the soldier's corpse on the hut floor with blood either wet or caked about the man's dead neck or pooling on the floor. The commander takes a few short breaths and leaves again Rambo Sarah and School Boy run past a wall of rock. The commander stands in the passenger seat of the truck with a mounted machinegun and leads a small convoy out of the camp followed by a pair of opentopped lorries packed with troopers. Lewis leads his party of mercenaries and rescued peasants through the forest and some way behind him are Rambo Sarah and School Boy. On a dirt road one of the lorries pulls up and a bunch of troopers dismount with weapons primed."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Rambo rips out his throat and throws him to the floor and Sarah looks up. Soldiers fight over women at the dance as Rambo leads Sarah from the officer's hut and across the compound. The dance hut is engulfed in red smoke and boozy soldiers stagger from it grinning. one taps another on the shoulders. Rambo leads Sarah under the wooden bridge over the stream and they hide there briefly as drunken troopers stagger over it. From below Sarah and Rambo watch their solid army boots go by. Tracker dogs sniff around clothing for scents and they are lifted into the backs of trucks. The commander strides angrily out of his hut exchanges words with a junior before stalking across the compound to the soldier's hut and goes inside to stare wideeyed in horror at the sight of the soldier's corpse on the hut floor with blood either wet or caked about the man's dead neck or pooling on the floor. The commander takes a few short breaths and leaves again Rambo Sarah and School Boy run past a wall of rock. The commander stands in the passenger seat of the truck with a mounted machinegun and leads a small convoy out of the camp followed by a pair of opentopped lorries packed with troopers. Lewis leads his party of mercenaries and rescued peasants through the forest and some way behind him are Rambo Sarah and School Boy. On a dirt road one of the lorries pulls up and a bunch of troopers dismount with weapons primed."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Rambo rips out his throat and throws him to the floor and Sarah looks up. Soldiers fight over women at the dance as Rambo leads Sarah from the officer's hut and across the compound. The dance hut is engulfed in red smoke and boozy soldiers stagger from it grinning. Lewis leads his party of mercenaries and rescued peasants through the forest and some way behind him are Rambo Sarah and School Boy. On a dirt road one of the lorries pulls up and a bunch of troopers dismount with weapons primed."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A giraffe rips out his throat and throws him to the floor, and a turtle looks up. Otters fight over women at the dance as a giraffe leads a turtle from the officer's hut and across the compound. The dance hut is engulfed in red smoke, and boozy otters stagger from it, grinning; one taps another on the shoulders. A giraffe leads a turtle under the wooden bridge over the stream, and they hide there briefly, as drunken dolphins stagger over it. From below, a turtle and a giraffe watch their solid army boots go by. A fox is dragged from the smoky dance hut. A giraffe leads a turtle up the stream as the party is all over, and the last of the otters stagger away from the dance hut. A turtle and a giraffe climb up the banks of the stream and into the road, and she falls in the mud. They're spotted by patrolling penguins who raise their rifles, and a giraffe leaps onto a turtle to shield her. A lion shoots one of them and then aims again, and the second penguin's head explodes and he flies through a nearby fence to join his fallen comrade. A giraffe and a turtle leave as a lion closes a night-vision sight on his weapon. The rain has stopped, and the moon appears from behind a bank of cloud. A zebra emerges from his hut in his vest, pushing the small kitten before him. He stands on his veranda, watching the kitten trudge away across the compound before turning and heading back inside, closing the hut door behind him. A giraffe, a turtle, and a lion run through the forest and pause breathlessly at a tree trunk. A giraffe turns to a lion, and they exchange stares before they move away. A golden sun peaks over the tops of trees, and the camp is a hive of activity. Tracker dogs sniff around clothing for scents, and they're lifted into the backs of trucks. A zebra strides angrily out of his hut, exchanges words with a junior before stalking across the compound to the otter's hut, and goes inside to stare wide-eyed in horror at the sight of the otter's corpse on the hut floor, with blood either wet or caked about the otter's dead neck or pooling on the floor. A zebra takes a few short breaths and leaves again. A giraffe, a turtle, and a lion run past a wall of rock. A zebra stands in the passenger seat of the truck with a mounted machine-gun and leads a small convoy out of the camp, followed by a pair of open-topped lorries packed with dolphins. A raccoon leads his party of mercenaries and rescued peasants through the forest, and some way behind him are a giraffe, a turtle, and a lion. On a dirt road, one of the lorries pulls up and a bunch of dolphins dismount with weapons primed."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Rambo rips out his throat and throws him to the grass, and Sarah looks up. Sailors fight over penguins at the party as Rambo leads Sarah from the captain's cabin and across the harbor. The party tent is engulfed in blue smoke, and boozy sailors stagger from it, grinning; one taps another on the elbows. Rambo leads Sarah under the stone arch over the fountain, and they hide there briefly, as drunken mariners stagger over it. From below, Sarah and Rambo watch their solid hiking boots go by. A penguin is dragged from the smoky party tent. Rambo leads Sarah up the fountain as the celebration is all over, and the last of the sailors stagger away from the party tent. Sarah and Rambo climb up the sides of the fountain and onto the trail, and she falls in the sand. They're spotted by patrolling sentries who raise their crossbows, and Rambo leaps onto Sarah to shield her. School Boy shoots one of them and then aims again, and the second sentry's head explodes and he flies through a nearby hedge to join his fallen comrade. Rambo and Sarah leave as School Boy closes a thermal sight on his cannon. The storm has stopped, and the stars appear from behind a bank of mist. The captain emerges from his cabin in his tunic, pushing the small bear before him. He stands on his patio, watching the bear trudge away across the harbor before turning and heading back inside, closing the cabin door behind him. Rambo, Sarah, and School Boy run through the meadow and pause breathlessly at a boulder. Rambo turns to School Boy, and they exchange glances before they move away. A silver sun peaks over the tops of hills, and the station is a hive of activity. Sniffer bees hover around garments for scents, and they're lifted into the backs of vans. The captain strides angrily out of his cabin, exchanges words with a minor before stalking across the harbor to the sailor's tent, and goes inside to stare wide-eyed in horror at the sight of the sailor's corpse on the tent floor, with paint either wet or caked about the man's dead wrist or pooling on the floor. The captain takes a few short breaths and leaves again. Rambo, Sarah, and School Boy run past a wall of vines. The captain stands in the passenger seat of the van with a mounted crossbow and leads a small procession out of the station, followed by a pair of open-topped buggies packed with mariners. Lewis leads his party of adventurers and rescued villagers through the meadow, and some way behind him are Rambo, Sarah, and School Boy. On a dusty road, one of the buggies pulls up and a bunch of mariners dismount with slingshots primed."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Rambo tickles his throat and tosses him onto the sofa, and Sarah glances downward. Soldiers argue about women at the bake-off as Rambo escorts Sarah from the officer's hut and into the compound. The dance hut is enveloped in blue mist, and boozy soldiers skip from it, chuckling; one pats another on the elbows. Rambo navigates Sarah under the wooden bridge beside the stream, and they lounge there briefly, as dizzy troopers stumble across it. From below, Sarah and Rambo observe their sturdy army boots pass by. A woman is carried from the misty dance hut. Rambo guides Sarah down the stream as the event is all over, and the last of the soldiers march away from the dance hut. Sarah and Rambo trot up the banks of the stream and onto the path, and she tumbles in the sand. They're noticed by wandering guards who lower their rifles, and Rambo dives onto Sarah to cover her. School Boy splashes one of them and then looks again, and the second guard's head vanishes and he cartwheels through a nearby fence to join his resting comrade. Rambo and Sarah depart as School Boy closes a telescope on his weapon. The drizzle has ended, and the moon emerges from a cluster of stars. The commander steps from his hut in his shoes, pulling the small boy behind him. He perches on his veranda, observing the boy stroll away across the compound before spinning and moving back inside, opening the hut door behind him. Rambo, Sarah, and School Boy walk through the forest and pause breathlessly at a tree branch. Rambo gestures to School Boy, and they trade glances before they stroll away. A silver sun rises above the tops of trees, and the camp is a whirl of activity. Tracker dogs bark around clothing for scents, and they're hoisted into the backs of trucks. The commander marches happily out of his hut, trades pleasantries with a junior before strolling across the compound to the soldier's hut, and goes inside to gaze wide-eyed in fascination at the sight of the soldier's gear on the hut floor, with blood either neat or crusted about the man's dead neck or trickling on the floor. The commander inhales a few short breaths and enters again. Rambo, Sarah, and School Boy jog past a wall of vines. The commander lounges in the passenger seat of the truck with a mounted telescope and directs a small convoy into the camp, followed by a pair of open-topped cars filled with troopers. Lewis leads his group of mercenaries and liberated peasants through the forest, and some distance behind him are Rambo, Sarah, and School Boy. On a paved road, one of the lorries stops and a bunch of troopers leap with weapons raised."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Widget tears off its lid and tosses it to the sofa, and the toaster glances up. Umbrellas grapple over pineapples at the concert as Widget guides the toaster from the swimmer's bench and across the plaza. The concert tent is swallowed in blue light, and drowsy umbrellas stagger from it, grinning; one taps another on the elbows. Widget guides the toaster under the metal ladder over the puddle, and they crouch there briefly, as sleepy umbrellas stagger over it. From below, the toaster and Widget watch their heavy boots go by. A pineapple is dragged from the shadowy concert tent. Widget leads the toaster up the puddle as the festival is all over, and the last of the umbrellas stagger away from the concert tent. The toaster and Widget climb up the edges of the puddle and onto the path, and it slips in the confetti. They're spotted by patrolling zebras who raise their telescopes, and Widget jumps onto the toaster to shield it. The lamp smashes one of them and then aims again, and the second zebra's mane explodes and it flies through a nearby bush to join its fallen pal. Widget and the toaster leave as the lamp closes a thermal lens on its gadget. The drizzle has ceased, and the star emerges from behind a stack of mist. The gardener emerges from its bench in its cape, dragging the young giraffe before it. It stands on its balcony, watching the giraffe trudge away across the plaza before turning and heading back inside, closing the bench door behind it. Widget, the toaster, and the lamp dash through the orchard and pause breathlessly at a boulder. Widget turns to the lamp, and they swap glances before they slip away. A silver cloud peaks over the tops of branches, and the carnival is a flurry of action. Squirrel dogs sniff around jackets for trails, and they're hoisted into the backs of vans. The gardener strides angrily out of its bench, exchanges notes with a senior before marching across the plaza to the umbrella's bench, and goes inside to gape wide-eyed in horror at the sight of the umbrella's kite on the bench floor, with paint either dry or splattered about the kite’s still neck or pooling on the floor. The gardener takes a few short breaths and leaves again. Widget, the toaster, and the lamp scamper past a barrier of stone. The gardener stands in the navigator seat of the van with a standing trumpet and leads a small procession out of the carnival, followed by a pair of open-topped carts packed with umbrellas. Clara leads her team of explorers and rescued composers through the orchard, and some way behind her are Widget, the toaster, and the lamp. On a muddy trail, one of the carts pulls up and a cluster of umbrellas dismount with gadgets primed."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Rex yanks off his scarf and tosses it to the floor, and Lisa glances down. Artists argue over paintings at the gallery as Rex guides Lisa from the director's office and across the courtyard. The gallery is filled with blue mist, and tipsy artists wander from it, chuckling; one nudges another on the elbows. Rex escorts Lisa under the stone arch over the creek, and they pause there momentarily, as merry revelers meander over it. From below, Lisa and Rex observe their polished leather shoes pass by. An artist is pulled from the misty gallery. Rex guides Lisa along the creek as the exhibition is winding down, and the last of the artists amble away from the gallery. Lisa and Rex climb up the banks of the creek and onto the path, and she slips in the puddle. They're noticed by strolling tourists who wave their cameras, and Rex dives onto Lisa to embrace her. Scout fires at one of them and then aims again, and the second tourist's hat shreds and he stumbles through a nearby hedge to join his fallen companion. Rex and Lisa depart as Scout adjusts a thermal-lens scope on his gadget. The drizzle has stopped, and the sun emerges from behind a cluster of trees. The curator steps out from his office in his jacket, pulling the small dog alongside him. He stands on his porch, observing the dog saunter away across the courtyard before turning and heading back inside, closing the office door behind him. Rex, Lisa, and Scout dash through the meadow and halt, winded, at a fence post. Rex turns to Scout, and they share glances before they continue onward. A silver moon rises over the tops of hills, and the gallery is bustling with excitement. Scent hounds sniff around canvases for traces, and they're loaded into the backs of vans. The curator stomps irritably out of his office, exchanges pleasantries with an aide before marching across the courtyard to the artist's studio, and enters to gaze wide-eyed in shock at the sight of the artist's easel on the studio floor, with paint either fresh or dried about the canvas or pooling on the floor. The curator takes a few deep gulps and exits again. Rex, Lisa, and Scout race past a line of shrubs. The curator stands in the back seat of the van with a mounted spotlight and leads a small parade out of the gallery, followed by a pair of open-topped buses filled with artists. Morgan leads his team of adventurers and freed citizens through the field, and some way behind him are Rex, Lisa, and Scout. On a gravel path, one of the buses parks and a group of artists dismount with sketchpads ready."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Rambo plucks a feather from his hat and tosses it to the wind, and Sarah glances around. Soldiers argue over pastries at the banquet as Rambo guides Sarah from the gardener's shed and across the playground. The banquet tent is shrouded in blue mist, and tipsy soldiers waltz out of it, chuckling; one pats another on the elbows. Rambo guides Sarah under the stone arch over the creek, and they pause there momentarily, as inebriated drummers waltz across it. From below, Sarah and Rambo observe their shiny rubber shoes traipse by. A cat is tugged from the misty banquet tent. Rambo guides Sarah along the creek as the celebration concludes, and the last of the soldiers waltz away from the banquet tent. Sarah and Rambo ascend the shoulders of the creek and onto the path, and she slips in the grass. They're spotted by wandering guards who lower their lanterns, and Rambo dives over Sarah to cover her. School Boy flicks one of them and then peeks again, and the second guard's hat implodes and he tumbles through a nearby bush to join his resting comrade. Rambo and Sarah depart as School Boy closes a thermal lens on his apparatus. The drizzle has ended, and the stars emerge from behind a veil of mist. The commander hobbles from his shed in his sweater, guiding the tiny puppy before him. He stands on his balcony, watching the puppy skip away across the playground before turning and going back inside, shutting the shed door behind him. Rambo, Sarah, and School Boy sprint through the meadow and pause breathlessly at a toadstool. Rambo turns to School Boy, and they exchange winks before they move onward. A silver moon rises over the tops of bushes, and the camp is a buzz of activity. Scout cats sniff around knapsacks for odors, and they're lifted into the beds of carts. The commander strides irritably out of his shed, trades words with a cadet before marching across the playground to the chef's hut, and goes inside to gape wide-eyed in shock at the sight of the chef's mannequin on the hut floor, with paint either fresh or dried about the mannequin's broken neck or pooling on the floor. The commander takes a few short breaths and departs again. Rambo, Sarah, and School Boy jog past a ridge of sand. The commander stands in the passenger seat of the cart with a mounted telescope and leads a small procession out of the camp, followed by a pair of covered wagons packed with pipers. Lewis leads his band of explorers and rescued travelers through the meadow, and some way behind him are Rambo, Sarah, and School Boy. On a grassy path, one of the wagons halts and a group of pipers disembark with instruments poised."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Nimbus yanks out his hair and catapults it to the ceiling, and Luna blinks up. Bakers debate over baskets at the fiesta as Nimbus guides Luna from the librarian's cabin and across the meadow. The fiesta cabin is swamped in blue fog, and tipsy bakers wobble from it, chuckling; one pats another on the elbows. Nimbus guides Luna beneath the steel arch over the river, and they pause there momentarily, as inebriated hikers lurch over it. From underneath, Luna and Nimbus observe their heavy hiking boots shuffle past. A basket is tugged from the foggy fiesta cabin. Nimbus directs Luna along the river as the celebration is done, and the final of the bakers totter away from the fiesta cabin. Luna and Nimbus ascend the banks of the river and onto the path, and she slips in the sludge. They're noticed by wandering farmers who lift their shovels, and Nimbus dives onto Luna to cover her. Scholar Girl tosses one of them and then targets again, and the second farmer's hat shatters and he tumbles through a nearby hedge to join his toppled partner. Nimbus and Luna depart as Scholar Girl shuts a thermal scope on her gadget. The drizzle has ceased, and the star emerges from behind a veil of mist. The master steps out from his cabin in his coat, propelling the tiny goat before him. He perches on his porch, observing the goat march away across the meadow before revolving and stepping back inside, shutting the cabin flap behind him. Nimbus, Luna, and Scholar Girl dash through the jungle and halt breathlessly at a bush stem. Nimbus glances at Scholar Girl, and they swap glimpses before they proceed. A silver star peeks above the crowns of foliage, and the meadow is a maze of action. Hound dogs search around bags for aromas, and they're hoisted into the rears of wagons. The master marches furiously out of his cabin, converses with a rookie before striding across the meadow to the baker's cabin, and enters to gaze wide-eyed in shock at the sight of the baker's statue on the cabin ceiling, with ink either damp or encrusted about the man's inert elbow or puddling on the ceiling. The master inhales a few swift breaths and departs again. Nimbus, Luna, and Scholar Girl scamper past a curtain of vines. The master stands in the driver's seat of the wagon with a mounted bell and pilots a tiny fleet out of the meadow, trailed by a duo of open-topped carriages filled with hikers. Edgar guides his crew of travelers and freed villagers through the jungle, and some distance behind him are Nimbus, Luna, and Scholar Girl. On a gravel path, one of the carriages stops and a group of hikers disembark with gadgets prepared."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Rambo kills a soldier as chaos erupts among troops at a dance. He quickly leads Sarah through the compound, hiding under a bridge to evade drunken soldiers. They head upstream while the last soldiers leave the dance hut. Spotted by guards, Rambo shields Sarah as School Boy arrives and shoots them. The three escape under moonlight as a commander, unaware of the chaos, pushes a small boy away before retreating inside. Rambo, Sarah, and School Boy rest briefly before moving on through the forest. At dawn, tracker dogs search for them as the camp buzzes with activity. The commander, shocked by the soldier's death, launches a convoy in pursuit. Meanwhile, Lewis leads mercenaries and peasants, with Rambo's group trailing behind. On a dirt road, troops dismount from a truck, weapons ready."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "On a dirt road one of the lorries pulls up and a bunch of troopers dismount with weapons primed Lewis leads his party of mercenaries and rescued peasants through the forest and some way behind him are Rambo Sarah and School Boy  The commander stands in the passenger seat of the truck with a mounted machinegun and leads a small convoy out of the camp followed by a pair of opentopped lorries packed with troopers  The commander takes a few short breaths and leaves again Rambo Sarah and School Boy run past a wall of rock  The commander strides angrily out of his hut exchanges words with a junior before stalking across the compound to the soldier's hut and goes inside to stare wideeyed in horror at the sight of the soldier's corpse on the hut floor with blood either wet or caked about the man's dead neck or pooling on the floor  Tracker dogs sniff around clothing for scents and they're lifted into the backs of trucks  A golden sun peaks over the tops of trees and the camp is a hive of activity  Rambo turns to School Boy and they exchange stares before they move away  Rambo Sarah and School Boy run through the forest and pause breathlessly at a tree trunk  He stands on his veranda watching the boy trudge away across the compound before turning and heading back inside closing the hut door behind him  The commander emerges from his hut in his vest pushing the small boy before him  The rain has stopped and the moon appears from behind a bank of cloud  Rambo and Sarah leave as School Boy closes a nightvision sight on his weapon  School Boy shoots one of them and then aims again and the second guard's head explodes and he flies through a nearby fence to join his fallen comrade  They're spotted by patrolling guards who raise their rifles and Rambo leaps onto Sarah to shield her  Sarah and Rambo climb up the banks of the stream and into the road and she falls in the mud  Rambo leads Sarah up the stream as the party is all over and the last of the soldiers stagger away from the dance hut  A woman is dragged from the smoky dance hut  From below Sarah and Rambo watch their solid army boots go by  Rambo leads Sarah under the wooden bridge over the stream and they hide there briefly as drunken troopers stagger over it  one taps another on the shoulders  The dance hut is engulfed in red smoke and boozy soldiers stagger from it grinning  Soldiers fight over women at the dance as Rambo leads Sarah from the officer's hut and across the compound  Rambo rips out his throat and throws him to the floor and Sarah looks up "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The dance hut is engulfed in red smoke and boozy soldiers stagger from it grinning  The commander stands in the passenger seat of the truck with a mounted machinegun and leads a small convoy out of the camp followed by a pair of opentopped lorries packed with troopers  The rain has stopped and the moon appears from behind a bank of cloud  Rambo leads Sarah up the stream as the party is all over and the last of the soldiers stagger away from the dance hut  The commander strides angrily out of his hut exchanges words with a junior before stalking across the compound to the soldier's hut and goes inside to stare wideeyed in horror at the sight of the soldier's corpse on the hut floor with blood either wet or caked about the man's dead neck or pooling on the floor  Rambo Sarah and School Boy run through the forest and pause breathlessly at a tree trunk  Rambo turns to School Boy and they exchange stares before they move away  On a dirt road one of the lorries pulls up and a bunch of troopers dismount with weapons primed Tracker dogs sniff around clothing for scents and they're lifted into the backs of trucks  They're spotted by patrolling guards who raise their rifles and Rambo leaps onto Sarah to shield her  Rambo and Sarah leave as School Boy closes a nightvision sight on his weapon  Lewis leads his party of mercenaries and rescued peasants through the forest and some way behind him are Rambo Sarah and School Boy  He stands on his veranda watching the boy trudge away across the compound before turning and heading back inside closing the hut door behind him  A golden sun peaks over the tops of trees and the camp is a hive of activity  Soldiers fight over women at the dance as Rambo leads Sarah from the officer's hut and across the compound  one taps another on the shoulders  The commander takes a few short breaths and leaves again Rambo Sarah and School Boy run past a wall of rock  A woman is dragged from the smoky dance hut  Rambo leads Sarah under the wooden bridge over the stream and they hide there briefly as drunken troopers stagger over it  Sarah and Rambo climb up the banks of the stream and into the road and she falls in the mud  School Boy shoots one of them and then aims again and the second guard's head explodes and he flies through a nearby fence to join his fallen comrade  The commander emerges from his hut in his vest pushing the small boy before him  From below Sarah and Rambo watch their solid army boots go by  Rambo rips out his throat and throws him to the floor and Sarah looks up "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The rain has stopped and the moon appears from behind a bank of cloud  The commander emerges from his hut in his vest pushing the small boy before him  He stands on his veranda watching the boy trudge away across the compound before turning and heading back inside closing the hut door behind him  Rambo Sarah and School Boy run through the forest and pause breathlessly at a tree trunk  Rambo turns to School Boy and they exchange stares before they move away  A golden sun peaks over the tops of trees and the camp is a hive of activity  Tracker dogs sniff around clothing for scents and they're lifted into the backs of trucks  The commander strides angrily out of his hut exchanges words with a junior before stalking across the compound to the soldier's hut and goes inside to stare wideeyed in horror at the sight of the soldier's corpse on the hut floor with blood either wet or caked about the man's dead neck or pooling on the floor  The commander takes a few short breaths and leaves again Rambo Sarah and School Boy run past a wall of rock  The commander stands in the passenger seat of the truck with a mounted machinegun and leads a small convoy out of the camp followed by a pair of opentopped lorries packed with troopers  Lewis leads his party of mercenaries and rescued peasants through the forest and some way behind him are Rambo Sarah and School Boy  On a dirt road one of the lorries pulls up and a bunch of troopers dismount with weapons primed Rambo rips out his throat and throws him to the floor and Sarah looks up  Soldiers fight over women at the dance as Rambo leads Sarah from the officer's hut and across the compound  The dance hut is engulfed in red smoke and boozy soldiers stagger from it grinning  one taps another on the shoulders  Rambo leads Sarah under the wooden bridge over the stream and they hide there briefly as drunken troopers stagger over it  From below Sarah and Rambo watch their solid army boots go by  A woman is dragged from the smoky dance hut  Rambo leads Sarah up the stream as the party is all over and the last of the soldiers stagger away from the dance hut  Sarah and Rambo climb up the banks of the stream and into the road and she falls in the mud  They're spotted by patrolling guards who raise their rifles and Rambo leaps onto Sarah to shield her  School Boy shoots one of them and then aims again and the second guard's head explodes and he flies through a nearby fence to join his fallen comrade  Rambo and Sarah leave as School Boy closes a nightvision sight on his weapon "
        }
      ]
    }
  ]
}