{
  "ground_truth": "En-Joo runs out of ammo and takes a grenade from a fallen soldier, pulls the pin, and throws it. Reese rifle-butts a soldier in the face, then shoots another, while Lewis shoots from behind a tree trunk. Diaz twists the neck of a soldier and stabs him. En-Joo climbs up a flight of wooden stairs and finds another rifle, then begins popping away. Rambo runs out of ammo and takes cover behind a gun as Sarah looks over with concern. A soldier hurls a primed grenade at En-Joo; Lewis shoots the soldier, but the grenade has found its target, and En-Joo's bloody carcass is hurled to the ground. Rambo ducks down, finds a box of ammo, tears it open, and starts reloading the gun. One of the volunteers gets away, followed by the commander armed with an automatic pistol, and Michael sees him. The commander aims at the volunteer's back, and the volunteer pitches forward in the dirt as the commander runs away. Rambo continues his reloading as soldiers surround his position. He ducks as hot metal whizzes by, and Michael watches as a soldier crawls toward Lewis' position. The soldier shoots Lewis in the shoulder; Michael leaps on the soldier, and they tumble together down a short incline. Michael finds a rock in the sand and pounds the soldier in the head into bloody unconsciousness, his face a mask of indignant fury, then horrified, he slumps onto the sand. Fire rips through the battleground, and a soldier flies through the air, his uniform on fire. A man in an orange top loads a mortar rocket into a launcher on the hill as a collection of people in khaki and civilian colors pour down the hill. Rambo completes his reload and fires into the remaining troops. On the hill, a rebel loads another mortar into the launcher and covers his ears. BN jumps over a tree trunk, rolls, and fires on troops. The commander runs towards a group of his soldiers, gesturing behind him, and they begin a retreat but are picked off one by one. The commander has to make his strategic withdrawal by himself. BN notices the patrol boat as it rounds a headland in the river and scrambles down an incline towards the waterside. The gunner on the boat starts firing on the shore, and the shells obliterate the canopy on Rambo's boat. The patrol boat is armed with a flamethrower and a machine-gun; a jet of flame belches towards the shore, engulfing rebels. Rambo fires on the boat, tearing through the metal wall of its cabin, then takes a hit and falls from the machine-gun platform as Sarah covers her ears. A sheet of flame catches a volunteer in a brown shirt, who rolls in the sand.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "En-Joo dashes out of munitions and grasps a grenade from a fallen combatant, pulls the pin, and hurls it. Reese rifle-bludgeons a combatant in the face, then shoots another, while Lewis fires from behind a tree trunk. Diaz twists the neck of a combatant and stabs him. En-Joo ascends a flight of wooden stairs and finds another rifle, then begins popping away. Rambo dashes out of munitions and takes cover behind a gun as Sarah looks over with concern. A combatant hurls a primed grenade at En-Joo; Lewis shoots the combatant, but the grenade has found its target, and En-Joo's bloody carcass is hurled to the ground. Rambo ducks down, finds a box of munitions, tears it open, and starts reloading the gun. One of the volunteers gets away, followed by the commander armed with an automatic sidearm, and Michael sees him. The commander aims at the volunteer's back, and the volunteer pitches forward in the soil as the commander runs away. Rambo continues his reloading as combatants surround his position. He ducks as hot metal whizzes by, and Michael watches as a combatant crawls toward Lewis' position. The combatant shoots Lewis in the shoulder; Michael leaps on the combatant, and they tumble together down a short slope. Michael finds a rock in the sand and pounds the combatant in the head into bloody unconsciousness, his face a mask of indignant fury, then horrified, he slumps onto the sand. Fire rips through the battlefield, and a combatant flies through the air, his uniform ablaze. A man in an orange top loads a mortar rocket into a launcher on the hill as a collection of people in khaki and civilian colors pour down the hill. Rambo completes his reload and fires into the remaining troops. On the hill, a rebel loads another mortar into the launcher and covers his ears. BN jumps over a tree trunk, rolls, and fires on troops. The commander runs towards a group of his combatants, gesturing behind him, and they begin a retreat but are picked off one by one. The commander has to make his strategic withdrawal by himself. BN notices the patrol vessel as it rounds a headland in the river and scrambles down a slope towards the waterside. The gunner on the vessel starts firing on the shore, and the shells obliterate the canopy on Rambo's vessel. The patrol vessel is armed with a flamethrower and a machine-gun; a jet of flame belches towards the shore, engulfing rebels. Rambo fires on the vessel, tearing through the metal wall of its cabin, then takes a hit and falls from the machine-gun platform as Sarah covers her ears. A sheet of flame catches a volunteer in a brown shirt, who rolls in the sand."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "En-Joo runs out of ammo and a grenade is taken by him from a fallen soldier, the pin is pulled, and it is thrown by him. A soldier is rifle-butted in the face by Reese, then another is shot, while Lewis shoots from behind a tree trunk. A soldier’s neck is twisted by Diaz and he is stabbed. A flight of wooden stairs is climbed up by En-Joo, and another rifle is found by him, then popping away is begun by him. Ammo runs out for Rambo and cover is taken by him behind a gun as he is looked over with concern by Sarah. A primed grenade is hurled at En-Joo by a soldier; the soldier is shot by Lewis, but the target is found by the grenade, and En-Joo's bloody carcass is hurled to the ground. Rambo ducks down, a box of ammo is found by him, it is torn open, and the gun is started to be reloaded by him. One of the volunteers gets away, the commander armed with an automatic pistol follows, and Michael sees him. The volunteer's back is aimed at by the commander, and the volunteer pitches forward in the dirt as the commander runs away. Reloading is continued by Rambo as soldiers surround his position. He ducks as hot metal whizzes by, and a soldier is watched by Michael as he crawls toward Lewis' position. Lewis is shot in the shoulder by the soldier; the soldier is leapt on by Michael, and they tumble together down a short incline. A rock is found by Michael in the sand, and the soldier is pounded in the head into bloody unconsciousness with it, his face a mask of indignant fury, then horrified, he slumps onto the sand. The battleground is ripped through by fire, and a soldier is flown through the air, his uniform on fire. A mortar rocket is loaded into a launcher on the hill by a man in an orange top as a collection of people in khaki and civilian colors pour down the hill. Rambo completes his reload and the remaining troops are fired on by him. On the hill, another mortar is loaded into the launcher by a rebel and his ears are covered. A tree trunk is jumped over by BN, he rolls, and troops are fired on by him. A retreat is begun by a group of his soldiers as the commander runs toward them, gesturing behind him, but they are picked off one by one. His strategic withdrawal has to be made by the commander alone. The patrol boat is noticed by BN as it rounds a headland in the river and an incline is scrambled down by him towards the waterside. The shore is fired on by the gunner on the boat, and the canopy on Rambo's boat is obliterated by the shells. The patrol boat is armed with a flamethrower and a machine-gun; a jet of flame is belched towards the shore, engulfing rebels. The boat is fired on by Rambo, the metal wall of its cabin is torn through by him, then he takes a hit and falls from the machine-gun platform as Sarah covers her ears. A sheet of flame catches a volunteer in a brown shirt, who rolls in the sand."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "En-Joo runs out of ammo, grabs a grenade from a fallen soldier, pulls the pin, and throws it. Reese rifle-butts a soldier, then shoots another, while Lewis fires from behind a tree. Diaz twists a soldier's neck and stabs him. En-Joo climbs wooden stairs, finds a rifle, and starts shooting. Rambo runs out of ammo and takes cover as Sarah looks on with concern. A soldier throws a grenade at En-Joo; Lewis shoots the soldier, but the grenade hits its target, and En-Joo's body is thrown to the ground. Rambo finds ammo, reloads, and soldiers surround him. Michael sees a commander aiming at a fleeing volunteer, who falls as the commander escapes. Rambo reloads as bullets fly, and Michael tackles a soldier who shot Lewis, pounding him unconscious with a rock. Fire rips through the battleground, and a soldier is set ablaze. A man in orange loads a mortar on the hill as people in khaki and civilian clothes descend. Rambo finishes reloading and fires at the troops. A rebel loads another mortar and covers his ears. BN jumps, rolls, and fires at troops. The commander retreats with his soldiers, but they are picked off. BN spots a patrol boat in the river and heads to the waterside. The boat fires onshore, destroying Rambo's boat canopy. Armed with a flamethrower and machine gun, the boat engulfs rebels in flames. Rambo fires back, hitting the boat's cabin, but is shot and falls as Sarah covers her ears. A volunteer in a brown shirt rolls in the sand, engulfed in flames."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "En-Joo runs out of ammo, grabs a grenade from a fallen soldier, and throws it. Reese rifle-butts and shoots soldiers, while Lewis fires from behind a tree. Diaz twists a soldier's neck and stabs him. En-Joo climbs stairs, finds a rifle, and starts shooting. Rambo runs out of ammo, takes cover, and Sarah looks concerned. A soldier throws a grenade at En-Joo; Lewis shoots him, but the grenade hits, killing En-Joo. Rambo finds ammo, reloads, and soldiers surround him. Michael sees a commander shoot a volunteer, who falls. Rambo reloads as soldiers close in. Michael attacks a soldier who shot Lewis, using a rock to knock him out, then slumps in horror. Fire rips through the battleground, and a soldier is set ablaze. A man in orange loads a mortar as people in khaki descend the hill. Rambo fires at troops. A rebel loads another mortar. BN rolls and fires on troops. The commander retreats alone as his soldiers are picked off. BN sees a patrol boat and heads to the water. The boat fires, destroying Rambo's canopy. Armed with a flamethrower and machine-gun, it engulfs rebels in flames. Rambo fires back, hits the boat, but is shot and falls as Sarah covers her ears. A volunteer in a brown shirt rolls in the sand, aflame."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "En-Joo, finding himself in a dire situation, runs out of ammunition and quickly grabs a grenade from a fallen soldier nearby. With urgency, he pulls the pin and throws it with precision. Meanwhile, Reese, in the heat of battle, uses the butt of his rifle to strike a soldier directly in the face, then swiftly turns to shoot another enemy. Nearby, Lewis takes cover behind the sturdy trunk of a tree, firing strategically. Diaz, with lethal efficiency, twists the neck of a soldier and follows up with a stabbing motion. En-Joo, seeking higher ground, climbs up a flight of wooden stairs and discovers another rifle, which he immediately uses to begin firing at the enemy.\n\nRambo, also running low on ammo, takes cover behind a large gun as Sarah watches him with visible concern. A soldier, seizing an opportunity, throws a primed grenade at En-Joo. Although Lewis manages to shoot the soldier, the grenade reaches its target, and En-Joo's bloody body is violently thrown to the ground. Rambo ducks down, quickly locates a box of ammunition, tears it open with urgency, and starts reloading his gun. Amidst the chaos, one of the volunteers manages to escape, pursued by the commander who is armed with an automatic pistol. Michael observes as the commander takes aim at the volunteer's back, causing the volunteer to fall forward into the dirt while the commander makes his escape.\n\nRambo continues his reloading process as soldiers begin to surround his position. He ducks instinctively as hot metal bullets whiz past him. Michael watches intently as a soldier crawls stealthily toward Lewis' position. The soldier fires, hitting Lewis in the shoulder, prompting Michael to leap onto the soldier. They tumble together down a short incline, and Michael, in a desperate act, finds a rock in the sand and uses it to pound the soldier's head into bloody unconsciousness. His face a mask of indignant fury, Michael is horrified by his actions and slumps onto the sand, overwhelmed.\n\nThe battleground is engulfed in fire, and a soldier is seen flying through the air, his uniform ablaze. On a nearby hill, a man wearing an orange top loads a mortar rocket into a launcher as a group of people dressed in khaki and civilian colors rush down the hill. Rambo finishes reloading and fires into the remaining troops with determination. On the hill, a rebel loads another mortar into the launcher and covers his ears in anticipation. BN, with agility, jumps over a tree trunk, rolls, and fires at the troops. The commander, realizing the situation is dire, runs towards a group of his soldiers, gesturing for them to retreat. However, they are picked off one by one, forcing the commander to make his strategic withdrawal alone.\n\nBN notices a patrol boat as it rounds a headland in the river and quickly scrambles down an incline towards the waterside. The gunner on the boat begins firing on the shore, and the shells obliterate the canopy on Rambo's boat. The patrol boat, equipped with a flamethrower and a machine gun, unleashes a jet of flame towards the shore, engulfing the rebels in fire. Rambo, undeterred, fires on the boat, tearing through the metal wall of its cabin. However, he takes a hit and falls from the machine-gun platform as Sarah covers her ears in distress. A sheet of flame catches a volunteer in a brown shirt, who desperately rolls in the sand in an attempt to extinguish the fire."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "En-Joo, realizing he is in an extremely desperate predicament, discovers that he has completely run out of ammunition. In quick response to this urgent need, he swiftly grabs a grenade that was lying near a fallen comrade nearby. Acting with a sense of urgency, he expertly pulls the pin free and hurls the grenade with precise accuracy. Meanwhile, in the midst of the intense battle, Reese uses the solid butt of his rifle to deliver a powerful strike directly to the face of a soldier, before rapidly turning to shoot another adversary. Not far away, Lewis finds safety behind the thick, unyielding trunk of a sturdy tree and fires his weapon with strategic intent. Nearby, Diaz, displaying lethal efficiency, twists a soldier's neck with decisive force and follows through with a stabbing motion. Seeking an advantageous position, En-Joo ascends a wooden staircase, where he finds another rifle and immediately begins firing at the enemy with focused intent.\n\nRambo, who is also running dangerously low on ammunition, takes refuge behind a large gun, all while Sarah watches him with visible concern etched on her face. A soldier, seizing a favorable opportunity, throws a primed grenade towards En-Joo. Despite Lewis managing to neutralize the soldier, the grenade still reaches its intended target, causing En-Joo's bloodied body to be violently thrown to the ground. In the midst of this chaos, Rambo crouches down, his eyes rapidly scanning the area, and swiftly locates a box of ammunition. He tears it open with urgency and begins reloading his gun as quickly as he can. Amidst the turmoil, one of the volunteers seizes the chance to escape, but is quickly pursued by the commander, who is armed with an automatic pistol. Michael observes intently as the commander takes careful aim at the volunteer's back, resulting in the volunteer falling forward into the dirt, while the commander makes his escape.\n\nRambo continues the critical task of reloading his weapon as enemy soldiers begin to surround his precarious position. Instinctively, he ducks down as hot, whizzing metal bullets fly past him, barely missing. Michael looks on with intensity as a soldier stealthily crawls toward Lewis' position. The soldier fires and hits Lewis in the shoulder, prompting Michael to leap onto the soldier. They both tumble down a small incline, and Michael, driven by desperation, finds a rock in the sand and uses it to pound the soldier’s head until the soldier lapses into a bloody unconsciousness. Michael's face is a mask of indignant fury, horrified by what he has done, and he collapses onto the sand, completely overwhelmed by the situation.\n\nThe battleground is engulfed in fiery chaos, and a soldier is seen propelled through the air, his uniform ablaze. On a nearby hill, a man dressed in an orange top carefully loads a mortar rocket into a launcher, as a group of people clothed in both khaki and civilian attire rush down the hill in a frenzied manner. Rambo finishes reloading his gun and fires steadfastly into the remaining troops with unwavering determination. On the hill, a rebel loads another mortar into the launcher and prepares for the impact by covering his ears. BN, displaying impressive agility, leaps over a fallen tree trunk, rolls smoothly, and fires his weapon at the approaching troops. The commander, realizing the desperate state of the situation, runs toward a group of his soldiers, gesturing emphatically for them to retreat. However, one by one, they are picked off, forcing the commander to make a strategic withdrawal all by himself.\n\nBN notices a patrol boat as it rounds a headland in the river, prompting him to quickly scramble down an incline toward the waterside. The gunner on the boat begins discharging rounds onto the shore, with the shells obliterating the canopy on Rambo's boat. The patrol boat, armed with both a flamethrower and a machine gun, unleashes a jet of searing flame toward the shore, engulfing the rebels in a fiery inferno. Undeterred by the flames, Rambo fires on the boat, tearing through the metal wall of its cabin. However, he takes a hit and is knocked from the machine-gun platform as Sarah covers her ears in distress, clearly affected by the unfolding events. A volunteer, wearing a brown shirt, is caught in a sheet of flame and desperately rolls in the sand in a frantic attempt to extinguish the fire consuming him."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "En-Joo, finding himself out of ammunition, quickly scans his surroundings and spots a grenade lying next to a fallen soldier. He swiftly reaches down, grabs the grenade, and with a practiced motion, pulls the pin before hurling it towards the enemy. Meanwhile, Reese, in the heat of battle, forcefully swings his rifle, striking a soldier in the face with the butt of his weapon, and without missing a beat, he aims and shoots another adversary. Nearby, Lewis takes cover behind the sturdy trunk of a tree, carefully aiming and firing at the enemy. Diaz, engaged in close combat, skillfully twists the neck of a soldier, incapacitating him, and follows up with a precise stab. En-Joo, seeking higher ground, ascends a flight of wooden stairs, his eyes scanning for a weapon. He spots another rifle, seizes it, and begins firing at the enemy with renewed vigor. Rambo, also out of ammo, quickly assesses his situation and takes cover behind a gun emplacement, glancing over to see Sarah watching him with concern. Suddenly, a soldier, with a determined look, hurls a primed grenade towards En-Joo. Lewis, reacting swiftly, shoots the soldier, but the grenade has already been thrown, and it lands near En-Joo, resulting in a devastating explosion that sends his bloody body crashing to the ground. Rambo, maintaining his composure, ducks down and spots a box of ammunition. He tears it open with urgency and begins reloading his weapon. Amidst the chaos, one of the volunteers manages to escape, but the commander, armed with an automatic pistol, gives chase. Michael, observing the scene, sees the commander take aim at the volunteer's back, and the volunteer falls forward into the dirt as the commander makes his escape. Rambo continues to reload his weapon as enemy soldiers close in on his position. He ducks instinctively as bullets whiz past him, their heat palpable. Michael, watching intently, notices a soldier stealthily crawling towards Lewis' position. The soldier fires, hitting Lewis in the shoulder, prompting Michael to leap into action. He tackles the soldier, and they tumble down a short incline together. In the sand, Michael's hand finds a rock, and with a surge of adrenaline, he pounds the soldier's head into unconsciousness, his face contorted with a mix of fury and horror. Overwhelmed, he collapses onto the sand. The battleground erupts in flames, and a soldier is violently propelled through the air, his uniform ablaze. On a nearby hill, a man in an orange top methodically loads a mortar rocket into a launcher as a group of people in khaki and civilian attire rush down the hill. Rambo, having completed his reload, resumes firing at the remaining enemy troops. On the hill, a rebel loads another mortar into the launcher and covers his ears in anticipation of the blast. BN, agile and focused, leaps over a tree trunk, rolls, and fires at the enemy soldiers. The commander, realizing the tide of battle is turning, runs towards his group of soldiers, gesturing for a retreat, but they are systematically picked off one by one, leaving him to make a strategic withdrawal alone. BN, alert and observant, notices a patrol boat rounding a headland in the river and quickly scrambles down an incline towards the waterside. The gunner on the boat opens fire on the shore, the shells obliterating the canopy on Rambo's boat. The patrol boat, equipped with a flamethrower and a machine gun, unleashes a jet of flame towards the shore, engulfing the rebels in its fiery path. Rambo, undeterred, fires at the boat, his bullets tearing through the metal wall of its cabin. However, he takes a hit and falls from the machine-gun platform, while Sarah, witnessing the chaos, covers her ears against the deafening noise. A sheet of flame catches a volunteer in a brown shirt, who desperately rolls in the sand in an attempt to extinguish the fire."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "En-Joo, out of ammo, grabs a grenade from a fallen soldier, throws it, and then ascends wooden stairs to find another rifle, resuming fire. Meanwhile, Reese and Lewis engage in combat, with Reese using his rifle and Lewis shooting from cover. Diaz eliminates a soldier with a neck twist and stab. Rambo, also out of ammo, takes cover and begins reloading as Sarah watches with concern. A soldier throws a grenade at En-Joo, resulting in his death despite Lewis shooting the attacker. Rambo continues reloading under fire, while Michael observes a commander targeting a fleeing volunteer, who is shot down. As soldiers close in, Michael tackles one attacking Lewis, using a rock to subdue him before collapsing in horror. The battlefield erupts in flames, with soldiers caught in the chaos. On a hill, a man in an orange top and others prepare mortar rockets, while Rambo finishes reloading and fires at enemy troops. BN joins the fight, rolling and shooting as the commander retreats alone. BN spots a patrol boat approaching and moves towards the river. The boat, equipped with a flamethrower and machine gun, attacks the shore, damaging Rambo's boat. Rambo retaliates, damaging the boat's cabin but is hit and falls, as Sarah shields her ears. A volunteer caught in flames rolls in the sand."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "En-Joo runs out of ammo and takes a grenade from a fallen soldier, possibly one who belonged to the enemy's specialized unit known for their destructive tactics, pulls the pin, and throws it. Reese, trained in hand-to-hand combat from years of military service, rifle-butts a soldier in the face, then shoots another, while Lewis shoots from behind a tree trunk that had been splintered by previous battles. Diaz, known for his proficiency in silent takedowns, twists the neck of a soldier and stabs him. En-Joo climbs up a flight of wooden stairs, remnants of an old outpost built during the previous conflict, and finds another rifle, then begins popping away. Rambo, a veteran of numerous skirmishes, runs out of ammo and takes cover behind a gun emplacement as Sarah, who had been assisting with medical aid, looks over with concern. A soldier, part of the enemy's elite tactical team, hurls a primed grenade at En-Joo; Lewis shoots the soldier, but the grenade has found its target, and En-Joo's bloody carcass is hurled to the ground. Rambo ducks down, finds a box of ammo hidden under debris from an earlier explosion, tears it open, and starts reloading the gun. One of the volunteers, a young man new to the battlefield, gets away, followed by the commander armed with an automatic pistol renowned for its rapid fire, and Michael sees him. The commander aims at the volunteer's back, and the volunteer pitches forward in the dirt as the commander runs away. Rambo continues his reloading as soldiers surround his position. He ducks as hot metal from the enemy's relentless fire whizzes by, and Michael, known among his group for his quick reflexes, watches as a soldier crawls toward Lewis' position. The soldier shoots Lewis in the shoulder; Michael leaps on the soldier, and they tumble together down a short incline covered with loose gravel. Michael finds a rock in the sand and pounds the soldier in the head into bloody unconsciousness, his face a mask of indignant fury, then horrified, he slumps onto the sand. Fire from an enemy's explosive device rips through the battleground, and a soldier flies through the air, his uniform, typically fire-resistant, on fire. A man in an orange top, signaling his role as a support unit member, loads a mortar rocket into a launcher on the hill as a collection of people in khaki and civilian colors pour down the hill. Rambo completes his reload and fires into the remaining troops, using tactics he learned during jungle warfare training. On the hill, a rebel, part of an alliance resisting enemy forces, loads another mortar into the launcher and covers his ears. BN, a former athlete known for his agility, jumps over a tree trunk, rolls, and fires on troops. The commander runs towards a group of his soldiers, gesturing behind him to indicate a strategic fallback, and they begin a retreat but are picked off one by one. The commander has to make his strategic withdrawal by himself, desperate to regroup for a counterattack. BN notices the patrol boat, a model used primarily by the navy for river patrols, as it rounds a headland in the river and scrambles down an incline towards the waterside. The gunner on the boat starts firing on the shore, and the shells obliterate the canopy on Rambo's boat, once a vibrant shelter used for supply storage. The patrol boat is armed with a flamethrower and a machine-gun of high caliber; a jet of flame belches towards the shore, engulfing rebels. Rambo, recalling past encounters with similar threats, fires on the boat, tearing through the metal wall of its cabin, then takes a hit and falls from the machine-gun platform as Sarah, scared by the intense noise, covers her ears. A sheet of flame catches a volunteer in a brown shirt, who rolls in the sand in an attempt to extinguish the fire."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "EnJoo runs out of ammo and takes a grenade from a fallen soldier pulls the pin and throws it. Reese riflebutts a soldier in the face then shoots another while Lewis shoots from behind a tree trunk. Diaz twists the neck of a soldier and stabs him. EnJoo climbs up a flight of wooden stairs and finds another rifle then begins popping away. Rambo runs out of ammo and takes cover behind a gun as Sarah looks over with concern. A soldier hurls a primed grenade at EnJoo. Lewis shoots the soldier but the grenade has found its target and EnJoo's bloody carcass is hurled to the ground. Rambo ducks down finds a box of ammo tears it open and starts reloading the gun. One of the volunteers gets away followed by the commander armed with an automatic pistol and Michael sees him. The commander aims at the volunteer's back and the volunteer pitches forward in the dirt as the commander runs away. Rambo continues his reloading as soldiers surround his position. He ducks as hot metal whizzes by and Michael watches as a soldier crawls toward Lewis' position. The soldier shoots Lewis in the shoulder. Michael leaps on the soldier and they tumble together down a short incline. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Michael finds a rock in the sand and pounds the soldier in the head into bloody unconsciousness his face. a mask of indignant fury then horrified he slumps onto the sand. Fire rips through the battleground and a soldier flies through the air his uniform on fire. A man in an orange top loads a mortar rocket into a launcher on the hill as a collection of people in khaki and civilian colors pour down the hill. Rambo completes his reload and fires into the remaining troops. On the hill a rebel loads another mortar into the launcher and covers his ears. BN jumps over a tree trunk rolls and fires on troops. The commander runs towards a group of his soldiers gesturing behind him and they begin a retreat but are picked off one by one. The commander has to make his strategic withdrawal by himself. BN notices the patrol boat as it rounds a headland in the river and scrambles down an incline towards the waterside. The gunner on the boat starts firing on the shore and the shells obliterate the canopy on Rambo's boat. The patrol boat is armed with a flamethrower and a machinegun. a jet of flame belches towards the shore engulfing rebels. Rambo fires on the boat tearing through the metal wall of its cabin then takes a hit and falls from the machinegun platform as Sarah covers her ears. A sheet of flame catches a volunteer in a brown shirt who rolls in the sand."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "EnJoo runs out of ammo and takes a grenade from a fallen soldier pulls the pin and throws it. Reese riflebutts a soldier in the face then shoots another while Lewis shoots from behind a tree trunk. Diaz twists the neck of a soldier and stabs him. EnJoo climbs up a flight of wooden stairs and finds another rifle then begins popping away. Rambo runs out of ammo and takes cover behind a gun as Sarah looks over with concern. A soldier hurls a primed grenade at EnJoo. Lewis shoots the soldier but the grenade has found its target and EnJoo's bloody carcass is hurled to the ground. Rambo ducks down finds a box of ammo tears it open and starts reloading the gun. One of the volunteers gets away followed by the commander armed with an automatic pistol and Michael sees him. The commander aims at the volunteer's back and the volunteer pitches forward in the dirt as the commander runs away. Rambo continues his reloading as soldiers surround his position. He ducks as hot metal whizzes by and Michael watches as a soldier crawls toward Lewis' position. The soldier shoots Lewis in the shoulder. Michael leaps on the soldier and they tumble together down a short incline. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. Michael finds a rock in the sand and pounds the soldier in the head into bloody unconsciousness his face. a mask of indignant fury then horrified he slumps onto the sand. Fire rips through the battleground and a soldier flies through the air his uniform on fire. A man in an orange top loads a mortar rocket into a launcher on the hill as a collection of people in khaki and civilian colors pour down the hill. Rambo completes his reload and fires into the remaining troops. On the hill a rebel loads another mortar into the launcher and covers his ears. BN jumps over a tree trunk rolls and fires on troops. The commander runs towards a group of his soldiers gesturing behind him and they begin a retreat but are picked off one by one. The commander has to make his strategic withdrawal by himself. BN notices the patrol boat as it rounds a headland in the river and scrambles down an incline towards the waterside. The gunner on the boat starts firing on the shore and the shells obliterate the canopy on Rambo's boat. The patrol boat is armed with a flamethrower and a machinegun. a jet of flame belches towards the shore engulfing rebels. Rambo fires on the boat tearing through the metal wall of its cabin then takes a hit and falls from the machinegun platform as Sarah covers her ears. A sheet of flame catches a volunteer in a brown shirt who rolls in the sand."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "EnJoo runs out of ammo and takes a grenade from a fallen soldier pulls the pin and throws it. Reese riflebutts a soldier in the face then shoots another while Lewis shoots from behind a tree trunk. Diaz twists the neck of a soldier and stabs him. EnJoo climbs up a flight of wooden stairs and finds another rifle then begins popping away. Rambo runs out of ammo and takes cover behind a gun as Sarah looks over with concern. A soldier hurls a primed grenade at EnJoo. Lewis shoots the soldier but the grenade has found its target and EnJoo's bloody carcass is hurled to the ground. The commander runs towards a group of his soldiers gesturing behind him and they begin a retreat but are picked off one by one. The commander has to make his strategic withdrawal by himself. BN notices the patrol boat as it rounds a headland in the river and scrambles down an incline towards the waterside. The gunner on the boat starts firing on the shore and the shells obliterate the canopy on Rambo's boat. The patrol boat is armed with a flamethrower and a machinegun. a jet of flame belches towards the shore engulfing rebels. Rambo fires on the boat tearing through the metal wall of its cabin then takes a hit and falls from the machinegun platform as Sarah covers her ears. A sheet of flame catches a volunteer in a brown shirt who rolls in the sand."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "EnJoo runs out of ammo and takes a grenade from a fallen soldier pulls the pin and throws it. Reese riflebutts a soldier in the face then shoots another while Lewis shoots from behind a tree trunk. Diaz twists the neck of a soldier and stabs him. a jet of flame belches towards the shore engulfing rebels. Rambo fires on the boat tearing through the metal wall of its cabin then takes a hit and falls from the machinegun platform as Sarah covers her ears. A sheet of flame catches a volunteer in a brown shirt who rolls in the sand."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Griffith darts out of batteries and grabs a mushroom from a slumbering artist, plucks the strings, and flings it. Taylor head-butts a painter on the elbow, then juggles another, while Harper juggles from beneath a birdhouse. Morgan twists the tail of a mechanic and tickles him. Griffith slides up a set of metal escalators and discovers another violin, then starts drumming away. Denton darts out of batteries and takes shelter inside a cave as Lily peers over with curiosity. A magician flings a sparkling yo-yo at Griffith; Harper juggles the magician, but the yo-yo has missed its destination, and Griffith's sticky shadow is flung to the sky. Denton crouches down, finds a crate of batteries, cracks it open, and starts recharging the flashlight. One of the acrobats slips away, followed by the chef holding a rubber hammer, and Wendy hears her. The chef aims at the acrobat's shoe, and the acrobat dances forward in the grass as the chef hides away. Denton continues his recharging as florists encircle his spot. He crouches as cool wind wafts by, and Wendy notices as a dancer rolls toward Harper's location. The dancer juggles Harper in the knee; Wendy tumbles on the dancer, and they spiral together down a gentle slope. Wendy finds a pebble in the mud and taps the juggler in the foot into silky drowsiness, her hair a cloud of amused joy, then bewildered, she sprawls onto the mud. Water flows over the meadow, and a cyclist drifts through the air, his helmet on fire. A woman in a purple skirt fits a firecracker into a slingshot on the cliff as a parade of cats and exotic creatures trickle down the cliff. Denton completes his recharge and juggles at the remaining mannequins. On the cliff, an artist fits another firecracker into the slingshot and covers her eyes. LK hops over a lamppost, spins, and juggles at mannequins. The chef sprints towards a collection of her florists, signaling beside her, and they start a retreat but are painted off one by one. The chef has to perform her hasty exit by herself. LK glimpses the fishing boat as it angles around a peninsula in the ocean and dashes up an incline toward the lakeside. The captain on the boat begins juggling at the dune, and the balls disintegrate the awning on Denton's boat. The fishing boat is equipped with a leaf blower and a piano; a breeze of leaves gusts toward the dune, enveloping acrobats. Denton juggles at the boat, tearing through the fabric screen of its cabin, then gets splashed and slides from the piano platform as Lily covers her eyes. A wave of water catches an acrobat in a green coat, who spins in the mud."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "En-Joo runs out of ammo, grabs a grenade from a fallen soldier, and throws it. Reese and Diaz engage in combat, while Lewis shoots from cover. En-Joo ascends stairs, finds a rifle, but is killed by a grenade despite Lewis' attempt to stop it. Rambo runs out of ammo, then finds a box and reloads under fire as Michael tackles a soldier attacking Lewis. Michael defeats the soldier, horrified by his violence. Rambo fires into enemy ranks as rebel forces assist from a hill. The commander retreats alone as soldiers are picked off. BN notices a patrol boat with a flamethrower and races to the riverbank. The boat fires, damaging Rambo’s boat while Rambo retaliates, injuring the boat's cabin. Rambo is hit and falls as Sarah covers her ears from the chaos."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "A sheet of flame catches a volunteer in a brown shirt who rolls in the sand Rambo fires on the boat tearing through the metal wall of its cabin then takes a hit and falls from the machinegun platform as Sarah covers her ears  a jet of flame belches towards the shore engulfing rebels  The patrol boat is armed with a flamethrower and a machinegun  The gunner on the boat starts firing on the shore and the shells obliterate the canopy on Rambo's boat  BN notices the patrol boat as it rounds a headland in the river and scrambles down an incline towards the waterside  The commander has to make his strategic withdrawal by himself  The commander runs towards a group of his soldiers gesturing behind him and they begin a retreat but are picked off one by one  BN jumps over a tree trunk rolls and fires on troops  On the hill a rebel loads another mortar into the launcher and covers his ears  Rambo completes his reload and fires into the remaining troops  A man in an orange top loads a mortar rocket into a launcher on the hill as a collection of people in khaki and civilian colors pour down the hill  Fire rips through the battleground and a soldier flies through the air his uniform on fire  a mask of indignant fury then horrified he slumps onto the sand  Michael finds a rock in the sand and pounds the soldier in the head into bloody unconsciousness his face  Michael leaps on the soldier and they tumble together down a short incline  The soldier shoots Lewis in the shoulder  He ducks as hot metal whizzes by and Michael watches as a soldier crawls toward Lewis' position  Rambo continues his reloading as soldiers surround his position  The commander aims at the volunteer's back and the volunteer pitches forward in the dirt as the commander runs away  One of the volunteers gets away followed by the commander armed with an automatic pistol and Michael sees him  Rambo ducks down finds a box of ammo tears it open and starts reloading the gun  Lewis shoots the soldier but the grenade has found its target and EnJoo's bloody carcass is hurled to the ground  A soldier hurls a primed grenade at EnJoo  Rambo runs out of ammo and takes cover behind a gun as Sarah looks over with concern  EnJoo climbs up a flight of wooden stairs and finds another rifle then begins popping away  Diaz twists the neck of a soldier and stabs him  Reese riflebutts a soldier in the face then shoots another while Lewis shoots from behind a tree trunk  EnJoo runs out of ammo and takes a grenade from a fallen soldier pulls the pin and throws it "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Reese riflebutts a soldier in the face then shoots another while Lewis shoots from behind a tree trunk EnJoo runs out of ammo and takes a grenade from a fallen soldier pulls the pin and throws it EnJoo climbs up a flight of wooden stairs and finds another rifle then begins popping away Diaz twists the neck of a soldier and stabs him A soldier hurls a primed grenade at EnJoo Rambo runs out of ammo and takes cover behind a gun as Sarah looks over with concern Rambo ducks down finds a box of ammo tears it open and starts reloading the gun Lewis shoots the soldier but the grenade has found its target and EnJoo's bloody carcass is hurled to the ground The commander aims at the volunteer's back and the volunteer pitches forward in the dirt as the commander runs away One of the volunteers gets away followed by the commander armed with an automatic pistol and Michael sees him He ducks as hot metal whizzes by and Michael watches as a soldier crawls toward Lewis' position Rambo continues his reloading as soldiers surround his position Michael leaps on the soldier and they tumble together down a short incline The soldier shoots Lewis in the shoulder a mask of indignant fury then horrified he slumps onto the sand Michael finds a rock in the sand and pounds the soldier in the head into bloody unconsciousness his face A man in an orange top loads a mortar rocket into a launcher on the hill as a collection of people in khaki and civilian colors pour down the hill Fire rips through the battleground and a soldier flies through the air his uniform on fire On the hill a rebel loads another mortar into the launcher and covers his ears Rambo completes his reload and fires into the remaining troops The commander runs towards a group of his soldiers gesturing behind him and they begin a retreat but are picked off one by one BN jumps over a tree trunk rolls and fires on troops BN notices the patrol boat as it rounds a headland in the river and scrambles down an incline towards the waterside The commander has to make his strategic withdrawal by himself The patrol boat is armed with a flamethrower and a machinegun The gunner on the boat starts firing on the shore and the shells obliterate the canopy on Rambo's boat Rambo fires on the boat tearing through the metal wall of its cabin then takes a hit and falls from the machinegun platform as Sarah covers her ears a jet of flame belches towards the shore engulfing rebels A sheet of flame catches a volunteer in a brown shirt who rolls in the sand"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "a mask of indignant fury then horrified he slumps onto the sand  Fire rips through the battleground and a soldier flies through the air his uniform on fire  A man in an orange top loads a mortar rocket into a launcher on the hill as a collection of people in khaki and civilian colors pour down the hill  Rambo completes his reload and fires into the remaining troops  On the hill a rebel loads another mortar into the launcher and covers his ears  BN jumps over a tree trunk rolls and fires on troops  The commander runs towards a group of his soldiers gesturing behind him and they begin a retreat but are picked off one by one  The commander has to make his strategic withdrawal by himself  BN notices the patrol boat as it rounds a headland in the river and scrambles down an incline towards the waterside  The gunner on the boat starts firing on the shore and the shells obliterate the canopy on Rambo's boat  The patrol boat is armed with a flamethrower and a machinegun  a jet of flame belches towards the shore engulfing rebels  Rambo fires on the boat tearing through the metal wall of its cabin then takes a hit and falls from the machinegun platform as Sarah covers her ears  A sheet of flame catches a volunteer in a brown shirt who rolls in the sand EnJoo runs out of ammo and takes a grenade from a fallen soldier pulls the pin and throws it  Reese riflebutts a soldier in the face then shoots another while Lewis shoots from behind a tree trunk  Diaz twists the neck of a soldier and stabs him  EnJoo climbs up a flight of wooden stairs and finds another rifle then begins popping away  Rambo runs out of ammo and takes cover behind a gun as Sarah looks over with concern  A soldier hurls a primed grenade at EnJoo  Lewis shoots the soldier but the grenade has found its target and EnJoo's bloody carcass is hurled to the ground  Rambo ducks down finds a box of ammo tears it open and starts reloading the gun  One of the volunteers gets away followed by the commander armed with an automatic pistol and Michael sees him  The commander aims at the volunteer's back and the volunteer pitches forward in the dirt as the commander runs away  Rambo continues his reloading as soldiers surround his position  He ducks as hot metal whizzes by and Michael watches as a soldier crawls toward Lewis' position  The soldier shoots Lewis in the shoulder  Michael leaps on the soldier and they tumble together down a short incline  Michael finds a rock in the sand and pounds the soldier in the head into bloody unconsciousness his face "
        }
      ]
    }
  ]
}