{
  "ground_truth": "A truck of army reinforcements arrives, and Rambo gets back on the machine-gun platform as the reinforcements are cut to ribbons in the truck. Rambo fires on the boat, and bullets smash through its windscreen, killing the captain and helmsman. A bullet from School Boy decapitates the machine-gunner. On the shore, BN fires a loaded bazooka, and the boat is obliterated. Rambo spots the commander escaping up the hill, leaps down from the machine-gun platform, and gives chase. The commander stops, impaled on Rambo's machete, and faces Rambo, blowing out his cheeks and looking up at him. Rambo rips the commander's stomach open, and the commander drops to the ground. Rambo kicks the man's corpse away with a hefty boot, and it rolls away and lies face down. Rambo looks wearily down at the field of battle, and from her vantage point with School Boy, Sarah does the same. A couple of straggling troopers scuttle away, and Sarah makes her way down the hill, with School Boy picking up his hefty weapon and following her. Rambo also trudges back to the jeep. At the bottom of the hill, rebels buzz about as smoke billows and some of the foliage is burnt. Sarah looks about her, and Rambo lingers at the truck, watching her. He then frowns and feels his left shoulder with his right hand, checking his wound, and the back of his hand is bloody. Sarah finds Michael crouching over a wounded man, and he looks up as she runs to him and flings her arms around him. He has a wound to his forehead, and his face is black with soot and grime, while Rambo watches them. Sarah and Michael embrace for a few moments, then he gently pushes her arms away and strokes her hair before returning to the wounded man. School Boy kneels over Lewis, and Reese over En-Joo's corpse. Sarah looks up the hill at Rambo, her face grimy with a light cut across her forehead. She looks at School Boy, who stares down at Lewis as he stirs a little. She looks at the corpse of one of the volunteers, who has bullet wounds in his chest. Michael looks up the hill and sees Rambo, raising a hand to him wide-eyed and frowning. Sarah's face crumples and she starts to weep as Rambo turns away, clutching his shoulder. John Rambo walks along a lonely road halfway up a hill in Arizona, U.S.A., which is decorated with scrubby green grass and utility poles stretching along the length of the road. His hair is neatly brushed and face clean, wearing a pair of dark boots, blue denims, and a khaki parka over a black T-shirt, with a khaki kit bag slung over one shoulder.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A lorry of military backups arrives, and Rambo gets back on the firearm platform as the backups are cut to shreds in the lorry. Rambo fires on the vessel, and bullets smash through its windshield, killing the skipper and steersman. A bullet from School Boy beheads the weapon operator. On the shore, BN fires a loaded rocket launcher, and the vessel is destroyed. Rambo spots the leader fleeing up the hill, leaps down from the firearm platform, and gives pursuit. The leader stops, impaled on Rambo's knife, and faces Rambo, blowing out his cheeks and looking up at him. Rambo tears the leader's abdomen open, and the leader drops to the ground. Rambo kicks the man's carcass away with a hefty boot, and it rolls away and lies face down. Rambo looks wearily down at the battlefield, and from her vantage point with School Boy, Sarah does the same. A pair of straggling soldiers scuttle away, and Sarah makes her way down the hill, with School Boy picking up his hefty weapon and following her. Rambo also trudges back to the jeep. At the bottom of the hill, insurgents buzz about as smoke billows and some of the vegetation is burnt. Sarah looks about her, and Rambo lingers at the lorry, watching her. He then frowns and feels his left shoulder with his right hand, checking his injury, and the back of his hand is bloody. Sarah finds Michael crouching over a wounded man, and he looks up as she runs to him and flings her arms around him. He has a wound to his forehead, and his face is black with soot and dirt, while Rambo watches them. Sarah and Michael embrace for a few moments, then he gently pushes her arms away and strokes her hair before returning to the wounded man. School Boy kneels over Lewis, and Reese over En-Joo's body. Sarah looks up the hill at Rambo, her face dirty with a light cut across her forehead. She looks at School Boy, who stares down at Lewis as he stirs a little. She looks at the body of one of the volunteers, who has bullet wounds in his chest. Michael looks up the hill and sees Rambo, raising a hand to him wide-eyed and frowning. Sarah's face crumples and she starts to weep as Rambo turns away, clutching his shoulder. John Rambo walks along a lonely road halfway up a hill in Arizona, U.S.A., which is decorated with scrubby green grass and utility poles stretching along the length of the road. His hair is neatly brushed and face clean, wearing a pair of dark boots, blue jeans, and a khaki parka over a black T-shirt, with a khaki kit bag slung over one shoulder."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A truck of army reinforcements arrives, and the machine-gun platform is gotten back on by Rambo as he cuts the reinforcements to ribbons in the truck. The boat is fired on by Rambo, and its windscreen is smashed through by bullets, killing the captain and helmsman. School Boy fires a bullet that decapitates the machine-gunner. On the shore, BN loads a bazooka and fires it, obliterating the boat. The commander is spotted by Rambo escaping up the hill, so he leaps down from the machine-gun platform and chases after him. The commander stops when he is impaled on Rambo's machete and faces him, blowing out his cheeks and looking up at Rambo. The commander's stomach is ripped open by Rambo, and he drops to the ground. The man's corpse is kicked away by Rambo with a hefty boot, and it rolls away and lies face down. The field of battle is looked down upon wearily by Rambo, and from her vantage point with School Boy, Sarah does the same. A couple of straggling troopers scuttle away, and the hill is made her way down by Sarah, with School Boy picking up his hefty weapon and following her. The jeep is trudged back to by Rambo. At the bottom of the hill, rebels buzz about as smoke billows and some of the foliage is burnt. About her, Sarah looks, and at the truck, Rambo lingers, watching her. His left shoulder is then frowned at and felt by him with his right hand, checking his wound, and the back of his hand is bloody. Michael is found by Sarah crouching over a wounded man, and he looks up as she runs to him and flings her arms around him. A wound is on his forehead, and his face is black with soot and grime, while he is watched by Rambo. They embrace for a few moments, then Sarah's arms are gently pushed away by Michael, and her hair is stroked before returning to the wounded man. Lewis is kneeled over by School Boy, and En-Joo's corpse by Reese. Up the hill, Rambo is looked at by Sarah, her face grimy with a light cut across her forehead. At School Boy, who stares down at Lewis as he stirs a little, she looks. One of the volunteers' corpse, which has bullet wounds in his chest, is looked at by her. Michael looks up the hill and raises a hand wide-eyed and frowning at Rambo. Her face crumples, and she starts to weep as away he turns, clutching his shoulder. John Rambo is walking along a lonely road halfway up a hill in Arizona, U.S.A., which is decorated with scrubby green grass and utility poles that stretch along the road's length. His hair is neatly brushed and face clean, and he is wearing a pair of dark boots, blue denims, and a khaki parka over a black T-shirt, with a khaki kit bag slung over one shoulder."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Army reinforcements arrive as Rambo returns to the machine-gun platform, cutting down the soldiers in the truck. He fires at the boat, killing the captain and helmsman, while School Boy takes out the machine-gunner. BN uses a bazooka to destroy the boat. Spotting the commander escaping, Rambo chases and impales him with a machete, then slices his stomach open. Rambo kicks the corpse aside and surveys the battle area. From a vantage point, Sarah and School Boy observe the scene and descend the hill together. Rambo heads back to the jeep as rebels move about amidst smoke and burnt foliage. He checks his shoulder wound, getting blood on his hand. Sarah finds Michael with a head wound and embraces him. School Boy kneels by Lewis, while Reese is with En-Joo's body. Sarah sees Rambo on the hill and begins to weep as he turns away, clutching his shoulder. John Rambo walks along a lonely road in Arizona, clean and neatly dressed in boots, blue jeans, a khaki parka, and a black T-shirt, with a kit bag over his shoulder."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Army reinforcements arrive, but Rambo eliminates them from the machine-gun platform. He destroys a boat, killing its crew, while School Boy takes out the machine-gunner. BN obliterates the boat with a bazooka. Rambo chases and kills the escaping commander, then kicks the corpse away. Both Rambo and Sarah survey the battlefield, with Sarah descending the hill followed by School Boy. Rambo checks his bloody shoulder wound, watching Sarah reunite with Michael, who is injured. School Boy tends to Lewis, while Reese is with En-Joo's corpse. Sarah cries as Rambo turns away. Later, Rambo walks along a road in Arizona, wearing a khaki parka, blue denims, and carrying a kit bag."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As the tension reaches its peak, a large truck carrying army reinforcements arrives on the scene. Without wasting any time, Rambo quickly climbs back onto the sturdy machine-gun platform, prepared for action. In a matter of moments, the reinforcements inside the truck are relentlessly attacked, leaving them in ruins. With a determined look, Rambo aims his firepower at the boat, mercilessly unleashing bullets that shatter the windscreen, ending the lives of both the captain and the helmsman. Meanwhile, School Boy, an expert sharpshooter, takes a precise shot that successfully decapitates the enemy machine-gunner. \n\nOver on the shoreline, BN operates a powerful, loaded bazooka, skillfully annihilating the boat in a fiery explosion. From his vantage point, Rambo notices the commander attempting to flee up the hill. In an agile motion, he leaps down from the machine-gun platform and begins to pursue the commander with relentless determination. The chase concludes when the commander comes to a halt, finding himself impaled on Rambo's mighty machete. He momentarily pauses, puffing out his cheeks and casting his gaze upward toward Rambo. In a swift and brutal move, Rambo disembowels him, causing the commander to collapse lifelessly to the ground. With a powerful kick, Rambo sends the man's lifeless body rolling away until it comes to rest face down.\n\nSurveying the battlefield, Rambo takes a weary glance at the chaos around him. Meanwhile, from a safe vantage point alongside School Boy, Sarah observes the scene with equal weariness. A few troopers, stragglers from the defeated forces, scamper away in retreat. Sarah begins her descent down the hill, followed closely by School Boy, who hefts his formidable weapon as he accompanies her. Rambo, too, makes his way back toward the waiting jeep. \n\nAt the base of the hill, a scene of intense activity unfolds as rebels scurry around with smoke billowing in the background and patches of foliage reduced to ashes. Sarah takes in her surroundings, while Rambo lingers near the truck, his eyes following her. A somber expression crosses his face as he examines his left shoulder with his right hand, feeling the sting of his injury. Upon inspection, he notices the back of his hand stained with blood. Meanwhile, Sarah discovers Michael crouched over an injured man. As she rushes to his side, she throws her arms around him in relief. Michael bears a head wound, his face darkened with soot and grime. Rambo quietly observes their reunion. \n\nAfter a brief embrace, Michael gently removes Sarah's arms, tenderly smoothing her hair before returning his focus to the wounded individual. School Boy kneels beside Lewis, while Reese tends to En-Joo's lifeless form. Sarah lifts her gaze to Rambo, her face marked by soot and a shallow cut on her forehead. She exchanges a solemn glance with School Boy, who watches over Lewis as the injured man stirs slightly. Her eyes then drift to the lifeless body of one of the volunteers, riddled with bullet holes. Michael looks up the hill, his eyes meeting Rambo's, and offers a wide-eyed, frowning salute. Overcome with emotion, Sarah's face crumples, and tears stream down her cheeks as Rambo turns away, clutching his injured shoulder. \n\nIn a scene that transitions to a different setting, John Rambo is seen walking along a solitary road halfway up a serene hill in Arizona, U.S.A. This road is adorned with patches of scrubby green grass and lined with utility poles stretching along its length. His hair is immaculately brushed, and his face is clean-shaven. He is dressed in a pair of dark boots, blue denim jeans, and a khaki parka layered over a plain black T-shirt. A khaki kit bag rests over one broad shoulder, completing his solitary journey."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As the tension in the atmosphere reaches an incredible peak, a massive truck loaded with army reinforcements makes its grand entrance onto the scene, adding to the already charged environment. Not wasting even a second, Rambo swiftly climbs back onto the robust, sturdy machine-gun platform, fully prepared for the upcoming action. In just a few moments, the reinforcements inside the truck come under a relentless and brutal attack, leaving them in ruins and devastation. With a steely determination etched on his face, Rambo directs his formidable firepower toward the boat, unleashing a merciless stream of bullets that brutally shatter the windscreen and end the lives of both the captain and the helmsman. Meanwhile, the sharp-eyed expert sharpshooter, School Boy, takes a precise and well-aimed shot that successfully decapitates the enemy machine-gunner in one swift motion.\n\nOver on the shoreline, BN operates a powerful and fully loaded bazooka with great skill, expertly annihilating the boat in a spectacular fiery explosion. From his elevated vantage point, Rambo notices the commander attempting to hastily flee up the nearby hill. In one agile and fluid motion, he leaps down from the elevated machine-gun platform and begins to pursue the commander with relentless determination and speed. The chase comes to a dramatic conclusion when the commander comes to a sudden halt, finding himself impaled on Rambo's mighty machete. He temporarily pauses, puffing out his cheeks and casting an upward gaze at Rambo. In a swift and brutal move, Rambo disembowels him, causing the commander to collapse lifelessly onto the ground. With a powerful, decisive kick, Rambo sends the man's lifeless body rolling away until it comes to an undignified rest, face down.\n\nSurveying the chaotic battlefield, Rambo takes in the scene with a weary glance at the devastation and chaos around him. Meanwhile, from a safe vantage point alongside School Boy, Sarah observes the unfolding scene with an equal measure of weariness. A few troopers, stragglers from the thoroughly defeated forces, scamper away in a desperate retreat. Sarah begins her careful descent down the hill, closely followed by School Boy, who hefts his formidable weapon as he accompanies her in the descent. Rambo, too, starts making his way back toward the waiting jeep.\n\nAt the base of the hill, a scene of intense activity and urgency unfolds as rebels scurry around, while smoke billows in the background and patches of foliage lie reduced to ashes. Sarah takes in her surroundings with a somber gaze, while Rambo lingers near the truck, his eyes following her movements. A somber expression crosses his face as he examines his left shoulder with his right hand, feeling the sharp sting of his recent injury. Upon closer inspection, he notices that the back of his hand is stained with blood. Meanwhile, Sarah discovers Michael crouched over an injured man. As she rushes to his side, she throws her arms around him in a moment of relief. Michael bears a head wound, with his face darkened by soot and grime, bearing testament to the fierce battle. Rambo quietly observes their poignant reunion.\n\nAfter a brief yet meaningful embrace, Michael gently removes Sarah's arms from around him, tenderly smoothing her hair before returning his attention to the wounded individual. School Boy kneels by Lewis, while Reese tends to the lifeless form of En-Joo. Sarah lifts her gaze toward Rambo, her face marked by soot and a shallow cut on her forehead. She exchanges a solemn glance with School Boy, who watches over Lewis as the injured man stirs slightly. Her eyes then shift to the lifeless body of one of the volunteers, tragically riddled with bullet holes. Michael looks up the hill, his eyes meeting Rambo's, and offers a wide-eyed, deeply frowning salute. Overcome with emotion, Sarah's face crumples, and tears stream down her cheeks as Rambo turns away, clutching his injured shoulder with a pained expression.\n\nIn a scene that transitions gracefully to a different, more serene setting, John Rambo is seen walking along a solitary, quiet road halfway up a serene hill in the beautiful state of Arizona, U.S.A. This road is adorned with patches of scrubby green grass and lined with numerous utility poles stretching along its considerable length. His hair is immaculately brushed, and his face is clean-shaven, lending him a neat appearance. He is dressed in a pair of sturdy dark boots, well-worn blue denim jeans, and a khaki parka layered over a plain black T-shirt, completing his rugged look. A khaki kit bag rests securely over one broad shoulder, signaling the continuation of his solitary journey."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The scene unfolds with a truck of army reinforcements arriving on the battlefield. As the truck pulls up and comes to a halt, Rambo swiftly climbs back onto the machine-gun platform. While he secures his position, the reinforcements in the truck find themselves abruptly cut to ribbons amidst a flurry of gunfire. Observing the chaos, Rambo quickly takes aim and opens fire on the enemy boat. The bullets from his weapon pierce through the boat’s windscreen with lethal precision, instantly killing the captain and helmsman at their posts. At the same moment, School Boy, positioned from a distance, fires a bullet that precisely decapitates the enemy machine-gunner. On the shore, BN takes his position, steadies his aim with a loaded bazooka, and fires at the boat, which erupts into a ball of flames and debris, obliterated in an instant. In the ensuing chaos, Rambo's keen eyes catch sight of the enemy commander making a desperate escape up the hill. Without hesitation, he leaps down from the machine-gun platform and breaks into a determined chase. The commander, realizing he is pursued, comes to an abrupt stop only to find himself impaled on Rambo's machete. As their eyes meet, the commander exhales forcefully, cheeks puffed, and looks up at Rambo. In a swift, brutal motion, Rambo slashes the commander's stomach open, causing him to collapse lifelessly to the ground. Without pausing, Rambo delivers a powerful kick to the man's corpse, sending it rolling away to lie face down, lifeless. Pausing momentarily, Rambo casts a weary gaze over the field of battle, while Sarah, watching from her vantage point with School Boy, mirrors his somber reflection. A couple of enemy troopers, realizing the futility of their stand, scuttle away to safety. Observing the aftermath, Sarah begins her descent down the hill with deliberate strides, prompting School Boy to gather his hefty weapon and follow suit. Meanwhile, Rambo trudges back to the waiting jeep, his steps heavy with fatigue. At the foot of the hill, the scene is alive with rebels buzzing about amidst billowing smoke and charred foliage. Surveying the chaotic surroundings, Sarah takes in the gravity of the scene as Rambo lingers near the truck, his eyes following her. He then shifts focus to his own condition, frowning as he gingerly touches his left shoulder with his right hand, feeling the sting of a wound. Bringing his hand back into view, he observes the blood smeared on the back of his hand. Across the field, Sarah spots Michael crouched over a wounded man. With urgency, she rushes to him, flinging her arms around him in relief. Michael, with a wound on his forehead and a face marked with soot and grime, returns her embrace briefly before gently pushing her arms aside and tenderly stroking her hair. He then refocuses his attention back on the wounded man. Elsewhere, School Boy kneels beside Lewis, checking on his condition, while Reese tends to the fallen En-Joo. Sarah's gaze shifts from School Boy to the motionless body of a volunteer, riddled with bullet wounds to the chest, and then back up the hill where Rambo stands. Her face, marked by grime and a small cut across her forehead, reflects the somber reality of the battle. Michael, too, looks up the hill, his eyes locking with Rambo's as he raises a hand in acknowledgment, his expression a mix of gratitude and concern. Overcome with emotion, Sarah's face crumples and she begins to weep, unable to hold back her tears as Rambo turns away from the scene, clutching his wounded shoulder. Transitioning to a different setting, John Rambo walks along a lonely road halfway up a hill in Arizona, U.S.A. The road stretches ahead, flanked by scrubby green grass and utility poles that dot its length. Rambo's appearance is neat, his hair brushed and face clean, dressed in dark boots, blue denims, and a khaki parka over a black T-shirt. A khaki kit bag is casually slung over one shoulder, completing his solitary figure against the vast landscape."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A truck of army reinforcements arrives, and Rambo efficiently eliminates them from the machine-gun platform, simultaneously targeting the boat, where his gunfire takes out the captain and helmsman. School Boy's precise shot decapitates the boat's machine-gunner, and BN's bazooka destroys the boat. Spotting the commander fleeing, Rambo quickly dismounts and pursues him, ultimately impaling him with a machete and disemboweling him, before discarding the body with a powerful kick. Observing the battle's aftermath, Rambo, along with Sarah and School Boy from their vantage point, sees straggling troops retreat while Sarah and School Boy descend the hill. Rambo makes his way back to the jeep, through the chaotic scene of rebels and smoke. At the base, Sarah finds Michael tending to a wounded man, embraces him briefly, and then they return to their duties. Rambo watches them, then checks his own shoulder wound. School Boy tends to Lewis, while Reese oversees En-Joo’s body. Sarah, with a cut on her forehead, assesses the scene, including the fallen volunteers and Lewis, who moves slightly. Michael acknowledges Rambo with a raised hand, while Sarah begins to weep as Rambo turns away clutching his shoulder. Later, John Rambo walks alone on a secluded road in Arizona, neatly dressed with his gear, amidst the sparse landscape of scrubby grass and utility poles."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A truck of army reinforcements, heavily armored and marked with the insignia of the Burmese military, arrives, and Rambo, a former Green Beret renowned for his survival skills, gets back on the machine-gun platform as the reinforcements are cut to ribbons in the truck. Rambo fires on the boat, known for its reinforced steel hull, and bullets smash through its windscreen, killing the captain and helmsman instantly. A bullet from School Boy, a sniper known for his precision, decapitates the machine-gunner with chilling accuracy. On the shore, BN, a resistance fighter intimately familiar with guerrilla warfare tactics, fires a loaded bazooka, and the boat is obliterated in a fiery explosion. Rambo spots the commander, a high-ranking officer responsible for countless atrocities, escaping up the hill, leaps down from the machine-gun platform, and gives chase. The commander stops, impaled on Rambo's machete, a weapon synonymous with jungle warfare, and faces Rambo, blowing out his cheeks and looking up at him. Rambo, with a swift and practiced motion, rips the commander's stomach open, and the commander drops to the ground. Rambo kicks the man's corpse away with a hefty boot, and it rolls away and lies face down. Rambo looks wearily down at the field of battle, a chaotic scene of smoke and destruction, and from her vantage point with School Boy, Sarah does the same. A couple of straggling troopers, remnants of the defeated force, scuttle away, and Sarah makes her way down the hill, with School Boy, a seasoned marksman, picking up his hefty weapon and following her. Rambo also trudges back to the jeep, a military-grade vehicle left behind by retreating forces. At the bottom of the hill, rebels buzz about as smoke billows and some of the foliage, which provided valuable cover during the skirmish, is burnt. Sarah looks about her, her expression a mix of relief and sorrow, and Rambo lingers at the truck, watching her with a thoughtful gaze. He then frowns and feels his left shoulder with his right hand, checking his wound received in the heat of battle, and the back of his hand is bloody. Sarah finds Michael, a dedicated humanitarian aid worker, crouching over a wounded man, and he looks up as she runs to him and flings her arms around him. He has a wound to his forehead, and his face is black with soot and grime, while Rambo watches them with a distant expression. Sarah and Michael embrace for a few moments, a brief respite amid chaos, then he gently pushes her arms away and strokes her hair before returning to the wounded man, prioritizing his care. School Boy kneels over Lewis, a fellow mercenary who has shared many battles, and Reese over En-Joo's corpse, a stark reminder of the day's cost. Sarah looks up the hill at Rambo, her face grimy with a light cut across her forehead, a small testament to her involvement in the struggle. She looks at School Boy, who stares down at Lewis as he stirs a little, a sign of life amid the carnage. She looks at the corpse of one of the volunteers, who has bullet wounds in his chest, symbolizing the sacrifice made by many. Michael looks up the hill and sees Rambo, raising a hand to him wide-eyed and frowning, acknowledging the man who led them through battle. Sarah’s face crumples and she starts to weep as Rambo turns away, clutching his shoulder, the weight of the conflict evident in his eyes. John Rambo walks along a lonely road halfway up a hill in Arizona, U.S.A., a landscape he calls home, which is decorated with scrubby green grass and utility poles stretching along the length of the road. His hair is neatly brushed and face clean, an effort to leave behind the turmoil of his past, wearing a pair of dark boots, blue denims, and a khaki parka over a black T-shirt, with a khaki kit bag slung over one shoulder, where he carries the few possessions he holds dear."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "A truck of army reinforcements arrives and Rambo gets back on the machinegun platform as the reinforcements are cut to ribbons in the truck. Rambo fires on the boat and bullets smash through its windscreen killing the captain and helmsman. A bullet from School Boy decapitates the machinegunner. On the shore BN fires a loaded bazooka and the boat is obliterated. Rambo spots the commander escaping up the hill leaps down from the machinegun platform and gives chase. The commander stops impaled on Rambo's machete and faces Rambo blowing out his cheeks and looking up at him. Rambo rips the commander's stomach open and the commander drops to the ground. Rambo kicks the man's corpse away with a hefty boot and it rolls away and lies face down. Rambo looks wearily down at the field of battle and from her vantage point with School Boy. Sarah does the same. A couple of straggling troopers scuttle away and Sarah makes her way down the hill with School Boy picking up his hefty weapon and following her. Rambo also trudges back to the jeep. At the bottom of the hill rebels buzz about as smoke billows and some of the foliage is burnt. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Sarah looks about her and Rambo lingers at the truck watching her. He then frowns and feels his left shoulder with his right hand checking his wound and the back of his hand is bloody. Sarah finds Michael crouching over a wounded man and he looks up as she runs to him and flings her arms around him. He has a wound to his forehead and his face is black with soot and grime while Rambo watches them. Sarah and Michael embrace for a few moments then he gently pushes her arms away and strokes her hair before returning to the wounded man. School Boy kneels over Lewis and Reese over EnJoo's corpse. Sarah looks up the hill at Rambo her face grimy with a light cut across her forehead. She looks at School Boy who stares down at Lewis as he stirs a little. She looks at the corpse of one of the volunteers who has bullet wounds in his chest. Michael looks up the hill and sees Rambo raising a hand to him wideeyed and frowning. Sarah's face crumples and she starts to weep as Rambo turns away clutching his shoulder. John Rambo walks along a lonely road halfway up a hill in Arizona USA which is decorated with scrubby green grass and utility poles stretching along the length of the road. His hair is neatly brushed and face clean wearing a pair of dark boots blue denims and a khaki parka over a black Tshirt with a khaki kit bag slung over one shoulder."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "A truck of army reinforcements arrives and Rambo gets back on the machinegun platform as the reinforcements are cut to ribbons in the truck. Rambo fires on the boat and bullets smash through its windscreen killing the captain and helmsman. A bullet from School Boy decapitates the machinegunner. On the shore BN fires a loaded bazooka and the boat is obliterated. Rambo spots the commander escaping up the hill leaps down from the machinegun platform and gives chase. The commander stops impaled on Rambo's machete and faces Rambo blowing out his cheeks and looking up at him. Rambo rips the commander's stomach open and the commander drops to the ground. Rambo kicks the man's corpse away with a hefty boot and it rolls away and lies face down. Rambo looks wearily down at the field of battle and from her vantage point with School Boy. Sarah does the same. A couple of straggling troopers scuttle away and Sarah makes her way down the hill with School Boy picking up his hefty weapon and following her. Rambo also trudges back to the jeep. At the bottom of the hill rebels buzz about as smoke billows and some of the foliage is burnt. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Sarah looks about her and Rambo lingers at the truck watching her. He then frowns and feels his left shoulder with his right hand checking his wound and the back of his hand is bloody. Sarah finds Michael crouching over a wounded man and he looks up as she runs to him and flings her arms around him. He has a wound to his forehead and his face is black with soot and grime while Rambo watches them. Sarah and Michael embrace for a few moments then he gently pushes her arms away and strokes her hair before returning to the wounded man. School Boy kneels over Lewis and Reese over EnJoo's corpse. Sarah looks up the hill at Rambo her face grimy with a light cut across her forehead. She looks at School Boy who stares down at Lewis as he stirs a little. She looks at the corpse of one of the volunteers who has bullet wounds in his chest. Michael looks up the hill and sees Rambo raising a hand to him wideeyed and frowning. Sarah's face crumples and she starts to weep as Rambo turns away clutching his shoulder. John Rambo walks along a lonely road halfway up a hill in Arizona USA which is decorated with scrubby green grass and utility poles stretching along the length of the road. His hair is neatly brushed and face clean wearing a pair of dark boots blue denims and a khaki parka over a black Tshirt with a khaki kit bag slung over one shoulder."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "A truck of army reinforcements arrives and Rambo gets back on the machinegun platform as the reinforcements are cut to ribbons in the truck. Rambo fires on the boat and bullets smash through its windscreen killing the captain and helmsman. A bullet from School Boy decapitates the machinegunner. On the shore BN fires a loaded bazooka and the boat is obliterated. Rambo spots the commander escaping up the hill leaps down from the machinegun platform and gives chase. The commander stops impaled on Rambo's machete and faces Rambo blowing out his cheeks and looking up at him. Rambo rips the commander's stomach open and the commander drops to the ground. She looks at School Boy who stares down at Lewis as he stirs a little. She looks at the corpse of one of the volunteers who has bullet wounds in his chest. Michael looks up the hill and sees Rambo raising a hand to him wideeyed and frowning. Sarah's face crumples and she starts to weep as Rambo turns away clutching his shoulder. John Rambo walks along a lonely road halfway up a hill in Arizona USA which is decorated with scrubby green grass and utility poles stretching along the length of the road. His hair is neatly brushed and face clean wearing a pair of dark boots blue denims and a khaki parka over a black Tshirt with a khaki kit bag slung over one shoulder."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "A truck of army reinforcements arrives and Rambo gets back on the machinegun platform as the reinforcements are cut to ribbons in the truck. Rambo fires on the boat and bullets smash through its windscreen killing the captain and helmsman. A bullet from School Boy decapitates the machinegunner. Sarah's face crumples and she starts to weep as Rambo turns away clutching his shoulder. John Rambo walks along a lonely road halfway up a hill in Arizona USA which is decorated with scrubby green grass and utility poles stretching along the length of the road. His hair is neatly brushed and face clean wearing a pair of dark boots blue denims and a khaki parka over a black Tshirt with a khaki kit bag slung over one shoulder."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "A herd of circus elephants arrives, and Martin climbs back onto the peanut cart as the elephants are painted with stripes in the cart. Martin juggles at the seaplane, and oranges tumble through its propeller, startling the pilot and co-pilot. A coconut from Forest Boy dislodges the ventriloquist. On the pier, DW launches a giant slingshot, and the seaplane is pulverized. Martin notices the juggler somersaulting down the staircase, springs off the peanut cart, and cartwheels after. The juggler halts, skewered by Martin's umbrella, and glances at Martin, puffing up his cheeks and staring at him. Martin tears the juggler's jacket open, and the juggler collapses to the ground. Martin nudges the jacket with a sturdy sandal, and it tumbles away and rests face down. Martin gazes tiredly across the field of competition, and from her lookout with Forest Boy, Alice does likewise. A pair of wandering acrobats skitter away, and Alice descends the staircase, with Forest Boy hoisting his large tool and trailing her. Martin also marches back to the bicycle. At the base of the staircase, dancers flit about as confetti swirls and some of the signs are torn. Alice peers around her, and Martin hovers at the cart, observing her. He then grimaces and touches his right elbow with his left foot, inspecting his bruise, and the palm of his foot is muddy. Alice discovers Samuel crouching over a sprained accordion, and he glances up as she dashes to him and flings her legs around him. He has a scrape on his knee, and his shirt is gray with soot and dust, while Martin watches them. Alice and Samuel hug for several moments, then he softly separates her legs and pats her shoulder before returning to the sprained accordion. Forest Boy crouches over Marcus, and Elaine over Charlie's costume. Alice peers up the staircase at Martin, her shirt dusty with a faint scratch across her cheek. She glances at Forest Boy, who gazes down at Marcus as he shifts slightly. She gazes at the costume of one of the clowns, who has paint drips on his collar. Samuel glances up the staircase and sees Martin, waving a foot at him wide-eyed and scowling. Alice's shirt crumples, and she begins to giggle as Martin spins around, clutching his elbow. John Martin strolls along a deserted runway halfway up a hill in Nevada, U.S.A., which is decorated with spiky purple flowers and power lines stretching along the length of the runway. His hat is neatly folded and shirt clean, wearing a pair of shiny loafers, red trousers, and a sea-green scarf over a white tank top, with a sea-green backpack slung over one foot."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "An army truck arrives with reinforcements, but they are quickly eliminated, prompting Rambo to fire on an enemy boat, killing its crew. On shore, BN destroys the boat with a bazooka. Rambo pursues and kills the escaping commander with his machete. As Rambo surveys the battlefield, Sarah and School Boy also observe the aftermath. Sarah descends the hill, followed by School Boy, while Rambo checks his bloody shoulder wound. Sarah finds Michael tending to a wounded man, embracing him briefly before he resumes his care. School Boy tends to Lewis, while Reese is over En-Joo's body. Sarah, with a cut on her forehead, mourns the fallen. Michael acknowledges Rambo, who turns away, clutching his shoulder. Later, John Rambo is seen walking along a solitary road in Arizona, dressed neatly, with a kit bag over his shoulder."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "His hair is neatly brushed and face clean wearing a pair of dark boots blue denims and a khaki parka over a black Tshirt with a khaki kit bag slung over one shoulder John Rambo walks along a lonely road halfway up a hill in Arizona USA which is decorated with scrubby green grass and utility poles stretching along the length of the road Sarah's face crumples and she starts to weep as Rambo turns away clutching his shoulder Michael looks up the hill and sees Rambo raising a hand to him wideeyed and frowning She looks at the corpse of one of the volunteers who has bullet wounds in his chest She looks at School Boy who stares down at Lewis as he stirs a little Sarah looks up the hill at Rambo her face grimy with a light cut across her forehead School Boy kneels over Lewis and Reese over EnJoo's corpse Sarah and Michael embrace for a few moments then he gently pushes her arms away and strokes her hair before returning to the wounded man He has a wound to his forehead and his face is black with soot and grime while Rambo watches them Sarah finds Michael crouching over a wounded man and he looks up as she runs to him and flings her arms around him He then frowns and feels his left shoulder with his right hand checking his wound and the back of his hand is bloody Sarah looks about her and Rambo lingers at the truck watching her At the bottom of the hill rebels buzz about as smoke billows and some of the foliage is burnt Rambo also trudges back to the jeep A couple of straggling troopers scuttle away and Sarah makes her way down the hill with School Boy picking up his hefty weapon and following her Sarah does the same Rambo looks wearily down at the field of battle and from her vantage point with School Boy Rambo kicks the man's corpse away with a hefty boot and it rolls away and lies face down Rambo rips the commander's stomach open and the commander drops to the ground The commander stops impaled on Rambo's machete and faces Rambo blowing out his cheeks and looking up at him Rambo spots the commander escaping up the hill leaps down from the machinegun platform and gives chase On the shore BN fires a loaded bazooka and the boat is obliterated A bullet from School Boy decapitates the machinegunner Rambo fires on the boat and bullets smash through its windscreen killing the captain and helmsman A truck of army reinforcements arrives and Rambo gets back on the machinegun platform as the reinforcements are cut to ribbons in the truck"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Rambo fires on the boat and bullets smash through its windscreen killing the captain and helmsman A truck of army reinforcements arrives and Rambo gets back on the machinegun platform as the reinforcements are cut to ribbons in the truck On the shore BN fires a loaded bazooka and the boat is obliterated A bullet from School Boy decapitates the machinegunner The commander stops impaled on Rambo's machete and faces Rambo blowing out his cheeks and looking up at him Rambo spots the commander escaping up the hill leaps down from the machinegun platform and gives chase Rambo kicks the man's corpse away with a hefty boot and it rolls away and lies face down Rambo rips the commander's stomach open and the commander drops to the ground Sarah does the same Rambo looks wearily down at the field of battle and from her vantage point with School Boy Rambo also trudges back to the jeep A couple of straggling troopers scuttle away and Sarah makes her way down the hill with School Boy picking up his hefty weapon and following her Sarah looks about her and Rambo lingers at the truck watching her At the bottom of the hill rebels buzz about as smoke billows and some of the foliage is burnt Sarah finds Michael crouching over a wounded man and he looks up as she runs to him and flings her arms around him He then frowns and feels his left shoulder with his right hand checking his wound and the back of his hand is bloody Sarah and Michael embrace for a few moments then he gently pushes her arms away and strokes her hair before returning to the wounded man He has a wound to his forehead and his face is black with soot and grime while Rambo watches them Sarah looks up the hill at Rambo her face grimy with a light cut across her forehead School Boy kneels over Lewis and Reese over EnJoo's corpse She looks at the corpse of one of the volunteers who has bullet wounds in his chest She looks at School Boy who stares down at Lewis as he stirs a little Sarah's face crumples and she starts to weep as Rambo turns away clutching his shoulder Michael looks up the hill and sees Rambo raising a hand to him wideeyed and frowning His hair is neatly brushed and face clean wearing a pair of dark boots blue denims and a khaki parka over a black Tshirt with a khaki kit bag slung over one shoulder John Rambo walks along a lonely road halfway up a hill in Arizona YOUSA which is decorated with scrubby green grass and utility poles stretching along the length of the road"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Sarah looks about her and Rambo lingers at the truck watching her He then frowns and feels his left shoulder with his right hand checking his wound and the back of his hand is bloody Sarah finds Michael crouching over a wounded man and he looks up as she runs to him and flings her arms around him He has a wound to his forehead and his face is black with soot and grime while Rambo watches them Sarah and Michael embrace for a few moments then he gently pushes her arms away and strokes her hair before returning to the wounded man School Boy kneels over Lewis and Reese over EnJoo's corpse Sarah looks up the hill at Rambo her face grimy with a light cut across her forehead She looks at School Boy who stares down at Lewis as he stirs a little She looks at the corpse of one of the volunteers who has bullet wounds in his chest Michael looks up the hill and sees Rambo raising a hand to him wideeyed and frowning Sarah's face crumples and she starts to weep as Rambo turns away clutching his shoulder John Rambo walks along a lonely road halfway up a hill in Arizona USA which is decorated with scrubby green grass and utility poles stretching along the length of the road His hair is neatly brushed and face clean wearing a pair of dark boots blue denims and a khaki parka over a black Tshirt with a khaki kit bag slung over one shoulder A truck of army reinforcements arrives and Rambo gets back on the machinegun platform as the reinforcements are cut to ribbons in the truck Rambo fires on the boat and bullets smash through its windscreen killing the captain and helmsman A bullet from School Boy decapitates the machinegunner On the shore BN fires a loaded bazooka and the boat is obliterated Rambo spots the commander escaping up the hill leaps down from the machinegun platform and gives chase The commander stops impaled on Rambo's machete and faces Rambo blowing out his cheeks and looking up at him Rambo rips the commander's stomach open and the commander drops to the ground Rambo kicks the man's corpse away with a hefty boot and it rolls away and lies face down Rambo looks wearily down at the field of battle and from her vantage point with School Boy Sarah does the same A couple of straggling troopers scuttle away and Sarah makes her way down the hill with School Boy picking up his hefty weapon and following her Rambo also trudges back to the jeep At the bottom of the hill rebels buzz about as smoke billows and some of the foliage is burnt"
        }
      ]
    }
  ]
}