{
  "ground_truth": "There is light on the riverbank as Michael's party stirs and lights hang from the soffit of a dock house on the distant riverside. Michael, Sarah, and the party crouch low in the boat as it nears the building, where a group of pirates sit on a veranda overlooking the river. The volunteers wear worried frowns, but the boat's passage past the pirates appears to go unnoticed in the dark. Michael glances worriedly at Rambo, whose gaze does not waver from the pirates as the boat leaves the pirate dock behind. The volunteers move up the boat en masse towards Rambo, and Michael steps up to him. Suddenly, a floodlight is cast from a motorboat and a warning shot is fired as the boat bears down on them, with the pirates armed with a machine gun on a tripod. Sarah pulls on a white floppy hat as Rambo stands with his arms raised in surrender. The pirate motorboat pulls alongside them, and pirates in vests and bandannas cast ropes with grappling hooks over to Rambo's boat. The hooks catch and lock, as a floodlight plays on Rambo's face and a pirate brandishes a pistol. Rambo throws a switch and turns the lights on, then turns a gun on Sarah. The pirate leader turns his gun back on Rambo, who sees a pistol tucked into a second pirate's waistband. Rambo pulls a gun from his pocket and shoots them, the pirates dropping to the deck of their boat in slow motion. One of them is only wounded and reaches for his gun, but Rambo stands on his hand, aims at him, shoots him in the head, and turfs the corpse overboard. He grabs Michael by the throat, then releases him and throws a grappling hook over the side. He and Sarah grab the tiller as she stares at him desperately, placing her slim hand on his beefy forearm, her eyes wide and brimming with tears. Michael looks away disgustedly as she rejoins the group, who appear very subdued. She sits next to Michael, who holds her in his arms, as Rambo fires up the boat's motor with a sullen glare and adjusts the tiller. The boat plows through the river water, with the floodlights of the now derelict pirate boat touching their departing stand as it motors into the inky blackness. A bright sunny day follows as the boat is steered towards a riverbank with a simple harbor beneath a large, spreading tree overhanging the water. The volunteers stand up in the boat, collect their belongings, and begin to disembark while local peasants act as porters nearby. Rambo watches the volunteers leave, the last of them being Michael and Sarah. Michael rounds on Rambo, then gets off the boat and walks away up a wooden gangplank.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "There exists illumination on the riverside as Michael's gathering stirs and lights hang from the eaves of a pier house on the far bank. Michael, Sarah, and the group crouch low in the vessel as it approaches the structure, where a band of buccaneers sit on a terrace overlooking the river. The aides wear anxious expressions, but the craft's passage past the buccaneers seems to go unnoticed in the dark. Michael glances anxiously at Rambo, whose stare does not falter from the buccaneers as the vessel leaves the pirate pier behind. The aides move up the vessel en masse towards Rambo, and Michael steps up to him. Suddenly, a searchlight is cast from a speedboat and a warning shot is fired as the vessel bears down on them, with the buccaneers armed with a machine gun on a tripod. Sarah pulls on a white floppy hat as Rambo stands with his arms raised in surrender. The pirate speedboat pulls alongside them, and buccaneers in vests and bandanas cast ropes with grappling hooks over to Rambo's vessel. The hooks catch and lock, as a searchlight plays on Rambo's face and a buccaneer brandishes a pistol. Rambo throws a switch and turns the lights on, then turns a gun on Sarah. The pirate leader turns his gun back on Rambo, who sees a pistol tucked into a second buccaneer's waistband. Rambo pulls a gun from his pocket and shoots them, the buccaneers dropping to the deck of their vessel in slow motion. One of them is only wounded and reaches for his gun, but Rambo stands on his hand, aims at him, shoots him in the head, and turfs the body overboard. He grabs Michael by the throat, then releases him and throws a grappling hook over the side. He and Sarah grab the tiller as she stares at him desperately, placing her slim hand on his muscular forearm, her eyes wide and brimming with tears. Michael looks away disgustedly as she rejoins the group, who appear very subdued. She sits next to Michael, who holds her in his arms, as Rambo fires up the vessel's engine with a sullen glare and adjusts the tiller. The vessel plows through the river water, with the searchlights of the now derelict pirate vessel touching their departing stand as it motors into the inky blackness. A bright sunny day follows as the vessel is steered towards a riverbank with a simple port beneath a large, spreading tree overhanging the water. The aides stand up in the vessel, collect their belongings, and begin to disembark while local peasants act as porters nearby. Rambo watches the aides leave, the last of them being Michael and Sarah. Michael rounds on Rambo, then gets off the vessel and walks away up a wooden gangplank."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Light is present on the riverbank as Michael's party is stirred and lights are hung from the soffit of a dock house on the distant riverside. Michael, Sarah, and the party are crouched low in the boat as it nears the building, where a group of pirates is seated on a veranda overlooking the river. Worried frowns are worn by the volunteers, but the boat's passage past the pirates goes unnoticed in the dark. Michael's worried glance is directed at Rambo, whose gaze does not waver from the pirates as the pirate dock is left behind by the boat. The boat is approached en masse by the volunteers towards Rambo, and Michael steps up to him. Suddenly, a floodlight is cast from a motorboat, and a warning shot is fired as the boat bears down on them, with a machine gun on a tripod armed by the pirates. A white floppy hat is pulled on by Sarah as Rambo stands with his arms raised in surrender. The pirate motorboat pulls alongside them, and ropes with grappling hooks are cast over to Rambo's boat by pirates in vests and bandannas. The hooks are caught and locked, as a floodlight is played on Rambo's face, and a pistol is brandished by a pirate. A switch is thrown by Rambo, and the lights are turned on by him, then a gun is turned on Sarah. The pirate leader turns his gun back on Rambo, who sees a pistol tucked into a second pirate's waistband. A gun is pulled from his pocket by Rambo, and he shoots them, the pirates dropping to the deck of their boat in slow motion. One of them is only wounded and reaches for his gun, but his hand is stood on by Rambo, who aims at him, shoots him in the head, and the corpse is turfed overboard. Michael is grabbed by the throat by him, then he is released, and a grappling hook is thrown over the side. The tiller is grabbed by him and Sarah as she stares at him desperately, her slim hand placed on his beefy forearm, her eyes wide and brimming with tears. Disgustedly, Michael looks away as she rejoins the group, who appear very subdued. Next to Michael, she sits, who holds her in his arms, as the boat's motor is fired up by Rambo with a sullen glare, and the tiller is adjusted by him. Through the river water, the boat is plowed, with the floodlights of the now derelict pirate boat touching their departing stand as it is motored into the inky blackness. A bright sunny day follows as the boat steers towards a riverbank with a simple harbor beneath a large, spreading tree overhanging the water. In the boat, the volunteers stand up, belongings are collected, and disembarkation is begun while local peasants act as porters nearby. The volunteers are watched by Rambo as they leave, the last of them being Michael and Sarah. Rambo is rounded on by Michael, who then gets off the boat and walks away up a wooden gangplank."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Light shines on the riverbank where Michael's party stirs, and lights hang from a dock house on the distant shore. Michael, Sarah, and the party crouch in their boat as it approaches a building with pirates sitting on a veranda. The volunteers look worried, but the boat passes unnoticed in the darkness. Michael glances at Rambo, whose gaze remains fixed on the pirates as they leave the dock behind. Volunteers gather around Rambo, and Michael approaches him. Suddenly, a motorboat's floodlight illuminates them, and a warning shot is fired. Pirates with a machine gun approach, and Sarah dons a white floppy hat as Rambo raises his arms in surrender. Pirates cast ropes with grappling hooks onto Rambo's boat, their floodlight on Rambo's face. A pirate leader brandishes a pistol, leading Rambo to activate the lights and aim a gun at Sarah. The pirate leader turns his gun on Rambo, who notices a second pirate's pistol. Rambo draws a gun, shoots the pirates, and drops them onto their boat in slow motion. One wounded pirate reaches for his weapon, but Rambo stands on his hand, shoots him in the head, and tosses the body overboard. Rambo grabs Michael's throat, then releases him, tossing a grappling hook overboard. He and Sarah grab the tiller, and she desperately touches his forearm, eyes brimming with tears. Michael looks away in disgust as she rejoins the subdued group. She sits with Michael, who holds her while Rambo starts the boat's motor with a sullen glare. They leave the derelict pirate boat behind and head into the darkness. The next day is bright as the boat reaches a riverbank with a simple harbor beneath a spreading tree. Volunteers gather their belongings to disembark, aided by local porters. Rambo watches them leave, with Michael and Sarah the last to go. Michael confronts Rambo, then exits the boat and walks up a wooden gangplank."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Light illuminates the riverbank as Michael's party stirs, with lights on a dock house. Michael, Sarah, and the group crouch in the boat near a building where pirates sit on a veranda. The boat passes unnoticed by the pirates in the dark. Michael worriedly watches Rambo focus on the pirates. As the boat leaves the dock, a motorboat with a machine gun bears down on them, firing a warning shot. Sarah dons a white hat, and Rambo raises his arms in surrender. Pirates cast ropes with grappling hooks onto their boat. In the floodlight, a pirate brandishes a pistol. Rambo activates lights, turns a gun on Sarah, and notices a second pirate's pistol. Rambo shoots both pirates, one wounded pirate reaches for his gun, but Rambo shoots him and throws the body overboard. He then grabs Michael's throat before releasing him. As Sarah, in tears, joins the subdued group, Michael looks on, disgusted. Rambo starts the motor, steering the boat away, with derelict pirate floodlights fading in the distance. On a bright sunny day, they reach a simple harbor. Volunteers disembark with local porters assisting. Michael and Sarah are the last to leave, with Michael confronting Rambo before walking away."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "There is a gentle, illuminating light that casts a glow on the riverbank as Michael's party begins to stir. Decorative lights are strung from the soffit of a quaint dock house located on the distant riverside. As the boat approaches closer to the building, Michael, Sarah, and the rest of the party huddle down low within the confines of the boat to avoid detection. On the veranda, which overlooks the flowing river, a group of pirates is seated in what seems like vigilance. The volunteers, their faces etched with worried expressions, wear frowns that betray their unease. However, to their collective relief, the boat's passage past the watchful pirates seems to go unnoticed in the dimness of night. Michael casts a worried glance in the direction of Rambo, whose unwavering gaze remains fixed on the pirates even as the boat successfully leaves the pirate dock behind.\n\nOnce the threat appears diminished, the volunteers begin to move up the boat en masse toward Rambo, and Michael takes a step forward to approach him. Suddenly, the tranquility is shattered as a powerful floodlight is cast from a pursuing motorboat. The situation escalates with the firing of a warning shot as the motorboat bears down on them aggressively, revealing pirates armed with a machine gun mounted on a tripod. In response, Sarah quickly dons a white floppy hat as Rambo stands defiantly with his arms raised in an apparent gesture of surrender. The pirate motorboat maneuvers alongside their vessel, and the pirates, clad in vests and sporting bandannas, throw ropes equipped with grappling hooks over to Rambo's boat. The hooks catch firmly and secure the boats together as a floodlight harshly illuminates Rambo's face, and a pirate menacingly brandishes a pistol. With determination, Rambo throws a switch to illuminate the scene, subsequently turning a gun on Sarah. In reaction, the pirate leader shifts his gun back onto Rambo. Observing his adversary, Rambo notices a pistol tucked into the waistband of a second pirate. Seizing the moment, Rambo swiftly pulls a gun from his pocket, shooting the pirates who dramatically drop to the deck of their boat in what seems like slow motion. One pirate, though injured, reaches desperately for his gun, but Rambo swiftly stands on his hand and, with precise aim, shoots him in the head before unceremoniously turfing the lifeless body overboard.\n\nIn a brief moment of tension, Rambo grabs Michael by the throat, then releases him, and proceeds to throw a grappling hook over the side. He and Sarah then take control of the tiller. As she looks at him with a desperate gaze, her slim hand rests nervously on his muscular forearm, her eyes wide and brimming with tears. Michael, unable to contain his emotions, looks away with a disgusted expression as Sarah rejoins the subdued group. She takes a seat next to Michael, who wraps his arms around her protectively while Rambo, wearing a sullen glare, fires up the boat's motor and adjusts the tiller with purposeful intent. The boat cuts through the river water efficiently, leaving behind the floodlit scene of the now abandoned pirate boat as they motor into the mysterious inky blackness of the night.\n\nAs dawn breaks, the boat is smoothly steered toward a riverbank where a simple harbor awaits beneath the sweeping branches of a large, spreading tree that hangs gracefully over the water. The volunteers, now relieved, stand up on the boat, gathering their belongings, preparing to disembark as local peasants, acting as porters, wait nearby ready to assist. Rambo watches the volunteers depart one by one, the last of them being Michael and Sarah. Just before leaving, Michael turns sharply toward Rambo, but then decisively gets off the boat and walks away, ascending a wooden gangplank with determined steps."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A gentle, illuminating light gently casts a soft, glowing radiance on the tranquil riverbank as the gathering for Michael's party gradually begins to stir with anticipation. Decorative, twinkling lights have been meticulously strung from the soffit of a quaint, charming dock house situated on the distant riverside. As their boat draws closer to this building, both Michael and Sarah, along with the rest of the party, huddle down low within the confines of the boat in an effort to avoid being detected. On the veranda, which provides an expansive view over the flowing river, a group of vigilant pirates sits, appearing alert and watchful. Among the volunteers, their faces etched with expressions of worry, frowns betray their underlying unease. However, to their collective, overwhelming relief, the passage of their boat past the watchful pirates seems to pass unnoticed in the dim, concealing shadows of the night. Michael casts a worried, anxious glance in the direction of Rambo, whose unwavering gaze remains steadily fixed on the pirates, even as the boat successfully leaves the pirate dock far behind.\n\nOnce the looming threat appears to have diminished, the volunteers begin to cautiously move up the boat en masse toward Rambo, and Michael takes a bold step forward to approach him. Suddenly, the previously calm night is shattered as a powerful, blinding floodlight is cast from a pursuing motorboat. The situation swiftly escalates with the dramatic firing of a warning shot as the aggressive motorboat bears down on them forcefully, revealing pirates armed with a menacing machine gun mounted on a sturdy tripod. In response to this perilous development, Sarah quickly dons a white floppy hat while Rambo stands defiantly with his arms raised in an apparent gesture of surrender. The pirate motorboat skillfully maneuvers alongside their vessel, and the pirates, clad in tactical vests and sporting colorful bandannas, throw thick ropes equipped with grappling hooks over to Rambo's boat. The hooks catch firmly, securing the two boats together, as a floodlight harshly illuminates Rambo's face, and a pirate menacingly brandishes a threatening pistol. With firm determination, Rambo throws a switch to illuminate the scene brightly, subsequently turning a gun on Sarah. In reaction, the pirate leader immediately shifts his gun back onto Rambo, keeping him firmly in his sights. Observing his adversary intently, Rambo notices a pistol tucked into the waistband of a second pirate. Seizing this fleeting moment, Rambo swiftly pulls a gun from his pocket, shooting the pirates, who dramatically drop to the deck of their boat, seemingly in slow motion. One pirate, though injured, reaches desperately for his gun, but Rambo quickly stands on his hand and, with precise aim, shoots him in the head before unceremoniously turfing the lifeless body overboard.\n\nIn a brief moment of high tension, Rambo grabs Michael by the throat in a sudden, forceful motion, then releases him and proceeds to throw a grappling hook efficiently over the side. He and Sarah then take control of the tiller together. As she looks at him with a desperate gaze, her slim, delicate hand rests nervously on his muscular forearm, her eyes wide and brimming with tears. Michael, unable to contain his turbulent emotions, looks away with a disgusted expression as Sarah rejoins the subdued group. She takes a seat next to Michael, who wraps his arms protectively around her while Rambo, wearing a sullen, intense glare, fires up the boat's motor and adjusts the tiller with purposeful intent. The boat cuts efficiently through the river water, leaving behind the floodlit scene of the now-abandoned pirate boat as they motor into the mysterious, inky blackness of the night.\n\nAs the dawn breaks, the boat is smoothly steered toward a riverbank where a simple harbor awaits beneath the sweeping branches of a large, spreading tree that hangs gracefully over the water, creating a serene canopy. The volunteers, now feeling relieved, stand up on the boat, gathering their belongings in preparation to disembark as local peasants, acting as porters, wait nearby, ready and eager to assist. Rambo watches the volunteers depart one by one, the last of them being Michael and Sarah. Just before leaving, Michael turns sharply toward Rambo with an intense look, but then decisively gets off the boat and walks away, ascending a wooden gangplank with determined, purposeful steps."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the scene unfolds, a gentle light illuminates the riverbank, where a distant dock house displays lights hanging from its soffit, adding a glow to the surroundings. Michael's party stirs into action as they hunch down low in the boat, Michael and Sarah included, maintaining a cautious posture as the vessel glides closer to the building. There, a group of pirates lounges on a veranda, keeping watch over the river. Despite the volunteers wearing faces marked with worried frowns, their boat slips past the pirates under the cover of darkness, seemingly unnoticed. With a hint of anxiety, Michael casts a concerned glance at Rambo, whose unwavering gaze remains fixed intently on the pirates even as the boat glides beyond the pirate dock. The volunteers tentatively advance together towards Rambo, with Michael moving to his side. Suddenly, a beam of light floods from a pursuing motorboat, cutting through the night, and a warning shot rings out, causing tension to spike. The motorboat hurtles toward them, pirates aboard, wielding a machine gun mounted on a tripod. As the situation escalates, Sarah puts on a white floppy hat while Rambo rises, signaling surrender with arms raised. The pirate motorboat pulls alongside, and pirates clad in vests and bandannas toss ropes outfitted with grappling hooks towards Rambo's boat. The hooks latch firmly, securing the boats together as the harsh floodlight illuminates Rambo's determined face, even as a pirate waves a pistol menacingly. With a decisive action, Rambo flips a switch to ignite the boat's lights, then unexpectedly turns a gun towards Sarah. In swift retaliation, the pirate leader redirects his firearm at Rambo, who notes a pistol tucked casually into the waistband of a second pirate. Without hesitating, Rambo draws a gun from his pocket and fires, sending the pirates tumbling to the deck of their boat in a dramatic slow-motion fall. One pirate remains partially conscious, reaching for his weapon, but Rambo swiftly subdues him by stepping on his hand, aiming with precision, and shooting him in the head before unceremoniously tossing the lifeless body overboard. Rambo's attention then shifts to Michael, whom he momentarily seizes by the throat before releasing him, followed by deftly throwing a grappling hook over the side. With Sarah by his side, Rambo grips the tiller as she looks at him, eyes wide with desperation, her slender hand resting on his muscular forearm, brimming with unspoken pleas. Michael, repulsed, averts his gaze as Sarah silently retreats to the subdued group beside him. She settles next to Michael, who envelops her in his arms, offering a moment of solace amidst the chaos, while Rambo, filled with a sullen determination, powers up the boat's engine and skillfully adjusts the tiller. The boat surges forward through the river, leaving behind the illuminated yet abandoned pirate vessel as they fade into the engulfing darkness of the night. The scene shifts to a bright, sunny day as their boat approaches a modest riverbank harbor shaded by the expansive limbs of a tree arching over the water. As the boat nestles to a stop, the volunteers rise, gathering their belongings in preparation to disembark, aided by local peasants serving as porters nearby. Rambo remains, silently observing the volunteers leaving one by one, with Michael and Sarah the last to depart. Michael pauses only to face Rambo briefly before stepping off the boat and walking away along a wooden gangplank, leaving the journey and its perils behind."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "There is light on the riverbank from Michael's party, and lights hang from a dock house across the river. As their boat nears a building with pirates on a river-view veranda, Michael, Sarah, and others crouch low to remain unnoticed. Despite their worried expressions, the boat passes the pirates without incident. Michael and the crew advance towards Rambo, who remains focused on the pirates. Suddenly, they're illuminated by a floodlight from a pirate motorboat, which fires a warning shot as it approaches with a machine gun. Sarah dons a hat as Rambo raises his arms in surrender. Pirates throw grappling hooks onto Rambo's boat, securing it. In response, Rambo turns on a switch, igniting lights and brandishing a gun at Sarah. The pirates' leader also draws on Rambo, who spots another gun in a pirate's waistband. Rambo quickly draws his own pistol, shooting the pirates, who fall. He finishes off a wounded pirate and disposes of the body, then briefly throttles Michael before releasing him. Rambo and Sarah take control of the tiller, with Sarah pleading silently, tears in her eyes. Disgusted, Michael turns away, and Sarah rejoins the somber group. She sits with Michael, who comforts her, as Rambo restarts the boat and steers them away. They leave the illuminated pirate boat behind and sail into the darkness. The next day, under bright sunshine, they reach a riverbank harbor shaded by a large tree. As the volunteers stand, gather their things, and disembark with local porters assisting, Rambo watches. Michael and Sarah are the last to leave, with Michael confronting Rambo before disembarking and walking away up a gangplank."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "There is light on the riverbank as Michael's party stirs, setting the scene for their covert mission under the glow of string lights hung decoratively from the soffit of a dock house that has stood on the distant riverside for generations. Michael, Sarah, and the party crouch low in the boat as it nears the building, where a group of pirates, notorious for their territorial control over these waters, sit on a veranda overlooking the river, a strategic lookout point. The volunteers wear worried frowns, aware of the perilous legends of these pirates, but the boat's passage past the pirates appears to go unnoticed in the dark, fortunate for their mission's secrecy. Michael glances worriedly at Rambo, whose gaze does not waver from the pirates as the boat leaves the pirate dock behind, knowing Rambo's reputation for remaining calm in the face of danger. The volunteers move up the boat en masse towards Rambo, and Michael steps up to him. Suddenly, a floodlight is cast from a motorboat, a signal often used to initiate pirate confrontations, and a warning shot is fired as the boat bears down on them, with the pirates armed with a machine gun on a tripod, indicating their readiness to defend their territory. Sarah pulls on a white floppy hat, a trademark of her disguise, as Rambo stands with his arms raised in surrender. The pirate motorboat pulls alongside them, and pirates in vests and bandannas cast ropes with grappling hooks, a method perfected over countless raids, over to Rambo's boat. The hooks catch and lock, as a floodlight plays on Rambo's face and a pirate brandishes a pistol, exuding the ruthless reputation they're known for. Rambo throws a switch and turns the lights on, then turns a gun on Sarah, a shocking display of distrust. The pirate leader turns his gun back on Rambo, who sees a pistol tucked into a second pirate's waistband, a common backup for those prepared for betrayal. Rambo pulls a gun from his pocket, a habit from his days as a military operative, and shoots them, the pirates dropping to the deck of their boat in slow motion. One of them is only wounded and reaches for his gun, but Rambo stands on his hand, aiming with seasoned precision, shoots him in the head, and turfs the corpse overboard, a brutal yet calculated move. He grabs Michael by the throat, then releases him and throws a grappling hook over the side, demonstrating his adaptability in crisis. He and Sarah grab the tiller as she stares at him desperately, placing her slim hand on his beefy forearm, her eyes wide and brimming with tears, overwhelmed by the intensity of the confrontation. Michael looks away disgustedly as she rejoins the group, who appear very subdued, the weight of the night's events heavy on their minds. She sits next to Michael, who holds her in his arms, offering comfort amidst the tension, as Rambo fires up the boat's motor with a sullen glare and adjusts the tiller, steering them away from danger. The boat plows through the river water, with the floodlights of the now derelict pirate boat touching their departing stand as it motors into the inky blackness, marking the end of a perilous encounter. A bright sunny day follows as the boat is steered towards a riverbank, known locally for its serene refuge, with a simple harbor beneath a large, spreading tree that has provided shade and shelter for sailors over the years, overhanging the water. The volunteers stand up in the boat, collect their belongings, and begin to disembark while local peasants act as porters nearby, familiar with assisting travelers on these shores. Rambo watches the volunteers leave, the last of them being Michael and Sarah, both eager to find solid ground. Michael rounds on Rambo, then gets off the boat and walks away up a wooden gangplank, a path well-trodden by those seeking escape from the river's treacherous waters."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "There is light on the riverbank as Michael's party stirs and lights hang from the soffit of a dock house on the distant riverside. Michael Sarah and the party crouch low in the boat as it nears the building where a group of pirates sit on a veranda overlooking the river. The volunteers wear worried frowns but the boat's passage past the pirates appears to go unnoticed in the dark. Michael glances worriedly at Rambo whose gaze does not waver from the pirates as the boat leaves the pirate dock behind. The volunteers move up the boat en masse towards Rambo and Michael steps up to him. Suddenly a floodlight is cast from a motorboat and a warning shot is fired as the boat bears down on them with the pirates armed with a machine gun on a tripod. Sarah pulls on a white floppy hat as Rambo stands with his arms raised in surrender. The pirate motorboat pulls alongside them and pirates in vests and bandannas cast ropes with grappling hooks over to Rambo's boat. The hooks catch and lock as a floodlight plays on Rambo's face and a pirate brandishes a pistol. Rambo throws a switch and turns the lights on then turns a gun on Sarah. The pirate leader turns his gun back on Rambo who sees a pistol tucked into a second pirate's waistband. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Rambo pulls a gun from his pocket and shoots them. the pirates dropping to the deck of their boat in slow motion. One of them is only wounded and reaches for his gun but Rambo stands on his hand aims at him shoots him in the head and turfs the corpse overboard. He grabs Michael by the throat then releases him and throws a grappling hook over the side. He and Sarah grab the tiller as she stares at him desperately placing her slim hand on his beefy forearm her eyes wide and brimming with tears. Michael looks away disgustedly as she rejoins the group who appear very subdued. She sits next to Michael who holds her in his arms as Rambo fires up the boat's motor with a sullen glare and adjusts the tiller. The boat plows through the river water with the floodlights of the now derelict pirate boat touching their departing stand as it motors into the inky blackness. A bright sunny day follows as the boat is steered towards a riverbank with a simple harbor beneath a large spreading tree overhanging the water. The volunteers stand up in the boat collect their belongings and begin to disembark while local peasants act as porters nearby. Rambo watches the volunteers leave the last of them being Michael and Sarah. Michael rounds on Rambo then gets off the boat and walks away up a wooden gangplank."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "There is light on the riverbank as Michael's party stirs and lights hang from the soffit of a dock house on the distant riverside. Michael Sarah and the party crouch low in the boat as it nears the building where a group of pirates sit on a veranda overlooking the river. The volunteers wear worried frowns but the boat's passage past the pirates appears to go unnoticed in the dark. Michael glances worriedly at Rambo whose gaze does not waver from the pirates as the boat leaves the pirate dock behind. The volunteers move up the boat en masse towards Rambo and Michael steps up to him. Suddenly a floodlight is cast from a motorboat and a warning shot is fired as the boat bears down on them with the pirates armed with a machine gun on a tripod. Sarah pulls on a white floppy hat as Rambo stands with his arms raised in surrender. The pirate motorboat pulls alongside them and pirates in vests and bandannas cast ropes with grappling hooks over to Rambo's boat. The hooks catch and lock as a floodlight plays on Rambo's face and a pirate brandishes a pistol. Rambo throws a switch and turns the lights on then turns a gun on Sarah. The pirate leader turns his gun back on Rambo who sees a pistol tucked into a second pirate's waistband. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Rambo pulls a gun from his pocket and shoots them. the pirates dropping to the deck of their boat in slow motion. One of them is only wounded and reaches for his gun but Rambo stands on his hand aims at him shoots him in the head and turfs the corpse overboard. He grabs Michael by the throat then releases him and throws a grappling hook over the side. He and Sarah grab the tiller as she stares at him desperately placing her slim hand on his beefy forearm her eyes wide and brimming with tears. Michael looks away disgustedly as she rejoins the group who appear very subdued. She sits next to Michael who holds her in his arms as Rambo fires up the boat's motor with a sullen glare and adjusts the tiller. The boat plows through the river water with the floodlights of the now derelict pirate boat touching their departing stand as it motors into the inky blackness. A bright sunny day follows as the boat is steered towards a riverbank with a simple harbor beneath a large spreading tree overhanging the water. The volunteers stand up in the boat collect their belongings and begin to disembark while local peasants act as porters nearby. Rambo watches the volunteers leave the last of them being Michael and Sarah. Michael rounds on Rambo then gets off the boat and walks away up a wooden gangplank."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "There is light on the riverbank as Michael's party stirs and lights hang from the soffit of a dock house on the distant riverside. Michael Sarah and the party crouch low in the boat as it nears the building where a group of pirates sit on a veranda overlooking the river. The volunteers wear worried frowns but the boat's passage past the pirates appears to go unnoticed in the dark. Michael glances worriedly at Rambo whose gaze does not waver from the pirates as the boat leaves the pirate dock behind. The volunteers move up the boat en masse towards Rambo and Michael steps up to him. Suddenly a floodlight is cast from a motorboat and a warning shot is fired as the boat bears down on them with the pirates armed with a machine gun on a tripod. She sits next to Michael who holds her in his arms as Rambo fires up the boat's motor with a sullen glare and adjusts the tiller. The boat plows through the river water with the floodlights of the now derelict pirate boat touching their departing stand as it motors into the inky blackness. A bright sunny day follows as the boat is steered towards a riverbank with a simple harbor beneath a large spreading tree overhanging the water. The volunteers stand up in the boat collect their belongings and begin to disembark while local peasants act as porters nearby. Rambo watches the volunteers leave the last of them being Michael and Sarah. Michael rounds on Rambo then gets off the boat and walks away up a wooden gangplank."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "There is light on the riverbank as Michael's party stirs and lights hang from the soffit of a dock house on the distant riverside. Michael Sarah and the party crouch low in the boat as it nears the building where a group of pirates sit on a veranda overlooking the river. The volunteers stand up in the boat collect their belongings and begin to disembark while local peasants act as porters nearby. Rambo watches the volunteers leave the last of them being Michael and Sarah. Michael rounds on Rambo then gets off the boat and walks away up a wooden gangplank."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "There is darkness on the meadow as Jennifer's gathering stirs and lanterns dangle from the ceiling of a tree house on the nearby cliffside. Jennifer, Tom, and the gathering leap high on the raft as it approaches the structure, where a band of acrobats recline on a balcony overlooking the meadow. The tourists wear amused grins, but the raft's voyage past the acrobats seems to go unnoticed in the light. Jennifer glances cheerfully at Maverick, whose attention does not drift from the acrobats as the raft leaves the acrobat platform behind. The tourists slide down the raft en masse towards Maverick, and Jennifer kneels next to him. Suddenly, a flashlight is pointed from a bicycle and a firework is launched as the raft zooms towards them, with the acrobats equipped with a slingshot on a tripod. Tom puts on a black wide-brimmed hat as Maverick stands with his ears covered in disbelief. The acrobat bicycle pedals alongside them, and acrobats in overalls and helmets toss nets with magnets over to Maverick's raft. The magnets attach and grip, as a flashlight shines on Maverick's nose and an acrobat waves a hammer. Maverick flips a lever and dim the lights, then points a bow at Tom. The acrobat chief points his bow back at Maverick, who spots a hammer tucked into another acrobat's vest. Maverick draws a bow from his backpack and strikes them, the acrobats tumbling onto the floor of their bicycle in slow motion. One of them is only stunned and reaches for his bow, but Maverick steps on his foot, targets him, strikes him in the ankle, and tosses the mannequin overboard. He grabs Jennifer by the elbow, then releases her and throws a net over the edge. He and Tom grab the rudder as he gawks at her irritatedly, placing her hefty ankle on his slender leg, his ears long and filled with static. Jennifer glances away happily as he rejoins the crowd, who seem very animated. He reclines next to Jennifer, who shakes him in her hands, as Maverick revs up the raft's pedal with an elated smile and maneuvers the rudder. The raft glides across the meadow water, with the flashlights of the now empty acrobat bicycle illuminating their moving stand as it bicycles into the milky whiteness. A dark rainy night follows as the raft is cycled towards a meadow's edge with an ornate lighthouse beneath a small, wilting shrub overhanging the earth. The tourists hop down from the raft, disperse their packages, and start to climb while distant traders pose as dancers nearby. Maverick observes the tourists climb, the first of them being Jennifer and Tom. Jennifer turns on Maverick, then jumps onto the raft and dances away down a glass staircase."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Michael, Sarah, and their party travel by boat past a dock house, where pirates sit, without being noticed. Suddenly, a pirate motorboat with machine guns pursues them. As Rambo surrenders, pirates board their boat, prompting a tense standoff. Rambo quickly kills the pirates, disposing of their bodies. He briefly confronts Michael before preparing the boat for departure. Sarah, tearful, clings to Rambo, while Michael disdainfully turns away. The group continues down the river, leaving the now abandoned pirate boat behind. The next day, they arrive at a riverbank harbor. As the volunteers disembark, Rambo watches them leave, with Michael throwing one last glare before departing."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Michael rounds on Rambo then gets off the boat and walks away up a wooden gangplank Rambo watches the volunteers leave the last of them being Michael and Sarah The volunteers stand up in the boat collect their belongings and begin to disembark while local peasants act as porters nearby A bright sunny day follows as the boat is steered towards a riverbank with a simple harbor beneath a large spreading tree overhanging the water The boat plows through the river water with the floodlights of the now derelict pirate boat touching their departing stand as it motors into the inky blackness She sits next to Michael who holds her in his arms as Rambo fires up the boat's motor with a sullen glare and adjusts the tiller Michael looks away disgustedly as she rejoins the group who appear very subdued He and Sarah grab the tiller as she stares at him desperately placing her slim hand on his beefy forearm her eyes wide and brimming with tears He grabs Michael by the throat then releases him and throws a grappling hook over the side One of them is only wounded and reaches for his gun but Rambo stands on his hand aims at him shoots him in the head and turfs the corpse overboard the pirates dropping to the deck of their boat in slow motion Rambo pulls a gun from his pocket and shoots them The pirate leader turns his gun back on Rambo who sees a pistol tucked into a second pirate's waistband Rambo throws a switch and turns the lights on then turns a gun on Sarah The hooks catch and lock as a floodlight plays on Rambo's face and a pirate brandishes a pistol The pirate motorboat pulls alongside them and pirates in vests and bandannas cast ropes with grappling hooks over to Rambo's boat Sarah pulls on a white floppy hat as Rambo stands with his arms raised in surrender Suddenly a floodlight is cast from a motorboat and a warning shot is fired as the boat bears down on them with the pirates armed with a machine gun on a tripod The volunteers move up the boat en masse towards Rambo and Michael steps up to him Michael glances worriedly at Rambo whose gaze does not waver from the pirates as the boat leaves the pirate dock behind The volunteers wear worried frowns but the boat's passage past the pirates appears to go unnoticed in the dark Michael Sarah and the party crouch low in the boat as it nears the building where a group of pirates sit on a veranda overlooking the river There is light on the riverbank as Michael's party stirs and lights hang from the soffit of a dock house on the distant riverside"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Michael Sarah and the party crouch low in the boat as it nears the building where a group of pirates sit on a veranda overlooking the river There is light on the riverbank as Michael's party stirs and lights hang from the soffit of a dock house on the distant riverside Michael glances worriedly at Rambo whose gaze does not waver from the pirates as the boat leaves the pirate dock behind The volunteers wear worried frowns but the boat's passage past the pirates appears to go unnoticed in the dark Suddenly a floodlight is cast from a motorboat and a warning shot is fired as the boat bears down on them with the pirates armed with a machine gun on a tripod The volunteers move up the boat en masse towards Rambo and Michael steps up to him The pirate motorboat pulls alongside them and pirates in vests and bandannas cast ropes with grappling hooks over to Rambo's boat Sarah pulls on a white floppy hat as Rambo stands with his arms raised in surrender Rambo throws a switch and turns the lights on then turns a gun on Sarah The hooks catch and lock as a floodlight plays on Rambo's face and a pirate brandishes a pistol Rambo pulls a gun from his pocket and shoots them The pirate leader turns his gun back on Rambo who sees a pistol tucked into a second pirate's waistband One of them is only wounded and reaches for his gun but Rambo stands on his hand aims at him shoots him in the head and turfs the corpse overboard the pirates dropping to the deck of their boat in slow motion He and Sarah grab the tiller as she stares at him desperately placing her slim hand on his beefy forearm her eyes wide and brimming with tears He grabs Michael by the throat then releases him and throws a grappling hook over the side She sits next to Michael who holds her in his arms as Rambo fires up the boat's motor with a sullen glare and adjusts the tiller Michael looks away disgustedly as she rejoins the group who appear very subdued A bright sunny day follows as the boat is steered towards a riverbank with a simple harbor beneath a large spreading tree overhanging the water The boat plows through the river water with the floodlights of the now derelict pirate boat touching their departing stand as it motors into the inky blackness Rambo watches the volunteers leave the last of them being Michael and Sarah The volunteers stand up in the boat collect their belongings and begin to disembark while local peasants act as porters nearby Michael rounds on Rambo then gets off the boat and walks away up a wooden gangplank"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "the pirates dropping to the deck of their boat in slow motion One of them is only wounded and reaches for his gun but Rambo stands on his hand aims at him shoots him in the head and turfs the corpse overboard He grabs Michael by the throat then releases him and throws a grappling hook over the side He and Sarah grab the tiller as she stares at him desperately placing her slim hand on his beefy forearm her eyes wide and brimming with tears Michael looks away disgustedly as she rejoins the group who appear very subdued She sits next to Michael who holds her in his arms as Rambo fires up the boat's motor with a sullen glare and adjusts the tiller The boat plows through the river water with the floodlights of the now derelict pirate boat touching their departing stand as it motors into the inky blackness A bright sunny day follows as the boat is steered towards a riverbank with a simple harbor beneath a large spreading tree overhanging the water The volunteers stand up in the boat collect their belongings and begin to disembark while local peasants act as porters nearby Rambo watches the volunteers leave the last of them being Michael and Sarah Michael rounds on Rambo then gets off the boat and walks away up a wooden gangplank There is light on the riverbank as Michael's party stirs and lights hang from the soffit of a dock house on the distant riverside Michael Sarah and the party crouch low in the boat as it nears the building where a group of pirates sit on a veranda overlooking the river The volunteers wear worried frowns but the boat's passage past the pirates appears to go unnoticed in the dark Michael glances worriedly at Rambo whose gaze does not waver from the pirates as the boat leaves the pirate dock behind The volunteers move up the boat en masse towards Rambo and Michael steps up to him Suddenly a floodlight is cast from a motorboat and a warning shot is fired as the boat bears down on them with the pirates armed with a machine gun on a tripod Sarah pulls on a white floppy hat as Rambo stands with his arms raised in surrender The pirate motorboat pulls alongside them and pirates in vests and bandannas cast ropes with grappling hooks over to Rambo's boat The hooks catch and lock as a floodlight plays on Rambo's face and a pirate brandishes a pistol Rambo throws a switch and turns the lights on then turns a gun on Sarah The pirate leader turns his gun back on Rambo who sees a pistol tucked into a second pirate's waistband Rambo pulls a gun from his pocket and shoots them"
        }
      ]
    }
  ]
}