{
  "ground_truth": "Volunteer James gives a sermon under a canopy with the aid of a translator while a man with a camcorder records the event. Another volunteer provides medical care as Sarah passes by and walks up wooden steps into a hut where young people sit in a waiting area, some with missing limbs. Inside, Sarah finds Michael with another patient lying on the floor and hands Michael a roll of bandage to bind a stump where the shin should be; the patient writhes in pain, and Michael gives him a comforting pat. Sarah looks down at them, then at the waiting patients where a very small boy has only one leg. Suddenly, the village is attacked with rocket fire as a rocket is primed, and Sarah hands a child to its mother. The rockets, fired by the army, blow a man to pieces as Michael roams with a child in his arms. Rockets hit the paddy field destroying a wooden hut, and Sarah cowers under a hut while the army enters the village with weapons blazing. A volunteer carrying a child in each arm is cut down, and the children are dragged from him, with one shot and the other bayoneted in the stomach while his face is held down by an army boot. A woman is shot, another abused, and a third dragged away by her hair. In slow motion, a volunteer in a baseball cap tries to outrun the rocket fire, but is hit, severing his legs below the knee. A man kneels before a pair of soldiers with weapons as soldiers hack off villagers' limbs. A soldier with a flamethrower sends a plume of flame into a building, causing villagers with clothing on fire to run from it and roll in the dust, while a small child is torn from its mother and tossed into the burning building. Sarah runs as Michael is rifle-butted and the villagers run across the paddy field. The truck with a machine gun on a tripod arrives, massacring the villagers in mid-flight. Sarah is accompanied by a mother and a child who run with her, but the mother is shot in the back and drops to the ground. From the truck, the cool commander watches the carnage while his subordinate blazes away. Partially caught by a blast, Sarah tumbles into the water of the field as the commander pulls on his cigarette. More villagers run towards the truck as their bodies are torn apart by bullets and gunfire picks off survivors. Sarah looks up just as two soldiers grab her by the arms; she tries to fight them off, but they haul her to her feet and drag her away by the scruff of her neck. In the truck, the soldier in charge of the machine gun pivots to and fro in search of victims.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sure, here's the transformed text with exact synonyms:\n\nVolunteer James delivers a homily beneath a canopy with the help of a interpreter while a man with a camcorder records the occurrence. Another volunteer supplies medical treatment as Sarah passes by and ascends wooden steps into a hut where young individuals sit in a waiting area, some with absent limbs. Inside, Sarah discovers Michael with another patient reclining on the floor and hands Michael a roll of dressing to wrap a stump where the shin ought to be; the patient twists in agony, and Michael gives him a soothing pat. Sarah looks down at them, then at the waiting patients where a very small boy has only one leg. Suddenly, the village is assaulted with missile fire as a rocket is primed, and Sarah hands a child to its mother. The projectiles, fired by the army, blow a man to pieces as Michael roams with a child in his arms. Missiles strike the paddy field demolishing a wooden hut, and Sarah crouches under a hut while the army enters the village with weapons blazing. A volunteer carrying a child in each arm is cut down, and the children are dragged from him, with one shot and the other bayoneted in the abdomen while his face is held down by an army boot. A woman is shot, another mistreated, and a third dragged away by her hair. In slow motion, a volunteer in a baseball cap attempts to outrun the missile fire, but is hit, severing his legs below the knee. A man kneels before a pair of soldiers with weapons as soldiers hack off villagers' limbs. A soldier with a flamethrower sends a plume of flame into a structure, causing villagers with garments on fire to run from it and roll in the dust, while a small child is torn from its mother and tossed into the burning edifice. Sarah runs as Michael is rifle-butted and the villagers run across the paddy field. The truck with a machine gun on a tripod arrives, massacring the villagers in mid-flight. Sarah is accompanied by a mother and a child who run with her, but the mother is shot in the back and drops to the ground. From the truck, the cool commander observes the slaughter while his subordinate blazes away. Partially caught by a blast, Sarah tumbles into the water of the field as the commander pulls on his cigarette. More villagers run towards the truck as their bodies are torn apart by bullets and gunfire picks off survivors. Sarah looks up just as two soldiers grab her by the arms; she tries to fight them off, but they haul her to her feet and drag her away by the scruff of her neck. In the truck, the soldier in charge of the machine gun pivots to and fro in search of casualties."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A sermon is given by Volunteer James under a canopy with the aid of a translator while the event is recorded by a man with a camcorder. Medical care is provided by another volunteer as Sarah passes by and walks up wooden steps into a hut where young people sit in a waiting area, some with missing limbs. Inside, Michael is found by Sarah with another patient lying on the floor, and a roll of bandage is handed by her to Michael to bind a stump where the shin should be; the patient writhes in pain, and he is given a comforting pat by Michael. Sarah looks down at them, then at the waiting patients where a very small boy has only one leg. Suddenly, rocket fire attacks the village as a rocket is primed, and a child is handed by Sarah to its mother. The army fires the rockets, blowing a man to pieces as Michael roams with a child in his arms. The paddy field is hit by rockets, destroying a wooden hut, and Sarah cowers under a hut while the village is entered by the army with weapons blazing. A volunteer carrying a child in each arm is shot down, and children are dragged from him, with one shot and the other bayoneted in the stomach while his face is held down by an army boot. A woman is shot, another abused, and a third drags away by her hair. In slow motion, the rocket fire is outrun by a volunteer in a baseball cap, but he is hit, severing his legs below the knee. A man kneels before a pair of soldiers with weapons as limbs of villagers are hacked off by soldiers. A soldier with a flamethrower sends a plume of flame into a building, causing villagers with clothing on fire to run from it and roll in the dust, while a small child is torn from its mother and tossed into the burning building. Michael is rifle-butted as Sarah runs and the villagers run across the paddy field. The truck with a machine gun on a tripod arrives, massacring the villagers in mid-flight. Sarah is accompanied by a mother and a child who run with her, but the mother is shot in the back and drops to the ground. The carnage is watched by the cool commander from the truck while his subordinate blazes away. Sarah is partially caught by a blast and tumbles into the water of the field as a cigarette is pulled on by the commander. The truck is approached by more villagers as bullets tear their bodies apart and survivors are picked off by gunfire. Sarah looks up just as two soldiers grab her by the arms; she is fought off by her, but her feet are hauled to and she is dragged away by the scruff of her neck. The soldier in charge of the machine gun pivots to and fro in search of victims in the truck."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Volunteer James delivers a sermon under a canopy with a translator while a man records the event. Another volunteer provides medical care as Sarah passes by and enters a hut where young people sit, some missing limbs. Inside, Sarah finds Michael with a patient on the floor and hands him a bandage to bind a stump, as the patient writhes in pain. Sarah observes the scene, noting a small boy with one leg. Suddenly, rockets attack the village, and Sarah hands a child to its mother. Rockets, fired by the army, tear through, hitting the paddy field and destroying a hut. Sarah cowers as the army enters with weapons blazing. A volunteer carrying children is killed; one child is shot, the other bayoneted. A woman is shot, another abused, and a third dragged by her hair. In slow motion, a volunteer tries to escape but is hit, losing his legs. Soldiers hack villagers' limbs as flamethrowers ignite buildings. Villagers flee with clothes aflame, while a child is tossed into a burning building. Sarah runs as Michael is rifle-butted. A truck with a machine gun massacres fleeing villagers. Sarah runs with a mother and child, but the mother is shot. The cool commander observes the carnage as his subordinate continues firing. Sarah falls into the field's water as the commander smokes. Villagers run toward the truck but are torn apart. Sarah is seized by soldiers, tries to resist, but is dragged away. A soldier in charge of the machine gun searches for more victims."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Volunteer James delivers a sermon with a translator while a man films. Another volunteer provides medical care as Sarah enters a hut with young people, some missing limbs. Inside, she hands bandages to Michael for a patient in pain. Sarah notices a small boy with one leg. Suddenly, the village is attacked by rockets; Sarah gives a child to its mother. Army rockets kill a man as Michael carries a child. Rockets destroy a hut, and Sarah hides while the army attacks. A volunteer with children is killed; one child is shot, another bayoneted. A woman is shot, another abused, and a third dragged by her hair. A volunteer in a cap attempts to flee but loses his legs to rocket fire. Soldiers mutilate villagers as a flamethrower ignites a building. People run aflame while a child is thrown into the fire. Sarah flees, Michael is hit, and villagers run. A machine-gun truck massacres runners. Sarah, with a mother and child, sees the mother shot. The commander observes calmly as the massacre continues. Sarah falls into water from a blast; villagers are shot. Soldiers grab Sarah and drag her away. The machine gunner searches for more targets."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Underneath a simple canopy, Volunteer James passionately delivers a sermon with the invaluable assistance of a skilled translator, while a man, equipped with a camcorder, dutifully records the unfolding event. Nearby, another dedicated volunteer is busy rendering medical aid as Sarah casually passes by. She then climbs the rough, wooden steps into a small hut where numerous young individuals are gathered in the waiting area, some of whom are visibly missing limbs. Once inside the hut, Sarah encounters Michael attending to another patient who is lying helplessly on the floor. She promptly hands Michael a roll of bandage intended for binding a stump where a shin once was; the patient moans in agony, but Michael offers a gentle, reassuring pat. Sarah gazes sympathetically at them before shifting her attention to the waiting patients, noticing one particularly small boy with only a single leg.\n\nSuddenly, the tranquility of the village is shattered by the ominous sound of approaching rocket fire. In a tense moment, a rocket is readied, and Sarah quickly hands a child over to its mother for safety. With terror reigning as rockets, fired by the military forces, tear through the village, they brutally dismember a man as Michael, cradling a child protectively in his arms, navigates through the chaos. Rockets smash into the paddy field, obliterating a wooden hut, prompting Sarah to seek refuge beneath another structure as heavily armed soldiers from the army storm the village with guns blazing. Amidst the mounting violence, a brave volunteer carrying a child in each arm tragically falls, and the children are viciously dragged from him, with one child being shot and the other cruelly bayoneted in the abdomen while an army boot heartlessly pins down his face. A woman is fatally gunned down, another woman is subjected to abuse, and a third is mercilessly dragged away by her hair.\n\nIn dramatic slow motion, a volunteer donning a baseball cap makes a desperate attempt to outpace the relentless rocket fire, only to be struck, severing his legs below the knees. Helplessly, a man kneels before two menacing soldiers wielding weapons as other soldiers ruthlessly hack off the limbs of villagers. A soldier armed with a flamethrower unleashes a searing plume of fire into a structure, forcing villagers, their clothing ignited, to flee in despair, frantically rolling in the dust to extinguish the flames. Tragically, a small child is violently torn from its mother's embrace and heartlessly tossed into the inferno of the burning building. Sarah sprints to safety as Michael falls victim to a rifle-butting, and villagers desperately attempt to flee across the paddy field. A truck, equipped with a machine gun mounted on a tripod, arrives on the scene, mercilessly mowing down the fleeing villagers.\n\nMeanwhile, Sarah desperately runs alongside a mother and her child, but horror strikes as the mother is shot in the back and collapses lifelessly to the ground. The commander, displaying a cold demeanor, observes the unfolding carnage with a detached gaze while his subordinate continues to fire indiscriminately. Partially caught in the chaos of an explosion, Sarah tumbles into the water of the paddy field, while the commander nonchalantly takes a drag on his cigarette. As more villagers make a desperate dash towards the truck, they are mercilessly torn apart by the relentless onslaught of bullets, and gunfire picks off any remaining survivors. Just as Sarah looks up, two soldiers seize her by the arms; she struggles valiantly to resist, but they forcefully haul her to her feet and drag her away by the scruff of her neck. Inside the truck, the resolute soldier responsible for the machine gun methodically pivots back and forth, scanning for more victims in his relentless pursuit."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Beneath a modest and uncomplicated canopy, Volunteer James, with great enthusiasm and fervor, delivers an impassioned and heartfelt sermon. He is aided significantly by the invaluable presence and assistance of a highly skilled and competent translator. Meanwhile, a man, fully equipped with a camcorder, diligently and faithfully records the unfolding event, capturing every moment as it happens. Nearby, in the vicinity of this unfolding scene, another dedicated and committed volunteer is busily engaged in providing essential medical aid. She moves with purpose and intent, as Sarah, almost nonchalantly, passes by the scene. She then carefully climbs the rough and rugged wooden steps that lead up to a small, humble hut where many young individuals are waiting. Among these youths, some are unfortunately and visibly missing limbs, adding a somber note to the atmosphere. Once inside the confines of the hut, Sarah encounters Michael, who is attentively caring for another patient lying helplessly on the floor. She promptly hands over to Michael a roll of bandage specifically intended for binding a stump where a shin once existed; the patient moans in deep agony, but Michael offers a gentle and comforting pat. With sympathy in her gaze, Sarah looks upon them before redirecting her attention to the waiting patients. Among them, she notices one particularly small boy who tragically has only a single leg.\n\nSuddenly, the serene and quiet atmosphere of the village is abruptly shattered by the ominous and foreboding sound of approaching rocket fire. In a tense and critical moment, as a rocket is readied for launch, Sarah quickly hands a child over to its mother to ensure safety. With terror reigning supreme, the rockets, fired by military forces, mercilessly tear through the village. They brutally dismember a man as Michael, cradling a child protectively in his arms, navigates through the chaos. Rockets smash into the paddy field, obliterating a wooden hut, prompting Sarah to seek refuge beneath yet another structure as heavily armed soldiers from the army storm the village with guns blazing. Amidst the mounting and escalating violence, a brave volunteer carrying a child in each arm tragically falls, and the children are viciously dragged away from him. In the ensuing horror, one child is shot, and the other is cruelly bayoneted in the abdomen while an army boot heartlessly pins his face to the ground. A woman is fatally gunned down, another woman suffers abuse, and yet a third is mercilessly dragged away by her hair.\n\nIn a dramatic sequence playing out in slow motion, a volunteer wearing a baseball cap makes a desperate attempt to outpace the relentless rocket fire, only to be struck with devastating force, severing his legs below the knees. In a scene of utter desperation, a man kneels helplessly before two menacing soldiers who are wielding weapons. Other soldiers ruthlessly hack off the limbs of villagers with a terrifying lack of mercy. A soldier armed with a flamethrower unleashes a searing and scorching plume of fire into a structure, forcing villagers, their clothing ignited and ablaze, to flee in utter despair. They frantically roll in the dust in an attempt to extinguish the flames licking at their bodies. Tragically, a small child is violently torn from its mother's embrace and heartlessly tossed into the inferno of the burning building. Sarah sprints away to safety as Michael becomes a victim of a rifle-butting, and villagers desperately attempt to flee across the paddy field. A truck arrives, equipped with a machine gun mounted on a tripod, mercilessly mowing down the fleeing villagers without remorse.\n\nMeanwhile, Sarah runs desperately alongside a mother and her child, but horror strikes as the mother is shot in the back and collapses lifelessly to the ground. The commander, displaying a cold and unfeeling demeanor, observes the unfolding carnage with a detached and indifferent gaze, while his subordinate continues to fire indiscriminately. Partially caught in the chaos and force of an explosion, Sarah tumbles into the water of the paddy field. The commander, unaffected, nonchalantly takes a drag on his cigarette. As more villagers make a desperate dash towards the truck, they are mercilessly torn apart by the relentless onslaught of bullets. Gunfire picks off any remaining survivors without pause. Just as Sarah looks up, two soldiers seize her firmly by the arms. She struggles valiantly, fighting with all her strength to resist, but they forcefully haul her to her feet and drag her away by the scruff of her neck. Inside the truck, the resolute soldier responsible for the machine gun methodically pivots back and forth, scanning for more victims in his relentless and ruthless pursuit."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Volunteer James stands under the protective shade of a canopy where he begins to deliver a sermon. His words, spoken with intent and clarity, are echoed through the voice of a translator standing beside him, ensuring that every listener can grasp the message. Nearby, a man holding a camcorder positions himself strategically, focusing the lens on James to record the unfolding event for posterity. Meanwhile, another volunteer is busy offering medical care, attending to those in need with careful attention. As Sarah enters the scene, she walks purposefully by, her steps taking her up a set of worn wooden steps leading into a hut. Upon entering, she is greeted by the sight of young people seated in a waiting area; some are visibly marked by the cruel absence of limbs. Within the confines of the hut, Sarah soon spots Michael who is diligently tending to another patient lying on the floor. She approaches, reaching out to hand him a roll of bandage which he promptly uses to bind a stump where the shin should have been. The patient writhes on the floor, clearly in pain, and Michael responds with a gentle, comforting pat. Sarah's gaze shifts from this scene of distress to the waiting patients, her eyes resting for a moment on a small boy whose young body bears the burden of having only one leg. Suddenly, the tranquility of the village is shattered as rocket fire rains down. A rocket is primed for launch, and Sarah, amidst the chaos, swiftly hands a nearby child to its mother, ensuring its safety. The rockets, fired by the army without mercy, result in a man being blown apart, while Michael is seen moving about, cradling a child in his arms amidst the destruction. The rockets continue their destructive path, targeting the paddy field and mercilessly obliterating a wooden hut within its range. Sarah finds herself seeking cover under a hut as the army storms into the village, weapons blazing and leaving fear in their wake. One volunteer, carrying a child under each arm in a desperate bid to save them, is brutally cut down. The children are wrenched from his lifeless form; one is shot and the other is subjected to a bayonet in the stomach while their face is cruelly held down by an army boot. Violence continues unabated—a woman is shot, another is abused, and a third is forcibly dragged away by her hair, a scene that sears itself into the memory in slow motion. A volunteer, his head shielded only by a baseball cap, attempts to outrun the incoming rocket fire, but his efforts end in tragedy as he is struck, his legs severed below the knee. Elsewhere, a man finds himself kneeling before a pair of soldiers who brandish their weapons menacingly while other soldiers mercilessly hack off the limbs of villagers, not sparing any compassion. As the horror unfolds, a soldier armed with a flamethrower looms over a building, releasing a fierce plume of fire into it, forcing villagers, their clothes alight, to flee and desperately roll in the dust to extinguish the flames. A small child is snatched cruelly from its mother and thrown into the fiery maw of the building. Amidst this nightmare, Sarah begins to run, witnessing Michael being struck with the butt of a rifle, while villagers flee across the paddy field in a frantic bid for survival. A truck, ominously equipped with a machine gun mounted on a tripod, arrives on the scene, indiscriminately mowing down fleeing villagers. Sarah runs alongside a mother and a child, but the child's mother is struck down by a bullet, collapsing to the ground, her life extinguished. From the vantage point of the truck, a commander surveys the devastation with a detached coolness as his subordinate fires relentlessly. Caught partially by an explosion, Sarah is propelled into the water of the field, her surroundings a blur of chaos as the commander takes a drag from his cigarette, the smoke curling into the air as he remains unfazed. Villagers continue their desperate flight toward the truck, only to be met with bullets that tear through their bodies, and the relentless gunfire finds its mark on those who miraculously survive the initial onslaught. Sarah, soaked and battered, looks up just in time to see two soldiers closing in on her. She struggles and fights back fiercely, but the soldiers overpower her, hoisting her to her feet and dragging her away, their grip firm on the scruff of her neck. Meanwhile, in the truck, the soldier manning the machine gun methodically swivels the weapon, his eyes scanning for more victims in a scene that epitomizes ruthless efficiency and chilling detachment."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Volunteer James delivers a sermon under a canopy with the help of a translator while being recorded by a man with a camcorder. Nearby, a volunteer administers medical care as Sarah walks past and enters a hut where young people, some with missing limbs, await assistance. Inside, she finds Michael attending to a patient and gives him a bandage to treat a stump; Michael comforts the patient, who is in pain. As Sarah observes the patients, including a small boy with one leg, a sudden rocket attack strikes the village. Amidst the chaos, Sarah quickly hands a child to its mother as army-fired rockets kill a man while Michael carries a child. The rockets hit a paddy field, destroying a hut, and Sarah seeks shelter as the army invades the village with gunfire. A volunteer carrying children is killed, and the children are brutally attacked. Amidst the violence, a soldier uses a flamethrower on a building, forcing burning villagers to flee. Sarah flees as Michael is beaten, and villagers attempt to escape across the paddy field. A truck with a mounted machine gun arrives, massacring fleeing villagers. As Sarah runs with a mother and child, the mother is shot. The commander of the truck calmly observes the carnage while his subordinate fires relentlessly. A blast partially catches Sarah, sending her into the field's water as the commander smokes a cigarette. More villagers run towards the truck, only to be torn apart by bullets. Two soldiers seize Sarah, who struggles to break free, but they forcibly drag her away. Meanwhile, the soldier operating the machine gun scans for more victims."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Volunteer James, who often speaks at gatherings in remote regions where language barriers are common, gives a sermon under a canopy with the aid of a translator, facilitating communication with the diverse audience, while a man with a camcorder, capturing footage likely for documentation or awareness purposes, records the event. Another volunteer provides essential medical care, tending to wounds and illnesses that are prevalent due to the lack of local healthcare, as Sarah passes by and walks up wooden steps, constructed from local timber, into a hut where young people sit in a waiting area, some having lost limbs perhaps due to landmines or other conflict-related incidents. Inside, Sarah finds Michael attending to another patient lying on the floor, reflecting the dire conditions, and hands Michael a roll of bandage, a vital yet scarce resource, to bind a stump where the shin should be; the patient writhes in pain, and Michael gives him a comforting pat, a gesture of compassion amidst suffering. Sarah looks down at them, then at the waiting patients where a very small boy, likely a victim of the violence that has plagued their community, has only one leg.\n\nSuddenly, the village, positioned in a conflict zone, is attacked with rocket fire as a rocket is primed, and Sarah, who has become an involuntary witness to the chaos, hands a child to its mother. The rockets, fired by the army as part of an offensive operation, blow a man to pieces as Michael roams with a child in his arms, trying to shield them from the violence. Rockets hit the paddy field, vital for the villagers' subsistence farming, destroying a wooden hut, and Sarah cowers under a hut, seeking shelter, while the army, executing a brutal raid, enters the village with weapons blazing. A volunteer carrying a child in each arm, embodying the selflessness of aid workers, is cut down, and the children are dragged from him, with one shot and the other bayoneted in the stomach while his face is held down by an army boot, illustrating the harrowing nature of the attack. A woman is shot, another abused, and a third dragged away by her hair, underscoring the widespread violence against civilians.\n\nIn slow motion, a volunteer in a baseball cap, a common choice for sun protection in such climates, tries to outrun the rocket fire, but is hit, severing his legs below the knee. A man kneels before a pair of soldiers with weapons, a scene of helplessness as soldiers hack off villagers' limbs, a brutal tactic of intimidation and control. A soldier with a flamethrower sends a plume of flame into a building, causing villagers with clothing on fire to run from it and roll in the dust, desperate to extinguish the flames, while a small child is torn from its mother and tossed into the burning building, an act of unspeakable cruelty. Sarah runs as Michael is rifle-butted, a maneuver often used to subdue captives, and the villagers run across the paddy field. The truck with a machine gun on a tripod, a devastating weapon against unarmed populations, arrives, massacring the villagers in mid-flight. Sarah is accompanied by a mother and a child who run with her, their determination to survive palpable, but the mother is shot in the back and drops to the ground.\n\nFrom the truck, the cool commander, perhaps a leader of the military operation, watches the carnage while his subordinate blazes away. Partially caught by a blast, Sarah tumbles into the water of the field, providing a momentary respite from the onslaught, as the commander pulls on his cigarette, a haunting image of indifference. More villagers run towards the truck as their bodies are torn apart by bullets, and gunfire picks off survivors, a grim testament to the brutality of the attack. Sarah looks up just as two soldiers grab her by the arms; she tries to fight them off, but they haul her to her feet and drag her away by the scruff of her neck, a common method of capturing hostages. In the truck, the soldier in charge of the machine gun pivots to and fro in search of victims, his weapon continuing to wreak havoc."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Volunteer James gives a sermon under a canopy with the aid of a translator while a man with a camcorder records the event. Another volunteer provides medical care as Sarah passes by and walks up wooden steps into a hut where young people sit in a waiting area some with missing limbs. Inside Sarah finds Michael with another patient lying on the floor and hands Michael a roll of bandage to bind a stump where the shin should be. the patient writhes in pain and Michael gives him a comforting pat. Sarah looks down at them then at the waiting patients where a very small boy has only one leg. Suddenly the village is attacked with rocket fire as a rocket is primed and Sarah hands a child to its mother. The rockets fired by the army blow a man to pieces as Michael roams with a child in his arms. Rockets hit the paddy field destroying a wooden hut and Sarah cowers under a hut while the army enters the village with weapons blazing. A volunteer carrying a child in each arm is cut down and the children are dragged from him with one shot and the other bayoneted in the stomach while his face is held down by an army boot. A woman is shot another abused and a third dragged away by her hair. In slow motion a volunteer in a baseball cap tries to outrun the rocket fire but is hit severing his legs below the knee. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. A man kneels before a pair of soldiers with weapons as soldiers hack off villagers' limbs. A soldier with a flamethrower sends a plume of flame into a building causing villagers with clothing on fire to run from it and roll in the dust while a small child is torn from its mother and tossed into the burning building. Sarah runs as Michael is riflebutted and the villagers run across the paddy field. The truck with a machine gun on a tripod arrives massacring the villagers in midflight. Sarah is accompanied by a mother and a child who run with her but the mother is shot in the back and drops to the ground. From the truck the cool commander watches the carnage while his subordinate blazes away. Partially caught by a blast Sarah tumbles into the water of the field as the commander pulls on his cigarette. More villagers run towards the truck as their bodies are torn apart by bullets and gunfire picks off survivors. Sarah looks up just as two soldiers grab her by the arms. she tries to fight them off but they haul her to her feet and drag her away by the scruff of her neck. In the truck the soldier in charge of the machine gun pivots to and fro in search of victims."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Volunteer James gives a sermon under a canopy with the aid of a translator while a man with a camcorder records the event. Another volunteer provides medical care as Sarah passes by and walks up wooden steps into a hut where young people sit in a waiting area some with missing limbs. Inside Sarah finds Michael with another patient lying on the floor and hands Michael a roll of bandage to bind a stump where the shin should be. the patient writhes in pain and Michael gives him a comforting pat. Sarah looks down at them then at the waiting patients where a very small boy has only one leg. Suddenly the village is attacked with rocket fire as a rocket is primed and Sarah hands a child to its mother. The rockets fired by the army blow a man to pieces as Michael roams with a child in his arms. Rockets hit the paddy field destroying a wooden hut and Sarah cowers under a hut while the army enters the village with weapons blazing. A volunteer carrying a child in each arm is cut down and the children are dragged from him with one shot and the other bayoneted in the stomach while his face is held down by an army boot. A woman is shot another abused and a third dragged away by her hair. In slow motion a volunteer in a baseball cap tries to outrun the rocket fire but is hit severing his legs below the knee. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. A man kneels before a pair of soldiers with weapons as soldiers hack off villagers' limbs. A soldier with a flamethrower sends a plume of flame into a building causing villagers with clothing on fire to run from it and roll in the dust while a small child is torn from its mother and tossed into the burning building. Sarah runs as Michael is riflebutted and the villagers run across the paddy field. The truck with a machine gun on a tripod arrives massacring the villagers in midflight. Sarah is accompanied by a mother and a child who run with her but the mother is shot in the back and drops to the ground. From the truck the cool commander watches the carnage while his subordinate blazes away. Partially caught by a blast Sarah tumbles into the water of the field as the commander pulls on his cigarette. More villagers run towards the truck as their bodies are torn apart by bullets and gunfire picks off survivors. Sarah looks up just as two soldiers grab her by the arms. she tries to fight them off but they haul her to her feet and drag her away by the scruff of her neck. In the truck the soldier in charge of the machine gun pivots to and fro in search of victims."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Volunteer James gives a sermon under a canopy with the aid of a translator while a man with a camcorder records the event. Another volunteer provides medical care as Sarah passes by and walks up wooden steps into a hut where young people sit in a waiting area some with missing limbs. Inside Sarah finds Michael with another patient lying on the floor and hands Michael a roll of bandage to bind a stump where the shin should be. the patient writhes in pain and Michael gives him a comforting pat. Sarah looks down at them then at the waiting patients where a very small boy has only one leg. Suddenly the village is attacked with rocket fire as a rocket is primed and Sarah hands a child to its mother. Partially caught by a blast Sarah tumbles into the water of the field as the commander pulls on his cigarette. More villagers run towards the truck as their bodies are torn apart by bullets and gunfire picks off survivors. Sarah looks up just as two soldiers grab her by the arms. she tries to fight them off but they haul her to her feet and drag her away by the scruff of her neck. In the truck the soldier in charge of the machine gun pivots to and fro in search of victims."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Volunteer James gives a sermon under a canopy with the aid of a translator while a man with a camcorder records the event. Another volunteer provides medical care as Sarah passes by and walks up wooden steps into a hut where young people sit in a waiting area some with missing limbs. Inside Sarah finds Michael with another patient lying on the floor and hands Michael a roll of bandage to bind a stump where the shin should be. she tries to fight them off but they haul her to her feet and drag her away by the scruff of her neck. In the truck the soldier in charge of the machine gun pivots to and fro in search of victims."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Explorer Lucy *delivers a lecture* under an umbrella with the assistance of a mime while a woman with a telescope *sketches the occasion*. Another explorer *offers culinary advice* as Emma skips past and *climbs down stone steps* into a tent where *elderly penguins* snooze in a library, some with *paper hats*. Inside, Emma discovers Brian with another guest *resting on a hammock* and *tosses Brian a spool of yarn* to knit a beanie where the ear should be; the guest *giggles in delight*, and Brian *gives a reassuring hug*. Emma *gazes around at them*, then at the *snoozing penguins* where a *tiny kitten* has *forgotten its mittens*. Suddenly, the *sea turtles are serenaded with violin music* as a violin is *tuned*, and Emma *hands a loaf* to its *baker*. The violins, *played by the orchestra*, *sprinkle confetti on* a woman as Brian *wanders with a butterfly net*. Violins *play in the cornfield* *decorating a cardboard tent*, and Emma *hides under a tree* while the orchestra *dances into the garden* with *flowers swaying*. An explorer *carrying an umbrella in each hand* is *swept away*, and the *umbrellas are whisked from him*, with one *folded* and the other *painted with rainbows* while *his socks are dabbed* by a *string quartet*. A *panda is tickled*, another *praised*, and a third *whisked away by magic carpet*. In slow motion, an explorer *in a sunhat* tries to *evade the violin music*, but is *captured*, *losing his spectacles to the breeze*. A woman *kneels before a pair of gardeners* with *watering cans* as gardeners *trim* villagers’ *topiaries*. A gardener with a *watering wand* sends a *spray of mist* into a *greenhouse*, causing villagers *with sunhats* to *stroll from it* and *dance on the lawn*, while a *turtle is scooped from its shell* and *placed gently* into the *misty greenhouse*. Emma *skips* as Brian is *tickled with a feather* and the villagers *frolic across the meadow*. The *carriage with a blunderbuss* on a tripod *captures the villagers mid-jump*. Emma is *guided by a butterfly* and a *lamb* who *gallops with her*, but the *butterfly is clipped by a scissors* and *drifts to the ground*. From the carriage, the *cool conductor* watches the *celebration* while his *assistant juggles merrily*. Partially *caressed by a breeze*, Emma *splashes into the pond* of the field as the conductor *puffs on his harmonica*. More villagers *prance towards the carriage* as their *balloons are popped by bubbles* and *sparkles shower on* survivors. Emma *glances up* just as two *musicians clasp her by the wrists*; she tries to *shake them off*, but they *hoist her to the skies* and *glide her away by the hem of her dress*. In the carriage, the *gardener in charge of the blunderbuss* *twirls to and fro* in search of *singers*."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Volunteer James delivers a sermon with a translator while a man records it. Another volunteer provides medical care as Sarah enters a hut where young amputees await. She assists Michael with a patient, then sees a small boy with one leg. Suddenly, the village is attacked by rockets, causing chaos. Sarah helps a child to its mother. Rockets fired by soldiers destroy a hut and kill a man. The army invades, shooting and attacking villagers. A volunteer is killed while carrying children, who are brutally murdered. A woman is shot, another abused, and a volunteer is maimed by rocket fire. Soldiers mutilate villagers, and a flamethrower sets a building alight, forcing burning villagers to flee. A child is thrown into the fire. Sarah runs, but Michael is taken down, and villagers are massacred by a machine gun from a truck. Running with Sarah, a mother is shot and falls. The commander watches, smoking as the truck's gunman targets survivors. Sarah falls into the water, then soldiers capture and drag her away. The gunman continues searching for victims."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "In the truck the soldier in charge of the machine gun pivots to and fro in search of victims she tries to fight them off but they haul her to her feet and drag her away by the scruff of her neck Sarah looks up just as two soldiers grab her by the arms More villagers run towards the truck as their bodies are torn apart by bullets and gunfire picks off survivors Partially caught by a blast Sarah tumbles into the water of the field as the commander pulls on his cigarette From the truck the cool commander watches the carnage while his subordinate blazes away Sarah is accompanied by a mother and a child who run with her but the mother is shot in the back and drops to the ground The truck with a machine gun on a tripod arrives massacring the villagers in midflight Sarah runs as Michael is riflebutted and the villagers run across the paddy field A soldier with a flamethrower sends a plume of flame into a building causing villagers with clothing on fire to run from it and roll in the dust while a small child is torn from its mother and tossed into the burning building A man kneels before a pair of soldiers with weapons as soldiers hack off villagers' limbs In slow motion a volunteer in a baseball cap tries to outrun the rocket fire but is hit severing his legs below the knee A woman is shot another abused and a third dragged away by her hair A volunteer carrying a child in each arm is cut down and the children are dragged from him with one shot and the other bayoneted in the stomach while his face is held down by an army boot Rockets hit the paddy field destroying a wooden hut and Sarah cowers under a hut while the army enters the village with weapons blazing The rockets fired by the army blow a man to pieces as Michael roams with a child in his arms Suddenly the village is attacked with rocket fire as a rocket is primed and Sarah hands a child to its mother Sarah looks down at them then at the waiting patients where a very small boy has only one leg the patient writhes in pain and Michael gives him a comforting pat Inside Sarah finds Michael with another patient lying on the floor and hands Michael a roll of bandage to bind a stump where the shin should be Another volunteer provides medical care as Sarah passes by and walks up wooden steps into a hut where young people sit in a waiting area some with missing limbs Volunteer James gives a sermon under a canopy with the aid of a translator while a man with a camcorder records the event"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Another volunteer provides medical care as Sarah passes by and walks up wooden steps into a hut where young people sit in a waiting area some with missing limbs Volunteer James gives a sermon under a canopy with the aid of a translator while a man with a camcorder records the event the patient writhes in pain and Michael gives him a comforting pat Inside Sarah finds Michael with another patient lying on the floor and hands Michael a roll of bandage to bind a stump where the shin should be Suddenly the village is attacked with rocket fire as a rocket is primed and Sarah hands a child to its mother Sarah looks down at them then at the waiting patients where a very small boy has only one leg Rockets hit the paddy field destroying a wooden hut and Sarah cowers under a hut while the army enters the village with weapons blazing The rockets fired by the army blow a man to pieces as Michael roams with a child in his arms A woman is shot another abused and a third dragged away by her hair A volunteer carrying a child in each arm is cut down and the children are dragged from him with one shot and the other bayoneted in the stomach while his face is held down by an army boot A man kneels before a pair of soldiers with weapons as soldiers hack off villagers' limbs In slow motion a volunteer in a baseball cap tries to outrun the rocket fire but is hit severing his legs below the knee Sarah runs as Michael is riflebutted and the villagers run across the paddy field A soldier with a flamethrower sends a plume of flame into a building causing villagers with clothing on fire to run from it and roll in the dust while a small child is torn from its mother and tossed into the burning building Sarah is accompanied by a mother and a child who run with her but the mother is shot in the back and drops to the ground The truck with a machine gun on a tripod arrives massacring the villagers in midflight Partially caught by a blast Sarah tumbles into the water of the field as the commander pulls on his cigarette From the truck the cool commander watches the carnage while his subordinate blazes away Sarah looks up just as two soldiers grab her by the arms More villagers run towards the truck as their bodies are torn apart by bullets and gunfire picks off survivors In the truck the soldier in charge of the machine gun pivots to and fro in search of victims she tries to fight them off but they haul her to her feet and drag her away by the scruff of her neck"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "A man kneels before a pair of soldiers with weapons as soldiers hack off villagers' limbs A soldier with a flamethrower sends a plume of flame into a building causing villagers with clothing on fire to run from it and roll in the dust while a small child is torn from its mother and tossed into the burning building Sarah runs as Michael is riflebutted and the villagers run across the paddy field The truck with a machine gun on a tripod arrives massacring the villagers in midflight Sarah is accompanied by a mother and a child who run with her but the mother is shot in the back and drops to the ground From the truck the cool commander watches the carnage while his subordinate blazes away Partially caught by a blast Sarah tumbles into the water of the field as the commander pulls on his cigarette More villagers run towards the truck as their bodies are torn apart by bullets and gunfire picks off survivors Sarah looks up just as two soldiers grab her by the arms she tries to fight them off but they haul her to her feet and drag her away by the scruff of her neck In the truck the soldier in charge of the machine gun pivots to and fro in search of victims Volunteer James gives a sermon under a canopy with the aid of a translator while a man with a camcorder records the event Another volunteer provides medical care as Sarah passes by and walks up wooden steps into a hut where young people sit in a waiting area some with missing limbs Inside Sarah finds Michael with another patient lying on the floor and hands Michael a roll of bandage to bind a stump where the shin should be the patient writhes in pain and Michael gives him a comforting pat Sarah looks down at them then at the waiting patients where a very small boy has only one leg Suddenly the village is attacked with rocket fire as a rocket is primed and Sarah hands a child to its mother The rockets fired by the army blow a man to pieces as Michael roams with a child in his arms Rockets hit the paddy field destroying a wooden hut and Sarah cowers under a hut while the army enters the village with weapons blazing A volunteer carrying a child in each arm is cut down and the children are dragged from him with one shot and the other bayoneted in the stomach while his face is held down by an army boot A woman is shot another abused and a third dragged away by her hair In slow motion a volunteer in a baseball cap tries to outrun the rocket fire but is hit severing his legs below the knee"
        }
      ]
    }
  ]
}