{
  "ground_truth": "The volunteer looks down on Rambo's boat where Lewis stands in the stern with his back to Rambo. Lewis points to himself and looks at Rambo, who ignores him. Rambo fixes him a glare but remains expressionless, then turns away and spits into the river before staring ahead again as Lewis walks away in disgust. Handsome and rugged School Boy glances up the boat at Rambo. The military camp at night has a truck sitting at the end of two rows of huts. In the pigsty cell, Sarah looks up through the floorboards into the hut where the commander appears, with a short, neat mustache, takes a pull on one of his ever-present cigarettes, blows smoke, smirks, and walks away as Sarah rests her head against the wall of her prison. On the river, the boat rounds a promontory with its headlamps off. Lewis leans pensively on the boat's prow, turns to look at the stern, and Rambo stares back at him before Lewis turns away. The boat pulls alongside the harbor where Michael's party were dropped, and the mercenaries disembark laden with various weapons and bandoleers, including automatic rifles with telescopic sights. Two rebels approach along the path leading to the gangplank as Rambo walks up the gangplank. The party of mercenaries, BN the rebel, and the boy tracker set off into the forest while Rambo solemnly watches them go, turns away, and walks back to the boat. BN and the boy lead the mercenaries through forest undergrowth as School Boy's rifle is particularly bulky, and they cross a small stream. En-Joo wears a khaki hat, and Diaz has a shirt covering his hair. Resting against a tree and partially covered in vines is a dull gray object, bullet-shaped but with fins at one end, which Lewis regards warily, while the rest of the mercenaries pay the bomb little attention and move on. They pass a cave mouth on a craggy mountainside where inside there's a small collection of nervous-looking locals, comprising women, children, and old men, and the mercenaries move on as En-Joo, Reese, and Diaz each give the locals a backward glance. At the village paddy field, the water is clear but there is pale brown mud beneath it, with sticks of plant poking into the air and trees reflected in the water's surface. A decomposing human corpse lies partially submerged in the water with a dead buffalo beyond it, as BN and the mercenaries overlook the field. More corpses lie at the edge of the field, and Reese holds his shirt against his nose as a woman's severed head hangs from a post. Lewis turns to look, and there are two bodies hanging from bare rafters in the remains of a hut. The boy nods and leaves, and the mercenaries make a wary record of the ruined village.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The helper gazes down on Rambo's vessel where Lewis stands in the aft with his back to Rambo. Lewis gestures to himself and glances at Rambo, who disregards him. Rambo fixes him a glower but remains unexpressive, then turns away and spits into the waterway before staring ahead again as Lewis strides away in indignation. Attractive and tough School Boy peeks up the craft at Rambo. The armed forces encampment at night has a lorry resting at the end of two rows of shanties. In the pigsty chamber, Sarah gazes up through the floorboards into the hut where the commander appears, with a short, tidy mustache, takes a drag on one of his ever-present cigarettes, exhales smoke, sneers, and walks away as Sarah rests her head against the wall of her confinement. On the river, the vessel rounds a headland with its headlamps off. Lewis leans pensively on the boat's bow, turns to glance at the stern, and Rambo gazes back at him before Lewis turns away. The craft pulls alongside the port where Michael's group were dropped, and the mercenaries disembark burdened with various arms and bandoliers, including automatic guns with telescopic sights. Two insurgents approach along the path leading to the gangplank as Rambo strides up the gangplank. The group of mercenaries, BN the insurgent, and the youth tracker set off into the woodland while Rambo solemnly watches them go, turns away, and strides back to the boat. BN and the youth lead the mercenaries through forest undergrowth as School Boy's firearm is particularly bulky, and they cross a small brook. En-Joo wears a khaki cap, and Diaz has a shirt covering his hair. Resting against a tree and partially covered in vines is a dull gray item, bullet-shaped but with fins at one end, which Lewis regards cautiously, while the rest of the mercenaries pay the bomb little attention and move on. They pass a cavern entrance on a craggy mountainside where inside there's a small collection of nervous-looking locals, including women, children, and old men, and the mercenaries move on as En-Joo, Reese, and Diaz each give the locals a backward glance. At the village paddy field, the water is clear but there is pale brown mud beneath it, with sticks of vegetation poking into the air and trees reflected in the water's surface. A decomposing human cadaver lies partially submerged in the water with a dead buffalo beyond it, as BN and the mercenaries overlook the field. More cadavers lie at the edge of the field, and Reese holds his shirt against his nose as a woman's severed head hangs from a post. Lewis turns to look, and there are two bodies hanging from bare beams in the remnants of a hut. The youth nods and leaves, and the mercenaries make a wary record of the devastated village."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Down on Rambo's boat, a glance is cast by the volunteer at Lewis, who stands in the stern with his back to Rambo. Lewis points to himself and looks at Rambo, who is ignored by him. A glare is fixed on Lewis by Rambo but remains expressionless, then a turn is made away and spit is sent into the river before he stares ahead again as Lewis, disgusted, walks away. Rambo is glanced up at by the handsome and rugged School Boy. At night, a military camp has a truck sitting at the end of two rows of huts. In the pigsty cell, Sarah looks up through the floorboards into the hut where the commander, with a short, neat mustache, appears, takes a pull on one of his ever-present cigarettes, blows smoke, smirks, and walks away as her head is rested against the wall of her prison by Sarah. On the river, a promontory is rounded by the boat with its headlamps off. The boat's prow is leaned on pensively by Lewis, who turns to look at the stern, and a stare is directed back at him by Rambo before a turn is made away by Lewis. Alongside the harbor where Michael's party dropped them, the boat pulls, and various weapons and bandoleers, including automatic rifles with telescopic sights, are carried ashore by the mercenaries. Two rebels approach along the path leading to the gangplank as the gangplank is walked up by Rambo. Into the forest, the party of mercenaries, BN the rebel, and the boy tracker set off while they are solemnly watched go by Rambo, who then turns away and walks back to the boat. Through forest undergrowth, the mercenaries are led by BN and the boy as School Boy's rifle is particularly bulky, and a small stream is crossed by them. A khaki hat is worn by En-Joo, and Diaz has his hair covered by a shirt. Resting against a tree and partially covered in vines is a dull gray object, bullet-shaped but with fins at one end, which is regarded warily by Lewis, while little attention is paid to the bomb by the rest of the mercenaries, and they move on. A cave mouth on a craggy mountainside is passed by them, where inside there's a small collection of nervous-looking locals, comprising women, children, and old men, and they are moved past by the mercenaries, as the locals are each given a backward glance by En-Joo, Reese, and Diaz. At the village paddy field, clarity defines the water, but a pale brown mud lies beneath it, with sticks of plant poking into the air and trees reflected in the water's surface. A decomposing human corpse, partially submerged in the water, lies with a dead buffalo beyond it, while the field is overlooked by BN and the mercenaries. At the edge of the field, more corpses lie, and a shirt is held against the nose by Reese as a woman's severed head is hung from a post. A turn is made by Lewis to look, and two bodies hang from bare rafters in the remains of a hut. The boy nods and leaves, and a wary record of the ruined village is made by the mercenaries."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The volunteer gazes at Rambo's boat where Lewis, in the stern, gestures to himself, ignored by Rambo. With an expressionless glare, Rambo spits into the river and looks ahead as Lewis departs in disgust. Handsome School Boy glances at Rambo. At night, a military camp truck sits among huts. In a pigsty cell, Sarah looks up to see a mustached commander smirk, smoke, and walk away as she rests against the prison wall. On the river, the boat with headlamps off rounds a promontory. Lewis pensively leans on the prow, exchanges a stare with Rambo, then looks away. The boat arrives at the harbor where Michael's party disembarked, and mercenaries, carrying weapons, disembark. Two rebels approach as Rambo walks up the gangplank. The mercenaries, led by BN and the boy tracker, enter the forest as Rambo watches solemnly, then returns to the boat. BN and the boy guide the mercenaries through the undergrowth, School Boy's large rifle in tow, crossing a stream. En-Joo wears a khaki hat, Diaz covers his hair with a shirt. Against a tree rests a bomb, which Lewis notices cautiously, while others ignore it. They pass a cave with nervous locals inside and move on, glancing back. In the village paddy field, clear water reflects trees over muddy ground with plants. A decomposing corpse and a dead buffalo lie submerged, overlooked by BN and mercenaries. More corpses lie at the field's edge as Reese covers his nose, seeing a woman's severed head on a post. Lewis turns to see bodies hanging in a hut's remains. The boy nods and departs as mercenaries record the ruined village cautiously."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The volunteer observes Rambo's boat with Lewis at the stern, who signals to Rambo but is ignored. Rambo glares, spits in the river, and looks ahead as Lewis departs disgruntled. School Boy glances at Rambo. At night, a truck is parked at a military camp. In a cell, Sarah sees a mustached commander smoke, smirk, and leave as she rests against the wall. The boat, lights off, rounds a promontory. Lewis, pensive, turns to Rambo, who stares back, and Lewis turns away. The boat docks, and mercenaries with weapons disembark. Two rebels meet Rambo on the gangplank, and mercenaries enter the forest while Rambo observes and returns to the boat. BN and a boy lead them through undergrowth and a stream. En-Joo wears a khaki hat, Diaz covers his hair. Lewis notes a vine-covered bomb, largely ignored. Passing a cave with nervous locals, the mercenaries continue. Near the paddy field, clear water covers brown mud with plants, reflected trees, and a decomposing corpse nearby. BN and the mercenaries survey more bodies; Reese covers his nose from a severed head, while Lewis notices hanging bodies. The boy departs, and mercenaries cautiously document the village ruin."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The dedicated volunteer gazes downward upon Rambo's boat, where Lewis stands firmly positioned in the stern, deliberately turning his back to Rambo. In a gesture of self-reference, Lewis points directly at himself and directs his gaze toward Rambo, who chooses to disregard him completely. Rambo responds with an intense, unwavering glare in Lewis's direction but maintains an expressionless demeanor, reflecting no visible emotion. Subsequently, Rambo turns away deliberately, spitting into the flowing river, after which he resumes staring steadfastly ahead as Lewis departs in visible disgust. Handsome and rugged, School Boy casts an upward glance along the boat at Rambo. In the military camp during the stillness of night, a solitary truck is parked strategically at the end of two orderly rows of huts. In the dimly lit pigsty cell, Sarah looks upward through the floorboards into the hut above, where the commander emerges, distinguished by a short, neatly trimmed mustache. He takes a drag from one of his ever-present cigarettes, releasing a plume of smoke while smirking before walking away as Sarah rests her weary head against the unyielding wall of her prison. On the river, the boat navigates around a prominent promontory with its headlamps intentionally turned off. Lewis leans thoughtfully on the boat’s prow, then turns to glance at the stern, where Rambo meets his gaze before Lewis reluctantly turns away. The boat maneuvers alongside the harbor where Michael's party previously disembarked, and the mercenaries alight, heavily burdened with a variety of weapons and bandoleers, including automatic rifles equipped with telescopic sights. Two rebels approach cautiously along the path leading to the gangplank, as Rambo walks steadily up the gangplank. The group of mercenaries, BN the rebel, and the young boy tracker set off into the dense forest, while Rambo watches them leave with solemnity, then turns back to the boat. BN and the boy skillfully guide the mercenaries through the tangled forest undergrowth, especially noticeable is School Boy's particularly bulky rifle, and they cross a small stream. En-Joo dons a khaki hat, and Diaz keeps his hair covered with a shirt. Resting against the trunk of a tree, partially concealed by trailing vines, is a dull gray object, unmistakably bullet-shaped but with fins at one end, which Lewis regards with caution, while the remainder of the mercenaries pay scant attention to the bomb and continue onward. They pass by the entrance of a cave nestled into a craggy mountainside, where inside there is a small assembly of nervous-looking locals, consisting of women, children, and elderly men, and the mercenaries proceed further, as En-Joo, Reese, and Diaz each cast a backward glance toward the locals. At the village paddy field, the water is crystal-clear, yet beneath it lies pale brown mud, with plant sticks protruding into the air and the reflection of trees visible on the water’s surface. A decomposing human corpse lies partially submerged in the water, with a deceased buffalo beyond it, as BN and the mercenaries overlook the field. Additional corpses are sprawled at the field’s edge, and Reese holds his shirt against his nose as he observes a woman’s severed head hanging from a post. Lewis turns to look, and there are two bodies eerily suspended from bare rafters within the remains of a dilapidated hut. The boy acknowledges with a nod and departs, while the mercenaries cautiously document the harrowing scene of the devastated village."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The dedicated and devoted volunteer directs his gaze downward toward Rambo's boat, where Lewis stands firmly and resolutely positioned in the stern. Lewis purposefully turns his back to Rambo, deliberately showing his disregard. In a gesture of self-reference, Lewis points directly at himself and intentionally directs his gaze toward Rambo. However, Rambo chooses to completely ignore him, paying him no attention whatsoever. In response, Rambo fixes an intense and unwavering glare in Lewis's direction, yet his face remains expressionless, reflecting no visible emotion or reaction. Subsequently, Rambo deliberately turns away, spitting with disdain into the flowing river, after which he resumes staring steadfastly ahead as Lewis departs, visibly filled with disgust. Handsome and rugged in appearance, School Boy casts an upward glance along the boat to look at Rambo. In the midst of the military camp during the stillness and quiet of night, a solitary truck is parked strategically at the end of two orderly rows of small huts. Inside the dimly lit and cramped pigsty cell, Sarah looks upward through the floorboards into the hut above, where the commander emerges, distinguished by a short, neatly trimmed mustache. He takes a drag from one of his ever-present cigarettes, releasing a thick plume of smoke while smirking before casually walking away, as Sarah rests her weary head against the unyielding wall of her grim prison. Meanwhile, on the river, the boat navigates carefully around a prominent promontory with its headlamps intentionally turned off. Lewis leans thoughtfully and pensively on the prow of the boat, then turns to glance back at the stern, where Rambo meets his gaze with intensity before Lewis reluctantly turns away. The boat maneuvers alongside the harbor where Michael's party previously disembarked, and the mercenaries alight, heavily burdened with a variety of weapons and bandoleers, including automatic rifles equipped with telescopic sights for precision. Two rebels approach cautiously along the path leading to the gangplank, as Rambo walks steadily and purposefully up the gangplank. The group of mercenaries, BN the rebel, and the young boy tracker set off into the dense and tangled forest, while Rambo watches them leave with solemnity and contemplation, then turns back to the boat. BN and the boy skillfully guide the mercenaries through the undergrowth of the forest, especially noticeable is School Boy's particularly bulky rifle, and they cross a small, trickling stream. En-Joo dons a distinctive khaki hat, and Diaz keeps his head covered with a shirt for protection. Resting against the trunk of a tree, partially concealed by trailing vines, is a dull gray object, unmistakably bullet-shaped but with fins at one end, which Lewis regards with significant caution, while the remainder of the mercenaries pay scant attention to the bomb and continue onward, unfazed. They pass by the entrance of a cave nestled into a craggy mountainside, where inside there is a small assembly of nervous-looking locals, consisting of women, frightened children, and elderly men, and the mercenaries proceed further, as En-Joo, Reese, and Diaz each cast a backward glance toward the local villagers. At the village paddy field, the water is crystal-clear, yet beneath it lies pale brown, murky mud, with plant sticks protruding into the air and the reflection of trees visible on the water’s surface. A decomposing human corpse lies partially submerged in the water, with a deceased buffalo beyond it, as BN and the mercenaries overlook the field with apprehension. Additional corpses are sprawled lifelessly at the field’s edge, and Reese holds his shirt firmly against his nose as he observes with horror a woman’s severed head hanging from a post. Lewis turns to look, and there are two bodies eerily suspended and swaying from bare rafters within the remains of a dilapidated lookout hut. The boy acknowledges with a nod and quietly departs, while the mercenaries cautiously document the harrowing and devastating scene of the once-thriving village."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the volunteer peers down at Rambo's boat, Lewis stands firmly in the stern with his back to Rambo, and in a decisive manner, he raises his hand to point at himself as if seeking acknowledgment before casting a look toward Rambo, who, choosing to ignore him, maintains a stoic presence. With deliberate slowness, Rambo fixes a cold glare on him, his expression blank and unwavering, before he deliberately turns his head away, leans slightly over the boat's edge, and spits into the river, the water rippling quietly. Afterward, he refocuses his gaze on the distant horizon, and Lewis, feeling a wave of disgust, shakes his head in disappointment and turns on his heel to walk away. As he does so, Handsome and rugged School Boy takes a brief moment to look up along the boat in Rambo's direction, his glance lingering momentarily. Transitioning to the military camp at night, a truck is stationed at the far end of two neatly arranged rows of huts. Meanwhile, in the confines of a pigsty cell, Sarah lifts her eyes to peer through floorboards into the hut above, where the commander, sporting a short, well-groomed mustache, inhales deeply from one of his ever-present cigarettes, puffs out a stream of smoke with a self-satisfied smirk, and then, with a casual air, strolls away as Sarah silently lowers her head against the wall of her prison in resignation. On the river, the boat navigates around a promontory, strategically keeping its headlamps off to remain unseen. Lewis, leaning pensively on the boat's prow, takes a moment to turn his head and glance back toward the stern where Rambo meets his gaze with a stare that holds for a second, before Lewis, feeling a sense of unresolved tension, turns away again. The boat eventually maneuvers alongside the harbor where Michael's party had previously been dropped off, and the mercenaries, each appearing focused and determined, disembark with an array of weapons slung over their shoulders and bandoleers strapped across their chests, showcasing automatic rifles equipped with telescopic sights. As they descend, two rebels emerge along the path that leads to the gangplank, while Rambo, moving with purpose, strides up the gangplank. The group of mercenaries, accompanied by BN the rebel and the boy tracker, proceed to set off into the forest, their figures gradually swallowed by the dense undergrowth, while Rambo stands at the edge of the clearing, watching them with a solemn expression before he eventually turns back toward the boat. BN and the boy adeptly guide the mercenaries through the tangled forest undergrowth, navigating carefully as School Boy's rifle stands out due to its particularly bulky size, and they encounter a small stream, which they cross with deliberate care. En-Joo, distinguishable by his khaki hat, and Diaz, who has a shirt draped over his hair for protection, continue onward. Resting against a tree, partially concealed by the encroaching vines, is a dull gray object, bullet-shaped with fins at one end, which catches Lewis's attention and he regards it with wariness, while the rest of the mercenaries, undeterred, proceed past the object, paying it little heed. As they advance, they pass by the ominous mouth of a cave set against a craggy mountainside; inside, a small group of anxious locals comprising women, children, and elderly men casts uneasy glances outward, and though the mercenaries continue moving, En-Joo, Reese, and Diaz each take a moment, looking back at the locals with expressions of cautious acknowledgment. Upon reaching the village paddy field, the water, despite being clear, reveals pale brown mud beneath its surface with plant stalks jutting into the air and trees mirrored in the water. Within its depths lies the decomposing corpse of a human, partially submerged, with a dead buffalo further beyond, while BN and the mercenaries stand on the periphery of the field, surveying the macabre scene. More grim discoveries await at the field's edge, where Reese, overcome by the stench, presses his shirt against his nose, and a woman's severed head dangles grotesquely from a post. As Lewis turns to observe, his gaze is arrested by the sight of two bodies hanging from the bare rafters of a ruined hut. The boy, in a decision that suggests understanding, nods and then departs, leaving the mercenaries to make a cautious note of the devastated village, their mood one of wary vigilance as they take in the aftermath of the destruction."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The volunteer looks down at Rambo's boat, observing Lewis at the stern gesturing toward himself for Rambo's attention, which Rambo dismisses with a glare before turning to spit into the river as Lewis departs in disgust. School Boy, rugged and handsome, glances at Rambo from his position. Meanwhile, at a night-time military camp, a truck is stationed near two rows of huts. In a pigsty cell, Sarah looks through floorboards at the commander, who takes a drag from his cigarette, smirks, and walks away, leaving Sarah to rest her head against the prison wall. As the boat navigates a promontory without headlamps, Lewis leans thoughtfully on the prow and exchanges a glance with Rambo before looking away. They dock at the harbor where Michael's party was dropped; the mercenaries disembark, armed with weapons and bandoleers. As Rambo ascends the gangplank, two rebels approach. The mercenaries, joined by BN the rebel and the boy tracker, proceed into the forest, with Rambo watching solemnly before returning to the boat. BN and the boy guide the group through forest undergrowth. School Boy's rifle is notably large, and they cross a small stream. En-Joo sports a khaki hat, and Diaz hides his hair under a shirt. Lewis observes a bullet-shaped, finned object warily as the others disregard it and continue. They pass a cave with anxious locals—women, children, and elderly men—inside, briefly glancing back as they move on. At a village paddy field, the water is clear but reveals muddy earth and tree reflections, alongside a decomposing corpse and dead buffalo. The mercenaries, overlooking the field, witness more corpses at its edge. Reese covers his nose from the stench, noting a woman's severed head hanging from a post, while Lewis surveys two bodies suspended from rafters in a dilapidated hut. The boy nods and departs as the mercenaries cautiously document the devastated village."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The volunteer looks down on Rambo's boat where Lewis, a former intelligence officer now working as a freelance operative, stands in the stern with his back to Rambo. Lewis, trying to assert his role as leader of the operation, points to himself and looks at Rambo, who ignores him with the stoicism for which he is well-known. Rambo fixes him a glare but remains expressionless, a tactic he often uses to maintain an air of authority, then turns away and spits into the river, a broad, winding waterway known for its perilous currents, before staring ahead again as Lewis walks away in disgust. Handsome and rugged School Boy, a marksman known for his sharp shooting, glances up the boat at Rambo. The military camp at night has a truck sitting at the end of two rows of huts, which are hastily constructed shelters used by the soldiers stationed there. In the pigsty cell, Sarah, who was captured while delivering medical supplies to local villages, looks up through the floorboards into the hut where the commander appears. The commander, with a short, neat mustache that seems out of place given the harsh conditions, takes a pull on one of his ever-present cigarettes, which are a rare commodity in these remote areas, blows smoke, smirks, and walks away as Sarah rests her head against the rough wooden wall of her prison. On the river, the boat rounds a promontory, a high point of land that juts into the water, with its headlamps off to avoid detection. Lewis leans pensively on the boat's prow, turns to look at the stern, and Rambo stares back at him, a master at reading the intentions of others, before Lewis turns away. The boat pulls alongside the harbor where Michael's party were dropped, a location known for its strategic importance in smuggling activities, and the mercenaries disembark laden with various weapons and bandoleers, including automatic rifles with telescopic sights favored for their long-range accuracy. Two rebels, members of a local resistance group fighting against the oppressive military regime, approach along the path leading to the gangplank as Rambo walks up the gangplank. The party of mercenaries, BN the rebel, and the boy tracker set off into the dense forest, navigating through terrain fraught with dangers, while Rambo solemnly watches them go, his experience as a seasoned operator evident in his composed demeanor, turns away, and walks back to the boat. BN and the boy lead the mercenaries through forest undergrowth as School Boy's rifle, a specially modified sniper rifle, is particularly bulky, and they cross a small stream, its waters surprisingly clear despite the surrounding chaos. En-Joo wears a khaki hat to shield himself from the sun, and Diaz has a shirt covering his hair, a makeshift effort to blend into the surroundings. Resting against a tree and partially covered in vines is a dull gray object, an unexploded ordnance from a past conflict, bullet-shaped but with fins at one end, which Lewis regards warily, while the rest of the mercenaries, perhaps desensitized by experience, pay the bomb little attention and move on. They pass a cave mouth on a craggy mountainside where inside there's a small collection of nervous-looking locals, comprising women, children, and old men, likely displaced refugees hiding from ongoing violent confrontations, and the mercenaries move on as En-Joo, Reese, and Diaz each give the locals a backward glance. At the village paddy field, where rice is cultivated, the water is clear but there is pale brown mud beneath it, with sticks of plant poking into the air and trees reflected in the water's surface. A decomposing human corpse lies partially submerged in the water with a dead buffalo beyond it, suggestive of a recent attack, as BN and the mercenaries overlook the field. More corpses lie at the edge of the field, and Reese holds his shirt against his nose to ward off the stench of decay, as a woman's severed head hangs from a post, a grim warning to others. Lewis turns to look, and there are two bodies hanging from bare rafters in the remains of a hut, remnants of the latest atrocity. The boy nods and leaves, moving with the practiced agility of someone familiar with the terrain, and the mercenaries make a wary record of the ruined village, each considering the perilous road ahead."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The volunteer looks down on Rambo's boat where Lewis stands in the stern with his back to Rambo. Lewis points to himself and looks at Rambo who ignores him. Rambo fixes him a glare but remains expressionless then turns away and spits into the river before staring ahead again as Lewis walks away in disgust. Handsome and rugged School Boy glances up the boat at Rambo. The military camp at night has a truck sitting at the end of two rows of huts. In the pigsty cell Sarah looks up through the floorboards into the hut where the commander appears with a short neat mustache takes a pull on one of his everpresent cigarettes blows smoke smirks and walks away as Sarah rests her head against the wall of her prison. On the river the boat rounds a promontory with its headlamps off. Lewis leans pensively on the boat's prow turns to look at the stern and Rambo stares back at him before Lewis turns away. The boat pulls alongside the harbor where Michael's party were dropped and the mercenaries disembark laden with various weapons and bandoleers including automatic rifles with telescopic sights. Two rebels approach along the path leading to the gangplank as Rambo walks up the gangplank. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. The party of mercenaries BN the rebel and the boy tracker set off into the forest while Rambo solemnly watches them go turns away and walks back to the boat. BN and the boy lead the mercenaries through forest undergrowth as School Boy's rifle is particularly bulky and they cross a small stream. EnJoo wears a khaki hat and Diaz has a shirt covering his hair. Resting against a tree and partially covered in vines is a dull gray object bulletshaped but with fins at one end which Lewis regards warily while the rest of the mercenaries pay the bomb little attention and move on. They pass a cave mouth on a craggy mountainside where inside there is a small collection of nervouslooking locals comprising women children and old men and the mercenaries move on as EnJoo Reese and Diaz each give the locals a backward glance. At the village paddy field the water is clear but there is pale brown mud beneath it with sticks of plant poking into the air and trees reflected in the water's surface. A decomposing human corpse lies partially submerged in the water with a dead buffalo beyond it as BN and the mercenaries overlook the field. More corpses lie at the edge of the field and Reese holds his shirt against his nose as a woman's severed head hangs from a post. Lewis turns to look and there are two bodies hanging from bare rafters in the remains of a hut. The boy nods and leaves and the mercenaries make a wary record of the ruined village."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The volunteer looks down on Rambo's boat where Lewis stands in the stern with his back to Rambo. Lewis points to himself and looks at Rambo who ignores him. Rambo fixes him a glare but remains expressionless then turns away and spits into the river before staring ahead again as Lewis walks away in disgust. Handsome and rugged School Boy glances up the boat at Rambo. The military camp at night has a truck sitting at the end of two rows of huts. In the pigsty cell Sarah looks up through the floorboards into the hut where the commander appears with a short neat mustache takes a pull on one of his everpresent cigarettes blows smoke smirks and walks away as Sarah rests her head against the wall of her prison. On the river the boat rounds a promontory with its headlamps off. Lewis leans pensively on the boat's prow turns to look at the stern and Rambo stares back at him before Lewis turns away. The boat pulls alongside the harbor where Michael's party were dropped and the mercenaries disembark laden with various weapons and bandoleers including automatic rifles with telescopic sights. Two rebels approach along the path leading to the gangplank as Rambo walks up the gangplank. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. The party of mercenaries BN the rebel and the boy tracker set off into the forest while Rambo solemnly watches them go turns away and walks back to the boat. BN and the boy lead the mercenaries through forest undergrowth as School Boy's rifle is particularly bulky and they cross a small stream. EnJoo wears a khaki hat and Diaz has a shirt covering his hair. Resting against a tree and partially covered in vines is a dull gray object bulletshaped but with fins at one end which Lewis regards warily while the rest of the mercenaries pay the bomb little attention and move on. They pass a cave mouth on a craggy mountainside where inside there is a small collection of nervouslooking locals comprising women children and old men and the mercenaries move on as EnJoo Reese and Diaz each give the locals a backward glance. At the village paddy field the water is clear but there is pale brown mud beneath it with sticks of plant poking into the air and trees reflected in the water's surface. A decomposing human corpse lies partially submerged in the water with a dead buffalo beyond it as BN and the mercenaries overlook the field. More corpses lie at the edge of the field and Reese holds his shirt against his nose as a woman's severed head hangs from a post. Lewis turns to look and there are two bodies hanging from bare rafters in the remains of a hut. The boy nods and leaves and the mercenaries make a wary record of the ruined village."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The volunteer looks down on Rambo's boat where Lewis stands in the stern with his back to Rambo. Lewis points to himself and looks at Rambo who ignores him. Rambo fixes him a glare but remains expressionless then turns away and spits into the river before staring ahead again as Lewis walks away in disgust. Handsome and rugged School Boy glances up the boat at Rambo. The military camp at night has a truck sitting at the end of two rows of huts. At the village paddy field the water is clear but there is pale brown mud beneath it with sticks of plant poking into the air and trees reflected in the water's surface. A decomposing human corpse lies partially submerged in the water with a dead buffalo beyond it as BN and the mercenaries overlook the field. More corpses lie at the edge of the field and Reese holds his shirt against his nose as a woman's severed head hangs from a post. Lewis turns to look and there are two bodies hanging from bare rafters in the remains of a hut. The boy nods and leaves and the mercenaries make a wary record of the ruined village."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The volunteer looks down on Rambo's boat where Lewis stands in the stern with his back to Rambo. Lewis points to himself and looks at Rambo who ignores him. Lewis turns to look and there are two bodies hanging from bare rafters in the remains of a hut. The boy nods and leaves and the mercenaries make a wary record of the ruined village."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The tourist glances down on Geraldine's canoe where Stanley lounges in the bow with his face to Geraldine. Stanley gestures to his shoes and grins at Geraldine, who dismisses him. Geraldine throws him a wink but stays indifferent, then turns around and whistles into the ocean before glancing back again as Stanley strolls away in boredom. Gentle and robust Office Worker peers down the canoe at Geraldine. The wildlife reserve at dawn has a bicycle parked at the start of four rows of tents. In the library cell, Maria peers down through the ceiling beams into the tent where the janitor arrives, with a long, bushy beard, takes a swig from one of his ever-present flasks, exhales loudly, chuckles, and strolls away as Maria rests her foot against the corner of her cage. On the ocean, the canoe rounds a peninsula with its lanterns ablaze. Stanley reclines thoughtfully on the canoe's bridge, turns to smile at the bow, and Geraldine grins back at him before Stanley gazes away. The canoe drifts alongside the pier where Henry's picnic was held, and the tourists disembark loaded with various souvenirs and backpacks, including selfie sticks with panoramic lenses. Two travelers approach along the trail leading to the gangplank as Geraldine skips up the gangplank. The picnic of tourists, XY the traveler, and the girl guide set off into the meadow while Geraldine amusingly observes them leave, spins around, and waltzes back to the canoe. XY and the girl guide the tourists through meadow undergrowth as Office Worker's backpack is particularly massive, and they wade across a tiny pond. Cameron wears a plaid cap, and Riley has a scarf concealing his neck. Resting against a boulder and partially covered in moss is a shiny yellow object, arrow-shaped but with propellers at one end, which Stanley examines curiously, while the rest of the tourists ignore the kite and stroll onward. They pass a cliff face on a rocky hillside where inside there's a small gathering of joyful-looking locals, comprising merchants, musicians, and teachers, and the tourists march onward as Cameron, Alex, and Riley each cast the locals a sideways look. At the orchard rice field, the foliage is lush but there is rich crimson clay beneath it, with clumps of flowers poking into the sky and clouds mirrored on the foliage's surface. An abandoned cattle pen lies partly concealed in the grass with a live sheep beside it, as XY and the tourists overlook the field. More pens sit at the edge of the field, and Alex grips his cap against his mouth as a gardener's painted wheelbarrow leans against a tree. Stanley turns to grin, and there are two flags hanging from sturdy rafters in the remains of a barn. The girl nods and departs, and the tourists make a friendly sketch of the abandoned orchard."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The volunteer observes from Rambo's boat as Lewis, pointing at himself, looks at Rambo who remains indifferent and spits into the river. Rugged School Boy notes the tension. At night, in a military camp, Sarah, imprisoned, watches the commander dismiss her plight. As the boat, with its lights off, rounds a bend, Lewis looks back at Rambo, who meets his gaze. The boat arrives at the harbor, and the mercenaries disembark heavily armed. They and BN the rebel, along with a boy tracker, head into the forest, leaving Rambo to watch solemnly. In the forest, the team crosses a stream, ignoring a suspicious bomb, and glances back at locals hiding in a cave. In a village paddy field, they find corpses, including a woman's severed head and hanging bodies. Lewis takes in the devastation, and the mercenaries record the scene cautiously before moving on."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The boy nods and leaves and the mercenaries make a wary record of the ruined village Lewis turns to look and there are two bodies hanging from bare rafters in the remains of a hut More corpses lie at the edge of the field and Reese holds his shirt against his nose as a woman's severed head hangs from a post A decomposing human corpse lies partially submerged in the water with a dead buffalo beyond it as BN and the mercenaries overlook the field At the village paddy field the water is clear but there is pale brown mud beneath it with sticks of plant poking into the air and trees reflected in the water's surface They pass a cave mouth on a craggy mountainside where inside there is a small collection of nervouslooking locals comprising women children and old men and the mercenaries move on as EnJoo Reese and Diaz each give the locals a backward glance Resting against a tree and partially covered in vines is a dull gray object bulletshaped but with fins at one end which Lewis regards warily while the rest of the mercenaries pay the bomb little attention and move on EnJoo wears a khaki hat and Diaz has a shirt covering his hair BN and the boy lead the mercenaries through forest undergrowth as School Boy's rifle is particularly bulky and they cross a small stream The party of mercenaries BN the rebel and the boy tracker set off into the forest while Rambo solemnly watches them go turns away and walks back to the boat Two rebels approach along the path leading to the gangplank as Rambo walks up the gangplank The boat pulls alongside the harbor where Michael's party were dropped and the mercenaries disembark laden with various weapons and bandoleers including automatic rifles with telescopic sights Lewis leans pensively on the boat's prow turns to look at the stern and Rambo stares back at him before Lewis turns away On the river the boat rounds a promontory with its headlamps off In the pigsty cell Sarah looks up through the floorboards into the hut where the commander appears with a short neat mustache takes a pull on one of his everpresent cigarettes blows smoke smirks and walks away as Sarah rests her head against the wall of her prison The military camp at night has a truck sitting at the end of two rows of huts Handsome and rugged School Boy glances up the boat at Rambo Rambo fixes him a glare but remains expressionless then turns away and spits into the river before staring ahead again as Lewis walks away in disgust Lewis points to himself and looks at Rambo who ignores him The volunteer looks down on Rambo's boat where Lewis stands in the stern with his back to Rambo"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Lewis points to himself and looks at Rambo who ignores him The volunteer looks down on Rambo's boat where Lewis stands in the stern with his back to Rambo Handsome and rugged School Boy glances up the boat at Rambo Rambo fixes him a glare but remains expressionless then turns away and spits into the river before staring ahead again as Lewis walks away in disgust In the pigsty cell Sarah looks up through the floorboards into the hut where the commander appears with a short neat mustache takes a pull on one of his everpresent cigarettes blows smoke smirks and walks away as Sarah rests her head against the wall of her prison The military camp at night has a truck sitting at the end of two rows of huts Lewis leans pensively on the boat's prow turns to look at the stern and Rambo stares back at him before Lewis turns away On the river the boat rounds a promontory with its headlamps off Two rebels approach along the path leading to the gangplank as Rambo walks up the gangplank The boat pulls alongside the harbor where Michael's party were dropped and the mercenaries disembark laden with various weapons and bandoleers including automatic rifles with telescopic sights BN and the boy lead the mercenaries through forest undergrowth as School Boy's rifle is particularly bulky and they cross a small stream The party of mercenaries BN the rebel and the boy tracker set off into the forest while Rambo solemnly watches them go turns away and walks back to the boat Resting against a tree and partially covered in vines is a dull gray object bulletshaped but with fins at one end which Lewis regards warily while the rest of the mercenaries pay the bomb little attention and move on EnJoo wears a khaki hat and Diaz has a shirt covering his hair At the village paddy field the water is clear but there is pale brown mud beneath it with sticks of plant poking into the air and trees reflected in the water's surface They pass a cave mouth on a craggy mountainside where inside there is a small collection of nervouslooking locals comprising women children and old men and the mercenaries move on as EnJoo Reese and Diaz each give the locals a backward glance More corpses lie at the edge of the field and Reese holds his shirt against his nose as a woman's severed head hangs from a post A decomposing human corpse lies partially submerged in the water with a dead buffalo beyond it as BN and the mercenaries overlook the field The boy nods and leaves and the mercenaries make a wary record of the ruined village Lewis turns to look and there are two bodies hanging from bare rafters in the remains of a hut"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The party of mercenaries BN the rebel and the boy tracker set off into the forest while Rambo solemnly watches them go turns away and walks back to the boat BN and the boy lead the mercenaries through forest undergrowth as School Boy's rifle is particularly bulky and they cross a small stream EnJoo wears a khaki hat and Diaz has a shirt covering his hair Resting against a tree and partially covered in vines is a dull gray object bulletshaped but with fins at one end which Lewis regards warily while the rest of the mercenaries pay the bomb little attention and move on They pass a cave mouth on a craggy mountainside where inside there is a small collection of nervouslooking locals comprising women children and old men and the mercenaries move on as EnJoo Reese and Diaz each give the locals a backward glance At the village paddy field the water is clear but there is pale brown mud beneath it with sticks of plant poking into the air and trees reflected in the water's surface A decomposing human corpse lies partially submerged in the water with a dead buffalo beyond it as BN and the mercenaries overlook the field More corpses lie at the edge of the field and Reese holds his shirt against his nose as a woman's severed head hangs from a post Lewis turns to look and there are two bodies hanging from bare rafters in the remains of a hut The boy nods and leaves and the mercenaries make a wary record of the ruined village The volunteer looks down on Rambo's boat where Lewis stands in the stern with his back to Rambo Lewis points to himself and looks at Rambo who ignores him Rambo fixes him a glare but remains expressionless then turns away and spits into the river before staring ahead again as Lewis walks away in disgust Handsome and rugged School Boy glances up the boat at Rambo The military camp at night has a truck sitting at the end of two rows of huts In the pigsty cell Sarah looks up through the floorboards into the hut where the commander appears with a short neat mustache takes a pull on one of his everpresent cigarettes blows smoke smirks and walks away as Sarah rests her head against the wall of her prison On the river the boat rounds a promontory with its headlamps off Lewis leans pensively on the boat's prow turns to look at the stern and Rambo stares back at him before Lewis turns away The boat pulls alongside the harbor where Michael's party were dropped and the mercenaries disembark laden with various weapons and bandoleers including automatic rifles with telescopic sights Two rebels approach along the path leading to the gangplank as Rambo walks up the gangplank"
        }
      ]
    }
  ]
}