{
  "ground_truth": "Ben's smart saloon pulls up outside an olive green clapboard house with a white picket fence. A black and white Great Dane stands barking at him in the garden. Ben gets out of the car, and locks it with a remote. Dressed in a smart suit and tie, Ben goes to the fence but stops short and stares at the dog. A neighbor who is gardening spots him. Ben parks on an upper story of a car park, which looks onto St. Matthew Medical Center. Ben enters the center and goes to a blonde middle-aged woman on the reception desk. Ben's in a lift. He stands aside as two doctors wearing stethoscopes get in with him. Ben holds back the door. Emily gets in. They all face the front. Then Ben turns and studies Emily for a long moment. His expression concerned. Emily, who is slender and wearing a nightdress, gets out of the lift and walks listlessly down a hospital corridor. Ben waits and stops the lift door closing with the briefcase he's carrying. He gets out of the lift and follows Emily at a discreet distance. He stops at double doors and looks through the glass panes in them. He sees Emily, who is wearing UGG boots with her nighty, shuffle down onto a ward. Ben follows her. Emily's image blurs. She passes a reception desk, then rounds a corner and disappears. Ben approaches the desk. Ben smiles and gives the stout nurse a brief wave as he heads away. His smile fades as he walks. A clip attached to Emily's forefinger attaches her to an electrocardiograph machine. 30-something Emily lies asleep in her hospital bed in shadowy light. Ben stands in the doorway watching her intently. His expression sad. As she stirs, Ben makes a swift but calm exit. Emily glimpses him. She sits up and stares after him. Emily frowns and looks puzzled. Ben's car is parked in the dark, wet night. He sits at the wheel, deep in solemn thought as the wipers sweep back and forth. Ben addresses colleagues in a small conference room at Apogee Aeronautics. He points to a rocket model. Ben checks a message on his BlackBerry. Ben drives a Corvette sports car. He enters the beach house and puts down his things. She's on the patio, looking out to sea. Ben lies lethargically on his couch, staring at his mobile phone on the coffee table. He picks the mobile up. Ben snaps his mobile shut and throws it down. Ben drives his saloon along the sunny coast road from the beach house. He pulls up in a parking spot outside a large institutional-looking building with the stars and stripes hanging over the door.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Ben's clever sedan pulls up outside an olive drab clapboard dwelling with a white picket barricade. A black and white Great Dane stands barking at him in the yard. Ben gets out of the automobile, and locks it with a remote. Dressed in a sharp suit and tie, Ben goes to the barricade but stops short and stares at the hound. A neighbor who is tending spots him. Ben parks on an upper level of a car garage, which looks onto St. Matthew Medical Center. Ben enters the center and goes to a fair-haired middle-aged woman on the reception desk. Ben's in an elevator. He stands aside as two physicians wearing stethoscopes get in with him. Ben holds back the door. Emily gets in. They all face the front. Then Ben turns and studies Emily for a long instant. His expression worried. Emily, who is slender and wearing a nightdress, gets out of the elevator and walks listlessly down a hospital corridor. Ben waits and stops the elevator door closing with the briefcase he's carrying. He gets out of the elevator and follows Emily at a discreet distance. He stops at double portals and looks through the glass panes in them. He sees Emily, who is wearing UGG boots with her nighty, shuffle down onto a ward. Ben follows her. Emily's image blurs. She passes a reception desk, then rounds a corner and disappears. Ben approaches the desk. Ben smiles and gives the stout nurse a brief wave as he heads away. His smile fades as he walks. A clip attached to Emily's forefinger attaches her to an electrocardiograph machine. 30-something Emily lies asleep in her hospital bunk in shadowy light. Ben stands in the doorway watching her intently. His expression sorrowful. As she stirs, Ben makes a swift but calm exit. Emily glimpses him. She sits up and stares after him. Emily frowns and looks puzzled. Ben's automobile is parked in the dark, wet night. He sits at the wheel, deep in solemn thought as the wipers sweep back and forth. Ben addresses colleagues in a small conference room at Apogee Aeronautics. He points to a rocket replica. Ben checks a message on his BlackBerry. Ben drives a Corvette sports car. He enters the beach residence and puts down his things. She's on the patio, looking out to sea. Ben lies lethargically on his couch, staring at his mobile communication device on the coffee table. He picks the mobile up. Ben snaps his mobile shut and throws it down. Ben drives his sedan along the sunny coast road from the beach dwelling. He pulls up in a parking spot outside a large institutional-looking structure with the stars and stripes hanging over the door."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A smart saloon belonging to Ben is pulled up outside an olive green clapboard house with a white picket fence. A black and white Great Dane is heard barking at him in the garden. The car is exited by Ben, and it is locked with a remote by him. Dressed in a smart suit and tie, Ben stops short at the fence and stares at the dog. He is spotted by a neighbor who is gardening. On an upper story of a car park, which looks onto St. Matthew Medical Center, Ben parks. The center is entered by Ben, and he approaches a blonde middle-aged woman on the reception desk. In a lift, Ben stands aside as two doctors wearing stethoscopes enter with him. The door is held back by Ben. Emily enters. They all face the front. Then, Emily is studied for a long moment by Ben, who is concerned. Wearing a nightdress, slender Emily exits the lift and walks listlessly down a hospital corridor. Waiting and stopping the lift door closing with the briefcase he is carrying, Ben exits the lift and follows Emily at a discreet distance. Stopping at double doors, he looks through the glass panes in them. He sees Emily, who is wearing UGG boots with her nighty, shuffle onto a ward. She is followed by Ben. Her image blurs. After passing a reception desk, then rounding a corner, Emily disappears. Approaching the desk, Ben smiles and gives the stout nurse a brief wave as he heads away. His smile fades as he walks. Emily's forefinger is attached to a clip that connects her to an electrocardiograph machine. Lying asleep in shadowy light in her hospital bed is 30-something Emily. Watching her intently from the doorway, Ben stands with a sad expression. As she stirs, a swift but calm exit is made by Ben. She glimpses him, sits up, and stares after him. Emily frowns and looks puzzled. Parked in the dark, wet night is Ben's car. He sits at the wheel, deep in solemn thought as the wipers sweep back and forth. Colleagues are addressed by Ben in a small conference room at Apogee Aeronautics. A rocket model is pointed to by him. A message is checked on his BlackBerry by Ben. A Corvette sports car is driven by Ben. His things are put down as he enters the beach house. She's on the patio, looking out to sea. Lying lethargically on his couch, staring at his mobile phone on the coffee table, is Ben. The mobile is picked up by him. Ben snaps his mobile shut and throws it down. His saloon is driven along the sunny coast road from the beach house. A parking spot outside a large institutional-looking building with the stars and stripes hanging over the door is pulled up to by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Ben's smart saloon stops outside an olive green clapboard house with a white picket fence. A black and white Great Dane barks at him in the garden. Ben exits the car, locking it remotely. In a smart suit and tie, he approaches the fence but pauses to stare at the dog. A gardening neighbor notices him. Ben parks on an upper floor of a car park overlooking St. Matthew Medical Center. Inside, he approaches a blonde middle-aged receptionist. In a lift, Ben steps aside for two doctors with stethoscopes, holding the door for Emily. They all face forward, then Ben studies Emily intently, concerned. Slender Emily, in a nightdress and UGG boots, exits the lift and walks listlessly down a hospital corridor. Ben follows, stopping at double doors to watch Emily shuffle onto a ward. Her image blurs as she passes a reception desk and disappears. Ben approaches the desk, briefly waves at a stout nurse, then his smile fades as he walks away. Emily, with an electrocardiograph clip on her finger, sleeps in a shadowy hospital bed. Ben watches from the doorway, sad. As Emily stirs, he leaves swiftly but calmly. She glimpses him and sits up puzzled. Ben's car is parked in the dark, wet night, and he sits inside, deep in thought as wipers sweep. At Apogee Aeronautics, Ben addresses colleagues, pointing to a rocket model and checking his BlackBerry. Driving a Corvette, he enters the beach house and puts down his belongings. On the patio, she's looking out to sea. Ben lies lethargically on the couch, staring at his mobile, then snaps it shut and throws it down. He drives his saloon along a sunny coast road from the beach house, parking outside a large institutional building with stars and stripes over the door."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Ben's smart saloon parks outside an olive green house with a picket fence. A Great Dane barks at him. Ben, in a suit and tie, locks his car with a remote, stares at the dog, then parks near St. Matthew Medical Center. He enters and approaches a blonde woman at reception. In a lift, Ben sees two doctors join him before Emily enters. Concerned, he studies her briefly. Emily, in a nightdress, exits and walks down the corridor. Ben discreetly follows her, watching through ward doors, then follows as she disappears around a corner. At a reception desk, he waves to a nurse, then sees Emily, connected to an ECG, asleep. Watching her intently, he exits as she stirs. Emily glimpses him, puzzled. Later, Ben, deep in thought, sits in his car at night. At Apogee Aeronautics, he presents to colleagues, then checks his BlackBerry. Driving a Corvette, he reaches a beach house, lies on the couch staring at his phone, then throws it down. Driving again, he parks outside a large building with the stars and stripes."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Ben’s sleek and smart saloon car smoothly pulls up to a stop outside a quaint olive green clapboard house, which is charmingly bordered by a pristine white picket fence. In the neatly kept garden, a large black and white Great Dane is standing, energetically barking at him. Ben steps out of his car with a sense of purpose and securely locks it using a remote. He is impeccably dressed in a polished suit and tie. Ben approaches the fence but suddenly halts, being momentarily captivated by the sight of the dog. Meanwhile, a neighbor engaged in gardening happens to notice him. \n\nBen then parks his car on a higher level of a parking structure which provides a clear overlook onto St. Matthew Medical Center. With determined steps, Ben enters the medical center and makes his way over to the reception desk, where a blonde, middle-aged woman is seated. He is now in an elevator. Courteously, Ben steps aside as two doctors, who are distinguishably wearing stethoscopes around their necks, enter and join him. Ben, showing his considerate nature, holds back the elevator door. Emily steps in. Together they all face forward. Yet, Ben turns his head and intently studies Emily for a lengthy, significant moment, his face etched with concern. \n\nEmily, who appears slender and is dressed in a nightdress, exits the elevator and walks down the hospital corridor in a listless manner. Ben, ensuring not to lose sight of her, prevents the elevator doors from closing by using the briefcase he is carrying as leverage. He exits the lift and maintains a discreet distance as he follows Emily. When he reaches the double doors, he pauses and peers through the glass panes. Through the panes, he observes Emily, notably wearing UGG boots with her nightdress, as she shuffles into a ward. Ben continues his pursuit of her. Emily’s image begins to blur as she moves past a reception desk, turns a corner, and ultimately vanishes from view. \n\nGathering himself, Ben approaches the desk and with a polite smile, briefly waves to the stout nurse before moving on. As he walks away, his friendly smile gradually fades. Meanwhile, in the muted shadows of a hospital room, a clip attached to Emily’s forefinger is connected to an electrocardiograph machine. Emily, in her thirties, rests asleep in her hospital bed, surrounded by shadowy light. Ben stands quietly in the doorway, watching her with unwavering intensity, his expression tinged with sadness. As Emily starts to stir, Ben makes a swift yet calm exit, although Emily manages to catch a glimpse of him. She sits up, staring after him, a frown creasing her face as she looks puzzled. \n\nOutside, Ben’s car is parked under the dark, wet night sky. He sits solemnly at the wheel, lost in deep thoughts as the windshield wipers rhythmically sweep back and forth. At Apogee Aeronautics, Ben addresses his colleagues in a small, focused conference room, pointing to a detailed model of a rocket. Ben checks a message on his BlackBerry with a thoughtful expression. Later, Ben drives a sleek Corvette sports car. He enters his beach house and sets down his belongings. There, she stands on the patio, gazing out contemplatively to the endless sea. Ben lies languidly on his couch, his eyes fixated on his mobile phone resting on the coffee table. After a moment, he picks it up, then decisively snaps it shut and throws it down. \n\nIn another moment, Ben is driving his saloon along the sunlit coast road, departing from the serene beach house. He pulls into a parking space outside a large, imposing institutional building, marked by the presence of the stars and stripes waving proudly above the entrance door."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Ben's sleek and smart saloon car, with its elegant design and shiny exterior, smoothly glides to a complete stop outside a quaint, olive green clapboard house. This charming abode is attractively bordered by a pristine white picket fence that adds to its allure. In the immaculately kept garden, a large black and white Great Dane stands alert, energetically barking at him in a spirited manner. With a sense of purpose, Ben steps out of his car and securely locks it using a remote, ensuring its safety. He is impeccably dressed in a polished suit and tie, exuding professionalism. As Ben approaches the fence, he suddenly comes to a halt, momentarily captivated by the majestic sight of the dog. Meanwhile, a neighbor, who is engrossed in gardening activities, happens to notice him from afar.\n\nAfterward, Ben parks his car on a higher level of a multi-story parking structure, where the elevation provides a clear overlook onto the sprawling grounds of St. Matthew Medical Center. With determined steps, Ben confidently enters the medical center and purposefully makes his way over to the reception desk, where a blonde, middle-aged woman is attentively seated. Soon, Ben finds himself inside an elevator. Courteously, he steps aside as two doctors, who are distinguishably wearing stethoscopes around their necks as a mark of their profession, enter and join him in the lift. Displaying his considerate nature, Ben holds back the elevator door to accommodate them. Emily steps in at this moment. Together, they all face forward. Yet, Ben turns his head and intently studies Emily for a lengthy, significant moment, with his face etched with concern.\n\nEmily, who appears slender and delicate, is dressed in a nightdress and exits the elevator, walking down the hospital corridor in a listless, almost absent-minded manner. Ben, determined not to lose sight of her, uses the briefcase he is carrying as leverage to prevent the elevator doors from closing. He exits the lift promptly and maintains a discreet distance as he follows Emily through the hospital. When he reaches the double doors, he pauses and peers through the glass panes. His eyes fixate on Emily, notably observing her wearing UGG boots with her nightdress, as she shuffles quietly into a ward. With steady resolve, Ben continues his pursuit of her. Emily's image begins to blur slightly as she moves past a reception desk, turns a corner, and ultimately vanishes from view.\n\nGathering his composure, Ben approaches the desk and with a polite smile, briefly waves to the stout nurse seated there before moving on. As he walks away, his friendly smile gradually fades, replaced by a more somber expression. Meanwhile, in the muted shadows of a hospital room, a clip attached to Emily’s forefinger is connected to an electrocardiograph machine, monitoring her vital signs. Emily, who appears to be in her thirties, rests asleep in her hospital bed, surrounded by the shadowy light that filters into the room. Ben stands quietly in the doorway, watching her with unwavering intensity, his expression tinged with a profound sadness. As Emily starts to stir, Ben makes a swift yet calm exit, although Emily manages to catch glimpses of him. She sits up, staring after him, a frown creasing her face as she looks puzzled by his sudden departure.\n\nOutside, Ben's car is parked under the expansive dark, wet night sky. He sits solemnly at the wheel, lost deep in thought as the windshield wipers rhythmically sweep back and forth across the glass. At Apogee Aeronautics, Ben addresses his colleagues in a small, focused conference room, pointing to a detailed model of a rocket with precision. With a thoughtful expression on his face, Ben checks a message on his BlackBerry. Later, Ben drives a sleek Corvette sports car, its powerful engine purring as he maneuvers it skillfully. He enters his beach house and sets down his belongings carefully. There, she stands on the patio, gazing contemplatively out to the endless sea, lost in her own reflections. Ben lies languidly on his couch, his eyes fixated on his mobile phone resting on the coffee table. After a moment of contemplation, he picks it up, then decisively snaps it shut and throws it back down with a sense of finality.\n\nIn another moment, Ben is driving his saloon along the sunlit coast road, departing from the serene tranquility of his beach house. He pulls into a parking space outside a large, imposing institutional building, marked by the presence of the stars and stripes waving proudly and boldly above the entrance door."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Ben's smart saloon comes to a gradual halt outside an olive green clapboard house adorned with a pristine white picket fence. As the car quiets, a black and white Great Dane in the garden begins to bark at him with enthusiasm. Ben opens the car door with a swift motion, steps out onto the pavement, and with a click of his remote key, locks the vehicle. He is clad in a smart suit and tie, presenting a crisp and polished appearance. Ben walks towards the fence, but as he nears it, he halts abruptly, his attention captured by the dog, which he observes intently. Just then, a neighbor engaged in gardening notices Ben's presence. Later, Ben maneuvers his car to rest on an upper story of a parking structure, where it overlooks the expansive St. Matthew Medical Center. Transitioning from his car, Ben makes his way into the center and approaches a blonde middle-aged woman stationed at the reception desk, indicating his intent to communicate. The scene shifts to Ben standing in a lift, where he courteously steps aside to allow two doctors, identifiable by the stethoscopes around their necks, to join him. As they settle, Ben uses his briefcase to keep the lift doors ajar, allowing Emily to step inside. Together, they all face the front of the lift, but then Ben subtly turns his attention toward Emily, scrutinizing her with a concerned expression. Emily, appearing slender and clad in a nightdress, exits the lift and proceeds down the hospital corridor, her pace slow and listless. Ben remains behind momentarily, ensuring once more that the lift doors stay open with the strategic placement of his briefcase. He then exits the lift and trails Emily at a respectful distance, careful not to intrude. Ben pauses at a pair of double doors, peering through the glass panes to observe Emily, who, now in UGG boots, makes her way towards the ward. Deciding to follow, Ben enters the ward after her. As he does, her figure becomes a blur in his vision as she moves past the reception desk and rounds a corner, vanishing from sight. Undeterred, Ben walks towards the desk, offering a brief smile and wave to a stout nurse before he turns away, his smile fading into a more solemn demeanor. Inside a room, Emily lies sleeping in a bed, the dim light casting a shadow over her form. A clip on her forefinger connects her to an electrocardiograph machine. Ben stands quietly in the doorway, gazing at her with an intense, sad expression. As Emily begins to stir, Ben takes his cue to leave, exiting swiftly yet smoothly so as not to disturb her. Emily catches a glimpse of him and, intrigued, sits up in bed, staring in the direction he had gone with a puzzled frown. Cut to outside, Ben's car is parked on a dark, rain-soaked night street. He sits behind the wheel, lost in deep, contemplative thought as the windshield wipers methodically sweep away the falling rain. In a small conference room at Apogee Aeronautics, Ben addresses his colleagues, pointing out specific features on a model rocket with professional expertise. Moments later, Ben glances at a message on his BlackBerry, allowing the screen's glow to illuminate his face briefly. Shifting scenes, Ben is now behind the wheel of a Corvette sports car. He arrives at the beach house, entering with a sense of familiarity, and places his belongings down with a gentle thud. The patio beckons, and he sees her gazing wistfully out to sea. Inside, Ben collapses lethargically onto his couch, his gaze fixed on his mobile phone resting on the coffee table. After a moment's hesitation, he reaches out and picks up the device, only to snap it shut decisively and toss it aside. The narrative resumes with Ben driving his saloon gracefully along a sunlit coastal road, departing from the beach house. He eventually pulls into a designated parking spot outside a large, imposing building, marked by the prominent stars and stripes flag draped above the entrance, signaling its importance."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Ben arrives at an olive green clapboard house with a white picket fence, where a black and white Great Dane barks at him from the garden. Stepping out of his car, Ben, dressed in a smart suit and tie, locks the car remotely and heads towards the fence, but stops to observe the dog, drawing the attention of a gardening neighbor. Ben then moves on to park on an upper story of a garage overlooking St. Matthew Medical Center. Entering the center, he greets a blonde middle-aged woman at the reception desk before stepping into a lift with two doctors. He holds the door for Emily, a slender woman in a nightdress, observing her with concern. As Emily exits the lift and walks down a hospital corridor, Ben discreetly follows, pausing at double doors to watch her shuffle onto a ward.\n\nEmily's image blurs as she passes a reception desk and disappears. Ben approaches the desk, smiling briefly at a stout nurse before his expression fades. Later, Ben watches intently from a doorway as Emily, now asleep in her hospital bed, is attached to an electrocardiograph machine. Stirred by his presence, Emily wakes to glimpse Ben making a calm exit. Puzzled, she sits up and stares after him.\n\nThat night, Ben sits solemnly in his parked car, contemplating as the wipers sweep back and forth. In a small conference room at Apogee Aeronautics, he addresses colleagues, pointing to a rocket model before checking a message on his BlackBerry. Ben drives a Corvette sports car to his beach house, putting down his things before lethargically lying on the couch, staring at his mobile phone. He eventually snaps the phone shut and throws it down, then drives his saloon along the sunny coast road, arriving at a large institutional-looking building with the stars and stripes hanging over the door."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Ben's smart saloon, a sleek vehicle equipped with advanced technology for comfort and efficiency, pulls up outside an olive green clapboard house with a white picket fence, a quintessential symbol of suburban America. A black and white Great Dane, a breed known for its gentle nature despite its imposing size, stands barking at him in the garden. Ben gets out of the car, and locks it with a remote, a common convenience feature in modern vehicles. Dressed in a smart suit and tie, indicative of his professional background, Ben goes to the fence but stops short and stares at the dog, perhaps wary of its size. A neighbor, tending to a small vegetable plot in her garden, spots him. \n\nBen parks on an upper story of a car park, which looks onto St. Matthew Medical Center, a renowned facility known for its research in cardiology. Ben enters the center and goes to a blonde middle-aged woman on the reception desk, who is occupied with scheduling patient appointments. Ben's in a lift. He stands aside as two doctors wearing stethoscopes, indicative of their readiness for quick medical assessments, get in with him. Ben holds back the door. Emily gets in, her appearance and demeanor suggestive of someone recently discharged from intensive care. They all face the front. Then Ben turns and studies Emily for a long moment, his concern evident, perhaps due to her fragile state. Emily, who is slender and wearing a nightdress typical of hospital loungewear, gets out of the lift and walks listlessly down a hospital corridor. Ben waits and stops the lift door closing with the briefcase he's carrying, likely filled with work documents. He gets out of the lift and follows Emily at a discreet distance. He stops at double doors and looks through the glass panes in them. He sees Emily, who is wearing UGG boots with her nighty, shuffle down onto a ward. Ben follows her. Emily's image blurs as she unwittingly heads towards the critical care unit. She passes a reception desk staffed by busy nurses, then rounds a corner and disappears. Ben approaches the desk. Ben smiles and gives the stout nurse a brief wave as he heads away, his mind elsewhere. His smile fades as he walks. \n\nA clip attached to Emily's forefinger attaches her to an electrocardiograph machine, monitoring her heart's electrical activity. 30-something Emily lies asleep in her hospital bed in shadowy light, the regular beep of the machine the only sound. Ben stands in the doorway watching her intently, a silent guardian. His expression is sad, weighed down by concern. As she stirs, Ben makes a swift but calm exit. Emily glimpses him. She sits up and stares after him, confusion lacing her features. Emily frowns and looks puzzled, piecing together the fragments of her memory. Ben's car is parked in the dark, wet night, illuminated only by dimly lit streetlights. He sits at the wheel, deep in solemn thought as the wipers sweep back and forth, clearing away the persistent drizzle. \n\nBen addresses colleagues in a small conference room at Apogee Aeronautics, a leading company in the aerospace industry. He points to a rocket model during a presentation, illustrating a new propulsion design. Ben checks a message on his BlackBerry, a device once ubiquitous in professional settings for its robust email capabilities. Ben drives a Corvette sports car, known for its speed and style—a contrast to his usual sedate vehicle. He enters the beach house, a modern retreat with panoramic views of the ocean, and puts down his things. She's on the patio, looking out to sea, the waves crashing gently against the shore. Ben lies lethargically on his couch, staring at his mobile phone on the coffee table, a reflection of modern-day connectivity and distraction. He picks the mobile up. Ben snaps his mobile shut and throws it down, frustration building. Ben drives his saloon along the sunny coast road from the beach house, the ocean breeze flowing through the open windows. He pulls up in a parking spot outside a large institutional-looking building with the stars and stripes hanging over the door, indicating its governmental or official nature."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Ben enters the center and goes to a blonde middleaged woman on the reception desk Ben's smart saloon pulls up outside an olive green clapboard house with a white picket fence A black and white Great Dane stands barking at him in the garden Ben gets out of the car and locks it with a remote Dressed in a smart suit and tie Ben goes to the fence but stops short and stares at the dog A neighbor who is gardening spots him Ben parks on an upper story of a car park which looks onto St Matthew Medical Center Ben enters the center and goes to a blonde middleaged woman on the reception desk Ben's in a lift She is on the patio looking out to sea He stands aside as two doctors wearing stethoscopes get in with him He picks the mobile up Ben approaches the desk Emily lies asleep in her hospital bed in shadowy light Ben holds back the door Ben's smart saloon pulls up outside an olive green clapboard house with a white picket fence Emily gets in They all face the front Then Ben turns and studies Emily for a long moment His expression concerned A black and white Great Dane stands barking at him in the garden His expression concerned Emily who is slender and wearing a nightdress gets out of the lift and walks listlessly down a hospital corridor Ben waits and stops the lift door closing with the briefcase he is carrying Emily who is slender and wearing a nightdress gets out of the lift and walks listlessly down a hospital corridor He gets out of the lift and follows Emily at a discreet distance He points to a rocket model He stops at double doors and looks through the glass panes in them He sees Emily who is wearing UGG boots with her nighty shuffle down onto a ward Ben follows her He gets out of the lift and follows Emily at a discreet distance Emily's image blurs She passes a reception desk then rounds a corner and disappears Ben approaches the desk Ben snaps his mobile shut and throws it down Ben smiles and gives the stout nurse a brief wave as he heads away His smile fades as he walks A clip attached to Emily's forefinger attaches her to an electrocardiograph machine Ben's in a lift He stops at double doors and looks through the glass panes in them 30something Emily lies asleep in her hospital bed in shadowy light Ben stands in the doorway watching her intently His expression sad A clip attached to Emily's forefinger attaches her to an electrocardiograph machine As she stirs Ben makes a swift but calm exit Emily's image blurs Emily glimpses him Ben follows her She sits up and stares after him Emily frowns and looks puzzled Ben drives a Corvette sports car Ben waits and stops the lift door closing with the briefcase he is carrying He enters the beach house and puts down his things Ben's car is parked in the dark wet night He sits at the wheel deep in solemn thought as the wipers sweep back and forth Ben gets out of the car and locks it with a remote Ben addresses colleagues in a small conference room at Apogee Aeronautics He points to a rocket model Ben checks a message on his BlackBerry Ben drives a Corvette sports car He enters the beach house and puts down his things Ben's car is parked in the dark wet night She is on the patio looking out to sea Ben lies lethargically on his couch staring at his mobile phone on the coffee table Ben parks on an upper story of a car park which looks onto St Matthew Medical Center He picks the mobile up Ben snaps his mobile shut and throws it down He stands aside as two doctors wearing stethoscopes get in with him Ben drives his saloon along the sunny coast road from the beach house He pulls up in a parking spot outside a large institutionallooking building with the stars and stripes hanging over the door"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Ben's smart saloon pulls up outside an olive green clapboard house with a white picket fence. A black and white Great Dane stands barking at him in the garden. Ben gets out of the car and locks it with a remote. Dressed in a smart suit and tie Ben goes to the fence but stops short and stares at the dog. A neighbor who is gardening spots him. Ben parks on an upper story of a car park which looks onto St Matthew Medical Center. Ben enters the center and goes to a blonde middleaged woman on the reception desk. Ben's in a lift. He stands aside as two doctors wearing stethoscopes get in with him. Ben holds back the door. Emily gets in. They all face the front. Then Ben turns and studies Emily for a long moment. His expression concerned. Emily who is slender and wearing a nightdress gets out of the lift and walks listlessly down a hospital corridor. Ben waits and stops the lift door closing with the briefcase he is carrying. He gets out of the lift and follows Emily at a discreet distance. He stops at double doors and looks through the glass panes in them. He sees Emily who is wearing UGG boots with her nighty shuffle down onto a ward. Ben follows her. Emily's image blurs. She passes a reception desk then rounds a corner and disappears. Ben approaches the desk. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. Ben smiles and gives the stout nurse a brief wave as he heads away. His smile fades as he walks. A clip attached to Emily's forefinger attaches her to an electrocardiograph machine. 30something. Emily lies asleep in her hospital bed in shadowy light. Ben stands in the doorway watching her intently. His expression sad. As she stirs Ben makes a swift but calm exit. Emily glimpses him. She sits up and stares after him. Emily frowns and looks puzzled. Ben's car is parked in the dark wet night. He sits at the wheel deep in solemn thought as the wipers sweep back and forth. Ben addresses colleagues in a small conference room at Apogee Aeronautics. He points to a rocket model. Ben checks a message on his BlackBerry. Ben drives a Corvette sports car. He enters the beach house and puts down his things. She is on the patio looking out to sea. Ben lies lethargically on his couch staring at his mobile phone on the coffee table. He picks the mobile up. Ben snaps his mobile shut and throws it down. Ben drives his saloon along the sunny coast road from the beach house. He pulls up in a parking spot outside a large institutionallooking building with the stars and stripes hanging over the door."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Ben's smart saloon pulls up outside an olive green clapboard house with a white picket fence. A black and white Great Dane stands barking at him in the garden. Ben gets out of the car and locks it with a remote. Dressed in a smart suit and tie Ben goes to the fence but stops short and stares at the dog. A neighbor who is gardening spots him. Ben parks on an upper story of a car park which looks onto St Matthew Medical Center. Ben enters the center and goes to a blonde middleaged woman on the reception desk. Ben's in a lift. He stands aside as two doctors wearing stethoscopes get in with him. Ben holds back the door. Emily gets in. They all face the front. Then Ben turns and studies Emily for a long moment. His expression concerned. Emily who is slender and wearing a nightdress gets out of the lift and walks listlessly down a hospital corridor. Ben waits and stops the lift door closing with the briefcase he is carrying. He gets out of the lift and follows Emily at a discreet distance. He stops at double doors and looks through the glass panes in them. He sees Emily who is wearing UGG boots with her nighty shuffle down onto a ward. Ben follows her. Emily's image blurs. She passes a reception desk then rounds a corner and disappears. Ben approaches the desk. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Ben smiles and gives the stout nurse a brief wave as he heads away. His smile fades as he walks. A clip attached to Emily's forefinger attaches her to an electrocardiograph machine. 30something. Emily lies asleep in her hospital bed in shadowy light. Ben stands in the doorway watching her intently. His expression sad. As she stirs Ben makes a swift but calm exit. Emily glimpses him. She sits up and stares after him. Emily frowns and looks puzzled. Ben's car is parked in the dark wet night. He sits at the wheel deep in solemn thought as the wipers sweep back and forth. Ben addresses colleagues in a small conference room at Apogee Aeronautics. He points to a rocket model. Ben checks a message on his BlackBerry. Ben drives a Corvette sports car. He enters the beach house and puts down his things. She is on the patio looking out to sea. Ben lies lethargically on his couch staring at his mobile phone on the coffee table. He picks the mobile up. Ben snaps his mobile shut and throws it down. Ben drives his saloon along the sunny coast road from the beach house. He pulls up in a parking spot outside a large institutionallooking building with the stars and stripes hanging over the door."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Ben's smart saloon pulls up outside an olive green clapboard house with a white picket fence. A black and white Great Dane stands barking at him in the garden. Ben gets out of the car and locks it with a remote. Dressed in a smart suit and tie Ben goes to the fence but stops short and stares at the dog. A neighbor who is gardening spots him. Ben parks on an upper story of a car park which looks onto St Matthew Medical Center. Ben enters the center and goes to a blonde middleaged woman on the reception desk. Ben's in a lift. He stands aside as two doctors wearing stethoscopes get in with him. Ben holds back the door. Emily gets in. They all face the front. He sits at the wheel deep in solemn thought as the wipers sweep back and forth. Ben addresses colleagues in a small conference room at Apogee Aeronautics. He points to a rocket model. Ben checks a message on his BlackBerry. Ben drives a Corvette sports car. He enters the beach house and puts down his things. She is on the patio looking out to sea. Ben lies lethargically on his couch staring at his mobile phone on the coffee table. He picks the mobile up. Ben snaps his mobile shut and throws it down. Ben drives his saloon along the sunny coast road from the beach house. He pulls up in a parking spot outside a large institutionallooking building with the stars and stripes hanging over the door."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Ben's smart saloon pulls up outside an olive green clapboard house with a white picket fence. A black and white Great Dane stands barking at him in the garden. Ben gets out of the car and locks it with a remote. Dressed in a smart suit and tie Ben goes to the fence but stops short and stares at the dog. A neighbor who is gardening spots him. Ben lies lethargically on his couch staring at his mobile phone on the coffee table. He picks the mobile up. Ben snaps his mobile shut and throws it down. Ben drives his saloon along the sunny coast road from the beach house. He pulls up in a parking spot outside a large institutionallooking building with the stars and stripes hanging over the door."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Sarah's smart saloon pulls up outside an olive green clapboard house with a white picket fence. A black and white Great Dane stands barking at her in the garden. Sarah gets out of the car, and locks it with a remote. Dressed in a smart suit and tie, Sarah goes to the fence but stops short and stares at the dog. A neighbor who is gardening spots her. Sarah parks on an upper story of a car park, which looks onto St. Matthew Medical Center. Sarah enters the center and goes to a blonde middle-aged woman on the reception desk. Sarah's in a lift. She stands aside as two doctors wearing stethoscopes get in with her. Sarah holds back the door. Michael gets in. They all face the front. Then Sarah turns and studies Michael for a long moment. Her expression concerned. Michael, who is slender and wearing a nightdress, gets out of the lift and walks listlessly down a hospital corridor. Sarah waits and stops the lift door closing with the briefcase she's carrying. She gets out of the lift and follows Michael at a discreet distance. She stops at double doors and looks through the glass panes in them. She sees Michael, who is wearing UGG boots with his nighty, shuffle down onto a ward. Sarah follows him. Michael's image blurs. He passes a reception desk, then rounds a corner and disappears. Sarah approaches the desk. Sarah smiles and gives the stout nurse a brief wave as she heads away. Her smile fades as she walks. A clip attached to Michael's forefinger attaches him to an electrocardiograph machine. 30-something Michael lies asleep in his hospital bed in shadowy light. Sarah stands in the doorway watching him intently. Her expression sad. As he stirs, Sarah makes a swift but calm exit. Michael glimpses her. He sits up and stares after her. Michael frowns and looks puzzled. Sarah's car is parked in the dark, wet night. She sits at the wheel, deep in solemn thought as the wipers sweep back and forth. Sarah addresses colleagues in a small conference room at Apogee Aeronautics. She points to a rocket model. Sarah checks a message on her BlackBerry. Sarah drives a Corvette sports car. She enters the beach house and puts down her things. He's on the patio, looking out to sea. Sarah lies lethargically on her couch, staring at her mobile phone on the coffee table. She picks the mobile up. Sarah snaps her mobile shut and throws it down. Sarah drives her saloon along the sunny coast road from the beach house. She pulls up in a parking spot outside a large institutional-looking building with the stars and stripes hanging over the door."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Ben's sleek train pulls up outside a lavender brick mansion with a wrought iron gate. A brown and white terrier stands barking at him in the courtyard. Ben gets out of the train, and locks it with a keypad. Dressed in a smart suit and tie, Ben goes to the gate but stops short and stares at the terrier. A neighbor who is mowing the lawn spots him. Ben parks on the rooftop of a garage, which looks onto St. Matthew Wellness Retreat. Ben enters the retreat and goes to a brunette middle-aged woman at the concierge desk. Ben's in an escalator. He stands aside as two nurses wearing name tags get in with him. Ben holds back the door. Emily gets in. They all face the front. Then Ben turns and studies Emily for a long moment, his expression concerned. Emily, who is slender and wearing a sundress, gets out of the escalator and walks listlessly down a clinic hallway. Ben waits and stops the escalator door closing with the backpack he's carrying. He gets out of the escalator and follows Emily at a discreet distance. He stops at sliding doors and looks through the acrylic panels in them. He sees Emily, who is wearing flip-flops with her dress, shuffle down onto a lounge. Ben follows her. Emily's image blurs. She passes a check-in desk, then rounds a corner and disappears. Ben approaches the desk. Ben smiles and gives the tall assistant a brief wave as he heads away. His smile fades as he walks. A band attached to Emily's wrist connects her to a heart monitor. 30-something Emily lies asleep in her clinic bed in shadowy light. Ben stands in the doorway watching her intently, his expression sad. As she stirs, Ben makes a swift but calm exit. Emily glimpses him. She sits up and stares after him. Emily frowns and looks puzzled. Ben's train is parked in the dark, wet night. He sits at the wheel, deep in solemn thought as the wipers sweep back and forth. Ben addresses colleagues in a small meeting room at Apogee Aerospace. He points to a satellite model. Ben checks a message on his pager. Ben drives a convertible sports car. He enters the lake house and puts down his things. She's on the deck, looking out to the mountains. Ben lies lethargically on his hammock, staring at his tablet on the ottoman. He picks the tablet up. Ben snaps his tablet shut and throws it down. Ben drives his train along the sunny hillside road from the lake house. He pulls up in a parking spot outside a large institutional-looking structure with the state flag hanging over the door."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Ben's smart saloon cruises past an olive green clapboard house with a white picket fence. A black and white Great Dane sits howling at him in the garden. Ben hops out of the car, and unlocks it with a remote. Dressed in a smart suit and tie, Ben approaches the fence but turns back and glances at the dog. A neighbor who is jogging notices him. Ben reverses on an upper story of a car park, which overlooks St. Matthew Medical Center. Ben exits the center and approaches a blonde middle-aged woman on the reception desk. Ben's in a lift. He leans aside as two doctors wearing stethoscopes enter with him. Ben pushes back the door. Emily stands close. They all face the front. Then Ben rotates and gazes at Emily for a long moment. His expression confused. Emily, who is slender and wearing a nightdress, jumps out of the lift and skips listlessly down a hospital corridor. Ben watches and holds the lift door open with the briefcase he's carrying. He steps out of the lift and trails Emily at an obvious distance. He pauses at double doors and peers through the glass panes in them. He spots Emily, who is wearing UGG boots with her nighty, waltz down onto a ward. Ben shadows her. Emily's image sharpens. She passes a reception desk, then turns a corner and vanishes. Ben approaches the desk. Ben frowns and gives the stout nurse a quick nod as he heads away. His expression brightens as he walks. A clip attached to Emily's forefinger links her to an electrocardiograph machine. 30-something Emily lies awake in her hospital bed in shadowy light. Ben stands in the doorway watching her cautiously. His expression blank. As she stirs, Ben makes a hasty but relaxed departure. Emily catches sight of him. She sits up and glances after him. Emily smiles and looks curious. Ben's car is parked in the bright, dry day. He sits at the wheel, deep in cheerful thought as the wipers stand still. Ben consults colleagues in a small conference room at Apogee Aeronautics. He gestures to a rocket model. Ben writes a message on his BlackBerry. Ben rides a Corvette sports car. He exits the beach house and picks up his things. She's on the patio, looking out to sea. Ben stands restlessly on his couch, gazing at his mobile phone on the coffee table. He drops the mobile down. Ben snaps his mobile open and places it down. Ben rolls his saloon along the misty coast road from the beach house. He stops in a parking spot outside a large institutional-looking building with the stars and stripes sagging over the door."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Tom's ancient locomotive pulls up outside a lavender brick lighthouse with a blue electric gate. A crimson and gold unicorn stands meowing at her in the orchard. Tom steps out of the plane, and locks it with a wrench. Clad in an elegant gown and cap, Tom goes to the gate but stops short and peers at the cat. An astronaut who is fishing spots her. Tom lands on a lower deck of a bike rack, which looks onto St. Jerome Swimming Pool. Tom enters the pool and goes to a brunette young man on the information booth. Tom's in a tractor. She stands aside as two bakers wearing capes get in with her. Tom holds back the window. Oliver gets in. They all face the back. Then Tom turns and examines Oliver for a long moment. Her expression bewildered. Oliver, who is stocky and wearing a jumpsuit, gets out of the tractor and wanders briskly down a library aisle. Tom waits and stops the window closing with the backpack she's carrying. She gets out of the tractor and follows Oliver at a reluctant distance. She stops at sliding doors and looks through the cherry wood panels in them. She sees Oliver, who is wearing sneakers with his jumpsuit, glide down onto a deck. Tom follows him. Oliver's outline blurs. He passes a coffee machine, then rounds a pillar and vanishes. Tom approaches the machine. Tom grins and gives the tall chef a brief salute as she heads away. Her grin dissolves as she walks. A bracelet attached to Oliver's thumb attaches him to a polygraph device. 40-something Oliver lies awake in his gymnasium cot in radiant light. Tom stands in the window watching him intensely. Her expression joyful. As he yawns, Tom makes a slow but clumsy exit. Oliver glimpses her. He sits up and glares after her. Oliver smiles and looks amazed. Tom's locomotive is parked in the bright, dry morning. She sits at the yoke, deep in ecstatic thought as the mirrors sweep left and right. Tom addresses musicians in a large ballroom at Zenith Zoologicals. She points to a comet sculpture. Tom checks a voice mail on her pager. Tom rides a Mustang bicycle. She enters the mansion tent and places down her items. He's on the roof, looking up at stars. Tom lies vigorously on her rug, staring at her pager on the sideboard. She picks the pager up. Tom flips her pager open and launches it down. Tom rides her locomotive along the foggy mountain track from the mansion tent. She pulls up in a rest stop outside a tiny historical-looking cabin with the union jack hanging over the archway."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Jessica's quirky tricycle rolls up outside a cherry red stone cottage with a bamboo gate. A calico cat lounges purring at her in the garden. Jessica hops off the tricycle and secures it with a padlock. Clad in a colorful scarf and sweater, Jessica approaches the gate but hesitates and gazes at the cat. A passerby who is painting notices her. Jessica cycles on a lower level of a parking structure, which overlooks St. Luke Educational Center. Jessica enters the center and approaches a brunette elderly gentleman at the information counter. Jessica's in an elevator. She steps aside as two nurses holding clipboards enter with her. Jessica holds open the door. Michael enters. They all face the back. Then Jessica turns and observes Michael for a brief instant. Her expression curious. Michael, who is broad-shouldered and wearing a bathrobe, exits the elevator and ambles aimlessly down a hospital hallway. Jessica hesitates and blocks the elevator door from closing with the backpack she's holding. She exits the elevator and tails Michael at a careful length. She pauses at swinging doors and peers through the circular windows. She sees Michael, who is wearing sneakers with his robe, amble onto a wing. Jessica pursues him. Michael's form wavers. He bypasses an information desk, then navigates a junction and vanishes. Jessica moves toward the desk. Jessica grins and gives the tall doctor a quick salute as she proceeds away. Her grin diminishes as she strolls. A band coiled around Michael's pinky fuses him to an echocardiogram device. Middle-aged Michael reclines dozing in his hospital bed in dim lighting. Jessica stands in the entryway observing him thoughtfully. Her expression pensive. As he stirs, Jessica executes a brisk but composed departure. Michael notices her. He rises and gazes after her. Michael knits his brows and looks perplexed. Jessica's tricycle is parked in the dim, drizzly evening. She relaxes on the seat, engrossed in contemplative reverie as the raindrops cascade down. Jessica engages with teammates in a compact meeting space at Zenith Robotics. She gestures toward a satellite prototype. Jessica reviews a notification on her iPhone. Jessica rides a Mustang bicycle. She steps into the cabin and sets down her stuff. He's on the terrace, gazing toward the horizon. Jessica reclines lazily on her armchair, contemplating her laptop on the coffee stand. She picks the laptop up. Jessica clicks it shut and tosses it aside. Jessica maneuvers her tricycle along the breezy mountain path from the cabin. She halts in a parking bay outside a towering modern-looking structure with a flag fluttering above the entrance."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Ben's intelligent elephant stops outside a lilac striped igloo with a red rope fence. A polka-dotted toucan stands squawking at him in the field. Ben jumps out of the rollerblades and tosses them with a frisbee. Dressed in a vibrant poncho and beret, Ben approaches the fence but hesitates and gawks at the toucan. A neighbor who is fishing notices him. Ben parachutes onto a rooftop of a treehouse, which overlooks St. Timothy's Aquarium. Ben enters the aquarium and heads to a brunette teenage boy at the ticket booth. Ben's on a conveyor belt. He steps aside as two chefs wearing aprons join him. Ben pushes open the window. Emily slides in. They all face the walls. Then Ben turns and examines Emily for a lengthy moment. His expression intrigued. Emily, who is athletic and wearing a bathrobe, slides off the conveyor belt and dances lethargically down a museum hallway. Ben lingers and wedges the conveyor door with the umbrella he's holding. He rolls off the conveyor belt and trails Emily at a respectful distance. He pauses at swinging gates and peers through the marble carvings in them. He observes Emily, who is wearing roller skates with her bathrobe, trip onto a balcony. Ben mirrors her movement. Emily's form sharpens. She passes a ticket booth, then rounds a column and vanishes. Ben strides to the booth. Ben grins and gives the thin attendant a tiny salute as he strides off. His grin falters as he strolls. A ribbon affixed to Emily's pinky links her to a kaleidoscope. 30-something Emily rests awake in her hammock under flickering candlelight. Ben hovers in the porch watching her curiously. His expression contemplative. As she twitches, Ben makes a slow but serene entrance. Emily glimpses him. She stands up and gazes after him. Emily furrows her brow and appears baffled. Ben's submarine is docked in the bright, dry day. He reclines at the helm, absorbed in cheerful thought as the propellers whirl round and round. Ben speaks to classmates in a spacious library at Zenith Zoology. He gestures to an asteroid model. Ben glances at a notification on his pager. Ben maneuvers a yacht. He enters the mountain cabin and sets down his belongings. She's on the veranda, gazing out to desert. Ben sprawls energetically on his hammock, glaring at his typewriter on the ottoman. He snatches the typewriter up. Ben slams his typewriter shut and launches it. Ben maneuvers his elephant along the snowy mountain road from the cabin. He stops in a parking alcove outside a small festive-looking cottage with a sunflower wreath resting on the door."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Trent's curious bicycle coasts up outside an azure castle made of cobblestone with a silver iron gate. A purple and pink flamingo stands meowing at him in the forest. Trent springs out of the boat and secures it with a lasso. Clad in a striped cloak and helmet, Trent approaches the gate but halts abruptly and squints at the bird. A villager who is cooking discovers him. Trent glides on a floating island of an amusement park, which overlooks St. George Art Gallery. Trent saunters into the gallery and strides to a red-haired young man behind a lemonade stand. Trent's in a raft. He steps aside as two artists sporting paintbrushes climb aboard with him. Trent releases the rope. Sophie climbs aboard. They all glance to the horizon. Then Trent pivots and examines Sophie for a long minute. His expression anxious. Sophie, who is robust and wearing a cloak, departs the raft and wanders energetically through a museum hallway. Trent lingers and catches the raft's rope from securing with the violin he's carrying. He hops off the raft and trails Sophie at a cautious pace. He pauses at revolving doors and peers through the crystal panels in them. He spots Sophie, who is wearing roller skates with her gown, glide down into a studio. Trent trails her. Sophie's silhouette blurs. She drifts past a lemonade stand, then curves around a hedge and vanishes. Trent nears the booth. Trent grins and gives the lanky gardener a quick nod as he wanders away. His grin diminishes as he strolls. A ring fastened to Sophie's pinky binds her to a kaleidoscope. 40-something Sophie lies awake in her gallery alcove in luminous glow. Trent rests in the threshold observing her closely. His expression wistful. As she shifts, Trent makes a quick but serene retreat. Sophie spies him. She rises up and gazes after him. Sophie scowls and appears bewildered. Trent's bicycle is docked in the bright, dry day. He lounges on the saddle, deep in playful musing as the bells ring periodically. Trent instructs companions in a grand ballroom at Zenith Zoologics. He gestures to a lion statue. Trent verifies a note on his pager. Trent pedals a unicycle. He enters the mountain cabin and drops his belongings. She's on the veranda, gazing out to the valley. Trent sulks languidly on his hammock, peering at his digital watch on the mantle. He lifts the watch. Trent flicks his watch closed and tosses it aside. Trent paddles his bicycle down the stormy riverbank from the cabin. He glides into a docking space outside a massive cathedral-like structure with the union jack fluttering over the entrance."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Ben arrives at an olive green house in a smart saloon and is greeted by a barking Great Dane. After parking near St. Matthew Medical Center, he enters and heads to a lift with two doctors. He notices Emily, a slender woman in a nightdress, and discreetly follows her through the hospital. Emily, wearing UGG boots, eventually disappears around a corner. Ben smiles at a nurse but then looks sad as he watches Emily in her hospital bed attached to an ECG machine. When Emily stirs, he leaves quickly, and she notices him, puzzled. Later, Ben sits solemnly in his car at night and is seen at Apogee Aeronautics, pointing to a rocket model. He checks his BlackBerry, drives a Corvette, and enters a beach house. On the patio, he eventually lies on a couch, contemplating his mobile phone but snaps it shut in frustration. The next day, he drives his saloon along a sunny coast road to a large institutional building adorned with the stars and stripes."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He pulls up in a parking spot outside a large institutionallooking building with the stars and stripes hanging over the door Ben drives his saloon along the sunny coast road from the beach house Ben snaps his mobile shut and throws it down He picks the mobile up Ben lies lethargically on his couch staring at his mobile phone on the coffee table She is on the patio looking out to sea He enters the beach house and puts down his things Ben drives a Corvette sports car Ben checks a message on his BlackBerry He points to a rocket model Ben addresses colleagues in a small conference room at Apogee Aeronautics He sits at the wheel deep in solemn thought as the wipers sweep back and forth Ben's car is parked in the dark wet night Emily frowns and looks puzzled She sits up and stares after him Emily glimpses him As she stirs Ben makes a swift but calm exit His expression sad Ben stands in the doorway watching her intently Emily lies asleep in her hospital bed in shadowy light 30something A clip attached to Emily's forefinger attaches her to an electrocardiograph machine His smile fades as he walks Ben smiles and gives the stout nurse a brief wave as he heads away Ben approaches the desk She passes a reception desk then rounds a corner and disappears Emily's image blurs Ben follows her He sees Emily who is wearing UGG boots with her nighty shuffle down onto a ward He stops at double doors and looks through the glass panes in them He gets out of the lift and follows Emily at a discreet distance Ben waits and stops the lift door closing with the briefcase he is carrying Emily who is slender and wearing a nightdress gets out of the lift and walks listlessly down a hospital corridor His expression concerned Then Ben turns and studies Emily for a long moment They all face the front Emily gets in Ben holds back the door He stands aside as two doctors wearing stethoscopes get in with him Ben's in a lift Ben enters the center and goes to a blonde middleaged woman on the reception desk Ben parks on an upper story of a car park which looks onto St Matthew Medical Center A neighbor who is gardening spots him Dressed in a smart suit and tie Ben goes to the fence but stops short and stares at the dog Ben gets out of the car and locks it with a remote A black and white Great Dane stands barking at him in the garden Ben's smart saloon pulls up outside an olive green clapboard house with a white picket fence"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "His expression sad Ben smiles and gives the stout nurse a brief wave as he heads away His smile fades as he walks Emily gets in She passes a reception desk then rounds a corner and disappears Ben holds back the door As she stirs Ben makes a swift but calm exit Ben checks a message on his BlackBerry Then Ben turns and studies Emily for a long moment Dressed in a smart suit and tie Ben goes to the fence but stops short and stares at the dog He sits at the wheel deep in solemn thought as the wipers sweep back and forth A neighbor who is gardening spots him Ben lies lethargically on his couch staring at his mobile phone on the coffee table 30something They all face the front Emily frowns and looks puzzled Ben stands in the doorway watching her intently He pulls up in a parking spot outside a large institutionallooking building with the stars and stripes hanging over the door He sees Emily who is wearing UGG boots with her nighty shuffle down onto a ward Emily glimpses him Ben drives his saloon along the sunny coast road from the beach house She sits up and stares after him Ben addresses colleagues in a small conference room at Apogee Aeronautics A clip attached to Emily's forefinger attaches her to an electrocardiograph machine Emily's image blurs Ben approaches the desk Ben drives a Corvette sports car He picks the mobile up Ben's smart saloon pulls up outside an olive green clapboard house with a white picket fence Ben follows her He gets out of the lift and follows Emily at a discreet distance She is on the patio looking out to sea His expression concerned He points to a rocket model Ben snaps his mobile shut and throws it down Ben gets out of the car and locks it with a remote Emily lies asleep in her hospital bed in shadowy light Ben parks on an upper story of a car park which looks onto St Matthew Medical Center Ben's car is parked in the dark wet night Ben enters the center and goes to a blonde middleaged woman on the reception desk He stands aside as two doctors wearing stethoscopes get in with him Emily who is slender and wearing a nightdress gets out of the lift and walks listlessly down a hospital corridor Ben waits and stops the lift door closing with the briefcase he is carrying He stops at double doors and looks through the glass panes in them A black and white Great Dane stands barking at him in the garden Ben's in a lift He enters the beach house and puts down his things"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "His smile fades as he walks A clip attached to Emily's forefinger attaches her to an electrocardiograph machine 30something Emily lies asleep in her hospital bed in shadowy light Ben stands in the doorway watching her intently His expression sad As she stirs Ben makes a swift but calm exit Emily glimpses him She sits up and stares after him Emily frowns and looks puzzled Ben's car is parked in the dark wet night He sits at the wheel deep in solemn thought as the wipers sweep back and forth Ben addresses colleagues in a small conference room at Apogee Aeronautics He points to a rocket model Ben checks a message on his BlackBerry Ben drives a Corvette sports car He enters the beach house and puts down his things She is on the patio looking out to sea Ben lies lethargically on his couch staring at his mobile phone on the coffee table He picks the mobile up Ben snaps his mobile shut and throws it down Ben drives his saloon along the sunny coast road from the beach house He pulls up in a parking spot outside a large institutionallooking building with the stars and stripes hanging over the door Ben's smart saloon pulls up outside an olive green clapboard house with a white picket fence A black and white Great Dane stands barking at him in the garden Ben gets out of the car and locks it with a remote Dressed in a smart suit and tie Ben goes to the fence but stops short and stares at the dog A neighbor who is gardening spots him Ben parks on an upper story of a car park which looks onto St Matthew Medical Center Ben enters the center and goes to a blonde middleaged woman on the reception desk Ben's in a lift He stands aside as two doctors wearing stethoscopes get in with him Ben holds back the door Emily gets in They all face the front Then Ben turns and studies Emily for a long moment His expression concerned Emily who is slender and wearing a nightdress gets out of the lift and walks listlessly down a hospital corridor Ben waits and stops the lift door closing with the briefcase he is carrying He gets out of the lift and follows Emily at a discreet distance He stops at double doors and looks through the glass panes in them He sees Emily who is wearing UGG boots with her nighty shuffle down onto a ward Ben follows her Emily's image blurs She passes a reception desk then rounds a corner and disappears Ben approaches the desk Ben smiles and gives the stout nurse a brief wave as he heads away"
        }
      ]
    }
  ]
}