{
  "ground_truth": "A bald boy in a dressing gown and pajamas spots Ben, who smiles and nods before briefly returning to his reading. Ben takes a paper cup, sucks on the straw, and observes the boys and a woman, who smiles as she watches the boys. The bald boy glances shyly at Ben and then looks down. Behind them, in Ben's line of sight, Emily sits at a table by a window. Ben resumes reading. Emily, in a short strappy dress over a vest top, approaches Ben's table, glances at the bald boy, and speaks, prompting Ben to get out his ID. Ben smiles, puts Emily's files back in his briefcase, and leaves with a polite smile while Emily remains at the table, looking drained and dejected. A blue and white neon sign for the Travel Inn glows in the night as Ben arrives in his saloon outside the motel, gets out, and goes to the reception window. He goes to look through an open door, where a pudgy bearded guy spots him and comes out from behind a lacy curtain. Ben returns to the reception window where the guy greets him, then lets himself into a dark room, carrying his cases, placing his keys on a table, and shutting the door. In dim lamp light, Ben sits on his bed, takes a book and a file filled with newspaper cuttings out of his bag, and studies the first cutting intently, beneath which are photos of the seven people killed. Ben watches an ice hockey practice where two players collide and fight. Elsewhere, Emily puts the phone down, scans the room, opens French windows, and goes outside, shocked to find Ben feeding Duke. Duke pulls her, then pulls Ben. Emily gets a container out of her fridge while Ben studies documents. Emily stares astonished at him, brow furrowed, as he stares down at the table they're sitting at. She fiddles with her collar, while he smiles good-humoredly and considers. Once again, Emily looks astounded as Ben grins and looks down, and she blinks, taken aback, as the decision sinks in. Ben gets up, and they share a lingering look. He smiles broadly and heads out while Emily ponders. He turns back, and Emily walks up to him, as he stares at her with sad, gentle eyes, raising his eyebrows before looking serious. She stares at Ben and blinks as he gives an awkward, white-toothed grin and makes for the front door. They hold each other's gaze.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A hairless lad in a robe and sleepwear notices Ben, who grins and inclines before momentarily reverting to his perusal. Ben grabs a paper vessel, sips on the tube, and watches the lads and a woman, who grins as she observes the lads. The hairless lad peeks bashfully at Ben and then gazes downward. Beyond them, in Ben's line of view, Emily perches at a desk by a pane. Ben recommences perusal. Emily, in a brief strappy frock over a sleeveless top, advances to Ben's desk, peeks at the hairless lad, and communicates, prompting Ben to extract his identification. Ben grins, places Emily's dossiers back in his attaché, and departs with a courteous grin while Emily stays at the desk, appearing exhausted and crestfallen. A cerulean and ivory neon emblem for the Travel Inn gleams in the darkness as Ben arrives in his sedan outside the motel, exits, and proceeds to the reception pane. He proceeds to peer through an ajar door, where a chubby bearded fellow notices him and emerges from behind a lace drape. Ben reverts to the reception pane where the fellow welcomes him, then admits himself into a dim chamber, bearing his luggage, placing his keys on a desk, and closing the door. In faint lamp light, Ben perches on his cot, retrieves a volume and a dossier stuffed with periodical clippings out of his satchel, and scrutinizes the initial clipping intently, beneath which are images of the seven individuals slain. Ben observes an ice hockey drill where two participants collide and brawl. Elsewhere, Emily places the receiver down, surveys the chamber, opens French panes, and steps outside, astonished to discover Ben nourishing Duke. Duke tugs her, then tugs Ben. Emily retrieves a container out of her refrigerator while Ben examines documents. Emily gazes amazed at him, brow creased, as he gazes down at the desk they're seated at. She manipulates her neckline, while he grins good-humoredly and contemplates. Once more, Emily appears astounded as Ben beams and gazes down, and she flutters her eyelids, stunned, as the decision dawns. Ben rises, and they exchange a lingering glance. He beams broadly and strides out while Emily reflects. He turns back, and Emily strides up to him, as he gazes at her with wistful, gentle eyes, elevating his brows before appearing solemn. She gazes at Ben and flutters her eyelids as he bestows an uneasy, white-toothed grin and heads for the entrance. They maintain each other's stare."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A bald boy in a dressing gown and pajamas is spotted by Ben, who smiles and nods before his reading is briefly returned to. A paper cup is taken by Ben, the straw is sucked on by him, and the boys and a woman are observed, who watches the boys as she smiles. Ben is glanced at shyly by the bald boy, who then looks down. Behind them, in Ben's line of sight, a table by a window is occupied by Emily. Ben's reading is resumed. Emily, in a short strappy dress over a vest top, is approached by Ben's table, the bald boy is glanced at by her, and she prompts Ben to get out his ID by speaking. Emily's files are put back in his briefcase by Ben, who then leaves with a polite smile, while the table is remained at by Emily, looking drained and dejected. The Travel Inn is illuminated in the night by a blue and white neon sign as Ben arrives in his saloon outside the motel, gets out, and the reception window is approached by him. An open door is looked through by him, where he is spotted by a pudgy bearded guy, who comes out from behind a lacy curtain. The reception window is returned to by Ben, where the guy greets him, then Ben lets himself into a dark room, carrying his cases, the keys are placed on a table by him, and the door is shut. In dim lamp light, Ben sits on his bed, a book and a file filled with newspaper cuttings are taken out of his bag by him, and the first cutting is studied intently beneath which photos of the seven people killed are laid. An ice hockey practice is watched by Ben, where two players collide and fight. Elsewhere, the phone is put down by Emily, the room is scanned by her, French windows are opened, and outside is gone by her, shocked to find Duke being fed by Ben. She is pulled by Duke, then Ben is pulled. A container is gotten out of the fridge by Emily while documents are studied by Ben. Emily stares astonished at him, her brow furrowed, as the table they're sitting at is stared down at by him. Her collar is fiddled with by her while he smiles good-humoredly and considers. Once again, Emily looks astounded as Ben grins and looks down, and she blinks, taken aback, as the decision sinks in. Ben gets up, and a lingering look is shared by them. He smiles broadly and heads out while pondering is done by Emily. He turns back, and Emily walks up to him, as she is stared at by him with sad, gentle eyes, his eyebrows are raised before looking serious. Ben is stared at by her, and she blinks as an awkward, white-toothed grin is given by him, and the front door is made for. Each other's gaze is held by them."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A bald boy in pajamas notices Ben, who smiles and briefly resumes reading. Ben sips from a paper cup, observing the boys and a woman who smiles. The bald boy shyly glances at Ben and looks down. Emily sits in Ben’s view at a table by a window. Ben reads, while Emily approaches, glances at the boy, and prompts Ben to show his ID. Smiling, Ben returns Emily's files to his briefcase and departs with a polite smile, leaving Emily drained. A Travel Inn neon sign glows as Ben arrives at the motel, exits his saloon, and approaches the reception. Inside, a pudgy, bearded guy notices Ben and greets him at the window. Ben enters a dark room, places his keys on a table, and sits on the bed under a dim lamp, examining newspaper cuttings about seven victims. Ben watches an ice hockey practice with players colliding and fighting. Elsewhere, Emily hangs up the phone, opens French windows, and is surprised to find Ben feeding Duke. She retrieves a container from the fridge as Ben studies documents. Emily stares at him, brow furrowed, while he smiles. Astonished, she fiddles with her collar, and Ben grins. They share a look; he smiles broadly and leaves, with Emily pondering. He turns back, and she approaches him. Ben stares with sad eyes, raises his eyebrows, then looks serious. She blinks as he gives a white-toothed grin and heads for the door, their gazes locked."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A bald boy in pajamas sees Ben, who nods and returns to reading. Ben sips from a paper cup, observes the boys and a smiling woman. The boy shyly glances at Ben and looks down. Behind them, Emily sits by a window. Emily, in a strappy dress, approaches Ben, prompting him to show his ID. Ben smiles, packs Emily's files, and leaves politely as Emily remains looking drained. A neon sign glows as Ben arrives at a motel, exits his saloon, and checks the reception. A bearded guy spots him and greets him. Ben enters a dark room, places his keys on a table, and studies newspaper cuttings about seven deaths under dim light. Ben watches ice hockey players fight. Emily hangs up the phone, opens windows, and sees Ben feeding Duke. Duke pulls them both. Emily retrieves a container from her fridge while Ben reads documents. She stares at him, puzzled, as he smiles and considers. Emily looks astounded as Ben grins, and she blinks as the decision sinks in. Ben stands, they share a look, and he leaves with a smile while Emily ponders. He turns back, and Emily approaches, as he looks at her with sad eyes. She stares as Ben grins awkwardly and heads for the door, sharing a lingering gaze."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In a quiet, dimly lit room, a young boy with a bald head, dressed in a simple dressing gown and cozy pajamas, catches sight of Ben. Ben, with a slight nod and a warm smile, acknowledges the boy before momentarily turning his attention back to the book he was reading. Taking a moment, Ben reaches for a paper cup, gently placing his lips around the straw, and takes a sip as he observes the boys and a woman nearby. The woman, with a gentle smile, watches the boys with affection. The bald boy momentarily looks at Ben with a shy glance, then quickly averts his eyes downward. Just behind them, within Ben's field of vision, Emily is seated at a table near a window. With a calm demeanor, Ben resumes his reading. \n\nEmily, dressed in a short, strappy dress layered over a vest top, makes her way toward Ben's table. She casts a glance in the direction of the bald boy before initiating a conversation with Ben, which leads him to take out his ID. With a friendly smile, Ben carefully places Emily's files back into his briefcase, offers a courteous smile, and departs, leaving Emily sitting at the table, appearing noticeably drained and dejected. Outside, a blue and white neon sign for the Travel Inn shines brightly in the night, casting an inviting glow as Ben pulls up in his saloon car to the motel. Stepping out, he makes his way to the reception window. Peeking through an open door, he notices a pudgy, bearded gentleman who spots Ben and emerges from behind a translucent, lacy curtain. Ben goes back to the reception window, where the man greets him, and then he lets himself into a dark room. Inside, with deliberate movements, Ben carries his cases, places his keys gently on a table, and closes the door behind him.\n\nIn the soft, dim lighting of a bedside lamp, Ben sits on his bed and takes out a book along with a file brimming with newspaper cuttings from his bag. He studies the first cutting with keen interest, under which are photographs showing the seven individuals who were killed. Later, Ben is seen watching an ice hockey practice, where two players collide with each other and engage in a physical fight. Meanwhile, in another place, Emily hangs up the phone, surveys the room around her, opens the French windows, and steps outside, only to be taken aback by the sight of Ben feeding Duke. Duke, with playful energy, tugs at her and then tugs at Ben. Emily retrieves a container from her fridge, all the while Ben remains deeply engrossed in studying his documents. Emily gazes at him in utter disbelief, her brow furrowed in confusion, as he looks intently down at the table where they are seated.\n\nShe absentmindedly fiddles with her collar, while Ben, with a good-natured smile, reflects on the situation. Once more, Emily appears utterly astonished, looking at Ben as he grins and gazes down. She blinks, visibly taken aback as the reality of the situation becomes apparent to her. Ben stands up, and they exchange a look that lingers between them. He offers a wide, genuine smile and makes his way out, while Emily is lost in thought. Just then, he turns back, and Emily approaches him. Ben looks at her with eyes filled with both sadness and gentleness, raising his eyebrows slightly before adopting a more serious expression. She fixes her gaze on Ben, blinking as he gives her an awkward smile, revealing his white teeth, and begins to head towards the front door. They maintain eye contact, holding each other’s gaze in a silent, meaningful exchange."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In a room filled with a quiet and softly dimmed light, a young boy, his head completely bald, is comfortably dressed in a simple dressing gown and cozy pajamas. He notices Ben and locks eyes with him. Ben, with a subtle nod accompanied by a warm and friendly smile, acknowledges the boy’s presence momentarily before directing his focus back to the book he was in the midst of reading. Taking a brief pause, Ben reaches for a paper cup, gently wraps his lips around the straw, and takes a thoughtful sip, all while observing the boys and a nearby woman with a gentle and affectionate smile directed at them. The bald boy steals a shy glance at Ben, but soon after, his eyes dart downward. Just behind them, within Ben's line of sight, Emily is seated at a table situated near the window. With a demeanor that exudes calmness, Ben resumes his reading, immersing himself once again in the pages before him.\n\nEmily, stylishly dressed in a short, strappy dress layered over a vest top, makes her way gracefully toward Ben's table. She casts a quick glance toward the bald boy before initiating a conversation with Ben, which prompts him to remove his ID carefully. With a friendly and amiable smile, Ben neatly places Emily's files back inside his briefcase, flashes a courteous smile, and leaves her sitting at the table, where she remains, looking noticeably drained and dejected. Outside, a bright blue and white neon sign bearing the name Travel Inn shines luminously in the night, casting an inviting glow as Ben arrives in his sleek saloon car at the motel. He steps out and makes his way confidently to the reception window. As he peers through an open door, he notices a pudgy, bearded gentleman who, upon spotting Ben, emerges from behind a translucent, lacy curtain. Ben returns to the reception window, where the man greets him, and then Ben allows himself entry into a dark room. Once inside, with deliberate and careful movements, Ben carries his cases, gently places his keys on a table, and closes the door behind him with a sense of finality.\n\nIn the soothing, soft dimness of a bedside lamp’s glow, Ben sits on his bed and begins to take out a book along with a file brimming with newspaper clippings from his bag. He examines the first clipping with intense concentration, beneath which are photographs showing the seven individuals who were killed. Later, Ben is observed watching an ice hockey practice session, where two players collide dramatically and engage in a physical fight. Meanwhile, elsewhere, Emily hangs up the phone, surveys the room surrounding her, flings open the French windows, and steps outside, only to be taken aback by the unexpected sight of Ben feeding Duke. Duke, exuding playful energy, playfully tugs at her and then turns to tug at Ben. Emily retrieves a container from her fridge, all the while Ben remains deeply engrossed in his examination of the documents before him. Emily looks at him with utter disbelief, her brow furrowed in confusion and amazement, as he looks intently down at the table where they both are seated.\n\nShe absentmindedly fiddles with her collar, while Ben, with a good-natured smile, seems to be reflecting on the situation. Once more, Emily is seen appearing utterly astonished, fixing her gaze on Ben as he sits, grinning and looking downward. She blinks, clearly taken aback as the reality of the situation starts becoming apparent to her. Ben stands up, and they exchange a lingering look that carries an unspoken understanding between them. He offers a wide, genuine smile as he begins to make his way out, leaving Emily lost in her thoughts. At that moment, he turns back, and Emily makes her approach toward him. Ben looks at her with eyes filled with both sadness and gentleness, raising his eyebrows ever so slightly before adopting a more serious expression. She fixes her gaze intently on Ben, blinking as he gives her an awkward smile, revealing his white teeth, and he begins to head towards the front door. They maintain eye contact, their gazes locked in a silent, significant exchange that speaks volumes."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A bald boy, dressed in a dressing gown and pajamas, notices Ben. As their eyes meet, Ben offers a warm smile and a nod of acknowledgment before momentarily returning his focus to his reading material. Engaged in his activity, Ben reaches for a paper cup, bringing the straw to his lips. He takes a moment to sip while simultaneously observing the boys around him and a woman, who stands nearby, her eyes fixed on the boys with a gentle smile. The bald boy, catching Ben's gaze, reacts with a shy glance before diverting his eyes downward. Behind the lively scene, and directly within Ben's line of sight, sits Emily at a table situated by a window. With his attention wavering, Ben returns to his reading. Emily, dressed in a short strappy dress layered over a vest top, rises from her seat and approaches Ben's table. Her eyes briefly flicker towards the bald boy before she addresses Ben, prompting him to retrieve his ID. He complies with a smile, neatly replacing Emily's files back into his briefcase, and gets up to leave, maintaining a polite smile as he departs, leaving Emily at the table looking drained and dejected. In the stillness of night, a blue and white neon sign for the Travel Inn glows vividly as Ben arrives in his saloon car, parking it outside the motel. He steps out, making his way towards the reception window. Pausing, he peers through an open door, where a pudgy, bearded man notices him from behind a lacy curtain and steps forward. Ben then returns to the reception window where the man greets him. Subsequently, Ben enters a dimly lit room, carrying his cases inside. He places his keys on a table and closes the door behind him. Under the soft glow of a lamp, Ben seats himself on his bed, drawing a book and a file filled with newspaper cuttings from his bag. He studies the first cutting with intense focus, underneath which lay photographs of the seven people who were killed. The scene shifts to an ice hockey practice that Ben watches, his attention caught as two players collide and engage in a fight. Meanwhile, elsewhere, Emily ends a phone call and surveys her surroundings, eventually opening the French windows to step outside, only to be shocked by the sight of Ben feeding Duke. The dog, Duke, eagerly pulls Emily, then shifts his attention to pulling Ben. Emily, gathering her thoughts, retrieves a container from her fridge while Ben delves into studying documents. She watches him in astonishment, her brow furrowed, as he peers down at the table they share. Nervously adjusting her collar, she finds herself captivated by his good-humored smile and contemplative demeanor. Once more, Emily's expression turns to one of amazement as Ben grins and glances down, a moment that takes her by surprise as the weight of their decision begins to set in. Rising from his seat, Ben and Emily exchange a meaningful, lingering look. With a broad smile, Ben departs while Emily remains, lost in thought. Before long, Ben turns back, prompting Emily to approach him, and they lock eyes. His gaze, sad and gentle, contrasts with his raised eyebrows and eventual serious expression. Emily's stare remains fixed on Ben, and she blinks as he offers an awkward but endearing white-toothed grin, making his way towards the front door. As he moves to leave, their eyes remain clasped in a shared gaze, conveying a complex mixture of emotions that linger in the air."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A bald boy in a dressing gown and pajamas notices Ben, who acknowledges him with a smile and nod before returning to his reading. Ben drinks from a paper cup and observes the boys and a woman smiling at them. The bald boy glances shyly at Ben and looks away. Nearby, Emily sits by a window, and Ben resumes his reading. Emily, wearing a short strappy dress over a vest top, approaches Ben’s table, briefly acknowledges the bald boy, and converses with Ben, prompting him to show his ID. Ben smiles, returns Emily’s files to his briefcase, and exits with a polite smile, leaving Emily appearing drained and dejected at the table. As night falls, a blue and white neon sign for the Travel Inn glows while Ben arrives in his car, exits, and approaches the reception window. He peers through an open door until a pudgy bearded man notices him from behind a curtain. Ben returns to the window where the man greets him, then enters a dark room, placing his keys on a table and shutting the door. In the dim light, Ben sits on his bed, takes a book and a file filled with newspaper cuttings from his bag, and studies the first cutting intently, which features photos of the seven people killed. Ben later watches an ice hockey practice as two players collide and fight. Elsewhere, Emily hangs up the phone, surveys the room, exits through French windows, and is shocked to find Ben feeding Duke. Duke pulls both her and Ben. Emily retrieves a container from her fridge while Ben carefully studies documents. She stares at him in astonishment, furrowing her brow as he contemplates. Emily remains astounded as Ben grins, looks down, and she processes the situation. Ben stands, and they share a lingering look. He smiles broadly and moves to leave while Emily reflects. He turns back, and she approaches him while he gazes at her with sad, gentle eyes, raising his eyebrows before becoming serious. They exchange looks, and Ben offers an awkward grin before heading to the front door, maintaining eye contact."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A bald boy in a dressing gown and pajamas, likely a hospital patient given his appearance and surroundings, spots Ben, who smiles and nods before briefly returning to his reading. Ben, sitting in a hospital waiting area, takes a paper cup from a nearby vending machine, sucks on the straw, and observes the boys and a woman, probably the boys' mother, who smiles as she watches the boys. The bald boy glances shyly at Ben, perhaps feeling self-conscious, and then looks down. Behind them, in Ben's line of sight, Emily sits at a table by a window, which overlooks the hospital garden. Ben resumes reading. Emily, in a short strappy dress over a vest top suitable for the summer weather, approaches Ben's table, glances at the bald boy with compassion, and speaks, prompting Ben to get out his ID, a security measure in many facilities. Ben smiles, puts Emily's files back in his briefcase, and leaves with a polite smile while Emily remains at the table, looking drained and dejected, perhaps due to the emotional weight of her work. A blue and white neon sign for the Travel Inn, a budget-friendly motel chain often found along highways, glows in the night as Ben arrives in his saloon car outside the motel, gets out, and goes to the reception window, a common feature in such establishments for late-night check-ins. He goes to look through an open door, where a pudgy bearded guy, the motel manager known for greeting guests with a friendly demeanor, spots him and comes out from behind a lacy curtain. Ben returns to the reception window where the guy greets him with a warm welcome, then lets himself into a dark room, carrying his cases, placing his keys on a table, and shutting the door. In dim lamp light, Ben sits on his bed, takes a book and a file filled with newspaper cuttings related to a high-profile investigation out of his bag, and studies the first cutting intently, beneath which are photos of the seven people killed in a tragic incident. Ben watches an ice hockey practice at the local rink, where two players collide and fight, a common occurrence in this intense sport. Elsewhere, Emily puts the phone down after a tense conversation, scans the room, opens French windows leading to her backyard, and goes outside, shocked to find Ben feeding Duke, a large shepherd dog known for his mischievous nature. Duke pulls her towards the garden, then pulls Ben excitedly. Emily gets a container out of her fridge while Ben studies documents, deep in concentration. Emily stares astonished at him, brow furrowed, as he stares down at the table they're sitting at covered with plans and files. She fiddles with her collar, a nervous habit, while he smiles good-humoredly and considers the options. Once again, Emily looks astounded as Ben grins and looks down, and she blinks, taken aback, as the decision about their next steps sinks in. Ben gets up, and they share a lingering look full of unspoken understanding. He smiles broadly and heads out while Emily ponders the implications. He turns back, and Emily walks up to him, as he stares at her with sad, gentle eyes, raising his eyebrows before looking serious, silently communicating the gravity of the situation. She stares at Ben and blinks as he gives an awkward, white-toothed grin and makes for the front door, where they hold each other's gaze, acknowledging the bond formed through their shared experiences."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "A bald boy in a dressing gown and pajamas spots Ben who smiles and nods before briefly returning to his reading. Ben takes a paper cup sucks on the straw and observes the boys and a woman who smiles as she watches the boys. The bald boy glances shyly at Ben and then looks down. Behind them in Ben's line of sight. Emily sits at a table by a window. Ben resumes reading. Emily in a short strappy dress over a vest top approaches Ben's table glances at the bald boy and speaks prompting Ben to get out his ID. Ben smiles puts Emily's files back in his briefcase and leaves with a polite smile while Emily remains at the table looking drained and dejected. A blue and white neon sign for the Travel Inn glows in the night as Ben arrives in his saloon outside the motel gets out and goes to the reception window. He goes to look through an open door where a pudgy bearded guy spots him and comes out from behind a lacy curtain. Ben returns to the reception window where the guy greets him then let us himself into a dark room carrying his cases placing his keys on a table and shutting the door. In dim lamp light Ben sits on his bed takes a book and a file filled with newspaper cuttings out of his bag and studies the first cutting intently beneath which are photos of the seven people killed. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Ben watches an ice hockey practice where two players collide and fight. Elsewhere Emily puts the phone down scans the room opens French windows and goes outside shocked to find Ben feeding Duke. Duke pulls her then pulls Ben. Emily gets a container out of her fridge. while Ben studies documents. Emily stares astonished at him brow furrowed as he stares down at the table they are sitting at. She fiddles with her collar while he smiles goodhumoredly and considers. Once again Emily looks astounded as Ben grins and looks down and she blinks taken aback as the decision sinks in. Ben gets up and they share a lingering look. He smiles broadly and heads out while Emily ponders. He turns back and Emily walks up to him as he stares at her with sad gentle eyes raising his eyebrows before looking serious. She stares at Ben and blinks as he gives an awkward whitetoothed grin and makes for the front door. They hold each other's gaze."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "A bald boy in a dressing gown and pajamas spots Ben who smiles and nods before briefly returning to his reading. Ben takes a paper cup sucks on the straw and observes the boys and a woman who smiles as she watches the boys. The bald boy glances shyly at Ben and then looks down. Behind them in Ben's line of sight. Emily sits at a table by a window. Ben resumes reading. Emily in a short strappy dress over a vest top approaches Ben's table glances at the bald boy and speaks prompting Ben to get out his ID. Ben smiles puts Emily's files back in his briefcase and leaves with a polite smile while Emily remains at the table looking drained and dejected. A blue and white neon sign for the Travel Inn glows in the night as Ben arrives in his saloon outside the motel gets out and goes to the reception window. He goes to look through an open door where a pudgy bearded guy spots him and comes out from behind a lacy curtain. Ben returns to the reception window where the guy greets him then let us himself into a dark room carrying his cases placing his keys on a table and shutting the door. In dim lamp light Ben sits on his bed takes a book and a file filled with newspaper cuttings out of his bag and studies the first cutting intently beneath which are photos of the seven people killed. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Ben watches an ice hockey practice where two players collide and fight. Elsewhere Emily puts the phone down scans the room opens French windows and goes outside shocked to find Ben feeding Duke. Duke pulls her then pulls Ben. Emily gets a container out of her fridge. while Ben studies documents. Emily stares astonished at him brow furrowed as he stares down at the table they are sitting at. She fiddles with her collar while he smiles goodhumoredly and considers. Once again Emily looks astounded as Ben grins and looks down and she blinks taken aback as the decision sinks in. Ben gets up and they share a lingering look. He smiles broadly and heads out while Emily ponders. He turns back and Emily walks up to him as he stares at her with sad gentle eyes raising his eyebrows before looking serious. She stares at Ben and blinks as he gives an awkward whitetoothed grin and makes for the front door. They hold each other's gaze."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "A bald boy in a dressing gown and pajamas spots Ben who smiles and nods before briefly returning to his reading. Ben takes a paper cup sucks on the straw and observes the boys and a woman who smiles as she watches the boys. The bald boy glances shyly at Ben and then looks down. Behind them in Ben's line of sight. Emily sits at a table by a window. Ben resumes reading. She fiddles with her collar while he smiles goodhumoredly and considers. Once again Emily looks astounded as Ben grins and looks down and she blinks taken aback as the decision sinks in. Ben gets up and they share a lingering look. He smiles broadly and heads out while Emily ponders. He turns back and Emily walks up to him as he stares at her with sad gentle eyes raising his eyebrows before looking serious. She stares at Ben and blinks as he gives an awkward whitetoothed grin and makes for the front door. They hold each other's gaze."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "A bald boy in a dressing gown and pajamas spots Ben who smiles and nods before briefly returning to his reading. Ben takes a paper cup sucks on the straw and observes the boys and a woman who smiles as she watches the boys. He turns back and Emily walks up to him as he stares at her with sad gentle eyes raising his eyebrows before looking serious. She stares at Ben and blinks as he gives an awkward whitetoothed grin and makes for the front door. They hold each other's gaze."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "A sleepy cat in a tutu and slippers notices Paula, who frowns and shrugs before momentarily returning to her drawing. Paula grabs a cereal bowl, slurps on the spoon, and inspects the cats and a man, who frowns as he listens to the cats. The sleepy cat peeks timidly at Paula and then looks up. Beside them, in Paula's line of gaze, Oliver lounges on a couch by a lamp. Paula resumes drawing. Oliver, in a long flowy robe over a tank top, approaches Paula's couch, peeks at the sleepy cat, and sings, prompting Paula to pull out her map. Paula frowns, puts Oliver's books back in her backpack, and departs with a curt frown while Oliver remains on the couch, looking energized and determined. A red and yellow neon sign for the Cafe Lounge flickers in the day as Paula arrives in her truck beside the bistro, climbs in, and heads to the kitchen door. She heads to peer through a closed window, where a tall clean-shaven guy notices her and emerges from behind a velvet curtain. Paula returns to the kitchen door where the guy greets her, then sneaks into a bright room, carrying her paintings, placing her phone on a chair, and opening the window. In bright sunlight, Paula stands on her porch, grabs a guitar and a notebook filled with sketches out of her purse, and examines the last sketch absentmindedly, above which are drawings of five animals resting. Paula observes a football match where three goalies slide and cheer. Meanwhile, Oliver hangs the coat up, inspects the closet, closes wooden doors, and steps inside, amused to find Paula petting Shadow. Shadow pushes him, then pushes Paula. Oliver takes a suitcase out of his freezer while Paula examines artworks. Oliver gapes puzzled at her, lips pursed, as she studies down at the chair they're reclining on. He fidgets with his necklace, while she frowns sternly and wonders. Again, Oliver gapes puzzled as Paula laughs and glances up, and he nods, surprised, as the idea clicks in. Paula stands down, and they share a brief glance. She frowns faintly and strides in while Oliver ponders. She rotates away, and Oliver strides over to her, as she glances at him with joyful, keen expressions, widening her eyes before appearing carefree. He glances at Paula and nods as she gives a smug, broad-nosed frown and heads for the back window. They meet each other's glance."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A bald boy in pajamas notices Ben, who briefly acknowledges him before returning to his reading. Ben drinks from a paper cup and observes the boy and a woman who smiles at the scene. The boy shyly looks at Ben before lowering his gaze. Emily, seated by a window, approaches Ben, prompting him to show his ID. Ben returns Emily's files, smiles politely, and leaves, leaving Emily looking drained. That night, Ben arrives at a Travel Inn, checks in, and settles in his room, where he examines a file of newspaper clippings about seven fatalities. He watches an ice hockey practice and later sees Emily shocked by his presence as he feeds Duke. Emily prepares food while Ben studies documents. She appears astonished as Ben smiles and looks at the table thoughtfully. They share a meaningful look, and Ben departs with a broad smile, causing Emily to ponder. He turns back, and Emily approaches him. They share a lingering, poignant gaze before Ben exits with an awkward grin."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "They hold each other's gaze She stares at Ben and blinks as he gives an awkward whitetoothed grin and makes for the front door He turns back and Emily walks up to him as he stares at her with sad gentle eyes raising his eyebrows before looking serious He smiles broadly and heads out while Emily ponders Ben gets up and they share a lingering look Once again Emily looks astounded as Ben grins and looks down and she blinks taken aback as the decision sinks in She fiddles with her collar while he smiles goodhumoredly and considers Emily stares astonished at him brow furrowed as he stares down at the table they are sitting at while Ben studies documents Emily gets a container out of her fridge Duke pulls her then pulls Ben Elsewhere Emily puts the phone down scans the room opens French windows and goes outside shocked to find Ben feeding Duke Ben watches an ice hockey practice where two players collide and fight In dim lamp light Ben sits on his bed takes a book and a file filled with newspaper cuttings out of his bag and studies the first cutting intently beneath which are photos of the seven people killed Ben returns to the reception window where the guy greets him then let us himself into a dark room carrying his cases placing his keys on a table and shutting the door He goes to look through an open door where a pudgy bearded guy spots him and comes out from behind a lacy curtain A blue and white neon sign for the Travel Inn glows in the night as Ben arrives in his saloon outside the motel gets out and goes to the reception window Ben smiles puts Emily's files back in his briefcase and leaves with a polite smile while Emily remains at the table looking drained and dejected Emily in a short strappy dress over a vest top approaches Ben's table glances at the bald boy and speaks prompting Ben to get out his ID Ben resumes reading Emily sits at a table by a window Behind them in Ben's line of sight The bald boy glances shyly at Ben and then looks down Ben takes a paper cup sucks on the straw and observes the boys and a woman who smiles as she watches the boys A bald boy in a dressing gown and pajamas spots Ben who smiles and nods before briefly returning to his reading"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Ben takes a paper cup sucks on the straw and observes the boys and a woman who smiles as she watches the boys A bald boy in a dressing gown and pajamas spots Ben who smiles and nods before briefly returning to his reading Behind them in Ben's line of sight The bald boy glances shyly at Ben and then looks down Ben resumes reading Emily sits at a table by a window Ben smiles puts Emily's files back in his briefcase and leaves with a polite smile while Emily remains at the table looking drained and dejected Emily in a short strappy dress over a vest top approaches Ben's table glances at the bald boy and speaks prompting Ben to get out his ID He goes to look through an open door where a pudgy bearded guy spots him and comes out from behind a lacy curtain A blue and white neon sign for the Travel Inn glows in the night as Ben arrives in his saloon outside the motel gets out and goes to the reception window In dim lamp light Ben sits on his bed takes a book and a file filled with newspaper cuttings out of his bag and studies the first cutting intently beneath which are photos of the seven people killed Ben returns to the reception window where the guy greets him then let us himself into a dark room carrying his cases placing his keys on a table and shutting the door Elsewhere Emily puts the phone down scans the room opens French windows and goes outside shocked to find Ben feeding Duke Ben watches an ice hockey practice where two players collide and fight Emily gets a container out of her fridge Duke pulls her then pulls Ben Emily stares astonished at him brow furrowed as he stares down at the table they are sitting at while Ben studies documents Once again Emily looks astounded as Ben grins and looks down and she blinks taken aback as the decision sinks in She fiddles with her collar while he smiles goodhumoredly and considers He smiles broadly and heads out while Emily ponders Ben gets up and they share a lingering look She stares at Ben and blinks as he gives an awkward whitetoothed grin and makes for the front door He turns back and Emily walks up to him as he stares at her with sad gentle eyes raising his eyebrows before looking serious They hold each other's gaze"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Elsewhere Emily puts the phone down scans the room opens French windows and goes outside shocked to find Ben feeding Duke Duke pulls her then pulls Ben Emily gets a container out of her fridge while Ben studies documents Emily stares astonished at him brow furrowed as he stares down at the table they are sitting at She fiddles with her collar while he smiles goodhumoredly and considers Once again Emily looks astounded as Ben grins and looks down and she blinks taken aback as the decision sinks in Ben gets up and they share a lingering look He smiles broadly and heads out while Emily ponders He turns back and Emily walks up to him as he stares at her with sad gentle eyes raising his eyebrows before looking serious She stares at Ben and blinks as he gives an awkward whitetoothed grin and makes for the front door They hold each other's gaze A bald boy in a dressing gown and pajamas spots Ben who smiles and nods before briefly returning to his reading Ben takes a paper cup sucks on the straw and observes the boys and a woman who smiles as she watches the boys The bald boy glances shyly at Ben and then looks down Behind them in Ben's line of sight Emily sits at a table by a window Ben resumes reading Emily in a short strappy dress over a vest top approaches Ben's table glances at the bald boy and speaks prompting Ben to get out his ID Ben smiles puts Emily's files back in his briefcase and leaves with a polite smile while Emily remains at the table looking drained and dejected A blue and white neon sign for the Travel Inn glows in the night as Ben arrives in his saloon outside the motel gets out and goes to the reception window He goes to look through an open door where a pudgy bearded guy spots him and comes out from behind a lacy curtain Ben returns to the reception window where the guy greets him then let us himself into a dark room carrying his cases placing his keys on a table and shutting the door In dim lamp light Ben sits on his bed takes a book and a file filled with newspaper cuttings out of his bag and studies the first cutting intently beneath which are photos of the seven people killed Ben watches an ice hockey practice where two players collide and fight"
        }
      ]
    }
  ]
}