{
  "ground_truth": "He jabs his finger while Peter stands by, frowning, as they watch Longson march off. On a dark, rain-sodden pitch, Bremner, in a yellow Leeds shirt, slides down a Derby player while Leeds players foul and head-butt their counterparts, and Brian bellows at Don. Bremner strolls up to Brian and shakes his hand on the touchline before smirking. Brian and Peter are dazed in the rain as the Leeds players trudge off, gesticulating at the Derby crowd. Longson stalks angrily down the corridor, past the away dressing room, to stand beside a hangdog Brian surveying his battered team, glaring at Brian before turning on his heel, leaving a rueful Brian to meet Peter's concerned look. Brian addresses the press assembled in the tunnel of Juve's Comunale Stadium and jabs his finger at a camera. Nurses wheel a gurney from an ambulance as Brian sits by Peter's hospital bedside, smiling and looking away. Their eyes meet and hold a loaded look for a moment before each drops his gaze. Brian storms into the Derby board meeting where Longson stares at the table as he smokes a cigar, while the other directors look away from Brian's plaintive looks. Shaking his head in disbelief, Brian wanders down to Longson, then hurls his tracksuit top on the table. Everyone gathered in the candlelit room turns to look at Peter as Brian crosses the room to him. Brian stands beside three grinning young men before the assembled press below the Leeds United sign in front of the stadium as Giles, Bremner, and Hunter watch from the training ground. Brian passes them in the tunnel, standing with his back to the pitch in the players' tunnel, smiling bitterly as Giles points past him towards the empty stadium at the end of the tunnel. Brian's smile wilts as Giles turns and saunters off with the other players, who pat him on the back as they go. Alone, Brian turns slowly and makes his way up towards the pitch, gazing at the empty stands. Alone in his stark hotel room, Brian lies on his bed, smoking and drinking, staring at the little girl playing noughts and crosses with the toy clown on the television test-card. A woman rides a tricycle past beach huts on the seafront promenade, girls flock across the beach by the pier, an elderly couple eat fish and chips, and more middle-aged folks snooze in deck chairs in the hazy sunshine. Brian pulls up with Peter in his Ford Zodiac on the seafront, and they stroll along passing a woman hobbling with a Zimmer frame as Brian's eyes drift away and he frowns. Peter points over the street to a hotel, and in the bar, the Brighton Chairman extends his hand to shake.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He pokes his digit while Peter stands by, scowling, as they observe Longson stride off. On a murky, rain-soaked field, Bremner, in a yellow Leeds jersey, skids down a Derby opponent while Leeds athletes foul and head-butt their adversaries, and Brian hollers at Don. Bremner saunters up to Brian and clasps his hand on the boundary before sneering. Brian and Peter are bewildered in the rain as the Leeds athletes plod off, gesturing at the Derby crowd. Longson prowls angrily down the hallway, past the away locker room, to stand beside a dejected Brian assessing his beaten squad, glaring at Brian before pivoting on his heel, leaving a regretful Brian to encounter Peter's worried look. Brian addresses the media gathered in the tunnel of Juve's Comunale Stadium and pokes his digit at a camera. Nurses wheel a stretcher from an ambulance as Brian sits by Peter's hospital bedside, grinning and glancing away. Their eyes meet and hold a charged look for a moment before each lowers his gaze. Brian bursts into the Derby board meeting where Longson gazes at the table as he puffs a cigar, while the other directors look away from Brian's wistful glances. Shaking his head in astonishment, Brian meanders down to Longson, then flings his tracksuit top on the table. Everyone assembled in the dimly lit room turns to look at Peter as Brian crosses the room to him. Brian stands beside three beaming young men before the gathered media below the Leeds United sign in front of the stadium as Giles, Bremner, and Hunter observe from the practice ground. Brian passes them in the tunnel, standing with his back to the field in the players' tunnel, smirking bitterly as Giles gestures past him towards the vacant stadium at the end of the tunnel. Brian's smirk withers as Giles turns and strolls off with the other athletes, who pat him on the back as they depart. Alone, Brian turns slowly and makes his way up towards the field, gazing at the empty bleachers. Alone in his bare hotel room, Brian lies on his bed, smoking and drinking, staring at the little girl playing tic-tac-toe with the toy clown on the television test-card. A woman rides a tricycle past beach huts on the seafront walkway, girls gather across the beach by the pier, an elderly couple eat fish and chips, and more middle-aged folks doze in deck chairs in the hazy sunshine. Brian pulls up with Peter in his Ford Zodiac on the seafront, and they saunter along passing a woman hobbling with a Zimmer frame as Brian's eyes drift away and he scowls. Peter gestures over the street to a hotel, and in the bar, the Brighton Chairman offers his hand to shake."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "His finger is jabbed by him while Peter stands by, frowning, as Longson is watched marching off by them. On a dark, rain-sodden pitch, a Derby player is slid down by Bremner, in a yellow Leeds shirt, while their counterparts are fouled and head-butted by Leeds players, and Don is bellowed at by Brian. Brian is strolled up to by Bremner, and his hand is shaken on the touchline before smirking. The rain dazes Brian and Peter as the Derby crowd is gesticulated at by the players of Leeds trudging off. Longson angrily stalks down the corridor, passing the away dressing room, to stand beside a hangdog Brian, who is surveying his battered team, while he glares at Brian before turning on his heel, leaving Peter to be met by a rueful Brian's concerned look. The press assembled in the tunnel of Juve's Comunale Stadium are addressed by Brian, and a camera is jabbed at by him. A gurney is wheeled from an ambulance by nurses as Peter's hospital bedside is sat by Brian, who smiles and looks away. Their eyes are met and a loaded look is held for a moment before each drops his gaze. Brian storms into the Derby board meeting where the table is stared at by Longson as he smokes a cigar, while Brian's plaintive looks are avoided by the other directors. Disbelief is shaken by Brian as he wanders down to Longson, then his tracksuit top is hurled on the table by him. In the candlelit room, everyone gathered turns to look at Peter as Brian crosses the room to him. Beside three grinning young men, Brian stands before the assembled press below the Leeds United sign in front of the stadium as the training ground is watched by Giles, Bremner, and Hunter. The tunnel is passed by Brian, standing with his back to the pitch in the players' tunnel, smiling bitterly as Giles points past him towards the empty stadium at the end of the tunnel. Brian's smile wilts as Giles turns and saunters off with the other players, who pat him on the back as they go. Slowly turning and gazing at the empty stands, Brian alone makes his way up towards the pitch. On his bed in his stark hotel room, Brian alone lies smoking and drinking, staring at the little girl playing noughts and crosses with the toy clown on the television test-card. A tricycle is ridden past beach huts on the seafront promenade by a woman; across the beach by the pier, girls flock, an elderly couple eat fish and chips, and more middle-aged folks snooze in deck chairs in the hazy sunshine. The seafront is pulled up to by Brian with Peter in his Ford Zodiac, and a woman hobbling with a Zimmer frame is passed by them as Brian's eyes drift away and he frowns. Over the street, Peter points to a hotel, and in the bar, his hand is extended by the Brighton Chairman to shake."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He jabs his finger while Peter frowns as they watch Longson march off. On a dark, rain-soaked pitch, Bremner, in a yellow Leeds shirt, slides into a Derby player while Leeds players foul and head-butt their opponents, and Brian shouts at Don. Bremner approaches Brian, shakes his hand on the touchline, and smirks. Brian and Peter are dazed as Leeds players trudge off, gesturing at the Derby crowd. Longson angrily walks past the away dressing room to stand beside a dejected Brian, glares, and then turns away, leaving Brian to meet Peter's concerned look. Brian addresses the press in Juve's Comunale Stadium tunnel and jabs his finger at a camera. Nurses wheel a gurney from an ambulance as Brian sits by Peter's hospital bed, both sharing a significant look before averting their gazes. Brian storms into the Derby board meeting where Longson stares at the table while smoking, as other directors avoid Brian's imploring eyes. Shaking his head, Brian approaches Longson and hurls his tracksuit on the table. In the candlelit room, everyone looks at Peter as Brian crosses over to him. Brian stands with three grinning young men before the press at the Leeds United sign, as Giles, Bremner, and Hunter watch from the training ground. Brian passes them in the tunnel, standing with his back to the pitch as Giles points to the empty stadium. Brian's smile fades as Giles walks away, and the other players pat him on the back as they leave. Alone, Brian turns slowly toward the pitch, gazing at the empty stands. In his hotel room, Brian lies on his bed, smoking and drinking, watching a girl play noughts and crosses with a toy clown on TV. A woman rides a tricycle, girls flock across the beach, an elderly couple eats fish and chips, and others snooze in deck chairs under the sunny sky. Brian and Peter pull up in a Ford Zodiac at the seafront and stroll, passing a woman with a Zimmer frame. Peter points to a hotel, and inside the bar, the Brighton Chairman offers his hand to shake."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Peter frowns as Longson marches off, jabbing his finger. On a rain-soaked pitch, Bremner in Leeds' yellow shirt slides into a Derby player, as Leeds fouls escalate with head-butts while Brian yells at Don. Bremner smirks, shakes Brian's hand, as the rain-soaked Leeds players gesticulate at the crowd. Longson storms past the dressing room to Brian, glaring before leaving him with Peter's worried look. Brian addresses the press, finger-pointing at a camera. At Peter's hospital bedside, Brian smiles, their eyes briefly meeting. Brian storms a Derby board meeting, tossing his tracksuit on the table as Longson smokes. In a candlelit room, the focus shifts to Peter as Brian approaches. Brian stands with three young men before the press at Leeds United, passing Giles, Bremner, and Hunter in the tunnel. As Giles walks off, back-patting players follow, leaving Brian alone to gaze at the empty stands. In a stark hotel room, Brian smokes and drinks, staring at a TV test-card. A woman rides by beach huts as girls, an elderly couple, and others enjoy the hazy day. Brian arrives with Peter on the seafront in a Ford Zodiac, his gaze wandering as they stroll. Peter points to a hotel bar where the Brighton Chairman offers a handshake."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He aggressively jabs his finger in the air while Peter remains standing nearby, a frown etched on his face, as they both watch Longson march off into the distance. On a dark, rain-soaked pitch, Bremner, clad in his distinctive yellow Leeds shirt, slides down a Derby player, an action witnessed amidst a chaotic scene where Leeds players are engaged in fouling and head-butting their opponents. Meanwhile, Brian bellows vociferously at Don. Bremner casually strolls up to Brian on the touchline and extends his hand for a handshake before smirking confidently. Brian and Peter appear dazed and bewildered as the rain continues to pour down while the Leeds players slowly trudge off the field, gesticulating animatedly at the Derby crowd. Longson, with a stormy expression, angrily stalks down the corridor, passing by the away dressing room, and stops to stand next to a dejected Brian who is surveying his battered team. Longson glares pointedly at Brian before abruptly turning on his heel and leaving a rueful Brian to meet Peter's concerned and questioning look. \n\nBrian, addressing the press gathered in the tunnel of Juve's renowned Comunale Stadium, jabs his finger emphatically at a camera. Nurses wheel a gurney away from an ambulance as Brian sits beside Peter’s hospital bedside, a gentle smile playing on his lips while he looks away. Their eyes meet, holding a significant and loaded look for a brief moment, before each drops his gaze. Later, Brian storms angrily into the Derby board meeting where Longson stares fixedly at the table while smoking a cigar, and the other directors avert their eyes from Brian's plaintive and pleading looks. Shaking his head in disbelief and frustration, Brian wanders down to Longson and dramatically hurls his tracksuit top onto the table. Everyone assembled in the candlelit room turns their attention towards Peter as Brian crosses the room towards him. Brian then stands beside three young men, grinning broadly, before the gathered press below the prominent Leeds United sign in front of the stadium, while Giles, Bremner, and Hunter watch them from the training ground. Brian passes them nonchalantly in the tunnel, standing with his back to the pitch in the players' tunnel, smiling bitterly as Giles points past him towards the empty expanse of the stadium at the tunnel's end. Brian's smile fades as Giles turns and casually saunters off with the other players, who pat him on the back as they go. Alone and solitary, Brian turns slowly and begins to make his way up towards the pitch, his gaze sweeping over the empty stands. \n\nIn his stark and somber hotel room, Brian lies on his bed, smoking and drinking while staring intently at the television test-card depicting a little girl playing noughts and crosses with a toy clown. Outside, a woman rides a tricycle past beach huts on the seafront promenade, girls flock and move across the beach by the pier, an elderly couple leisurely eat fish and chips, and more middle-aged folks snooze comfortably in deck chairs under the hazy sunshine. Brian pulls up with Peter in his Ford Zodiac car along the seafront, and they stroll leisurely along, passing a woman hobbling haltingly with a Zimmer frame while Brian's eyes drift away in thought, and he frowns. Peter points across the street towards a hotel, and inside its bar, the Brighton Chairman extends his hand warmly for a handshake."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As he belligerently thrusts his finger into the air, Peter stands close by, his face revealing a deep frown, as they both watch Longson storm away into the distance. On a dim, rain-drenched pitch, Bremner, unmistakably donned in his signature yellow Leeds shirt, recklessly slides into a Derby player. This action unfolds amidst an utterly chaotic scene where Leeds players are intensely engaged in foul plays and head-butting their adversaries. At the same time, Brian intensely shouts at Don from the sidelines. Bremner nonchalantly saunters over to Brian at the touchline, offering his hand for a handshake while wearing a confident smirk. Brian and Peter, appearing completely dazed and bewildered, stand there as the relentless rain pours down, and the Leeds players slowly plod off the field, gesticulating wildly at the Derby crowd. Longson, with a thunderous expression, furiously makes his way down the corridor, passing the away dressing room, and halts beside a despondent Brian, who is observing his battered team. Longson glares fiercely at Brian before abruptly spinning on his heel and departing, leaving a rueful Brian to encounter Peter’s concerned and inquisitive gaze.\n\nAddressing the press assembled in the tunnel of Juve's famous Communal Stadium, Brian forcefully jabs his finger at a camera. Meanwhile, nurses are seen wheeling a gurney away from an ambulance as Brian sits by Peter’s hospital bedside, a gentle smile briefly gracing his lips as he looks away. Their eyes lock, holding a momentarily significant and loaded gaze, before they both swiftly lower their eyes. Soon after, Brian storms furiously into the Derby board meeting, where Longson stares intently at the table while puffing on a cigar, and the other directors avoid meeting Brian's pleading and earnest looks. Shaking his head with disbelief and frustration, Brian moves down to Longson and dramatically throws his tracksuit top onto the table. All those gathered in the dimly candlelit room turn their attention towards Peter as Brian crosses the room towards him. Brian stands beside three young men, grinning broadly, in front of the gathered press below the prominent Leeds United sign at the stadium, while Giles, Bremner, and Hunter watch them from the training ground. Brian passes them in the tunnel nonchalantly, standing with his back to the pitch in the players' tunnel, wearing a bitter smile as Giles gestures past him towards the vacant expanse of the stadium at the tunnel's end. Brian’s smile gradually fades as Giles turns away and casually saunters off with the other players, who pat him on the back as they depart. Alone and solitary, Brian turns slowly and begins his ascent towards the pitch, his gaze sweeping over the empty stands.\n\nIn his stark, somber hotel room, Brian lies on his bed, smoking and drinking as he gazes intently at the television test-card, which depicts a little girl playing noughts and crosses with a toy clown. Outside, a woman rides a tricycle past beach huts on the seafront promenade, girls move together across the beach by the pier, an elderly couple leisurely enjoy their fish and chips, and other middle-aged folks doze off comfortably in deck chairs beneath the hazy sunshine. Brian pulls up with Peter in his Ford Zodiac car along the seafront, and they take a leisurely stroll, passing a woman struggling along with a Zimmer frame, while Brian’s eyes drift away in thought, and his brow furrows. Peter gestures across the street towards a hotel, and inside its inviting bar, the Brighton Chairman extends his hand warmly in a gesture of greeting and friendship."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the scene begins, he jabs his finger emphatically while Peter stands nearby, frowning with concern etched across his face, both of them intently watching Longson as he determinedly marches away from them. On the dark, rain-soaked pitch, Bremner, clad in a striking yellow Leeds shirt, executes a slide tackle, bringing down a Derby player. Amidst this, other Leeds players engage in fouling and head-butting their opponents, creating a tense atmosphere. Brian stands on the sidelines, vociferously shouting at Don. Bremner casually strolls up to Brian, reaching out to shake his hand on the touchline and adding a smirk before stepping away. Meanwhile, Brian and Peter remain dazed under the relentless rain, observing as the Leeds players slowly trudge off the field, making animated gestures at the Derby crowd. The scene shifts as Longson angrily stalks down the corridor, passing by the away dressing room with determined strides, until he reaches the spot beside a despondent-looking Brian, who is surveying his battered team with a tired gaze. Longson pauses to cast a harsh glare at Brian, and then pivots sharply on his heel, leaving Brian to exchange a resigned glance with Peter, who looks on with concern. In the tunnel of Juve's Comunale Stadium, Brian stands addressing the gathered press, jabbing his finger pointedly at a camera to emphasize his statements. The scene transitions to outside a hospital, where nurses expertly wheel a gurney from an ambulance. Inside, Brian sits at Peter's hospital bedside, offering a gentle smile before looking away, and their eyes meet, locking in a loaded, meaningful look that lasts until both drop their gazes in unison. The tension mounts as Brian storms into a Derby board meeting, confronting Longson, who sits smoking a cigar, fixated on the table, deliberately avoiding Brian's plaintive gaze while the other directors in the room turn their eyes away. In disbelief, Brian shakes his head before wandering down to Longson and angrily hurling his tracksuit top onto the table. The room, dimly lit by candles, turns its attention to Peter as Brian crosses over to him with purpose. Brian is then seen standing confidently beside three grinning young men before the press assembled beneath the prominent Leeds United sign in front of the stadium, as Giles, Bremner, and Hunter watch from the training ground. As Brian passes them in the tunnel, he stands with his back to the pitch, offering a bitter smile while Giles gestures past him towards the vacant stadium, his finger pointing emphatically at the empty expanse. Brian's smile fades as Giles turns away, sauntering off with the other players, who offer reassuring pats on the back as they depart. Left alone, Brian slowly turns and makes his way up towards the pitch, his eyes sweeping over the empty stands with a contemplative gaze. Alone in the stark simplicity of his hotel room, Brian lies on his bed, smoking and drinking while his eyes remain fixed on the television displaying a little girl engaged in a game of noughts and crosses with a toy clown on the test card. A montage unfolds of a woman riding a tricycle past beach huts on the seafront promenade, girls gathering across the beach by the pier, an elderly couple enjoying fish and chips, and several middle-aged people dozing in deck chairs, all bathed in the hazy sunshine of a leisurely day. Brian pulls up in his Ford Zodiac with Peter at the seafront, and together they stroll along. Brian's attention momentarily drifts as he frowns while passing a woman hobbling with a Zimmer frame. Peter points across the street towards a hotel, and inside the bar, the Brighton Chairman extends his hand warmly, inviting a handshake."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As Peter frowns beside him, he watches Longson march off, then shifts to a rain-soaked pitch where Bremner, in his yellow Leeds shirt, tackles a Derby player amid escalating fouls and head-butts between teams while Brian shouts at Don. Bremner approaches Brian, shakes his hand with a smirk, and the Leeds players retreat, gesturing at the Derby crowd. Longson storms down the corridor, pauses beside a contemplative Brian overseeing his discouraged team, exchanges a glare, and exits, leaving Brian and Peter to share a concerned glance. Brian addresses the press in Juve's Comunale Stadium tunnel, emphasizing his points with gestures. Later, nurses wheel a gurney as Brian sits by Peter’s hospital bed; their eyes briefly connect meaningfully before averting. At a Derby board meeting, where Longson avoids eye contact and smokes a cigar, Brian, frustrated, throws his tracksuit on the table and moves through the candlelit room to Peter. At Leeds United’s stadium, Brian stands with three grinning young men before the press, as Giles, Bremner, and Hunter watch from afar. In the tunnel, Brian, with a bitter smile, faces away from the pitch as Giles gestures toward the empty stadium and departs with his teammates. Left alone, Brian turns toward the pitch, taking in the vacant stands. In his stark hotel room, he lies smoking and drinking, fixed on a TV test-card featuring a little girl with a toy clown. Meanwhile, along the seafront, people take in the sunshine: a woman rides a tricycle, girls wander the beach, an elderly couple savors fish and chips, and others snooze in deck chairs. Brian arrives with Peter in his Ford Zodiac, strolling the promenade until Peter points toward a hotel, where the Brighton Chairman welcomes them with a handshake in the bar."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He jabs his finger while Peter stands by, frowning, as they watch Longson, the chairman of Derby County known for his stern temperament, march off. On a dark, rain-sodden pitch at the Baseball Ground, home to Derby County until 1997, Bremner, in a yellow Leeds shirt symbolizing their fierce identity, slides down a Derby player while Leeds players, notorious for their aggressive style in the 1970s, foul and head-butt their counterparts, and Brian, a legendary yet controversial manager in English football, bellows at Don Revie, the esteemed Leeds manager. Bremner, who captained Leeds United during their golden years, strolls up to Brian and shakes his hand on the touchline before smirking. Brian and Peter are dazed in the rain as the Leeds players, known for their resilience and skill, trudge off, gesticulating at the Derby crowd, famous for their passionate support. Longson stalks angrily down the corridor, past the away dressing room filled with the distinct smells of liniment and sweat, to stand beside a hangdog Brian surveying his battered team, glaring at Brian before turning on his heel, leaving a rueful Brian to meet Peter's concerned look, a moment reflecting the pressures and tensions of top-level football. Brian addresses the press assembled in the tunnel of Juve’s Comunale Stadium, a historic venue in Turin once home to Juventus F.C., and jabs his finger at a camera. Nurses wheel a gurney from an ambulance as Brian sits by Peter's hospital bedside, smiling and looking away, their friendship enduring through the challenges they face. Their eyes meet and hold a loaded look for a moment before each drops his gaze, a subtle acknowledgment of the unspoken bond between them. Brian storms into the Derby board meeting where Longson stares at the table as he smokes a cigar, while the other directors look away from Brian's plaintive looks, echoing the managerial tumult of the era. Shaking his head in disbelief, Brian wanders down to Longson, then hurls his tracksuit top on the table, a gesture of defiance and resignation. Everyone gathered in the candlelit room—perhaps a power outage or an intentional ambience—turns to look at Peter as Brian crosses the room to him. Brian stands beside three grinning young men before the assembled press below the Leeds United sign in front of the stadium, as Giles, Bremner, and Hunter, key figures in Leeds’ success, watch from the training ground. Brian passes them in the tunnel, standing with his back to the pitch in the players' tunnel, smiling bitterly as Giles, once his trusted player, points past him towards the empty stadium at the end of the tunnel. Brian's smile wilts as Giles turns and saunters off with the other players, who pat him on the back as they go, camaraderie amidst changing tides. Alone, Brian turns slowly and makes his way up towards the pitch, gazing at the empty stands that once echoed with cheers. Alone in his stark hotel room, Brian lies on his bed, smoking and drinking, a reflection of his inner turmoil, staring at the little girl playing noughts and crosses with the toy clown on the television test-card, a common late-night screen before 24-hour broadcasting. A woman rides a tricycle past beach huts on the seafront promenade, a typical British coastal scene, girls flock across the beach by the pier, an elderly couple eat fish and chips, a quintessential British meal, and more middle-aged folks snooze in deck chairs in the hazy sunshine. Brian pulls up with Peter in his Ford Zodiac, a classic British car of the era, on the seafront, and they stroll along passing a woman hobbling with a Zimmer frame, a symbol of the aging population, as Brian's eyes drift away and he frowns, contemplative. Peter points over the street to a hotel, and in the bar, the Brighton Chairman extends his hand to shake, an offer possibly signaling new opportunities."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Brian surveying his battered team glaring at Brian before turning on his heel leaving a rueful Brian to meet Peter's concerned look an elderly couple eat fish and chips and more middleaged folks snooze in deck chairs in the hazy sunshine He jabs his finger while Peter stands by frowning as they watch Longson march off Longson stalks angrily down the corridor past the away dressing room to stand beside a hangdog On a dark rainsodden pitch Bremner in a yellow Leeds shirt slides down a Derby player while Leeds players foul and headbutt their counterparts and Brian bellows at Don Bremner strolls up to Brian and shakes his hand on the touchline before smirking Brian and Peter are dazed in the rain as the Leeds players trudge off gesticulating at the Derby crowd Longson stalks angrily down the corridor past the away dressing room to stand beside a hangdog He jabs his finger while Peter stands by frowning as they watch Longson march off Brian storms into the Derby board meeting where Longson stares at the table as he smokes a cigar while the other directors look away from Brian's plaintive looks Brian surveying his battered team glaring at Brian before turning on his heel leaving a rueful Brian to meet Peter's concerned look Brian addresses the press assembled in the tunnel of Juve's Comunale Stadium and jabs his finger at a camera Nurses wheel a gurney from an ambulance as Brian sits by Peter's hospital bedside smiling and looking away Peter points over the street to a hotel and in the bar Their eyes meet and hold a loaded look for a moment before each drops his gaze Shaking his head in disbelief Brian storms into the Derby board meeting where Longson stares at the table as he smokes a cigar while the other directors look away from Brian's plaintive looks Shaking his head in disbelief Brian pulls up with Peter in his Ford Zodiac on the seafront and they stroll along passing a woman hobbling with a Zimmer frame as Brian's eyes drift away and he frowns Brian wanders down to Longson then hurls his tracksuit top on the table Everyone gathered in the candlelit room turns to look at Peter as Brian crosses the room to him Their eyes meet and hold a loaded look for a moment before each drops his gaze Brian stands beside three grinning young men before the assembled press below the Leeds United sign in front of the stadium as Giles Bremner and Hunter watch from the training ground Brian passes them in the tunnel standing with his back to the pitch in the players' tunnel smiling bitterly as Giles points past him towards the empty stadium at the end of the tunnel girls flock across the beach by the pier Brian's smile wilts as Giles turns and saunters off with the other players who pat him on the back as they go Alone Brian turns slowly and makes his way up towards the pitch gazing at the empty stands Alone in his stark hotel room Brian lies on his bed smoking and drinking staring at the little girl playing noughts and crosses with the toy clown on the television testcard Brian and Peter are dazed in the rain as the Leeds players trudge off gesticulating at the Derby crowd Nurses wheel a gurney from an ambulance as Brian sits by Peter's hospital bedside smiling and looking away A woman rides a tricycle past beach huts on the seafront promenade girls flock across the beach by the pier an elderly couple eat fish and chips and more middleaged folks snooze in deck chairs in the hazy sunshine Brian pulls up with Peter in his Ford Zodiac on the seafront and they stroll along passing a woman hobbling with a Zimmer frame as Brian's eyes drift away and he frowns Peter points over the street to a hotel and in the bar the Brighton Chairman extends his hand to shake"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He jabs his finger while Peter stands by frowning as they watch Longson march off. On a dark rainsodden pitch Bremner in a yellow Leeds shirt slides down a Derby player while Leeds players foul and headbutt their counterparts and Brian bellows at Don Bremner strolls up to Brian and shakes his hand on the touchline before smirking. Brian and Peter are dazed in the rain as the Leeds players trudge off gesticulating at the Derby crowd. Longson stalks angrily down the corridor past the away dressing room to stand beside a hangdog. Brian surveying his battered team glaring at Brian before turning on his heel leaving a rueful Brian to meet Peter's concerned look. Brian addresses the press assembled in the tunnel of Juve's Comunale Stadium and jabs his finger at a camera. Nurses wheel a gurney from an ambulance as Brian sits by Peter's hospital bedside smiling and looking away. Their eyes meet and hold a loaded look for a moment before each drops his gaze. Brian storms into the Derby board meeting where Longson stares at the table as he smokes a cigar while the other directors look away from Brian's plaintive looks. Shaking his head in disbelief. Brian wanders down to Longson then hurls his tracksuit top on the table. Everyone gathered in the candlelit room turns to look at Peter as Brian crosses the room to him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Brian stands beside three grinning young men before the assembled press below the Leeds United sign in front of the stadium as Giles Bremner and Hunter watch from the training ground. Brian passes them in the tunnel standing with his back to the pitch in the players' tunnel smiling bitterly as Giles points past him towards the empty stadium at the end of the tunnel. Brian's smile wilts as Giles turns and saunters off with the other players who pat him on the back as they go Alone. Brian turns slowly and makes his way up towards the pitch gazing at the empty stands. Alone in his stark hotel room. Brian lies on his bed smoking and drinking staring at the little girl playing noughts and crosses with the toy clown on the television testcard. A woman rides a tricycle past beach huts on the seafront promenade. girls flock across the beach by the pier. an elderly couple eat fish and chips and more middleaged folks snooze in deck chairs in the hazy sunshine. Brian pulls up with Peter in his Ford Zodiac on the seafront and they stroll along passing a woman hobbling with a Zimmer frame as Brian's eyes drift away and he frowns. Peter points over the street to a hotel and in the bar. the Brighton Chairman extends his hand to shake."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He jabs his finger while Peter stands by frowning as they watch Longson march off. On a dark rainsodden pitch Bremner in a yellow Leeds shirt slides down a Derby player while Leeds players foul and headbutt their counterparts and Brian bellows at Don Bremner strolls up to Brian and shakes his hand on the touchline before smirking. Brian and Peter are dazed in the rain as the Leeds players trudge off gesticulating at the Derby crowd. Longson stalks angrily down the corridor past the away dressing room to stand beside a hangdog. Brian surveying his battered team glaring at Brian before turning on his heel leaving a rueful Brian to meet Peter's concerned look. Brian addresses the press assembled in the tunnel of Juve's Comunale Stadium and jabs his finger at a camera. Nurses wheel a gurney from an ambulance as Brian sits by Peter's hospital bedside smiling and looking away. Their eyes meet and hold a loaded look for a moment before each drops his gaze. Brian storms into the Derby board meeting where Longson stares at the table as he smokes a cigar while the other directors look away from Brian's plaintive looks. Shaking his head in disbelief. Brian wanders down to Longson then hurls his tracksuit top on the table. Everyone gathered in the candlelit room turns to look at Peter as Brian crosses the room to him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Brian stands beside three grinning young men before the assembled press below the Leeds United sign in front of the stadium as Giles Bremner and Hunter watch from the training ground. Brian passes them in the tunnel standing with his back to the pitch in the players' tunnel smiling bitterly as Giles points past him towards the empty stadium at the end of the tunnel. Brian's smile wilts as Giles turns and saunters off with the other players who pat him on the back as they go Alone. Brian turns slowly and makes his way up towards the pitch gazing at the empty stands. Alone in his stark hotel room. Brian lies on his bed smoking and drinking staring at the little girl playing noughts and crosses with the toy clown on the television testcard. A woman rides a tricycle past beach huts on the seafront promenade. girls flock across the beach by the pier. an elderly couple eat fish and chips and more middleaged folks snooze in deck chairs in the hazy sunshine. Brian pulls up with Peter in his Ford Zodiac on the seafront and they stroll along passing a woman hobbling with a Zimmer frame as Brian's eyes drift away and he frowns. Peter points over the street to a hotel and in the bar. the Brighton Chairman extends his hand to shake."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He jabs his finger while Peter stands by frowning as they watch Longson march off. On a dark rainsodden pitch Bremner in a yellow Leeds shirt slides down a Derby player while Leeds players foul and headbutt their counterparts and Brian bellows at Don Bremner strolls up to Brian and shakes his hand on the touchline before smirking. Brian and Peter are dazed in the rain as the Leeds players trudge off gesticulating at the Derby crowd. Longson stalks angrily down the corridor past the away dressing room to stand beside a hangdog. Brian surveying his battered team glaring at Brian before turning on his heel leaving a rueful Brian to meet Peter's concerned look. Brian addresses the press assembled in the tunnel of Juve's Comunale Stadium and jabs his finger at a camera. A woman rides a tricycle past beach huts on the seafront promenade. girls flock across the beach by the pier. an elderly couple eat fish and chips and more middleaged folks snooze in deck chairs in the hazy sunshine. Brian pulls up with Peter in his Ford Zodiac on the seafront and they stroll along passing a woman hobbling with a Zimmer frame as Brian's eyes drift away and he frowns. Peter points over the street to a hotel and in the bar. the Brighton Chairman extends his hand to shake."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He jabs his finger while Peter stands by frowning as they watch Longson march off. On a dark rainsodden pitch Bremner in a yellow Leeds shirt slides down a Derby player while Leeds players foul and headbutt their counterparts and Brian bellows at Don Bremner strolls up to Brian and shakes his hand on the touchline before smirking. Brian and Peter are dazed in the rain as the Leeds players trudge off gesticulating at the Derby crowd. Peter points over the street to a hotel and in the bar. the Brighton Chairman extends his hand to shake."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dog jabs his finger while a rabbit stands by, frowning, as they watch a squirrel march off. On a dark, rain-sodden pitch, a parrot, in a yellow Leeds shirt, slides down a Derby player while raccoons foul and head-butt their counterparts, and a giraffe bellows at a zebra. The parrot strolls up to the giraffe and shakes his hand on the touchline before smirking. A giraffe and a rabbit are dazed in the rain as the raccoons trudge off, gesticulating at the Derby crowd. A squirrel stalks angrily down the corridor, past the away dressing room, to stand beside a hangdog giraffe surveying his battered team, glaring at the giraffe before turning on his heel, leaving a rueful giraffe to meet a rabbit's concerned look. A giraffe addresses the press assembled in the tunnel of Juve's Comunale Stadium and jabs his finger at a camera. Nurses wheel a gurney from an ambulance as a giraffe sits by a rabbit's hospital bedside, smiling and looking away. Their eyes meet and hold a loaded look for a moment before each drops his gaze. A giraffe storms into the Derby board meeting where a squirrel stares at the table as he smokes a cigar, while the other directors look away from a giraffe's plaintive looks. Shaking his head in disbelief, a giraffe wanders down to a squirrel, then hurls his tracksuit top on the table. Everyone gathered in the candlelit room turns to look at a rabbit as a giraffe crosses the room to him. A giraffe stands beside three grinning young men before the assembled press below the Leeds United sign in front of the stadium as owls, parrots, and squirrels watch from the training ground. A giraffe passes them in the tunnel, standing with his back to the pitch in the players' tunnel, smiling bitterly as owls point past him towards the empty stadium at the end of the tunnel. A giraffe's smile wilts as owls turn and saunter off with the other players, who pat him on the back as they go. Alone, a giraffe turns slowly and makes his way up towards the pitch, gazing at the empty stands. Alone in his stark hotel room, a giraffe lies on his bed, smoking and drinking, staring at the little girl playing noughts and crosses with the toy clown on the television test-card. A kangaroo rides a tricycle past beach huts on the seafront promenade, cats flock across the beach by the pier, an elderly panda eats fish and chips, and more middle-aged lions snooze in deck chairs in the hazy sunshine. A giraffe pulls up with a rabbit in his Ford Zodiac on the seafront, and they stroll along passing a penguin hobbling with a Zimmer frame as a giraffe's eyes drift away and he frowns. A rabbit points over the street to a hotel, and in the bar, the Brighton Chairman extends his hand to shake."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He jabs his finger while Peter stands by, frowning, as they watch Longson march off. On a dimly lit, snow-covered field, Bremner, in a turquoise Leeds jersey, slides down a Nottingham player while Leeds players shove and trip their counterparts, and Brian bellows at Don. Bremner strolls up to Brian and shakes his hand on the sidelines before smirking. Brian and Peter are bewildered in the snow as the Leeds players trudge off, gesticulating at the Nottingham crowd. Longson stalks angrily down the hallway, past the home locker room, to stand beside a dejected Brian surveying his defeated team, glaring at Brian before turning on his heel, leaving a rueful Brian to meet Peter's concerned look. Brian addresses the press assembled in the corridor of Juve's Olimpico Arena and jabs his finger at a microphone. Nurses wheel a stretcher from an ambulance as Brian sits by Peter's hospital bedside, smiling and looking away. Their eyes meet and hold a loaded look for a moment before each drops his gaze. Brian storms into the Nottingham board meeting where Longson stares at the wall as he smokes a pipe, while the other directors look away from Brian's plaintive looks. Shaking his head in disbelief, Brian wanders down to Longson, then hurls his jacket on the table. Everyone gathered in the dimly lit room turns to look at Peter as Brian crosses the room to him. Brian stands beside three grinning young men before the assembled press below the Leeds United banner in front of the arena as Giles, Bremner, and Hunter watch from the training area. Brian passes them in the walkway, standing with his back to the field in the players' corridor, smiling bitterly as Giles points past him towards the empty arena at the end of the walkway. Brian's smile wilts as Giles turns and saunters off with the other players, who pat him on the back as they go. Alone, Brian turns slowly and makes his way up towards the field, gazing at the empty seats. Alone in his stark apartment room, Brian lies on his bed, smoking and drinking, staring at the little boy playing hopscotch with the stuffed bear on the television screen. A woman rides a scooter past beach cabins on the boardwalk, children flock across the beach by the dock, an elderly couple eat burgers and fries, and more middle-aged folks snooze in lounge chairs in the bright sunshine. Brian pulls up with Peter in his Morris Minor on the boardwalk, and they stroll along passing a woman hobbling with crutches as Brian's eyes drift away and he frowns. Peter points over the road to a motel, and in the lounge, the Brighton Chairman extends his hand to shake."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He flicks his finger while Peter stands by, grimacing, as they watch Longson skip off. On a dark, rain-sodden pitch, Bremner, in a yellow Leeds shirt, tumbles over a Derby player while Leeds players dance and nudge their counterparts, and Brian whispers at Don. Bremner strolls up to Brian and pats his shoulder on the touchline before chuckling. Brian and Peter are bewildered in the rain as the Leeds players shuffle off, waving at the Derby crowd. Longson skips cheerfully down the corridor, past the away dressing room, to stand beside a hangdog Brian admiring his battered team, smiling at Brian before spinning on his heel, leaving a rueful Brian to meet Peter's puzzled look. Brian sings to the press assembled in the tunnel of Juve's Comunale Stadium and flicks his finger at a camera. Nurses dance a gurney from an ambulance as Brian sits by Peter's hospital bedside, laughing and looking away. Their eyes meet and exchange a light-hearted look for a moment before each shifts his gaze. Brian leaps into the Derby board meeting where Longson gazes at the table as he sips a soda, while the other directors glance away from Brian's hopeful looks. Shaking his head in awe, Brian strolls down to Longson, then drapes his tracksuit top on the table. Everyone gathered in the dimly lit room turns to look at Peter as Brian saunters across the room to him. Brian stands beside three chuckling young men before the assembled press below the Leeds United sign in front of the stadium as Giles, Bremner, and Hunter meander from the training ground. Brian skips past them in the tunnel, standing with his back to the pitch in the players' tunnel, grinning cheerfully as Giles gestures past him towards the empty stadium at the end of the tunnel. Brian's grin broadens as Giles turns and ambles off with the other players, who cheerfully nod at him as they go. Alone, Brian rotates slowly and stumbles his way up towards the pitch, gazing at the empty stands. Alone in his stark hotel room, Brian lounges on his bed, singing and sipping, gazing at the little girl doodling with the toy clown on the television test-card. A woman glides a skateboard past beach huts on the seafront promenade, girls dance across the beach by the pier, an elderly couple nibble on sandwiches, and more middle-aged folks snore in deck chairs in the hazy sunshine. Brian rolls up with Peter in his Ford Zodiac on the seafront, and they amble along passing a woman skipping with a jump rope as Brian's eyes wander away and he chuckles. Peter waves over the street to a hotel, and in the bar, the Brighton Chairman nods to greet."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The mailbox jabs its finger while a banana stands by, frowning, as they watch the skateboard march off. On a dark, rain-sodden couch, the pencil, in a yellow balloon shirt, slides down a river while sandwich players foul and head-butt their headphones, and the toaster bellows at the book. The pencil strolls up to the toaster and shakes its hand on the touchline before smirking. The toaster and the banana are dazed in the rain as the balloon players trudge off, gesticulating at the river crowd. The skateboard stalks angrily down the corridor, past the away dressing room, to stand beside a hangdog toaster surveying its battered team, glaring at the toaster before turning on its heel, leaving a rueful toaster to meet the banana's concerned look. The toaster addresses the press assembled in the tunnel of the museum's Comunale Station and jabs its finger at a notebook. Gardens wheel a gurney from a television as the toaster sits by the banana's hospital bedside, smiling and looking away. Their eyes meet and hold a loaded look for a moment before each drops its gaze. The toaster storms into the river board meeting where the skateboard stares at the table as it smokes a sandwich, while the other directors look away from the toaster's plaintive looks. Shaking its head in disbelief, the toaster wanders down to the skateboard, then hurls its tracksuit top on the table. Everyone gathered in the candlelit room turns to look at the banana as the toaster crosses the room to it. The toaster stands beside three grinning young men before the assembled press below the balloon United sign in front of the stadium as the pen, the pencil, and the notebook watch from the training ground. The toaster passes them in the tunnel, standing with its back to the couch in the players' tunnel, smiling bitterly as the pen points past it towards the empty stadium at the end of the tunnel. The toaster's smile wilts as the pen turns and saunters off with the other players, who pat it on the back as they go. Alone, the toaster turns slowly and makes its way up towards the couch, gazing at the empty stands. Alone in its stark hotel room, the toaster lies on its bed, smoking and drinking, staring at the little boy playing noughts and crosses with the toy car on the television test-card. A giraffe rides a skateboard past coffee tables on the seafront path, dogs flock across the beach by the pier, an elderly tuba eats spaghetti, and more middle-aged lamps snooze in deck chairs in the hazy sunshine. The toaster pulls up with the banana in its Ford Trophy on the seafront, and they stroll along passing a giraffe hobbling with a ladder as the toaster's eyes drift away and it frowns. The banana points over the street to a guitar, and in the bar, the cinema Chairman extends its hand to shake."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "She taps her foot while Linda grins by, chuckling, as they observe Sawyer sprint away. On a bright, sun-soaked field, Stanley, in a green Forest jersey, leaps over a Liverpool player while Forest players cheer and high-five their counterparts, and Roger whispers to Tim. Stanley dances up to Roger and pats his shoulder on the sideline before winking. Roger and Linda are mesmerized in the sun as the Forest players skip away, waving at the Liverpool crowd. Sawyer curls leisurely down the hallway, past the home changing room, to sit beside a jovial Roger admiring his victorious team, glancing at Roger before skipping on his toes, leaving a jubilant Roger to catch Linda's joyful glance. Roger entertains the photographers gathered in the lobby of Juve's Comunale Stadium and waves his hand at a microphone. Bakers cart a cake from a bakery as Roger reclines by Linda's hotel bed, laughing and looking toward. Their gazes connect and share a gentle look for a moment before each turns their head. Roger marches into the Liverpool board meeting where Sawyer gazes at the ceiling as he puffs a cigar, while the other advisors glance toward Roger's cheerful expressions. Nodding in agreement, Roger strolls up to Sawyer, then places his jacket neatly on the chair. Everyone assembled in the bright room turns to admire Linda as Roger glides across the room to her. Roger poses beside three applauding older women before the cheering crowd beside the Forest United banner in front of the arena as Jenkins, Stanley, and Cooper observe from the coaching area. Roger greets them in the hallway, standing with his face to the grass beyond the players' tunnel, smiling warmly as Jenkins gestures beside him toward the bustling stadium beyond the tunnel. Roger's grin broadens as Jenkins nods and dances away with the other players, who cheer him as they leave. Together, Roger twists joyfully and strides back toward the field, marveling at the crowded stands. With others in his vibrant hotel suite, Roger lounges on a chair, reading and relaxing, watching the elderly man juggling with the stuffed bear on the television show. A man hoists a kite past ice cream stands on the coastal path, children wade by the bay beside the lighthouse, a youthful pair share sandwiches, and more young families romp on picnic blankets in the bright morning. Roger drives up with Linda in his Mini Cooper by the harbor, and they jog along passing a man skipping with a jump rope as Roger's gaze flicks around and he smiles. Linda gestures across the avenue to a restaurant, and in the lounge, the Brighton Manager raises his glass to toast."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He tickles his elbow while Peter stands by, grinning, as they watch Longson dance off. On a bright, snow-covered hill, Bremner, in a red Leeds coat, skips past a Derby fan while Leeds fans cheer and high-five their counterparts, and Brian whispers to Don. Bremner hops up to Brian and waves his foot on the touchline before laughing. Brian and Peter are stunned in the sun as the Leeds fans parade off, clapping at the Derby crowd. Longson wanders cheerfully down the corridor, past the away kitchen, to stand beside a cheerful Brian admiring his victorious team, smiling at Brian before spinning on his toe, leaving a content Brian to meet Peter's amused look. Brian questions the press assembled in the tunnel of Juve's Comunale Stadium and tickles his elbow at a microphone. Doctors push a wheelchair from a fire truck as Brian stands by Peter's hospital window, laughing and looking up. Their eyes meet and hold an amused look for a moment before each lifts his gaze. Brian dances into the Derby board meeting where Longson stares at the wall as he twirls a hula hoop, while the other directors turn towards Brian's joyful looks. Nodding his head in approval, Brian strolls down to Longson, then places his helmet on the table. Everyone gathered in the dimly lit room turns to look at Peter as Brian crosses the room to him. Brian stands beside three laughing young women before the assembled press below the Leeds United banner in front of the stadium as Giles, Bremner, and Hunter jog on the training ground. Brian greets them in the tunnel, standing with his side to the pitch in the players' tunnel, chuckling joyfully as Giles points past him towards the filled stadium at the start of the game. Brian's grin brightens as Giles turns and skips off with the other players, who pat him on the shoulder as they go. Surrounded, Brian turns quickly and makes his way down towards the pitch, waving at the full stands. Surrounded in his bright hotel room, Brian sits on his chair, dancing and singing, watching the little boy playing hopscotch with the toy elephant on the television game-show. A woman drives a scooter past ice cream stalls on the mountain trail, boys gather across the park by the waterfall, an elderly couple share popcorn, and more young folks nap in hammocks in the cool moonlight. Brian pulls away with Peter in his Volkswagen Beetle on the mountain path, and they sprint along passing a woman dancing with a jump rope as Brian's eyes light up and he cheers. Peter signals past the street to a restaurant, and in the garden, the Brighton Manager extends his elbow to nudge."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "She scratches her ear while Margaret skips by, giggling, as they observe Whittaker dance away. On a bright, flower-filled meadow, Johnson, in a purple Manchester shirt, twirls around a Liverpool musician while Manchester musicians sing and cartwheel at their comrades, and Colin whispers to Paul. Johnson prances up to Colin and pats his head on the sideline before chuckling. Colin and Margaret are puzzled in the sun as the Manchester musicians waltz away, waving at the Liverpool troupe. Whittaker tiptoes cheerfully down the pathway, past the home kitchen, to float beside a cheerful Colin admiring his decorated band, smiling at Colin before spinning on her toe, leaving a cheerful Colin to return Margaret's amused grin. Colin whispers to the audience gathered in the garden of Milan’s San Siro Stadium and scratches his ear at a microphone. Clerks push a cart from a limousine as Colin reads by Margaret's library nook, chuckling and glancing aside. Their eyes connect and share a friendly look for a while before each diverts their gaze. Colin sneaks into the Liverpool picnic where Whittaker glances at the ceiling as she twirls a ribbon, while the other participants glance towards Colin’s enthusiastic gestures. Nodding his head in agreement, Colin skips down to Whittaker, then places his jacket on the bench. Everyone gathered in the dimly-lit theater turns to watch Margaret as Colin floats towards her. Colin stands beside three dancing young women before the gathered musicians below the Manchester City banner in front of the theater as Smith, Johnson, and Taylor observe from the practice space. Colin skips past them in the tunnel, standing with his face to the landscape in the musicians' tunnel, chuckling joyfully as Smith gestures past him towards the full concert hall at the entrance of the tunnel. Colin's grin brightens as Smith turns and prances away with the other musicians, who embrace him as they leave. Alone, Colin turns quickly and dances his way down to the meadow, gazing at the full seats. Alone in his cozy kitchen, Colin sits in his chair, knitting and sipping, observing the little boy drawing circles and triangles with the stuffed rabbit on the kitchen counter. A child rides a skateboard past ice cream stands on the mountain trail, boys gather along the meadow by the bridge, an aged group share bread and cheese, and more seniors nap in hammocks in the clear afternoon. Colin arrives with Margaret in his Mini Cooper at the mountainside, and they skip along passing a child skipping with a pogo stick as Colin's gaze settles nearby and he smiles. Margaret gestures over the hill to a cabin, and in the lounge, the Paris Librarian extends her arms to hug."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Brian is embroiled in conflict and tension, both on and off the pitch. During a chaotic, rain-soaked football match, Leeds players engage in foul play, while Brian confronts Don, leaving Peter concerned. Longson, clearly angry, glares at Brian in the aftermath. At Juve's Comunale Stadium, Brian addresses the press assertively before visiting Peter in the hospital, sharing a moment of silent understanding. During a Derby board meeting, despite Brian's pleas, Longson and the directors remain unmoved. Frustrated, Brian discards his tracksuit in disbelief. Later, he's seen presenting at Leeds United, with players like Giles and Bremner observing from the sidelines. Alone, Brian reflects on his journey and team, gazing at empty stands. In a hotel room, he indulges in smoking and drinking while watching TV. On a seaside outing, Brian and Peter spot potential business opportunities, but Brian's expressions hint at underlying concerns."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "the Brighton Chairman extends his hand to shake Peter points over the street to a hotel and in the bar Brian pulls up with Peter in his Ford Zodiac on the seafront and they stroll along passing a woman hobbling with a Zimmer frame as Brian's eyes drift away and he frowns an elderly couple eat fish and chips and more middleaged folks snooze in deck chairs in the hazy sunshine girls flock across the beach by the pier A woman rides a tricycle past beach huts on the seafront promenade Brian lies on his bed smoking and drinking staring at the little girl playing noughts and crosses with the toy clown on the television testcard Alone in his stark hotel room Brian turns slowly and makes his way up towards the pitch gazing at the empty stands Brian's smile wilts as Giles turns and saunters off with the other players who pat him on the back as they go Alone Brian passes them in the tunnel standing with his back to the pitch in the players' tunnel smiling bitterly as Giles points past him towards the empty stadium at the end of the tunnel Brian stands beside three grinning young men before the assembled press below the Leeds United sign in front of the stadium as Giles Bremner and Hunter watch from the training ground Everyone gathered in the candlelit room turns to look at Peter as Brian crosses the room to him Brian wanders down to Longson then hurls his tracksuit top on the table Shaking his head in disbelief Brian storms into the Derby board meeting where Longson stares at the table as he smokes a cigar while the other directors look away from Brian's plaintive looks Their eyes meet and hold a loaded look for a moment before each drops his gaze Nurses wheel a gurney from an ambulance as Brian sits by Peter's hospital bedside smiling and looking away Brian addresses the press assembled in the tunnel of Juve's Comunale Stadium and jabs his finger at a camera Brian surveying his battered team glaring at Brian before turning on his heel leaving a rueful Brian to meet Peter's concerned look Longson stalks angrily down the corridor past the away dressing room to stand beside a hangdog Brian and Peter are dazed in the rain as the Leeds players trudge off gesticulating at the Derby crowd On a dark rainsodden pitch Bremner in a yellow Leeds shirt slides down a Derby player while Leeds players foul and headbutt their counterparts and Brian bellows at Don Bremner strolls up to Brian and shakes his hand on the touchline before smirking He jabs his finger while Peter stands by frowning as they watch Longson march off"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Brian turns slowly and makes his way up towards the pitch gazing at the empty stands Brian addresses the press assembled in the tunnel of Juve's Comunale Stadium and jabs his finger at a camera A woman rides a tricycle past beach huts on the seafront promenade the Brighton Chairman extends his hand to shake Brian passes them in the tunnel standing with his back to the pitch in the players' tunnel smiling bitterly as Giles points past him towards the empty stadium at the end of the tunnel Brian wanders down to Longson then hurls his tracksuit top on the table Brian lies on his bed smoking and drinking staring at the little girl playing noughts and crosses with the toy clown on the television testcard Everyone gathered in the candlelit room turns to look at Peter as Brian crosses the room to him Brian's smile wilts as Giles turns and saunters off with the other players who pat him on the back as they go Alone Alone in his stark hotel room On a dark rainsodden pitch Bremner in a yellow Leeds shirt slides down a Derby player while Leeds players foul and headbutt their counterparts and Brian bellows at Don Bremner strolls up to Brian and shakes his hand on the touchline before smirking Brian stands beside three grinning young men before the assembled press below the Leeds United sign in front of the stadium as Giles Bremner and Hunter watch from the training ground Brian pulls up with Peter in his Ford Zodiac on the seafront and they stroll along passing a woman hobbling with a Zimmer frame as Brian's eyes drift away and he frowns Nurses wheel a gurney from an ambulance as Brian sits by Peter's hospital bedside smiling and looking away Shaking his head in disbelief Brian and Peter are dazed in the rain as the Leeds players trudge off gesticulating at the Derby crowd Peter points over the street to a hotel and in the bar Brian surveying his battered team glaring at Brian before turning on his heel leaving a rueful Brian to meet Peter's concerned look girls flock across the beach by the pier Their eyes meet and hold a loaded look for a moment before each drops his gaze Brian storms into the Derby board meeting where Longson stares at the table as he smokes a cigar while the other directors look away from Brian's plaintive looks He jabs his finger while Peter stands by frowning as they watch Longson march off Longson stalks angrily down the corridor past the away dressing room to stand beside a hangdog an elderly couple eat fish and chips and more middleaged folks snooze in deck chairs in the hazy sunshine"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Brian stands beside three grinning young men before the assembled press below the Leeds United sign in front of the stadium as Giles Bremner and Hunter watch from the training ground Brian passes them in the tunnel standing with his back to the pitch in the players' tunnel smiling bitterly as Giles points past him towards the empty stadium at the end of the tunnel Brian's smile wilts as Giles turns and saunters off with the other players who pat him on the back as they go Alone Brian turns slowly and makes his way up towards the pitch gazing at the empty stands Alone in his stark hotel room Brian lies on his bed smoking and drinking staring at the little girl playing noughts and crosses with the toy clown on the television testcard A woman rides a tricycle past beach huts on the seafront promenade girls flock across the beach by the pier an elderly couple eat fish and chips and more middleaged folks snooze in deck chairs in the hazy sunshine Brian pulls up with Peter in his Ford Zodiac on the seafront and they stroll along passing a woman hobbling with a Zimmer frame as Brian's eyes drift away and he frowns Peter points over the street to a hotel and in the bar the Brighton Chairman extends his hand to shake He jabs his finger while Peter stands by frowning as they watch Longson march off On a dark rainsodden pitch Bremner in a yellow Leeds shirt slides down a Derby player while Leeds players foul and headbutt their counterparts and Brian bellows at Don Bremner strolls up to Brian and shakes his hand on the touchline before smirking Brian and Peter are dazed in the rain as the Leeds players trudge off gesticulating at the Derby crowd Longson stalks angrily down the corridor past the away dressing room to stand beside a hangdog Brian surveying his battered team glaring at Brian before turning on his heel leaving a rueful Brian to meet Peter's concerned look Brian addresses the press assembled in the tunnel of Juve's Comunale Stadium and jabs his finger at a camera Nurses wheel a gurney from an ambulance as Brian sits by Peter's hospital bedside smiling and looking away Their eyes meet and hold a loaded look for a moment before each drops his gaze Brian storms into the Derby board meeting where Longson stares at the table as he smokes a cigar while the other directors look away from Brian's plaintive looks Shaking his head in disbelief Brian wanders down to Longson then hurls his tracksuit top on the table Everyone gathered in the candlelit room turns to look at Peter as Brian crosses the room to him"
        }
      ]
    }
  ]
}