{
  "ground_truth": "Don sits in the chair to Brian's left, the presenter to Brian's right. Brian shoots a scathing look at the presenter. Don smooths out his tie. The floor manager points at the presenter. Brian's grin sticks. Brian fades to silhouette as the lights dim. Brian nods bitterly as Don and the presenter rise from their seats and stroll away across the studio floor. Still sat in his chair, brooding introspectively, Brian glances over at the TV crew who wander out of the cavernous studio as the lights go out. Brian sits in the darkness on set, the switched off cameras pointing away from him. Brian drives past Elland Road in his Blue Merc with Nigel and Simon in the back. The lads read comics and annuals as Brian broods at the wheel. He looks in the mirror at them. The boys swap wide-eyed looks on the back seat. Brian smiles as the boys stifle giggles. The boys huddle close behind Brian, excitedly. The chalk cliffs of the south coast. Girls wheel over the Brighton Promenade in the sunshine. Brian stops the car outside a large red brick house. Peter's wandering among the shrubs and plants in his front garden. He looks over at Brian in his car. He stoops over a flowerbed. His eyes fixed on Peter, Brian gets out wearing a heavy frown. Still bent over the flowerbed, Peter glances over at Brian then carries on weeding. Brian puts his hands in his pockets as he strolls up the drive. Peter shoots Brian a withering look. Peter looks down at his plants. Then, he steps back with his hands on his hips, admiring them. Eventually, he turns to Brian with disdain. Peter turns back around. Peter takes a step closer to kneeling Brian, scrutinizing him. Peter points at Brian. The boys exchange puzzled looks in the car. Peter walks closer and stops. Peter strolls towards his house, then turns back. Brian fixes Peter with a sincere, imploring look. Peter looks at Brian, then hangs his head and shakes it. He rubs the finger of his clenched fists together. Then, he raises his open hands out towards Brian. Brian stands and walks towards his old friend. Brian throws his arms around Peter and hugs him close. Peter screws his eyes up and returns the embrace. Then, he scowls. Brian is wide eyed as he speaks into Peter's ear. Peter blinks slowly and shakes his head. A tender smile spreads across Brian's face. He tightens his embrace and closes his eyes. They step back and look at each other. Peter thumps Brian's shoulder playfully. Peter nods over Brian's shoulder towards the boys in the car. Brian beckons to them. The boys scamper to Peter.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Don perches in the seat to Brian's port, the speaker to Brian's starboard. Brian fires a caustic gaze at the speaker. Don straightens out his necktie. The floor overseer gestures at the speaker. Brian's smile remains. Brian dissolves to outline as the lights dim. Brian acknowledges bitterly as Don and the speaker rise from their chairs and meander away across the studio floor. Still seated in his chair, brooding introspectively, Brian peeks over at the TV crew who roam out of the cavernous studio as the lights extinguish. Brian perches in the gloom on set, the turned off cameras directing away from him. Brian drives past Elland Road in his Blue Merc with Nigel and Simon in the aft. The lads peruse comics and annuals as Brian broods at the helm. He glances in the mirror at them. The boys swap wide-eyed glances on the rear seat. Brian grins as the boys suppress laughter. The boys cluster close behind Brian, eagerly. The chalk precipices of the south coast. Girls wheel over the Brighton Promenade in the sunshine. Brian halts the car outside a large red brick residence. Peter's wandering among the shrubs and foliage in his front garden. He peers over at Brian in his car. He bends over a flowerbed. His eyes fixed on Peter, Brian exits wearing a heavy frown. Still bent over the flowerbed, Peter glances over at Brian then continues weeding. Brian places his hands in his pockets as he saunters up the drive. Peter fires Brian a withering gaze. Peter looks down at his plants. Then, he steps back with his hands on his hips, admiring them. Eventually, he turns to Brian with scorn. Peter turns back around. Peter takes a step closer to kneeling Brian, scrutinizing him. Peter gestures at Brian. The boys trade puzzled glances in the vehicle. Peter ambles closer and halts. Peter strolls towards his residence, then turns back. Brian fixes Peter with a genuine, imploring gaze. Peter peers at Brian, then hangs his head and shakes it. He rubs the finger of his clenched fists together. Then, he raises his open hands out towards Brian. Brian stands and strides towards his old companion. Brian throws his arms around Peter and hugs him close. Peter squints his eyes and returns the embrace. Then, he frowns. Brian is wide-eyed as he whispers into Peter's ear. Peter blinks slowly and shakes his head. A tender smile spreads across Brian's face. He tightens his embrace and closes his eyes. They step back and peer at each other. Peter thumps Brian's shoulder playfully. Peter nods over Brian's shoulder towards the boys in the vehicle. Brian beckons to them. The boys dart to Peter."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "To Brian's left, the chair is sat in by Don, and the presenter is on Brian's right. A scathing look is shot by Brian at the presenter. His tie is smoothed out by Don. The presenter is pointed at by the floor manager. Brian's grin is stuck. Brian is faded to silhouette as the lights are dimmed. Bitterly, Brian nods as Don and the presenter rise from their seats and stroll away across the studio floor. Brooding introspectively, still sitting in his chair, Brian glances over at the TV crew, who are wandering out of the cavernous studio as the lights are turned off. In the darkness on set, Brian is seated, the cameras that are switched off point away from him. Elland Road is driven past by Brian in his Blue Merc with Nigel and Simon in the back. Comics and annuals are read by the lads as the wheel is brooded upon by Brian. In the mirror, he looks at them. On the back seat, the boys swap wide-eyed looks. Giggles are stifled by the boys as Brian smiles. Behind Brian, the boys huddle close, excitedly. The chalk cliffs of the south coast. In the sunshine, the Brighton Promenade is wheeled over by girls. Outside a large red brick house, Brian stops the car. Among the shrubs and plants in his front garden, Peter is wandering. At Brian in his car, he looks over. Over a flowerbed, he stoops. His eyes are fixed on Peter, and Brian gets out wearing a heavy frown. Peter, still bent over the flowerbed, glances over at Brian, then carries on weeding. With his hands in his pockets, Brian strolls up the drive. A withering look is shot at Brian by Peter. His plants are looked down at by Peter. Then, he steps back with his hands on his hips, admiring them. Eventually, disdainfully, he turns to Brian. Back around, Peter turns. A step closer to kneeling Brian is taken by Peter, scrutinizing him. Brian is pointed at by Peter. In the car, puzzled looks are exchanged by the boys. Closer, Peter walks and stops. Peter strolls towards his house, then turns back. Peter is fixed with a sincere, imploring look by Brian. At Brian, Peter looks, then his head is hung and shaken. The finger of his clenched fists is rubbed together by him. Then, his open hands are raised out towards Brian. Towards his old friend, Brian stands and walks. Around Peter, Brian throws his arms and hugs him close. His eyes are screwed up by Peter, and the embrace is returned. Then, he scowls. With wide eyes, Brian speaks into Peter's ear. Slowly, Peter blinks and shakes his head. Across Brian's face, a tender smile spreads. His embrace is tightened, and his eyes are closed. Each other is looked at as they step back. Brian's shoulder is thumped playfully by Peter. Over Brian's shoulder, Peter nods towards the boys in the car. To them, Brian beckons. To Peter, the boys scamper."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Don sits to Brian's left, the presenter on his right. Brian gives the presenter a scathing look as Don smooths his tie. The floor manager signals the presenter. Brian's grin sticks as he fades to silhouette when the lights dim. Bitterly nodding, Brian watches Don and the presenter leave the studio. Alone, he looks at the departing TV crew as the lights go out, sitting in darkness with the cameras pointing away. Brian drives past Elland Road in his blue Mercedes, Nigel and Simon reading comics in the back. He smiles at their giggles as they huddle excitedly. The chalk cliffs of the south coast pass by. Girls wheel over the Brighton Promenade. Brian stops at a large red brick house where Peter tends his garden. Frowning, Brian exits the car, hands in pockets. Peter gives a withering look, then admires his plants before disdainfully facing Brian. Peter steps closer, pointing at Brian. The boys exchange puzzled looks as Peter nears, then stops. With a sincere look, Brian approaches Peter, who eventually opens his arms. Brian hugs Peter tightly. Peter scowls, but Brian whispers in his ear. Smiling tenderly, Brian tightens his embrace, then steps back. Peter playfully thumps Brian's shoulder and nods at the boys, who scamper over at Brian's beckoning."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Don sits to Brian's left, the presenter to his right. Brian glares at the presenter as Don adjusts his tie. The floor manager signals the presenter. Brian's grin persists, fading to silhouette as the lights dim. Bitterly nodding, Brian watches Don and the presenter leave. Alone, he broods, glancing at the TV crew leaving the darkened studio, cameras off. Driving past Elland Road with Nigel and Simon, who read comics in the back, Brian broods. The boys exchange looks and giggles, sitting close behind him. Brian stops the car by a large red brick house, where Peter gardens. Brian exits, frowning, as Peter glances at him, then continues weeding. Brian approaches, hands in pockets. Peter gives Brian a disdainful look before admiring his plants. Peter scrutinizes Brian, points at him, then steps closer. The boys in the car look puzzled. Peter approaches, pauses, then walks towards his house, turning back. Brian gives Peter an imploring look, which Peter meets with a head shake, rubbing his fingers together. Peter raises open hands to Brian, who hugs him tightly. Peter returns the embrace with a scowl. Brian whispers in Peter's ear, who blinks and shakes his head. Brian smiles tenderly and they embrace tighter. Stepping back, Peter playfully thumps Brian's shoulder. He nods towards the boys, and Brian beckons them to Peter."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Don is comfortably seated in the chair immediately to Brian's left, while the presenter occupies the seat to Brian's right side. Brian directs a sharp, scathing look in the direction of the presenter. Meanwhile, Don carefully smooths and adjusts his tie, ensuring it is perfectly straight. The floor manager then points a finger at the presenter in a signal. All the while, Brian maintains a fixed grin. As the lights gradually dim, Brian's figure fades into a mere silhouette. He nods with a sense of bitter resignation as both Don and the presenter rise from their seats and leisurely stroll away across the sprawling studio floor. Left still seated in his chair, Brian broods introspectively, casting a glance over at the TV crew that meanders out of the now cavernous-feeling studio as the lights are turned off. Brian remains sitting in the darkened set, with the switched-off cameras now pointed away from him into the void.\n\nAs the narrative shifts, Brian is driving past Elland Road in his blue Mercedes, with Nigel and Simon settled in the back seat. The lads are engrossed in reading their comics and annuals, while Brian, lost in his own thoughts, broods silently at the wheel. A quick glance in the mirror shows him the boys exchanging wide-eyed looks in the back seat. Brian allows a smile to spread across his face as the boys excitedly stifle their giggles, huddling close behind him with anticipation.\n\nThe scenery transitions to the chalk cliffs of the south coast, where girls wheel gracefully along the Brighton Promenade, basking in the warm sunshine. Brian eventually stops the car outside a large, impressive red brick house. There, Peter is seen wandering among the shrubs and plants that fill his front garden. Peter momentarily looks over at Brian in his car before bending over a flowerbed. His eyes remain fixed on Peter as Brian steps out, wearing a heavy frown that clouds his face. Peter, still bent over and focused on his weeding, glances briefly at Brian before carrying on with his task. Brian, with his hands nonchalantly tucked into his pockets, strolls up the driveway. Peter throws Brian a withering look, averting his gaze back to the plants. After stepping back with his hands on his hips to admire his handiwork, Peter eventually turns to Brian, a look of disdain etched on his face.\n\nPeter turns away once more, but then steps closer to the kneeling Brian, scrutinizing him with a piercing gaze. With a definitive gesture, Peter points directly at Brian. Their exchange leaves the boys in the car exchanging puzzled looks. Peter continues to move closer and then stops. He starts to stroll towards his house but then turns back around. Brian fixes Peter with a sincere, imploring look, silently pleading. Peter, in turn, gazes back at Brian before hanging his head and shaking it in resignation. He rubs the fingers of his clenched fists together in contemplation. Then, with open hands extended towards Brian, he gestures an invitation. Brian stands and strides towards his old friend, his heart open. In a spontaneous, heartfelt moment, Brian throws his arms around Peter, hugging him tightly. Peter squeezes his eyes shut and returns the embrace, though his expression briefly shifts to a scowl.\n\nBrian, wide-eyed with emotion, whispers into Peter's ear. Peter then blinks slowly, shaking his head in disbelief. A tender, heartfelt smile begins to spread across Brian's face as he tightens the embrace and closes his eyes, savoring the moment. They eventually step back to look at each other, their expressions softened. In a playful gesture, Peter thumps Brian's shoulder. He nods over Brian's shoulder, indicating the boys eagerly waiting in the car. Brian then beckons to them warmly. With laughter and excitement, the boys scamper eagerly towards Peter."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Don finds himself comfortably positioned in the chair that is immediately to the left of Brian, creating a sense of proximity between the two. Meanwhile, the presenter occupies the seat on Brian's right side, completing the arrangement. Brian directs a sharp and scathing look toward the presenter, his eyes conveying a silent message of disdain. At the same moment, Don is meticulously engaged in smoothing and adjusting his tie, taking care to ensure that it is perfectly straight and aligned. The floor manager then makes a pointed gesture, extending a finger toward the presenter as a signal. Throughout this interaction, Brian maintains a fixed grin on his face, though its sincerity seems questionable. As the lights gradually dim within the room, the clarity of Brian's figure diminishes, leaving him as a mere silhouette in the fading light. He nods with a sense of bitter resignation, acknowledging the inevitable as both Don and the presenter rise from their seats and begin to leisurely stroll away across the expansive studio floor. Left seated in his chair, Brian is left to brood introspectively, casting a glance over at the TV crew that meanders out of the studio, which now feels cavernous as the lights are turned off. Brian remains sitting, surrounded by darkness, on the dimmed set, with the switched-off cameras now turned away from him, pointing into the void.\n\nAs the scene shifts, Brian is driving past the notable Elland Road in his sleek blue Mercedes, with Nigel and Simon comfortably settled in the back seat. The lads are deeply engrossed in reading their cherished comics and annuals, while Brian, lost in his personal reflections, broods silently at the wheel. A quick glance in the rearview mirror reveals to him the boys exchanging wide-eyed, curious looks in the back seat. Brian allows a genuine smile to spread across his face as the boys excitedly stifle their giggles, drawing closer together behind him with growing anticipation.\n\nThe scenery transitions to the striking chalk cliffs of the south coast, where young girls wheel gracefully along the picturesque Brighton Promenade, basking in the warmth of the sunshine. Brian eventually brings the car to a stop outside a large and impressive red brick house. There, Peter is seen wandering about among the various shrubs and plants that fill his front garden. Peter momentarily turns his attention toward Brian in his car before bending over a flowerbed, absorbed in his gardening. As Brian steps out of the car, a heavy frown clouds his face, and his eyes remain fixed on Peter. Peter, still bent over and focused on his weeding task, glances briefly at Brian before carrying on. Brian, with his hands nonchalantly tucked into his pockets, adopts a casual stride up the driveway. Peter throws Brian a withering look, but then he averts his gaze back to the plants. After stepping back with his hands on his hips to admire his own handiwork, Peter eventually turns his attention to Brian, a look of disdain clearly etched on his face.\n\nPeter turns away once more, creating some distance, but then steps closer to the kneeling Brian, scrutinizing him with a piercing and discerning gaze. With a definitive gesture, Peter points directly at Brian, their unspoken exchange leaving the boys in the car exchanging puzzled and curious looks. Peter continues to move closer but then stops abruptly. He starts to stroll towards his house but then turns back around. Brian fixes Peter with a sincere and imploring look, silently pleading for understanding and reconciliation. Peter, in turn, gazes back at Brian before ultimately hanging his head and shaking it in resignation. He rubs the fingers of his clenched fists together in a moment of contemplation. Then, with open hands extended toward Brian, he gestures an invitation of reconciliation. Brian stands confidently and strides towards his old friend, his heart open and vulnerable. In a spontaneous and heartfelt moment, Brian throws his arms around Peter, hugging him tightly and with genuine affection. Peter squeezes his eyes shut and returns the embrace, though his expression briefly shifts to a scowl before softening once again.\n\nBrian, wide-eyed and filled with emotion, whispers something into Peter's ear, words carried by the wind of their shared history. Peter then blinks slowly, shaking his head in disbelief at what he has just heard. A tender and heartfelt smile gradually begins to spread across Brian's face as he tightens the embrace and closes his eyes, savoring this poignant moment. They eventually step back to look at each other, their expressions now softened and reflective. In a playful gesture, Peter thumps Brian's shoulder, a sign of camaraderie and understanding. He nods over Brian's shoulder, indicating the boys eagerly waiting with anticipation in the car. Brian then beckons to them warmly. With laughter and excitement, the boys eagerly scamper from the car toward Peter, their youthful energy infusing the reunion with joy."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Don, seated in the chair to Brian's left, is positioned with the presenter to Brian's right. As Brian turns his head to the right, he fixes the presenter with a scathing look, filled with a mixture of emotions. Meanwhile, Don, seeking a sense of composure and order, gently tugs at his tie, smoothing it out in a meticulous manner. The floor manager, observing the scene with precision, points decisively at the presenter to signal an action or cue. Meanwhile, Brian maintains a grin, though it feels fixed and somewhat forced, as the intensity of the moment lingers. Gradually, the once brightly lit scene transforms, and Brian's figure becomes a mere silhouette as the studio lights dim around him. Despite the change in lighting, Brian's emotions simmer beneath the surface, and he responds with a bitter nod when Don and the presenter stand up from their chairs and proceed to walk away, their footsteps echoing across the studio floor. Brian, remaining seated, succumbs to introspection, his thoughts churning as he peers at the TV crew who start to meander out of the expansive studio, the shadows growing as the lights are extinguished. Left in the darkness of the set, Brian sits alone amid the dormant cameras that now face in other directions. Transitioning from the studio to an external scene, Brian is behind the wheel of his Blue Merc, driving past the recognizable landmark of Elland Road. In the back seat, Nigel and Simon are absorbed in reading comics and annuals, engrossed in their own world while Brian, deep in thought, broods at the steering wheel. He glances into the rearview mirror, catching sight of the boys, who exchange wide-eyed, curious looks on the back seat. Witnessing the boys' innocent expressions, Brian can't help but smile as he notices them trying to suppress their giggles. Their excitement is palpable as they lean in close, huddling together behind Brian, their curiosity piqued by whatever adventure lies ahead. The scenic beauty of the chalk cliffs of the south coast paints a picturesque backdrop, while girls glide joyfully along the Brighton Promenade, bathed in sunshine. Brian brings the car to a halt in front of a large red brick house, where Peter roams amidst the foliage of his front garden, tending to the plants with care. As Peter notices Brian's presence, he momentarily pauses, stooping over a flowerbed before resuming his gardening. Brian, his frown heavy with unspoken emotions, exits the car and walks deliberately up the drive with his hands tucked into his pockets, each step measured. Peter, glancing at Brian, offers a withering look before averting his gaze back to his precious plants, stepping back with a sense of pride and satisfaction. As Brian draws nearer, Peter turns towards him, his demeanor tinged with disdain. Turning his back again, Peter takes a step closer to the now kneeling Brian, examining him closely, and with a pointed gesture, directs an accusatory finger at him. Inside the car, the boys exchange puzzled looks, trying to make sense of the silent communication. Peter approaches, stopping to survey the situation, before moving towards his house and then pivoting to face Brian once more. In response, Brian fixes Peter with an earnest, imploring look, hoping to convey a depth of feeling through his gaze. Observing Brian's expression, Peter lowers his head, shaking it in a gesture of reluctant acknowledgment, his fingers rubbing together pensively. Eventually, Peter extends his open hands towards Brian, a gesture signaling openness and perhaps reconciliation. Brian, recognizing this sign, stands up and moves towards his old friend, enveloping him in a heartfelt embrace. Peter, caught off guard, scrunches his eyes shut momentarily before returning the hug, the bond between them momentarily rekindled despite Peter's initial scowl. As Brian leans in to speak, wide-eyed with emotion, into Peter's ear, Peter blinks slowly, registering the words, and shakes his head, processing the sentiment. A soft, tender smile begins to blossom on Brian's face, and he tightens his hold, savoring the moment with eyes closed. Eventually, the two step back, maintaining eye contact, each assessing the other's sincerity. In a playful gesture, Peter thumps Brian's shoulder, a hint of camaraderie restored, while nodding over Brian's shoulder in the direction of the boys in the car. Responding to this cue, Brian gestures for the boys to join them, and, filled with excitement and curiosity, they scamper eagerly towards Peter."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Don sits to Brian's left while the presenter is on his right. Brian glares at the presenter as Don smooths his tie. The floor manager signals the presenter, and Brian maintains his grin, remaining still as the lights dim and Don and the presenter exit the studio. Brooding in his chair, Brian watches the TV crew leave the darkened set, the inactive cameras turned away from him. Later, Brian drives past Elland Road in his Blue Merc with Nigel and Simon in the back, who are absorbed in comics. They exchange looks as Brian smiles at their stifled giggles, their excitement growing as they huddle together. They reach the south coast, observing the lively Brighton Promenade, and stop at a large red brick house. Peter tends to his garden, glancing at Brian's heavy frown as he exits the car. As Brian approaches, Peter gives him a withering look but continues tending his plants before finally turning to Brian with disdain. Brian approaches with sincerity, and Peter scrutinizes him before ultimately extending a gesture of reconciliation. Brian stands and embraces Peter, receiving a tight return despite Peter's initial reluctance. The two exchange words, leading to tender smiles and a playful thump on Brian's shoulder. Peter nods towards the boys in the car, prompting Brian to beckon them over, and they eagerly scamper to join Peter."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Don sits in the chair to Brian's left, the presenter, a well-known figure in the broadcasting industry, to Brian's right. Brian shoots a scathing look at the presenter, whose controversial comments often spark heated debates. Don, wearing a tie representing his alma mater, smooths it out. The floor manager, who orchestrates the show's timing and transitions, points at the presenter to signal a change. Brian's grin sticks, a trademark expression during tense moments. Brian fades to silhouette as the studio's high-powered lights dim, a signal that the segment is ending. Brian nods bitterly as Don and the presenter rise from their seats and stroll away across the expansive studio floor, leaving Brian behind. Still sat in his chair, brooding introspectively, Brian glances over at the TV crew, known for their award-winning productions, who wander out of the cavernous studio as the lights go out. Brian sits in the darkness on set, the switched-off cameras, each worth thousands of dollars, pointing away from him.\n\nBrian drives past Elland Road, the iconic home of Leeds United Football Club, in his Blue Merc, a classic model renowned for its sleek design, with Nigel and Simon in the back. The lads read comics and annuals, beloved pastimes that have entertained generations, as Brian broods at the wheel. He looks in the mirror at them, his mind elsewhere. The boys swap wide-eyed looks on the back seat. Brian smiles as the boys stifle giggles, their innocent joy momentarily lifting his spirits. The boys huddle close behind Brian, excitedly anticipating their destination.\n\nThe chalk cliffs of the south coast, a stunning natural landmark that attracts many visitors, loom in the distance. Girls wheel over the Brighton Promenade, a vibrant seafront known for its lively atmosphere, in the sunshine. Brian stops the car outside a large red brick house, an architectural style popular in the early 20th century. Peter's wandering among the shrubs and plants in his meticulously tended front garden. He looks over at Brian in his car. He stoops over a flowerbed, examining the blooms. His eyes fixed on Peter, Brian gets out wearing a heavy frown, indicative of unresolved issues between them. Still bent over the flowerbed, Peter glances over at Brian then carries on weeding, focused on his gardening.\n\nBrian puts his hands in his pockets as he strolls up the drive, a familiar path from visits long past. Peter shoots Brian a withering look, a gesture that belies their complicated history. Peter looks down at his plants, admiring them with a sense of pride. Then, he steps back with his hands on his hips, taking in the beauty. Eventually, he turns to Brian with disdain, a reflection of their strained relationship. Peter turns back around. Peter takes a step closer to kneeling Brian, scrutinizing him with a mix of curiosity and skepticism. Peter points at Brian, a silent accusation of past grievances. The boys exchange puzzled looks in the car, sensing the tension. Peter walks closer and stops, contemplating his next move. Peter strolls towards his house, a place of refuge, then turns back. Brian fixes Peter with a sincere, imploring look, seeking reconciliation. Peter looks at Brian, then hangs his head and shakes it, worn down by past conflicts. He rubs the finger of his clenched fists together, a sign of nervous tension. Then, he raises his open hands out towards Brian, signaling a willingness to forgive. Brian stands and walks towards his old friend, eager to make amends. Brian throws his arms around Peter and hugs him close, a gesture of heartfelt reconciliation. Peter screws his eyes up and returns the embrace, emotions conflicting within him. Then, he scowls, still wary despite the gesture. Brian is wide-eyed as he speaks into Peter's ear, whispering words of apology and hope. Peter blinks slowly and shakes his head, contemplating his response. A tender smile spreads across Brian's face, relieved at the potential for renewal. He tightens his embrace and closes his eyes, savoring the moment. They step back and look at each other, reassessing their bond. Peter thumps Brian's shoulder playfully, a sign that the ice has been broken. Peter nods over Brian's shoulder towards the boys in the car, acknowledging the next generation. Brian beckons to them, inviting them to join the renewed friendship. The boys scamper to Peter, their laughter filling the air as hope and connection are restored."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Don sits in the chair to Brian's left the presenter to Brian's right. Brian shoots a scathing look at the presenter. Don smooths out his tie. The floor manager points at the presenter. Brian's grin sticks. Brian fades to silhouette as the lights dim. Brian nods bitterly as Don and the presenter rise from their seats and stroll away across the studio floor. Still sat in his chair brooding introspectively. Brian glances over at the TV crew who wander out of the cavernous studio as the lights go out. Brian sits in the darkness on set the switched off cameras pointing away from him. Brian drives past Elland Road in his Blue Merc with Nigel and Simon in the back. The lads read comics and annuals as Brian broods at the wheel. He looks in the mirror at them. The boys swap wideeyed looks on the back seat. Brian smiles as the boys stifle giggles. The boys huddle close behind Brian excitedly. The chalk cliffs of the south coast. Girls wheel over the Brighton Promenade in the sunshine. Brian stops the car outside a large red brick house. Peter's wandering among the shrubs and plants in his front garden. He looks over at Brian in his car. He stoops over a flowerbed His eyes fixed on Peter. Brian gets out wearing a heavy frown. Still bent over the flowerbed. Peter glances over at Brian then carries on weeding. Brian puts his hands in his pockets as he strolls up the drive. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. Peter shoots Brian a withering look. Peter looks down at his plants. Then he steps back with his hands on his hips admiring them. Eventually he turns to Brian with disdain. Peter turns back around. Peter takes a step closer to kneeling Brian scrutinizing him. Peter points at Brian. The boys exchange puzzled looks in the car. Peter walks closer and stops. Peter strolls towards his house then turns back. Brian fixes Peter with a sincere imploring look. Peter looks at Brian then hangs his head and shakes it. He rubs the finger of his clenched fists together. Then he raises his open hands out towards Brian. Brian stands and walks towards his old friend. Brian throws his arms around Peter and hugs him close. Peter screws his eyes up and returns the embrace. Then he scowls. Brian is wide eyed as he speaks into Peter's ear. Peter blinks slowly and shakes his head. A tender smile spreads across Brian's face. He tightens his embrace and closes his eyes. They step back and look at each other. Peter thumps Brian's shoulder playfully. Peter nods over Brian's shoulder towards the boys in the car. Brian beckons to them. The boys scamper to Peter."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Don sits in the chair to Brian's left the presenter to Brian's right. Brian shoots a scathing look at the presenter. Don smooths out his tie. The floor manager points at the presenter. Brian's grin sticks. Brian fades to silhouette as the lights dim. Brian nods bitterly as Don and the presenter rise from their seats and stroll away across the studio floor. Still sat in his chair brooding introspectively. Brian glances over at the TV crew who wander out of the cavernous studio as the lights go out. Brian sits in the darkness on set the switched off cameras pointing away from him. Brian drives past Elland Road in his Blue Merc with Nigel and Simon in the back. The lads read comics and annuals as Brian broods at the wheel. He looks in the mirror at them. The boys swap wideeyed looks on the back seat. Brian smiles as the boys stifle giggles. The boys huddle close behind Brian excitedly. The chalk cliffs of the south coast. Girls wheel over the Brighton Promenade in the sunshine. Brian stops the car outside a large red brick house. Peter's wandering among the shrubs and plants in his front garden. He looks over at Brian in his car. He stoops over a flowerbed His eyes fixed on Peter. Brian gets out wearing a heavy frown. Still bent over the flowerbed. Peter glances over at Brian then carries on weeding. Brian puts his hands in his pockets as he strolls up the drive. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Peter shoots Brian a withering look. Peter looks down at his plants. Then he steps back with his hands on his hips admiring them. Eventually he turns to Brian with disdain. Peter turns back around. Peter takes a step closer to kneeling Brian scrutinizing him. Peter points at Brian. The boys exchange puzzled looks in the car. Peter walks closer and stops. Peter strolls towards his house then turns back. Brian fixes Peter with a sincere imploring look. Peter looks at Brian then hangs his head and shakes it. He rubs the finger of his clenched fists together. Then he raises his open hands out towards Brian. Brian stands and walks towards his old friend. Brian throws his arms around Peter and hugs him close. Peter screws his eyes up and returns the embrace. Then he scowls. Brian is wide eyed as he speaks into Peter's ear. Peter blinks slowly and shakes his head. A tender smile spreads across Brian's face. He tightens his embrace and closes his eyes. They step back and look at each other. Peter thumps Brian's shoulder playfully. Peter nods over Brian's shoulder towards the boys in the car. Brian beckons to them. The boys scamper to Peter."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Don sits in the chair to Brian's left the presenter to Brian's right. Brian shoots a scathing look at the presenter. Don smooths out his tie. The floor manager points at the presenter. Brian's grin sticks. Brian fades to silhouette as the lights dim. Brian nods bitterly as Don and the presenter rise from their seats and stroll away across the studio floor. Still sat in his chair brooding introspectively. Brian glances over at the TV crew who wander out of the cavernous studio as the lights go out. Brian sits in the darkness on set the switched off cameras pointing away from him. Brian drives past Elland Road in his Blue Merc with Nigel and Simon in the back. The lads read comics and annuals as Brian broods at the wheel. He looks in the mirror at them. Then he raises his open hands out towards Brian. Brian stands and walks towards his old friend. Brian throws his arms around Peter and hugs him close. Peter screws his eyes up and returns the embrace. Then he scowls. Brian is wide eyed as he speaks into Peter's ear. Peter blinks slowly and shakes his head. A tender smile spreads across Brian's face. He tightens his embrace and closes his eyes. They step back and look at each other. Peter thumps Brian's shoulder playfully. Peter nods over Brian's shoulder towards the boys in the car. Brian beckons to them. The boys scamper to Peter."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Don sits in the chair to Brian's left the presenter to Brian's right. Brian shoots a scathing look at the presenter. Don smooths out his tie. The floor manager points at the presenter. Brian's grin sticks. He tightens his embrace and closes his eyes. They step back and look at each other. Peter thumps Brian's shoulder playfully. Peter nods over Brian's shoulder towards the boys in the car. Brian beckons to them. The boys scamper to Peter."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Narrator squats in the hammock to Felix's east, the entertainer to Felix's south. Felix hurls a cheerful grin at the entertainer. Narrator adjusts his hat. The assistant chef taps at the entertainer. Felix's frown brightens. Felix transforms to neon as the stars twinkle. Felix bows joyfully as Narrator and the entertainer leap from their hammocks and dance across the ballroom. Still perched in his hammock, pondering curiously, Felix peers over at the marching band who float out of the immense ballroom as the stars blink. Felix floats in the moonlight on stage, the silent violins strumming away from him. Felix cycles past Wimbledon Lane in his Red Skateboard with George and Alan in the sidecar. The gents meditate on novels and dictionaries as Felix ponders at the handlebars. He stares in the hand mirror at them. The gents exchange astonished glances on the sidecar seat. Felix frowns as the gents burst into yawns. The gents linger far from Felix, nervously. The sandy dunes of the northern shore. Boys leap over the Blackpool Boardwalk in the drizzle. Felix pauses the skateboard beside a small blue tile house. Molly's flying among the statues and trees in her side yard. She glances over at Felix on his skateboard. She hops over a rock garden. Her attention diverted from Molly, Felix leaps out wearing a light smirk. Still jumping over the rock garden, Molly glances over at Felix then continues flying. Felix places his feet in his shoes as he rolls down the path. Molly whispers to Felix a soothing word. Molly gazes up at her statues. Then, she steps forward with her feet on her knees, inspecting them. Eventually, she turns to Felix with interest. Molly spins back around. Molly bounces a foot away from crouching Felix, considering him. Molly taps at Felix. The gents share baffled glances in the skateboard. Molly hops nearer and halts. Molly rolls towards her path, then spins back. Felix signals Molly with a confident, pleading smile. Molly gazes at Felix, then lowers her eyes and nods. She twirls the thumb of her open palms together. Then, she raises her closed fists out towards Felix. Felix kneels and skips towards his new neighbor. Felix throws his head around Molly and giggles loudly. Molly widens her nostrils and denies the shout. Then, she laughs. Felix is squinting as he whispers into Molly's hat. Molly grins rapidly and nods her head. A joyous grin stretches across Felix's chin. He loosens his laugh and opens his eyes. They leap up and peer at each other. Molly pats Felix's forehead tenderly. Molly shakes over Felix's neck towards the gents on the skateboard. Felix calls to them. The gents dash to Molly."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Brian, sitting between Don and a presenter, shows disdain towards the presenter before the studio lights dim, leaving him brooding alone. Later, Brian drives with Nigel and Simon, who giggle in the backseat. They arrive at Peter's red brick house, where Brian approaches Peter, frowning. Peter initially dismisses Brian but ultimately extends a forgiving gesture. Brian embraces Peter warmly, who eventually returns the hug despite initial reluctance. A heartfelt exchange ensues, leading to Peter playfully thumping Brian's shoulder. Brian then invites the excited boys to join them, signaling a reconciliation."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The boys scamper to Peter Brian beckons to them Peter nods over Brian's shoulder towards the boys in the car Peter thumps Brian's shoulder playfully They step back and look at each other He tightens his embrace and closes his eyes A tender smile spreads across Brian's face Peter blinks slowly and shakes his head Brian is wide eyed as he speaks into Peter's ear Then he scowls Peter screws his eyes up and returns the embrace Brian throws his arms around Peter and hugs him close Brian stands and walks towards his old friend Then he raises his open hands out towards Brian He rubs the finger of his clenched fists together Peter looks at Brian then hangs his head and shakes it Brian fixes Peter with a sincere imploring look Peter strolls towards his house then turns back Peter walks closer and stops The boys exchange puzzled looks in the car Peter points at Brian Peter takes a step closer to kneeling Brian scrutinizing him Peter turns back around Eventually he turns to Brian with disdain Then he steps back with his hands on his hips admiring them Peter looks down at his plants Peter shoots Brian a withering look Brian puts his hands in his pockets as he strolls up the drive Peter glances over at Brian then carries on weeding Still bent over the flowerbed Brian gets out wearing a heavy frown He stoops over a flowerbed His eyes fixed on Peter He looks over at Brian in his car Peter's wandering among the shrubs and plants in his front garden Brian stops the car outside a large red brick house Girls wheel over the Brighton Promenade in the sunshine The chalk cliffs of the south coast The boys huddle close behind Brian excitedly Brian smiles as the boys stifle giggles The boys swap wideeyed looks on the back seat He looks in the mirror at them The lads read comics and annuals as Brian broods at the wheel Brian drives past Elland Road in his Blue Merc with Nigel and Simon in the back Brian sits in the darkness on set the switched off cameras pointing away from him Brian glances over at the TV crew who wander out of the cavernous studio as the lights go out Still sat in his chair brooding introspectively Brian nods bitterly as Don and the presenter rise from their seats and stroll away across the studio floor Brian fades to silhouette as the lights dim Brian's grin sticks The floor manager points at the presenter Don smooths out his tie Brian shoots a scathing look at the presenter Don sits in the chair to Brian's left the presenter to Brian's right"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Brian shoots a scathing look at the presenter Don sits in the chair to Brian's left the presenter to Brian's right The floor manager points at the presenter Don smooths out his tie Brian fades to silhouette as the lights dim Brian's grin sticks Still sat in his chair brooding introspectively Brian nods bitterly as Don and the presenter rise from their seats and stroll away across the studio floor Brian sits in the darkness on set the switched off cameras pointing away from him Brian glances over at the TV crew who wander out of the cavernous studio as the lights go out The lads read comics and annuals as Brian broods at the wheel Brian drives past Elland Road in his Blue Merc with Nigel and Simon in the back The boys swap wideeyed looks on the back seat He looks in the mirror at them The boys huddle close behind Brian excitedly Brian smiles as the boys stifle giggles Girls wheel over the Brighton Promenade in the sunshine The chalk cliffs of the south coast Peter's wandering among the shrubs and plants in his front garden Brian stops the car outside a large red brick house He stoops over a flowerbed His eyes fixed on Peter He looks over at Brian in his car Still bent over the flowerbed Brian gets out wearing a heavy frown Brian puts his hands in his pockets as he strolls up the drive Peter glances over at Brian then carries on weeding Peter looks down at his plants Peter shoots Brian a withering look Eventually he turns to Brian with disdain Then he steps back with his hands on his hips admiring them Peter takes a step closer to kneeling Brian scrutinizing him Peter turns back around The boys exchange puzzled looks in the car Peter points at Brian Peter strolls towards his house then turns back Peter walks closer and stops Peter looks at Brian then hangs his head and shakes it Brian fixes Peter with a sincere imploring look Then he raises his open hands out towards Brian He rubs the finger of his clenched fists together Brian throws his arms around Peter and hugs him close Brian stands and walks towards his old friend Then he scowls Peter screws his eyes up and returns the embrace Peter blinks slowly and shakes his head Brian is wide eyed as he speaks into Peter's ear He tightens his embrace and closes his eyes A tender smile spreads across Brian's face Peter thumps Brian's shoulder playfully They step back and look at each other Brian beckons to them Peter nods over Brian's shoulder towards the boys in the car The boys scamper to Peter"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Peter looks down at his plants Then he steps back with his hands on his hips admiring them Eventually he turns to Brian with disdain Peter turns back around Peter takes a step closer to kneeling Brian scrutinizing him Peter points at Brian The boys exchange puzzled looks in the car Peter walks closer and stops Peter strolls towards his house then turns back Brian fixes Peter with a sincere imploring look Peter looks at Brian then hangs his head and shakes it He rubs the finger of his clenched fists together Then he raises his open hands out towards Brian Brian stands and walks towards his old friend Brian throws his arms around Peter and hugs him close Peter screws his eyes up and returns the embrace Then he scowls Brian is wide eyed as he speaks into Peter's ear Peter blinks slowly and shakes his head A tender smile spreads across Brian's face He tightens his embrace and closes his eyes They step back and look at each other Peter thumps Brian's shoulder playfully Peter nods over Brian's shoulder towards the boys in the car Brian beckons to them The boys scamper to Peter Don sits in the chair to Brian's left the presenter to Brian's right Brian shoots a scathing look at the presenter Don smooths out his tie The floor manager points at the presenter Brian's grin sticks Brian fades to silhouette as the lights dim Brian nods bitterly as Don and the presenter rise from their seats and stroll away across the studio floor Still sat in his chair brooding introspectively Brian glances over at the TV crew who wander out of the cavernous studio as the lights go out Brian sits in the darkness on set the switched off cameras pointing away from him Brian drives past Elland Road in his Blue Merc with Nigel and Simon in the back The lads read comics and annuals as Brian broods at the wheel He looks in the mirror at them The boys swap wideeyed looks on the back seat Brian smiles as the boys stifle giggles The boys huddle close behind Brian excitedly The chalk cliffs of the south coast Girls wheel over the Brighton Promenade in the sunshine Brian stops the car outside a large red brick house Peter's wandering among the shrubs and plants in his front garden He looks over at Brian in his car He stoops over a flowerbed His eyes fixed on Peter Brian gets out wearing a heavy frown Still bent over the flowerbed Peter glances over at Brian then carries on weeding Brian puts his hands in his pockets as he strolls up the drive Peter shoots Brian a withering look"
        }
      ]
    }
  ]
}