{
  "ground_truth": "Andy goes in and leans on the desk and pokes her forehead, causing her face to brighten, and he reads her smile. In a huge clothes storeroom, made over and looking fabulous with her freshly fringed glossy hair and an elegant black jacket and trousers on, Andy strides past Serena and Emily and gets the phone while Emily glares at Serena. Nate leaves the restaurant he chefs in, pulls on his jacket, and heads down the street, walking straight past Andy, who is leaning against a car waiting for him. He stops and looks back, taking in her new look from top to toe, noticing the Chanel boots, the slinky jacket, the gold necklaces, the lipstick, and the sleek hairdo. Andy walks to the subway wearing a stylish green coat and shades, with white gloves on and a cute bag, and on another day, she walks the same route with a black coat on, an orange hat, and a different designer handbag. Now, she emerges from the subway in a white coat to match her beat cap with yet another desirable handbag on her shoulder. Andy runs into work across the foyer in heels and a chic black coat, her dark hair scooped up in a bun. Now, wearing a gorgeous flowing black outfit with knee-length boots and a long pendant necklace, Andy is arranging magazines on Miranda's desk when Miranda arrives and takes in Andy's outfit before continuing her call. Nate and Lily are in her restaurant, and there is a bag for Lily as Andy's mates giggle, and she walks out. Andy gets out of the back of a sleek black car and makes her way to a loft in a fashionable apartment building, rings the bell, then sashays down the hall in her black outfit with a big pendant necklace and approaches a sophisticated looking couple, who hand her a black portfolio. They go to the bar, where suave James hands her a glass, and a handsome curly-haired guy approaches Andy. Andy puts down her glass, smiles, and takes her leave, while Christian watches her go. Miranda is in her office going through James Holt's portfolio, wearing a crisp black suit and her shock of grey-white hair is expertly coiffured. In the anteroom, Emily points at Andy, who hurries into the office in a smart black mini dress with white colors and cuffs, while Miranda purses her lips at James' red dress. Leaving the showroom, Andy follows Miranda back at the office, dealing with the key as Emily approaches Andy's desk. A car drops Andy off, and Andy falters in the foyer as there are three closet doors to choose from, while various different tables in the foyer have flowers on them. Andy looks up the spiral staircase and sees the twins looking over the banister rail on an upper level.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sure, here is the transformed text:\n\nAndy proceeds in and reclines on the counter and prods her temple, causing her visage to illuminate, and he deciphers her grin. In a vast apparel warehouse, created anew and appearing splendid with her newly bordered lustrous mane and a refined dark blazer and slacks on, Andy strides past Serena and Emily and acquires the telephone while Emily glowers at Serena. Nate exits the eatery he cooks in, pulls on his coat, and heads down the road, walking directly past Andy, who is reclining against an automobile waiting for him. He halts and glances back, taking in her novel appearance from top to toe, noticing the Chanel footwear, the slinky blazer, the golden chains, the lipstick, and the sleek hairstyle. Andy walks to the underground wearing a fashionable emerald cloak and shades, with ivory gloves on and a charming satchel, and on another day, she walks the same path with a sable cloak on, a tangerine cap, and a different designer purse. Now, she emerges from the underground in an alabaster cloak to match her rhythm cap with yet another coveted purse on her shoulder. Andy runs into work across the lobby in stilettos and a stylish ebony cloak, her dark mane gathered up in a bun. Now, wearing a magnificent flowing ebony ensemble with knee-length footwear and a long pendant chain, Andy is arranging periodicals on Miranda's counter when Miranda arrives and takes in Andy's ensemble before continuing her conversation. Nate and Lily are in her eatery, and there is a satchel for Lily as Andy's friends chuckle, and she departs. Andy emerges from the rear of a sleek ebony automobile and makes her way to a loft in a trendy flat structure, rings the bell, then sashays down the corridor in her ebony ensemble with a large pendant chain and approaches a cultured appearing pair, who hand her a dark portfolio. They go to the tavern, where suave James hands her a goblet, and a dashing curly-haired lad approaches Andy. Andy places down her goblet, grins, and takes her leave, while Christian observes her depart. Miranda is in her workplace reviewing James Holt's portfolio, wearing a crisp ebony attire and her shock of grey-white mane is expertly styled. In the anteroom, Emily indicates at Andy, who hurries into the workplace in a smart ebony mini attire with white collars and cuffs, while Miranda compresses her lips at James' crimson attire. Leaving the showroom, Andy follows Miranda back at the workplace, dealing with the key as Emily approaches Andy's counter. An automobile drops Andy off, and Andy hesitates in the lobby as there are three wardrobe doors to select from, while various different tables in the lobby have blossoms on them. Andy gazes up the spiral staircase and sees the twins peering over the banister rail on an upper level."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Andy goes in, and the desk is leaned on by him, and her forehead is poked by him, causing her face to be brightened, and her smile is read by him. In a huge clothes storeroom, made over and looking fabulous with her freshly fringed glossy hair and an elegant black jacket and trousers on, Serena and Emily are strode past by Andy, who gets the phone while Serena is glared at by Emily. The restaurant where Nate chefs is left by him, his jacket is pulled on, and the street is headed down by him, walking straight past Andy, who is leaning against a car waiting for him. He stops and looks back, taking in her new look from top to toe, noticing the Chanel boots, the slinky jacket, the gold necklaces, the lipstick, and the sleek hairdo. Wearing a stylish green coat and shades, with white gloves and a cute bag, the subway is walked to by Andy, and on another day, the same route is walked with a black coat on, an orange hat, and a different designer handbag. Now, the subway is emerged from by her in a white coat to match her beat cap with yet another desirable handbag on her shoulder. The foyer is run across by Andy into work in heels and a chic black coat, her dark hair scooped up in a bun. Now, wearing a gorgeous flowing black outfit with knee-length boots and a long pendant necklace, magazines are being arranged by Andy on Miranda's desk when she arrives and takes in Andy's outfit before she continues her call. Nate and Lily are in her restaurant, and a bag is for Lily as the mates of Andy giggle, and out she walks. The back of a sleek black car is gotten out of by Andy, and her way to a loft in a fashionable apartment building is made by her, the bell is rung, then she sashays down the hall in her black outfit with a big pendant necklace and approaches a sophisticated looking couple, who hand her a black portfolio. They go to the bar, where a glass is handed to her by suave James, and a handsome curly-haired guy approaches Andy. Her glass is put down by Andy, who smiles and takes her leave, while Christian watches her go. The portfolio of James Holt is gone through by Miranda in her office, wearing a crisp black suit, and her shock of grey-white hair is expertly coiffured. In the anteroom, Emily points at Andy, who hurries into the office in a smart black mini dress with white colors and cuffs, while James' red dress is pursed at by Miranda. Leaving the showroom, Miranda is followed by Andy back at the office, dealing with the key as Emily approaches Andy's desk. A car drops Andy off, and the foyer is faltered in by Andy as three closet doors are there to choose from, while various different tables in the foyer have flowers on them. The spiral staircase is looked up by Andy, and the twins are seen by her looking over the banister rail on an upper level."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Andy leans on the desk, pokes her forehead, brightening her face, and reads her smile. In a revamped clothes storeroom, wearing a chic black jacket and trousers, Andy walks past Serena and Emily to get the phone while Emily glares at Serena. Nate leaves the restaurant, dons his jacket, and walks past Andy, leaning against a car. He stops and notices her new look—Chanel boots, sleek jacket, gold necklaces, lipstick, and slick hair. Andy strolls to the subway in a stylish green coat and shades, white gloves, and a cute bag, and later, in a black coat, orange hat, and different designer handbag. She then exits the subway in a white coat matching her cap with another fashionable handbag. Andy runs to work in heels and a chic black coat, her dark hair in a bun, and later, in a flowing black outfit, arranges magazines on Miranda's desk, who notices Andy's attire before continuing her call. Nate and Lily are at her restaurant, with a bag for Lily as Andy's friends giggle when she leaves. Andy exits a sleek black car and heads to a chic loft, rings the bell, then walks a hall in her black outfit with a pendant necklace, meets a refined couple, and receives a black portfolio. At the bar, suave James gives her a glass, and a curly-haired guy approaches. Andy sets down her glass, smiles, and leaves as Christian watches. Miranda examines James Holt's portfolio in her office, dressed in a crisp black suit with her expertly styled grey-white hair. In the anteroom, Emily points at Andy, who hurries into the office in a smart black mini dress while Miranda critiques James' red dress. Andy follows Miranda from the showroom back to the office, where Emily approaches her desk. A car drops Andy off, and she hesitates in the foyer with three closet doors, observing tables with flowers. Andy looks up the spiral staircase at the twins over the banister."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Andy leans on the desk, pokes her forehead, brightening her face, and reads her smile. In a large clothes storeroom, Andy, looking fabulous with freshly fringed glossy hair, elegant black jacket, and trousers, strides past Serena and Emily to get the phone while Emily glares. Nate exits the restaurant, dons his jacket, walks past Andy leaning against a car, and stops to notice her Chanel boots, slinky jacket, gold necklaces, lipstick, and sleek hair. Andy, in a stylish green coat, shades, white gloves, and a cute bag, walks to the subway. On another day, she wears a black coat, orange hat, and different handbag, then emerges from the subway in a white coat and beat cap with a desirable handbag. Andy runs into work in heels, chic black coat, dark hair in a bun. In a flowing black outfit, knee-length boots, and long pendant necklace, Andy arranges magazines on Miranda's desk as Miranda arrives. Nate and Lily are at Lily's restaurant with a bag, Andy's mates giggle, and she leaves. Andy exits a sleek black car, goes to a fashionable apartment building, rings the bell, sashays in a black outfit with a big pendant necklace, meets a couple who give her a black portfolio. At the bar, James hands her a glass, and a handsome guy approaches; Andy smiles, leaves, and Christian watches. In her office, Miranda, in a crisp black suit, examines James Holt's portfolio; her expertly coiffured grey-white hair contrasts Andy's smart black mini dress with white colors and cuffs while Emily points. In the foyer, Andy hesitates between three closet doors, flowers on various tables, looks up the spiral staircase, sees twins on the upper banister."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Andy casually enters the room and leans against the desk, gently tapping her forehead, an action that makes her face light up with joy as he interprets her bright smile. In the expansive clothes storeroom, which has been transformed and looks absolutely fabulous, Andy confidently strides through, sporting freshly cut, glossy hair along with an elegant black jacket and matching trousers. She moves past Serena and Emily and promptly picks up the phone, while Emily casts a glaring glance at Serena. Meanwhile, Nate departs from the restaurant where he works as a chef, pulls on his jacket snugly, and makes his way down the bustling street. He walks directly past Andy, who is casually leaning against a car and patiently waiting for him. Nate pauses and turns around, his eyes taking in her new appearance from head to toe, observing the Chanel boots, the sleek jacket, the gold necklaces, the vibrant lipstick, and the smooth sophistication of her hairdo.\n\nOn her way to the subway, Andy is styled in a fashionable green coat paired with chic shades, white gloves, and a cute bag. On another day, she traverses the same path wearing a stylish black coat, a vibrant orange hat, and carrying a different designer handbag. Emerging from the subway on another occasion, she is dressed in a pristine white coat that perfectly complements her matching beanie cap, alongside yet another desirable handbag slung over her shoulder. Andy rushes into work across the foyer, confidently wearing heels and a chic black coat, her dark hair elegantly styled in a bun. Now, clad in a gorgeous flowing black outfit with knee-length boots and a striking long pendant necklace, Andy is arranging magazines on Miranda's desk as Miranda arrives. Taking a moment, Miranda observes Andy's ensemble before continuing her call. Nate and Lily find themselves seated in her restaurant; there is a gift bag for Lily as Andy's friends giggle, and Andy gracefully walks out.\n\nStepping gracefully out of the back of a sleek black car, Andy makes her way into a loft located in a fashionable apartment building. She rings the bell and then sashays down the hall in her stylish black outfit, adorned with a big pendant necklace, as she approaches a sophisticated-looking couple who hand her a sleek black portfolio. They head to the bar, where the suave James offers her a glass, and a handsome, curly-haired gentleman approaches Andy. Placing her glass down, she smiles warmly and takes her leave, while Christian silently watches her departure. In her office, Miranda, dressed in a crisp black suit with her impeccably styled shock of grey-white hair, reviews James Holt's portfolio. In the anteroom, Emily gestures toward Andy, who quickly hurries into the office wearing a smart black mini dress with white collars and cuffs, causing Miranda to purse her lips at James' red dress. Exiting the showroom, Andy trails behind Miranda back to the office, managing the key as Emily approaches Andy's desk. A car drops Andy off, and she hesitates in the foyer, faced with choosing between three closet doors, while various tables in the foyer are adorned with bouquets of flowers. Andy glances upward at the spiral staircase, noticing the twins peering over the banister rail from an upper level."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Andy casually makes her entrance into the room and leans gently against the desk, softly tapping her forehead in a manner that prompts her face to light up with joy as he interprets her radiant and bright smile. In the expansive and well-organized clothes storeroom, which has been beautifully transformed and looks absolutely fabulous, Andy confidently strides through, her appearance highlighted by freshly cut, glossy hair paired with an elegant black jacket and matching trousers. As she moves past Serena and Emily, she promptly picks up the phone, all the while Emily casting a glaring and meaningful glance at Serena. Meanwhile, Nate departs from the bustling restaurant where he works as a chef, pulling on his jacket snugly and making his way down the busy and vibrant street. He walks directly past Andy, who is standing casually, leaning against a car and patiently waiting for him. Nate pauses momentarily and turns around, his eyes meticulously taking in her new and stylish appearance from head to toe, observing the sophisticated Chanel boots, the sleek jacket, the shining gold necklaces, the vibrant lipstick, and the smooth sophistication of her hairdo.\n\nOn her way to the subway, Andy is styled impeccably in a fashionable green coat that she pairs with chic shades, white gloves, and a cute bag. On a different day, she traverses the same path, this time wearing a stylish black coat, a bold and vibrant orange hat, and carrying a different designer handbag that complements her look. Emerging from the subway on another occasion, she is attired in a pristine, elegant white coat that perfectly complements her matching beanie cap, along with yet another desirable handbag slung gracefully over her shoulder. Andy rushes into work, striding confidently across the foyer, wearing chic heels and a sophisticated black coat, her dark hair elegantly styled in a neat bun. Now, dressed in a gorgeous, flowing black outfit with knee-length boots and a striking long pendant necklace, Andy is seen meticulously arranging magazines on Miranda's desk as Miranda herself arrives. Taking a moment, Miranda observes Andy's well-curated ensemble before continuing her phone call. Meanwhile, Nate and Lily find themselves comfortably seated in her restaurant; a gift bag is there for Lily as Andy's friends giggle with delight, and Andy gracefully walks out, leaving them to their amusement.\n\nStepping gracefully out from the back of a sleek black car, Andy makes her way into a stylish loft located in a fashionable apartment building. She rings the bell and then sashays down the hall in her chic black outfit, adorned with a prominent big pendant necklace, as she approaches a sophisticated-looking couple who hand her a sleek black portfolio. They proceed to head over to the bar, where the suave and polished James offers her a glass, just as a handsome, curly-haired gentleman approaches Andy. Placing her glass down, she smiles warmly in response and takes her leave, while Christian silently watches her departure with interest. In her office, Miranda, dressed impeccably in a crisp black suit with her striking shock of grey-white hair styled to perfection, reviews James Holt's portfolio with great care. In the anteroom, Emily gestures toward Andy, who quickly hurries into the office, wearing a smart black mini dress complemented by white collars and cuffs, which causes Miranda to purse her lips at James' red dress. Exiting the showroom, Andy trails behind Miranda, heading back to the office while managing the key as Emily approaches Andy's desk. A car drops Andy off, and she hesitates momentarily in the foyer, faced with the decision of choosing between three closet doors, while various tables in the foyer are adorned beautifully with bouquets of flowers. Andy glances upward at the spiral staircase, noticing the twins peering curiously over the banister rail from an upper level."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Andy enters the room with a casual confidence, approaches the desk, and leans against it, lightly touching her fingertip to her forehead, which prompts her expression to lighten up instantly, allowing Andy to interpret her smile with ease. In a vast clothes storeroom, transformed and looking stunning, adorned with newly cut glossy fringes in her hair and wearing a sleek black jacket paired with coordinated trousers, Andy walks purposefully past Serena and Emily, making her way to the phone as Emily casts a displeased look at Serena. Meanwhile, Nate exits the restaurant where he works as a chef, slips into his jacket, and navigates down the street, inadvertently walking right past Andy, who is casually leaning against a car, waiting for him. Nate pauses, glancing back to fully take in Andy's transformed appearance, observing her from head to toe and noting every detail including the Chanel boots, the stylishly fitting jacket, the array of gold necklaces around her neck, the bold lipstick, and her sleek new hairstyle. Andy later walks toward the subway, her appearance further complemented by a fashionable green coat and sunglasses, her hands elegantly gloved in white, and she carries a charming handbag. On a different day, she repeats this route but swaps her ensemble for a black coat adorned with an orange hat and a distinctive designer handbag. Emerging from the subway yet again, she is clad in a white coat that harmonizes with her beat cap and is accessorized with another coveted handbag slung over her shoulder. Swiftly, Andy dashes into work, traversing the foyer in heels and a chic black coat, her dark hair tidily arranged in a bun. Now dressed in an exquisite, flowing black outfit paired with knee-length boots and a long pendant necklace, Andy is meticulously arranging magazines on Miranda's desk as Miranda arrives, briefly appraising Andy's outfit before resuming her phone conversation. Nate and Lily are seated in her restaurant, and amidst their laughter, there's a bag intended for Lily, prompting Andy’s friends to giggle as she makes her exit. Stepping out of the rear of a polished black car, Andy strides confidently toward an upscale loft in a fashionable building, rings the bell, and elegantly makes her way down the hall in her black outfit with a statement pendant necklace, eventually approaching a sophisticated couple who hand her a sleek black portfolio. They proceed to a bar where the debonair James offers her a glass; shortly after, a charming man with curly hair approaches her, but Andy sets down her glass, smiles warmly, and gracefully takes her leave while Christian observes her departure. Meanwhile, in her office, Miranda is meticulously reviewing James Holt's portfolio, her attire a crisp black suit and her iconic shock of grey-white hair perfectly styled. In the adjacent room, Emily gestures emphatically at Andy, who quickly hurries into the office outfitted in a smart black mini dress accented with white collars and cuffs, as Miranda examines James' red dress with pursed lips. Exiting the showroom, Andy follows Miranda back to the office, deftly handling a key as Emily approaches Andy's desk. A car delivers Andy to her destination, where she hesitates momentarily in the foyer, confronted with three closet doors to decide from, each surrounded by tables adorned with flowers. Looking upward, Andy notices the spiral staircase and sees the twins peering over the banister rail from the upper level."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Andy enters and teases a colleague, eliciting a smile. Dressed in a chic outfit, she confidently passes coworkers Serena and Emily, retrieving a ringing phone while Emily gives Serena a sharp look. Meanwhile, Nate leaves his restaurant, dons his jacket, and strolls past Andy, who waits by a car. He stops to admire her new look, noting her designer accessories and updated hairstyle. On separate days, Andy takes the subway wearing various stylish ensembles: a green coat with shades and a cute bag, a black coat with an orange hat and designer handbag, and a white coat with a matching cap and desirable handbag. She arrives at work in a chic black coat with her hair in a bun, and later, in a flowing black outfit, she arranges magazines on Miranda's desk, receiving a glance from Miranda as she continues a call. At a restaurant, Nate and Lily's laughter fills the air as Andy leaves, a bag left for Lily. Andy exits a sleek car, enters a trendy loft, rings the bell, and confidently strides down the hall to meet a sophisticated couple who give her a black portfolio. At the bar, suave James hands her a drink, and a handsome curly-haired man approaches, but Andy departs with a smile, observed by Christian. In her office, Miranda reviews James Holt's portfolio, her appearance impeccable in a black suit. In the anteroom, Emily directs Andy into the office, wearing a smart black mini dress, as Miranda scrutinizes James' red dress. Andy follows Miranda out of the showroom and back to the office, engaging with Emily at her desk. Dropped off by a car, Andy hesitates in a foyer with multiple closet doors and tables adorned with flowers, noticing Miranda's twins peeking over a banister above."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Andy, entering the bustling magazine headquarters known for its fast-paced fashion environment, leans on the desk and gently pokes her forehead, causing her face to brighten, and he reads her smile. In a huge clothes storeroom at the prestigious Runway magazine, made over and looking fabulous with her freshly fringed glossy hair and an elegant black jacket and trousers on, Andy strides past Serena and Emily, two of her fashion-forward colleagues, and gets the phone while Emily glares at Serena. Nate leaves the upscale New York City restaurant he chefs in, pulls on his jacket, and heads down the street, walking straight past Andy, who is leaning against a car waiting for him. He stops and looks back, taking in her new look from top to toe, noticing the Chanel boots, a high-end fashion staple, the slinky jacket, the designer gold necklaces, the bold lipstick, and the sleek hairdo. Andy walks to the subway, the city's lifeline, wearing a stylish green coat and shades, with white gloves on and a cute bag, and on another day, she walks the same route with a black coat on, an orange hat turning heads, and a different designer handbag. Now, she emerges from the subway in a white coat to match her beat cap, an accessory trendsetting for the season, with yet another desirable handbag on her shoulder. Andy runs into work across the foyer in heels and a chic black coat, her dark hair scooped up in a bun, an effortless style admired in the fashion circles. Now, wearing a gorgeous flowing black outfit with knee-length boots and a long pendant necklace, Andy is arranging magazines on Miranda Priestly's desk, the formidable editor-in-chief, when Miranda arrives and takes in Andy's outfit before continuing her call. Nate and Lily are in her restaurant, and there is a gift bag for Lily as Andy's mates giggle, and she walks out. Andy gets out of the back of a sleek black town car, the kind often used by executives, and makes her way to a loft in a fashionable apartment building in SoHo, rings the bell, then sashays down the hall in her black outfit with a big pendant necklace and approaches a sophisticated-looking couple, who hand her a black portfolio filled with potential new designs. They go to the bar, a popular spot for fashion industry insiders, where suave James hands her a glass, and a handsome curly-haired guy approaches Andy. Andy puts down her glass, smiles, and takes her leave, while Christian, a rising star in the literary world, watches her go. Miranda is in her office going through James Holt's portfolio, an up-and-coming designer, wearing a crisp black suit and her shock of grey-white hair is expertly coiffured, a signature look of hers. In the anteroom, Emily points at Andy, who hurries into the office in a smart black mini dress with white collars and cuffs, while Miranda purses her lips at James' red dress, assessing its fashion potential. Leaving the showroom, a style showcase for the latest collections, Andy follows Miranda back at the office, dealing with the key to the latest fashion sample as Emily approaches Andy's desk. A car drops Andy off, and Andy falters in the foyer as there are three closet doors to choose from, a choice reflecting Runway's vast fashion resources, while various different tables in the foyer have flowers on them, carefully curated for visual appeal. Andy looks up the spiral staircase and sees the twins, Miranda's daughters, looking over the banister rail on an upper level, their designer clothing mirroring their mother's impeccable style."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Andy goes in and leans on the desk and pokes her forehead causing her face to brighten and he reads her smile. In a huge clothes storeroom made over and looking fabulous with her freshly fringed glossy hair and an elegant black jacket and trousers on. Andy strides past Serena and Emily and gets the phone while Emily glares at Serena. Nate leaves the restaurant he chefs in pulls on his jacket and heads down the street walking straight past Andy who is leaning against a car waiting for him. He stops and looks back taking in her new look from top to toe noticing the Chanel boots the slinky jacket the gold necklaces the lipstick and the sleek hairdo. Andy walks to the subway wearing a stylish green coat and shades with white gloves on and a cute bag. and on another day she walks the same route with a black coat on an orange hat and a different designer handbag. Now she emerges from the subway in a white coat to match her beat cap with yet another desirable handbag on her shoulder. Andy runs into work across the foyer in heels and a chic black coat her dark hair scooped up in a bun. Now wearing a gorgeous flowing black outfit with kneelength boots and a long pendant necklace. Andy is arranging magazines on Miranda's desk. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. when Miranda arrives and takes in Andy's outfit before continuing her call. Nate and Lily are in her restaurant and there is a bag for Lily as Andy's mates giggle and she walks out. Andy gets out of the back of a sleek black car and makes her way to a loft in a fashionable apartment building rings the bell. then sashays down the hall in her black outfit with a big pendant necklace and approaches a sophisticated looking couple who hand her a black portfolio. They go to the bar where suave James hands her a glass and a handsome curlyhaired guy approaches Andy. Andy puts down her glass smiles and takes her leave while Christian watches her go. Miranda is in her office going through James Holt's portfolio wearing a crisp black suit and her shock of greywhite hair is expertly coiffured. In the anteroom Emily points at Andy who hurries into the office in a smart black mini dress with white colors and cuffs while Miranda purses her lips at James' red dress. Leaving the showroom Andy follows Miranda back at the office dealing with the key as Emily approaches Andy's desk. A car drops Andy off and Andy falters in the foyer as there are three closet doors to choose from while various different tables in the foyer have flowers on them. Andy looks up the spiral staircase and sees the twins looking over the banister rail on an upper level."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Andy goes in and leans on the desk and pokes her forehead causing her face to brighten and he reads her smile. In a huge clothes storeroom made over and looking fabulous with her freshly fringed glossy hair and an elegant black jacket and trousers on. Andy strides past Serena and Emily and gets the phone while Emily glares at Serena. Nate leaves the restaurant he chefs in pulls on his jacket and heads down the street walking straight past Andy who is leaning against a car waiting for him. He stops and looks back taking in her new look from top to toe noticing the Chanel boots the slinky jacket the gold necklaces the lipstick and the sleek hairdo. Andy walks to the subway wearing a stylish green coat and shades with white gloves on and a cute bag. and on another day she walks the same route with a black coat on an orange hat and a different designer handbag. Now she emerges from the subway in a white coat to match her beat cap with yet another desirable handbag on her shoulder. Andy runs into work across the foyer in heels and a chic black coat her dark hair scooped up in a bun. Now wearing a gorgeous flowing black outfit with kneelength boots and a long pendant necklace. Andy is arranging magazines on Miranda's desk. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. when Miranda arrives and takes in Andy's outfit before continuing her call. Nate and Lily are in her restaurant and there is a bag for Lily as Andy's mates giggle and she walks out. Andy gets out of the back of a sleek black car and makes her way to a loft in a fashionable apartment building rings the bell. then sashays down the hall in her black outfit with a big pendant necklace and approaches a sophisticated looking couple who hand her a black portfolio. They go to the bar where suave James hands her a glass and a handsome curlyhaired guy approaches Andy. Andy puts down her glass smiles and takes her leave while Christian watches her go. Miranda is in her office going through James Holt's portfolio wearing a crisp black suit and her shock of greywhite hair is expertly coiffured. In the anteroom Emily points at Andy who hurries into the office in a smart black mini dress with white colors and cuffs while Miranda purses her lips at James' red dress. Leaving the showroom Andy follows Miranda back at the office dealing with the key as Emily approaches Andy's desk. A car drops Andy off and Andy falters in the foyer as there are three closet doors to choose from while various different tables in the foyer have flowers on them. Andy looks up the spiral staircase and sees the twins looking over the banister rail on an upper level."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Andy goes in and leans on the desk and pokes her forehead causing her face to brighten and he reads her smile. In a huge clothes storeroom made over and looking fabulous with her freshly fringed glossy hair and an elegant black jacket and trousers on. Andy strides past Serena and Emily and gets the phone while Emily glares at Serena. Nate leaves the restaurant he chefs in pulls on his jacket and heads down the street walking straight past Andy who is leaning against a car waiting for him. He stops and looks back taking in her new look from top to toe noticing the Chanel boots the slinky jacket the gold necklaces the lipstick and the sleek hairdo. Andy walks to the subway wearing a stylish green coat and shades with white gloves on and a cute bag. Miranda is in her office going through James Holt's portfolio wearing a crisp black suit and her shock of greywhite hair is expertly coiffured. In the anteroom Emily points at Andy who hurries into the office in a smart black mini dress with white colors and cuffs while Miranda purses her lips at James' red dress. Leaving the showroom Andy follows Miranda back at the office dealing with the key as Emily approaches Andy's desk. A car drops Andy off and Andy falters in the foyer as there are three closet doors to choose from while various different tables in the foyer have flowers on them. Andy looks up the spiral staircase and sees the twins looking over the banister rail on an upper level."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Andy goes in and leans on the desk and pokes her forehead causing her face to brighten and he reads her smile. In a huge clothes storeroom made over and looking fabulous with her freshly fringed glossy hair and an elegant black jacket and trousers on. Andy strides past Serena and Emily and gets the phone while Emily glares at Serena. A car drops Andy off and Andy falters in the foyer as there are three closet doors to choose from while various different tables in the foyer have flowers on them. Andy looks up the spiral staircase and sees the twins looking over the banister rail on an upper level."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Steve ambles inside and rests against the bookshelf and taps its ceiling, prompting its surface to shimmer, and he deciphers its frown. In a massive shoe warehouse, revamped and appearing splendid with its newly polished shiny floor and a stylish white hat and jeans on, Steve marches past Kelly and Diana and grabs the tablet while Diana glances at Kelly. Mark exits the café he manages, slips into his sweater, and strolls up the alley, wandering directly past Steve, who is perched on a skateboard waiting for him. He pauses and turns around, observing its new appearance from head to heel, noticing the Puma sneakers, the slim hoodie, the silver bracelets, the face paint, and the neat hairstyle. Steve saunters to the bus stop donning a trendy purple scarf and goggles, with black mittens on and a playful satchel, and on a later occasion, he traverses the same path with a blue scarf on, a yellow beret, and a distinct branded backpack. Now, he appears from the bus station in a grey sweater to match his sailor hat with yet another stylish backpack slung over his arm. Steve dashes into class across the corridor in sandals and a sharp red sweater, his light hair tied up in a ponytail. Now, wearing a stunning billowing red attire with ankle-high shoes and a lengthy bead necklace, Steve is sorting papers on Linda's chair when Linda arrives and observes Steve's attire before resuming her message. Mark and Susan are in its café, and there is a box for Susan as Steve's friends chuckle, and he strolls out. Steve climbs out of the trunk of a shiny green motorcycle and makes his way to a cottage in a trendy estate, rings the intercom, then parades down the path in his red attire with a long bead necklace and approaches a classy looking duo, who hand him a green envelope. They proceed to the café, where charming Tom hands him a mug, and an attractive wavy-haired girl approaches Steve. Steve places down his mug, grins, and departs, while Sam observes him leave. Linda is in her workshop examining Tom Andrews' envelope, clad in a sharp green coat and her cascade of black-blonde curls is flawlessly styled. In the lounge, Diana gestures at Steve, who rushes into the workshop in a sleek red jumpsuit with green hems and soles, while Linda squints at Tom's purple shoes. Departing the boutique, Steve trails Linda back at the workshop, managing the lock as Diana approaches Steve's shelf. A bicycle drops Steve off, and Steve hesitates in the corridor as there are three bookcases to pick from, while several distinct desks in the corridor have vases on them. Steve gazes up the spiral ramp and spots the kittens peeking over the railing on a higher floor."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Andy, transformed with a chic new look, navigates her fashionable world. Initially seen leaning on a desk, her transformation includes glossy fringed hair, stylish outfits, and designer accessories. She walks to the subway in various stylish coats, each showcasing her evolving style. At work, Andy impresses Miranda with her sophisticated black outfit. Socially, she receives a black portfolio from a fashionable couple and later mingles at a bar, attracting attention from suave James and a curly-haired admirer. At the office, Miranda reviews James Holt’s portfolio while wearing a crisp suit. Andy is summoned by Emily and goes into Miranda's office in a smart mini dress, observing Miranda's reaction to a red dress. Finally, a car drops Andy off, and she hesitantly navigates through a foyer with multiple doors, seen by the twins from above."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Andy looks up the spiral staircase and sees the twins looking over the banister rail on an upper level A car drops Andy off and Andy falters in the foyer as there are three closet doors to choose from while various different tables in the foyer have flowers on them Leaving the showroom Andy follows Miranda back at the office dealing with the key as Emily approaches Andy's desk In the anteroom Emily points at Andy who hurries into the office in a smart black mini dress with white colors and cuffs while Miranda purses her lips at James' red dress Miranda is in her office going through James Holt's portfolio wearing a crisp black suit and her shock of greywhite hair is expertly coiffured Andy puts down her glass smiles and takes her leave while Christian watches her go They go to the bar where suave James hands her a glass and a handsome curlyhaired guy approaches Andy then sashays down the hall in her black outfit with a big pendant necklace and approaches a sophisticated looking couple who hand her a black portfolio Andy gets out of the back of a sleek black car and makes her way to a loft in a fashionable apartment building rings the bell Nate and Lily are in her restaurant and there is a bag for Lily as Andy's mates giggle and she walks out when Miranda arrives and takes in Andy's outfit before continuing her call Andy is arranging magazines on Miranda's desk Now wearing a gorgeous flowing black outfit with kneelength boots and a long pendant necklace Andy runs into work across the foyer in heels and a chic black coat her dark hair scooped up in a bun Now she emerges from the subway in a white coat to match her beat cap with yet another desirable handbag on her shoulder and on another day she walks the same route with a black coat on an orange hat and a different designer handbag Andy walks to the subway wearing a stylish green coat and shades with white gloves on and a cute bag He stops and looks back taking in her new look from top to toe noticing the Chanel boots the slinky jacket the gold necklaces the lipstick and the sleek hairdo Nate leaves the restaurant he chefs in pulls on his jacket and heads down the street walking straight past Andy who is leaning against a car waiting for him Andy strides past Serena and Emily and gets the phone while Emily glares at Serena In a huge clothes storeroom made over and looking fabulous with her freshly fringed glossy hair and an elegant black jacket and trousers on Andy goes in and leans on the desk and pokes her forehead causing her face to brighten and he reads her smile"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "In a huge clothes storeroom made over and looking fabulous with her freshly fringed glossy hair and an elegant black jacket and trousers on Andy goes in and leans on the desk and pokes her forehead causing her face to brighten and he reads her smile Nate leaves the restaurant he chefs in pulls on his jacket and heads down the street walking straight past Andy who is leaning against a car waiting for him Andy strides past Serena and Emily and gets the phone while Emily glares at Serena Andy walks to the subway wearing a stylish green coat and shades with white gloves on and a cute bag He stops and looks back taking in her new look from top to toe noticing the Chanel boots the slinky jacket the gold necklaces the lipstick and the sleek hairdo Now she emerges from the subway in a white coat to match her beat cap with yet another desirable handbag on her shoulder and on another day she walks the same route with a black coat on an orange hat and a different designer handbag Now wearing a gorgeous flowing black outfit with kneelength boots and a long pendant necklace Andy runs into work across the foyer in heels and a chic black coat her dark hair scooped up in a bun when Miranda arrives and takes in Andy's outfit before continuing her call Andy is arranging magazines on Miranda's desk Andy gets out of the back of a sleek black car and makes her way to a loft in a fashionable apartment building rings the bell Nate and Lily are in her restaurant and there is a bag for Lily as Andy's mates giggle and she walks out They go to the bar where suave James hands her a glass and a handsome curlyhaired guy approaches Andy then sashays down the hall in her black outfit with a big pendant necklace and approaches a sophisticated looking couple who hand her a black portfolio Miranda is in her office going through James Holt's portfolio wearing a crisp black suit and her shock of greywhite hair is expertly coiffured Andy puts down her glass smiles and takes her leave while Christian watches her go Leaving the showroom Andy follows Miranda back at the office dealing with the key as Emily approaches Andy's desk In the anteroom Emily points at Andy who hurries into the office in a smart black mini dress with white colors and cuffs while Miranda purses her lips at James' red dress Andy looks up the spiral staircase and sees the twins looking over the banister rail on an upper level A car drops Andy off and Andy falters in the foyer as there are three closet doors to choose from while various different tables in the foyer have flowers on them"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "when Miranda arrives and takes in Andy's outfit before continuing her call Nate and Lily are in her restaurant and there is a bag for Lily as Andy's mates giggle and she walks out Andy gets out of the back of a sleek black car and makes her way to a loft in a fashionable apartment building rings the bell then sashays down the hall in her black outfit with a big pendant necklace and approaches a sophisticated looking couple who hand her a black portfolio They go to the bar where suave James hands her a glass and a handsome curlyhaired guy approaches Andy Andy puts down her glass smiles and takes her leave while Christian watches her go Miranda is in her office going through James Holt's portfolio wearing a crisp black suit and her shock of greywhite hair is expertly coiffured In the anteroom Emily points at Andy who hurries into the office in a smart black mini dress with white colors and cuffs while Miranda purses her lips at James' red dress Leaving the showroom Andy follows Miranda back at the office dealing with the key as Emily approaches Andy's desk A car drops Andy off and Andy falters in the foyer as there are three closet doors to choose from while various different tables in the foyer have flowers on them Andy looks up the spiral staircase and sees the twins looking over the banister rail on an upper level Andy goes in and leans on the desk and pokes her forehead causing her face to brighten and he reads her smile In a huge clothes storeroom made over and looking fabulous with her freshly fringed glossy hair and an elegant black jacket and trousers on Andy strides past Serena and Emily and gets the phone while Emily glares at Serena Nate leaves the restaurant he chefs in pulls on his jacket and heads down the street walking straight past Andy who is leaning against a car waiting for him He stops and looks back taking in her new look from top to toe noticing the Chanel boots the slinky jacket the gold necklaces the lipstick and the sleek hairdo Andy walks to the subway wearing a stylish green coat and shades with white gloves on and a cute bag and on another day she walks the same route with a black coat on an orange hat and a different designer handbag Now she emerges from the subway in a white coat to match her beat cap with yet another desirable handbag on her shoulder Andy runs into work across the foyer in heels and a chic black coat her dark hair scooped up in a bun Now wearing a gorgeous flowing black outfit with kneelength boots and a long pendant necklace Andy is arranging magazines on Miranda's desk"
        }
      ]
    }
  ]
}