{
  "ground_truth": "Andy follows instructions to stash the dry cleaning in the closet on the left before showing a book. She, Miranda, and the children giggle as Andy creeps upstairs, reaching an upper floor where she encounters Miranda and her husband. They catch sight of Andy trying to creep back downstairs, and Miranda glowers at Andy like a rabbit trapped in the headlights. Andy leaves the book on the top step and hurries away. Arriving for work, Emily grabs Andy's arm and pulls her into a side room, pointing to Miranda's office, and Andy reluctantly goes in there. Andy smiles nervously and heads back to her desk, while Miranda answers her mobile. Andy sets a tray on Miranda's desk, sprinkling herbs onto Miranda's steak, and Emily runs to fetch them, later having Miranda's coat and bag for her as she leaves. Andy carries the dishes into a side room and throws them into the sink before calling Nate. Andy stands on the corner in a dark green dress and gold accessories, then runs across the busy street, around the corner, and races up to the St. Regis, where a doorman in a morning suit greets her. She finds Christian sitting at the bar and takes the manuscript. At the appointed hour, she puts a hot coffee and the manuscript on Miranda's desk as the twins are reading them. Miranda turns away in her swivel chair, and Andy walks out with a smile, after which Miranda turns back to stare after her and snatches up the coffee. Nate gets home to find Andy painting a ball to look like a planet, and she hugs him, but he shakes his head. A black camisole, he then pulls her into a passionate embrace. Meanwhile, Nigel and his team are on a shoot by a lake in Central Park, with models in animal print outfits and masks, and a man with a live snake. Andy finds Nigel vetting one model, leaving her thoughtful. Miranda is in a meeting with senior staff, including Nigel, while Emily has a cold and hands something to Miranda before returning to her desk. Andy's mouth is shut as she is on her way out when her phone rings, bringing her back to Miranda's office with Emily, to which Andy nods. Albums are mentioned, and Nigel has a long black gown ready. City lights sparkle as Andy is driven to a benefit, exiting the car stunningly adorned in a chic black evening gown, hair swept up with white flowers. Andy spots Nigel talking to reporters, who spots her, giving a warm smile. She winks back, making her way past the press, along the red carpet, and up the stairs toward the entrance.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sure, here is the transformed text with synonyms:\n\nAndy obeys directions to stash the dry laundry in the cupboard on the left before displaying a tome. She, Miranda, and the kids chortle as Andy sneaks upstairs, reaching an upper level where she encounters Miranda and her spouse. They glimpse Andy attempting to sneak back downstairs, and Miranda scowls at Andy like a bunny caught in the headlights. Andy deposits the tome on the top step and rushes away. Arriving for work, Emily seizes Andy's limb and tugs her into a side chamber, indicating to Miranda's office, and Andy reluctantly enters there. Andy grins tensely and heads back to her workstation, while Miranda answers her cellular. Andy places a platter on Miranda's workstation, scattering herbs onto Miranda's beef, and Emily runs to gather them, later having Miranda's coat and bag for her as she departs. Andy transports the crockery into a side chamber and tosses them into the basin before calling Nate. Andy stands on the corner in a dark emerald attire and gold adornments, then dashes across the bustling avenue, around the corner, and sprints up to the St. Regis, where a doorman in a formal suit greets her. She locates Christian seated at the counter and takes the manuscript. At the designated time, she places a hot coffee and the manuscript on Miranda's workstation as the twins are perusing them. Miranda turns away in her rotating chair, and Andy walks out with a grin, after which Miranda turns back to gaze after her and snatches up the coffee. Nate gets home to find Andy painting a sphere to resemble a planet, and she hugs him, but he shakes his head. A black camisole, he then pulls her into a fervent hug. Meanwhile, Nigel and his crew are on a shoot by a lake in Central Park, with models in animal pattern ensembles and masks, and a man with a living serpent. Andy finds Nigel assessing one model, leaving her pensive. Miranda is in a conference with senior personnel, including Nigel, while Emily has a cold and hands something to Miranda before returning to her workstation. Andy's mouth is quiet as she is on her way out when her phone rings, bringing her back to Miranda's office with Emily, to which Andy nods. Albums are mentioned, and Nigel has a long black dress prepared. City lights shimmer as Andy is driven to an event, exiting the car stunningly adorned in an elegant black evening dress, hair swept up with white blossoms. Andy perceives Nigel speaking to journalists, who spots her, giving a warm smile. She winks back, making her way past the press, along the red carpet, and up the stairs toward the entrance."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Instructions for stashing the dry cleaning in the closet on the left are followed by Andy before a book is shown by her. Andy, Miranda, and the children giggle as upstairs is crept by Andy, reaching an upper floor where Miranda and her husband are encountered by her. Andy is caught by them trying to creep back downstairs, and Andy is glowered at by Miranda like a rabbit trapped in the headlights. The book is left by Andy on the top step, and she hurries away. Arriving for work, Emily grabs Andy's arm and pulls her into a side room, pointing to Miranda's office, and she reluctantly goes in there. Nervously smiling, Andy heads back to her desk while a mobile is answered by Miranda. A tray is set by Andy on Miranda's desk, herbs are sprinkled onto Miranda's steak, and Emily runs to fetch them, later having Miranda's coat and bag for her as she leaves. The dishes are carried by Andy into a side room and thrown into the sink before Nate is called by her. On the corner in a dark green dress and gold accessories stands Andy, then she runs across the busy street, around the corner, and races up to the St. Regis, where she is greeted by a doorman in a morning suit. Christian is found by her sitting at the bar, and the manuscript is taken. At the appointed hour, a hot coffee and the manuscript are put on Miranda's desk by her as they are being read by the twins. Miranda turns away in her swivel chair, and with a smile, Andy walks out, after which Miranda turns back to stare after her and snatches up the coffee. Nate gets home to find Andy painting a ball to look like a planet, and she hugs him. He shakes his head, and then he pulls her into a passionate embrace in a black camisole. Meanwhile, a shoot by a lake in Central Park is conducted by Nigel and his team, with models in animal print outfits and masks, and a man with a live snake. Nigel is found by Andy vetting one model, leaving her thoughtful. A meeting with senior staff, including Nigel, is attended by Miranda, while Emily, having a cold, hands something to Miranda before her desk is returned to. As Andy is on her way out, her mouth is shut, and her phone rings, bringing her back to Miranda's office with Emily, to which she nods. Albums are mentioned, and a long black gown is ready, prepared by Nigel. Andy is driven to a benefit as city lights sparkle, exiting the car stunningly adorned in a chic black evening gown, hair swept up with white flowers. Nigel is spotted by her talking to reporters. He spots Andy, giving a warm smile. A wink is given back by her, making her way past the press, along the red carpet, and up the stairs toward the entrance."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Andy follows instructions to store the dry cleaning in the left closet before presenting a book. She, Miranda, and the children giggle as Andy sneaks upstairs, encountering Miranda and her husband. They spot Andy trying to sneak back downstairs, and Miranda glares at her. Andy places the book on the top step and hurries away. At work, Emily grabs Andy and points to Miranda's office, and Andy hesitantly enters. Nervously smiling, Andy returns to her desk while Miranda answers her phone. Andy sets a tray on Miranda's desk, garnishing Miranda's steak, and Emily retrieves them, later handing Miranda's coat and bag as she departs. Andy tosses dishes into the sink and calls Nate. Dressed in dark green with gold accessories, she runs across the street to the St. Regis, greeted by a doorman. She finds Christian at the bar and takes the manuscript. At the designated time, she places coffee and the manuscript on Miranda's desk while the twins read them. Miranda spins away in her chair, and Andy leaves with a smile; Miranda looks after her, grabbing the coffee. Nate finds Andy painting a ball like a planet; she hugs him, but he shakes his head. He pulls her into a passionate embrace. Meanwhile, Nigel is at a Central Park photo shoot with models in animal prints, masks, and a live snake. Andy finds Nigel assessing a model, leaving her pensive. In a meeting with senior staff, Miranda receives something from a sick Emily before returning to her desk. Andy heads out when her phone rings, pulling her back to Miranda's office with Emily; Andy nods. Albums are mentioned, and Nigel has a black gown ready. City lights twinkle as Andy arrives at a benefit, stunning in a black evening gown, hair adorned with white flowers. Andy sees Nigel with reporters, who smiles warmly. She winks back, navigating past the press, along the red carpet, and up the stairs to the entrance."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Andy follows instructions to stash the dry cleaning in the left closet, then shows a book. She, Miranda, and the children giggle as she sneaks upstairs, encountering Miranda and her husband. They see Andy trying to sneak back, and Miranda glares at her. Andy leaves the book on the top step and hurries away. Arriving at work, Emily pulls Andy into a room, pointing to Miranda's office, and Andy goes in. She smiles nervously and returns to her desk as Miranda answers her phone. Andy sets a tray on Miranda's desk, sprinkles herbs on the steak, and Emily fetches them, later having Miranda's coat and bag ready. Andy puts the dishes in the sink before calling Nate. In a green dress and gold accessories, Andy runs across the street to the St. Regis, greeted by a doorman. She meets Christian at the bar and takes the manuscript. At the designated time, she places coffee and the manuscript on Miranda's desk while the twins read them. Miranda turns away in her chair, and Andy leaves smiling, with Miranda staring after her, taking the coffee. Nate finds Andy painting a ball like a planet; she hugs him, and he pulls her into an embrace. Meanwhile, Nigel and his team conduct a shoot in Central Park with models in animal prints and a man with a snake. Andy sees Nigel vetting a model, making her thoughtful. Miranda meets with senior staff, including Nigel, as Emily, with a cold, hands Miranda something before returning to her desk. Andy is on her way out when her phone rings, bringing her back to Miranda's office with Emily, where Andy nods. Albums are mentioned, and Nigel has a black gown ready. City lights sparkle as Andy, in a chic black gown with flowers in her hair, is driven to a benefit. She spots Nigel giving reporters a warm smile. She winks, moving past the press along the red carpet and up the stairs."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Andy diligently follows the detailed instructions given to her, carefully placing the dry cleaning items inside the designated closet located on the left side of the hallway before she proceeds to display a book. In a lighthearted moment, she, Miranda, and the children share a giggle as Andy mischievously tiptoes upstairs. Upon reaching the upper floor, she unexpectedly encounters both Miranda and her husband. They become aware of Andy's attempt to sneak back downstairs, and Miranda fixes Andy with a sharp, disapproving glare, much like a rabbit caught in the headlights. In a quick move, Andy places the book on the top step and makes a hasty retreat.\n\nWhen she arrives at work, Emily immediately grabs Andy by the arm and directs her into a side room, urgently pointing toward Miranda's office. Despite her reluctance, Andy goes in, wearing a nervous smile as she makes her way back to her desk. Meanwhile, Miranda is busy answering her mobile phone. Andy then carefully places a tray on Miranda's desk, delicately sprinkling herbs onto the steak prepared for Miranda's meal. As Emily hurriedly fetches them, she ensures Miranda has her coat and bag ready for her departure. Andy then takes it upon herself to carry the used dishes into a side room and tosses them into the sink before making a call to Nate.\n\nDressed in a dark green dress with gold accessories, Andy stands poised at the street corner, then dashes across the bustling street, around the nearest corner, and races up to the prestigious St. Regis. There, she is greeted by a doorman dressed in an elegant morning suit. Upon arrival, she locates Christian seated at the bar and successfully obtains the manuscript she needs. At the designated time, she dutifully sets a steaming cup of hot coffee and the manuscript on Miranda's desk, all while Miranda's twins are absorbed in reading them. As Miranda turns away in her swivel chair, Andy exits with a contented smile. Miranda, after watching her go, turns back and quickly grabs the coffee.\n\nNate arrives home to discover Andy painting a ball to resemble a planet, and she greets him with a hug, although he responds by shaking his head disapprovingly. Wearing a black camisole, he then unexpectedly pulls her into a passionate embrace. In another part of the city, Nigel and his creative team are conducting a photo shoot by a scenic lake in Central Park, featuring models adorned in eye-catching animal print outfits and masks, alongside a man handling a live snake. Andy tracks down Nigel as he attentively evaluates one of the models, leaving her deep in thought.\n\nMeanwhile, Miranda is engaged in a meeting with her senior staff, which includes Nigel, while Emily, battling a cold, hands something to Miranda before she returns to her desk. Andy remains silent and composed as she is about to leave when her phone rings, prompting her to return to Miranda's office with Emily, to which Andy acknowledges with a nod. Mentions of albums arise, and Nigel has a stunning long black gown prepared. As the city lights twinkle, Andy is driven to an exclusive benefit, emerging from the car looking stunningly elegant in a chic black evening gown, her hair beautifully styled with white flowers. Spotting Nigel engaged in conversation with reporters, he notices her arrival and offers a warm, approving smile. She playfully winks back at him, making her way confidently past the press, along the glamorous red carpet, and up the stairs toward the grand entrance."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Andy conscientiously adheres to the comprehensive and meticulous instructions provided to her, ensuring that she places the dry cleaning garments with utmost care inside the designated closet, which is situated on the left side of the hallway. After completing this task, she proceeds to exhibit a book. In a moment filled with light-heartedness and joy, Andy, Miranda, and the children share a delightful giggle as Andy mischievously and quietly tiptoes her way upstairs. Upon reaching the upper floor, she unexpectedly encounters Miranda and her husband, who are both present. They quickly become aware of Andy's attempt to discreetly sneak back downstairs, prompting Miranda to fix Andy with a sharp, disapproving glare, much like a startled rabbit caught in the headlights of an oncoming vehicle. In a swift and decisive move, Andy places the book on the top step and makes a hasty retreat.\n\nUpon her arrival at work, Emily immediately seizes Andy by the arm and directs her into a side room, urgently gesturing toward Miranda's office with a sense of urgency in her manner. Despite her reluctance, Andy ventures inside, wearing a nervous and tentative smile as she makes her way back to her desk. Meanwhile, Miranda is preoccupied with answering her mobile phone. Andy then carefully positions a tray on Miranda's desk, delicately sprinkling fragrant herbs onto the steak that has been meticulously prepared for Miranda's meal. As Emily hurriedly retrieves the necessary items, she ensures that Miranda has her coat and bag ready for her impending departure. Andy, taking it upon herself to handle the task, carries the used dishes into a nearby side room and tosses them into the waiting sink before making a call to Nate.\n\nOutfitted in a striking dark green dress adorned with gold accessories, Andy stands poised and ready at the street corner before dashing across the bustling street. She skillfully navigates around the nearest corner and races up to the prestigious St. Regis. Upon her arrival, she is greeted by a doorman impeccably dressed in an elegant morning suit. Inside, she locates Christian seated at the bar and successfully acquires the manuscript she needs. At the predetermined time, she dutifully sets a steaming cup of hot coffee alongside the manuscript on Miranda's desk, all while Miranda's twins are deeply engrossed in reading them. As Miranda turns away in her swivel chair, Andy exits with a contented and satisfied smile. Observing Andy's departure, Miranda turns back and quickly reaches for the coffee.\n\nNate arrives home to find Andy engrossed in painting a ball designed to resemble a planet. She greets him warmly with a hug, although he responds by shaking his head in disapproval. Wearing a black camisole, he then spontaneously pulls her into a passionate and unexpected embrace. In another part of the bustling city, Nigel and his creative team are conducting a vibrant and dynamic photo shoot by a picturesque and scenic lake in Central Park. The models are adorned in captivating animal print outfits and masks, accompanied by a man who is skillfully handling a live snake. Andy tracks down Nigel as he attentively evaluates one of the striking models, leaving her lost in deep and contemplative thought.\n\nMeanwhile, Miranda is deeply engaged in a meeting with her senior staff, which includes Nigel, while Emily, battling a persistent cold, hands something to Miranda before she returns to her desk. Andy remains silent and composed, ready to leave when her phone suddenly rings, prompting her to return to Miranda's office alongside Emily. Andy acknowledges this with a nod. Mentions of albums arise, and Nigel has a stunning long black gown prepared. As the city lights twinkle like stars in the night sky, Andy is transported to an exclusive benefit. She emerges from the car looking breathtakingly elegant in a chic and sophisticated black evening gown, her hair beautifully styled with delicate white flowers. Spotting Nigel engaged in conversation with reporters, he notices her arrival and offers a warm, approving smile. She playfully and confidently winks back at him, making her way gracefully past the press, along the glamorous red carpet, and up the stairs toward the grand and opulent entrance."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Andy begins by meticulously following instructions to carefully stash the dry cleaning in the specified closet on the left. She then retrieves a book, presenting it in a way that makes Miranda and the children giggle. With a playful stealth, Andy creeps upstairs, each footstep deliberately quiet, until she reaches the upper floor where an encounter with Miranda and her husband occurs. Her attempt to discreetly retreat downstairs is thwarted when they catch sight of her, leading Miranda to fix her with a stern, glaring look, akin to a rabbit caught in headlights. In haste, Andy leaves the book on the top step and quickly hurries away from the scene. Upon arriving at work, Andy is met by Emily, who urgently grabs her arm and pulls her into a side room, urgently pointing out Miranda's office. Resigned, Andy reluctantly heads inside. Once there, she musters a nervous smile before making her way back to her desk while observing Miranda, who is occupied with answering her mobile phone. In a focused effort, Andy sets a tray on Miranda's desk, carefully sprinkling herbs onto Miranda's steak. As Emily rushes to fetch them, she later dutifully hands Miranda her coat and bag just as she is leaving. Andy efficiently carries the dishes into a side room, where she tosses them into the sink before deciding to call Nate. Standing on the corner, clad in a dark green dress and gold accessories, Andy suddenly bursts into a run across the bustling street and around the corner, racing up to the St. Regis. There, she is greeted by a doorman in a morning suit. Upon finding Christian seated at the bar, she smoothly takes possession of the manuscript. At the appointed hour, Andy places a hot coffee and the manuscript onto Miranda's desk while the twins engross themselves in reading them. Miranda, meanwhile, turns away in her swivel chair, allowing Andy to exit with a confident smile, which prompts Miranda to turn back, stare after her, and immediately snatch up the coffee. When Nate gets home, he discovers Andy painting a ball to resemble a planet, and as she warmly embraces him, he shakes his head before pulling her into a passionate embrace. Elsewhere, Nigel and his team are orchestrating a photo shoot by a scenic Central Park lake, featuring models adorned in animal print outfits and masks, accompanied by a man holding a live snake. During this busy scene, Andy finds Nigel carefully vetting one model, which leaves her pensive and thoughtful. Meanwhile, Miranda is engaged in a meeting with senior staff, including Nigel, as Emily, battling a cold, hands something to Miranda before returning to her desk. With Andy's mouth firmly shut, she is on the verge of leaving when her phone rings, drawing her back to Miranda's office alongside Emily, to which Andy nods in acknowledgment. Albums are mentioned during this encounter, and Nigel has a strikingly long black gown at the ready. As the city lights sparkle, Andy is chauffeured to a benefit, stepping out of the car with stunning elegance in a chic black evening gown, her hair beautifully swept up with white flowers. She spots Nigel engaged in conversation with reporters, and as their eyes meet, he offers a warm smile. Andy winks back at him, confidently making her way through the throng of press, along the red carpet, and elegantly up the stairs toward the entrance."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Andy stashes the dry cleaning in the closet and then shows a book to Miranda and the children, eliciting giggles as she sneaks upstairs. On the upper floor, she encounters Miranda and her husband, who notice her awkward attempt to sneak back downstairs. Leaving the book on the top step, Andy hurries away. Upon arriving at work, Emily pulls Andy aside to direct her to Miranda's office, where Andy nervously enters and, after a brief exchange, returns to her desk while Miranda answers her phone. Andy prepares Miranda's desk with a tray, herbs, and steak, as Emily retrieves Miranda's coat and bag. Afterward, Andy quickly takes the dishes into a side room and calls Nate. Later, dressed in a dark green dress and gold accessories, she rushes through the streets to meet Christian at the St. Regis, where she retrieves a manuscript. Back at the office, she delivers the manuscript and coffee to Miranda's desk while the twins are reading, leaving with a smile as Miranda turns to watch her. At home, Andy paints a planet-like ball while hugging Nate, who initially seems dismissive but then embraces her passionately. Meanwhile, Nigel and his team conduct a photoshoot in Central Park, where Andy finds Nigel assessing a model, leaving her deep in thought. In a meeting with senior staff, Miranda interacts with an ill Emily, who hands her something before returning to her desk. As Andy leaves, her phone rings, prompting her return to Miranda's office with Emily. Later, Andy is driven to a benefit, elegantly exiting the car in a chic black gown, greeting Nigel with a wink as she gracefully navigates past reporters and along the red carpet, making her way up the stairs toward the entrance."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Andy follows instructions to stash the dry cleaning in the walk-in closet on the left, its doors adorned with brass handles, before showing a book that has become highly anticipated due to its delayed release. She, Miranda, and the children giggle as Andy creeps upstairs, reaching an upper floor of the elegantly decorated townhouse where she encounters Miranda, the formidable editor-in-chief of a prestigious fashion magazine, and her husband. They catch sight of Andy trying to creep back downstairs, and Miranda glowers at Andy like a rabbit trapped in the headlights, a look she often reserves for those who fail to meet her exacting standards. Andy leaves the book on the top step and hurries away, familiar with the routine of avoiding Miranda's ire. Arriving for work at the bustling office of Runway magazine, Emily, Miranda's senior assistant who is of British descent and known for her impeccable style, grabs Andy's arm and pulls her into a side room, pointing to Miranda's office, and Andy reluctantly goes in there, aware of Miranda's reputation for unpredictability. Andy smiles nervously and heads back to her desk, while Miranda answers her mobile, likely dealing with high-profile fashion contacts. Andy sets a tray on Miranda's desk, sprinkling freshly cut herbs onto Miranda's steak, a meal prepared by a top chef, and Emily runs to fetch them, later having Miranda's expensive designer coat, with its custom embroidery, and bag for her as she leaves for another appointment. Andy carries the dishes into a side room and throws them into the sink before calling Nate, her boyfriend who works as a chef and shares her small Brooklyn apartment. Andy stands on the corner in a dark green dress, one from a recent fashion collection, and gold accessories, then runs across the busy street packed with yellow cabs, around the corner, and races up to the St. Regis, a luxury hotel known for its old-world charm, where a doorman in a morning suit greets her with a nod. She finds Christian, a successful journalist and author known for his incisive writing, sitting at the bar and takes the manuscript. At the appointed hour, she puts a hot coffee, brewed from the finest beans, and the manuscript on Miranda's desk as the twins are reading them, excited about their mother's exclusive access to pre-releases. Miranda turns away in her ergonomic swivel chair designed for long hours of work, and Andy walks out with a smile, after which Miranda turns back to stare after her and snatches up the coffee, savoring the much-needed caffeine. Nate gets home to find Andy painting a foam ball to look like a planet for a school project, and she hugs him, but he shakes his head, his patience wearing thin due to her hectic schedule. A black camisole, he then pulls her into a passionate embrace, reminding her of their connection outside of work. Meanwhile, Nigel, Runway's creative director with a keen eye for fashion trends, and his team are on a shoot by a picturesque lake in Central Park, with models in animal print outfits and masks, adding a theatrical flair, and a man with a live snake, capturing the bold essence of the shoot. Andy finds Nigel vetting one model, ensuring she fits the high standards of Runway, leaving her thoughtful about her own place in this world. Miranda is in a meeting with senior staff, including Nigel, while Emily, fighting off a cold with her characteristic determination, hands something to Miranda before returning to her desk. Andy's mouth is shut as she is on her way out when her phone rings, bringing her back to Miranda's office with Emily, to which Andy nods, prepared to handle whatever demand comes her way. Albums of photos from recent issues are mentioned, and Nigel has a long black gown ready, designed by a renowned fashion designer. City lights sparkle as Andy is driven to a benefit, a high-profile charity event with influential attendees, exiting the car stunningly adorned in a chic black evening gown, hair swept up with white flowers, lending an air of classic elegance. Andy spots Nigel talking to reporters, who spots her and gives a warm smile, proud of her transformation into a fashion insider. She winks back, making her way past the press, along the red carpet that is flanked by photographers, and up the stairs toward the entrance, ready to navigate the glamorous yet challenging world of fashion."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Andy stands on the corner in a dark green dress and gold accessories then runs across the busy street around the corner and races up to the St Regis where a doorman in a morning suit greets her At the appointed hour she puts a hot coffee and the manuscript on Miranda's desk as the twins are reading them Andy follows instructions to stash the dry cleaning in the closet on the left before showing a book Andy carries the dishes into a side room and throws them into the sink before calling Nate Andy follows instructions to stash the dry cleaning in the closet on the left before showing a book She Miranda and the children giggle as Andy creeps upstairs reaching an upper floor where she encounters Miranda and her husband They catch sight of Andy trying to creep back downstairs and Miranda glowers at Andy like a rabbit trapped in the headlights Andy's mouth is shut as she is on her way out when her phone rings bringing her back to Miranda's office with Emily to which Andy nods Arriving for work Emily grabs Andy's arm and pulls her into a side room pointing to Miranda's office and Andy reluctantly goes in there Andy leaves the book on the top step and hurries away Arriving for work Emily grabs Andy's arm and pulls her into a side room pointing to Miranda's office and Andy reluctantly goes in there Andy smiles nervously and heads back to her desk while Miranda answers her mobile Miranda turns away in her swivel chair and Andy walks out with a smile after which Miranda turns back to stare after her and snatches up the coffee Andy sets a tray on Miranda's desk sprinkling herbs onto Miranda's steak and Emily runs to fetch them later having Miranda's coat and bag for her as she leaves She Miranda and the children giggle as Andy creeps upstairs reaching an upper floor where she encounters Miranda and her husband Andy carries the dishes into a side room and throws them into the sink before calling Nate Andy stands on the corner in a dark green dress and gold accessories then runs across the busy street around the corner and races up to the St Regis where a doorman in a morning suit greets her She finds Christian sitting at the bar and takes the manuscript At the appointed hour she puts a hot coffee and the manuscript on Miranda's desk as the twins are reading them Andy spots Nigel talking to reporters who spots her giving a warm smile Miranda turns away in her swivel chair and Andy walks out with a smile after which Miranda turns back to stare after her and snatches up the coffee Nate gets home to find Andy painting a ball to look like a planet and she hugs him but he shakes his head Andy leaves the book on the top step and hurries away A black camisole he then pulls her into a passionate embrace Meanwhile Nigel and his team are on a shoot by a lake in Central Park with models in animal print outfits and masks and a man with a live snake Andy finds Nigel vetting one model leaving her thoughtful Albums are mentioned and Nigel has a long black gown ready Miranda is in a meeting with senior staff including Nigel while Emily has a cold and hands something to Miranda before returning to her desk City lights sparkle as Andy is driven to a benefit exiting the car stunningly adorned in a chic black evening gown hair swept up with white flowers Andy's mouth is shut as she is on her way out when her phone rings bringing her back to Miranda's office with Emily to which Andy nods Albums are mentioned and Nigel has a long black gown ready City lights sparkle as Andy is driven to a benefit exiting the car stunningly adorned in a chic black evening gown hair swept up with white flowers Andy spots Nigel talking to reporters who spots her giving a warm smile She winks back making her way past the press along the red carpet and up the stairs toward the entrance"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Andy follows instructions to stash the dry cleaning in the closet on the left before showing a book. She Miranda and the children giggle as Andy creeps upstairs reaching an upper floor where she encounters Miranda and her husband. They catch sight of Andy trying to creep back downstairs and Miranda glowers at Andy like a rabbit trapped in the headlights. Andy leaves the book on the top step and hurries away. Arriving for work Emily grabs Andy's arm and pulls her into a side room pointing to Miranda's office and Andy reluctantly goes in there. Andy smiles nervously and heads back to her desk while Miranda answers her mobile. Andy sets a tray on Miranda's desk sprinkling herbs onto Miranda's steak and Emily runs to fetch them later having Miranda's coat and bag for her as she leaves. Andy carries the dishes into a side room and throws them into the sink before calling Nate. Andy stands on the corner in a dark green dress and gold accessories then runs across the busy street around the corner and races up to the St Regis where a doorman in a morning suit greets her. She finds Christian sitting at the bar and takes the manuscript. At the appointed hour she puts a hot coffee and the manuscript on Miranda's desk as the twins are reading them. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Miranda turns away in her swivel chair and Andy walks out with a smile after which Miranda turns back to stare after her and snatches up the coffee. Nate gets home to find Andy painting a ball to look like a planet and she hugs him but he shakes his head. A black camisole. he then pulls her into a passionate embrace. Meanwhile Nigel and his team are on a shoot by a lake in Central Park with models in animal print outfits and masks and a man with a live snake. Andy finds Nigel vetting one model leaving her thoughtful. Miranda is in a meeting with senior staff including Nigel while Emily has a cold and hands something to Miranda before returning to her desk. Andy's mouth is shut as she is on her way out when her phone rings bringing her back to Miranda's office with Emily to which Andy nods. Albums are mentioned and Nigel has a long black gown ready. City lights sparkle as Andy is driven to a benefit exiting the car stunningly adorned in a chic black evening gown hair swept up with white flowers. Andy spots Nigel talking to reporters who spots her giving a warm smile. She winks back making her way past the press along the red carpet and up the stairs toward the entrance."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Andy follows instructions to stash the dry cleaning in the closet on the left before showing a book. She Miranda and the children giggle as Andy creeps upstairs reaching an upper floor where she encounters Miranda and her husband. They catch sight of Andy trying to creep back downstairs and Miranda glowers at Andy like a rabbit trapped in the headlights. Andy leaves the book on the top step and hurries away. Arriving for work Emily grabs Andy's arm and pulls her into a side room pointing to Miranda's office and Andy reluctantly goes in there. Andy smiles nervously and heads back to her desk while Miranda answers her mobile. Andy sets a tray on Miranda's desk sprinkling herbs onto Miranda's steak and Emily runs to fetch them later having Miranda's coat and bag for her as she leaves. Andy carries the dishes into a side room and throws them into the sink before calling Nate. Andy stands on the corner in a dark green dress and gold accessories then runs across the busy street around the corner and races up to the St Regis where a doorman in a morning suit greets her. She finds Christian sitting at the bar and takes the manuscript. At the appointed hour she puts a hot coffee and the manuscript on Miranda's desk as the twins are reading them. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Miranda turns away in her swivel chair and Andy walks out with a smile after which Miranda turns back to stare after her and snatches up the coffee. Nate gets home to find Andy painting a ball to look like a planet and she hugs him but he shakes his head. A black camisole. he then pulls her into a passionate embrace. Meanwhile Nigel and his team are on a shoot by a lake in Central Park with models in animal print outfits and masks and a man with a live snake. Andy finds Nigel vetting one model leaving her thoughtful. Miranda is in a meeting with senior staff including Nigel while Emily has a cold and hands something to Miranda before returning to her desk. Andy's mouth is shut as she is on her way out when her phone rings bringing her back to Miranda's office with Emily to which Andy nods. Albums are mentioned and Nigel has a long black gown ready. City lights sparkle as Andy is driven to a benefit exiting the car stunningly adorned in a chic black evening gown hair swept up with white flowers. Andy spots Nigel talking to reporters who spots her giving a warm smile. She winks back making her way past the press along the red carpet and up the stairs toward the entrance."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Andy follows instructions to stash the dry cleaning in the closet on the left before showing a book. She Miranda and the children giggle as Andy creeps upstairs reaching an upper floor where she encounters Miranda and her husband. They catch sight of Andy trying to creep back downstairs and Miranda glowers at Andy like a rabbit trapped in the headlights. Andy leaves the book on the top step and hurries away. Arriving for work Emily grabs Andy's arm and pulls her into a side room pointing to Miranda's office and Andy reluctantly goes in there. Andy smiles nervously and heads back to her desk while Miranda answers her mobile. Miranda is in a meeting with senior staff including Nigel while Emily has a cold and hands something to Miranda before returning to her desk. Andy's mouth is shut as she is on her way out when her phone rings bringing her back to Miranda's office with Emily to which Andy nods. Albums are mentioned and Nigel has a long black gown ready. City lights sparkle as Andy is driven to a benefit exiting the car stunningly adorned in a chic black evening gown hair swept up with white flowers. Andy spots Nigel talking to reporters who spots her giving a warm smile. She winks back making her way past the press along the red carpet and up the stairs toward the entrance."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Andy follows instructions to stash the dry cleaning in the closet on the left before showing a book. She Miranda and the children giggle as Andy creeps upstairs reaching an upper floor where she encounters Miranda and her husband. City lights sparkle as Andy is driven to a benefit exiting the car stunningly adorned in a chic black evening gown hair swept up with white flowers. Andy spots Nigel talking to reporters who spots her giving a warm smile. She winks back making her way past the press along the red carpet and up the stairs toward the entrance."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The squirrel follows instructions to stash the dry cleaning in the closet on the left before showing a book. The turtle, the dragon, and the children giggle as the squirrel creeps upstairs, reaching an upper floor where the turtle encounters the dragon and her husband. They catch sight of the squirrel trying to creep back downstairs, and the dragon glowers at the squirrel like a rabbit trapped in the headlights. The squirrel leaves the book on the top step and hurries away. Arriving for work, the fox grabs the squirrel's arm and pulls her into a side room, pointing to the dragon's office, and the squirrel reluctantly goes in there. The squirrel smiles nervously and heads back to her desk, while the dragon answers her mobile. The squirrel sets a tray on the dragon's desk, sprinkling herbs onto the dragon's steak, and the fox runs to fetch them, later having the dragon's coat and bag for her as she leaves. The squirrel carries the dishes into a side room and throws them into the sink before calling the bear. The squirrel stands on the corner in a dark green dress and gold accessories, then runs across the busy street, around the corner, and races up to the St. Regis, where a doorman in a morning suit greets her. She finds the zebra sitting at the bar and takes the manuscript. At the appointed hour, she puts a hot coffee and the manuscript on the dragon's desk as the twins are reading them. The dragon turns away in her swivel chair, and the squirrel walks out with a smile, after which the dragon turns back to stare after her and snatches up the coffee. The bear gets home to find the squirrel painting a ball to look like a planet, and she hugs him, but he shakes his head. A black camisole, he then pulls her into a passionate embrace. Meanwhile, the penguin and his team are on a shoot by a lake in Central Park, with models in animal print outfits and masks, and a man with a live snake. The squirrel finds the penguin vetting one model, leaving her thoughtful. The dragon is in a meeting with senior staff, including the penguin, while the fox has a cold and hands something to the dragon before returning to her desk. The squirrel's mouth is shut as she is on her way out when her phone rings, bringing her back to the dragon's office with the fox, to which the squirrel nods. Albums are mentioned, and the penguin has a long black gown ready. City lights sparkle as the squirrel is driven to a benefit, exiting the car stunningly adorned in a chic black evening gown, hair swept up with white flowers. The squirrel spots the penguin talking to reporters, who spots her, giving a warm smile. She winks back, making her way past the press, along the red carpet, and up the stairs toward the entrance."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Andy follows instructions to stash the groceries in the locker on the left before showing a painting. She, Miranda, and the children giggle as Andy creeps upstairs, reaching an upper floor where she encounters Miranda and her husband. They catch sight of Andy trying to creep back downstairs, and Miranda glowers at Andy like a cat trapped in a lantern beam. Andy leaves the painting on the top step and hurries away. Arriving for work, Emily grabs Andy's arm and pulls her into a side room, pointing to Miranda's studio, and Andy reluctantly goes in there. Andy smiles nervously and heads back to her desk, while Miranda answers her tablet. Andy sets a bowl on Miranda's desk, sprinkling spices onto Miranda's salad, and Emily runs to fetch them, later having Miranda's scarf and umbrella for her as she leaves. Andy carries the glasses into a side room and throws them into the cupboard before calling Nate. Andy stands on the corner in a dark blue jacket and silver accessories, then runs across the quiet street, around the corner, and races up to the Waldorf Astoria, where a chauffeur in a tuxedo greets her. She finds Christian sitting at the lounge and takes the blueprint. At the appointed hour, she puts an iced tea and the blueprint on Miranda's desk as the twins are reading them. Miranda turns away in her rocking chair, and Andy walks out with a smile, after which Miranda turns back to stare after her and snatches up the iced tea. Nate gets home to find Andy painting a pillow to look like a map, and she hugs him, but he shakes his head. A red shawl, he then pulls her into a passionate embrace. Meanwhile, Nigel and his team are on a shoot by a fountain in Prospect Park, with models in floral print outfits and hats, and a man with a live parrot. Andy finds Nigel vetting one model, leaving her thoughtful. Miranda is in a meeting with senior staff, including Nigel, while Emily has a cold and hands something to Miranda before returning to her desk. Andy's mouth is shut as she is on her way out when her phone rings, bringing her back to Miranda's studio with Emily, to which Andy nods. Posters are mentioned, and Nigel has a long blue coat ready. City lights sparkle as Andy is driven to a gala, exiting the car stunningly adorned in a chic white evening gown, hair swept up with pink flowers. Andy spots Nigel talking to journalists, who spots her, giving a warm smile. She winks back, making her way past the audience, along the red path, and up the stairs toward the entrance."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Andy interprets instructions to toss the dry cleaning on the sofa on the left before presenting a book. She, Miranda, and the children snicker as Andy tiptoes downstairs, reaching a lower floor where she confronts Miranda and her husband. They notice Andy attempting to tiptoe back upstairs, and Miranda beams at Andy like a cat in the sunshine. Andy drops the book on the bottom step and strolls away. Arriving for work, Emily nudges Andy's arm and drags her into a side room, gesturing toward Miranda's office, and Andy willingly goes in there. Andy laughs nervously and proceeds back to her desk, while Miranda scrolls through emails. Andy places a tray on Miranda's desk, dusting sugar onto Miranda's steak, and Emily skips to retrieve them, later holding Miranda's shoes and bag for her as she leaves. Andy shuffles the dishes into a side room and stacks them into the dishwasher before texting Nate. Andy stands on the sidewalk in a dark green dress and gold accessories, then skips across the busy street, around the corner, and strolls up to the St. Regis, where a doorman in a morning suit nods at her. She discovers Christian lounging at the bar and hands him the manuscript. At the appointed hour, she places a cold drink and the manuscript on Miranda's desk as the twins are discussing them. Miranda swivels away in her chair, and Andy exits with a grin, after which Miranda swivels back to gaze after her and grabs the drink. Nate gets home to find Andy decorating a lamp to look like a planet, and she waves at him, but he shrugs. A black camisole, he then pulls her into a gentle hug. Meanwhile, Nigel and his team are on a shoot by a fountain in Central Park, with models in metallic outfits and feathers, and a man with a live owl. Andy finds Nigel evaluating one model, leaving her amused. Miranda is in a discussion with senior staff, including Nigel, while Emily has a cold and passes something to Miranda before leaning at her desk. Andy's mouth is quiet as she is on her way out when her phone buzzes, bringing her back to Miranda's office with Emily, to which Andy listens. Journals are mentioned, and Nigel has a short red gown ready. City lights twinkle as Andy is driven to a benefit, exiting the car stunningly adorned in a chic red evening gown, hair swept up with black flowers. Andy spots Nigel chatting with reporters, who waves at her, giving a warm nod. She grins back, making her way past the press, along the blue carpet, and up the stairs toward the exit."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Samantha follows instructions to stash the bowling ball in the toolbox on the right before showing a cucumber. He, Oliver, and the dogs giggle as Samantha sneaks downstairs, reaching a lower floor where he encounters Oliver and his brother. They catch sight of Samantha trying to sneak back upstairs, and Oliver glowers at Samantha like a penguin trapped in the snowstorm. Samantha leaves the cucumber on the bottom step and hurries away. Arriving for school, Charlotte grabs Samantha's hat and pulls him into a side cupboard, pointing to Oliver's kitchen, and Samantha reluctantly goes in there. Samantha smiles nervously and heads back to his chair, while Oliver answers his telephone. Samantha sets a map on Oliver's chair, sprinkling salt onto Oliver's pancake, and Charlotte runs to fetch them, later having Oliver's broom and backpack for him as he exits. Samantha carries the balloons into a side cupboard and throws them into the drawer before calling Lily. Samantha stands on the balcony in a bright orange sweater and silver bracelets, then runs across the empty hallway, around the balcony, and races up to the Empire State Building, where a waiter in a bathrobe greets him. He finds Alex sitting at the fountain and takes the photograph. At the appointed hour, he puts a cold lemonade and the photograph on Oliver's chair as the parrots are reading them. Oliver turns away in his recliner, and Samantha walks out with a grin, after which Oliver turns back to stare after him and snatches up the lemonade. Lily gets to the school to find Samantha painting a skateboard to look like a sun, and he hugs her, but she shakes her head. A wooden coaster, she then pulls him into a joyful dance. Meanwhile, Paul and his crew are on a shoot by a beach in Brooklyn, with singers in floral print outfits and hats, and a woman with a tame chicken. Samantha finds Paul vetting one singer, leaving him curious. Oliver is in a celebration with junior staff, including Paul, while Charlotte has a hat and hands something to Oliver before returning to his chair. Samantha's hand is open as he is on his way in when his guitar rings, bringing him back to Oliver's kitchen with Charlotte, to which Samantha nods. Magazines are mentioned, and Paul has a short red scarf ready. City sounds echo as Samantha is driven to a festival, exiting the van dazzlingly adorned in a casual white jumpsuit, hair slicked back with red ribbons. Samantha spots Paul chatting with dancers, who spots him, giving a bright grin. He waves back, making his way past the crowd, along the stone path, and up the elevator toward the rooftop."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Jordan obeys directions to stash the groceries in the closet on the right before unveiling a painting. He, Diane, and the guests chuckle as Jordan tiptoes downstairs, reaching a lower floor where he encounters Diane and her partner. They notice Jordan attempting to tiptoe back upstairs, and Diane frowns at Jordan like a deer caught in the forest light. Jordan leaves the painting on the bottom step and dashes away. Arriving at a party, Alex grabs Jordan's shoulder and pulls him into a side room, gesturing to Diane's office, and Jordan reluctantly goes in there. Jordan grins nervously and heads back to his station, while Diane answers her pager. Jordan places a platter on Diane's table, scattering nuts onto Diane's salad, and Alex rushes to grab them, later having Diane's scarf and purse for her as she departs. Jordan transports the trays into a side room and tosses them into the dishwasher before texting Sam. Jordan stands on the sidewalk in a bright blue jacket and silver accessories, then dashes across the crowded avenue, around the corner, and bolts up to the Waldorf, where a concierge in a tuxedo welcomes him. He finds Taylor lounging at the counter and picks up the script. At the scheduled time, he puts an iced tea and the script on Diane's table as the kids are examining them. Diane pivots away in her armchair, and Jordan strolls out with a grin, after which Diane pivots back to gaze after him and grabs the iced tea. Sam arrives home to find Jordan sketching a kite to look like a bird, and he hugs him, but he shakes his head. A red scarf, he then pulls him into a cheerful hug. Meanwhile, Oscar and his crew are on a shoot by a fountain in Bryant Park, with models in floral print dresses and hats, and a woman with a live parrot. Jordan finds Oscar evaluating one model, leaving him contemplative. Diane is in a briefing with junior staff, including Oscar, while Alex has a cough and passes something to Diane before returning to his station. Jordan's eyes are wide as he is on his way in when his phone beeps, bringing him back to Diane's office with Alex, to which Jordan nods. Playlists are mentioned, and Oscar has a long red suit ready. City lights twinkle as Jordan is driven to a gala, alighting the car elegantly adorned in a chic red evening suit, hair slicked back with silver bands. Jordan notices Oscar chatting with journalists, who notices him, offering a friendly grin. He nods back, making his way through the reporters, along the red carpet, and up the stairs toward the doorway."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Andy follows instructions to hide the groceries in the pantry on the right before displaying a painting. She, Miranda, and the children giggle as Andy tiptoes upstairs, arriving at an upper floor where she encounters Miranda and her husband. They observe Andy attempting to tiptoe back downstairs, and Miranda glares at Andy like a deer caught in the daylight. Andy deposits the painting on the top step and rushes away. Arriving for work, Emily grabs Andy's hand and drags her into a hidden alcove, gesturing to Miranda's workshop, and Andy hesitantly goes in there. Andy grins anxiously and heads back to her workstation, while Miranda answers her pager. Andy places a vase on Miranda's desk, scattering petals onto Miranda's pasta, and Emily dashes to gather them, later having Miranda's hat and scarf for her as she departs. Andy carries the glasses into a hidden alcove and tosses them into the bathtub before dialing Nate. Andy stands on the block in a dark green jacket and silver bangles, then jogs across the crowded avenue, around the corner, and speeds up to the St. Regis, where a bellhop in a morning suit welcomes her. She finds Christian lounging at the café and takes the blueprint. At the designated moment, she places a tea and the blueprint on Miranda's desk as the twins are scanning them. Miranda swivels away in her rolling chair, and Andy strides out with a grin, after which Miranda turns back to gaze after her and grabs the tea. Nate gets home to find Andy carving a block to resemble a sculpture, and she hugs him, but he shakes his head. A black sweater, he then pulls her into a tender hug. Meanwhile, Nigel and his team are on a shoot by a pond in Central Park, with models in floral outfits and hats, and a man with a bright parrot. Andy finds Nigel inspecting one model, leaving her pensive. Miranda is in a conference with senior staff, including Nigel, while Emily has a cough and hands a folder to Miranda before returning to her cubicle. Andy's eyes are fixed as she is on her way out when her pager buzzes, bringing her back to Miranda's workshop with Emily, to which Andy nods. Portfolios are mentioned, and Nigel has a long silver gown ready. City lights dazzle as Andy is driven to a gala, exiting the vehicle beautifully attired in an elegant silver evening gown, hair arranged with white beads. Andy spots Nigel chatting with photographers, who spots her, offering a warm grin. She nods back, navigating past the press, along the gold carpet, and up the stairs toward the entrance."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Bobby tracks instructions to tuck the soccer ball in the garage on the right before displaying a comic. He, Clara, and the parrots snicker as Bobby slides downstairs, reaching a lower cellar where he stumbles upon Clara and her cousin. They glimpse Bobby attempting to tiptoe back upstairs, and Clara frowns at Bobby like an owl caught in the headlights. Bobby places the comic on the bottom step and scurries away. Arriving to exercise, Sarah seizes Bobby's hand and drags him into a main hall, gesturing to Clara's den, and Bobby hesitantly wanders in there. Bobby grins awkwardly and retreats to his hammock, while Clara answers her tablet. Bobby lays a platter on Clara's hammock, scattering crumbs onto Clara's salad, and Sarah dashes to retrieve them, later holding Clara's umbrella and scarf for her as she departs. Bobby lugs the cups into a main hall and hurls them into the tub before messaging Craig. Bobby sits on the edge in a bright orange coat and silver gadgets, then darts across the tranquil meadow, around the bush, and dashes up to the Grand Hotel, where a bellboy in an evening uniform welcomes him. He spots George lounging at the podium and grabs the blueprint. At the designated minute, he places a warm tea and the blueprint on Clara's hammock as the hamsters are inspecting them. Clara swivels away in her rocking chair, and Bobby strolls out with a grin, after which Clara swivels back to gaze after him and snatches up the tea. Craig returns home to witness Bobby coloring a kite to resemble a comet, and he embraces him, but Craig sighs. A red jumpsuit, he then pulls him into a gentle hug. Concurrently, Tom and his crew are on a quest by a fountain in Green Park, with actors in space-themed costumes and helmets, and a woman with a robotic arm. Bobby finds Tom inspecting one actor, leaving him puzzled. Clara is in a brainstorm with junior associates, including Tom, while Sarah has a sneeze and passes something to Clara before retreating to her hammock. Bobby's grin is sealed as he is on his way to exit when his laptop beeps, bringing him back to Clara's den with Sarah, to which Bobby agrees. Magazines are cited, and Tom has a flowing white cloak ready. City stars twinkle as Bobby is driven to a gala, alighting the vehicle elegantly attired in a sleek white morning suit, hair groomed with red feathers. Bobby spots Tom chatting with photographers, who notices him, offering a friendly grin. He nods back, maneuvering past the cameras, along the green carpet, and down the steps toward the exit."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Andy follows instructions to stash dry cleaning in a closet before creeping upstairs, where she encounters Miranda and her husband, who catch her sneaking back down. Andy leaves a book on the top step and hurries away. At work, Emily pulls her aside and points her to Miranda's office. Nervously, Andy goes in, sets a tray on Miranda's desk, and sprinkles herbs on Miranda's steak. Later, Andy runs across a busy street to the St. Regis, where she meets Christian and receives a manuscript. She places the manuscript and coffee on Miranda's desk, watches the twins reading, and Miranda turns away, allowing Andy to exit with a smile. At home, Nate finds Andy painting a ball as a planet and they embrace passionately. Meanwhile, Nigel is at a Central Park shoot with models in animal print and a live snake, leaving Andy thoughtful. Miranda is in a meeting as Emily, sick with a cold, hands her something. Andy is called back to Miranda's office, nods in understanding, and later prepares for a city benefit. Adorned in a chic black gown, she arrives at the event, winks at Nigel, and makes her way along the red carpet."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She winks back making her way past the press along the red carpet and up the stairs toward the entrance Andy spots Nigel talking to reporters who spots her giving a warm smile City lights sparkle as Andy is driven to a benefit exiting the car stunningly adorned in a chic black evening gown hair swept up with white flowers Albums are mentioned and Nigel has a long black gown ready Andy's mouth is shut as she is on her way out when her phone rings bringing her back to Miranda's office with Emily to which Andy nods Miranda is in a meeting with senior staff including Nigel while Emily has a cold and hands something to Miranda before returning to her desk Andy finds Nigel vetting one model leaving her thoughtful Meanwhile Nigel and his team are on a shoot by a lake in Central Park with models in animal print outfits and masks and a man with a live snake he then pulls her into a passionate embrace A black camisole Nate gets home to find Andy painting a ball to look like a planet and she hugs him but he shakes his head Miranda turns away in her swivel chair and Andy walks out with a smile after which Miranda turns back to stare after her and snatches up the coffee At the appointed hour she puts a hot coffee and the manuscript on Miranda's desk as the twins are reading them She finds Christian sitting at the bar and takes the manuscript Andy stands on the corner in a dark green dress and gold accessories then runs across the busy street around the corner and races up to the St Regis where a doorman in a morning suit greets her Andy carries the dishes into a side room and throws them into the sink before calling Nate Andy sets a tray on Miranda's desk sprinkling herbs onto Miranda's steak and Emily runs to fetch them later having Miranda's coat and bag for her as she leaves Andy smiles nervously and heads back to her desk while Miranda answers her mobile Arriving for work Emily grabs Andy's arm and pulls her into a side room pointing to Miranda's office and Andy reluctantly goes in there Andy leaves the book on the top step and hurries away They catch sight of Andy trying to creep back downstairs and Miranda glowers at Andy like a rabbit trapped in the headlights She Miranda and the children giggle as Andy creeps upstairs reaching an upper floor where she encounters Miranda and her husband Andy follows instructions to stash the dry cleaning in the closet on the left before showing a book"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Andy finds Nigel vetting one model leaving her thoughtful Meanwhile Nigel and his team are on a shoot by a lake in Central Park with models in animal print outfits and masks and a man with a live snake They catch sight of Andy trying to creep back downstairs and Miranda glowers at Andy like a rabbit trapped in the headlights he then pulls her into a passionate embrace Andy smiles nervously and heads back to her desk while Miranda answers her mobile A black camisole Miranda is in a meeting with senior staff including Nigel while Emily has a cold and hands something to Miranda before returning to her desk Nate gets home to find Andy painting a ball to look like a planet and she hugs him but he shakes his head She winks back making her way past the press along the red carpet and up the stairs toward the entrance Andy sets a tray on Miranda's desk sprinkling herbs onto Miranda's steak and Emily runs to fetch them later having Miranda's coat and bag for her as she leaves She finds Christian sitting at the bar and takes the manuscript She Miranda and the children giggle as Andy creeps upstairs reaching an upper floor where she encounters Miranda and her husband Albums are mentioned and Nigel has a long black gown ready Miranda turns away in her swivel chair and Andy walks out with a smile after which Miranda turns back to stare after her and snatches up the coffee At the appointed hour she puts a hot coffee and the manuscript on Miranda's desk as the twins are reading them Andy spots Nigel talking to reporters who spots her giving a warm smile Arriving for work Emily grabs Andy's arm and pulls her into a side room pointing to Miranda's office and Andy reluctantly goes in there Andy's mouth is shut as she is on her way out when her phone rings bringing her back to Miranda's office with Emily to which Andy nods Andy carries the dishes into a side room and throws them into the sink before calling Nate Andy stands on the corner in a dark green dress and gold accessories then runs across the busy street around the corner and races up to the St Regis where a doorman in a morning suit greets her Andy follows instructions to stash the dry cleaning in the closet on the left before showing a book Andy leaves the book on the top step and hurries away City lights sparkle as Andy is driven to a benefit exiting the car stunningly adorned in a chic black evening gown hair swept up with white flowers"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Nate gets home to find Andy painting a ball to look like a planet and she hugs him but he shakes his head A black camisole he then pulls her into a passionate embrace Meanwhile Nigel and his team are on a shoot by a lake in Central Park with models in animal print outfits and masks and a man with a live snake Andy finds Nigel vetting one model leaving her thoughtful Miranda is in a meeting with senior staff including Nigel while Emily has a cold and hands something to Miranda before returning to her desk Andy's mouth is shut as she is on her way out when her phone rings bringing her back to Miranda's office with Emily to which Andy nods Albums are mentioned and Nigel has a long black gown ready City lights sparkle as Andy is driven to a benefit exiting the car stunningly adorned in a chic black evening gown hair swept up with white flowers Andy spots Nigel talking to reporters who spots her giving a warm smile She winks back making her way past the press along the red carpet and up the stairs toward the entrance Andy follows instructions to stash the dry cleaning in the closet on the left before showing a book She Miranda and the children giggle as Andy creeps upstairs reaching an upper floor where she encounters Miranda and her husband They catch sight of Andy trying to creep back downstairs and Miranda glowers at Andy like a rabbit trapped in the headlights Andy leaves the book on the top step and hurries away Arriving for work Emily grabs Andy's arm and pulls her into a side room pointing to Miranda's office and Andy reluctantly goes in there Andy smiles nervously and heads back to her desk while Miranda answers her mobile Andy sets a tray on Miranda's desk sprinkling herbs onto Miranda's steak and Emily runs to fetch them later having Miranda's coat and bag for her as she leaves Andy carries the dishes into a side room and throws them into the sink before calling Nate Andy stands on the corner in a dark green dress and gold accessories then runs across the busy street around the corner and races up to the St Regis where a doorman in a morning suit greets her She finds Christian sitting at the bar and takes the manuscript At the appointed hour she puts a hot coffee and the manuscript on Miranda's desk as the twins are reading them Miranda turns away in her swivel chair and Andy walks out with a smile after which Miranda turns back to stare after her and snatches up the coffee"
        }
      ]
    }
  ]
}