{
  "ground_truth": "Emily is standing on the stairs with another couple and spots Andy. Inside at the benefit, Emily and Andy follow Miranda around as she greets guests, prompting her as to who they are, while Miranda is wearing a black, off-the-shoulder gown. Andy spots Chairman Irv Ravitz with a chic lady on his arm. A tissue. A man waves at Miranda and turns to Emily, prompting Andy to step back. Emily looks gratefully at Andy, who smiles. Later, Andy is hurrying out of the benefit when she meets Christian coming up the steps, and Christian heads into the benefit. Andy is driven home through the busy New York streets and finds Nate watching TV alone. Andy shuts the door, puts down her bags, and walks over to him, carrying a single fairy cake with a lit candle on it. Dark-haired Nate looks morose as he sits forward and stops in the doorway, turns back to look at her, shaking his head sadly. Hanging his head, he turns and mooches off into the bedroom. Looking glum, Andy blows out the candle on the cake. Andy lets herself into Miranda's townhouse, carrying Miranda's dry cleaning and the book. She's wearing a cool monochrome outfit with black trousers, pale boots, and a big, floppy cap on her head. She puts the dry cleaning into the correct closet and is about to leave the book when she's summoned from one of the other rooms but cannot see Miranda. She yanks her cap off and smooths her fringe before heading in, where Miranda is in a chair in the lounge. Andy hands it to her. Miranda rises sternly, and Andy looks down. Miranda has turned her attention to the book as Andy stands and stares at her with her big doe eyes for a moment, then leaves. Andy strolls sadly through the city, mulling over her decision. It’s dark, and the swanky shop windows she passes are all lit up. She passes people sitting at tables outside a restaurant, shakes her head, and moves on. Yellow taxicabs pass her on the street as she walks past shop windows, one displaying a fashionable red coat. Back at home, Nate wanders out of the bedroom and finds Andy looking through some of her old articles and photographs, including one of her with her parents, and she picks up another photograph. Nate's shoulders sag, and he heads back into the bedroom and turns out the light as Andy rubs her neck, trying to ease some of the tension. Andy is at work early, and both Miranda's office and Emily's chair are empty. Andy stares across the anteroom at it, then picks up a clipboard and some papers. Miranda comes in, unbuttoning her coat, which has a striped collar.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Emily is standing on the steps with another pair and notices Andy. Inside at the fundraiser, Emily and Andy trail Miranda around as she welcomes visitors, prompting her as to who they are, while Miranda is wearing a black, off-the-shoulder dress. Andy notices Chairman Irv Ravitz with a stylish woman on his arm. A tissue. A gentleman waves at Miranda and turns to Emily, prompting Andy to step back. Emily looks thankfully at Andy, who smiles. Later, Andy is rushing out of the fundraiser when she meets Christian coming up the stairs, and Christian heads into the fundraiser. Andy is driven home through the bustling New York streets and finds Nate watching TV alone. Andy shuts the door, puts down her bags, and walks over to him, carrying a single cupcake with a lit candle on it. Dark-haired Nate looks gloomy as he sits forward and stops in the doorway, turns back to look at her, shaking his head sadly. Hanging his head, he turns and trudges off into the bedroom. Looking glum, Andy blows out the candle on the cupcake. Andy lets herself into Miranda's townhouse, carrying Miranda's dry cleaning and the manuscript. She's wearing a chic monochrome ensemble with black trousers, pale boots, and a big, floppy hat on her head. She puts the dry cleaning into the correct closet and is about to leave the manuscript when she's called from one of the other rooms but cannot see Miranda. She yanks her hat off and smooths her bangs before heading in, where Miranda is in a chair in the lounge. Andy hands it to her. Miranda rises sternly, and Andy looks down. Miranda has turned her attention to the manuscript as Andy stands and gazes at her with her big doe eyes for a moment, then leaves. Andy strolls sadly through the city, contemplating her decision. It’s dark, and the swanky shop windows she passes are all illuminated. She passes people sitting at tables outside a bistro, shakes her head, and moves on. Yellow taxicabs pass her on the street as she walks past shop windows, one displaying a stylish red coat. Back at home, Nate wanders out of the bedroom and finds Andy looking through some of her old essays and photographs, including one of her with her parents, and she picks up another photograph. Nate's shoulders sag, and he heads back into the bedroom and turns out the light as Andy rubs her neck, trying to ease some of the tension. Andy is at work early, and both Miranda's office and Emily's chair are empty. Andy stares across the anteroom at it, then picks up a clipboard and some papers. Miranda comes in, unfastening her coat, which has a striped collar."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Emily is standing on the stairs with another couple when Andy is spotted by her. Inside at the benefit, Miranda is followed around by Emily and Andy as guests are greeted by her, who are prompted as to who they are by Emily and Andy, while a black, off-the-shoulder gown is worn by Miranda. Chairman Irv Ravitz with a chic lady on his arm is spotted by Andy. A tissue. Miranda is waved at by a man who turns to Emily, prompting Andy to step back. Andy is looked at gratefully by Emily, who smiles. Later, Andy hurries out of the benefit when Christian is met by her coming up the steps, and the benefit is entered by Christian. Andy is driven home through the busy New York streets, and Nate is found watching TV alone. The door is shut by Andy, her bags are put down, and she walks over to him, carrying a single fairy cake with a lit candle on it. Morose as he sits forward, Dark-haired Nate looks at her, stops in the doorway, turns back to look at her, shaking his head sadly. His head hanging, Andy is turned away from by Nate, who mooches off into the bedroom. Looking glum, the candle on the cake is blown out by Andy. Miranda's townhouse is entered by Andy, carrying the dry cleaning and the book. A cool monochrome outfit with black trousers, pale boots, and a big, floppy cap on her head is worn by her. The dry cleaning is put into the correct closet, and the book is about to be left by her when she is summoned from one of the other rooms but cannot see Miranda. She yanks her cap off, her fringe is smoothed by her before heading in, where Miranda is sitting in a chair in the lounge. It is handed to her by Andy. Miranda rises sternly, and Andy looks down. Her attention has been turned to the book by Miranda as Andy stands and stares at her with her big doe eyes for a moment, then leaves. Andy strolls sadly through the city, mulling over her decision. It’s dark, and the swanky shop windows she passes are all lit up. A restaurant is passed by her, where people are sitting at tables outside, and she shakes her head and moves on. She passes by yellow taxicabs on the street as shop windows are walked past by her, one displaying a fashionable red coat. Back at home, the bedroom is wandered out of by Nate, and Andy is found looking through some of her old articles and photographs, including one of her with her parents, and another photograph is picked up by her. Nate's shoulders sag, and the bedroom is entered by him again, and the light is turned out as Andy rubs her neck, trying to ease some of the tension. Andy is at work early, and both Miranda's office and Emily's chair are empty. It is stared at by Andy across the anteroom, then a clipboard and some papers are picked up by her. Miranda enters, unbuttoning her coat, which has a striped collar."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Emily, standing on the stairs with another couple, spots Andy. Inside the benefit, Emily and Andy follow Miranda as she greets guests, helping her remember names. Miranda wears a black, off-the-shoulder gown. Andy notices Chairman Irv Ravitz with a stylish woman. A man waves at Miranda and turns to Emily, prompting Andy to step back. Emily gratefully looks at Andy, who smiles. Later, Andy rushes out and meets Christian coming up the steps. Andy is driven home through New York streets to find Nate watching TV. She sets down her bags and carries a fairy cake with a lit candle to him. Nate, looking sad, sits in the doorway, shakes his head, and heads to the bedroom. Andy blows out the candle. At Miranda's townhouse, Andy delivers dry cleaning and a book, wearing a chic black-and-white outfit. She puts the dry cleaning away and is summoned but can't find Miranda. Andy smooths her hair and enters the lounge, handing the book to Miranda. As Miranda sternly rises, Andy looks down, then leaves after exchanging a glance. She strolls sadly through the city, reflecting on her choices. It’s dark; swanky shop windows are lit. She shakes her head, passing an outdoor restaurant and taxicabs. At home, Nate sees Andy looking at old photos. He slumps and returns to the bedroom. Andy rubs her neck, trying to relax. Early at work, she finds both Miranda's office and Emily's chair empty. Andy stares across the anteroom, picks up a clipboard, and some papers, as Miranda enters, unbuttoning her coat with a striped collar."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Emily stands on the stairs with a couple and spots Andy. At the benefit, they follow Miranda, in a black gown, as she greets guests, prompting her on identities. Andy notices Chairman Irv Ravitz with a stylish woman. A man waves at Miranda, and Andy steps back for Emily, who smiles gratefully. Leaving the benefit, Andy meets Christian on the steps. Driven home through busy New York, she finds Nate watching TV alone. She offers him a fairy cake with a candle. Morose, Nate shakes his head and retreats to the bedroom. Andy, sad, blows out the candle. Andy enters Miranda's townhouse with dry cleaning and a book, wearing a monochrome outfit with a cap. She stores the cleaning and responds to Miranda's call, finding her in the lounge. Andy passes her the book as Miranda, stern, focuses on it, and Andy leaves. Andy strolls through the lit city, reflecting, and passes lit shop windows, including one with a red coat. At home, Nate finds Andy looking at old photos, including one with her parents. Nate, dejected, returns to the bedroom. Andy, trying to ease tension, is at work early. Both Miranda's office and Emily's chair are empty, so Andy picks up a clipboard. Miranda enters, unbuttoning a coat with a striped collar."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Emily is positioned gracefully on the staircase alongside another couple and happens to notice Andy among the crowd. Inside the benefit, a prestigious gathering, Emily and Andy trail Miranda as she mingles with the guests. They discreetly prompt her with reminders of who the guests are, while Miranda elegantly dons a sleek, black, off-the-shoulder gown that exudes sophistication. Andy's keen eye identifies Chairman Irv Ravitz, who has a fashionable lady companion on his arm. At one point, a man enthusiastically waves at Miranda, causing her to shift her attention to Emily. Andy, sensing the need, takes a step back. Emily shoots Andy a grateful look, and Andy responds with a warm, reassuring smile. \n\nAs the evening progresses, Andy hastily exits the benefit, only to encounter Christian ascending the steps to head into the event. Deciding to call it a night, Andy is driven through the busy, ever-bustling streets of New York City and arrives home to find Nate, who is watching TV alone. After closing the door behind her, she sets down her bags and approaches him, carrying a single, small fairy cake adorned with a solitary lit candle. Nate, with his dark hair, appears despondent, sitting on the edge of his seat. He pauses in the doorway, glances back at her with a somber shake of his head, conveying a sense of resignation. He eventually lowers his head, desolately retreating to the bedroom. Andy, feeling the weight of the moment, extinguishes the candle on the cake with a sense of disappointment.\n\nLater, Andy makes her way into Miranda's impeccably maintained townhouse, carrying both Miranda's dry cleaning and an important book. Andy herself is dressed in a stylish monochrome ensemble, consisting of sleek black trousers, pale boots, and topped off with a large, floppy cap perched on her head. She carefully places the dry cleaning in its proper closet and prepares to leave the book when she suddenly hears Miranda summoning her from another room. Unable to see Miranda immediately, she quickly removes her cap and smoothens her fringe before proceeding. Inside the lounge, Miranda sits with an air of authority in a chair. Andy hands the book to her, but Miranda, with a stern demeanor, stands, prompting Andy to lower her eyes respectfully. Miranda diverts her focus to the book, and Andy stands there momentarily, staring at her with her expressive, wide doe eyes, before quietly exiting.\n\nFeeling pensive, Andy strolls through the city, contemplating her choices with a heavy heart. It is nighttime, and the chic shop windows she passes are brightly illuminated. She observes people casually seated at outdoor tables of a restaurant, shakes her head slightly, and continues walking. The iconic yellow taxicabs navigate the streets as she passes by a display window showcasing a stylish red coat. Upon returning home, Nate emerges from the bedroom and discovers Andy reminiscing over some of her old articles and cherished photographs, including one featuring her with her parents. She picks up another photograph, lost in thought, while Nate, shoulders drooping with defeat, retreats into the bedroom again, switching off the light. Andy, feeling the weight of the day's stress, rubs her neck in an attempt to alleviate some of the lingering tension.\n\nArriving at her workplace early the next day, Andy notes that both Miranda's opulent office and Emily's chair remain empty. She gazes across the anteroom, then resolutely picks up a clipboard and some papers to start her tasks. Soon, Miranda enters with purpose, unbuttoning her coat that features a distinct striped collar, signaling the start of another demanding day."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Emily is elegantly positioned on the grand staircase alongside another couple and happens to catch sight of Andy amidst the bustling crowd. Inside the benefit, which is truly a prestigious gathering of influential individuals, Emily and Andy find themselves trailing behind Miranda as she gracefully mingles with the guests in attendance. They subtly and discreetly prompt her with gentle reminders of who each guest is, helping her to navigate the social intricacies, all while Miranda exudes sophistication in a sleek, black, off-the-shoulder gown. Andy, with her keen eye and attentive nature, identifies Chairman Irv Ravitz, who is accompanied by a fashionable lady companion draped on his arm. At one point during the evening, a man enthusiastically waves at Miranda, drawing her attention away from her current task and momentarily towards Emily. Recognizing the need to step back, Andy does so gracefully, allowing Emily to manage the interaction. Emily acknowledges Andy's support with a grateful look, and Andy responds with a warm, reassuring smile, offering comfort and solidarity.\n\nAs the evening continues to unfold, Andy makes a swift exit from the benefit, only to cross paths with Christian, who is in the process of ascending the stairs to enter the event. Choosing to call it a night, Andy is driven through the busy, ever-bustling streets of New York City, which are alive with activity and vibrant energy, and arrives home, where she finds Nate engrossed in watching TV alone. After quietly closing the door behind her, she sets down the bags she is carrying and approaches him, holding a single, small fairy cake delicately adorned with a solitary lit candle. Nate, with his characteristically dark hair, appears despondent, sitting on the edge of his seat. He pauses in the doorway, casts a glance back at her with a somber shake of his head, a gesture that conveys a deep sense of resignation. Eventually, he lowers his head and desolately retreats to the bedroom. Andy is left feeling the weight of the moment and extinguishes the candle on the cake, overcome with a sense of disappointment and sadness.\n\nLater, Andy finds herself making her way into Miranda's impeccably maintained townhouse, where she carries both Miranda's dry cleaning and an important book. Andy is dressed stylishly in a monochrome ensemble, consisting of sleek black trousers, pale boots, and is topped off with a large, floppy cap perched jauntily on her head. She carefully places the dry cleaning in its designated closet and is about to leave the book when she suddenly hears Miranda's voice summoning her from another room. Unable to see Miranda immediately, she quickly removes her cap and smoothes her fringe before proceeding into the room. Inside the lounge, Miranda sits with an air of authority in an imposing chair. Andy hands the book to her, but Miranda, maintaining a stern demeanor, stands up, prompting Andy to lower her eyes respectfully as a gesture of deference. Miranda shifts her attention to the book, and Andy stands there momentarily, gazing at her with her expressive, wide doe eyes, before quietly exiting the room.\n\nFeeling pensive and reflective, Andy strolls through the city streets, deeply contemplating her choices with a heavy heart. It is nighttime, and the chic shop windows she passes are brightly illuminated, casting a glow on the sidewalk. She notices people casually seated at outdoor tables of a restaurant, partaking in lively conversations, and she shakes her head slightly, continuing on her way. The iconic yellow taxicabs of New York navigate the streets as she passes by a display window showcasing a stylish red coat that catches her eye. Upon her return home, Nate emerges from the bedroom and discovers Andy reminiscing over some of her old articles and cherished photographs, including one of her with her parents. She picks up another photograph, becoming lost in thought, while Nate, with his shoulders drooping with defeat, retreats into the bedroom once again, switching off the light as he goes. Andy, feeling the weight of the day's stress bearing down on her, rubs her neck in a bid to alleviate some of the lingering tension she feels.\n\nArriving at her workplace early the next day, Andy notes with some interest that both Miranda's opulent office and Emily's chair remain conspicuously empty. She gazes across the anteroom contemplatively before resolutely picking up a clipboard and some papers, determined to begin her tasks for the day. Soon, Miranda enters the office space with purpose, unbuttoning her coat, which features a distinct and noticeable striped collar, signaling the start of another demanding and potentially challenging day."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Emily is standing poised on the stairs alongside another couple, her gaze sweeping the room until she spots Andy. Inside the bustling benefit, Emily and Andy attentively follow behind Miranda, who is elegantly dressed in a black, off-the-shoulder gown, as she navigates the room, warmly greeting guests. With each introduction, they quietly prompt her with whispered reminders about who each person is. As they move, Andy's eyes catch sight of Chairman Irv Ravitz, who is accompanied by a chic lady. Suddenly, a man waves at Miranda, grabbing her attention, and in response, turns to Emily, signaling Andy to take a step back to allow more space. Emily glances at Andy with a grateful expression, to which Andy responds with a reassuring smile. Later, after the benefit has ended, Andy hurries away, heading towards the exit with a sense of urgency, and on her way out, she crosses paths with Christian ascending the steps. Exchanging brief nods, Christian proceeds inside the benefit while Andy makes her way through the bustling New York streets in a car. Upon arriving home, she finds Nate sitting alone, absorbed in watching TV. Quietly, she shuts the door behind her, places her bags down with care, and approaches Nate, carrying a single fairy cake adorned with a lit candle. Nate, with his dark hair framing his face, looks despondent, sitting up with his body tilted forward. He pauses at the doorway, turning back to face Andy, his head shaking sadly as he hangs it low, dejectedly retreating into the bedroom. Andy, left alone and looking glum, gently blows out the candle on the cake. Determined, Andy lets herself into Miranda’s elegant townhouse, her arms laden with Miranda’s dry cleaning and the book. Her outfit is a striking monochrome ensemble featuring black trousers, pale boots, and a large, floppy cap perched atop her head. She efficiently places the dry cleaning in its designated closet and moves to leave the book when she hears a summons from another room. Struggling to locate Miranda, she tugs off her cap, smoothing her fringe nervously before heading in the direction of Miranda’s voice. Entering the lounge, she sees Miranda seated in a chair. She hands over the book to Miranda, who rises with a stern demeanor. Andy instinctively looks down, avoiding direct eye contact as Miranda's focus shifts to the book. Andy stands quietly, her large doe eyes lingering on Miranda briefly before turning to leave. She strolls through the city streets, deep in thought, contemplating her recent decisions. The night is alive with the glow of swanky shop windows, each display capturing her attention in the darkness. Passing by a restaurant where patrons sit at outdoor tables, she shakes her head slightly, continuing on her way. The familiar sight of yellow taxicabs weaves through the street as she pauses by a shop window showcasing a fashionable red coat before resuming her walk. Once back at home, Nate emerges from the bedroom to find Andy absorbed in sorting through her collection of old articles and cherished photographs. Picking up one picture, which includes her parents, she feels a wave of nostalgia. Nate's shoulders droop as he silently returns to the bedroom, switching off the light, his retreat unnoticed by Andy, who is massaging her neck in an attempt to relieve some stress. Arriving early at work the next morning, Andy finds Miranda's office and Emily's chair vacant. She stands in the anteroom, her eyes fixed on the empty chair before she snaps out of her reverie, grabbing a clipboard and some papers. As she gathers these items, Miranda enters, her presence commanding as she unbuttons her coat, revealing its striped collar, setting the day’s events into motion."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Emily stands on the stairs with another couple and spots Andy. Inside the benefit, Andy and Emily follow Miranda as she greets guests, assisting her with their names. Andy notices Chairman Irv Ravitz with a chic lady. As a man waves at Miranda, Andy steps back, and Emily gratefully acknowledges her. Later, Andy rushes out of the benefit, encountering Christian on the steps before going home through busy New York streets. She finds Nate watching TV alone, closes the door, and approaches him with a single fairy cake lit with a candle. Nate, looking morose, shakes his head sadly, retreats to the bedroom, and Andy blows out the candle, feeling downcast.\n\nAndy arrives at Miranda's townhouse in a chic monochrome outfit, putting away Miranda's dry cleaning before being summoned by Miranda from another room. She removes her cap, smooths her hair, and enters the lounge, handing Miranda a book. Miranda, focused on the book, rises sternly as Andy stands with a lingering gaze before leaving. Reflectively, Andy walks through the city, pondering her decisions amidst the illuminated shop windows, passing diners and fashionable displays. Back at home, Nate, after seeing Andy sorting through old articles and photographs, sighs and returns to the bedroom, turning out the light, while Andy massages her neck to ease tension.\n\nArriving at work early, Andy finds both Miranda’s office and Emily’s chair empty. She surveys the anteroom, picks up a clipboard and some papers, and watches as Miranda enters, unbuttoning her coat with a striped collar."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Emily is standing on the grand staircase of the Metropolitan Museum of Art, known for its iconic architecture and location on New York's Museum Mile, with another couple and spots Andy. Inside at the charity benefit, a prestigious event attended by New York's elite to raise funds for the arts, Emily and Andy follow Miranda around as she greets guests at the gala. Miranda is wearing a black, off-the-shoulder gown, a latest creation of a renowned designer known for dressing celebrities on the red carpet. Andy spots Chairman Irv Ravitz, a powerful figure in the publishing world, with a chic lady on his arm, likely a prominent socialite or editor. A tissue. A man waves at Miranda, who is the commanding editor-in-chief of a leading fashion magazine, and turns to Emily, prompting Andy to step back. Emily looks gratefully at Andy, who smiles, understanding the unspoken camaraderie among assistants. Later, Andy is hurrying out of the benefit when she meets Christian, a charismatic writer whose recent book has topped the bestseller lists, coming up the steps, and Christian heads into the benefit. Andy is driven home through the bustling streets of New York City, where yellow cabs and bright billboards are a constant backdrop, and finds Nate watching TV alone. Andy shuts the door, puts down her bags, and walks over to him, carrying a single fairy cake, also known in America as a cupcake, with a lit candle on it. Dark-haired Nate looks morose, likely reflecting on their strained relationship due to her demanding job, as he sits forward and stops in the doorway, turns back to look at her, shaking his head sadly. Hanging his head, he turns and mooches off into the bedroom. Looking glum, Andy blows out the candle on the cake, a small symbol of her missed anniversary celebration with Nate. Andy lets herself into Miranda's opulent Manhattan townhouse, carrying Miranda's dry cleaning and the book, a term they use for the mock-up of the next magazine issue. She's wearing a cool monochrome outfit with black trousers, pale boots, and a big, floppy cap on her head, reflecting the latest minimalist trends in fashion. She puts the dry cleaning into the correct closet, labeled meticulously for Miranda's designer garments, and is about to leave the book when she's summoned from one of the other rooms but cannot see Miranda. She yanks her cap off and smooths her fringe before heading in, where Miranda is in a chair in the lounge, an area filled with contemporary art and designer furniture. Andy hands it to her as Miranda rises sternly, projecting the authoritative presence that makes her both feared and respected in the fashion industry, and Andy looks down. Miranda has turned her attention to the book as Andy stands and stares at her with her big doe eyes for a moment, then leaves. Andy strolls sadly through the city, contemplating her life choices. It’s dark, and the swanky shop windows on Fifth Avenue she passes are all lit up with fall fashion displays. She passes people sitting at tables outside a chic restaurant, indicative of New York's vibrant dining scene, shakes her head, and moves on. Yellow taxicabs pass her on the street as she walks past shop windows, one displaying a fashionable red coat, possibly the latest trend setting item for the season. Back at home, Nate wanders out of the bedroom and finds Andy looking through some of her old articles and photographs, nostalgic for a time when her career was less demanding, including one of her with her parents during a happier family gathering, and she picks up another photograph. Nate's shoulders sag, and he heads back into the bedroom and turns out the light as Andy rubs her neck, trying to ease some of the tension that has built from balancing work and personal life. Andy is at work early, and both Miranda's office, which is usually bustling with activity, and Emily's chair, known for being an epicenter of task management, are empty. Andy stares across the anteroom at it, then picks up a clipboard and some papers, preparing for the day's tasks. Miranda comes in, unbuttoning her coat, which has a striped collar, an understated yet sophisticated detail from her latest collection of designer outerwear."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Andy stares across the anteroom at it then picks up a clipboard and some papers Emily is standing on the stairs with another couple and spots Andy Inside at the benefit Emily is standing on the stairs with another couple and spots Andy Inside at the benefit Emily and Andy follow Miranda around as she greets guests prompting her as to who they are while Miranda is wearing a black offtheshoulder gown Andy spots Chairman Irv Ravitz with a chic lady on his arm A tissue A man waves at Miranda and turns to Emily prompting Andy to step back Andy strolls sadly through the city mulling over her decision Andy is at work early and both Miranda's office and Emily's chair are empty Andy spots Chairman Irv Ravitz with a chic lady on his arm Andy hands it to her Emily looks gratefully at Andy who smiles She yanks her cap off and smooths her fringe before heading in where Miranda is in a chair in the lounge Later Andy is hurrying out of the benefit when she meets Christian coming up the steps and Christian heads into the benefit Andy is driven home through the busy New York streets and finds Nate watching TV alone Yellow taxicabs pass her on the street as she walks past shop windows one displaying a fashionable red coat Andy shuts the door puts down her bags and walks over to him carrying a single fairy cake with a lit candle on it Later Andy is hurrying out of the benefit when she meets Christian coming up the steps and Christian heads into the benefit Emily and Andy follow Miranda around as she greets guests prompting her as to who they are Darkhaired Nate looks morose as he sits forward and stops in the doorway turns back to look at her shaking his head sadly Hanging his head he turns and mooches off into the bedroom A tissue Looking glum Andy blows out the candle on the cake Andy let us herself into Miranda's townhouse carrying Miranda's dry cleaning and the book Andy let us herself into Miranda's townhouse carrying Miranda's dry cleaning and the book She is wearing a cool monochrome outfit with black trousers pale boots and a big floppy cap on her head She puts the dry cleaning into the correct closet and is about to leave the book when she is summoned from one of the other rooms but cannot see Miranda She yanks her cap off and smooths her fringe before heading in where Miranda is in a chair in the lounge Andy hands it to her Miranda rises sternly and Andy looks down while Miranda is wearing a black offtheshoulder gown Miranda has turned her attention to the book as Andy stands and stares at her with her big doe eyes for a moment then leaves Andy strolls sadly through the city mulling over her decision It is dark and the swanky shop windows she passes are all lit up Andy is driven home through the busy New York streets and finds Nate watching TV alone Nate's shoulders sag and he heads back into the bedroom and turns out the light as Andy rubs her neck trying to ease some of the tension She passes people sitting at tables outside a restaurant shakes her head and moves on Yellow taxicabs pass her on the street as she walks past shop windows one displaying a fashionable red coat Back at home Nate wanders out of the bedroom and finds Andy looking through some of her old articles and photographs including one of her with her parents and she picks up another photograph Nate's shoulders sag and he heads back into the bedroom and turns out the light as Andy rubs her neck trying to ease some of the tension Andy is at work early and both Miranda's office and Emily's chair are empty Andy stares across the anteroom at it then picks up a clipboard and some papers Miranda comes in unbuttoning her coat which has a striped collar"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Emily is standing on the stairs with another couple and spots Andy Inside at the benefit. Emily and Andy follow Miranda around as she greets guests prompting her as to who they are. while Miranda is wearing a black offtheshoulder gown. Andy spots Chairman Irv Ravitz with a chic lady on his arm. A tissue. A man waves at Miranda and turns to Emily prompting Andy to step back. Emily looks gratefully at Andy who smiles. Later Andy is hurrying out of the benefit when she meets Christian coming up the steps and Christian heads into the benefit. Andy is driven home through the busy New York streets and finds Nate watching TV alone. Andy shuts the door puts down her bags and walks over to him carrying a single fairy cake with a lit candle on it. Darkhaired Nate looks morose as he sits forward and stops in the doorway turns back to look at her shaking his head sadly. Hanging his head he turns and mooches off into the bedroom. Looking glum Andy blows out the candle on the cake. Andy let us herself into Miranda's townhouse carrying Miranda's dry cleaning and the book. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. She is wearing a cool monochrome outfit with black trousers pale boots and a big floppy cap on her head. She puts the dry cleaning into the correct closet and is about to leave the book when she is summoned from one of the other rooms but cannot see Miranda. She yanks her cap off and smooths her fringe before heading in where Miranda is in a chair in the lounge. Andy hands it to her. Miranda rises sternly and Andy looks down. Miranda has turned her attention to the book as Andy stands and stares at her with her big doe eyes for a moment then leaves. Andy strolls sadly through the city mulling over her decision. It is dark and the swanky shop windows she passes are all lit up. She passes people sitting at tables outside a restaurant shakes her head and moves on. Yellow taxicabs pass her on the street as she walks past shop windows one displaying a fashionable red coat. Back at home Nate wanders out of the bedroom and finds Andy looking through some of her old articles and photographs including one of her with her parents and she picks up another photograph. Nate's shoulders sag and he heads back into the bedroom and turns out the light as Andy rubs her neck trying to ease some of the tension. Andy is at work early and both Miranda's office and Emily's chair are empty. Andy stares across the anteroom at it then picks up a clipboard and some papers. Miranda comes in unbuttoning her coat which has a striped collar."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Emily is standing on the stairs with another couple and spots Andy Inside at the benefit. Emily and Andy follow Miranda around as she greets guests prompting her as to who they are. while Miranda is wearing a black offtheshoulder gown. Andy spots Chairman Irv Ravitz with a chic lady on his arm. A tissue. A man waves at Miranda and turns to Emily prompting Andy to step back. Emily looks gratefully at Andy who smiles. Later Andy is hurrying out of the benefit when she meets Christian coming up the steps and Christian heads into the benefit. Andy is driven home through the busy New York streets and finds Nate watching TV alone. Andy shuts the door puts down her bags and walks over to him carrying a single fairy cake with a lit candle on it. Darkhaired Nate looks morose as he sits forward and stops in the doorway turns back to look at her shaking his head sadly. Hanging his head he turns and mooches off into the bedroom. Looking glum Andy blows out the candle on the cake. Andy let us herself into Miranda's townhouse carrying Miranda's dry cleaning and the book. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. She is wearing a cool monochrome outfit with black trousers pale boots and a big floppy cap on her head. She puts the dry cleaning into the correct closet and is about to leave the book when she is summoned from one of the other rooms but cannot see Miranda. She yanks her cap off and smooths her fringe before heading in where Miranda is in a chair in the lounge. Andy hands it to her. Miranda rises sternly and Andy looks down. Miranda has turned her attention to the book as Andy stands and stares at her with her big doe eyes for a moment then leaves. Andy strolls sadly through the city mulling over her decision. It is dark and the swanky shop windows she passes are all lit up. She passes people sitting at tables outside a restaurant shakes her head and moves on. Yellow taxicabs pass her on the street as she walks past shop windows one displaying a fashionable red coat. Back at home Nate wanders out of the bedroom and finds Andy looking through some of her old articles and photographs including one of her with her parents and she picks up another photograph. Nate's shoulders sag and he heads back into the bedroom and turns out the light as Andy rubs her neck trying to ease some of the tension. Andy is at work early and both Miranda's office and Emily's chair are empty. Andy stares across the anteroom at it then picks up a clipboard and some papers. Miranda comes in unbuttoning her coat which has a striped collar."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Emily is standing on the stairs with another couple and spots Andy Inside at the benefit. Emily and Andy follow Miranda around as she greets guests prompting her as to who they are. while Miranda is wearing a black offtheshoulder gown. Andy spots Chairman Irv Ravitz with a chic lady on his arm. A tissue. A man waves at Miranda and turns to Emily prompting Andy to step back. Emily looks gratefully at Andy who smiles. It is dark and the swanky shop windows she passes are all lit up. She passes people sitting at tables outside a restaurant shakes her head and moves on. Yellow taxicabs pass her on the street as she walks past shop windows one displaying a fashionable red coat. Back at home Nate wanders out of the bedroom and finds Andy looking through some of her old articles and photographs including one of her with her parents and she picks up another photograph. Nate's shoulders sag and he heads back into the bedroom and turns out the light as Andy rubs her neck trying to ease some of the tension. Andy is at work early and both Miranda's office and Emily's chair are empty. Andy stares across the anteroom at it then picks up a clipboard and some papers. Miranda comes in unbuttoning her coat which has a striped collar."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Emily is standing on the stairs with another couple and spots Andy Inside at the benefit. Emily and Andy follow Miranda around as she greets guests prompting her as to who they are. while Miranda is wearing a black offtheshoulder gown. Andy is at work early and both Miranda's office and Emily's chair are empty. Andy stares across the anteroom at it then picks up a clipboard and some papers. Miranda comes in unbuttoning her coat which has a striped collar."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The squirrel is standing on the stairs with another turtle and spots the tiger. Inside at the benefit, the squirrel and the tiger follow the dolphin around as she greets guests, prompting her as to who they are, while the dolphin is wearing a black, off-the-shoulder gown. The tiger spots Chairman Irv Ravitz with a chic lady on his arm. A tissue. A jellyfish waves at the dolphin and turns to the squirrel, prompting the tiger to step back. The squirrel looks gratefully at the tiger, who smiles. Later, the tiger is hurrying out of the benefit when she meets the parrot coming up the steps, and the parrot heads into the benefit. The tiger is driven home through the busy New York streets and finds the fox watching TV alone. The tiger shuts the door, puts down her bags, and walks over to him, carrying a single fairy cake with a lit candle on it. Dark-haired the fox looks morose as he sits forward and stops in the doorway, turns back to look at her, shaking his head sadly. Hanging his head, he turns and mooches off into the bedroom. Looking glum, the tiger blows out the candle on the cake. The tiger lets herself into the dolphin's townhouse, carrying the dolphin's dry cleaning and the book. She's wearing a cool monochrome outfit with black trousers, pale boots, and a big, floppy cap on her head. She puts the dry cleaning into the correct closet and is about to leave the book when she's summoned from one of the other rooms but cannot see the dolphin. She yanks her cap off and smooths her fringe before heading in, where the dolphin is in a chair in the lounge. The tiger hands it to her. The dolphin rises sternly, and the tiger looks down. The dolphin has turned her attention to the book as the tiger stands and stares at her with her big doe eyes for a moment, then leaves. The tiger strolls sadly through the city, mulling over her decision. It's dark, and the swanky shop windows she passes are all lit up. She passes people sitting at tables outside a restaurant, shakes her head, and moves on. Yellow taxicabs pass her on the street as she walks past shop windows, one displaying a fashionable red coat. Back at home, the fox wanders out of the bedroom and finds the tiger looking through some of her old articles and photographs, including one of her with her parents, and she picks up another photograph. The fox's shoulders sag, and he heads back into the bedroom and turns out the light as the tiger rubs her neck, trying to ease some of the tension. The tiger is at work early, and both the dolphin's office and the squirrel's chair are empty. The tiger stares across the anteroom at it, then picks up a clipboard and some papers. The dolphin comes in, unbuttoning her coat, which has a striped collar."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Emily is standing on the escalator with another couple and spots Andy. Inside at the gala, Emily and Andy follow Miranda around as she greets attendees, prompting her as to who they are, while Miranda is wearing a black, off-the-shoulder dress. Andy spots Chairman Irv Ravitz with a stylish gentleman on his arm. A napkin. A woman waves at Miranda and turns to Emily, prompting Andy to step back. Emily looks gratefully at Andy, who smiles. Later, Andy is hurrying out of the gala when she meets Christian coming up the ramp, and Christian heads into the gala. Andy is driven home through the bustling Paris streets and finds Nate watching a movie alone. Andy shuts the window, puts down her parcels, and walks over to him, carrying a single donut with a lit candle on it. Dark-haired Nate looks wistful as he sits forward and stops in the doorway, turns back to look at her, shaking his head gently. Hanging his head, he turns and shuffles off into the den. Looking glum, Andy blows out the candle on the donut. Andy lets herself into Miranda's condominium, carrying Miranda's groceries and the magazine. She's wearing a stylish monochrome outfit with black jeans, pale sneakers, and a big, floppy scarf around her neck. She puts the groceries into the correct refrigerator and is about to leave the magazine when she's summoned from one of the other rooms but cannot see Miranda. She yanks her scarf off and smooths her bangs before heading in, where Miranda is in a chair in the library. Andy hands it to her. Miranda rises sternly, and Andy looks down. Miranda has turned her attention to the magazine as Andy stands and stares at her with her big doe eyes for a moment, then leaves. Andy strolls sadly through the city, mulling over her choice. It’s dark, and the chic boutique windows she passes are all lit up. She passes people sitting at benches outside a café, shakes her head, and moves on. Yellow buses pass her on the street as she walks past boutique windows, one displaying a fashionable blue jacket. Back at home, Nate wanders out of the den and finds Andy looking through some of her old documents and sketches, including one of her with her parents, and she picks up another sketch. Nate's shoulders droop, and he heads back into the den and turns out the lamp as Andy rubs her shoulder, trying to ease some of the stress. Andy is at work early, and both Miranda's cubicle and Emily's desk are empty. Andy stares across the anteroom at it, then picks up a folder and some files. Miranda comes in, unbuttoning her raincoat, which has a checkered collar."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Emily is skipping on the stairs with another couple and discovers Andy. Inside at the benefit, Emily and Andy trail Miranda around as she acknowledges guests, informing her as to who they are, while Miranda is wearing a black, off-the-shoulder gown. Andy observes Chairman Irv Ravitz carrying a chic lady on his arm. A tissue. A man signals at Miranda and gestures to Emily, prompting Andy to step aside. Emily nods gratefully at Andy, who grins. Later, Andy is strolling out of the benefit when she encounters Christian descending the steps, and Christian strolls into the benefit. Andy is escorted home through the busy New York streets and notices Nate observing TV alone. Andy opens the door, sets down her bags, and approaches him, holding a single fairy cake with a lit candle on it. Dark-haired Nate appears somber as he sits back and pauses in the doorway, turns back to glance at her, nodding his head sadly. Dropping his head, he turns and shuffles off into the bedroom. Looking dejected, Andy snuffs out the candle on the cake. Andy lets herself into Miranda's townhouse, holding Miranda's dry cleaning and the book. She's wearing a chic monochrome outfit with black trousers, pale boots, and a big, floppy cap on her head. She deposits the dry cleaning into the correct closet and is prepared to deliver the book when she's beckoned from one of the other rooms but cannot see Miranda. She tosses her cap off and tidies her fringe before heading in, where Miranda is in a chair in the lounge. Andy presents it to her. Miranda departs sternly, and Andy glances down. Miranda has directed her attention to the book as Andy stands and gazes at her with her big doe eyes for a moment, then exits. Andy ambles sadly through the city, pondering her decision. It’s dark, and the swanky shop windows she passes are all illuminated. She passes people standing at tables outside a restaurant, nods her head, and continues on. Yellow taxicabs cruise past her on the street as she strides past shop windows, one exhibiting a fashionable red coat. Back at home, Nate meanders out of the bedroom and catches Andy inspecting some of her old articles and photographs, including one of her with her parents, and she lifts another photograph. Nate's shoulders droop, and he retreats back into the bedroom and switches off the light as Andy massages her neck, attempting to alleviate some of the tension. Andy is at work early, and both Miranda's office and Emily's chair are vacant. Andy scans across the anteroom at it, then grabs a clipboard and some papers. Miranda enters, adjusting her coat, which has a striped collar."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Sarah is standing on the escalator with another trio and spots Charlie. Inside at the ceremony, Sarah and Charlie follow Brenda around as she greets visitors, prompting her as to who they are, while Brenda is wearing a turquoise, strapless dress. Charlie spots President Tom Davis with a trendy gentleman on his arm. A postcard. A cat waves at Brenda and turns to Sarah, prompting Charlie to step aside. Sarah looks gratefully at Charlie, who grins. Later, Charlie is hurrying out of the ceremony when she meets Oliver coming up the ramp, and Oliver heads into the ceremony. Charlie is driven home through the bustling Paris streets and finds Sam watching a film alone. Charlie closes the window, puts down her parcels, and strolls over to him, carrying a single blueberry muffin with a glowing sparkler on it. Blond-haired Sam looks wistful as he leans back and stops in the hallway, turns back to glance at her, shaking his head wearily. Dropping his chin, he turns and drifts off into the study. Looking pensive, Charlie extinguishes the sparkler on the muffin. Charlie lets herself into Brenda's apartment, carrying Brenda's hat collection and the journal. She's wearing a sleek colorful outfit with green trousers, navy sandals, and a small, floppy scarf on her neck. She puts the hat collection into the wrong cabinet and is about to leave the journal when she's summoned from one of the other corridors but cannot see Brenda. She removes her scarf and fixes her braid before heading in, where Brenda is in a hammock in the den. Charlie hands it to her. Brenda rises sternly, and Charlie looks aside. Brenda has turned her attention to the journal as Charlie stands and gawks at her with her big deer eyes for a moment, then departs. Charlie wanders sadly through the countryside, pondering her choice. It’s dawn, and the fancy library windows she passes are all illuminated. She passes people standing at counters outside a market, shakes her head, and continues. Red bicycles pass her on the road as she walks past library windows, one displaying a stylish green jacket. Back at her apartment, Sam wanders out of the study and finds Charlie browsing through some of her old journals and drawings, including one of her with her friends, and she picks up another illustration. Sam's arms droop, and he heads back into the study and switches off the lamp as Charlie massages her arm, trying to relieve some of the discomfort. Charlie is at home late, and both Brenda's library and Sarah's sofa are vacant. Charlie gazes across the hallway at it, then grabs a folder and some magazines. Brenda comes in, unfastening her sweater, which has a polka-dotted hem."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Francine perches on the balcony with another artist and notices Jared. Inside at the gala, Francine and Jared trail Vanessa around as she applauds attendees, reminding her of their identities, while Vanessa is adorned in a purple, sequined dress. Jared observes Director Leon Marsh with a stylish gentleman on his arm. A napkin. A woman shouts at Vanessa and nods to Francine, prompting Jared to sidestep. Francine nods appreciatively at Jared, who winks. Later, Jared is jogging out of the gala when he encounters Oliver ascending the steps, and Oliver wanders into the gala. Jared is cycled home through the bustling Chicago avenues and discovers Sam reading a book alone. Jared closes the door, drops his briefcase, and strolls over to him, balancing a single cupcake with a glowing candle on it. Blonde-haired Sam looks pensive as he leans back and halts in the doorway, glancing back to watch him, sighing in resignation. Dropping his gaze, he pivots and slinks off into the kitchen. Feeling defeated, Jared extinguishes the candle on the cupcake. Jared sneaks into Vanessa's apartment, carrying Vanessa's dry cleaning and the document. She's outfitted in a sleek monochrome ensemble with white jeans, light sneakers, and a large, floppy hat on her head. She deposits the dry cleaning into the specified wardrobe and is about to position the document when she's beckoned from one of the adjacent rooms but cannot locate Vanessa. She whips her hat off and adjusts her bangs before entering, where Vanessa is lounging in a recliner in the den. Jared presents it to her. Vanessa ascends abruptly, and Jared averts his eyes. Vanessa has redirected her focus to the document as Jared lingers and gazes at her with wide doe eyes for a moment, then exits. Jared meanders wistfully through the metropolis, contemplating his choice. It’s night, and the ritzy shop displays she passes are all illuminated. She passes individuals seated at tables outside a bistro, frowns, and continues. Green taxicabs cruise by her on the avenue as she navigates past store displays, one showcasing a chic blue jacket. Back at the residence, Sam shuffles out of the kitchen and finds Jared flipping through some of her vintage articles and snapshots, including one with her family, and she lifts another photograph. Sam's shoulders slump, and he retreats to the kitchen and dims the lights as Jared massages her temples, attempting to relieve some of the stress. Jared arrives at the office early, and both Vanessa's workspace and Francine's seat are vacant. Jared scrutinizes the foyer at it, then retrieves a notepad and some documents. Vanessa enters, loosening her jacket, which sports a dotted lapel."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Emily is lounging on the balcony with another group and notices Andy. Inside at the fair, Emily and Andy trail Miranda around as she entertains visitors, reminding her who they are, while Miranda is wearing a silver, off-the-hip dress. Andy notices Chairman Irv Ravitz with a stylish gentleman on his shoulder. A napkin. A woman gestures at Miranda and turns to Emily, prompting Andy to shuffle forward. Emily glances thankfully at Andy, who chuckles. Later, Andy is strolling out of the fair when she encounters Christian descending the ladder, and Christian advances to the fair. Andy is cycled home through the bustling New York avenues and discovers Nate reading a magazine alone. Andy opens the window, throws down her books, and hops over to him, holding a single fortune cookie with a burning sparkler on it. Dark-haired Nate looks gloomy as he leans back and halts at the window, glancing back to gaze at her, nodding his head sadly. Bowing his head, he pivots and drifts off into the kitchen. Looking sad, Andy extinguishes the sparkler on the cookie. Andy sneaks into Miranda's condo, holding Miranda's groceries and the magazine. She’s sporting a trendy mixed-color ensemble with white jeans, dark sneakers, and a small, pointed hat on her head. She hangs the groceries in the correct pantry and is about to place the magazine when she's beckoned from one of the adjacent areas but cannot hear Miranda. She pulls her hat off and ruffles her curls before moving on, where Miranda is on a couch in the study. Andy hands it to her. Miranda rises gently, and Andy glances up. Miranda has directed her attention to the magazine as Andy stands and watches her with her large owl eyes for a moment, then exits. Andy wanders cheerfully through the town, pondering over her choice. It’s bright, and the luxurious bakery displays she passes are all shining. She passes people lounging at benches outside a cafe, nods her head, and continues. Green rickshaws pass her on the lane as she strolls past bakery displays, one showcasing a stylish blue scarf. Back at home, Nate strolls out of the dining room and finds Andy flipping through some of her recent essays and paintings, including one of her with her siblings, and she lifts another illustration. Nate's eyes brighten, and he steps back into the dining room and switches on the light as Andy rubs her arm, trying to relieve some of the stiffness. Andy is at work late, and both Miranda's studio and Emily's desk are full. Andy gazes across the reception area at it, then lifts a calendar and some envelopes. Miranda enters, zipping her jacket, which has a polka-dotted hood."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Samantha is lounging on the carousel with another turtle and discovers Charlie. At the gala inside, Samantha and Charlie trail Veronica around as she welcomes strangers, reminding her of what they want, while Veronica is dressed in a red, polka-dotted tuxedo. Charlie discovers Captain Gene Ludlow with a trendy pigeon on his shoulder. A balloon. A penguin waves at Veronica and whispers to Samantha, causing Charlie to sprint forward. Samantha glances appreciatively at Charlie, who grins. Later, Charlie is skipping away from the gala when she encounters Oliver descending the escalator, and Oliver waddles into the gala. Charlie is flown home through the bustling Miami skies and finds Alex reading a newspaper alone. Charlie slams the window, drops her shoes, and dances over to him, carrying a single daisy with a glowing firefly on it. Blond Alex looks wistful as he leans back and pauses in the hallway, turns forward to gaze at her, nodding his head solemnly. Lifting his chin, he spins and strolls off into the garage. Looking dejected, Charlie extinguishes the firefly on the daisy. Charlie sneaks into Veronica's mansion, carrying Veronica's groceries and the fish. She's dressed in a warm pastel ensemble with yellow overalls, bright sneakers, and a small, rigid hat on her foot. She places the groceries into the wrong refrigerator and is about to drop the fish when she's beckoned from one of the other hallways but cannot hear Veronica. She yanks her hat off and brushes her forehead before meandering in, where Veronica is in a hammock in the kitchen. Charlie tosses it to her. Veronica rises cheerfully, and Charlie looks up. Veronica has shifted her focus to the fish as Charlie stands and examines her with her small hamster eyes for a moment, then disappears. Charlie skips joyfully through the park, reflecting on her adventure. It’s bright, and the dingy market booths she passes are all closed up. She wanders past folks dancing at podiums inside a library, nods her head, and stays put. Blue elephants fly over her through the clouds as she dances past market booths, one presenting a stylish purple hat. Back at the villa, Alex saunters into the bathroom and finds Charlie flipping through some of her old postcards and figurines, including one of her with her siblings, and she tosses another postcard. Alex's fingers clench, and he skips back into the bathroom and turns on the fan as Charlie rubs her chin, attempting to relieve some of the joy. Charlie is at the zoo late, and both Veronica's hammock and Samantha's desk are full. Charlie glances across the showroom at it, then picks up a smartphone and some envelopes. Veronica arrives, securing her scarf, which has a dotted button."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Emily and Andy attend a benefit with Miranda, assisting her as she mingles with guests. Andy encounters Chairman Irv Ravitz and later bumps into Christian. After the event, she returns home to find her partner Nate looking depressed. Andy tries to cheer him with a cupcake but is dismissed. Struggling with her choices, Andy visits Miranda's townhouse to deliver items, where Miranda sternly acknowledges her. Wandering the city, Andy contemplates her decisions amid illuminated shop windows. At home, she reviews old photos, reflecting on her past. Early at work, she notices Miranda’s and Emily’s empty spaces before Miranda arrives, signaling a new day."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Miranda comes in unbuttoning her coat which has a striped collar Andy stares across the anteroom at it then picks up a clipboard and some papers Andy is at work early and both Miranda's office and Emily's chair are empty Nate's shoulders sag and he heads back into the bedroom and turns out the light as Andy rubs her neck trying to ease some of the tension Back at home Nate wanders out of the bedroom and finds Andy looking through some of her old articles and photographs including one of her with her parents and she picks up another photograph Yellow taxicabs pass her on the street as she walks past shop windows one displaying a fashionable red coat She passes people sitting at tables outside a restaurant shakes her head and moves on It is dark and the swanky shop windows she passes are all lit up Andy strolls sadly through the city mulling over her decision Miranda has turned her attention to the book as Andy stands and stares at her with her big doe eyes for a moment then leaves Miranda rises sternly and Andy looks down Andy hands it to her She yanks her cap off and smooths her fringe before heading in where Miranda is in a chair in the lounge She puts the dry cleaning into the correct closet and is about to leave the book when she is summoned from one of the other rooms but cannot see Miranda She is wearing a cool monochrome outfit with black trousers pale boots and a big floppy cap on her head Andy let us herself into Miranda's townhouse carrying Miranda's dry cleaning and the book Looking glum Andy blows out the candle on the cake Hanging his head he turns and mooches off into the bedroom Darkhaired Nate looks morose as he sits forward and stops in the doorway turns back to look at her shaking his head sadly Andy shuts the door puts down her bags and walks over to him carrying a single fairy cake with a lit candle on it Andy is driven home through the busy New York streets and finds Nate watching TV alone Later Andy is hurrying out of the benefit when she meets Christian coming up the steps and Christian heads into the benefit Emily looks gratefully at Andy who smiles A man waves at Miranda and turns to Emily prompting Andy to step back A tissue Andy spots Chairman Irv Ravitz with a chic lady on his arm while Miranda is wearing a black offtheshoulder gown Emily and Andy follow Miranda around as she greets guests prompting her as to who they are Emily is standing on the stairs with another couple and spots Andy Inside at the benefit"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Miranda rises sternly and Andy looks down She is wearing a cool monochrome outfit with black trousers pale boots and a big floppy cap on her head Darkhaired Nate looks morose as he sits forward and stops in the doorway turns back to look at her shaking his head sadly She passes people sitting at tables outside a restaurant shakes her head and moves on It is dark and the swanky shop windows she passes are all lit up Emily looks gratefully at Andy who smiles A man waves at Miranda and turns to Emily prompting Andy to step back Looking glum Andy blows out the candle on the cake Hanging his head he turns and mooches off into the bedroom She puts the dry cleaning into the correct closet and is about to leave the book when she is summoned from one of the other rooms but cannot see Miranda Andy shuts the door puts down her bags and walks over to him carrying a single fairy cake with a lit candle on it Back at home Nate wanders out of the bedroom and finds Andy looking through some of her old articles and photographs including one of her with her parents and she picks up another photograph Miranda has turned her attention to the book as Andy stands and stares at her with her big doe eyes for a moment then leaves Miranda comes in unbuttoning her coat which has a striped collar She yanks her cap off and smooths her fringe before heading in where Miranda is in a chair in the lounge Andy is at work early and both Miranda's office and Emily's chair are empty Emily and Andy follow Miranda around as she greets guests prompting her as to who they are Andy let us herself into Miranda's townhouse carrying Miranda's dry cleaning and the book while Miranda is wearing a black offtheshoulder gown Andy hands it to her Andy stares across the anteroom at it then picks up a clipboard and some papers A tissue Nate's shoulders sag and he heads back into the bedroom and turns out the light as Andy rubs her neck trying to ease some of the tension Later Andy is hurrying out of the benefit when she meets Christian coming up the steps and Christian heads into the benefit Andy is driven home through the busy New York streets and finds Nate watching TV alone Yellow taxicabs pass her on the street as she walks past shop windows one displaying a fashionable red coat Emily is standing on the stairs with another couple and spots Andy Inside at the benefit Andy spots Chairman Irv Ravitz with a chic lady on his arm Andy strolls sadly through the city mulling over her decision"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She puts the dry cleaning into the correct closet and is about to leave the book when she is summoned from one of the other rooms but cannot see Miranda She yanks her cap off and smooths her fringe before heading in where Miranda is in a chair in the lounge Andy hands it to her Miranda rises sternly and Andy looks down Miranda has turned her attention to the book as Andy stands and stares at her with her big doe eyes for a moment then leaves Andy strolls sadly through the city mulling over her decision It is dark and the swanky shop windows she passes are all lit up She passes people sitting at tables outside a restaurant shakes her head and moves on Yellow taxicabs pass her on the street as she walks past shop windows one displaying a fashionable red coat Back at home Nate wanders out of the bedroom and finds Andy looking through some of her old articles and photographs including one of her with her parents and she picks up another photograph Nate's shoulders sag and he heads back into the bedroom and turns out the light as Andy rubs her neck trying to ease some of the tension Andy is at work early and both Miranda's office and Emily's chair are empty Andy stares across the anteroom at it then picks up a clipboard and some papers Miranda comes in unbuttoning her coat which has a striped collar Emily is standing on the stairs with another couple and spots Andy Inside at the benefit Emily and Andy follow Miranda around as she greets guests prompting her as to who they are while Miranda is wearing a black offtheshoulder gown Andy spots Chairman Irv Ravitz with a chic lady on his arm A tissue A man waves at Miranda and turns to Emily prompting Andy to step back Emily looks gratefully at Andy who smiles Later Andy is hurrying out of the benefit when she meets Christian coming up the steps and Christian heads into the benefit Andy is driven home through the busy New York streets and finds Nate watching TV alone Andy shuts the door puts down her bags and walks over to him carrying a single fairy cake with a lit candle on it Darkhaired Nate looks morose as he sits forward and stops in the doorway turns back to look at her shaking his head sadly Hanging his head he turns and mooches off into the bedroom Looking glum Andy blows out the candle on the cake Andy let us herself into Miranda's townhouse carrying Miranda's dry cleaning and the book She is wearing a cool monochrome outfit with black trousers pale boots and a big floppy cap on her head"
        }
      ]
    }
  ]
}