{
  "ground_truth": "She looks at Carl with a suspicious frown and takes a photo, then smiles as she halts cheekily. Carl smiles, turns away, and eyes her scooter. They tear down a road on the scooter, with Carl sitting behind the woman, Allison, wearing a helmet and clinging onto her. They weave in and out of the other traffic as she speeds up, overtaking two vehicles. Allison holds up her camera to take a picture while she veers across the road onto the wrong side. Oncoming cars swerve as they head up a tree-lined hill, and in the park by Carl's car, he pours petrol into his car and breaks into a smile as he hands back the camera to her. He gazes at her feigning surprise as she, wearing the helmet, marches over to him, presses herself against him, and kisses him hard on the lips. She draws back, leaving him dumbfounded as he gazes at her getting back onto her scooter. She drives off with a smile, and his eyes follow her as she goes. He turns back slowly, smiling to himself, then looks down at holding the Polaroid of them on the scooter in his hand. He scrutinizes the photo, nods and smiles, and his eyes dart around nervously. He puts the petrol cap back on, smiles, nods, and checks out the photo of him and Allison as Norman punches the air and smiles wistfully. Later, Carl sits in front of his computer at the bank as three guys stare at him. He clicks to enlarge another pop-up, and a corpulent woman heads over, gawking at him before beaming. Carl stamps the form with an approved stamp as a slice has been cut from the cake, and he high-fives Norman, forcing a grin. At the Bigfoot Lodge, Carl, Peter, and Rooney sit in a booth, and Carl glances at Rooney as they slam down shot glasses. Carl spits out a lime, snorts Tabasco sauce off his hand, grimaces, slams his fists on the table, and knocks over all the glasses. He plays on an arcade dance game, where the figure and arrows on the screen show him which moves to execute as he stands on a platform with arrows to the right, left, back, and front, moving his feet to the correct place to the beat. A crowd gathers to watch as he moves quickly, hopping about and spinning around, achieving a perfect score. Peter and Rooney smile and cheer as he moves nimbly, twirls with his leg out, making people duck out of the way, and finally collapses backward, where Peter and Rooney catch him. Carl snogs someone as a big burly guy approaches, and Rooney frowns. Outside, Carl is down as he crashes into a bin.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She observes at Carl with a dubious scowl and captures a photo, then grins as she pauses playfully. Carl grins, turns away, and watches her moped. They race down a road on the moped, with Carl perched behind the lady, Allison, wearing a helmet and gripping onto her. They weave in and out of the other vehicles as she accelerates, overtaking two cars. Allison raises her camera to capture a picture while she swerves across the road onto the incorrect side. Approaching automobiles veer as they travel up a tree-lined hill, and in the park by Carl's car, he pours gasoline into his car and breaks into a grin as he hands back the camera to her. He gazes at her pretending astonishment as she, wearing the helmet, strides over to him, presses herself against him, and kisses him fiercely on the lips. She retracts, leaving him speechless as he gazes at her getting back onto her moped. She drives off with a grin, and his eyes follow her as she departs. He turns back slowly, grinning to himself, then looks down at holding the Polaroid of them on the moped in his hand. He inspects the photo, nods and grins, and his eyes dart around nervously. He places the gas cap back on, grins, nods, and examines the photo of him and Allison as Norman punches the air and grins wistfully. Later, Carl sits in front of his computer at the bank as three men stare at him. He clicks to magnify another pop-up, and a stout woman heads over, gawking at him before smiling. Carl stamps the form with an approved stamp as a portion has been cut from the cake, and he high-fives Norman, forcing a grin. At the Bigfoot Lodge, Carl, Peter, and Rooney sit in a booth, and Carl glances at Rooney as they slam down shot glasses. Carl spits out a lime, snorts Tabasco sauce off his hand, grimaces, slams his fists on the table, and knocks over all the glasses. He plays on an arcade dance game, where the figure and arrows on the screen show him which moves to perform as he stands on a platform with arrows to the right, left, back, and front, moving his feet to the correct place to the rhythm. A crowd gathers to watch as he moves rapidly, hopping about and spinning around, achieving a flawless score. Peter and Rooney grin and cheer as he moves deftly, twirls with his leg out, making people duck out of the way, and finally collapses backward, where Peter and Rooney catch him. Carl kisses someone as a large burly guy approaches, and Rooney scowls. Outside, Carl is down as he crashes into a trash bin."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "She is looked at by Carl with a suspicious frown, and a photo is taken by her, then she smiles as she is halted cheekily. A smile crosses Carl's face, he turns away, and her scooter is eyed by him. A road is torn down by them on the scooter, with Carl being seated behind the woman, Allison, who is wearing a helmet and is clung onto by him. In and out of the other traffic is woven by them as speed is increased by her, and two vehicles are overtaken. Her camera is held up by Allison to take a picture while a veer across the road onto the wrong side is made by her. Oncoming cars swerve as a tree-lined hill is headed up by them, and in the park by Carl's car, petrol is poured into his car, and a smile breaks on his face as the camera is handed back to her by him. Her is gazed at by him feigning surprise as, still wearing the helmet, she marches over to him, presses herself against him, and a hard kiss is planted on his lips by her. Back is drawn by her, leaving him dumbfounded as she is gazed at by him getting back onto her scooter. A drive-off is made by her with a smile, and she is watched by him as she goes. He turns back slowly, smiling to himself, then looks down at the Polaroid of them on the scooter being held in his hand. The photo is scrutinized by him, and nods and smiles are made, then eyes dart around nervously. The petrol cap is put back on by him, he smiles, nods, and the photo of him and Allison is checked out as Norman punches the air and wistfully smiles. Later, in front of his computer at the bank he sits, as three guys stare at him. Another pop-up is clicked to enlarge by him, and a corpulent woman heads over, gawking at him before a beam is given by her. A stamp of approval is made on the form by Carl as a slice is cut from the cake, and a high-five is forced on Norman with a grin. At the Bigfoot Lodge, in a booth Carl, Peter, and Rooney sit, and Rooney is glanced at by Carl as shot glasses are slammed down by them. A lime is spat out by Carl, Tabasco sauce is snorted off his hand, a grimace is made, fists are slammed on the table by him, and all the glasses are knocked over. An arcade dance game is played by him, where the figure and arrows on the screen show him which moves to execute as on a platform with arrows to the right, left, back, and front he stands, moving his feet to the correct place to the beat. A crowd gathers to watch as quick movements are made by him, hopping about and spinning around, a perfect score is achieved. Peter and Rooney smile and cheer as nimble movements are executed by him, a twirl with his leg out is performed, making people duck out of the way, and finally, a backward collapse is executed, where Peter and Rooney catch him. Someone is snogged by Carl as a big burly guy approaches, and a frown is made by Rooney. Outside, Carl is brought down as a crash into a bin is made by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Allison looks at Carl with a suspicious frown, takes a photo, then cheekily smiles and stops. Carl smiles back, turns away, and notices her scooter. They zoom down the road with Carl behind Allison, clinging to her as she overtakes two vehicles. Allison takes a picture while veering onto the wrong side. Oncoming cars swerve as they climb a tree-lined hill. At the park, Carl pours petrol into his car, smiles, and returns the camera. Allison, wearing the helmet, approaches, kisses him passionately, then leaves him bewildered as she rides off. Carl smiles, holding a Polaroid of them, nods, and checks the photo, while Norman celebrates happily. Later, at the bank, Carl enlarges a pop-up on his computer, and a woman beams at him. He stamps a form approved as a cake slice is cut, and high-fives Norman, forcing a smile. At the Bigfoot Lodge, Carl, Peter, and Rooney slam down shot glasses. Carl spits a lime, snorts Tabasco off his hand, grimaces, and knocks over glasses. On an arcade dance game, Carl follows the screen's moves perfectly, drawing a crowd. Peter and Rooney cheer as he dances, spins, and collapses, with them catching him. Carl kisses someone as a burly guy approaches, and Rooney frowns. Outside, Carl is down as he crashes into a bin."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "She frowns at Carl, takes a photo, smiles cheekily, and stops. Carl smiles, turns, and looks at her scooter. They ride the scooter, Carl behind Allison, wearing a helmet. Weaving through traffic, she speeds up, overtakes cars, and takes a picture, veering onto the wrong side. Cars swerve on a hill. At the park, Carl pours petrol, smiles, hands the camera back, and feigns surprise as Allison kisses him hard. She leaves, and Carl smiles, holding a scooter Polaroid, nodding nervously. Later, Carl is at his computer at the bank with onlookers as he approves a form, high-fives Norman, and forces a grin. At Bigfoot Lodge, Carl, Peter, and Rooney sit, slam shots, and Carl spits lime, snorts Tabasco, grimaces, knocks over glasses, and plays an arcade dance game. He moves quickly, achieving a perfect score as people watch. Peter and Rooney cheer, catching him as he collapses. Carl kisses someone as a burly guy approaches, and Rooney frowns. Outside, Carl crashes into a bin, feeling down."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "She casts a suspicious frown in Carl's direction, her eyes narrowing slightly, before raising her camera to capture the moment. With a mischievous grin spreading across her face, she pauses in a playful manner. Meanwhile, Carl mirrors her expression with a smile of his own, casually turning away as his gaze falls upon her scooter. Together, they speed down a busy road, Carl perched securely behind the woman named Allison. He wears a helmet for safety as he clings to her tightly. The pair skillfully weaves in and out of the bustling traffic, with Allison deftly increasing their speed and overtaking two vehicles in the process.\n\nAllison, ever the spontaneous spirit, raises her camera once more, attempting to capture another picture, while daringly veering onto the wrong side of the road. Oncoming cars hastily swerve to avoid a collision as they advance up a picturesque hill lined with trees on either side. At the nearby park, beside Carl's parked car, he pours fuel into the tank and then breaks into a broad smile as he hands the camera back to her. His eyes widen, feigning surprise, as she, still donning the helmet, confidently strides over to him. She presses herself against him intimately, planting a passionate kiss on his lips. She pulls away, leaving him bewildered yet delighted, as he watches her jump back onto her scooter. With a beaming smile, she rides off, while his eyes trail after her retreating form.\n\nWith a slow turn back, Carl smiles to himself, his face reflecting a quiet satisfaction. He glances down at the Polaroid photo held securely in his hand, depicting the two of them on the scooter. He examines the photograph closely, nodding to himself with approval, an amused smile dancing on his lips. His eyes dart around nervously before he secures the petrol cap back onto the car, smiling and nodding again as he re-evaluates the picture of himself and Allison. Nearby, Norman punches the air in an expression of glee, wearing a wistful smile. Later on, Carl finds himself seated in front of his computer at the bank, with three guys intently staring at him. He clicks to enlarge a persistent pop-up on the screen, and a corpulent woman approaches, her gaze fixed on him before she bursts into a radiant smile.\n\nCarl dutifully stamps the form with the approved mark, just as someone slices a piece from a cake nearby. He shares an enthusiastic high-five with Norman, forcing a grin to match the celebratory atmosphere. In the lively setting of the Bigfoot Lodge, Carl, alongside Peter and Rooney, sits in a booth. Carl glances over at Rooney as they enthusiastically slam down their shot glasses. In a burst of spontaneity, Carl spits out a lime, inhales the fiery Tabasco sauce from his hand, grimacing slightly from the fiery sting. He slams his fists down on the table, causing all the glasses to topple over dramatically.\n\nStepping onto an arcade dance platform, where arrows guide his every move, he becomes engrossed in the rhythm of the game. The screen before him displays a figure and arrows, instructing him on the precise dance steps to execute. A crowd gathers, drawn in by his energetic performance, watching in awe as he swiftly hops and spins, ultimately achieving a perfect score. Peter and Rooney cheer enthusiastically, beaming with pride as Carl nimbly twirls, extending his leg with flair, prompting those nearby to duck out of the way. Finally, he collapses backward, exhausted but triumphant, as Peter and Rooney catch him with supportive arms. In the midst of the exuberance, Carl shares a kiss with someone, though a big, burly guy approaches, prompting Rooney to frown.\n\nOutside, a more somber scene unfolds as Carl appears downcast, crashing into a nearby bin, his earlier high spirits momentarily dampened."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Casting a suspicious and somewhat distrustful frown in Carl's direction, she narrows her eyes ever so slightly before raising her camera to capture the ephemeral moment. With a mischievous grin spreading widely across her face, she pauses in a playful and teasing manner. Simultaneously, Carl mirrors her expression, reflecting her grin with a smile of his own. He casually turns away, letting his gaze fall upon her scooter. Together, they speed down a bustling road, with Carl perched securely behind the woman named Allison. Wearing a protective helmet for safety, he clings tightly to her. The pair skillfully weaves in and out of the busy and chaotic traffic, with Allison deftly increasing their speed and expertly overtaking two vehicles in the process.\n\nAllison, ever the spontaneous and adventurous spirit, raises her camera once more, attempting to capture another photo, while daringly veering onto the wrong side of the road. Oncoming cars hastily swerve to avoid a potential collision as they advance up a picturesque hill that is beautifully lined with trees on either side. At the nearby park, beside Carl's parked car, he pours fuel into the tank and then breaks into a broad, cheerful smile as he hands the camera back to her. His eyes widen, feigning surprise, as she, still donning the helmet confidently, strides over to him. She presses herself against him intimately, planting a passionate kiss on his lips. She pulls away gently, leaving him bewildered yet thoroughly delighted, as he watches her jump back onto her scooter. With a beaming smile on her face, she rides off, while his eyes trail after her retreating form.\n\nWith a slow and deliberate turn back, Carl smiles to himself, his face reflecting a quiet sense of satisfaction. He glances down at the Polaroid photo held securely in his hand, depicting the two of them on the scooter. He examines the photograph closely, nodding to himself with approval, an amused smile dancing on his lips. His eyes dart around nervously before he secures the petrol cap back onto the car, smiling and nodding again as he re-evaluates the picture of himself and Allison. Nearby, Norman punches the air in an expression of uncontained glee, wearing a wistful smile. Later on, Carl finds himself seated in front of his computer at the bank, with three guys intently staring at him. He clicks to enlarge a persistent pop-up on the screen, and a corpulent woman approaches, her gaze fixed on him before she bursts into a radiant and cheerful smile.\n\nCarl dutifully stamps the form with the approved mark, just as someone slices a piece from a delicious-looking cake nearby. He shares an enthusiastic high-five with Norman, forcing a grin to match the celebratory atmosphere. In the lively and vibrant setting of the Bigfoot Lodge, Carl, alongside Peter and Rooney, sits comfortably in a booth. Carl glances over at Rooney as they enthusiastically slam down their shot glasses. In a burst of spontaneity, Carl spits out a lime, then inhales the fiery Tabasco sauce from his hand, grimacing slightly from the fiery sting. He energetically slams his fists down on the table, causing all the glasses to topple over dramatically.\n\nStepping onto an arcade dance platform, where arrows guide his every precise move, he becomes engrossed in the rhythm of the mesmerizing game. The screen before him displays a dynamic figure and arrows, instructing him on the precise dance steps to execute. A crowd gathers, drawn in by his energetic and lively performance, watching in awe as he swiftly hops and spins, ultimately achieving a perfect score. Peter and Rooney cheer enthusiastically, beaming with pride and admiration as Carl nimbly twirls, extending his leg with flair, prompting those nearby to duck out of the way. Finally, he collapses backward, exhausted but triumphant, as Peter and Rooney catch him with supportive and welcoming arms. In the midst of the exuberance, Carl shares a kiss with someone, though a big, burly guy approaches, prompting Rooney to frown.\n\nOutside, a more somber scene unfolds as Carl appears downcast, crashing into a nearby bin, his earlier high spirits momentarily dampened."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She narrows her eyes, casting a suspicious frown at Carl before swiftly lifting her camera to snap a photo. Her expression transforms into a cheeky smile as she halts abruptly, causing Carl to grin and turn his attention away to examine her scooter with interest. They soon find themselves speeding down a road on the scooter, Carl positioned behind the woman, Allison, who dons a helmet as he clings onto her tightly. Maneuvering deftly, they weave in and out of the traffic, with Allison skillfully accelerating and overtaking two vehicles. At a daring moment, she lifts her camera to snap another picture while recklessly veering across the road into the lane for oncoming traffic. Cars swerve to avoid them as they ascend a tree-lined hill together. In the park by Carl’s car, he carefully pours petrol into his vehicle, feeling a sense of satisfaction as he hands back the camera to her with a smile. He gazes at her with a feigned surprise as she, still wearing the helmet, strides confidently over to him, presses herself against him, and kisses him passionately on the lips. As she pulls away, leaving him momentarily stunned, he watches her get back onto her scooter and drive off with a playful smile, his eyes trailing her departure. Slowly turning back, he smiles to himself, glancing down at the Polaroid in his hand that captures their moment on the scooter. He studies the photo closely, nodding with approval, his eyes darting around nervously. After securing the petrol cap back onto his car, he smiles once more, nodding in contentment, and revisits the photo of himself and Allison as Norman punches the air triumphantly and smiles wistfully. Later, Carl finds himself seated at his computer in a bank, under the scrutiny of three guys who stare intently at him. He clicks to enlarge a pop-up on his screen just as a corpulent woman approaches, gawking at him before her face lights up with a beam. With a firm hand, Carl stamps the form with an 'Approved' stamp, noting that a slice has been cut from the cake, and proceeds to high-five Norman, forcing a grin of camaraderie. At the Bigfoot Lodge, Carl, Peter, and Rooney are nestled in a booth when Carl shares a glance with Rooney as they slam down shot glasses in unison. Carl dramatically spits out a lime, snorts Tabasco sauce off his hand, grimaces in response to the fiery sensation, and slams his fists on the table with such force that he knocks over all the glasses. He enthusiastically participates in an arcade dance game, where the digital figure and arrows on the screen guide him on which dance moves to execute. Standing on a platform with arrows pointing right, left, back, and front, he moves his feet swiftly to land on the correct spots in rhythm with the beat. A crowd gathers to witness his rapid movements, hopping energetically and spinning around to achieve a perfect score. Peter and Rooney look on, smiling and cheering as Carl moves with nimbleness, twirling with one leg extended and making onlookers duck out of the way. He eventually collapses backward, where Peter and Rooney catch him with supportive laughter. Amidst the revelry, Carl passionately kisses someone as a large, burly man approaches, prompting Rooney to frown at the unfolding scene. Once outside, Carl’s mood dampens as he crashes into a bin, bringing an abrupt end to the evening’s high-spirited antics."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "She takes a photo of Carl with a suspicious frown, but then smiles cheekily. Carl turns away with a smile and notices her scooter. They ride down a road on the scooter, with Carl holding onto Allison, who speeds up, overtakes vehicles, and takes a picture while veering onto the wrong side of the road. As oncoming cars swerve, they ascend a tree-lined hill to a park by Carl's car. There, Carl refuels his car, returns the camera to Allison, and smiles. With feigned surprise, Allison, wearing a helmet, presses herself against Carl and kisses him intensely before returning to her scooter. She drives off smiling, leaving Carl gazing after her. He looks at a Polaroid of them on the scooter, smiling and nodding at the memory. Nervously, he secures the petrol cap and reviews the photo while Norman punches the air, smiling wistfully.\n\nLater at the bank, Carl, seated at his computer, is eyed by three coworkers. A corpulent woman approaches, beaming as Carl approves a form and high-fives Norman. At the Bigfoot Lodge, Carl, Peter, and Rooney share a booth. Carl downs shot glasses, spits out a lime, snorts Tabasco sauce, and knocks over glasses. On an arcade dance game, Carl follows prompts, moving swiftly and achieving a perfect score, as a crowd gathers. Peter and Rooney cheer while Carl twirls, causing people to duck, before collapsing into their arms. Carl kisses someone before a burly guy approaches, prompting a frown from Rooney. Outside, Carl crashes into a bin, feeling down."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She looks at Carl with a suspicious frown, reminiscent of the expressions often seen in detective films, and takes a photo, then smiles as she halts cheekily. Carl, known for his playful demeanor, smiles, turns away, and eyes her scooter, a Vespa that she had painted in vibrant colors herself. They tear down a road on the scooter, a popular mode of transport in bustling European cities, with Carl sitting behind the woman, Allison, wearing a helmet adorned with stickers and clinging onto her. They weave in and out of the other traffic, similar to the chaotic scenes in city centers, as she speeds up, overtaking two vehicles. Allison holds up her vintage camera to take a picture while she veers across the road onto the wrong side, a risky move often seen in action films. Oncoming cars swerve as they head up a tree-lined hill, reminiscent of those found in the winding roads of San Francisco, and in the park by Carl's vintage Volkswagen Beetle, he pours petrol sourced from a nearby gas station into his car and breaks into a smile as he hands back the camera, an old Polaroid model, to her. He gazes at her feigning surprise as she, wearing the helmet, marches over to him, presses herself against him, and kisses him hard on the lips. She draws back, leaving him dumbfounded as he gazes at her getting back onto her scooter. She drives off with a smile, and his eyes follow her as she goes. He turns back slowly, smiling to himself, then looks down at holding the Polaroid of them on the scooter in his hand. He scrutinizes the photo, nods and smiles, and his eyes dart around nervously, a behavior often associated with someone hiding a secret. He puts the petrol cap back on, smiles, nods, and checks out the photo of him and Allison as Norman, his longtime friend from college, punches the air and smiles wistfully. Later, Carl sits in front of his computer at the bank, a well-known financial institution where he works, as three guys from the finance team stare at him. He clicks to enlarge another pop-up, and a corpulent woman, known as the office manager, heads over, gawking at him before beaming. Carl stamps the form with an approved stamp as a slice has been cut from the celebratory office cake, and he high-fives Norman, forcing a grin. At the Bigfoot Lodge, their favorite local bar known for its eclectic decor, Carl, Peter, and Rooney sit in a booth, and Carl glances at Rooney as they slam down shot glasses filled with tequila. Carl spits out a lime, snorts Tabasco sauce off his hand, a party trick inspired by a viral video, grimaces, slams his fists on the table, and knocks over all the glasses. He plays on an arcade dance game, known as Dance Dance Revolution, where the figure and arrows on the screen show him which moves to execute as he stands on a platform with arrows to the right, left, back, and front, moving his feet to the correct place to the beat. A crowd, captivated by his skillful performance, gathers to watch as he moves quickly, hopping about and spinning around, achieving a perfect score. Peter and Rooney smile and cheer as he moves nimbly, twirls with his leg out, making people duck out of the way, and finally collapses backward, where Peter and Rooney catch him. Carl snogs someone, reminiscent of spontaneous movie kisses, as a big burly guy, a regular at the lodge, approaches, and Rooney frowns. Outside, Carl is down as he crashes into a bin, a moment of comic relief typical of slapstick humor."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "She looks at Carl with a suspicious frown and takes a photo then smiles as she halts cheekily. Carl smiles turns away and eyes her scooter. They tear down a road on the scooter with Carl sitting behind the woman Allison wearing a helmet and clinging onto her. They weave in and out of the other traffic as she speeds up overtaking two vehicles. Allison holds up her camera to take a picture while she veers across the road onto the wrong side. Oncoming cars swerve as they head up a treelined hill and in the park by Carl's car. he pours petrol into his car and breaks into a smile as he hands back the camera to her. He gazes at her feigning surprise as she wearing the helmet marches over to him presses herself against him and kisses him hard on the lips. She draws back leaving him dumbfounded as he gazes at her getting back onto her scooter. She drives off with a smile and his eyes follow her as she goes. He turns back slowly smiling to himself then looks down at holding the Polaroid of them on the scooter in his hand. He scrutinizes the photo nods and smiles and his eyes dart around nervously. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. He puts the petrol cap back on smiles nods and checks out the photo of him and Allison as Norman punches the air and smiles wistfully. Later Carl sits in front of his computer at the bank as three guys stare at him. He clicks to enlarge another popup and a corpulent woman heads over gawking at him before beaming. Carl stamps the form with an approved stamp as a slice has been cut from the cake and he highfives. Norman forcing a grin. At the Bigfoot Lodge Carl Peter and Rooney sit in a booth and Carl glances at Rooney as they slam down shot glasses. Carl spits out a lime snorts Tabasco sauce off his hand grimaces slams his fists on the table and knocks over all the glasses. He plays on an arcade dance game where the figure and arrows on the screen show him which moves to execute as he stands on a platform with arrows to the right left back and front moving his feet to the correct place to the beat. A crowd gathers to watch as he moves quickly hopping about and spinning around achieving a perfect score. Peter and Rooney smile and cheer as he moves nimbly twirls with his leg out making people duck out of the way and finally collapses backward where Peter and Rooney catch him. Carl snogs someone as a big burly guy approaches and Rooney frowns Outside. Carl is down as he crashes into a bin."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "She looks at Carl with a suspicious frown and takes a photo then smiles as she halts cheekily. Carl smiles turns away and eyes her scooter. They tear down a road on the scooter with Carl sitting behind the woman Allison wearing a helmet and clinging onto her. They weave in and out of the other traffic as she speeds up overtaking two vehicles. Allison holds up her camera to take a picture while she veers across the road onto the wrong side. Oncoming cars swerve as they head up a treelined hill and in the park by Carl's car. he pours petrol into his car and breaks into a smile as he hands back the camera to her. He gazes at her feigning surprise as she wearing the helmet marches over to him presses herself against him and kisses him hard on the lips. She draws back leaving him dumbfounded as he gazes at her getting back onto her scooter. She drives off with a smile and his eyes follow her as she goes. He turns back slowly smiling to himself then looks down at holding the Polaroid of them on the scooter in his hand. He scrutinizes the photo nods and smiles and his eyes dart around nervously. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. He puts the petrol cap back on smiles nods and checks out the photo of him and Allison as Norman punches the air and smiles wistfully. Later Carl sits in front of his computer at the bank as three guys stare at him. He clicks to enlarge another popup and a corpulent woman heads over gawking at him before beaming. Carl stamps the form with an approved stamp as a slice has been cut from the cake and he highfives. Norman forcing a grin. At the Bigfoot Lodge Carl Peter and Rooney sit in a booth and Carl glances at Rooney as they slam down shot glasses. Carl spits out a lime snorts Tabasco sauce off his hand grimaces slams his fists on the table and knocks over all the glasses. He plays on an arcade dance game where the figure and arrows on the screen show him which moves to execute as he stands on a platform with arrows to the right left back and front moving his feet to the correct place to the beat. A crowd gathers to watch as he moves quickly hopping about and spinning around achieving a perfect score. Peter and Rooney smile and cheer as he moves nimbly twirls with his leg out making people duck out of the way and finally collapses backward where Peter and Rooney catch him. Carl snogs someone as a big burly guy approaches and Rooney frowns Outside. Carl is down as he crashes into a bin."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "She looks at Carl with a suspicious frown and takes a photo then smiles as she halts cheekily. Carl smiles turns away and eyes her scooter. They tear down a road on the scooter with Carl sitting behind the woman Allison wearing a helmet and clinging onto her. They weave in and out of the other traffic as she speeds up overtaking two vehicles. Allison holds up her camera to take a picture while she veers across the road onto the wrong side. Oncoming cars swerve as they head up a treelined hill and in the park by Carl's car. Carl spits out a lime snorts Tabasco sauce off his hand grimaces slams his fists on the table and knocks over all the glasses. He plays on an arcade dance game where the figure and arrows on the screen show him which moves to execute as he stands on a platform with arrows to the right left back and front moving his feet to the correct place to the beat. A crowd gathers to watch as he moves quickly hopping about and spinning around achieving a perfect score. Peter and Rooney smile and cheer as he moves nimbly twirls with his leg out making people duck out of the way and finally collapses backward where Peter and Rooney catch him. Carl snogs someone as a big burly guy approaches and Rooney frowns Outside. Carl is down as he crashes into a bin."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "She looks at Carl with a suspicious frown and takes a photo then smiles as she halts cheekily. Carl smiles turns away and eyes her scooter. They tear down a road on the scooter with Carl sitting behind the woman Allison wearing a helmet and clinging onto her. Carl snogs someone as a big burly guy approaches and Rooney frowns Outside. Carl is down as he crashes into a bin."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat glances at Gina with a curious grin and sketches a landscape, then chuckles as it stretches jovially. Gina giggles, turns to the side, and studies its bicycle. They glide up a hill on the bicycle, with Gina sitting behind the bird, Leo, wearing goggles and clutching onto the bird. They drift around and among the other pedestrians as it crawls forward, bypassing two strollers. Leo raises its smartphone to record a video while it swerves across the trail onto the opposite side. Passing joggers leap as they ascend a cloud-covered mountain, and in the field near Gina's truck, it pours juice into its truck and cracks into laughter as it hands over the smartphone to it. It peeks at it acting playful as Gina, donning the goggles, strides over to it, nudges it with a feather, and hugs it tightly on the cheek. It pulls away, leaving it astonished as it peeks at it hopping back onto its bicycle. It pedals away with a grin, and its gaze tracks it as it leaves. It spins back carefully, chuckling to itself, then peeks down at gripping the sketch of them on the bicycle in its paw. It examines the drawing, shakes its head, and chuckles, and its gaze darts around excitedly. It places the juice lid back on, chuckles, shakes its head, and admires the drawing of it and Leo as Oliver claps the clouds and chuckles dreamily. Eventually, Gina perches in front of its tablet at the library as three owls gaze at it. It taps to enlarge another balloon, and a petite penguin waddles over, peering at it before giggling. Gina taps the parchment with a blue mark as a piece has been nibbled from the pie, and it fist-bumps Oliver, faking a laugh. At the Dragon Inn, Gina, Alex, and Casey recline in a hammock, and Gina glimpses at Casey as they gulp down teacups. Gina spits out a berry, inhales peppermint extract off its wing, winces, bangs its tail on the plank, and topples over all the cups. It frolics on a digital puzzle game, where the creature and shapes on the monitor show it which moves to create as it stands on a board with shapes to the right, left, back, and front, shifting its wings to the correct place to the beat. A flock forms to observe as it dances briskly, leaping about and swirling around, reaching an excellent score. Alex and Casey grin and applaud as it leaps swiftly, pirouettes with its wing out, making creatures dive out of the path, and finally flops backward, where Alex and Casey catch it. Gina kisses someone as a large burly beast approaches, and Casey scowls. Outside, Gina is up as it skids into a barrel."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Allison takes a photo of Carl and smiles, and they ride her scooter, weaving through traffic. She takes another picture while they veer onto the wrong side of the road, dodging cars. At the park, Carl refuels his car, smiles, and returns the camera to her. Allison, feigning surprise in her helmet, kisses Carl passionately then rides off, leaving him holding a Polaroid of them on the scooter. Carl smiles, examines the photo, and nervously looks around. Later, Carl is at the bank working on his computer as colleagues watch him. He stamps an approved form, high-fives Norman, and grins. At the Bigfoot Lodge, Carl, Peter, and Rooney are drinking. Carl plays an arcade dance game, moving quickly and achieving a perfect score as a crowd watches. After dancing, Peter and Rooney cheer and catch him when he collapses. Carl kisses someone, then crashes into a bin outside, feeling down."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Carl is down as he crashes into a bin Carl snogs someone as a big burly guy approaches and Rooney frowns Outside Peter and Rooney smile and cheer as he moves nimbly twirls with his leg out making people duck out of the way and finally collapses backward where Peter and Rooney catch him A crowd gathers to watch as he moves quickly hopping about and spinning around achieving a perfect score He plays on an arcade dance game where the figure and arrows on the screen show him which moves to execute as he stands on a platform with arrows to the right left back and front moving his feet to the correct place to the beat Carl spits out a lime snorts Tabasco sauce off his hand grimaces slams his fists on the table and knocks over all the glasses At the Bigfoot Lodge Carl Peter and Rooney sit in a booth and Carl glances at Rooney as they slam down shot glasses Norman forcing a grin Carl stamps the form with an approved stamp as a slice has been cut from the cake and he highfives He clicks to enlarge another popup and a corpulent woman heads over gawking at him before beaming Later Carl sits in front of his computer at the bank as three guys stare at him He puts the petrol cap back on smiles nods and checks out the photo of him and Allison as Norman punches the air and smiles wistfully He scrutinizes the photo nods and smiles and his eyes dart around nervously He turns back slowly smiling to himself then looks down at holding the Polaroid of them on the scooter in his hand She drives off with a smile and his eyes follow her as she goes She draws back leaving him dumbfounded as he gazes at her getting back onto her scooter He gazes at her feigning surprise as she wearing the helmet marches over to him presses herself against him and kisses him hard on the lips he pours petrol into his car and breaks into a smile as he hands back the camera to her Oncoming cars swerve as they head up a treelined hill and in the park by Carl's car Allison holds up her camera to take a picture while she veers across the road onto the wrong side They weave in and out of the other traffic as she speeds up overtaking two vehicles They tear down a road on the scooter with Carl sitting behind the woman Allison wearing a helmet and clinging onto her Carl smiles turns away and eyes her scooter She looks at Carl with a suspicious frown and takes a photo then smiles as she halts cheekily"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Carl smiles turns away and eyes her scooter She looks at Carl with a suspicious frown and takes a photo then smiles as she halts cheekily They weave in and out of the other traffic as she speeds up overtaking two vehicles They tear down a road on the scooter with Carl sitting behind the woman Allison wearing a helmet and clinging onto her Oncoming cars swerve as they head up a treelined hill and in the park by Carl's car Allison holds up her camera to take a picture while she veers across the road onto the wrong side He gazes at her feigning surprise as she wearing the helmet marches over to him presses herself against him and kisses him hard on the lips he pours petrol into his car and breaks into a smile as he hands back the camera to her She drives off with a smile and his eyes follow her as she goes She draws back leaving him dumbfounded as he gazes at her getting back onto her scooter He scrutinizes the photo nods and smiles and his eyes dart around nervously He turns back slowly smiling to himself then looks down at holding the Polaroid of them on the scooter in his hand Later Carl sits in front of his computer at the bank as three guys stare at him He puts the petrol cap back on smiles nods and checks out the photo of him and Allison as Norman punches the air and smiles wistfully Carl stamps the form with an approved stamp as a slice has been cut from the cake and he highfives He clicks to enlarge another popup and a corpulent woman heads over gawking at him before beaming At the Bigfoot Lodge Carl Peter and Rooney sit in a booth and Carl glances at Rooney as they slam down shot glasses Norman forcing a grin He plays on an arcade dance game where the figure and arrows on the screen show him which moves to execute as he stands on a platform with arrows to the right left back and front moving his feet to the correct place to the beat Carl spits out a lime snorts Tabasco sauce off his hand grimaces slams his fists on the table and knocks over all the glasses Peter and Rooney smile and cheer as he moves nimbly twirls with his leg out making people duck out of the way and finally collapses backward where Peter and Rooney catch him A crowd gathers to watch as he moves quickly hopping about and spinning around achieving a perfect score Carl is down as he crashes into a bin Carl snogs someone as a big burly guy approaches and Rooney frowns Outside"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He puts the petrol cap back on smiles nods and checks out the photo of him and Allison as Norman punches the air and smiles wistfully Later Carl sits in front of his computer at the bank as three guys stare at him He clicks to enlarge another popup and a corpulent woman heads over gawking at him before beaming Carl stamps the form with an approved stamp as a slice has been cut from the cake and he highfives Norman forcing a grin At the Bigfoot Lodge Carl Peter and Rooney sit in a booth and Carl glances at Rooney as they slam down shot glasses Carl spits out a lime snorts Tabasco sauce off his hand grimaces slams his fists on the table and knocks over all the glasses He plays on an arcade dance game where the figure and arrows on the screen show him which moves to execute as he stands on a platform with arrows to the right left back and front moving his feet to the correct place to the beat A crowd gathers to watch as he moves quickly hopping about and spinning around achieving a perfect score Peter and Rooney smile and cheer as he moves nimbly twirls with his leg out making people duck out of the way and finally collapses backward where Peter and Rooney catch him Carl snogs someone as a big burly guy approaches and Rooney frowns Outside Carl is down as he crashes into a bin She looks at Carl with a suspicious frown and takes a photo then smiles as she halts cheekily Carl smiles turns away and eyes her scooter They tear down a road on the scooter with Carl sitting behind the woman Allison wearing a helmet and clinging onto her They weave in and out of the other traffic as she speeds up overtaking two vehicles Allison holds up her camera to take a picture while she veers across the road onto the wrong side Oncoming cars swerve as they head up a treelined hill and in the park by Carl's car he pours petrol into his car and breaks into a smile as he hands back the camera to her He gazes at her feigning surprise as she wearing the helmet marches over to him presses herself against him and kisses him hard on the lips She draws back leaving him dumbfounded as he gazes at her getting back onto her scooter She drives off with a smile and his eyes follow her as she goes He turns back slowly smiling to himself then looks down at holding the Polaroid of them on the scooter in his hand He scrutinizes the photo nods and smiles and his eyes dart around nervously"
        }
      ]
    }
  ]
}