{
  "ground_truth": "She starts to climb over. They walk backstage at a music venue. It's full of equipment. They round a corner and walk out on stage and look at the vast Hollywood Bowl amphitheater. Hand-in-hand, Carl and Allison wander beneath the domed archway that covers the stage. They smile in awe. Carl turns to Allison, who stares out at the seats, lost in thought. He gazes at her. She turns to him and they smile. They look out again. They turn towards each other. Allison looks up at him. Allison leans forward and plants a kiss on his lips. She draws back and smiles impishly. Carl leans down and kisses her passionately but tenderly. He puts his arms around her and presses her to him. She puts an arm on his shoulder and squeezes affectionately. They stay locked in an embrace and sink to the floor. They sit in the deserted amphitheater. He eyes her gravely. A fat security guard with a torch chases them. Carl hands out oranges. People queue outside his office door. Lee's smile fades. Norman's po-faced. A motorbike. He approves the loan. Carl and Norman go into an office. A mustachioed man stands. They shake hands. Wesley, Carl, and Norman sit down at the table in the big office. Carl smiles. Norman gawks. Frowning, Carl stares. Norman nods. Carl and Lucy look at bridal shower invitations. She slowly turns and looks at him sadly. Carl nods sympathetically. Soo-Mi grins. Carl holds up a clenched fist. A guy runs in. Carl joins the crowd. Standing on the street, Carl stares into the distance with a steely resolve. He bursts into the tall, red brick apartment building and runs up a central staircase. The desperate man is standing on a ledge outside the top floor. Carl bursts into an apartment. Carl goes into the cluttered living room and looks around. He leans out of an arched window and looks at the guy on the ledge. He's a casually dressed, portly guy with thick, black hair. He looks into the room and sees a guitar. Carl points at the guy and goes inside. On the street, Soo-Mi and Lucy are standing in the crowd, looking up anxiously. Carl tunes the guitar. Carl leans out of the window, guitar in hand. As the crowd sings along, a fire crew arrives. The guy edges towards the open window. Carl grabs him by his jacket and throws him inside. He lands on his back. In shock, the guy holds up his hands. Carl gets out of an airport shuttle bus. As he walks towards the terminal building, Stephanie grabs his arm. She's with Ted. Carl goes. Stephanie glances back as she walks off.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She begins to ascend over. They stroll backstage at a melody venue. It's full of apparatus. They round a corner and walk out on stage and gaze at the immense Hollywood Bowl amphitheater. Hand-in-hand, Carl and Allison meander beneath the domed archway that covers the stage. They grin in wonder. Carl turns to Allison, who stares out at the seats, lost in contemplation. He watches at her. She turns to him and they grin. They gaze out again. They turn towards each other. Allison gazes up at him. Allison leans forward and plants a kiss on his lips. She draws back and grins impishly. Carl leans down and kisses her passionately but tenderly. He places his arms around her and presses her to him. She places an arm on his shoulder and squeezes affectionately. They stay locked in an embrace and sink to the floor. They sit in the unoccupied amphitheater. He eyes her gravely. A fat security guard with a torch pursues them. Carl distributes oranges. People queue outside his office entrance. Lee's grin fades. Norman's po-faced. A motorcycle. He approves the loan. Carl and Norman enter an office. A mustachioed man stands. They shake hands. Wesley, Carl, and Norman sit down at the table in the large office. Carl grins. Norman gawks. Frowning, Carl watches. Norman nods. Carl and Lucy examine bridal shower invitations. She slowly turns and gazes at him sadly. Carl nods sympathetically. Soo-Mi grins. Carl holds up a clenched fist. A guy runs in. Carl joins the crowd. Standing on the street, Carl stares into the expanse with a steely resolve. He bursts into the tall, red brick apartment building and dashes up a central staircase. The desperate man is standing on a ledge outside the uppermost floor. Carl bursts into a flat. Carl enters the cluttered living room and glances around. He leans out of an arched window and looks at the guy on the ledge. He's a casually dressed, portly guy with thick, black hair. He gazes into the room and perceives a guitar. Carl indicates at the guy and goes inside. On the avenue, Soo-Mi and Lucy are standing in the crowd, looking up anxiously. Carl tunes the guitar. Carl leans out of the window, guitar in hand. As the crowd sings along, a fire crew arrives. The guy edges towards the open window. Carl seizes him by his jacket and throws him inside. He lands on his back. In shock, the guy holds up his hands. Carl alights from an airport shuttle bus. As he walks towards the terminal building, Stephanie grabs his arm. She's with Ted. Carl goes. Stephanie glances back as she walks off."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "She begins to climb over. Backstage at a music venue is walked by them. It is filled with equipment. A corner is rounded by them, and the stage is walked out on. The vast Hollywood Bowl amphitheater is looked at by them. Hand-in-hand, beneath the domed archway that covers the stage, Carl and Allison are wandered. Awe is smiled at by them. Allison, who is stared at by Carl, turns to him, and the seats are looked out at by her, lost in thought. Her gaze is received by him. To him, she turns and smiles are exchanged. Again, the scene is looked out at by them. Each other is turned towards by them. Carl is looked up at by Allison. A kiss is planted on his lips by Allison as she leans forward. Back she is drawn and impish smiles are given by her. Down Carl leans and passionately but tenderly a kiss is given by him. Her arms are put around by him, and she is pressed to him. An arm is put on his shoulder, and an affectionate squeeze is given by her. Locked in an embrace, they remain, and to the floor they sink. In the deserted amphitheater, they sit. Her gaze is eyed gravely by him. By a fat security guard with a torch, they are chased. Oranges are handed out by Carl. Outside his office door, people queue. Lee’s smile fades. Po-faced is Norman. A motorbike is seen. The loan is approved by him. Into an office go Carl and Norman. A mustachioed man stands. Hands are shaken by them. At the table in the big office, Wesley, Carl, and Norman are seated. Carl smiles. Gawking is done by Norman. Staring is done by Carl, frowning. Nodding is done by Norman. Bridal shower invitations are looked at by Carl and Lucy. She turns slowly and him she looks at sadly. Sympathy is nodded by Carl. Soo-Mi grins. A clenched fist is held up by Carl. A guy runs in. The crowd is joined by Carl. Into the distance, Carl stares with steely resolve while standing on the street. Into the tall, red brick apartment building he bursts and up the central staircase he runs. A ledge outside the top floor is stood on by the desperate man. Into an apartment bursts Carl. Into the cluttered living room goes Carl, and around is looked by him. Out of an arched window he leans and at the guy on the ledge he looks. Casually dressed, a portly guy with thick, black hair is he. Into the room he looks and a guitar is seen by him. At the guy Carl points and inside he goes. On the street, the crowd is stood in by Soo-Mi and Lucy, looking up anxiously. The guitar is tuned by Carl. Out of the window Carl leans, guitar in hand. Along with the crowd, a fire crew arrives. Towards the open window, the guy edges. By his jacket, Carl grabs him and inside he is thrown. On his back, he lands. In shock, his hands are held up by the guy. Out of an airport shuttle bus gets Carl. His arm is grabbed by Stephanie as the terminal building is walked toward by him. With Ted is she. Carl goes. Back Stephanie glances as off she walks."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She climbs over. They walk backstage at a music venue full of equipment. Rounding a corner, they step onto the Hollywood Bowl stage. Hand-in-hand, Carl and Allison wander beneath the domed arch. They smile in awe. Carl watches Allison, who stares at the seats, thoughtful. She turns and they smile. They look out again, then turn to each other. Allison looks up and kisses Carl. She pulls back with a playful smile. Carl kisses her tenderly and embraces her. She squeezes his shoulder. They remain embraced and sink to the floor, sitting in the empty amphitheater. He gazes at her solemnly. A heavy security guard chases them with a torch. Carl hands out oranges. People queue at his office. Lee stops smiling. Norman looks serious. A motorbike passes. He approves the loan. Carl and Norman enter an office, shake hands with a mustached man. Wesley joins them. Carl smiles. Norman gawks. Carl frowns. Norman nods. Carl and Lucy view bridal shower invitations. She looks at him sadly. Carl nods. Soo-Mi grins. Carl raises a clenched fist. A man runs in. Carl joins the crowd. On the street, Carl stares ahead, resolute. He bursts into a red brick apartment, runs up stairs. A man stands on a ledge. Carl rushes into an apartment, scans the cluttered living room, leans out to see the portly, dark-haired man. Spotting a guitar, Carl points and enters. Outside, Soo-Mi and Lucy watch anxiously. Carl tunes the guitar, leans out with it. As the crowd sings, fire crews arrive. The man inches to the window. Carl pulls him in by his jacket. He lands on his back, stunned. Carl exits an airport shuttle. As he walks, Stephanie grabs his arm. She's with Ted. Carl walks off. Stephanie glances back."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "She climbs over. They walk backstage at a music venue full of equipment. They walk on stage, looking at the Hollywood Bowl amphitheater. Carl and Allison wander beneath the domed archway, smiling in awe. Carl gazes at Allison, lost in thought. They smile at each other. Allison kisses Carl. He kisses her tenderly, embracing her. They sit in the deserted amphitheater. A security guard chases them. Carl hands out oranges. People queue outside his office. Lee's smile fades. Norman's po-faced. A motorbike. He approves the loan. Carl and Norman enter an office. A mustachioed man stands, shaking hands. Wesley, Carl, and Norman sit at a table. Carl smiles. Norman gawks. Carl stares. Norman nods. Carl and Lucy look at bridal shower invitations. She looks at him sadly. Carl nods sympathetically. Soo-Mi grins. Carl holds a clenched fist. A guy runs in. Carl joins the crowd. On the street, Carl stares with resolve. He bursts into an apartment building, running up the stairs. A man is on a ledge. Carl enters an apartment, looking around. He leans out of a window at the guy on the ledge. Carl points at him and goes inside. Soo-Mi and Lucy look up anxiously. Carl tunes the guitar. He leans out with the guitar. The crowd sings along. A fire crew arrives. The guy edges towards the window. Carl grabs him, throwing him inside. The guy is in shock. Carl exits an airport shuttle. Stephanie grabs his arm, with Ted. Carl goes. Stephanie glances back. "
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "She begins her ascent, carefully climbing over the barrier. Together, they make their way backstage at a bustling music venue, which is brimming with various pieces of equipment. As they navigate through the maze of gear, they round a corner and emerge onto the stage, where they are greeted by the breathtaking sight of the vast Hollywood Bowl amphitheater. Hand-in-hand, Carl and Allison meander beneath the grand domed archway that majestically covers the stage. They exchange smiles, filled with awe and wonder. Carl turns his attention to Allison, who is gazing out at the sea of seats, seemingly lost in her own thoughts. He watches her intently. She eventually turns to face him, and they share a warm smile. Together, they look out once more at the expansive view before them. Then, they turn towards each other, and Allison lifts her gaze to meet his. Leaning forward, she gently plants a kiss on his lips. She pulls back slightly, her smile playful and impish. Carl responds by leaning down to kiss her again, this time with a passion that is tender yet intense. He wraps his arms around her, drawing her closer to him. She places an arm on his shoulder, giving it an affectionate squeeze. They remain locked in a loving embrace, slowly sinking to the floor. Seated in the deserted amphitheater, he looks at her with a serious expression. Suddenly, a rotund security guard, wielding a flashlight, begins to chase them away. Carl, ever resourceful, hands out oranges. Meanwhile, people are queuing outside his office door. Lee's smile gradually fades, while Norman maintains a serious demeanor. A motorbike is involved. Carl approves the loan. Together, Carl and Norman enter an office. A man with a mustache stands up to greet them. They exchange a firm handshake. Wesley, Carl, and Norman take their seats at the large table in the spacious office. Carl smiles warmly, while Norman gawks in amazement. With a frown, Carl stares intently. Norman nods in agreement. Carl and Lucy examine bridal shower invitations. She turns slowly, looking at him with a hint of sadness. Carl nods in understanding and sympathy. Soo-Mi grins broadly. Carl raises a clenched fist in determination. A guy rushes in. Carl joins the crowd. Standing on the street, Carl gazes into the distance with a look of steely resolve. He bursts into the tall, red brick apartment building and races up the central staircase. A desperate man is precariously standing on a ledge outside the top floor. Carl bursts into an apartment. He moves into the cluttered living room, taking in his surroundings. Leaning out of an arched window, he looks at the man on the ledge. The man is casually dressed, with a portly build and thick, black hair. He glances into the room and spots a guitar. Carl points at the man and heads back inside. On the street below, Soo-Mi and Lucy stand among the crowd, looking up with anxious expressions. Carl tunes the guitar with care. Leaning out of the window, guitar in hand, he begins to play. As the crowd sings along, a fire crew arrives on the scene. The man on the ledge inches closer to the open window. Carl seizes the opportunity, grabbing him by his jacket and pulling him inside. The man lands on his back, shocked, and raises his hands in disbelief. Later, Carl steps out of an airport shuttle bus. As he makes his way towards the terminal building, Stephanie suddenly grabs his arm. She is accompanied by Ted. Carl continues on his way. As Stephanie walks off, she glances back at him."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "She initiates her ascent with deliberate caution, carefully maneuvering her way over the protective barrier. In unison, they proceed to make their journey towards the backstage area of a bustling music venue, which is absolutely teeming with all sorts of different pieces of equipment and gear. As they skillfully navigate through this intricate maze of musical apparatus, they eventually round a corner and step out onto the stage. It is there that they are greeted by the awe-inspiring and breathtaking sight of the vast Hollywood Bowl amphitheater spreading out before them. Hand-in-hand, Carl and Allison leisurely wander beneath the grand and imposing domed archway that majestically covers the stage. They exchange knowing smiles, both filled with a deep sense of awe and wonder. Carl turns his gaze towards Allison, who is dreamily staring out at the sea of empty seats, seemingly lost in her own private thoughts. He watches her intently with interest. Eventually, she turns to face him, and they share a warm and heartfelt smile. Together, they gaze out once more at the expansive view that lies before them. Then, they turn towards each other, and Allison lifts her gaze to meet his, her eyes filled with affection. Leaning forward, she gently plants a soft kiss on his lips. She pulls back ever so slightly, her smile playful and impish. Carl responds by leaning down to kiss her again, this time with a passion that is both tender and intense. He wraps his arms around her, drawing her even closer to him. She places an affectionate arm on his shoulder, giving it a gentle, loving squeeze. They remain locked in a tender embrace, slowly sinking to the floor, seated comfortably in the deserted amphitheater. He looks at her with a serious and contemplative expression. Suddenly, a rotund and imposing security guard, armed with a flashlight, begins to chase them away from the area. Carl, ever resourceful and quick-thinking, hands out oranges. Meanwhile, people are lining up outside his office door. Lee's smile gradually fades into a more neutral expression, while Norman maintains a serious and focused demeanor. A motorbike is somehow involved in the unfolding events. Carl eventually approves the loan. Together, Carl and Norman enter an office space. A man with a distinguished mustache stands up to greet them warmly. They exchange a firm and respectful handshake. Wesley, Carl, and Norman take their respective seats at the large table situated in the spacious office. Carl displays a warm, genuine smile, while Norman gawks in amazement at the surroundings. With a thoughtful frown, Carl stares intently, and Norman nods in agreement. Carl and Lucy examine bridal shower invitations with careful consideration. She turns slowly, looking at him with a hint of sadness in her eyes. Carl nods in understanding and sympathy. Soo-Mi grins broadly, filled with enthusiasm. Carl raises a clenched fist in determination and resolve. A guy rushes in with urgency. Carl joins the crowd that has gathered. Standing resolutely on the street, Carl gazes into the distance with a look of steely resolve and determination. He bursts into the tall, red brick apartment building and races up the central staircase with purpose. A desperate man is precariously standing on a ledge outside the top floor, teetering on the edge. Carl bursts into an apartment. He moves swiftly into the cluttered living room, taking in his surroundings with a keen eye. Leaning out of an arched window, he looks at the man standing on the ledge. The man is casually dressed, with a portly build and thick, dark black hair. He glances into the room and spots a guitar. Carl points at the man and heads back inside with a sense of urgency. On the street below, Soo-Mi and Lucy stand among the gathered crowd, looking up with anxious and worried expressions. Carl tunes the guitar with great care and precision. Leaning out of the window, guitar in hand, he begins to play a tune. As the crowd sings along, a fire crew arrives on the scene, ready to assist. The man on the ledge inches hesitantly closer to the open window. Carl seizes the timely opportunity, grabbing him by his jacket and pulling him safely inside. The man lands on his back, completely shocked, and raises his hands in disbelief. Later on, Carl steps out of an airport shuttle bus. As he makes his way towards the terminal building, Stephanie suddenly grabs his arm with urgency. She is accompanied by Ted. Carl continues on his way without pause. As Stephanie walks off, she glances back at him, her eyes lingering for a moment longer."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She begins her ascent, carefully maneuvering over the barrier. They proceed to walk backstage at a music venue, navigating through a labyrinth of equipment that fills the area. As they round a corner, they emerge onto the stage and are greeted by the expansive view of the Hollywood Bowl amphitheater. Hand-in-hand, Carl and Allison meander beneath the domed archway that majestically covers the stage, their faces lighting up with smiles of awe. Carl turns his attention to Allison, who is gazing out at the sea of seats, seemingly lost in her thoughts. He takes a moment to admire her before she turns to meet his gaze, and they exchange warm smiles. Together, they look out once more at the vastness before them. They then turn towards each other, and Allison lifts her eyes to meet his. She leans forward, gently pressing her lips to his in a tender kiss. As she draws back, she offers him an impish smile. Carl responds by leaning down to kiss her again, this time with a passion that is tempered by tenderness. He wraps his arms around her, pulling her closer to him, while she places an arm on his shoulder, giving it an affectionate squeeze. They remain locked in their embrace, slowly sinking to the floor of the deserted amphitheater. Seated together, he looks at her with a grave expression. Suddenly, a rotund security guard, wielding a torch, begins to chase them away. In another scene, Carl distributes oranges to people who are queuing outside his office door. Lee's smile fades as Norman maintains a po-faced expression. A motorbike is involved as Carl approves a loan. Carl and Norman enter an office where a mustachioed man stands to greet them, and they shake hands. Wesley, Carl, and Norman then sit down at a table in the spacious office. Carl smiles, while Norman gawks, and Carl frowns as he stares at Norman, who nods in response. Carl and Lucy examine bridal shower invitations, and she slowly turns to look at him with a sad expression. Carl nods in understanding, offering her a sympathetic look. Soo-Mi grins as Carl raises a clenched fist in solidarity. A guy rushes in, and Carl joins the crowd. Standing on the street, Carl gazes into the distance with a steely resolve before bursting into a tall, red brick apartment building. He races up the central staircase, driven by urgency. On the top floor, a desperate man stands precariously on a ledge. Carl bursts into an apartment, making his way into the cluttered living room, where he quickly surveys his surroundings. He leans out of an arched window, focusing on the man on the ledge, who is a casually dressed, portly individual with thick, black hair. Spotting a guitar in the room, Carl points at the man and heads back inside. Outside, on the street, Soo-Mi and Lucy stand among the crowd, looking up with anxious expressions. Carl tunes the guitar and leans out of the window, instrument in hand. As the crowd below sings along, a fire crew arrives on the scene. The man on the ledge inches towards the open window, and Carl seizes the opportunity to grab him by his jacket, pulling him inside to safety. The man lands on his back, and in shock, he raises his hands. Later, Carl steps off an airport shuttle bus and walks towards the terminal building, where Stephanie suddenly grabs his arm. She is accompanied by Ted. Carl continues on his way, while Stephanie glances back at him as she walks off."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "She climbs over and they walk backstage at a music venue filled with equipment. Emerging on stage, Carl and Allison take in the vast Hollywood Bowl amphitheater. Hand-in-hand, they wander beneath the domed archway, smiling in awe. Carl turns to Allison, who is lost in thought, and they share a smile before she kisses him. He responds with a tender embrace, and they sink to the floor, sitting together in the deserted amphitheater. A security guard chases them away. Later, Carl distributes oranges to people queuing outside his office. Inside, Carl and Norman meet with a mustachioed man, shaking hands and sitting at a table with Wesley. Carl smiles while Norman gawks, and they discuss business. Carl and Lucy review bridal shower invitations, sharing a sympathetic moment. Soo-Mi grins as Carl raises a clenched fist. A guy runs in, and Carl joins the crowd. Standing on the street, Carl stares resolutely before bursting into a red brick apartment building. He races up the stairs to find a desperate man on a ledge. Carl enters the apartment, spots a guitar, and tunes it. Leaning out the window, he plays as the crowd sings along, and a fire crew arrives. The man edges towards the window, and Carl pulls him inside. Later, Carl exits an airport shuttle bus, and Stephanie grabs his arm as he heads towards the terminal. She walks off with Ted, glancing back at Carl."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She starts to climb over the metal fence that separates the backstage area. They walk backstage at a music venue known for hosting legendary performances. It's full of equipment, including amplifiers and instruments stacked neatly. They round a corner and walk out on stage, faced with the vast Hollywood Bowl amphitheater, an iconic venue in Los Angeles famous for its distinctive band shell. Hand-in-hand, Carl and Allison wander beneath the domed archway that covers the stage, a structure designed to enhance acoustics. They smile in awe, captivated by the grandeur. Carl turns to Allison, who stares out at the thousands of empty seats, lost in thought about the artists who have graced this stage. He gazes at her, appreciating the moment. She turns to him and they smile, sharing the same sense of wonder. They look out again at the expansive audience area. They turn towards each other. Allison looks up at him, her eyes reflecting the lights of the stage. Allison leans forward and plants a kiss on his lips, savoring the moment. She draws back and smiles impishly, her mood light and playful. Carl leans down and kisses her passionately but tenderly, enveloping her in warmth. He puts his arms around her and presses her to him, feeling her heartbeat. She puts an arm on his shoulder and squeezes affectionately, grounding the moment. They stay locked in an embrace and sink to the floor, the stage now their personal haven. They sit in the deserted amphitheater, enjoying the serene silence. He eyes her gravely, sensing a shift in the air. A fat security guard with a torch, typical of venue security, chases them, breaking their solitude. Carl hands out oranges, a spontaneous gesture to the gathered crowd. People queue outside his office door, eager for his attention. Lee's smile fades, sensing tension. Norman's po-faced, revealing little emotion. A motorbike roars past them, adding to the city's hustle. He approves the loan, a decision made after careful consideration. Carl and Norman go into an office, ready to discuss business. A mustachioed man stands behind the desk, waiting to greet them. They shake hands, sealing their agreement. Wesley, Carl, and Norman sit down at the table in the big office, prepared for negotiations. Carl smiles, buoyed by confidence. Norman gawks, taken aback by the opulent surroundings. Frowning, Carl stares, noticing something amiss. Norman nods, agreeing silently. Carl and Lucy look at bridal shower invitations, planning for an upcoming celebration. She slowly turns and looks at him sadly, feeling a pang of nostalgia. Carl nods sympathetically, understanding the mix of emotions. Soo-Mi grins, infectious enthusiasm brightening the room. Carl holds up a clenched fist, a sign of determination. A guy runs in, breathless from his haste. Carl joins the crowd, feeling their collective energy. Standing on the street, Carl stares into the distance with a steely resolve, driven by a newfound purpose. He bursts into the tall, red brick apartment building, its historical architecture a familiar sight, and runs up a central staircase, his footsteps echoing. The desperate man is standing on a ledge outside the top floor, a dangerous perch with a precarious drop. Carl bursts into an apartment, urgently seeking a resolution. Carl goes into the cluttered living room and looks around, taking in the chaos. He leans out of an arched window designed for ventilation and looks at the guy on the ledge, assessing the situation. He's a casually dressed, portly guy with thick, black hair, appearing both scared and defiant. He looks into the room and sees a guitar, a symbol of forgotten dreams. Carl points at the guy and goes inside, formulating a plan. On the street, Soo-Mi and Lucy are standing in the crowd, looking up anxiously, their hearts in their throats. Carl tunes the guitar, feeling its familiar weight. Carl leans out of the window, guitar in hand, ready to serenade the troubled soul. As the crowd sings along, a fire crew arrives with sirens blaring, adding urgency. The guy edges towards the open window, drawn by the music's solace. Carl grabs him by his jacket and throws him inside, pulling him to safety. He lands on his back, gasping at his sudden rescue. In shock, the guy holds up his hands, overwhelmed by relief. Carl gets out of an airport shuttle bus, his mind racing with thoughts. As he walks towards the terminal building, Stephanie grabs his arm, stopping him abruptly. She's with Ted, her longtime friend, who looks on curiously. Carl goes, determined to act on his decisions. Stephanie glances back as she walks off, her expression a mix of hope and uncertainty."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "She starts to climb over. They walk backstage at a music venue. It is full of equipment. They round a corner and walk out on stage and look at the vast Hollywood Bowl amphitheater. Handinhand. Carl and Allison wander beneath the domed archway that covers the stage. They smile in awe. Carl turns to Allison who stares out at the seats lost in thought. He gazes at her. She turns to him and they smile. They look out again. They turn towards each other. Allison looks up at him. Allison leans forward and plants a kiss on his lips. She draws back and smiles impishly. Carl leans down and kisses her passionately but tenderly. He puts his arms around her and presses her to him. She puts an arm on his shoulder and squeezes affectionately. They stay locked in an embrace and sink to the floor. They sit in the deserted amphitheater. He eyes her gravely. A fat security guard with a torch chases them. Carl hands out oranges. People queue outside his office door. Lee's smile fades Norman's pofaced. A motorbike. He approves the loan. Carl and Norman go into an office. A mustachioed man stands. They shake hands. Wesley. Carl and Norman sit down at the table in the big office. Carl smiles. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Norman gawks. Frowning. Carl stares. Norman nods. Carl and Lucy look at bridal shower invitations. She slowly turns and looks at him sadly. Carl nods sympathetically. SooMi grins. Carl holds up a clenched fist. A guy runs in. Carl joins the crowd. Standing on the street Carl stares into the distance with a steely resolve. He bursts into the tall red brick apartment building and runs up a central staircase. The desperate man is standing on a ledge outside the top floor. Carl bursts into an apartment. Carl goes into the cluttered living room and looks around. He leans out of an arched window and looks at the guy on the ledge. He is a casually dressed portly guy with thick black hair. He looks into the room and sees a guitar. Carl points at the guy and goes inside. On the street. SooMi and Lucy are standing in the crowd looking up anxiously. Carl tunes the guitar. Carl leans out of the window guitar in hand. As the crowd sings along a fire crew arrives. The guy edges towards the open window. Carl grabs him by his jacket and throws him inside. He lands on his back. In shock the guy holds up his hands. Carl gets out of an airport shuttle bus. As he walks towards the terminal building Stephanie grabs his arm. She is with Ted. Carl goes. Stephanie glances back as she walks off."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "She starts to climb over. They walk backstage at a music venue. It is full of equipment. They round a corner and walk out on stage and look at the vast Hollywood Bowl amphitheater. Handinhand. Carl and Allison wander beneath the domed archway that covers the stage. They smile in awe. Carl turns to Allison who stares out at the seats lost in thought. He gazes at her. She turns to him and they smile. They look out again. They turn towards each other. Allison looks up at him. Allison leans forward and plants a kiss on his lips. She draws back and smiles impishly. Carl leans down and kisses her passionately but tenderly. He puts his arms around her and presses her to him. She puts an arm on his shoulder and squeezes affectionately. They stay locked in an embrace and sink to the floor. They sit in the deserted amphitheater. He eyes her gravely. A fat security guard with a torch chases them. Carl hands out oranges. People queue outside his office door. Lee's smile fades Norman's pofaced. A motorbike. He approves the loan. Carl and Norman go into an office. A mustachioed man stands. They shake hands. Wesley. Carl and Norman sit down at the table in the big office. Carl smiles. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Norman gawks. Frowning. Carl stares. Norman nods. Carl and Lucy look at bridal shower invitations. She slowly turns and looks at him sadly. Carl nods sympathetically. SooMi grins. Carl holds up a clenched fist. A guy runs in. Carl joins the crowd. Standing on the street Carl stares into the distance with a steely resolve. He bursts into the tall red brick apartment building and runs up a central staircase. The desperate man is standing on a ledge outside the top floor. Carl bursts into an apartment. Carl goes into the cluttered living room and looks around. He leans out of an arched window and looks at the guy on the ledge. He is a casually dressed portly guy with thick black hair. He looks into the room and sees a guitar. Carl points at the guy and goes inside. On the street. SooMi and Lucy are standing in the crowd looking up anxiously. Carl tunes the guitar. Carl leans out of the window guitar in hand. As the crowd sings along a fire crew arrives. The guy edges towards the open window. Carl grabs him by his jacket and throws him inside. He lands on his back. In shock the guy holds up his hands. Carl gets out of an airport shuttle bus. As he walks towards the terminal building Stephanie grabs his arm. She is with Ted. Carl goes. Stephanie glances back as she walks off."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "She starts to climb over. They walk backstage at a music venue. It is full of equipment. They round a corner and walk out on stage and look at the vast Hollywood Bowl amphitheater. Handinhand. Carl and Allison wander beneath the domed archway that covers the stage. They smile in awe. Carl turns to Allison who stares out at the seats lost in thought. He gazes at her. She turns to him and they smile. They look out again. They turn towards each other. Allison looks up at him. Allison leans forward and plants a kiss on his lips. She draws back and smiles impishly. Carl leans down and kisses her passionately but tenderly. He puts his arms around her and presses her to him. He is a casually dressed portly guy with thick black hair. He looks into the room and sees a guitar. Carl points at the guy and goes inside. On the street. SooMi and Lucy are standing in the crowd looking up anxiously. Carl tunes the guitar. Carl leans out of the window guitar in hand. As the crowd sings along a fire crew arrives. The guy edges towards the open window. Carl grabs him by his jacket and throws him inside. He lands on his back. In shock the guy holds up his hands. Carl gets out of an airport shuttle bus. As he walks towards the terminal building Stephanie grabs his arm. She is with Ted. Carl goes. Stephanie glances back as she walks off."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "She starts to climb over. They walk backstage at a music venue. It is full of equipment. They round a corner and walk out on stage and look at the vast Hollywood Bowl amphitheater. Handinhand. Carl and Allison wander beneath the domed archway that covers the stage. They smile in awe. He lands on his back. In shock the guy holds up his hands. Carl gets out of an airport shuttle bus. As he walks towards the terminal building Stephanie grabs his arm. She is with Ted. Carl goes. Stephanie glances back as she walks off."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "He begins to dig under. They fly behind a rock concert. It's filled with gadgets. They skip around a tree and leap onto the ice rink and gaze at the tiny community theater. Paw-in-paw, Lisa and David drift above the wooden ceiling that covers the ice rink. They laugh in surprise. David whispers to Lisa, who glances out at the clouds, lost in imagination. She whispers at him. He faces her and they laugh. They gaze out again. They pivot towards each other. Lisa peers down at him. Lisa bends backward and throws a hug on his neck. He stretches back and laughs sneakily. David kneels up and tickles her eagerly but softly. He lifts his head above her and tickles her beside him. She raises a leg under his waist and squeezes lovingly. They remain entangled in a handshake and rise to the ceiling. They stand in the vacant theater. She glances at him cheerfully. A thin janitor with a lantern follows them. David passes out cookies. Animals gather outside his kitchen window. Sam's grin vanishes. Bob's smiling. A skateboard. He denies the mortgage. David and Bob wander into a classroom. A bespectacled child sits. They jump hands. Marvin, David, and Bob stand up at the couch in the small kitchen. David laughs. Bob claps. Yawning, David frowns. Bob claps again. David and Katie paint at birthday party decorations. He quickly bends and spins at her happily. David frowns thoughtfully. Zhu-Chi sobs. David bends over a clasped foot. A kid sits down. David leaves the market. Sitting in the elevator, David frowns into the abyss with a gentle determination. He slides into the short, green brick office tower and jumps down a side ladder. The energetic dog is sleeping on a fence above the bottom basement. David crashes into a basement. David sneaks into the dirty attic and dances around. He jumps out of a wooden balcony and dances at the dog on the fence. He's a neatly dressed, slender dog with bright, white fur. He dances into the attic and spots a violin. David kicks at the dog and dances outside. In the elevator, Zhu-Chi and Katie are sitting in the mob, singing down cheerfully. David hides the violin. David jumps out of the balcony, violin in paw. As the mob screams along, a police team leaves. The dog flies towards the closed balcony. David shakes him by his collar and lifts him outside. He rises on his heels. In joy, the dog dances down his feet. David climbs into an ocean liner. As he flies away from the terminal tower, Melissa kicks his head. He's with Sam. David stays. Melissa dances forward as he skips on."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Carl and Allison explore the Hollywood Bowl amphitheater, sharing a tender moment as they embrace and kiss on stage. Later, the scene shifts to Carl handing out oranges, with people lining up outside his office. He and Norman meet with a mustachioed man, suggestive of a business transaction. Carl's attention turns to bridal shower invitations with Lucy, hinting at emotional conflict. With steely resolve, Carl races into a red brick apartment building to save a desperate man on a ledge. Inside, Carl spots a guitar, uses it to calm the man, and pulls him to safety as a crowd, including Soo-Mi and Lucy, anxiously watches. In the end, as Carl heads to the airport, Stephanie catches his arm, introducing a moment of tension before he departs, leaving Stephanie to glance back."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Stephanie glances back as she walks off Carl goes  She's with Ted  As he walks towards the terminal building Stephanie grabs his arm  Carl gets out of an airport shuttle bus  In shock the guy holds up his hands  He lands on his back  Carl grabs him by his jacket and throws him inside  The guy edges towards the open window  As the crowd sings along a fire crew arrives  Carl leans out of the window guitar in hand  Carl tunes the guitar  On the street SooMi and Lucy are standing in the crowd looking up anxiously  Carl points at the guy and goes inside  He looks into the room and sees a guitar  He's a casually dressed portly guy with thick black hair  He leans out of an arched window and looks at the guy on the ledge  Carl goes into the cluttered living room and looks around  Carl bursts into an apartment  The desperate man is standing on a ledge outside the top floor  He bursts into the tall red brick apartment building and runs up a central staircase  Standing on the street Carl stares into the distance with a steely resolve  Carl joins the crowd  A guy runs in  Carl holds up a clenched fist  SooMi grins  Carl nods sympathetically  She slowly turns and looks at him sadly  Carl and Lucy look at bridal shower invitations  Norman nods  Carl stares  Frowning  Norman gawks  Carl smiles  Carl and Norman sit down at the table in the big office  Wesley  They shake hands  A mustachioed man stands  Carl and Norman go into an office  He approves the loan  A motorbike  Lee's smile fades Norman's pofaced  People queue outside his office door  Carl hands out oranges  A fat security guard with a torch chases them  He eyes her gravely  They sit in the deserted amphitheater  They stay locked in an embrace and sink to the floor  She puts an arm on his shoulder and squeezes affectionately  He puts his arms around her and presses her to him  Carl leans down and kisses her passionately but tenderly  She draws back and smiles impishly  Allison leans forward and plants a kiss on his lips  Allison looks up at him  They turn towards each other  They look out again  She turns to him and they smile  He gazes at her  Carl turns to Allison who stares out at the seats lost in thought  They smile in awe  Carl and Allison wander beneath the domed archway that covers the stage  Handinhand  They round a corner and walk out on stage and look at the vast Hollywood Bowl amphitheater  It's full of equipment  They walk backstage at a music venue  She starts to climb over "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "They walk backstage at a music venue She starts to climb over They round a corner and walk out on stage and look at the vast Hollywood Bowl amphitheater It is full of equipment Carl and Allison wander beneath the domed archway that covers the stage Handinhand Carl turns to Allison who stares out at the seats lost in thought They smile in awe She turns to him and they smile He gazes at her They turn towards each other They look out again Allison leans forward and plants a kiss on his lips Allison looks up at him Carl leans down and kisses her passionately but tenderly She draws back and smiles impishly She puts an arm on his shoulder and squeezes affectionately He puts his arms around her and presses her to him They sit in the deserted amphitheater They stay locked in an embrace and sink to the floor A fat security guard with a torch chases them He eyes her gravely People queue outside his office door Carl hands out oranges A motorbike Lee's smile fades Norman's pofaced Carl and Norman go into an office He approves the loan They shake hands A mustachioed man stands Carl and Norman sit down at the table in the big office Wesley Norman gawks Carl smiles Carl stares Frowning Carl and Lucy look at bridal shower invitations Norman nods Carl nods sympathetically She slowly turns and looks at him sadly Carl holds up a clenched fist SooMi grins Carl joins the crowd A guy runs in He bursts into the tall red brick apartment building and runs up a central staircase Standing on the street Carl stares into the distance with a steely resolve Carl bursts into an apartment The desperate man is standing on a ledge outside the top floor He leans out of an arched window and looks at the guy on the ledge Carl goes into the cluttered living room and looks around He looks into the room and sees a guitar He is a casually dressed portly guy with thick black hair On the street Carl points at the guy and goes inside Carl tunes the guitar SooMi and Lucy are standing in the crowd looking up anxiously As the crowd sings along a fire crew arrives Carl leans out of the window guitar in hand Carl grabs him by his jacket and throws him inside The guy edges towards the open window In shock the guy holds up his hands He lands on his back As he walks towards the terminal building Stephanie grabs his arm Carl gets out of an airport shuttle bus Carl goes She is with Ted Stephanie glances back as she walks off"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Norman gawks  Frowning  Carl stares  Norman nods  Carl and Lucy look at bridal shower invitations  She slowly turns and looks at him sadly  Carl nods sympathetically  SooMi grins  Carl holds up a clenched fist  A guy runs in  Carl joins the crowd  Standing on the street Carl stares into the distance with a steely resolve  He bursts into the tall red brick apartment building and runs up a central staircase  The desperate man is standing on a ledge outside the top floor  Carl bursts into an apartment  Carl goes into the cluttered living room and looks around  He leans out of an arched window and looks at the guy on the ledge  He's a casually dressed portly guy with thick black hair  He looks into the room and sees a guitar  Carl points at the guy and goes inside  On the street SooMi and Lucy are standing in the crowd looking up anxiously  Carl tunes the guitar  Carl leans out of the window guitar in hand  As the crowd sings along a fire crew arrives  The guy edges towards the open window  Carl grabs him by his jacket and throws him inside  He lands on his back  In shock the guy holds up his hands  Carl gets out of an airport shuttle bus  As he walks towards the terminal building Stephanie grabs his arm  She's with Ted  Carl goes  Stephanie glances back as she walks off She starts to climb over  They walk backstage at a music venue  It's full of equipment  They round a corner and walk out on stage and look at the vast Hollywood Bowl amphitheater  Handinhand  Carl and Allison wander beneath the domed archway that covers the stage  They smile in awe  Carl turns to Allison who stares out at the seats lost in thought  He gazes at her  She turns to him and they smile  They look out again  They turn towards each other  Allison looks up at him  Allison leans forward and plants a kiss on his lips  She draws back and smiles impishly  Carl leans down and kisses her passionately but tenderly  He puts his arms around her and presses her to him  She puts an arm on his shoulder and squeezes affectionately  They stay locked in an embrace and sink to the floor  They sit in the deserted amphitheater  He eyes her gravely  A fat security guard with a torch chases them  Carl hands out oranges  People queue outside his office door  Lee's smile fades Norman's pofaced  A motorbike  He approves the loan  Carl and Norman go into an office  A mustachioed man stands  They shake hands  Wesley  Carl and Norman sit down at the table in the big office  Carl smiles "
        }
      ]
    }
  ]
}