{
  "ground_truth": "Carl walks up to Allison, who's wearing a dark blue coat with red piping, and picks her up around her waist with one arm, carrying her to a check-in desk where a woman looks at a computer screen. Carl frowns, perplexed, as they proceed to walk through the small Lincoln, Nebraska airport. At the Telephone Pioneer Museum, they see a mock-up of an early telephone switchboard and a mannequin holding a modern mobile phone while Carl holds up the massive vintage phone. At a shooting range, Allison shoots the ground, an instructor raises the gun barrel, and she hits the clay, making everyone duck as she swings round with the gun. A uniformed band plays at the packed Nebraska Cornhuskers Memorial Stadium where a mascot jumps up and down, and the football team, Big Red, runs onto the field in red-and-white stripes. In Carl's apartment, Peter, Lucy, Rooney, and Lee watch the game on TV as Carl, wearing giant yellow corncobs on his head and arms, jumps up and down in the crowd while Allison wears a massive red Stetson. At a slaughterhouse, Carl faints. In the country, Carl and Allison walk along a track beneath a brooding, gray sky, and he takes off his jacket to wrap it around Allison's head, marches her to a barn, removes the jacket, and she shakes her head, smiling contentedly as they wrap their arms around each other, and Carl, looking thoughtful, rests his chin on her hair. At the airport check-in desk, Carl and Allison stand facing a uniformed woman who checks a computer screen and smiles at them while two serious-looking, suited men walk over and show ID. Carl points at Allison and starts to smile just before they are in an interrogation room where thick-set Tweed narrows his eyes. Allison looks at Carl, disappointed, as they sit handcuffed, and Peter, Tweed, and Multack leave the room. Carl smiles weakly and stares at her wretchedly until Multack walks in to unlock Allison's handcuffs. Allison gets up and, without looking at him, leaves the room as a jet touches down in LA. Allison marches through the busy terminal building with Carl and Peter walking some way behind her. Carl retreats while Allison gets in a yellow cab and Peter watches Carl run back through the terminal building. Later, Carl watches a film and calls Allison, but in a meeting, he sits staring at the table. Meanwhile, on the terrace outside her apartment, Allison stands at an easel, painting. She checks her phone, sees it's Carl calling, and puts it back on the table. Carl takes a flying lesson but looks uninterested. Eventually, Carl stands on the edge of a bridge with a harness around his waist and ankles attached to a bungee rope.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Carl strolls up to Allison, who's donning a dark navy coat with crimson piping, and lifts her up around her waist with one limb, transporting her to a check-in counter where a lady gazes at a computer screen. Carl scowls, confused, as they continue to stroll through the small Lincoln, Nebraska airfield. At the Telephone Pioneer Museum, they observe a mock-up of an early telephone switchboard and a mannequin grasping a modern mobile phone while Carl holds up the colossal vintage phone. At a shooting range, Allison strikes the ground, an instructor elevates the gun barrel, and she hits the clay, making everyone crouch as she swings around with the gun. A uniformed band plays at the crowded Nebraska Cornhuskers Memorial Stadium where a mascot leaps up and down, and the football squad, Big Red, dashes onto the field in red-and-white stripes. In Carl's apartment, Peter, Lucy, Rooney, and Lee view the game on TV as Carl, sporting giant yellow corncobs on his head and limbs, leaps up and down in the crowd while Allison wears a massive red Stetson. At a slaughterhouse, Carl swoons. In the countryside, Carl and Allison stroll along a path beneath a brooding, gray sky, and he removes his jacket to wrap it around Allison's head, guides her to a barn, removes the jacket, and she shakes her head, smiling contentedly as they envelop their arms around each other, and Carl, appearing thoughtful, rests his chin on her hair. At the airport check-in desk, Carl and Allison stand facing a uniformed woman who checks a computer screen and beams at them while two serious-looking, suited gentlemen walk over and display ID. Carl gestures at Allison and begins to smile just before they are in an interrogation room where thick-set Tweed narrows his eyes. Allison glances at Carl, disappointed, as they sit handcuffed, and Peter, Tweed, and Multack exit the room. Carl smiles weakly and gazes at her wretchedly until Multack walks in to unlock Allison's handcuffs. Allison rises and, without glancing at him, exits the room as a jet lands in LA. Allison marches through the busy terminal edifice with Carl and Peter trailing some distance behind her. Carl withdraws while Allison enters a yellow taxi and Peter observes Carl dash back through the terminal edifice. Later, Carl views a film and calls Allison, but in a meeting, he sits staring at the table. Meanwhile, on the terrace outside her apartment, Allison stands at an easel, painting. She checks her phone, sees it's Carl calling, and places it back on the table. Carl takes a flying lesson but appears uninterested. Eventually, Carl stands on the verge of a bridge with a harness around his waist and ankles attached to a bungee cord."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Carl walks up to Allison, who's wearing a dark blue coat with red piping, and she is picked up around her waist with one arm by him, being carried to a check-in desk where a computer screen is looked at by a woman. A frown, perplexed, is worn by Carl as they are proceeded through the small Lincoln, Nebraska airport. At the Telephone Pioneer Museum, a mock-up of an early telephone switchboard is seen by them and a modern mobile phone is held by a mannequin while the massive vintage phone is held up by Carl. At a shooting range, the ground is shot by Allison, the gun barrel is raised by an instructor, and the clay is hit by her, making everyone duck as the gun is swung around by her. At the packed Nebraska Cornhuskers Memorial Stadium, a uniformed band is playing where a mascot jumps up and down, and the field is run onto by the Big Red football team in red-and-white stripes. In Carl's apartment, the game is watched on TV by Peter, Lucy, Rooney, and Lee as, in the crowd, Carl, wearing giant yellow corncobs on his head and arms, jumps up and down while a massive red Stetson is worn by Allison. Carl faints in a slaughterhouse. In the country, along a track beneath a brooding, gray sky, Carl and Allison walk, and his jacket is taken off to wrap around Allison's head, she is marched to a barn by him, the jacket is removed, and her head is shaken by her, smiling contentedly as each other's arms are wrapped around, and Carl, looking thoughtful, rests his chin on her hair. At the airport check-in desk, Carl and Allison stand facing a uniformed woman, a computer screen is checked by her, and they are smiled at while ID is shown by two serious-looking, suited men who walk over. Allison is pointed at by Carl and a smile begins just before they are in an interrogation room, where thick-set Tweed narrows his eyes. At Carl, Allison looks, disappointed, as handcuffed, they sit, and the room is left by Peter, Tweed, and Multack. A weak smile is given by Carl and wretchedly he stares at her until Allison's handcuffs are unlocked by Multack walking in. Allison gets up and, without looking at him, the room is left by her as a jet touches down in LA. The busy terminal building is marched through by Allison with Carl and Peter some way behind her. While Allison gets in a yellow cab, Carl retreats and Peter watches Carl run back through the terminal building. Later, a film is watched by Carl, who calls Allison, but in a meeting, the table is stared at by him. Meanwhile, on the terrace outside her apartment, an easel is stood at by Allison, painting. Her phone is checked, she sees Carl calling, and it is put back on the table. A flying lesson is taken by Carl but he looks uninterested. Eventually, the edge of a bridge is stood on by Carl with a harness around his waist and ankles attached to a bungee rope."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Carl approaches Allison, wearing a dark blue coat with red piping, and lifts her by the waist, carrying her to a check-in desk where a woman checks a computer. Carl frowns as they walk through the small Lincoln, Nebraska airport. At the Telephone Pioneer Museum, they see an early telephone switchboard and a mannequin with a modern phone while Carl holds a vintage phone. At a shooting range, Allison shoots the ground, an instructor adjusts her aim, and she hits the clay, making everyone duck as she swings the gun. A band plays at the packed Nebraska Cornhuskers Memorial Stadium where a mascot jumps, and the Big Red football team runs onto the field in red-and-white stripes. In Carl's apartment, Peter, Lucy, Rooney, and Lee watch the game on TV as Carl, wearing giant yellow corncobs, jumps in the crowd while Allison wears a large red Stetson. At a slaughterhouse, Carl faints. In the country, Carl and Allison walk under a gray sky, and he wraps his jacket around her head, leading her to a barn. She smiles contentedly as they embrace, and Carl rests his chin on her hair. At the airport check-in, Carl and Allison face a woman who smiles at them while two serious men show ID. Carl points at Allison and smiles before they are in an interrogation room with Tweed. Allison looks disappointed as they sit handcuffed, and Peter, Tweed, and Multack leave. Carl smiles weakly at her until Multack unlocks Allison's handcuffs. Allison leaves without looking at him as a jet lands in LA. She marches through the terminal with Carl and Peter behind. Carl retreats while Allison gets in a cab, and Peter watches Carl run back. Later, Carl watches a film and calls Allison, but in a meeting, he stares at the table. Meanwhile, Allison paints on her terrace, checks her phone, sees Carl calling, and puts it back. Carl takes a flying lesson but seems uninterested. Eventually, Carl stands on a bridge edge with a harness and bungee rope."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Carl approaches Allison, in a dark blue coat with red piping, and lifts her to a check-in desk where a woman checks a computer. Carl frowns as they walk through Lincoln, Nebraska airport. At the Telephone Pioneer Museum, they see an old switchboard and a mannequin with a mobile phone while Carl holds a vintage phone. At a shooting range, Allison hits the clay after an instructor adjusts her aim, causing everyone to duck. A band plays at the Nebraska Cornhuskers Memorial Stadium as the Big Red team runs onto the field. In Carl's apartment, friends watch the game on TV while Carl, wearing yellow corncobs, and Allison, in a red Stetson, cheer in the crowd. Carl faints at a slaughterhouse. In the country, Carl wraps his jacket around Allison's head, leading her to a barn where they embrace. At the airport, Carl and Allison face a woman at a computer when two men show ID. Carl points at Allison before they are in an interrogation room. Allison looks disappointed as they sit handcuffed, and Peter, Tweed, and Multack leave. Carl smiles weakly until Multack unlocks Allison's handcuffs. Allison leaves as a jet lands in LA. She marches through the terminal with Carl and Peter behind. Carl retreats as Allison takes a cab, and Peter watches Carl run back. Later, Carl calls Allison, but she ignores it while painting. Carl takes a flying lesson, uninterested, and eventually stands on a bridge with a bungee harness."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Carl approaches Allison, who is dressed in a stylish dark blue coat adorned with striking red piping. With a playful gesture, he lifts her effortlessly around her waist using just one arm and carries her over to a nearby check-in desk. There, a woman is intently focused on the glowing computer screen in front of her. As they continue their journey through the small, bustling Lincoln, Nebraska airport, Carl's expression shifts to one of confusion and perplexity. \n\nTheir next stop is the intriguing Telephone Pioneer Museum, where they are greeted by a fascinating display: a mock-up of an early telephone switchboard. Nearby, a mannequin is humorously posed holding a sleek, modern mobile phone, while Carl amusingly holds up a massive, vintage phone for comparison. \n\nAt a shooting range, the scene is tense as Allison fires a shot into the ground. An instructor quickly intervenes, raising the gun barrel, and she successfully hits the clay target, causing everyone to duck instinctively as she swings around with the gun in hand. \n\nThe atmosphere is electric at the packed Nebraska Cornhuskers Memorial Stadium, where a uniformed band plays energetically. A lively mascot jumps up and down with enthusiasm, and the football team, known as Big Red, charges onto the field, proudly wearing their iconic red-and-white striped uniforms. \n\nIn the comfort of Carl's apartment, Peter, Lucy, Rooney, and Lee are gathered around the television, eagerly watching the game. Meanwhile, in the stadium crowd, Carl is easily spotted, wearing oversized yellow corncobs on his head and arms, as he jumps up and down with excitement. Allison, by his side, sports a massive red Stetson hat. \n\nThe scene shifts to a slaughterhouse, where the overwhelming environment causes Carl to faint. Later, in the serene countryside, Carl and Allison walk leisurely along a track beneath a brooding, gray sky. In a chivalrous gesture, Carl removes his jacket and wraps it around Allison's head to protect her from the elements. He then guides her to a nearby barn, where he removes the jacket, and she shakes her head, smiling contentedly. They embrace warmly, and Carl, appearing deep in thought, rests his chin gently on her hair. \n\nBack at the airport check-in desk, Carl and Allison stand facing a uniformed woman who is diligently checking a computer screen. She smiles at them warmly, but the moment is interrupted as two serious-looking men in suits approach, showing their identification. Carl points at Allison and begins to smile, but the scene quickly shifts to an interrogation room where the thick-set Tweed narrows his eyes suspiciously. \n\nAllison looks at Carl with disappointment as they sit handcuffed together. Peter, Tweed, and Multack exit the room, leaving Carl to smile weakly and gaze at her with a wretched expression. Multack soon returns to unlock Allison's handcuffs, allowing her to stand up and leave the room without a backward glance, just as a jet touches down in Los Angeles. \n\nAllison strides purposefully through the busy terminal building, with Carl and Peter trailing some distance behind her. Carl hesitates and retreats as Allison gets into a waiting yellow cab, while Peter watches Carl run back through the terminal building. \n\nLater, Carl is seen watching a film and attempting to call Allison, but during a meeting, he sits staring blankly at the table. Meanwhile, on the terrace outside her apartment, Allison stands at an easel, painting with focus and creativity. She checks her phone, sees that Carl is calling, and decides to place it back on the table without answering. \n\nIn a new venture, Carl takes a flying lesson, but his lack of interest is evident. Eventually, he finds himself standing on the edge of a bridge, equipped with a harness around his waist and ankles, ready to take the plunge attached to a bungee rope."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Carl moves forward to approach Allison, who is elegantly attired in a fashionable dark blue coat that is tastefully highlighted with vivid red piping. With a playful and spontaneous gesture, he skillfully lifts her around her waist using just one arm, effortlessly carrying her over to a nearby check-in desk. Here, a woman is deeply immersed in her task, focusing intently on the glowing computer screen in front of her. As they continue their journey through the compact yet bustling airport of Lincoln, Nebraska, Carl's face reveals a shift as his expression transforms into one of puzzlement and bewilderment.\n\nTheir next destination is the captivating Telephone Pioneer Museum, where they are welcomed by an intriguing display: a meticulously constructed mock-up of an early telephone switchboard. In the vicinity, a mannequin is humorously posed as if holding a sleek, modern mobile phone, while Carl amusingly raises a massive, vintage phone to emphasize the contrast for comparison.\n\nAt a tense shooting range, the atmosphere becomes thrilling as Allison takes aim and fires a shot directly into the ground. An instructor reacts swiftly, intervening by raising the gun barrel, and she successfully hits the clay target, prompting everyone to instinctively duck as she swings around, still gripping the gun.\n\nThe energy is electrifying at the packed Nebraska Cornhuskers Memorial Stadium, where a band dressed in uniform plays with great enthusiasm. A lively mascot leaps up and down energetically, and the football team, affectionately known as Big Red, charges onto the field, proudly donning their distinctive red-and-white striped uniforms.\n\nWithin the cozy confines of Carl's apartment, Peter, Lucy, Rooney, and Lee are gathered around the television, their attention captivated as they eagerly watch the game unfold. Meanwhile, among the crowd in the stadium, Carl is easily noticeable, sporting oversized yellow corncobs on his head and arms as he bounces up and down with excitement. Beside him, Allison wears a massive red Stetson hat, adding to the festive atmosphere.\n\nThe scene transitions to a slaughterhouse, where the overwhelming environment takes its toll on Carl, causing him to faint. Later, in the tranquil countryside, Carl and Allison stroll leisurely along a track beneath a brooding, gray sky. In an act of chivalry, Carl removes his jacket and wraps it around Allison's head, shielding her from the elements. He then guides her to a nearby barn, where he carefully removes the jacket, and she shakes her head, smiling with contentment. They share a warm embrace, and Carl, appearing contemplative, gently rests his chin on her hair.\n\nReturning to the airport check-in desk, Carl and Allison find themselves standing opposite a uniformed woman who is diligently engaged in checking details on a computer screen. She offers them a warm smile, but the moment is abruptly interrupted when two serious-looking men in suits approach, displaying their identification. Carl gestures toward Allison and begins to smile, but the scene rapidly shifts to an interrogation room, where the thick-set Tweed narrows his eyes with suspicion.\n\nAllison, filled with disappointment, looks at Carl as they sit together, handcuffed. Peter, Tweed, and Multack exit the room, leaving Carl with a weak smile and a wretched expression as he gazes at her. Shortly after, Multack returns to unlock Allison's handcuffs, allowing her to stand up and leave the room without looking back, just as a jet lands in Los Angeles.\n\nAllison walks confidently through the busy terminal building, with Carl and Peter trailing some distance behind her. Carl hesitates and retreats while Allison gets into a waiting yellow cab, and Peter observes as Carl runs back through the terminal building.\n\nLater, Carl finds himself watching a film and attempting to call Allison. During a meeting, he sits staring blankly at the table, lost in thought. Meanwhile, on the terrace outside her apartment, Allison stands at an easel, painting with focus and creativity. She checks her phone, sees Carl's call, and decides to place it back on the table without answering.\n\nIn pursuit of a new venture, Carl takes a flying lesson, though his lack of interest becomes apparent. Eventually, he finds himself standing on the edge of a bridge, outfitted with a harness securely fastened around his waist and ankles, ready to take the daring plunge attached to a bungee rope."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Carl approaches Allison, who is dressed in a dark blue coat accented with red piping, and gently wraps one arm around her waist, lifting her off the ground. He carries her effortlessly to a check-in desk where a woman is intently focused on a computer screen. As they continue their journey through the small Lincoln, Nebraska airport, Carl's expression shifts to one of confusion and perplexity. Their exploration leads them to the Telephone Pioneer Museum, where they encounter a display featuring a mock-up of an early telephone switchboard and a mannequin holding a modern mobile phone. Carl, intrigued, lifts a massive vintage phone for comparison. At a shooting range, Allison takes aim but initially shoots the ground. An instructor steps in to adjust the gun barrel, guiding her to successfully hit the clay target, causing everyone to duck as she inadvertently swings the gun around. The scene shifts to the packed Nebraska Cornhuskers Memorial Stadium, where a uniformed band plays energetically, a mascot jumps up and down with enthusiasm, and the football team, Big Red, charges onto the field clad in red-and-white stripes. Meanwhile, in Carl's apartment, Peter, Lucy, Rooney, and Lee are engrossed in watching the game on TV. In the stadium, Carl, adorned with giant yellow corncobs on his head and arms, energetically jumps up and down in the crowd, while Allison sports a massive red Stetson. The narrative takes a dramatic turn at a slaughterhouse, where Carl faints. In the countryside, Carl and Allison walk along a track beneath a brooding, gray sky. Carl removes his jacket and wraps it around Allison's head to shield her from the elements, guiding her to a nearby barn. Once inside, he removes the jacket, and Allison shakes her head, smiling contentedly. They embrace, wrapping their arms around each other, and Carl, deep in thought, rests his chin gently on her hair. Back at the airport check-in desk, Carl and Allison stand before a uniformed woman who checks a computer screen and smiles at them. Suddenly, two serious-looking men in suits approach, presenting their IDs. Carl gestures towards Allison and begins to smile, but the scene abruptly shifts to an interrogation room where a thick-set man named Tweed narrows his eyes at them. Allison, looking disappointed, glances at Carl as they sit handcuffed. Peter, Tweed, and Multack exit the room, leaving Carl to smile weakly and gaze at Allison with a wretched expression until Multack returns to unlock her handcuffs. Allison stands up and, without acknowledging Carl, leaves the room as a jet lands in LA. She marches through the bustling terminal building, with Carl and Peter trailing some distance behind. Carl hesitates and retreats as Allison gets into a yellow cab, while Peter observes Carl running back through the terminal. Later, Carl watches a film and attempts to call Allison, but during a meeting, he finds himself staring blankly at the table. Meanwhile, on the terrace outside her apartment, Allison stands at an easel, painting. She checks her phone, sees Carl's call, and places it back on the table. Carl, seeking distraction, takes a flying lesson but appears disinterested. Eventually, he finds himself standing on the edge of a bridge, a harness secured around his waist and ankles, attached to a bungee rope, contemplating the leap."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Carl approaches Allison, who is wearing a dark blue coat with red piping, and playfully lifts her around the waist, carrying her to a check-in desk where a woman is focused on a computer screen. They navigate through the small Lincoln, Nebraska airport, with Carl looking perplexed. At the Telephone Pioneer Museum, they explore exhibits, including a mock-up of an early telephone switchboard and a mannequin with a modern mobile phone, while Carl humorously compares a massive vintage phone. At a shooting range, Allison initially struggles but eventually hits a clay target with guidance, causing a moment of chaos as she swings the gun around. They attend a packed Nebraska Cornhuskers Memorial Stadium, where a uniformed band plays, a mascot jumps, and the Big Red football team charges onto the field. Meanwhile, in Carl's apartment, Peter, Lucy, Rooney, and Lee watch the game on TV as Carl, adorned with giant yellow corncobs, and Allison, in a massive red Stetson, cheer in the crowd. At a slaughterhouse, Carl faints. Later, under a brooding gray sky, Carl and Allison walk along a country track. Carl wraps his jacket around Allison's head to shield her from the weather, leading her to a barn where they share a tender moment, embracing as Carl rests his chin on her hair. Back at the airport check-in desk, they face a uniformed woman who smiles at them, but their moment is interrupted by two serious-looking men who show ID. Carl points at Allison and begins to smile, but they soon find themselves in an interrogation room with a stern Tweed. Disappointed, Allison looks at Carl as they sit handcuffed, and after Peter, Tweed, and Multack leave, Carl offers a weak smile. Multack returns to release Allison, who leaves without a glance at Carl, as a jet lands in LA. Allison strides through the busy terminal, with Carl and Peter trailing behind. Carl retreats as Allison departs in a yellow cab, and Peter watches Carl run back through the terminal. Later, Carl watches a film and attempts to call Allison, but during a meeting, he is distracted and stares at the table. Meanwhile, Allison paints on her apartment terrace, checks her phone, sees Carl's call, and sets it aside. Carl takes a flying lesson but appears disinterested. Eventually, he stands on the edge of a bridge, harnessed for a bungee jump."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Carl walks up to Allison, who's wearing a dark blue coat with red piping, an elegant design inspired by Victorian military uniforms, and picks her up around her waist with one arm, carrying her to a check-in desk where a woman, part of the airport's customer service team in their signature uniforms, looks at a computer screen. Carl frowns, perplexed by a potential gate change, as they proceed to walk through the small Lincoln, Nebraska airport, which is known for its ease of navigation compared to larger airports. At the Telephone Pioneer Museum, dedicated to preserving the history of communications, they see a mock-up of an early telephone switchboard, which revolutionized connectivity, and a mannequin holding a modern mobile phone while Carl holds up the massive vintage phone, demonstrating the vast changes in technology over the years. At a shooting range, an instructor-certified facility for firearms practice, Allison shoots the ground, an instructor raises the gun barrel, and she hits the clay pigeon, making everyone duck as she swings round with the gun. A uniformed band plays at the packed Nebraska Cornhuskers Memorial Stadium, a renowned college football venue, where a mascot jumps up and down, and the football team, Big Red, runs onto the field in red-and-white stripes, rallying the enthusiastic fans. In Carl's apartment, Peter, Lucy, Rooney, and Lee watch the game on TV as Carl, wearing giant yellow corncobs, a nod to the state's significant corn production, on his head and arms, jumps up and down in the crowd while Allison wears a massive red Stetson, a symbol of Western culture. At a slaughterhouse, where meat production takes place, Carl faints, overwhelmed by the environment. In the country, Carl and Allison walk along a track beneath a brooding, gray sky reminiscent of classic rural landscapes, and he takes off his jacket to wrap it around Allison's head, marches her to a barn used for sheltering livestock, removes the jacket, and she shakes her head, smiling contentedly as they wrap their arms around each other, and Carl, looking thoughtful, rests his chin on her hair. At the airport check-in desk, Carl and Allison stand facing a uniformed woman who checks a computer screen and smiles at them while two serious-looking, suited men walk over and show ID, likely from a security detail. Carl points at Allison and starts to smile just before they are in an interrogation room, used for questioning in sensitive airport matters, where thick-set Tweed narrows his eyes. Allison looks at Carl, disappointed, as they sit handcuffed, and Peter, a friend who might help, Tweed, and Multack, potentially an investigator, leave the room. Carl smiles weakly and stares at her wretchedly until Multack walks in to unlock Allison's handcuffs. Allison gets up and, without looking at him, leaves the room as a jet, arriving on time, touches down in LA, a bustling hub of travel. Allison marches through the busy terminal building with Carl and Peter walking some way behind her. Carl retreats while Allison gets in a yellow cab, a classic symbol of transportation in the city, and Peter watches Carl run back through the terminal building. Later, Carl watches a film, perhaps for distraction, and calls Allison, but in a meeting, likely at work, he sits staring at the table. Meanwhile, on the terrace outside her apartment with a view that inspires creativity, Allison stands at an easel, painting. She checks her phone, sees it's Carl calling, and puts it back on the table, deciding not to answer. Carl takes a flying lesson, part of his usual pursuits, but looks uninterested. Eventually, Carl stands on the edge of a bridge, known for thrilling bungee jumping, with a harness around his waist and ankles attached to a bungee rope."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Carl walks up to Allison who is wearing a dark blue coat with red piping and picks her up around her waist with one arm carrying her to a checkin desk where a woman looks at a computer screen. Carl frowns perplexed as they proceed to walk through the small Lincoln Nebraska airport. At the Telephone Pioneer Museum they see a mockup of an early telephone switchboard and a mannequin holding a modern mobile phone while Carl holds up the massive vintage phone. At a shooting range Allison shoots the ground an instructor raises the gun barrel and she hits the clay making everyone duck as she swings round with the gun. A uniformed band plays at the packed Nebraska Cornhuskers Memorial Stadium where a mascot jumps up and down and the football team Big Red runs onto the field in redandwhite stripes. In Carl's apartment Peter Lucy Rooney and Lee watch the game on TV as Carl wearing giant yellow corncobs on his head and arms jumps up and down in the crowd while Allison wears a massive red Stetson. At a slaughterhouse Carl faints. In the country. Carl and Allison walk along a track beneath a brooding gray sky and he takes off his jacket to wrap it around. Allison's head marches her to a barn removes the jacket and she shakes her head smiling contentedly as they wrap their arms around each other and Carl looking thoughtful rests his chin on her hair. At the airport checkin desk Carl and Allison stand facing a uniformed woman who checks a computer screen and smiles at them while two seriouslooking suited men walk over and show ID. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Carl points at Allison and starts to smile just before they are in an interrogation room where thickset Tweed narrows his eyes. Allison looks at Carl disappointed as they sit handcuffed and Peter Tweed and Multack leave the room. Carl smiles weakly and stares at her wretchedly until Multack walks in to unlock Allison's handcuffs. Allison gets up and without looking at him leaves the room as a jet touches down in LA. Allison marches through the busy terminal building with Carl and Peter walking some way behind her. Carl retreats while Allison gets in a yellow cab and Peter watches Carl run back through the terminal building. Later Carl watches a film and calls Allison but in a meeting he sits staring at the table. Meanwhile on the terrace outside her apartment Allison stands at an easel painting. She checks her phone sees it is Carl calling and puts it back on the table. Carl takes a flying lesson but looks uninterested. Eventually Carl stands on the edge of a bridge with a harness around his waist and ankles attached to a bungee rope."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Carl walks up to Allison who is wearing a dark blue coat with red piping and picks her up around her waist with one arm carrying her to a checkin desk where a woman looks at a computer screen. Carl frowns perplexed as they proceed to walk through the small Lincoln Nebraska airport. At the Telephone Pioneer Museum they see a mockup of an early telephone switchboard and a mannequin holding a modern mobile phone while Carl holds up the massive vintage phone. At a shooting range Allison shoots the ground an instructor raises the gun barrel and she hits the clay making everyone duck as she swings round with the gun. A uniformed band plays at the packed Nebraska Cornhuskers Memorial Stadium where a mascot jumps up and down and the football team Big Red runs onto the field in redandwhite stripes. In Carl's apartment Peter Lucy Rooney and Lee watch the game on TV as Carl wearing giant yellow corncobs on his head and arms jumps up and down in the crowd while Allison wears a massive red Stetson. At a slaughterhouse Carl faints. In the country. Carl and Allison walk along a track beneath a brooding gray sky and he takes off his jacket to wrap it around. Allison's head marches her to a barn removes the jacket and she shakes her head smiling contentedly as they wrap their arms around each other and Carl looking thoughtful rests his chin on her hair. At the airport checkin desk Carl and Allison stand facing a uniformed woman who checks a computer screen and smiles at them while two seriouslooking suited men walk over and show ID. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Carl points at Allison and starts to smile just before they are in an interrogation room where thickset Tweed narrows his eyes. Allison looks at Carl disappointed as they sit handcuffed and Peter Tweed and Multack leave the room. Carl smiles weakly and stares at her wretchedly until Multack walks in to unlock Allison's handcuffs. Allison gets up and without looking at him leaves the room as a jet touches down in LA. Allison marches through the busy terminal building with Carl and Peter walking some way behind her. Carl retreats while Allison gets in a yellow cab and Peter watches Carl run back through the terminal building. Later Carl watches a film and calls Allison but in a meeting he sits staring at the table. Meanwhile on the terrace outside her apartment Allison stands at an easel painting. She checks her phone sees it is Carl calling and puts it back on the table. Carl takes a flying lesson but looks uninterested. Eventually Carl stands on the edge of a bridge with a harness around his waist and ankles attached to a bungee rope."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Carl walks up to Allison who is wearing a dark blue coat with red piping and picks her up around her waist with one arm carrying her to a checkin desk where a woman looks at a computer screen. Carl frowns perplexed as they proceed to walk through the small Lincoln Nebraska airport. At the Telephone Pioneer Museum they see a mockup of an early telephone switchboard and a mannequin holding a modern mobile phone while Carl holds up the massive vintage phone. At a shooting range Allison shoots the ground an instructor raises the gun barrel and she hits the clay making everyone duck as she swings round with the gun. A uniformed band plays at the packed Nebraska Cornhuskers Memorial Stadium where a mascot jumps up and down and the football team Big Red runs onto the field in redandwhite stripes. In Carl's apartment Peter Lucy Rooney and Lee watch the game on TV as Carl wearing giant yellow corncobs on his head and arms jumps up and down in the crowd while Allison wears a massive red Stetson. Later Carl watches a film and calls Allison but in a meeting he sits staring at the table. Meanwhile on the terrace outside her apartment Allison stands at an easel painting. She checks her phone sees it is Carl calling and puts it back on the table. Carl takes a flying lesson but looks uninterested. Eventually Carl stands on the edge of a bridge with a harness around his waist and ankles attached to a bungee rope."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Carl walks up to Allison who is wearing a dark blue coat with red piping and picks her up around her waist with one arm carrying her to a checkin desk where a woman looks at a computer screen. Carl frowns perplexed as they proceed to walk through the small Lincoln Nebraska airport. At the Telephone Pioneer Museum they see a mockup of an early telephone switchboard and a mannequin holding a modern mobile phone while Carl holds up the massive vintage phone. Carl takes a flying lesson but looks uninterested. Eventually Carl stands on the edge of a bridge with a harness around his waist and ankles attached to a bungee rope."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Larry glides toward Brenda, who's adorned in a bright purple jacket with green trim, and hoists her up by her shoulder with one leg, dragging her to a ticket booth where a gentleman gazes at a television monitor. Larry scowls, mystified, as they proceed to glide through the tiny Topeka, Kansas train station. At the Rotary Pioneer Exhibit, they observe a replica of an antique telegraph station and a dummy gripping a futuristic tablet while Larry displays the enormous retro computer. At a driving course, Brenda revs the ground, a coach lowers the vehicle wheel, and she rolls the tire, causing everyone to leap as she spins around with the vehicle. A costumed troupe performs at the bustling Kansas Jayhawks Memorial Arena where a jester hops up and down, and the basketball team, Big Blue, sprints onto the court in blue-and-yellow checkers. In Larry's cabin, Tim, Jenny, Riley, and Sam view the match on a projector as Larry, wearing gigantic orange pumpkins on his feet and hands, bounces up and down in the audience while Brenda dons a colossal blue beret. At a bakery, Larry collapses. In the forest, Larry and Brenda stroll along a path under a cheerful, azure sky, and he removes his jumper to drape it around Brenda's elbow, strides her to a stable, peels off the jumper, and she bobs her head, grinning cheerfully as they intertwine their legs around each other, and Larry, appearing reflective, perches his nose on her shoulder. At the train station ticket booth, Larry and Brenda stand facing a uniformed gentleman who scans a television monitor and grins at them while two playful-looking, outfitted women glide over and present badges. Larry gestures at Brenda and begins to grin just before they are in a deliberation chamber where petite Giordano broadens his smile. Brenda glances at Larry, exhilarated, as they recline shackled, and Tim, Giordano, and Remington exit the chamber. Larry grins broadly and gazes at her joyfully until Remington strides in to detach Brenda's shackles. Brenda rises and, without glancing at him, exits the chamber as a helicopter lands in Miami. Brenda marches through the bustling hangar building with Larry and Tim striding some way behind her. Larry advances while Brenda steps in a blue limo and Tim observes Larry dash back through the hangar building. Later, Larry observes a painting and texts Brenda, but in a discussion, he sits gazing at the wall. Meanwhile, on the balcony outside her cabin, Brenda stands at a loom, sculpting. She checks her tablet, notices it's Larry texting, and places it back on the chair. Larry takes a dancing lesson but appears disinterested. Eventually, Larry stands on the rim of a mountain with a belt around his forehead and knees connected to a parachute cord."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Carl and Allison navigate their relationship through a series of events, starting at a small airport in Lincoln, Nebraska. Carl's playful energy is evident when he carries Allison to a check-in desk, and they tour the Telephone Pioneer Museum. At a shooting range, Allison's misfire causes chaos, but later they enjoy a football game where Carl exuberantly supports the Nebraska Cornhuskers. Their relationship takes a turn when Carl faints at a slaughterhouse and later wraps Allison in his jacket during a walk, showing his protective side. However, tension arises at the airport when they're detained, leading to disappointment, particularly for Allison. Released from handcuffs, she leaves Carl, who tries to contact her unsuccessfully while she's painting and ignoring his call. Despite Carl's attempts to reconnect, like taking a flying lesson and a daring bungee jump, there's an air of unresolved emotional distance between them."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Eventually Carl stands on the edge of a bridge with a harness around his waist and ankles attached to a bungee rope Carl takes a flying lesson but looks uninterested  She checks her phone sees it's Carl calling and puts it back on the table  Meanwhile on the terrace outside her apartment Allison stands at an easel painting  Later Carl watches a film and calls Allison but in a meeting he sits staring at the table  Carl retreats while Allison gets in a yellow cab and Peter watches Carl run back through the terminal building  Allison marches through the busy terminal building with Carl and Peter walking some way behind her  Allison gets up and without looking at him leaves the room as a jet touches down in LA  Carl smiles weakly and stares at her wretchedly until Multack walks in to unlock Allison's handcuffs  Allison looks at Carl disappointed as they sit handcuffed and Peter Tweed and Multack leave the room  Carl points at Allison and starts to smile just before they are in an interrogation room where thickset Tweed narrows his eyes  At the airport checkin desk Carl and Allison stand facing a uniformed woman who checks a computer screen and smiles at them while two seriouslooking suited men walk over and show ID  Allison's head marches her to a barn removes the jacket and she shakes her head smiling contentedly as they wrap their arms around each other and Carl looking thoughtful rests his chin on her hair  Carl and Allison walk along a track beneath a brooding gray sky and he takes off his jacket to wrap it around  In the country  At a slaughterhouse Carl faints  In Carl's apartment Peter Lucy Rooney and Lee watch the game on TV as Carl wearing giant yellow corncobs on his head and arms jumps up and down in the crowd while Allison wears a massive red Stetson  A uniformed band plays at the packed Nebraska Cornhuskers Memorial Stadium where a mascot jumps up and down and the football team Big Red runs onto the field in redandwhite stripes  At a shooting range Allison shoots the ground an instructor raises the gun barrel and she hits the clay making everyone duck as she swings round with the gun  At the Telephone Pioneer Museum they see a mockup of an early telephone switchboard and a mannequin holding a modern mobile phone while Carl holds up the massive vintage phone  Carl frowns perplexed as they proceed to walk through the small Lincoln Nebraska airport  Carl walks up to Allison who's wearing a dark blue coat with red piping and picks her up around her waist with one arm carrying her to a checkin desk where a woman looks at a computer screen "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Carl frowns perplexed as they proceed to walk through the small Lincoln Nebraska airport Carl walks up to Allison who is wearing a dark blue coat with red piping and picks her up around her waist with one arm carrying her to a checkin desk where a woman looks at a computer screen At a shooting range Allison shoots the ground an instructor raises the gun barrel and she hits the clay making everyone duck as she swings round with the gun At the Telephone Pioneer Museum they see a mockup of an early telephone switchboard and a mannequin holding a modern mobile phone while Carl holds up the massive vintage phone In Carl's apartment Peter Lucy Rooney and Lee watch the game on TV as Carl wearing giant yellow corncobs on his head and arms jumps up and down in the crowd while Allison wears a massive red Stetson A uniformed band plays at the packed Nebraska Cornhuskers Memorial Stadium where a mascot jumps up and down and the football team Big Red runs onto the field in redandwhite stripes In the country At a slaughterhouse Carl faints Allison's head marches her to a barn removes the jacket and she shakes her head smiling contentedly as they wrap their arms around each other and Carl looking thoughtful rests his chin on her hair Carl and Allison walk along a track beneath a brooding gray sky and he takes off his jacket to wrap it around Carl points at Allison and starts to smile just before they are in an interrogation room where thickset Tweed narrows his eyes At the airport checkin desk Carl and Allison stand facing a uniformed woman who checks a computer screen and smiles at them while two seriouslooking suited men walk over and show ID Carl smiles weakly and stares at her wretchedly until Multack walks in to unlock Allison's handcuffs Allison looks at Carl disappointed as they sit handcuffed and Peter Tweed and Multack leave the room Allison marches through the busy terminal building with Carl and Peter walking some way behind her Allison gets up and without looking at him leaves the room as a jet touches down in LA Later Carl watches a film and calls Allison but in a meeting he sits staring at the table Carl retreats while Allison gets in a yellow cab and Peter watches Carl run back through the terminal building She checks her phone sees it is Carl calling and puts it back on the table Meanwhile on the terrace outside her apartment Allison stands at an easel painting Eventually Carl stands on the edge of a bridge with a harness around his waist and ankles attached to a bungee rope Carl takes a flying lesson but looks uninterested"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Carl points at Allison and starts to smile just before they are in an interrogation room where thickset Tweed narrows his eyes  Allison looks at Carl disappointed as they sit handcuffed and Peter Tweed and Multack leave the room  Carl smiles weakly and stares at her wretchedly until Multack walks in to unlock Allison's handcuffs  Allison gets up and without looking at him leaves the room as a jet touches down in LA  Allison marches through the busy terminal building with Carl and Peter walking some way behind her  Carl retreats while Allison gets in a yellow cab and Peter watches Carl run back through the terminal building  Later Carl watches a film and calls Allison but in a meeting he sits staring at the table  Meanwhile on the terrace outside her apartment Allison stands at an easel painting  She checks her phone sees it's Carl calling and puts it back on the table  Carl takes a flying lesson but looks uninterested  Eventually Carl stands on the edge of a bridge with a harness around his waist and ankles attached to a bungee rope Carl walks up to Allison who's wearing a dark blue coat with red piping and picks her up around her waist with one arm carrying her to a checkin desk where a woman looks at a computer screen  Carl frowns perplexed as they proceed to walk through the small Lincoln Nebraska airport  At the Telephone Pioneer Museum they see a mockup of an early telephone switchboard and a mannequin holding a modern mobile phone while Carl holds up the massive vintage phone  At a shooting range Allison shoots the ground an instructor raises the gun barrel and she hits the clay making everyone duck as she swings round with the gun  A uniformed band plays at the packed Nebraska Cornhuskers Memorial Stadium where a mascot jumps up and down and the football team Big Red runs onto the field in redandwhite stripes  In Carl's apartment Peter Lucy Rooney and Lee watch the game on TV as Carl wearing giant yellow corncobs on his head and arms jumps up and down in the crowd while Allison wears a massive red Stetson  At a slaughterhouse Carl faints  In the country  Carl and Allison walk along a track beneath a brooding gray sky and he takes off his jacket to wrap it around  Allison's head marches her to a barn removes the jacket and she shakes her head smiling contentedly as they wrap their arms around each other and Carl looking thoughtful rests his chin on her hair  At the airport checkin desk Carl and Allison stand facing a uniformed woman who checks a computer screen and smiles at them while two seriouslooking suited men walk over and show ID "
        }
      ]
    }
  ]
}