{
  "ground_truth": "A car plows into the side of them. Carl lies unconscious in a hospital bed with grazes on his face. A pretty nurse dressed in blue takes his pulse while Peter and Rooney sit beside the bed, with Rooney having a snack and Peter holding a drink. The nurse walks off, and Rooney watches her go as Carl stirs and looks fearful. Terrence pulls back a curtain, and Carl goes while Peter looks at Terrence. Wearing a hospital gown, Terrence goes, and Rooney gets into the bed and shushes Peter. Carl heads out, runs to an elevator as Lee steps out, and still in his hospital gown, revs Lee's Ducati bike, puts a helmet on, pulls a wheelie, and whizzes off. Up on the back wheel, Carl crashes through a barrier and heads out of the hospital car park. He rides up next to a UPS van, and the driver looks out and sees the Ducati's front wheel waggling about in midair. The bike's front wheel drops down, and Carl speeds through town, weaving precariously through traffic and hopping onto a pavement as pedestrians run for cover. A car pulls out ahead, and Carl pulls on the brakes so hard the back wheel flips up as he slows down. The car passes, and Carl wheelies off and, back on two wheels, weaves through the traffic. He speeds along a dual carriageway, his spotted hospital gown flapping in the breeze, keeping his head low and his arms bent as he rides the Ducati, which is a cross between a trail bike and a road bike. His gown has two ties at the back above the waist, and the gown billows, revealing his bare backside. He rides up to the domed observatory, where Allison is doing a warm-up with her jogging photographers. Carl rides up and does a few donuts, spinning the bike's back wheel on the tarmac and turning circles as Allison and her group stare incredulously, with Carl enveloped in a cloud of burnt-rubber smoke. Allison is transfixed as Carl does another donut. Taking off his helmet, he strides out of the cloud of smoke, heavy-browed, and walks up to Allison, as the group jog off. Grinning, Carl runs up next to Allison, who frowns. They're at a viewpoint overlooking the city; she smiles and looks at him. They share a lingering kiss and wrap their arms around each other. Reggie holds up his hand to apologize, and Carl and Allison kiss passionately as Reggie glances at his fellow photographers. They all aim their cameras and snap away at the couple, with the vast city spreading out beyond. Carl reaches round and grabs his gown to make sure he's not exposing himself. Outside the homeless shelter, Norm's with Soo-Mi, who sorts through clothes.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A vehicle crashes into the flank of them. Carl lies insensible in a medical cot with scrapes on his visage. A lovely caregiver attired in azure checks his heartbeat while Peter and Rooney sit alongside the cot, with Rooney having a treat and Peter gripping a beverage. The caregiver departures, and Rooney observes her leave as Carl rouses and appears apprehensive. Terrence retracts a drape, and Carl departs while Peter gazes at Terrence. Clad in a medical robe, Terrence departs, and Rooney gets into the cot and silences Peter. Carl exits, dashes to a lift as Lee emerges, and still in his medical robe, accelerates Lee's Ducati motorbike, dons a headgear, executes a wheelie, and zooms away. Up on the posterior wheel, Carl crashes through a barricade and exits the infirmary car park. He rides up adjacent to a UPS lorry, and the operator peers out and sees the Ducati's front wheel oscillating about in midair. The bike's anterior wheel descends, and Carl accelerates through municipality, zigzagging perilously through vehicles and hopping onto a footpath as pedestrians flee for safety. A vehicle emerges ahead, and Carl pulls on the brakes so forcefully the rear wheel flips up as he decelerates. The vehicle passes, and Carl wheelies away and, back on two wheels, weaves through the vehicles. He accelerates along a dual highway, his dotted medical robe flapping in the breeze, keeping his head low and his arms bent as he rides the Ducati, which is a hybrid between a trail motorbike and a road motorbike. His robe has two ties at the back above the waist, and the robe billows, revealing his naked posterior. He rides up to the domed observatory, where Allison is doing a warm-up with her jogging photographers. Carl rides up and does a few spins, rotating the bike's rear wheel on the tarmac and turning circles as Allison and her group stare incredulously, with Carl enshrouded in a cloud of burnt-rubber smoke. Allison is mesmerized as Carl does another spin. Removing his headgear, he strides out of the cloud of smoke, heavy-browed, and walks up to Allison, as the group jog away. Grinning, Carl runs up alongside Allison, who frowns. They're at a lookout overlooking the metropolis; she smiles and looks at him. They share a lasting kiss and wrap their limbs around each other. Reggie raises up his hand to apologize, and Carl and Allison kiss passionately as Reggie glances at his fellow photographers. They all aim their cameras and snap away at the couple, with the vast city spreading out beyond. Carl reaches round and grasps his robe to ensure he's not exposing himself. Outside the vagrant refuge, Norm's with Soo-Mi, who sorts through garments."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A car is plowed into the side of them. Carl is lying unconscious in a hospital bed with grazes on his face. His pulse is taken by a pretty nurse dressed in blue while Peter and Rooney are seated beside the bed, with Rooney having a snack and Peter holding a drink. The nurse walks off, and she is watched go by Rooney as Carl stirs and looks fearful. A curtain is pulled back by Terrence, and Carl is looked at by Peter as Terrence goes. Wearing a hospital gown, Terrence goes, and the bed is gotten into by Rooney, who shushes Peter. Carl heads out, running to an elevator as Lee steps out, and still in his hospital gown, Lee's Ducati bike is revved by him; a helmet is put on, a wheelie is pulled, and he whizzes off. A barrier is crashed through by Carl up on the back wheel and he heads out of the hospital car park. He rides up next to a UPS van, and the Ducati's front wheel is waggled about in midair, as seen by the driver. The bike's front wheel is dropped down, and town is sped through by Carl, weaving precariously through traffic and hopping onto a pavement, making pedestrians run for cover. A car is pulled out ahead, and the brakes are pulled on by Carl so hard that the back wheel flips up as he slows down. The car passes, and a wheelie is performed by Carl, and back on two wheels, the traffic is weaved through by him. A dual carriageway is sped along by him, his spotted hospital gown flapping in the breeze, and his head is kept low with his arms bent as the Ducati is ridden by him, which is a cross between a trail bike and a road bike. The gown has two ties at the back above the waist, and it billows, revealing his bare backside. The domed observatory is ridden up to by him, where Allison is doing a warm-up with her jogging photographers. Carl rides up and a few donuts are done by him, spinning the bike's back wheel on the tarmac and turning circles as Allison and her group stare incredulously, enveloping Carl in a cloud of burnt-rubber smoke. Allison is transfixed as another donut is done by Carl. The helmet is taken off by him, and he strides out of the cloud of smoke, heavy-browed, walking up to Allison, as the group jogs off. Grinning, Carl runs up next to Allison, who frowns. They're at a viewpoint overlooking the city; she smiles and looks at him. A lingering kiss is shared by them, and they wrap their arms around each other. Reggie holds up his hand to apologize, and passionately, Carl and Allison kiss as his fellow photographers are glanced at by Reggie. They all aim their cameras and snap away at the couple, with the vast city spreading out beyond. Carl reaches round and grabs his gown to make sure he’s not exposing himself. Outside the homeless shelter, Norm is with Soo-Mi, who sorts through clothes."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A car crashes into them, leaving Carl unconscious in a hospital bed with facial grazes. A nurse in blue checks his pulse while Peter and Rooney sit nearby, Rooney snacking and Peter holding a drink. The nurse leaves, and Carl stirs fearfully. Terrence pulls back a curtain, prompting Carl to leave. In a hospital gown, Carl runs to an elevator, encounters Lee, and rides off on Lee's Ducati, performing a wheelie. He crashes through a barrier, exits the hospital car park, and speeds through town, weaving through traffic and hopping onto a pavement as pedestrians scatter. A car pulls out, and Carl brakes hard, flipping the back wheel. He continues, weaving through traffic on a dual carriageway, his hospital gown flapping and revealing his backside. He reaches the domed observatory, where Allison is warming up with photographers. Carl performs donuts, enveloped in burnt-rubber smoke, as Allison and her group watch. He removes his helmet, approaches Allison, and they share a lingering kiss at a city viewpoint. Reggie apologizes, and photographers capture the moment. Carl ensures his gown covers him. Outside a homeless shelter, Norm is with Soo-Mi, sorting clothes."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A car crashes into them, leaving Carl unconscious in a hospital bed with facial grazes. A pretty nurse in blue checks his pulse while Peter and Rooney sit nearby, Rooney snacking and Peter with a drink. The nurse leaves, Rooney watches her, and Carl wakes fearfully. Terrence pulls back a curtain, and Carl leaves as Peter looks at Terrence. Wearing a hospital gown, Terrence departs, and Rooney gets into the bed, shushing Peter. Carl runs to an elevator, encounters Lee, and, still in his gown, revs Lee's Ducati, dons a helmet, and speeds off. He crashes through a barrier, exits the hospital car park, and rides beside a UPS van, its driver noticing the Ducati's front wheel in midair. Carl weaves through traffic, hops onto a pavement, and narrowly avoids a car by braking hard. He continues, wheelies, and speeds along a dual carriageway, his gown flapping and revealing his bare backside. He reaches the domed observatory, where Allison is warming up with photographers. Carl performs donuts, enveloped in burnt-rubber smoke, as Allison and her group watch. He removes his helmet, approaches Allison, and they kiss at a city viewpoint. Reggie apologizes, and photographers capture the couple with the city beyond. Carl ensures his gown covers him. Outside a homeless shelter, Norm is with Soo-Mi, sorting clothes."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A car suddenly and violently crashes into the side of them, causing chaos and confusion. Carl is left lying unconscious in a hospital bed, his face marked with grazes and scratches. A pretty nurse, dressed in a crisp blue uniform, attentively takes his pulse while Peter and Rooney sit vigilantly beside the bed. Rooney is casually having a snack, and Peter is holding a drink in his hand. The nurse finishes her task and walks away, and Rooney can't help but watch her as she departs. At that moment, Carl begins to stir, his expression filled with fear and uncertainty. Terrence then pulls back a curtain, and Carl makes his move while Peter turns his attention to Terrence. Dressed in a hospital gown, Terrence also leaves, and Rooney quickly climbs into the bed, gesturing for Peter to be quiet. Carl heads out of the room, rushing to an elevator just as Lee steps out. Still clad in his hospital gown, Carl revs up Lee's Ducati bike, puts on a helmet, and performs a daring wheelie before speeding off. Balancing on the back wheel, Carl crashes through a barrier and exits the hospital car park with determination. He rides up alongside a UPS van, and the driver looks out, astonished to see the Ducati's front wheel wobbling in midair. The bike's front wheel eventually drops down, and Carl accelerates through town, weaving dangerously through traffic and hopping onto a pavement, causing pedestrians to scatter for safety. A car suddenly pulls out ahead, and Carl pulls on the brakes with such force that the back wheel flips up as he slows down. Once the car passes, Carl performs another wheelie and, back on two wheels, skillfully navigates through the traffic. He speeds along a dual carriageway, his hospital gown, which is spotted, flapping wildly in the breeze. He keeps his head low and his arms bent as he rides the Ducati, a machine that is a hybrid between a trail bike and a road bike. The gown has two ties at the back above the waist, and it billows dramatically, revealing his bare backside. Carl rides up to the domed observatory, where Allison is engaged in a warm-up session with her jogging photographers. Carl approaches and performs a few donuts, spinning the bike's back wheel on the tarmac and creating circles as Allison and her group watch in disbelief. Carl is enveloped in a cloud of burnt-rubber smoke, and Allison is captivated as he executes another donut. Removing his helmet, Carl strides confidently out of the smoke, his brow heavy with determination, and walks up to Allison as the group jogs away. Grinning broadly, Carl runs up next to Allison, who initially frowns. They find themselves at a viewpoint overlooking the sprawling city; she eventually smiles and looks at him warmly. They share a lingering, tender kiss and wrap their arms around each other affectionately. Reggie raises his hand in a gesture of apology, and Carl and Allison continue to kiss passionately as Reggie glances at his fellow photographers. They all aim their cameras and eagerly snap away at the couple, with the vast cityscape stretching out beyond them. Carl reaches around to grab his gown, ensuring he's not inadvertently exposing himself. Meanwhile, outside the homeless shelter, Norm is with Soo-Mi, who is busy sorting through clothes."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A car, out of nowhere, suddenly and violently crashes into the side of them, unleashing chaos and a whirlwind of confusion all around. Carl is left lying unconscious and vulnerable in a hospital bed, his face marked with grazes and scratches that tell the story of the accident. Nearby, a pretty nurse, dressed in a crisp and immaculate blue uniform, attentively takes his pulse, carefully monitoring his condition. Sitting vigilantly next to the bed are Peter and Rooney, both focused and alert. Rooney, in a casual manner, is having a snack, while Peter is steadily holding a drink in his hand. The nurse, having completed her task, walks away with a professional stride, and Rooney finds himself unable to resist watching her as she departs. At that very moment, Carl begins to stir, his expression filled with an overwhelming mix of fear and uncertainty as he regains consciousness. \n\nThen, Terrence pulls back the curtain, and Carl makes his move just as Peter turns his attention toward Terrence. Dressed in a standard, plain hospital gown, Terrence also leaves the scene, and Rooney quickly climbs into the bed, making a gesture for Peter to keep quiet. Carl seizes the opportunity to head out of the room, rushing urgently to an elevator just as Lee steps out. Still clad in his hospital gown, Carl boldly revs up Lee's Ducati bike, puts on a helmet with determination, and performs a daring wheelie before speeding off with staggering speed. Balancing precariously on the back wheel, Carl crashes through a barrier and exits the hospital car park with fierce determination. He rides up alongside a UPS van, and the van driver looks out, astonished and wide-eyed to see the Ducati's front wheel wobbling precariously in midair. Eventually, the bike's front wheel drops down, and Carl accelerates through town, weaving dangerously through the bustling traffic and hopping onto a pavement, causing startled pedestrians to scatter in search of safety. \n\nA car suddenly pulls out ahead, and Carl quickly pulls on the brakes with such force that the back wheel flips up dramatically as he manages to slow down. Once the car passes, Carl performs yet another wheelie and, back on two wheels, skillfully navigates through the challenging traffic. He speeds along a dual carriageway, his hospital gown, which is spotted with telltale marks, flapping wildly in the breeze. He keeps his head low and his arms bent as he expertly rides the Ducati, a powerful machine that is a seamless hybrid between a trail bike and a road bike. The gown, held together by two simple ties at the back above the waist, billows dramatically, occasionally revealing his bare backside. Carl rides up to the imposing, domed observatory, where Allison is engaged in a warm-up session along with her jogging photographers. As Carl approaches and performs a few daring donuts, he spins the bike's back wheel on the tarmac, creating impressive circles as Allison and her group watch in utter disbelief. Carl becomes enveloped in a cloud of burnt-rubber smoke, and Allison is captivated, her attention fixed, as he executes another donut with precision.\n\nRemoving his helmet with a flourish, Carl strides confidently out of the swirling smoke, his brow heavy with unwavering determination, and walks up to Allison as the group jogs away. Grinning broadly, Carl runs up next to Allison, who initially frowns, but as they find themselves at a stunning viewpoint overlooking the sprawling, expansive city, she eventually smiles and looks at him warmly. They share a lingering, tender kiss, wrapping their arms around each other affectionately, savoring the moment as the cityscape unfolds before them. Meanwhile, Reggie raises his hand in a gesture of apology, and Carl and Allison continue to kiss passionately as Reggie glances at his fellow photographers. They all aim their cameras, eagerly snapping away at the couple, with the vast, breathtaking cityscape stretching out beyond them. Carl, being mindful, reaches around to grab his gown, taking care to ensure he's not inadvertently exposing himself to those around. Meanwhile, outside the bustling homeless shelter, Norm is with Soo-Mi, who is busily sorting through clothes, each piece telling its own story."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A car suddenly crashes into the side of them, causing a violent impact. Carl is then seen lying unconscious in a hospital bed, his face marked with grazes from the accident. A pretty nurse, dressed in a crisp blue uniform, approaches Carl's bedside and gently takes his pulse, ensuring he is stable. Meanwhile, Peter and Rooney sit beside the bed, providing silent support; Rooney is casually having a snack, while Peter holds a drink, perhaps to calm his nerves. The nurse finishes her task and walks away, and Rooney's eyes follow her as she departs. At this moment, Carl begins to stir, his eyes fluttering open with a look of fear and confusion. Terrence appears, pulling back a curtain, and Carl reacts by going with him, while Peter's gaze shifts to Terrence, perhaps seeking reassurance. Terrence, now wearing a hospital gown, also leaves, and Rooney seizes the opportunity to climb into the bed, gesturing for Peter to be quiet. Carl, now more alert, heads out of the room and makes a dash for the elevator. As he reaches it, Lee steps out, and Carl, still clad in his hospital gown, seizes the moment to rev up Lee's Ducati bike. He quickly dons a helmet, pulls a wheelie, and speeds off with a burst of adrenaline. Balancing on the back wheel, Carl crashes through a barrier, making a dramatic exit from the hospital car park. He maneuvers the bike next to a UPS van, catching the driver's attention as the Ducati's front wheel waggles in midair. The wheel then drops back down, and Carl accelerates through town, skillfully weaving through traffic. He hops onto a pavement, causing pedestrians to scatter in alarm. A car suddenly pulls out in front of him, and Carl reacts by pulling on the brakes with such force that the back wheel lifts off the ground as he slows down. Once the car passes, Carl performs another wheelie and, back on two wheels, continues to weave through the traffic. He speeds along a dual carriageway, his hospital gown, spotted and tied at the back, flapping wildly in the breeze. Keeping his head low and arms bent, he rides the Ducati, a hybrid between a trail bike and a road bike, with his gown billowing and occasionally revealing his bare backside. Carl approaches the domed observatory, where Allison is engaged in a warm-up session with her jogging photographers. He rides up and executes a series of donuts, spinning the bike's back wheel on the tarmac and creating circles as Allison and her group watch in disbelief. Enveloped in a cloud of burnt-rubber smoke, Carl performs another donut, capturing Allison's attention. He then removes his helmet, strides confidently out of the smoke, his brow heavy with determination, and approaches Allison as the group jogs away. Grinning, Carl runs alongside Allison, who initially frowns but then smiles as they reach a viewpoint overlooking the city. They share a lingering kiss, wrapping their arms around each other in a moment of intimacy. Reggie, feeling the need to apologize, holds up his hand, but Carl and Allison are lost in a passionate kiss. Reggie glances at his fellow photographers, who seize the moment to aim their cameras and capture the couple against the backdrop of the sprawling city. Carl, mindful of his attire, reaches around to adjust his gown, ensuring he maintains his modesty. Meanwhile, outside the homeless shelter, Norm is with Soo-Mi, who is busy sorting through clothes, attending to her task with care."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A car crashes into them, leaving Carl unconscious in a hospital bed with facial grazes. A nurse checks his pulse while Peter and Rooney sit nearby, with Rooney snacking and Peter holding a drink. As the nurse departs, Rooney watches her, and Carl awakens, looking fearful. Terrence draws back a curtain, prompting Carl to leave while Peter observes Terrence. Wearing a hospital gown, Carl rushes to an elevator, encounters Lee, and then takes Lee's Ducati bike. Donning a helmet, he performs a wheelie and speeds out of the hospital car park, crashing through a barrier. Riding alongside a UPS van, the driver notices the Ducati's front wheel in midair before it drops, and Carl weaves through town traffic, hopping onto a pavement as pedestrians scatter. He brakes hard to avoid a car, causing the back wheel to flip up, then continues weaving through traffic. On a dual carriageway, his hospital gown flaps in the breeze, revealing his bare backside. Carl arrives at a domed observatory where Allison is warming up with photographers. He performs donuts on the tarmac, enveloped in burnt-rubber smoke, as Allison and her group watch in disbelief. Removing his helmet, Carl approaches Allison, and they share a lingering kiss at a city viewpoint. Reggie apologizes as photographers capture the moment, with the cityscape in the background. Carl discreetly adjusts his gown to avoid exposure. Meanwhile, outside a homeless shelter, Norm is with Soo-Mi, who sorts through clothes."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A car, seemingly out of nowhere and likely following a collision-related incident, plows into the side of them. Carl lies unconscious in a hospital bed with grazes on his face, a common injury from vehicular accidents. A pretty nurse dressed in blue takes his pulse, standard procedure to assess his vital signs, while Peter and Rooney sit beside the bed, with Rooney having a snack and Peter holding a drink, perhaps from the hospital cafeteria. The nurse walks off to attend to other patients, and Rooney watches her go as Carl stirs and looks fearful, likely due to the disorientation typical after regaining consciousness. Terrence, possibly a hospital staff member, pulls back a curtain, and Carl goes while Peter looks at Terrence with concern. Wearing a hospital gown, the typical attire for patients to allow easy medical access, Terrence goes, and Rooney gets into the bed and shushes Peter, perhaps an attempt to prevent a scene. Carl heads out, runs to an elevator as Lee steps out, and still in his hospital gown, revs Lee's Ducati bike, known for its speed and agility, puts a helmet on, pulls a wheelie, and whizzes off. Up on the back wheel, Carl crashes through a barrier and heads out of the hospital car park, avoiding security. He rides up next to a UPS van, recognizable by its brown color, and the driver looks out and sees the Ducati's front wheel waggling about in midair, an unusual sight in traffic. The bike's front wheel drops down, and Carl speeds through town, weaving precariously through traffic and hopping onto a pavement as pedestrians run for cover, startled by the unexpected maneuver. A car pulls out ahead, and Carl pulls on the brakes so hard the back wheel flips up as he slows down, employing a skill known to experienced motorcyclists as a \"stoppie.\" The car passes, and Carl wheelies off and, back on two wheels, weaves through the traffic. He speeds along a dual carriageway, a road designed for faster-moving vehicles, his spotted hospital gown flapping in the breeze, keeping his head low and his arms bent as he rides the Ducati, which is a cross between a trail bike and a road bike. His gown has two ties at the back above the waist, and the gown billows, revealing his bare backside at times. He rides up to the domed observatory, a local landmark popular for stargazing and panoramic views, where Allison is doing a warm-up with her jogging photographers, preparing for an event. Carl rides up and does a few donuts, spinning the bike's back wheel on the tarmac and turning circles as Allison and her group stare incredulously, with Carl enveloped in a cloud of burnt-rubber smoke. Allison is transfixed as Carl does another donut, the sound and smell capturing her attention. Taking off his helmet, he strides out of the cloud of smoke, heavy-browed, and walks up to Allison, as the group jog off, probably to give them privacy. Grinning, Carl runs up next to Allison, who frowns at the unexpected reunion. They're at a viewpoint overlooking the city; she smiles and looks at him, charmed by the spontaneous encounter. They share a lingering kiss and wrap their arms around each other, a moment mixing romance with adrenaline. Reggie holds up his hand to apologize, and Carl and Allison kiss passionately as Reggie glances at his fellow photographers, seizing the unplanned photo opportunity. They all aim their cameras and snap away at the couple, with the vast city spreading out beyond, creating a picturesque backdrop. Carl reaches round and grabs his gown to make sure he's not exposing himself, aware of the presence of the cameras. Outside the homeless shelter, a community resource for those in need, Norm's with Soo-Mi, who sorts through clothes, likely part of a volunteer effort to assist the less fortunate."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "A car plows into the side of them. Carl lies unconscious in a hospital bed with grazes on his face. A pretty nurse dressed in blue takes his pulse while Peter and Rooney sit beside the bed with Rooney having a snack and Peter holding a drink. The nurse walks off and Rooney watches her go as Carl stirs and looks fearful. Terrence pulls back a curtain and Carl goes while Peter looks at Terrence. Wearing a hospital gown Terrence goes and Rooney gets into the bed and shushes Peter. Carl heads out runs to an elevator as Lee steps out and still in his hospital gown revs. Lee's Ducati bike puts a helmet on pulls a wheelie and whizzes off. Up on the back wheel. Carl crashes through a barrier and heads out of the hospital car park. He rides up next to a UPS van and the driver looks out and sees the Ducati's front wheel waggling about in midair. The bike's front wheel drops down and Carl speeds through town weaving precariously through traffic and hopping onto a pavement as pedestrians run for cover. A car pulls out ahead and Carl pulls on the brakes so hard the back wheel flips up as he slows down. The car passes and Carl wheelies off and back on two wheels weaves through the traffic. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. He speeds along a dual carriageway his spotted hospital gown flapping in the breeze keeping his head low and his arms bent as he rides the Ducati which is a cross between a trail bike and a road bike. His gown has two ties at the back above the waist and the gown billows revealing his bare backside. He rides up to the domed observatory where Allison is doing a warmup with her jogging photographers. Carl rides up and does a few donuts spinning the bike's back wheel on the tarmac and turning circles as Allison and her group stare incredulously with Carl enveloped in a cloud of burntrubber smoke. Allison is transfixed as Carl does another donut. Taking off his helmet he strides out of the cloud of smoke heavybrowed and walks up to Allison as the group jog off. Grinning Carl runs up next to Allison who frowns. They are at a viewpoint overlooking the city. she smiles and looks at him. They share a lingering kiss and wrap their arms around each other. Reggie holds up his hand to apologize and Carl and Allison kiss passionately as Reggie glances at his fellow photographers. They all aim their cameras and snap away at the couple with the vast city spreading out beyond. Carl reaches round and grabs his gown to make sure he is not exposing himself. Outside the homeless shelter Norm's with SooMi who sorts through clothes."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "A car plows into the side of them. Carl lies unconscious in a hospital bed with grazes on his face. A pretty nurse dressed in blue takes his pulse while Peter and Rooney sit beside the bed with Rooney having a snack and Peter holding a drink. The nurse walks off and Rooney watches her go as Carl stirs and looks fearful. Terrence pulls back a curtain and Carl goes while Peter looks at Terrence. Wearing a hospital gown Terrence goes and Rooney gets into the bed and shushes Peter. Carl heads out runs to an elevator as Lee steps out and still in his hospital gown revs. Lee's Ducati bike puts a helmet on pulls a wheelie and whizzes off. Up on the back wheel. Carl crashes through a barrier and heads out of the hospital car park. He rides up next to a UPS van and the driver looks out and sees the Ducati's front wheel waggling about in midair. The bike's front wheel drops down and Carl speeds through town weaving precariously through traffic and hopping onto a pavement as pedestrians run for cover. A car pulls out ahead and Carl pulls on the brakes so hard the back wheel flips up as he slows down. The car passes and Carl wheelies off and back on two wheels weaves through the traffic. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. He speeds along a dual carriageway his spotted hospital gown flapping in the breeze keeping his head low and his arms bent as he rides the Ducati which is a cross between a trail bike and a road bike. His gown has two ties at the back above the waist and the gown billows revealing his bare backside. He rides up to the domed observatory where Allison is doing a warmup with her jogging photographers. Carl rides up and does a few donuts spinning the bike's back wheel on the tarmac and turning circles as Allison and her group stare incredulously with Carl enveloped in a cloud of burntrubber smoke. Allison is transfixed as Carl does another donut. Taking off his helmet he strides out of the cloud of smoke heavybrowed and walks up to Allison as the group jog off. Grinning Carl runs up next to Allison who frowns. They are at a viewpoint overlooking the city. she smiles and looks at him. They share a lingering kiss and wrap their arms around each other. Reggie holds up his hand to apologize and Carl and Allison kiss passionately as Reggie glances at his fellow photographers. They all aim their cameras and snap away at the couple with the vast city spreading out beyond. Carl reaches round and grabs his gown to make sure he is not exposing himself. Outside the homeless shelter Norm's with SooMi who sorts through clothes."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "A car plows into the side of them. Carl lies unconscious in a hospital bed with grazes on his face. A pretty nurse dressed in blue takes his pulse while Peter and Rooney sit beside the bed with Rooney having a snack and Peter holding a drink. The nurse walks off and Rooney watches her go as Carl stirs and looks fearful. Terrence pulls back a curtain and Carl goes while Peter looks at Terrence. Wearing a hospital gown Terrence goes and Rooney gets into the bed and shushes Peter. Carl heads out runs to an elevator as Lee steps out and still in his hospital gown revs. They are at a viewpoint overlooking the city. she smiles and looks at him. They share a lingering kiss and wrap their arms around each other. Reggie holds up his hand to apologize and Carl and Allison kiss passionately as Reggie glances at his fellow photographers. They all aim their cameras and snap away at the couple with the vast city spreading out beyond. Carl reaches round and grabs his gown to make sure he is not exposing himself. Outside the homeless shelter Norm's with SooMi who sorts through clothes."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "A car plows into the side of them. Carl lies unconscious in a hospital bed with grazes on his face. A pretty nurse dressed in blue takes his pulse while Peter and Rooney sit beside the bed with Rooney having a snack and Peter holding a drink. They all aim their cameras and snap away at the couple with the vast city spreading out beyond. Carl reaches round and grabs his gown to make sure he is not exposing himself. Outside the homeless shelter Norm's with SooMi who sorts through clothes."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "A whale burrows into the top of them. Brenda floats awake in a library chair with freckles on her leg. A grumpy lion slathered in red counts her footsteps while Timmy and Jessica nap beneath the chair, with Jessica tossing a ball and Timmy reading a map. The lion stomps away, and Jessica listens to it leave as Brenda twitches and seems amused. Gordon pulls up a hammock, and Brenda stays while Timmy waves at Gordon. Wrapped in a library robe, Gordon stays, and Jessica slides under the chair and waves at Timmy. Brenda floats away, glides to a staircase as Kayla hops down, and still in her library robe, cranks Kayla's Vespa scooter, wears a monocle, performs a jump, and zooms away. Balancing on one toe, Brenda jets over a hedge and zooms out of the library garden. She glides up next to a FedEx helicopter, and the pilot pokes out and spots the Vespa's headlights flashing in mid-spin. The scooter's rear bumper lifts up, and Brenda flies through the village, zigzagging smoothly through rivers and skipping onto a rooftop as cats sprint for safety. A wagon tumbles down behind, and Brenda yanks on the levers so lightly the rear propeller twirls up as she speeds up. The wagon rolls by, and Brenda soars away and, spinning on one wing, zips through the village. She flies along a one-way track, her striped library robe fluttering in the wind, keeping her feet high and her fingers blue as she cruises the Vespa, which is a blend between a dune buggy and a yacht. Her robe has four buttons at the front above the knee, and the robe swirls, revealing her bare shoulders. She sails up to the red lighthouse, where Marvin is doing a cool-down with his skiing artists. Brenda glides up and spins a few jigs, twirling the scooter's front bow on the cobblestones and making zigzags as Marvin and his crew gaze bewildered, with Brenda wrapped in a mist of steam-engine fog. Marvin is captivated as Brenda twirls another jig. Tossing off her monocle, she prances out of the mist of fog, wide-eyed, and dances up to Marvin, as the crew rents off. Winking, Brenda skips up beside Marvin, who pouts. They're at a platform overlooking the forest; he grins and gazes at her. They swap a fleeting smile and link their fingers around one another. Gretchen waves up her foot to cheer, and Brenda and Marvin hug excitedly as Gretchen winks at her fellow artists. They all lift their easels and swoon along with the team, with the vast forest curving across beyond. Brenda reaches over and secures her robe to ensure she's not unveiling herself. Outside the charity shop, Hank's with Mei-Lin, who arranges through books."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Carl lies unconscious in a hospital bed after a car accident, with Peter and Rooney by his side. After waking, Carl, wearing a hospital gown, escapes by stealing Lee's Ducati bike, performing stunts through town. He rides dangerously, weaving through traffic and arriving at an observatory where Allison warms up with photographers. Carl impresses them with bike stunts, creating smoke, then approaches Allison. They kiss passionately, attracting the attention of photographers who capture the moment. Carl checks his gown to ensure he's not exposed. Nearby, Norm and Soo-Mi sort clothes outside a homeless shelter."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Outside the homeless shelter Norm's with SooMi who sorts through clothes Carl reaches round and grabs his gown to make sure he's not exposing himself  They all aim their cameras and snap away at the couple with the vast city spreading out beyond  Reggie holds up his hand to apologize and Carl and Allison kiss passionately as Reggie glances at his fellow photographers  They share a lingering kiss and wrap their arms around each other  she smiles and looks at him  They're at a viewpoint overlooking the city  Grinning Carl runs up next to Allison who frowns  Taking off his helmet he strides out of the cloud of smoke heavybrowed and walks up to Allison as the group jog off  Allison is transfixed as Carl does another donut  Carl rides up and does a few donuts spinning the bike's back wheel on the tarmac and turning circles as Allison and her group stare incredulously with Carl enveloped in a cloud of burntrubber smoke  He rides up to the domed observatory where Allison is doing a warmup with her jogging photographers  His gown has two ties at the back above the waist and the gown billows revealing his bare backside  He speeds along a dual carriageway his spotted hospital gown flapping in the breeze keeping his head low and his arms bent as he rides the Ducati which is a cross between a trail bike and a road bike  The car passes and Carl wheelies off and back on two wheels weaves through the traffic  A car pulls out ahead and Carl pulls on the brakes so hard the back wheel flips up as he slows down  The bike's front wheel drops down and Carl speeds through town weaving precariously through traffic and hopping onto a pavement as pedestrians run for cover  He rides up next to a UPS van and the driver looks out and sees the Ducati's front wheel waggling about in midair  Up on the back wheel Carl crashes through a barrier and heads out of the hospital car park  Lee's Ducati bike puts a helmet on pulls a wheelie and whizzes off  Carl heads out runs to an elevator as Lee steps out and still in his hospital gown revs  Wearing a hospital gown Terrence goes and Rooney gets into the bed and shushes Peter  Terrence pulls back a curtain and Carl goes while Peter looks at Terrence  The nurse walks off and Rooney watches her go as Carl stirs and looks fearful  A pretty nurse dressed in blue takes his pulse while Peter and Rooney sit beside the bed with Rooney having a snack and Peter holding a drink  Carl lies unconscious in a hospital bed with grazes on his face  A car plows into the side of them "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Carl lies unconscious in a hospital bed with grazes on his face A car plows into the side of them The nurse walks off and Rooney watches her go as Carl stirs and looks fearful A pretty nurse dressed in blue takes his pulse while Peter and Rooney sit beside the bed with Rooney having a snack and Peter holding a drink Wearing a hospital gown Terrence goes and Rooney gets into the bed and shushes Peter Terrence pulls back a curtain and Carl goes while Peter looks at Terrence Lee's Ducati bike puts a helmet on pulls a wheelie and whizzes off Carl heads out runs to an elevator as Lee steps out and still in his hospital gown revs Carl crashes through a barrier and heads out of the hospital car park Up on the back wheel The bike's front wheel drops down and Carl speeds through town weaving precariously through traffic and hopping onto a pavement as pedestrians run for cover He rides up next to a UPS van and the driver looks out and sees the Ducati's front wheel waggling about in midair The car passes and Carl wheelies off and back on two wheels weaves through the traffic A car pulls out ahead and Carl pulls on the brakes so hard the back wheel flips up as he slows down His gown has two ties at the back above the waist and the gown billows revealing his bare backside He speeds along a dual carriageway his spotted hospital gown flapping in the breeze keeping his head low and his arms bent as he rides the Ducati which is a cross between a trail bike and a road bike Carl rides up and does a few donuts spinning the bike's back wheel on the tarmac and turning circles as Allison and her group stare incredulously with Carl enveloped in a cloud of burntrubber smoke He rides up to the domed observatory where Allison is doing a warmup with her jogging photographers Taking off his helmet he strides out of the cloud of smoke heavybrowed and walks up to Allison as the group jog off Allison is transfixed as Carl does another donut They are at a viewpoint overlooking the city Grinning Carl runs up next to Allison who frowns They share a lingering kiss and wrap their arms around each other she smiles and looks at him They all aim their cameras and snap away at the couple with the vast city spreading out beyond Reggie holds up his hand to apologize and Carl and Allison kiss passionately as Reggie glances at his fellow photographers Outside the homeless shelter Norm's with SooMi who sorts through clothes Carl reaches round and grabs his gown to make sure he is not exposing himself"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "His gown has two ties at the back above the waist and the gown billows revealing his bare backside  He rides up to the domed observatory where Allison is doing a warmup with her jogging photographers  Carl rides up and does a few donuts spinning the bike's back wheel on the tarmac and turning circles as Allison and her group stare incredulously with Carl enveloped in a cloud of burntrubber smoke  Allison is transfixed as Carl does another donut  Taking off his helmet he strides out of the cloud of smoke heavybrowed and walks up to Allison as the group jog off  Grinning Carl runs up next to Allison who frowns  They're at a viewpoint overlooking the city  she smiles and looks at him  They share a lingering kiss and wrap their arms around each other  Reggie holds up his hand to apologize and Carl and Allison kiss passionately as Reggie glances at his fellow photographers  They all aim their cameras and snap away at the couple with the vast city spreading out beyond  Carl reaches round and grabs his gown to make sure he's not exposing himself  Outside the homeless shelter Norm's with SooMi who sorts through clothes A car plows into the side of them  Carl lies unconscious in a hospital bed with grazes on his face  A pretty nurse dressed in blue takes his pulse while Peter and Rooney sit beside the bed with Rooney having a snack and Peter holding a drink  The nurse walks off and Rooney watches her go as Carl stirs and looks fearful  Terrence pulls back a curtain and Carl goes while Peter looks at Terrence  Wearing a hospital gown Terrence goes and Rooney gets into the bed and shushes Peter  Carl heads out runs to an elevator as Lee steps out and still in his hospital gown revs  Lee's Ducati bike puts a helmet on pulls a wheelie and whizzes off  Up on the back wheel Carl crashes through a barrier and heads out of the hospital car park  He rides up next to a UPS van and the driver looks out and sees the Ducati's front wheel waggling about in midair  The bike's front wheel drops down and Carl speeds through town weaving precariously through traffic and hopping onto a pavement as pedestrians run for cover  A car pulls out ahead and Carl pulls on the brakes so hard the back wheel flips up as he slows down  The car passes and Carl wheelies off and back on two wheels weaves through the traffic  He speeds along a dual carriageway his spotted hospital gown flapping in the breeze keeping his head low and his arms bent as he rides the Ducati which is a cross between a trail bike and a road bike "
        }
      ]
    }
  ]
}