{
  "ground_truth": "The rippling waters of Hogwarts' lake are surrounded by dark mountains, and on the far side, a white marble tomb on a tiny island has a large marble block that slides back as two supports beneath it tumble away. Dark Lord Voldemort leans down into the tomb, gazes at the black Elder Wand in his hand, and thrusts up his arm, causing a massive force of energy to shoot from the tip of the wand, illuminating the dark sky. Hovering Dementors, with trailing, tattered black robes, encircle Hogwarts as Severus Snape, in a black tunic and gown, stands in an upper archway gazing out at the mountains shrouded in mist. Subdued students in regimented ranks stride across the courtyard, and Snape watches them with a somber expression. The inscription on the gravestone reads while Harry Potter kneels at the foot of the grave, looking into a piece of broken mirror, where he sees himself reflected, then a face other than his own. The grave stands amongst sand dunes behind a small house, and Shell cottage faces a white beach with a sea beyond. Inside, Hermione Granger and Ron Weasley sit in the lounge of the cottage, which is the home of Ron's brother, Bill, and sister-in-law Fleur. Luna Lovegood saunters up to a set of hanging chimes while Bill is in the kitchen, glancing at Fleur as Luna looks at the chimes. Harry strides in and faces Bill as Griphook, who has pointed ears and a long beaky nose, sits in an armchair with his hands clasped together and eyes closed. Bill shows Harry, Hermione, and Ron into the goblin's room, where Griphook, hands still clasped, stares ahead with his mouth firmly closed. Harry crosses to the window and looks out as the goblin grips the arms of the chair, his long filthy pointed nails visible before he clasps his hands again, staring at Harry. Harry looks at the sword of Gryffindor leaning against the wall while Griphook sits back in his chair, takes a deep breath, and again clasps his hands together as his eyes flick to the sword. He points at it, and Harry looks back at the sword. Downstairs in the kitchen, as Hermione, Ron, and Harry come out of the goblin's room, they stop on the landing, and Fleur shows them into a room where the old wand maker sits by a window, looking up at Harry. He hands a curved wand to Ollivander, who examines it closely as Harry passes him a plain, straight wand. Ollivander raises the wand tip to his left ear, turns it in his fingers, and gives the wand back to Harry. The old man leans forward, Ollivander looks away, eases back a little, his eyes widening as he stares solemnly at Harry. Harry gets up, and they leave as Hermione holds a long strand of curling, black hair.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The undulating waters of Hogwarts' lagoon are encircled by shadowy mountains, and on the distant side, a white marble mausoleum on a miniature islet has a large marble slab that glides backward as two supports underneath it topple away. Dark Lord Voldemort bends down into the mausoleum, stares at the black Elder Wand in his grasp, and thrusts up his arm, causing a vast force of energy to burst from the tip of the wand, illuminating the shadowy sky. Floating Dementors, with trailing, tattered black garments, surround Hogwarts as Severus Snape, in a black tunic and robe, stands in an upper archway staring out at the mountains covered in mist. Subdued pupils in regimented rows stride across the courtyard, and Snape observes them with a grave expression. The inscription on the headstone reads while Harry Potter kneels at the foot of the grave, peering into a piece of shattered mirror, where he sees himself reflected, then a visage other than his own. The grave stands among sand dunes behind a small house, and Shell cottage faces a white shore with an ocean beyond. Inside, Hermione Granger and Ron Weasley sit in the parlor of the cottage, which is the home of Ron's sibling, Bill, and sister-in-law Fleur. Luna Lovegood strolls up to a set of hanging chimes while Bill is in the kitchen, glancing at Fleur as Luna gazes at the chimes. Harry strides in and faces Bill as Griphook, who has pointed ears and a long beaky nose, sits in an armchair with his hands clasped together and eyes closed. Bill shows Harry, Hermione, and Ron into the goblin's chamber, where Griphook, hands still clasped, gazes forward with his mouth firmly closed. Harry crosses to the window and looks out as the goblin grips the arms of the chair, his long filthy pointed nails visible before he clasps his hands again, staring at Harry. Harry looks at the sword of Gryffindor leaning against the wall while Griphook reclines in his chair, takes a deep breath, and again clasps his hands together as his eyes flick to the sword. He points at it, and Harry looks back at the sword. Downstairs in the kitchen, as Hermione, Ron, and Harry exit the goblin's chamber, they pause on the landing, and Fleur shows them into a room where the elderly wand maker sits by a window, looking up at Harry. He hands a curved wand to Ollivander, who examines it closely as Harry passes him a plain, straight wand. Ollivander raises the wand tip to his left ear, turns it in his fingers, and gives the wand back to Harry. The elderly man leans forward, Ollivander looks away, eases back a little, his eyes widening as he stares solemnly at Harry. Harry rises, and they depart as Hermione holds a long strand of curling, black hair."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The rippling waters of Hogwarts' lake are encircled by dark mountains, and on the far side, a large marble block is slid back on a white marble tomb on a tiny island as it tumbles away beneath two supports. The tomb is leaned into by Dark Lord Voldemort, who gazes at the black Elder Wand in his hand, and his arm is thrust up by him, causing a massive force of energy to shoot from the tip of the wand, illuminating the dark sky. Hogwarts is encircled by hovering Dementors, with trailing, tattered black robes, and Severus Snape, in a black tunic and gown, stands in an upper archway, gazing out at the mist-shrouded mountains. Ranks of subdued students stride across the courtyard, and they are watched by Snape with a somber expression. Harry Potter kneels at the foot of the grave while the inscription is read on the gravestone by him, looking into a piece of broken mirror, where he reflects himself, then a face other than his own is seen. The grave is among sand dunes behind a small house, and a white beach with a sea beyond is faced by Shell cottage. In the lounge of the cottage, Hermione Granger and Ron Weasley sit, which is the home of Ron's brother, Bill, and his sister-in-law Fleur. A set of hanging chimes is sauntered up to by Luna Lovegood, while Bill glances at Fleur in the kitchen as the chimes are looked at by Luna. Harry strides in and is faced by Bill as Griphook, who has pointed ears and a long beaky nose, sits in an armchair with his hands clasped together and eyes closed. Harry, Hermione, and Ron are shown into the goblin's room by Bill, where Griphook, hands still clasped, stares ahead with his mouth firmly closed. The window is crossed to by Harry, and he looks out as the goblin grips the arms of the chair, his long filthy pointed nails visible before his hands are clasped again, staring at Harry. The sword of Gryffindor leaning against the wall is looked at by Harry while Griphook sits back in his chair, takes a deep breath, and his hands are again clasped together as his eyes flick to the sword. It is pointed at by him, and the sword is looked back at by Harry. In the kitchen downstairs, as the goblin's room is exited by Hermione, Ron, and Harry, they are stopped on the landing, and a room is shown to them by Fleur where the old wand maker sits by a window, looking up at Harry. A curved wand is handed to Ollivander by him, who examines it closely as a plain, straight wand is passed to Ollivander by Harry. The wand tip is raised to his left ear by Ollivander, who turns it in his fingers, and it is given back to Harry by him. The old man leans forward, and Harry is solemnly stared at by Ollivander, who looks away, eases back a little, his eyes widening. Harry gets up, and they are left by him as a long strand of curling, black hair is held by Hermione."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The rippling waters of Hogwarts' lake are bordered by dark mountains, with a white marble tomb on a tiny island. A large marble block slides back as two supports beneath it collapse. Dark Lord Voldemort leans into the tomb, gazes at the black Elder Wand, and raises his arm, releasing a massive energy force that lights up the dark sky. Hovering Dementors in tattered black robes encircle Hogwarts as Severus Snape, in a black tunic and gown, stands in an upper archway, gazing at the mist-shrouded mountains. Subdued students march across the courtyard, and Snape watches them somberly. The gravestone inscription is visible while Harry Potter kneels at the grave, looking into a broken mirror, seeing his reflection and another face. The grave is among sand dunes behind a small house, with Shell Cottage facing a white beach and sea. Inside, Hermione Granger and Ron Weasley sit in the lounge of Ron's brother Bill and sister-in-law Fleur's home. Luna Lovegood approaches hanging chimes while Bill glances at Fleur. Harry enters and faces Bill as Griphook, with pointed ears and a beaky nose, sits with clasped hands and closed eyes. Bill shows Harry, Hermione, and Ron into the goblin's room, where Griphook stares ahead, hands clasped. Harry looks out the window as Griphook grips the chair arms, his pointed nails visible, then clasps his hands again, staring at Harry. Harry notices the sword of Gryffindor leaning against the wall while Griphook takes a deep breath, points at the sword, and Harry looks back at it. Downstairs, Hermione, Ron, and Harry leave the goblin's room, stop on the landing, and Fleur shows them to a room where the old wand maker sits by a window, looking at Harry. He hands a curved wand to Ollivander, who examines it as Harry gives him a plain wand. Ollivander raises the wand to his ear, turns it, and returns it to Harry. The old man leans forward, Ollivander looks away, eases back, eyes widening as he solemnly stares at Harry. Harry rises, and they leave as Hermione holds a long strand of curling black hair."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The rippling waters of Hogwarts' lake, surrounded by dark mountains, feature a white marble tomb on a tiny island. Dark Lord Voldemort leans into the tomb, holding the black Elder Wand, and releases energy that lights up the sky. Dementors encircle Hogwarts as Severus Snape, in black attire, watches from an archway. Students march across the courtyard, and Snape observes them somberly. Harry Potter kneels at a grave, seeing his reflection and another face in a broken mirror. The grave is among sand dunes near Shell Cottage, facing a beach. Inside, Hermione Granger and Ron Weasley sit in the lounge of Ron's brother Bill and sister-in-law Fleur's home. Luna Lovegood approaches chimes while Bill glances at Fleur. Harry enters, facing Bill as Griphook, with pointed ears and a beaky nose, sits with clasped hands. Bill shows Harry, Hermione, and Ron to Griphook's room, where the goblin stares at Harry and the sword of Gryffindor. Griphook points at the sword, and Harry looks back. Downstairs, Hermione, Ron, and Harry meet the old wand maker, who examines a curved wand and returns it to Harry. Ollivander's eyes widen as he solemnly stares at Harry. They leave as Hermione holds a strand of black hair."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The rippling, undulating waters of the expansive lake at Hogwarts are encircled by looming, dark mountains, creating a dramatic and mysterious backdrop. On the distant far side of the lake, a pristine white marble tomb rests on a tiny, secluded island. This tomb features a large, imposing marble block that slides back smoothly as two supports beneath it collapse and tumble away. The ominous Dark Lord Voldemort leans down into the tomb, his gaze fixed intently on the black Elder Wand he holds in his hand. With a swift, decisive motion, he thrusts his arm upward, causing a massive, powerful force of energy to shoot forth from the wand's tip, brilliantly illuminating the dark, foreboding sky above. Hovering Dementors, clad in trailing, tattered black robes, encircle the castle of Hogwarts ominously, while Severus Snape, dressed in a somber black tunic and gown, stands in an upper archway, gazing out at the mist-shrouded mountains in the distance. Subdued students, moving in regimented ranks, stride purposefully across the courtyard, and Snape watches them with a somber, contemplative expression on his face. The inscription on the gravestone is visible as Harry Potter kneels solemnly at the foot of the grave, peering into a piece of broken mirror. In the reflection, he sees not only himself but also a face other than his own. The grave is situated among sand dunes behind a small, quaint house, and Shell Cottage faces a pristine white beach with the vast sea stretching beyond. Inside the cozy cottage, Hermione Granger and Ron Weasley sit together in the lounge, which is the home of Ron's brother, Bill, and his sister-in-law, Fleur. Luna Lovegood saunters up to a set of hanging chimes, her attention captured by their gentle sound, while Bill is in the kitchen, casting a glance at Fleur as Luna examines the chimes. Harry strides in with purpose and faces Bill, while Griphook, who has pointed ears and a long, beaky nose, sits in an armchair with his hands clasped together and eyes closed in contemplation. Bill shows Harry, Hermione, and Ron into the goblin's room, where Griphook, hands still clasped, stares ahead with his mouth firmly closed, maintaining a stoic demeanor. Harry crosses to the window and looks out thoughtfully as the goblin grips the arms of the chair, his long, filthy pointed nails visible before he clasps his hands together once more, staring intently at Harry. Harry's gaze shifts to the sword of Gryffindor, which leans against the wall, while Griphook sits back in his chair, takes a deep, steadying breath, and again clasps his hands together as his eyes flick to the sword. He points at it, and Harry's attention returns to the sword. Downstairs in the kitchen, as Hermione, Ron, and Harry emerge from the goblin's room, they pause on the landing, and Fleur shows them into a room where the old wand maker sits by a window, looking up at Harry with a discerning eye. He hands a curved wand to Ollivander, who examines it closely and carefully as Harry passes him a plain, straight wand. Ollivander raises the wand tip to his left ear, turns it thoughtfully in his fingers, and then gives the wand back to Harry. The old man leans forward slightly, and Ollivander looks away, easing back a little, his eyes widening as he stares solemnly at Harry. Harry rises to his feet, and they leave the room as Hermione holds a long strand of curling, black hair in her hand."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The vast and expansive lake at Hogwarts presents a mesmerizing scene with its rippling and undulating waters. These waters are embraced by the towering, dark mountains that create a dramatic and mysterious backdrop, enhancing the aura of the place. On the far, distant side of the lake, there is a tiny, secluded island which houses a pristine white marble tomb that stands out strikingly. This tomb has an impressive large marble block, imposing in its presence, which smoothly slides back with a fluid motion as the supports beneath it collapse and tumble away into nothingness. The ominous figure of Dark Lord Voldemort leans down into this tomb, his gaze unwavering and intently fixed on the mysterious black Elder Wand that he holds firmly in his hand. With a swift and decisive motion, he thrusts his arm upward, unleashing a massive and powerful surge of energy that erupts forcefully from the wand's tip, brilliantly illuminating the dark and foreboding sky above. The sky is filled with hovering Dementors, draped in trailing, tattered black robes, encircling the castle of Hogwarts ominously and intensifying the atmosphere. Meanwhile, Severus Snape, dressed in a somber black tunic and gown, stands in an upper archway, his eyes gazing out at the mist-shrouded and distant mountains. The subdued students, moving in regimented ranks, stride purposefully across the courtyard, as Snape watches them with a somber, contemplative expression etched on his face. At another location, the inscription on the gravestone becomes visible as Harry Potter kneels solemnly at the foot of the grave, peering deeply into a small piece of broken mirror. In the reflection, he sees not only his own face but also another face, different from his own. The grave is located among the sand dunes behind a small, quaint house, where Shell Cottage faces a pristine white beach with the vast sea stretching out into the horizon. Inside the cozy cottage, Hermione Granger and Ron Weasley sit comfortably together in the lounge, which belongs to Ron's brother, Bill, and his sister-in-law, Fleur. Luna Lovegood wanders up to a set of hanging chimes, her attention drawn by their gentle and soothing sound. Meanwhile, Bill is in the kitchen, casting a glance toward Fleur as Luna examines the chimes with curiosity. Harry strides into the room with purpose, facing Bill, while Griphook sits nearby in an armchair, his pointed ears and long, beaky nose distinctive features. He sits with his hands clasped together, his eyes closed in deep contemplation. Bill shows Harry, Hermione, and Ron into the goblin's room, where Griphook, with hands still clasped, stares ahead with his mouth firmly closed, maintaining a stoic and unmoved demeanor. Harry crosses to the window and gazes out thoughtfully, while the goblin grips the arms of the chair, his long and filthy pointed nails visible, before he clasps his hands together once more, staring intently at Harry. Harry's gaze shifts toward the sword of Gryffindor, which leans against the wall, and as Griphook sits back in his chair, he takes a deep, steadying breath. Again, he clasps his hands together and his eyes flick to the sword, pointing at it as Harry's attention returns to the sword. Downstairs in the kitchen, as Hermione, Ron, and Harry emerge from the goblin's room, they pause momentarily on the landing. Fleur then shows them into a room where the old wand maker is seated by a window, looking up at Harry with a discerning and knowing eye. He hands a curved wand to Ollivander, who examines it closely and carefully, while Harry passes him a plain, straight wand in exchange. Ollivander raises the wand tip to his left ear, turning it thoughtfully in his fingers, before he returns the wand back to Harry. The old man leans forward slightly, and Ollivander looks away, easing back a little as his eyes widen, staring solemnly at Harry. Rising to his feet, Harry leaves the room, followed by the others, as Hermione holds a long strand of curling, black hair gently in her hand."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The rippling waters of Hogwarts' lake gently lap against the shore, surrounded by the imposing presence of dark mountains that loom in the distance. On the far side of the lake, a white marble tomb rests on a tiny island, its surface gleaming under the dim light. As the large marble block atop the tomb begins to shift, it slides back smoothly, revealing the interior as two supports beneath it give way and tumble aside. Dark Lord Voldemort, with a menacing air, leans down into the now-open tomb, his eyes fixated on the black Elder Wand that he holds firmly in his hand. With a deliberate motion, he thrusts his arm upward, and a massive force of energy erupts from the tip of the wand, casting a brilliant light that pierces the dark sky. Meanwhile, hovering Dementors, their tattered black robes trailing behind them, encircle the castle of Hogwarts, creating an ominous atmosphere. Severus Snape, clad in a black tunic and gown, stands in an upper archway of the castle, his gaze fixed on the mist-shrouded mountains in the distance. Below, subdued students move in regimented ranks across the courtyard, their footsteps echoing in the silence as Snape watches them with a somber expression. The inscription on the gravestone is visible as Harry Potter kneels at the foot of the grave, his eyes focused on a piece of broken mirror in his hand. In the reflection, he first sees his own face, then another face that is not his own. The grave is situated among sand dunes behind a small house, with Shell Cottage facing a white beach and the vast sea beyond. Inside the cozy lounge of the cottage, Hermione Granger and Ron Weasley sit together, the home belonging to Ron's brother, Bill, and sister-in-law, Fleur. Luna Lovegood, with her usual whimsical demeanor, saunters up to a set of hanging chimes, her attention captured by their gentle sound, while Bill, in the kitchen, glances at Fleur and then at Luna. Harry strides into the room with purpose, facing Bill as Griphook, the goblin with pointed ears and a long beaky nose, sits in an armchair, his hands clasped together and eyes closed in contemplation. Bill leads Harry, Hermione, and Ron into the goblin's room, where Griphook, still with his hands clasped, stares ahead with his mouth firmly closed. Harry crosses to the window, peering out as the goblin grips the arms of the chair, his long, filthy pointed nails visible before he clasps his hands again, his gaze fixed on Harry. Harry's eyes shift to the sword of Gryffindor leaning against the wall, while Griphook sits back in his chair, takes a deep breath, and once more clasps his hands together, his eyes flicking to the sword. He points at it, prompting Harry to look back at the sword. Downstairs in the kitchen, as Hermione, Ron, and Harry emerge from the goblin's room, they pause on the landing, and Fleur guides them into another room where the old wand maker sits by a window, his eyes lifting to meet Harry's. He hands a curved wand to Ollivander, who examines it closely, turning it in his fingers, before Harry passes him a plain, straight wand. Ollivander raises the wand tip to his left ear, turning it thoughtfully before handing it back to Harry. The old man leans forward slightly, and Ollivander looks away, easing back a little, his eyes widening as he stares solemnly at Harry. Harry rises from his seat, and they all leave the room, with Hermione holding a long strand of curling, black hair in her hand."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The rippling waters of Hogwarts' lake, surrounded by dark mountains, frame a white marble tomb on a tiny island. As the large marble block slides back, Dark Lord Voldemort leans into the tomb, retrieves the black Elder Wand, and unleashes a massive energy force into the sky. Meanwhile, hovering Dementors encircle Hogwarts, and Severus Snape, in a black tunic and gown, watches the mist-shrouded mountains from an upper archway. Subdued students stride across the courtyard in regimented ranks under Snape's somber gaze. At a grave among sand dunes behind a small house, Harry Potter kneels, looking into a broken mirror that reflects his face and another. Shell Cottage, facing a white beach and sea, houses Hermione Granger and Ron Weasley in the lounge, while Luna Lovegood examines hanging chimes. Bill, in the kitchen, glances at Fleur as Harry enters and faces Griphook, who sits with clasped hands and closed eyes. Bill leads Harry, Hermione, and Ron to Griphook's room, where the goblin stares ahead, occasionally glancing at the sword of Gryffindor. Harry observes the sword as Griphook points at it, then looks back at the goblin. Downstairs, Hermione, Ron, and Harry leave the goblin's room and meet Fleur, who shows them to a room where the old wand maker sits by a window. Harry hands a curved wand to Ollivander, who examines it, then returns it to Harry after inspecting a plain, straight wand. Ollivander's eyes widen as he solemnly regards Harry, who rises to leave with Hermione holding a long strand of curling, black hair."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The rippling waters of Hogwarts' lake, known for its giant squid and merpeople, are surrounded by dark mountains that have guarded the castle for centuries, and on the far side, a white marble tomb on a tiny island holds the resting place of Albus Dumbledore. A large marble block slides back as two supports beneath it tumble away. Dark Lord Voldemort, who has recently regained a physical form after many years, leans down into the tomb, gazes at the black Elder Wand, a legendary wand with unparalleled power believed to make its wielder invincible, in his hand, and thrusts up his arm, causing a massive force of energy to shoot from the tip of the wand, illuminating the dark sky ominously. Hovering Dementors, dreaded creatures known for draining happiness and causing despair, with trailing, tattered black robes, encircle Hogwarts as Severus Snape, the headmaster of Hogwarts and a double agent serving both Voldemort and the Order of the Phoenix, in a black tunic and gown, stands in an upper archway gazing out at the mountains shrouded in mist. Subdued students in regimented ranks stride across the courtyard, and Snape watches them with a somber expression, aware of his precarious position. The inscription on the gravestone reads a final farewell to Dobby the house-elf, who gave his life to save Harry and his friends, while Harry Potter kneels at the foot of the grave, looking into a piece of broken mirror, once a part of the two-way mirror given to him by Sirius Black, where he sees himself reflected, then a face other than his own. The grave stands amongst sand dunes behind a small house, and Shell Cottage, a safe house for members of the Order of the Phoenix, faces a white beach with a sea beyond. Inside, Hermione Granger and Ron Weasley sit in the lounge of the cottage, which is the home of Ron's brother, Bill, who works for Gringotts Bank, and sister-in-law Fleur, a former Triwizard Tournament competitor. Luna Lovegood, known for her quirky personality and deep belief in mystical creatures, saunters up to a set of hanging chimes while Bill is in the kitchen, glancing at Fleur, a part-Veela known for her beauty and bravery, as Luna looks at the chimes. Harry strides in and faces Bill as Griphook, a goblin who once worked at Gringotts Bank and is familiar with the bank's formidable security measures, who has pointed ears and a long beaky nose, sits in an armchair with his hands clasped together and eyes closed. Bill shows Harry, Hermione, and Ron into the goblin's room, where Griphook, hands still clasped, stares ahead with his mouth firmly closed, contemplating his next move. Harry crosses to the window and looks out as the goblin grips the arms of the chair, his long filthy pointed nails, indicative of his stubborn nature and lengthy travels, visible before he clasps his hands again, staring at Harry intently. Harry looks at the sword of Gryffindor, a goblin-made sword that can destroy Horcruxes, leaning against the wall while Griphook sits back in his chair, takes a deep breath, and again clasps his hands together as his eyes flick to the sword, coveting its craftsmanship. He points at it, and Harry looks back at the sword, realizing its importance. Downstairs in the kitchen, as Hermione, Ron, and Harry come out of the goblin's room, they stop on the landing, and Fleur shows them into a room where the old wand maker, Garrick Ollivander, who once helped Harry find his first wand, sits by a window, looking up at Harry. He hands a curved wand to Ollivander, who examines it closely with the expertise of a master wandmaker as Harry passes him a plain, straight wand. Ollivander raises the wand tip to his left ear, turns it in his fingers, and gives the wand back to Harry, noting the wand's allegiance. The old man leans forward, Ollivander looks away, eases back a little, his eyes widening as he stares solemnly at Harry, aware of the dangerous path ahead. Harry gets up, and they leave as Hermione holds a long strand of curling, black hair, belonging to Bellatrix Lestrange, which will be significant for their plan."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The rippling waters of Hogwarts' lake are surrounded by dark mountains and on the far side a white marble tomb on a tiny island has a large marble block that slides back as two supports beneath it tumble away. Dark Lord Voldemort leans down into the tomb gazes at the black Elder Wand in his hand and thrusts up his arm causing a massive force of energy to shoot from the tip of the wand illuminating the dark sky. Hovering Dementors with trailing tattered black robes encircle Hogwarts as Severus Snape in a black tunic and gown stands in an upper archway gazing out at the mountains shrouded in mist. Subdued students in regimented ranks stride across the courtyard and Snape watches them with a somber expression. The inscription on the gravestone reads while Harry Potter kneels at the foot of the grave looking into a piece of broken mirror where he sees himself reflected then a face other than his own. The grave stands amongst sand dunes behind a small house and She Will cottage faces a white beach with a sea beyond. Inside. Hermione Granger and Ron Weasley sit in the lounge of the cottage which is the home of Ron's brother Bill and sisterinlaw Fleur. Luna Lovegood saunters up to a set of hanging chimes while Bill is in the kitchen glancing at Fleur as Luna looks at the chimes. Harry strides in and faces Bill as Griphook who has pointed ears and a long beaky nose sits in an armchair with his hands clasped together and eyes closed. Bill shows Harry Hermione and Ron into the goblin's room where Griphook hands still clasped stares ahead with his mouth firmly closed. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Harry crosses to the window and looks out as the goblin grips the arms of the chair his long filthy pointed nails visible before he clasps his hands again staring at Harry. Harry looks at the sword of Gryffindor leaning against the wall while Griphook sits back in his chair takes a deep breath and again clasps his hands together as his eyes flick to the sword. He points at it and Harry looks back at the sword. Downstairs in the kitchen as Hermione. Ron and Harry come out of the goblin's room. they stop on the landing and Fleur shows them into a room where the old wand maker sits by a window looking up at Harry. He hands a curved wand to Ollivander who examines it closely as Harry passes him a plain straight wand. Ollivander raises the wand tip to his left ear turns it in his fingers and gives the wand back to Harry. The old man leans forward. Ollivander looks away eases back a little his eyes widening as he stares solemnly at Harry. Harry gets up and they leave as Hermione holds a long strand of curling black hair."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The rippling waters of Hogwarts' lake are surrounded by dark mountains and on the far side a white marble tomb on a tiny island has a large marble block that slides back as two supports beneath it tumble away. Dark Lord Voldemort leans down into the tomb gazes at the black Elder Wand in his hand and thrusts up his arm causing a massive force of energy to shoot from the tip of the wand illuminating the dark sky. Hovering Dementors with trailing tattered black robes encircle Hogwarts as Severus Snape in a black tunic and gown stands in an upper archway gazing out at the mountains shrouded in mist. Subdued students in regimented ranks stride across the courtyard and Snape watches them with a somber expression. The inscription on the gravestone reads while Harry Potter kneels at the foot of the grave looking into a piece of broken mirror where he sees himself reflected then a face other than his own. The grave stands amongst sand dunes behind a small house and She Will cottage faces a white beach with a sea beyond. Inside. Hermione Granger and Ron Weasley sit in the lounge of the cottage which is the home of Ron's brother Bill and sisterinlaw Fleur. Luna Lovegood saunters up to a set of hanging chimes while Bill is in the kitchen glancing at Fleur as Luna looks at the chimes. Harry strides in and faces Bill as Griphook who has pointed ears and a long beaky nose sits in an armchair with his hands clasped together and eyes closed. Bill shows Harry Hermione and Ron into the goblin's room where Griphook hands still clasped stares ahead with his mouth firmly closed. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Harry crosses to the window and looks out as the goblin grips the arms of the chair his long filthy pointed nails visible before he clasps his hands again staring at Harry. Harry looks at the sword of Gryffindor leaning against the wall while Griphook sits back in his chair takes a deep breath and again clasps his hands together as his eyes flick to the sword. He points at it and Harry looks back at the sword. Downstairs in the kitchen as Hermione. Ron and Harry come out of the goblin's room. they stop on the landing and Fleur shows them into a room where the old wand maker sits by a window looking up at Harry. He hands a curved wand to Ollivander who examines it closely as Harry passes him a plain straight wand. Ollivander raises the wand tip to his left ear turns it in his fingers and gives the wand back to Harry. The old man leans forward. Ollivander looks away eases back a little his eyes widening as he stares solemnly at Harry. Harry gets up and they leave as Hermione holds a long strand of curling black hair."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The rippling waters of Hogwarts' lake are surrounded by dark mountains and on the far side a white marble tomb on a tiny island has a large marble block that slides back as two supports beneath it tumble away. Dark Lord Voldemort leans down into the tomb gazes at the black Elder Wand in his hand and thrusts up his arm causing a massive force of energy to shoot from the tip of the wand illuminating the dark sky. Hovering Dementors with trailing tattered black robes encircle Hogwarts as Severus Snape in a black tunic and gown stands in an upper archway gazing out at the mountains shrouded in mist. Subdued students in regimented ranks stride across the courtyard and Snape watches them with a somber expression. The inscription on the gravestone reads while Harry Potter kneels at the foot of the grave looking into a piece of broken mirror where he sees himself reflected then a face other than his own. The grave stands amongst sand dunes behind a small house and She Will cottage faces a white beach with a sea beyond. He hands a curved wand to Ollivander who examines it closely as Harry passes him a plain straight wand. Ollivander raises the wand tip to his left ear turns it in his fingers and gives the wand back to Harry. The old man leans forward. Ollivander looks away eases back a little his eyes widening as he stares solemnly at Harry. Harry gets up and they leave as Hermione holds a long strand of curling black hair."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The rippling waters of Hogwarts' lake are surrounded by dark mountains and on the far side a white marble tomb on a tiny island has a large marble block that slides back as two supports beneath it tumble away. Dark Lord Voldemort leans down into the tomb gazes at the black Elder Wand in his hand and thrusts up his arm causing a massive force of energy to shoot from the tip of the wand illuminating the dark sky. Hovering Dementors with trailing tattered black robes encircle Hogwarts as Severus Snape in a black tunic and gown stands in an upper archway gazing out at the mountains shrouded in mist. Ollivander looks away eases back a little his eyes widening as he stares solemnly at Harry. Harry gets up and they leave as Hermione holds a long strand of curling black hair."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The shimmering dunes of a Martian crater are surrounded by towering cliffs, and on the far side, a red brick hut on a tiny asteroid has a small granite slab that rotates forward as two anchors beneath it disintegrate. Light Emperor Jupiter bends down into the hut, squints at the crimson Cosmic Staff in his claw, and flings up his leg, triggering a tremendous burst of light to flare from the tip of the staff, illuminating the starry void. Floating Phantasms, with billowing, shredded robes of mist, surround Atlantis as Orion Nebula, in a scarlet vest and cape, perches in a lower gallery peering out at the cliffs draped in clouds. Disheartened wanderers in disorderly columns shuffle across the meadow, and Nebula observes them with a cheerful expression. The message on the plaque recites while Oliver Twilight crouches at the base of the marker, glancing into a shard of shattered glass, where he glimpses himself mirrored, then a visage unfamiliar. The marker rests amongst snowdrifts beneath a large manor, and Coral cove faces a black lagoon with an ocean beyond. Inside, Cordelia Starshine and Rodrick Gale lounge in the den of the manor, which is the abode of Rodrick's cousin, Ben, and cousin-in-law Fleur. Lucy Glowmoon strolls up to a set of dangling bells while Ben is in the parlor, peeking at Fleur as Lucy examines the bells. Oliver marches in and confronts Ben as Gremlin, who has floppy ears and a broad flat nose, reclines in a loveseat with his fingers intertwined and eyes open. Ben guides Oliver, Cordelia, and Rodrick into the fairy's chamber, where Gremlin, fingers still intertwined, peers forward with his lips tightly sealed. Oliver traverses to the skylight and peers out as the fairy clutches the arms of the loveseat, his short clean blunt nails exposed before he intertwines his fingers again, staring at Oliver. Oliver gazes at the shield of Capricorn leaning against the pillar while Gremlin relaxes in his loveseat, exhales slowly, and once more intertwines his fingers as his eyes dart to the shield. He gestures at it, and Oliver gazes back at the shield. Upstairs in the parlor, as Cordelia, Rodrick, and Oliver exit the fairy's chamber, they pause on the terrace, and Fleur guides them into a chamber where the young cane maker reclines by a skylight, looking up at Oliver. He presents a bent cane to Alchemist, who scrutinizes it carefully as Oliver hands him a narrow, curved cane. Alchemist lifts the cane tip to his right shoulder, spins it in his fingers, and gives the cane back to Oliver. The young craftsman bends backward, Alchemist turns away, shifts forward slightly, his eyes widening as he gazes joyfully at Oliver. Oliver stands up, and they depart as Cordelia holds a short strand of straight, white thread."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The serene Hogwarts lake, encircled by dark mountains, holds a white marble tomb on an island. Lord Voldemort extracts the Elder Wand from it, releasing a powerful energy burst into the sky. Dementors hover ominously, while Severus Snape watches somberly from an archway. Harry Potter kneels at a grave and sees a face in a broken mirror piece. Nearby, Shell Cottage sits by the sea, home to Ron's brother Bill and his wife Fleur. Inside, Ron, Hermione, and Luna Lovegood are present. Harry enters and confronts Bill while Griphook, a goblin with pointed ears, sits quietly. Harry regards the sword of Gryffindor as Griphook signals toward it. In the kitchen, Hermione, Ron, and Harry exit the goblin's room and meet Ollivander, the old wandmaker, who scrutinizes two wands, returning one to Harry. As Harry stands to leave, Hermione holds a strand of black hair."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Harry gets up and they leave as Hermione holds a long strand of curling black hair Ollivander looks away eases back a little his eyes widening as he stares solemnly at Harry  The old man leans forward  Ollivander raises the wand tip to his left ear turns it in his fingers and gives the wand back to Harry  He hands a curved wand to Ollivander who examines it closely as Harry passes him a plain straight wand  they stop on the landing and Fleur shows them into a room where the old wand maker sits by a window looking up at Harry  Ron and Harry come out of the goblin's room  Downstairs in the kitchen as Hermione  He points at it and Harry looks back at the sword  Harry looks at the sword of Gryffindor leaning against the wall while Griphook sits back in his chair takes a deep breath and again clasps his hands together as his eyes flick to the sword  Harry crosses to the window and looks out as the goblin grips the arms of the chair his long filthy pointed nails visible before he clasps his hands again staring at Harry  Bill shows Harry Hermione and Ron into the goblin's room where Griphook hands still clasped stares ahead with his mouth firmly closed  Harry strides in and faces Bill as Griphook who has pointed ears and a long beaky nose sits in an armchair with his hands clasped together and eyes closed  Luna Lovegood saunters up to a set of hanging chimes while Bill is in the kitchen glancing at Fleur as Luna looks at the chimes  Inside Hermione Granger and Ron Weasley sit in the lounge of the cottage which is the home of Ron's brother Bill and sisterinlaw Fleur  The grave stands amongst sand dunes behind a small house and Shell cottage faces a white beach with a sea beyond  The inscription on the gravestone reads while Harry Potter kneels at the foot of the grave looking into a piece of broken mirror where he sees himself reflected then a face other than his own  Subdued students in regimented ranks stride across the courtyard and Snape watches them with a somber expression  Hovering Dementors with trailing tattered black robes encircle Hogwarts as Severus Snape in a black tunic and gown stands in an upper archway gazing out at the mountains shrouded in mist  Dark Lord Voldemort leans down into the tomb gazes at the black Elder Wand in his hand and thrusts up his arm causing a massive force of energy to shoot from the tip of the wand illuminating the dark sky  The rippling waters of Hogwarts' lake are surrounded by dark mountains and on the far side a white marble tomb on a tiny island has a large marble block that slides back as two supports beneath it tumble away "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Dark Lord Voldemort leans down into the tomb gazes at the black Elder Wand in his hand and thrusts up his arm causing a massive force of energy to shoot from the tip of the wand illuminating the dark sky The rippling waters of Hogwarts' lake are surrounded by dark mountains and on the far side a white marble tomb on a tiny island has a large marble block that slides back as two supports beneath it tumble away Subdued students in regimented ranks stride across the courtyard and Snape watches them with a somber expression Hovering Dementors with trailing tattered black robes encircle Hogwarts as Severus Snape in a black tunic and gown stands in an upper archway gazing out at the mountains shrouded in mist The grave stands amongst sand dunes behind a small house and She Will cottage faces a white beach with a sea beyond The inscription on the gravestone reads while Harry Potter kneels at the foot of the grave looking into a piece of broken mirror where he sees himself reflected then a face other than his own Hermione Granger and Ron Weasley sit in the lounge of the cottage which is the home of Ron's brother Bill and sisterinlaw Fleur Inside Harry strides in and faces Bill as Griphook who has pointed ears and a long beaky nose sits in an armchair with his hands clasped together and eyes closed Luna Lovegood saunters up to a set of hanging chimes while Bill is in the kitchen glancing at Fleur as Luna looks at the chimes Harry crosses to the window and looks out as the goblin grips the arms of the chair his long filthy pointed nails visible before he clasps his hands again staring at Harry Bill shows Harry Hermione and Ron into the goblin's room where Griphook hands still clasped stares ahead with his mouth firmly closed He points at it and Harry looks back at the sword Harry looks at the sword of Gryffindor leaning against the wall while Griphook sits back in his chair takes a deep breath and again clasps his hands together as his eyes flick to the sword Ron and Harry come out of the goblin's room Downstairs in the kitchen as Hermione He hands a curved wand to Ollivander who examines it closely as Harry passes him a plain straight wand they stop on the landing and Fleur shows them into a room where the old wand maker sits by a window looking up at Harry The old man leans forward Ollivander raises the wand tip to his left ear turns it in his fingers and gives the wand back to Harry Harry gets up and they leave as Hermione holds a long strand of curling black hair Ollivander looks away eases back a little his eyes widening as he stares solemnly at Harry"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Harry looks at the sword of Gryffindor leaning against the wall while Griphook sits back in his chair takes a deep breath and again clasps his hands together as his eyes flick to the sword  He points at it and Harry looks back at the sword  Downstairs in the kitchen as Hermione  Ron and Harry come out of the goblin's room  they stop on the landing and Fleur shows them into a room where the old wand maker sits by a window looking up at Harry  He hands a curved wand to Ollivander who examines it closely as Harry passes him a plain straight wand  Ollivander raises the wand tip to his left ear turns it in his fingers and gives the wand back to Harry  The old man leans forward  Ollivander looks away eases back a little his eyes widening as he stares solemnly at Harry  Harry gets up and they leave as Hermione holds a long strand of curling black hair The rippling waters of Hogwarts' lake are surrounded by dark mountains and on the far side a white marble tomb on a tiny island has a large marble block that slides back as two supports beneath it tumble away  Dark Lord Voldemort leans down into the tomb gazes at the black Elder Wand in his hand and thrusts up his arm causing a massive force of energy to shoot from the tip of the wand illuminating the dark sky  Hovering Dementors with trailing tattered black robes encircle Hogwarts as Severus Snape in a black tunic and gown stands in an upper archway gazing out at the mountains shrouded in mist  Subdued students in regimented ranks stride across the courtyard and Snape watches them with a somber expression  The inscription on the gravestone reads while Harry Potter kneels at the foot of the grave looking into a piece of broken mirror where he sees himself reflected then a face other than his own  The grave stands amongst sand dunes behind a small house and Shell cottage faces a white beach with a sea beyond  Inside Hermione Granger and Ron Weasley sit in the lounge of the cottage which is the home of Ron's brother Bill and sisterinlaw Fleur  Luna Lovegood saunters up to a set of hanging chimes while Bill is in the kitchen glancing at Fleur as Luna looks at the chimes  Harry strides in and faces Bill as Griphook who has pointed ears and a long beaky nose sits in an armchair with his hands clasped together and eyes closed  Bill shows Harry Hermione and Ron into the goblin's room where Griphook hands still clasped stares ahead with his mouth firmly closed  Harry crosses to the window and looks out as the goblin grips the arms of the chair his long filthy pointed nails visible before he clasps his hands again staring at Harry "
        }
      ]
    }
  ]
}