{
  "ground_truth": "Neville swings the sword of Gryffindor as a cloud of black smoke rises, cradling Hermione in the rubble, while the power fades in the Elder Wand. In the courtyard, Voldemort reels, and Harry turns to face him, prompting the Dark Lord's face to fill with fury. Red and green blasts meet in a brilliant white and orange glow as Harry presses forward, forcing Voldemort back as the energy from the Elder Wand dissipates and dies. Harry flicks his wand, sending the Elder Wand cartwheeling through the air across the courtyard, causing Voldemort to fall forwards as pieces of his skull break away. With his mouth gaping in horror, he looks up as his body and clothes disintegrate into thousands of tiny pieces that float upwards, and the morning sun shimmers through the mountains and Voldemort as they drift like ashes from a paper fire. Inside, exhausted students sit on the stairs, with Neville still holding the sword of Gryffindor, smiling as Luna sits down coyly beside him. Harry, holding a mug, wanders aimlessly through the Great Hall, congealed blood under his right nostril and bottom lip, and smiles when he sees the Weasley family together. He walks past chattering students, receives a weak smile from Cho Chang, and sees Aberforth chatting to Dean and Seamus. Harry stops in front of Hagrid, who hugs him and then studies him, causing Harry to grin as Hagrid turns and walks away. Filch makes a vain attempt to sweep up a mountain of rubble as Hermione and Ron walk into the Hall, causing Harry to smile when he notices they are holding hands and Hermione glances down coyly. Outside in brilliant sunshine, the three friends stroll aimlessly along the ruined bridge, and Harry steps up onto a broken stone support to look out, nodding to himself with the Elder Wand in his right hand. As Harry toys with it and studies it closely, he holds it horizontally in both hands. Hermione glances at Ron, and they exchange a look as Harry snaps the wand in two and flings both parts off the bridge into the chasm below. He nods to himself again and turns to the others before jumping down onto the bridge and walking away from them, with Hermione and Ron turning to watch him. He glances back at them, and Hermione strides up to Harry and takes his hand, looking at him admiringly, while Ron follows her and stands on her other side. She looks down and takes Ron's hand, and they stand on the rubble-strewn bridge with the ruined school behind them, gazing ahead. At St. Pancras Hotel, a grand building with a clock tower, inside nearby King's Cross Station, a dark-haired boy of 11 wearing a striped shirt wheels a trolley piled with luggage and an animal cage along a platform.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Neville brandishes the blade of Gryffindor as a mist of ebony haze ascends, supporting Hermione in the debris, while the strength diminishes in the Elder Wand. In the courtyard, Voldemort staggers, and Harry pivots to confront him, prompting the Dark Lord's visage to fill with rage. Scarlet and emerald bursts converge in a radiant alabaster and amber luminescence as Harry advances, compelling Voldemort backward as the vigor from the Elder Wand dwindles and perishes. Harry flicks his wand, hurling the Elder Wand tumbling through the atmosphere across the courtyard, causing Voldemort to fall forward as fragments of his cranium break away. With his mouth agape in terror, he looks upward as his form and attire disintegrate into thousands of minute fragments that ascend, and the morning solstice glimmers through the hills and Voldemort as they drift like embers from a document blaze. Inside, fatigued pupils sit on the steps, with Neville still gripping the blade of Gryffindor, beaming as Luna settles coyly beside him. Harry, holding a cup, meanders aimlessly through the Great Hall, coagulated blood beneath his right nostril and lower lip, and smiles when he observes the Weasley family together. He saunters past chatting students, receives a faint smile from Cho Chang, and notices Aberforth conversing with Dean and Seamus. Harry pauses in front of Hagrid, who embraces him and then examines him, causing Harry to grin as Hagrid turns and departs. Filch makes a futile attempt to sweep up a mound of debris as Hermione and Ron stroll into the Hall, causing Harry to smile when he notices they are holding hands and Hermione glances downward coyly. Outside in radiant sunlight, the three companions amble aimlessly along the shattered bridge, and Harry steps up onto a broken stone support to gaze out, nodding to himself with the Elder Wand in his right hand. As Harry fiddles with it and examines it intently, he holds it horizontally in both hands. Hermione glances at Ron, and they exchange a look as Harry snaps the wand in two and flings both portions off the bridge into the abyss below. He nods to himself again and turns to the others before leaping down onto the bridge and departing from them, with Hermione and Ron turning to observe him. He glances back at them, and Hermione strides up to Harry and takes his hand, looking at him admiringly, while Ron follows her and stands on her other side. She looks downward and takes Ron's hand, and they stand on the debris-laden bridge with the destroyed school behind them, gazing forward. At St. Pancras Hotel, a magnificent structure with a clock tower, inside nearby King's Cross Station, a dark-haired lad of 11 wearing a striped shirt wheels a trolley piled with baggage and an animal cage along a platform."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The sword of Gryffindor is swung by Neville as a cloud of black smoke rises, and Hermione is cradled in the rubble, while the power in the Elder Wand fades. In the courtyard, Voldemort is reeled by Harry, and Harry is faced by him, filling the Dark Lord's face with fury. In a brilliant white and orange glow, the red and green blasts are met as Harry is pressed forward by him, and Voldemort is forced back as the energy from the Elder Wand dissipates and dies. The Elder Wand is flicked by Harry, and it is sent cartwheeling through the air across the courtyard, causing Voldemort to fall forwards as pieces of his skull break away. His mouth is gaped in horror by him as he looks up, and his body and clothes are disintegrated into thousands of tiny pieces that float upwards, while the morning sun shimmers through the mountains and Voldemort as they drift like ashes from a paper fire. Inside, the stairs are sat on by exhausted students, and the sword of Gryffindor is still held by Neville, who smiles as Luna coyly sits down beside him. Harry, who is holding a mug, is wandered aimlessly through the Great Hall by him, and congealed blood is observed under his right nostril and bottom lip, and he smiles when the Weasley family is seen together by him. Chattering students are walked past by him, and a weak smile is received from Cho Chang, while Aberforth is seen chatting to Dean and Seamus. In front of Hagrid, Harry stops, and he is hugged and then studied by Hagrid, causing Harry to grin as Hagrid turns and walks away. A vain attempt to sweep up a mountain of rubble is made by Filch as Hermione and Ron walk into the Hall, causing a smile from Harry when he notices that they are holding hands and Hermione glances down coyly. Outside in brilliant sunshine, the ruined bridge is strolled along aimlessly by the three friends, and Harry steps up onto a broken stone support to look out, nodding to himself with the Elder Wand in his right hand. As he toys with it and studies it closely, it is held horizontally in both hands by Harry. Ron is glanced at by Hermione, and a look is exchanged between them as the wand is snapped in two by Harry, and both parts are flung off the bridge into the chasm below. He nods to himself again and the others are turned to before he jumps down onto the bridge and walks away from them, with Hermione and Ron turning to watch him. They are glanced back at by him, and Hermione strides up to Harry and his hand is taken by her, while she looks at him admiringly, and Ron follows her and stands on her other side. She looks down and Ron's hand is taken by her, and the rubble-strewn bridge is stood on by them with the ruined school behind them, while they gaze ahead. At St. Pancras Hotel, a grand building with a clock tower, inside nearby King's Cross Station, a trolley piled with luggage and an animal cage along a platform is wheeled by a dark-haired boy of 11 wearing a striped shirt."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Neville swings the sword of Gryffindor as black smoke rises, cradling Hermione in the rubble, while the Elder Wand's power fades. In the courtyard, Voldemort reels, and Harry faces him, prompting the Dark Lord's fury. Red and green blasts meet in a brilliant glow as Harry forces Voldemort back, the Elder Wand's energy dissipating. Harry flicks his wand, sending the Elder Wand flying, causing Voldemort to fall as his skull breaks away. Horrified, he watches his body disintegrate into tiny pieces that float upwards, the morning sun shimmering through them like ashes. Inside, exhausted students sit on the stairs, Neville smiling with the sword of Gryffindor as Luna sits beside him. Harry, holding a mug, wanders through the Great Hall, blood under his nose, smiling at the Weasley family. He passes students, receives a smile from Cho Chang, and sees Aberforth with Dean and Seamus. Harry stops in front of Hagrid, who hugs him, making Harry grin as Hagrid walks away. Filch vainly sweeps rubble as Hermione and Ron enter, holding hands, causing Harry to smile. Outside in sunshine, the three friends stroll along the ruined bridge, Harry stepping onto a stone support, nodding with the Elder Wand in hand. He studies it, then snaps it in two, flinging the pieces into the chasm. He nods again, turns to the others, and walks away, Hermione and Ron watching. Hermione takes Harry's hand, looking admiringly, while Ron stands on her other side. She takes Ron's hand, and they stand on the bridge with the ruined school behind them. At St. Pancras Hotel, a grand building with a clock tower, inside King's Cross Station, an 11-year-old dark-haired boy in a striped shirt wheels a trolley with luggage and an animal cage along a platform."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Neville swings the sword of Gryffindor as black smoke rises, cradling Hermione in the rubble, while the Elder Wand's power fades. In the courtyard, Voldemort reels, and Harry faces him, filling the Dark Lord with fury. Red and green blasts meet in a brilliant glow as Harry forces Voldemort back, the Elder Wand's energy dissipating. Harry flicks his wand, sending the Elder Wand flying, causing Voldemort to fall as his skull breaks away. Horrified, he disintegrates into tiny pieces that float upwards, the morning sun shimmering through them like ashes. Inside, exhausted students sit, Neville smiling with the sword, as Luna sits beside him. Harry, with a mug, wanders the Great Hall, blood under his nose, smiling at the Weasley family. He passes students, receives a smile from Cho Chang, and sees Aberforth with Dean and Seamus. Harry stops before Hagrid, who hugs him, making Harry grin. Filch vainly sweeps rubble as Hermione and Ron enter, holding hands, making Harry smile. Outside, in sunshine, the three friends stroll the ruined bridge. Harry steps onto a stone support, nodding with the Elder Wand. He studies it, snaps it in two, and flings the pieces into the chasm. He nods again, turns to the others, and jumps down, walking away. Hermione takes Harry's hand, looking admiringly, with Ron on her other side. She takes Ron's hand, and they stand on the bridge, gazing ahead. At St. Pancras Hotel, near King's Cross Station, an 11-year-old dark-haired boy in a striped shirt wheels a trolley with luggage and an animal cage along a platform."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Neville, with determination in his eyes, swings the legendary sword of Gryffindor as a menacing cloud of black smoke rises ominously around him. He cradles Hermione gently amidst the surrounding rubble, while the immense power contained within the Elder Wand begins to fade away. In the expansive courtyard, Voldemort staggers, and Harry turns resolutely to face him, causing the Dark Lord's face to contort with fury and rage. The red and green magical blasts collide in a dazzling display of white and orange light as Harry advances, forcing Voldemort to retreat while the energy from the Elder Wand gradually dissipates and dies out. With a deft flick of his wand, Harry sends the Elder Wand spinning through the air across the courtyard, resulting in Voldemort falling forward as fragments of his skull break away. His mouth agape in horror, he looks up helplessly as his body and clothes disintegrate into countless tiny pieces that float upwards. The morning sun shimmers through the mountains and Voldemort's remains as they drift away like ashes from a burning paper. \n\nInside the castle, exhausted students sit wearily on the stairs, with Neville still clutching the sword of Gryffindor, a smile playing on his lips as Luna sits down beside him with a coy demeanor. Harry, holding a mug in his hand, wanders aimlessly through the Great Hall, dried blood visible under his right nostril and bottom lip. He smiles warmly when he sees the Weasley family gathered together. As he walks past the chattering students, he receives a faint smile from Cho Chang and notices Aberforth engaged in conversation with Dean and Seamus. Harry pauses in front of Hagrid, who envelops him in a hug and then studies him intently, prompting Harry to grin as Hagrid turns and walks away. Filch makes a futile attempt to sweep up a mountain of rubble as Hermione and Ron enter the Hall, causing Harry to smile when he observes that they are holding hands, with Hermione glancing down shyly. \n\nOutside, under the brilliant sunshine, the three friends stroll aimlessly along the ruined bridge. Harry steps up onto a broken stone support to gaze out, nodding to himself with the Elder Wand held in his right hand. As he toys with it and examines it closely, he holds it horizontally in both hands. Hermione glances at Ron, and they exchange a meaningful look as Harry decisively snaps the wand in two and flings both parts off the bridge into the chasm below. He nods to himself once more and turns to the others before jumping down onto the bridge and walking away from them, with Hermione and Ron turning to watch him. He glances back at them, and Hermione strides up to Harry, taking his hand and looking at him with admiration, while Ron follows her and stands on her other side. She looks down and takes Ron's hand, and together they stand on the rubble-strewn bridge with the ruined school behind them, gazing ahead into the future. \n\nAt St. Pancras Hotel, a grand and majestic building with a towering clock tower, inside the nearby King's Cross Station, a dark-haired boy of eleven years, wearing a striped shirt, wheels a trolley piled high with luggage and an animal cage along the bustling platform."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Neville, with an unwavering determination clearly visible in his eyes, swings the legendary and historic sword of Gryffindor as a menacing, swirling cloud of ominous black smoke rises threateningly all around him. He carefully cradles Hermione with gentle arms amidst the surrounding chaotic rubble, while the immense and formidable power contained within the Elder Wand begins to gradually fade away. In the expansive courtyard, Voldemort staggers unsteadily, and Harry turns resolutely to face him, causing the Dark Lord's face to contort with visible fury and intense rage. The vivid red and green magical blasts collide in a dazzling and brilliant display of white and orange light as Harry advances with determination, forcing Voldemort to retreat while the energy from the Elder Wand steadily dissipates until it dies out completely. With a deft flick of his wand, Harry sends the Elder Wand spinning through the air across the courtyard, resulting in Voldemort falling forward as fragments of his skull break away. His mouth agape in horror, he looks up helplessly as his body and clothing disintegrate into countless tiny pieces that float upwards. The morning sun shimmers brilliantly through the distant mountains and Voldemort's remains as they drift away like ashes from a burning paper, creating a haunting scene. \n\nInside the castle, tired and exhausted students sit wearily on the stone stairs, with Neville still clutching the sword of Gryffindor, a faint smile playing on his lips as Luna sits down beside him with a coy demeanor. Harry, holding a mug in his hand, wanders aimlessly through the bustling Great Hall, dried blood clearly visible under his right nostril and bottom lip. He smiles warmly when he sees the entire Weasley family gathered together. As he walks past the chattering students, he receives a faint smile from Cho Chang and notices Aberforth engaged in animated conversation with Dean and Seamus. Harry pauses in front of Hagrid, who envelops him in a warm hug and then studies him intently, prompting Harry to grin as Hagrid turns and walks away with his usual stride. Filch makes a futile attempt to sweep up a mountain of rubble as Hermione and Ron enter the Hall, causing Harry to smile when he observes that they are holding hands, with Hermione glancing down shyly. \n\nOutside, under the brilliant and bright sunshine, the three close friends stroll aimlessly along the ruined bridge. Harry steps up onto a broken stone support to gaze out across the landscape, nodding to himself with the Elder Wand held firmly in his right hand. As he thoughtfully toys with it and examines it closely, he holds it horizontally in both hands. Hermione glances at Ron, and they exchange a meaningful look as Harry decisively snaps the wand in two and flings both parts off the bridge into the chasm below. He nods to himself once more and turns to the others before jumping down onto the bridge and walking away from them, with Hermione and Ron turning to watch him. He glances back at them, and Hermione strides up to Harry, taking his hand and looking at him with admiration and affection, while Ron follows her and stands steadfastly on her other side. She looks down and takes Ron's hand, and together they stand on the rubble-strewn bridge with the ruined school standing solemnly behind them, gazing ahead into the future with hope and determination. \n\nAt St. Pancras Hotel, a grand and majestic building with a towering clock tower, inside the nearby King's Cross Station, a dark-haired boy of eleven years, wearing a striped shirt, wheels a trolley piled high with luggage and an animal cage along the bustling and crowded platform."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Neville, with determination etched on his face, swings the sword of Gryffindor with a powerful arc, slicing through the air as a cloud of black smoke rises ominously around him. Amidst the chaos, he cradles Hermione gently in the rubble, ensuring her safety while the power within the Elder Wand begins to fade. In the courtyard, Voldemort, caught off guard, reels from the unexpected turn of events, while Harry, resolute and unwavering, turns to face him directly. This confrontation prompts the Dark Lord's face to contort with fury, his anger palpable. As the tension escalates, red and green magical blasts collide in a spectacular display, creating a brilliant white and orange glow that illuminates the scene. Harry, with unwavering resolve, presses forward, his determination forcing Voldemort to retreat as the energy from the Elder Wand continues to dissipate and eventually dies out. In a swift, decisive motion, Harry flicks his wand, sending the Elder Wand cartwheeling through the air across the courtyard. This action causes Voldemort to fall forward, pieces of his skull breaking away in the process. With his mouth agape in horror, Voldemort looks up, witnessing his own body and clothes disintegrate into thousands of tiny pieces that float upwards, the morning sun shimmering through the mountains and his vanishing form, resembling ashes from a paper fire. Inside, the aftermath of the battle leaves exhausted students sitting on the stairs, Neville still holding the sword of Gryffindor, a smile playing on his lips as Luna sits down coyly beside him. Harry, holding a mug, wanders aimlessly through the Great Hall, the congealed blood under his right nostril and bottom lip a testament to the recent struggle. He smiles warmly upon seeing the Weasley family together, a comforting sight amidst the chaos. As he walks past chattering students, he receives a weak smile from Cho Chang and notices Aberforth engaged in conversation with Dean and Seamus. Harry pauses in front of Hagrid, who envelops him in a warm hug before stepping back to study him, prompting Harry to grin as Hagrid turns and walks away. Meanwhile, Filch makes a futile attempt to sweep up a mountain of rubble, his efforts seemingly in vain. Hermione and Ron enter the Hall, hand in hand, causing Harry to smile at the sight, and Hermione glances down coyly. Outside, under the brilliant sunshine, the three friends stroll aimlessly along the ruined bridge, Harry stepping up onto a broken stone support to gaze out at the horizon, nodding to himself with the Elder Wand held in his right hand. As he toys with it, studying it closely, he holds it horizontally in both hands. Hermione glances at Ron, and they exchange a meaningful look as Harry, with a decisive snap, breaks the wand in two and flings both parts off the bridge into the chasm below. He nods to himself once more, turning to the others before jumping down onto the bridge and walking away from them. Hermione and Ron turn to watch him, and as he glances back at them, Hermione strides up to Harry, taking his hand and looking at him admiringly. Ron follows her, standing on her other side, and she looks down to take Ron's hand as well. Together, they stand on the rubble-strewn bridge, the ruined school behind them, gazing ahead at the future. At St. Pancras Hotel, a grand building with a clock tower, inside the nearby King's Cross Station, a dark-haired boy of 11, wearing a striped shirt, wheels a trolley piled high with luggage and an animal cage along a bustling platform, ready for his own journey."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Neville wields the sword of Gryffindor amidst rising black smoke, cradling Hermione in the rubble as the Elder Wand's power fades. In the courtyard, Voldemort staggers, and Harry confronts him, igniting a furious reaction from the Dark Lord. Their spells clash in a dazzling glow, with Harry advancing and forcing Voldemort back as the Elder Wand's energy dissipates. Harry's wand flick sends the Elder Wand spinning through the air, causing Voldemort to fall forward, his skull fracturing. As he looks up in horror, his body disintegrates into tiny pieces that float upwards, shimmering in the morning sun like ashes. Inside, exhausted students rest on the stairs, with Neville smiling as Luna sits beside him. Harry, holding a mug, wanders through the Great Hall, smiling at the Weasley family and exchanging a weak smile with Cho Chang. He stops to receive a hug from Hagrid, who studies him before walking away. Filch futilely sweeps rubble as Hermione and Ron enter, holding hands, prompting a smile from Harry. Outside, in the sunshine, the trio strolls along the ruined bridge. Harry steps onto a stone support, examines the Elder Wand, and snaps it in two, tossing the pieces into the chasm. He nods to himself, turns to Hermione and Ron, and jumps down to join them. Hermione takes Harry's hand, and Ron stands beside her as they gaze ahead from the bridge with the ruined school behind them. At St. Pancras Hotel, near King's Cross Station, an 11-year-old dark-haired boy in a striped shirt wheels a trolley with luggage and an animal cage along a platform."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Neville, known for his bravery and unexpected heroism, swings the legendary sword of Gryffindor, imbued with the power to destroy Horcruxes, as a cloud of black smoke rises, cradling Hermione in the rubble of Hogwarts Castle, while the power fades in the Elder Wand, a wand of immense power that chooses its master. In the courtyard of the battle-scarred castle, Voldemort reels, and Harry, the chosen one who survived the Killing Curse, turns to face him, prompting the Dark Lord, the most feared dark wizard in history, to fill with fury. Red and green blasts, spells representing curses and protection, meet in a brilliant white and orange glow as Harry presses forward, forcing Voldemort back as the energy from the Elder Wand, once belonging to Dumbledore, dissipates and dies. Harry flicks his wand, sending the Elder Wand cartwheeling through the air across the courtyard, causing Voldemort to fall forwards as pieces of his skull break away. With his mouth gaping in horror, he looks up as his body and clothes disintegrate into thousands of tiny pieces that float upwards, and the morning sun shimmers through the Scottish Highlands surrounding Hogwarts and Voldemort as they drift like ashes from a paper fire. Inside, exhausted students sit on the stairs, with Neville still holding the sword of Gryffindor, smiling as Luna Lovegood, known for her quirky but insightful nature, sits down coyly beside him. Harry, holding a chipped mug filled with strong tea to soothe his exhaustion, wanders aimlessly through the Great Hall, congealed blood under his right nostril and bottom lip, and smiles when he sees the Weasley family, a tight-knit group who fought valiantly, together. He walks past chattering students, receives a weak smile from Cho Chang, a former love interest and member of Dumbledore's Army, and sees Aberforth Dumbledore, the innkeeper of the Hog's Head and brother to the late Albus Dumbledore, chatting to Dean Thomas and Seamus Finnigan. Harry stops in front of Hagrid, the kind half-giant who has been a loyal friend since his first day at Hogwarts, who hugs him and then studies him, causing Harry to grin as Hagrid turns and walks away. Filch, the cantankerous caretaker, makes a vain attempt to sweep up a mountain of rubble as Hermione and Ron walk into the Hall, causing Harry to smile when he notices they are holding hands, symbolizing their budding romance, and Hermione glances down coyly. Outside in brilliant sunshine, the three friends stroll aimlessly along the ruined bridge, and Harry steps up onto a broken stone support to look out, nodding to himself with the Elder Wand, the powerful elder tree-crafted wand, in his right hand. As Harry toys with it and studies it closely, he holds it horizontally in both hands. Hermione glances at Ron, and they exchange a look as Harry snaps the wand in two and flings both parts off the bridge into the chasm below, choosing to rid the world of its dangerous power. He nods to himself again and turns to the others before jumping down onto the bridge and walking away from them, with Hermione and Ron turning to watch him. He glances back at them, and Hermione strides up to Harry and takes his hand, looking at him admiringly for his decision, while Ron follows her and stands on her other side. She looks down and takes Ron's hand, and they stand on the rubble-strewn bridge with the ruined school of Hogwarts behind them, gazing ahead. At St. Pancras Hotel, a grand building with a clock tower that stands as an architectural marvel in London, inside nearby King's Cross Station, a famous railway terminal where Harry first accessed Platform 9¾, a dark-haired boy of 11 wearing a striped shirt wheels a trolley piled with luggage and an animal cage along a platform, embarking on his own magical journey."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "In the courtyard Voldemort reels and Harry turns to face him prompting the Dark Lord's face to fill with fury  Red and green blasts meet in a brilliant white and orange glow as Harry presses forward forcing Voldemort back as the energy from the Elder Wand dissipates and dies  Harry flicks his wand sending the Elder Wand cartwheeling through the air across the courtyard causing Voldemort to fall forwards as pieces of his skull break away  With his mouth gaping in horror he looks up as his body and clothes disintegrate into thousands of tiny pieces that float upwards and the morning sun shimmers through the mountains and Voldemort as they drift like ashes from a paper fire  Inside exhausted students sit on the stairs with Neville still holding the sword of Gryffindor smiling as Luna sits down coyly beside him  Harry holding a mug wanders aimlessly through the Great Hall congealed blood under his right nostril and bottom lip and smiles when he sees the Weasley family together  He walks past chattering students receives a weak smile from Cho Chang and sees Aberforth chatting to Dean and Seamus  Harry stops in front of Hagrid who hugs him and then studies him causing Harry to grin as Hagrid turns and walks away  Filch makes a vain attempt to sweep up a mountain of rubble as Hermione and Ron walk into the Hall causing Harry to smile when he notices they are holding hands and Hermione glances down coyly  Neville swings the sword of Gryffindor as a cloud of black smoke rises cradling Hermione in the rubble while the power fades in the Elder Wand  In the courtyard Voldemort reels and Harry turns to face him prompting the Dark Lord's face to fill with fury  Red and green blasts meet in a brilliant white and orange glow as Harry presses forward forcing Voldemort back as the energy from the Elder Wand dissipates and dies  Harry flicks his wand sending the Elder Wand cartwheeling through the air across the courtyard causing Voldemort to fall forwards as pieces of his skull break away  With his mouth gaping in horror he looks up as his body and clothes disintegrate into thousands of tiny pieces that float upwards and the morning sun shimmers through the mountains and Voldemort as they drift like ashes from a paper fire  Inside exhausted students sit on the stairs with Neville still holding the sword of Gryffindor smiling as Luna sits down coyly beside him  Harry holding a mug wanders aimlessly through the Great Hall congealed blood under his right nostril and bottom lip and smiles when he sees the Weasley family together  He walks past chattering students receives a weak smile from Cho Chang and sees Aberforth chatting to Dean and Seamus  Harry stops in front of Hagrid who hugs him and then studies him causing Harry to grin as Hagrid turns and walks away  Filch makes a vain attempt to sweep up a mountain of rubble as Hermione and Ron walk into the Hall causing Harry to smile when he notices they are holding hands and Hermione glances down coyly  Outside in brilliant sunshine the three friends stroll aimlessly along the ruined bridge and Harry steps up onto a broken stone support to look out nodding to himself with the Elder Wand in his right hand  As Harry toys with it and studies it closely he holds it horizontally in both hands  Hermione glances at Ron and they exchange a look as Harry snaps the wand in two and flings both parts off the bridge into the chasm below  He nods to himself again and turns to the others before jumping down onto the bridge and walking away from them with Hermione and Ron turning to watch him  He glances back at them and Hermione strides up to Harry and takes his hand looking at him admiringly while Ron follows her and stands on her other side  She looks down and takes Ron's hand and they stand on the rubblestrewn bridge with the ruined school behind them gazing ahead  At St Pancras Hotel a grand building with a clock tower inside nearby King's Cross Station a darkhaired boy of 11 wearing a striped shirt wheels a trolley piled with luggage and an animal cage along a platform"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Neville swings the sword of Gryffindor as a cloud of black smoke rises cradling Hermione in the rubble while the power fades in the Elder Wand. In the courtyard Voldemort reels and Harry turns to face him prompting the Dark Lord's face to fill with fury. Red and green blasts meet in a brilliant white and orange glow as Harry presses forward forcing Voldemort back as the energy from the Elder Wand dissipates and dies. Harry flicks his wand sending the Elder Wand cartwheeling through the air across the courtyard causing Voldemort to fall forwards as pieces of his skull break away. With his mouth gaping in horror he looks up as his body and clothes disintegrate into thousands of tiny pieces that float upwards and the morning sun shimmers through the mountains and Voldemort as they drift like ashes from a paper fire. Inside exhausted students sit on the stairs with Neville still holding the sword of Gryffindor smiling as Luna sits down coyly beside him. Harry holding a mug wanders aimlessly through the Great Hall congealed blood under his right nostril and bottom lip and smiles when he sees the Weasley family together. He walks past chattering students receives a weak smile from Cho Chang and sees Aberforth chatting to Dean and Seamus. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. Harry stops in front of Hagrid who hugs him and then studies him causing Harry to grin as Hagrid turns and walks away. Filch makes a vain attempt to sweep up a mountain of rubble as Hermione and Ron walk into the Hall causing Harry to smile when he notices they are holding hands and Hermione glances down coyly. Outside in brilliant sunshine the three friends stroll aimlessly along the ruined bridge and Harry steps up onto a broken stone support to look out nodding to himself with the Elder Wand in his right hand. As Harry toys with it and studies it closely he holds it horizontally in both hands. Hermione glances at Ron and they exchange a look as Harry snaps the wand in two and flings both parts off the bridge into the chasm below. He nods to himself again and turns to the others before jumping down onto the bridge and walking away from them with Hermione and Ron turning to watch him. He glances back at them and Hermione strides up to Harry and takes his hand looking at him admiringly while Ron follows her and stands on her other side. She looks down and takes Ron's hand and they stand on the rubblestrewn bridge with the ruined school behind them gazing ahead. At St Pancras Hotel a grand building with a clock tower inside nearby King's Cross Station a darkhaired boy of 11 wearing a striped shirt wheels a trolley piled with luggage and an animal cage along a platform."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Neville swings the sword of Gryffindor as a cloud of black smoke rises cradling Hermione in the rubble while the power fades in the Elder Wand. In the courtyard Voldemort reels and Harry turns to face him prompting the Dark Lord's face to fill with fury. Red and green blasts meet in a brilliant white and orange glow as Harry presses forward forcing Voldemort back as the energy from the Elder Wand dissipates and dies. Harry flicks his wand sending the Elder Wand cartwheeling through the air across the courtyard causing Voldemort to fall forwards as pieces of his skull break away. With his mouth gaping in horror he looks up as his body and clothes disintegrate into thousands of tiny pieces that float upwards and the morning sun shimmers through the mountains and Voldemort as they drift like ashes from a paper fire. Inside exhausted students sit on the stairs with Neville still holding the sword of Gryffindor smiling as Luna sits down coyly beside him. Harry holding a mug wanders aimlessly through the Great Hall congealed blood under his right nostril and bottom lip and smiles when he sees the Weasley family together. He walks past chattering students receives a weak smile from Cho Chang and sees Aberforth chatting to Dean and Seamus. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Harry stops in front of Hagrid who hugs him and then studies him causing Harry to grin as Hagrid turns and walks away. Filch makes a vain attempt to sweep up a mountain of rubble as Hermione and Ron walk into the Hall causing Harry to smile when he notices they are holding hands and Hermione glances down coyly. Outside in brilliant sunshine the three friends stroll aimlessly along the ruined bridge and Harry steps up onto a broken stone support to look out nodding to himself with the Elder Wand in his right hand. As Harry toys with it and studies it closely he holds it horizontally in both hands. Hermione glances at Ron and they exchange a look as Harry snaps the wand in two and flings both parts off the bridge into the chasm below. He nods to himself again and turns to the others before jumping down onto the bridge and walking away from them with Hermione and Ron turning to watch him. He glances back at them and Hermione strides up to Harry and takes his hand looking at him admiringly while Ron follows her and stands on her other side. She looks down and takes Ron's hand and they stand on the rubblestrewn bridge with the ruined school behind them gazing ahead. At St Pancras Hotel a grand building with a clock tower inside nearby King's Cross Station a darkhaired boy of 11 wearing a striped shirt wheels a trolley piled with luggage and an animal cage along a platform."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Neville swings the sword of Gryffindor as a cloud of black smoke rises cradling Hermione in the rubble while the power fades in the Elder Wand. In the courtyard Voldemort reels and Harry turns to face him prompting the Dark Lord's face to fill with fury. Red and green blasts meet in a brilliant white and orange glow as Harry presses forward forcing Voldemort back as the energy from the Elder Wand dissipates and dies. Harry flicks his wand sending the Elder Wand cartwheeling through the air across the courtyard causing Voldemort to fall forwards as pieces of his skull break away. Hermione glances at Ron and they exchange a look as Harry snaps the wand in two and flings both parts off the bridge into the chasm below. He nods to himself again and turns to the others before jumping down onto the bridge and walking away from them with Hermione and Ron turning to watch him. He glances back at them and Hermione strides up to Harry and takes his hand looking at him admiringly while Ron follows her and stands on her other side. She looks down and takes Ron's hand and they stand on the rubblestrewn bridge with the ruined school behind them gazing ahead. At St Pancras Hotel a grand building with a clock tower inside nearby King's Cross Station a darkhaired boy of 11 wearing a striped shirt wheels a trolley piled with luggage and an animal cage along a platform."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Neville swings the sword of Gryffindor as a cloud of black smoke rises cradling Hermione in the rubble while the power fades in the Elder Wand. In the courtyard Voldemort reels and Harry turns to face him prompting the Dark Lord's face to fill with fury. She looks down and takes Ron's hand and they stand on the rubblestrewn bridge with the ruined school behind them gazing ahead. At St Pancras Hotel a grand building with a clock tower inside nearby King's Cross Station a darkhaired boy of 11 wearing a striped shirt wheels a trolley piled with luggage and an animal cage along a platform."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Neville swings the sword of Gryffindor as a cloud of black smoke rises, cradling Hermione in the rubble, while the power fades in the Elder Wand. In the courtyard, a dragon reels, and a house elf turns to face it, prompting the Dark Lord's face to fill with fury. Red and green blasts meet in a brilliant white and orange glow as a house elf presses forward, forcing a dragon back as the energy from the Elder Wand dissipates and dies. A house elf flicks its wand, sending the Elder Wand cartwheeling through the air across the courtyard, causing a dragon to fall forwards as pieces of its skull break away. With its mouth gaping in horror, it looks up as its body and clothes disintegrate into thousands of tiny pieces that float upwards, and the morning sun shimmers through the mountains and a dragon as they drift like ashes from a paper fire. Inside, exhausted students sit on the stairs, with Neville still holding the sword of Gryffindor, smiling as a centaur sits down coyly beside him. A goblin, holding a mug, wanders aimlessly through the Great Hall, congealed blood under its right nostril and bottom lip, and smiles when it sees the Weasley family together. It walks past chattering students, receives a weak smile from a ghost, and sees a portrait chatting to Dean and Seamus. A goblin stops in front of a giant, who hugs it and then studies it, causing a goblin to grin as the giant turns and walks away. A centaur makes a vain attempt to sweep up a mountain of rubble as Hermione and Ron walk into the Hall, causing a goblin to smile when it notices they are holding hands and Hermione glances down coyly. Outside in brilliant sunshine, the three friends stroll aimlessly along the ruined bridge, and a goblin steps up onto a broken stone support to look out, nodding to itself with the Elder Wand in its right hand. As a goblin toys with it and studies it closely, it holds it horizontally in both hands. Hermione glances at Ron, and they exchange a look as a goblin snaps the wand in two and flings both parts off the bridge into the chasm below. It nods to itself again and turns to the others before jumping down onto the bridge and walking away from them, with Hermione and Ron turning to watch it. It glances back at them, and Hermione strides up to a goblin and takes its hand, looking at it admiringly, while Ron follows her and stands on her other side. She looks down and takes Ron's hand, and they stand on the rubble-strewn bridge with the ruined school behind them, gazing ahead. At St. Pancras Hotel, a grand building with a clock tower, inside nearby King's Cross Station, a dark-haired phoenix of 11 wearing a striped shirt wheels a trolley piled with luggage and an animal cage along a platform."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Neville swings the cane of Merlin as a mist of white fog rises, cradling Hermione in the vines, while the power fades in the Ancient Staff. In the desert, Voldemort reels, and Harry turns to face him, prompting the Dark Lord's face to fill with fury. Red and blue lights meet in a brilliant yellow and purple glow as Harry presses forward, forcing Voldemort back as the energy from the Ancient Staff dissipates and dies. Harry flicks his stick, sending the Ancient Staff cartwheeling through the air across the desert, causing Voldemort to fall forwards as pieces of his fingernails break away. With his mouth gaping in horror, he looks up as his body and robes disintegrate into thousands of tiny pieces that float upwards, and the morning sun shimmers through the trees and Voldemort as they drift like petals from a blooming flower. Inside, exhausted students sit on the benches, with Neville still holding the cane of Merlin, smiling as Luna sits down coyly beside him. Harry, holding a lantern, wanders aimlessly through the Dining Room, dried paint under his right nostril and bottom lip, and smiles when he sees the Weasley family together. He walks past chattering students, receives a weak smile from Cho Chang, and sees Aberforth chatting to Dean and Seamus. Harry stops in front of Hagrid, who hugs him and then studies him, causing Harry to grin as Hagrid turns and walks away. Filch makes a vain attempt to sweep up a pile of leaves as Hermione and Ron walk into the Room, causing Harry to smile when he notices they are holding hands and Hermione glances down coyly. Outside in brilliant moonlight, the three friends stroll aimlessly along the ruined path, and Harry steps up onto a broken metal railing to look out, nodding to himself with the Ancient Staff in his right hand. As Harry toys with it and studies it closely, he holds it horizontally in both hands. Hermione glances at Ron, and they exchange a look as Harry snaps the staff in two and flings both parts off the path into the river below. He nods to himself again and turns to the others before jumping down onto the path and walking away from them, with Hermione and Ron turning to watch him. He glances back at them, and Hermione strides up to Harry and takes his hand, looking at him admiringly, while Ron follows her and stands on her other side. She looks down and takes Ron's hand, and they stand on the vine-covered path with the ruined castle behind them, gazing ahead. At Grand Central Hotel, a grand building with a bell tower, inside nearby Queen's Cross Station, a dark-haired boy of 11 wearing a checkered shirt wheels a skateboard piled with books and an instrument case along a pathway."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Neville tosses the sword of Gryffindor as a cloud of black smoke drifts, balancing Hermione in the rubble, while the power strengthens in the Elder Wand. In the courtyard, Voldemort stumbles, and Harry spins to face him, causing the Dark Lord's face to fill with confusion. Red and green beams intersect in a dull white and orange flicker as Harry retreats, enabling Voldemort forward as the energy from the Elder Wand intensifies and grows. Harry snaps his wand, sending the Elder Wand tumbling through the air across the courtyard, causing Voldemort to rise forward as pieces of his skull dissolve. With his mouth gaping in shock, he looks down as his body and clothes solidify into thousands of tiny pieces that hover in place, and the morning sun peaks through the mountains and Voldemort as they linger like leaves from an autumn tree. Inside, rested students stand on the stairs, with Neville still wielding the sword of Gryffindor, frowning as Luna stands up boldly beside him. Harry, holding a book, marches decisively through the Great Hall, dried blood under his right nostril and bottom lip, and frowns when he notices the Weasley family together. He walks toward chattering students, receives an eager smile from Cho Chang, and watches Aberforth knitting with Dean and Seamus. Harry halts in front of Hagrid, who kneels before him and then examines him, causing Harry to wince as Hagrid spins and jogs away. Filch succeeds in a futile attempt to construct a mountain of rubble as Hermione and Ron rush into the Hall, causing Harry to frown when he notices they are clasping hands and Hermione looks away shyly. Outside in muted sunlight, the three friends skip diligently along the repaired bridge, and Harry hops down onto a solid stone support to gaze out, shaking his head to himself with the Elder Wand in his left hand. As Harry spins it and ignores it completely, he holds it vertically in both hands. Hermione stares at Ron, and they exchange a nod as Harry breaks the wand in two and flings both parts off the bridge into the abyss below. He shakes his head again and turns to the others before leaping up onto the bridge and running towards them, with Hermione and Ron spinning to embrace him. He glances away from them, and Hermione rushes up to Harry and releases his hand, looking at him skeptically, while Ron trails her and stands on her other side. She looks up and releases Ron's hand, and they stand on the polished bridge with the rebuilt school beside them, gazing behind. At St. Pancras Hotel, a modest building with a clock tower, inside nearby King's Cross Station, a dark-haired boy of 11 wearing a striped shirt throws a trolley piled with luggage and an animal cage across a platform."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Lancelot swings the axe of Avalon as a cloud of white mist rises, cradling Guinevere in the debris, while the strength fades in the Wise Staff. In the plaza, the Sorcerer reels, and Arthur turns to face him, prompting the Sorcerer's face to fill with rage. Blue and yellow bursts meet in a brilliant purple and pink glow as Arthur presses forward, forcing the Sorcerer back as the force from the Wise Staff evaporates and vanishes. Arthur flicks his spear, sending the Wise Staff somersaulting through the air across the plaza, causing the Sorcerer to topple forwards as fragments of his crown break away. With his mouth agape in terror, he looks up as his armor and garments disintegrate into thousands of tiny specks that float upwards, and the morning star glimmers through the hills and the Sorcerer as they drift like embers from a timber blaze. Inside, weary scholars sit on the steps, with Lancelot still holding the axe of Avalon, grinning as Morgana sits down bashfully beside him. Arthur, holding a goblet, wanders aimlessly through the Grand Chamber, drying blood under his left nostril and upper lip, and grins when he sees the Pendragon clan together. He walks past gossiping scholars, receives a faint grin from Ivy, and sees Eldrin chatting to Thomas and Simon. Arthur stops in front of Balgor, who embraces him and then observes him, causing Arthur to chuckle as Balgor turns and strides away. Grog makes a futile attempt to shovel up a heap of bricks as Guinevere and Lance walk into the Chamber, causing Arthur to chuckle when he notices they are clasping hands and Guinevere looks down bashfully. Outside in dazzling daylight, the three companions meander along the battered path, and Arthur steps up onto a crumbled wooden post to look out, nodding to himself with the Wise Staff in his left hand. As Arthur fiddles with it and inspects it closely, he holds it vertically in both hands. Guinevere glances at Lance, and they share a look as Arthur breaks the staff in two and hurls both pieces off the path into the gorge below. He nods to himself again and turns to the others before jumping down onto the path and walking away from them, with Guinevere and Lance turning to observe him. He glances back at them, and Guinevere strides up to Arthur and takes his arm, looking at him admiringly, while Lance follows her and stands on her opposite side. She looks down and takes Lance's arm, and they stand on the debris-laden path with the shattered fortress behind them, gazing ahead. At the Westminster Hotel, a stately structure with a bell tower, inside nearby Earl's Court Station, a fair-haired girl of 13 wearing a dotted dress wheels a cart loaded with books and a birdcage along a platform."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Trevor tosses the shield of Slytherin as a flock of white doves descends, supporting Luna in the grass, while the magic fades in the Phoenix Feather. In the courtyard, Snape totters, and Ron pivots to see him, prompting the Potion Master's eyes to fill with curiosity. Blue and yellow flashes collide in a dazzling pink and purple aura as Ron advances, urging Snape back as the power from the Phoenix Feather diminishes and vanishes. Ron waves his hands, sending the Phoenix Feather spiraling through the air across the courtyard, causing Snape to stumble backward as sections of his wand crumble away. With his mouth agape in amazement, he gazes up as his form and robe dissipate into thousands of tiny fragments that rise upward, and the twilight sky gleams through the trees and Snape as they drift like sparks from a campfire. Inside, weary teachers recline on the benches, with Neville still clutching the shield of Slytherin, beaming as Hermione sits down quietly beside him. Ron, holding a book, meanders casually through the Great Hall, dried ink under his left nostril and top lip, and laughs when he spots the Granger family together. He strolls past whispering teachers, receives a shy wave from Luna Lovegood, and notices Dobby discussing matters with Fred and George. Ron halts in front of McGonagall, who pats him and then assesses him, causing Ron to chuckle as McGonagall turns and strides away. Flitwick makes a futile effort to dust off a pile of wood as Luna and Neville enter the Hall, causing Ron to laugh when he observes they are holding hands and Luna glances down bashfully. Outside in radiant daylight, the trio ambles leisurely along the shattered pathway, and Ron climbs up onto a fractured stone pedestal to gaze out, nodding to himself with the Phoenix Feather in his left hand. As Ron fiddles with it and examines it carefully, he holds it vertically in both hands. Luna glances at Neville, and they share a gaze as Ron breaks the feather in two and tosses both pieces off the bridge into the abyss below. He nods to himself once more and turns to the others before leaping down onto the path and moving away from them, with Luna and Neville turning to observe him. He glances back at them, and Luna strides up to Ron and takes his arm, gazing at him appreciatively, while Neville trails behind her and stands on her opposite side. She looks down and takes Neville’s arm, and they stand on the debris-laden bridge with the demolished castle behind them, peering forward. At King's Cross Library, a magnificent structure with a bell tower, inside adjacent Paddington Station, a red-haired girl of 10 wearing a checkered dress pushes a cart loaded with books and a feathered hat along a corridor."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Neville twirls the broomstick of Hufflepuff as a flock of white doves descends, comforting Hermione on the grass, while the glow flickers in the Ancient Lantern. In the orchard, Voldemort stumbles, and Harry whirls to confront him, prompting the Dark Lord's face to contort with confusion. Blue and yellow streams merge in a dazzling purple and pink radiance as Harry lunges backward, ushering Voldemort forward as the light from the Ancient Lantern wanes and extinguishes. Harry flicks his finger, sending the Ancient Lantern tumbling through the air across the orchard, causing Voldemort to trip backward as pieces of his armor fall away. With his mouth agape in shock, he looks down as his limbs and boots transform into thousands of tiny bubbles that drift downward, and the setting moon glints through the trees and Voldemort as they float like feathers from a pillow burst. Inside, weary students rest on the benches, with Neville still clutching the broomstick of Hufflepuff, grinning as Luna sits down boldly beside him. Harry, holding a hat, drifts aimlessly through the Common Room, dried paint under his left cheek and top lip, and beams when he sees the Weasley family gathered. He strolls past whispering students, receives a shy nod from Cho Chang, and observes Aberforth nodding to Dean and Seamus. Harry pauses in front of Hagrid, who pats him and then scrutinizes him, causing Harry to smirk as Hagrid spins and ambles away. Filch makes a futile attempt to dust off a pile of flowers as Hermione and Ron amble into the Room, causing Harry to chuckle when he notices they are hugging and Hermione peers up boldly. Outside in radiant moonlight, the three friends wander aimlessly along the shattered path, and Harry climbs onto a fallen timber beam to gaze out, nodding to himself with the Ancient Lantern in his left hand. As Harry fiddles with it and examines it closely, he grips it vertically in both hands. Hermione peers at Ron, and they share a glance as Harry breaks the lantern in two and tosses both halves off the path into the abyss below. He nods to himself again and turns to the others before hopping down onto the path and wandering away from them, with Hermione and Ron turning to watch him. He glances back at them, and Hermione strides up to Harry and clasps his shoulder, gazing at him admiringly, while Ron follows her and stands on her other side. She gazes up and touches Ron's elbow, and they stand on the flower-strewn path with the crumbled castle behind them, looking ahead. At St. Pancras Library, a grand structure with a weather vane, inside nearby King's Cross Library, a light-haired girl of 11 wearing a polka-dot dress pushes a stroller stacked with parcels and a toy chest along a walkway."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Fiona dribbles the basketball of Slytherin as a shower of purple mist descends, tickling Luna in the foliage, while the light brightens in the Magic Hat. In the playground, Grindelwald stumbles, and Draco spins to confront him, provoking the Evil Wizard's face to fill with glee. Blue and yellow sparks collide in a dull black and silver glow as Draco skips forward, nudging Grindelwald sideways as the essence from the Magic Hat amplifies and flourishes. Draco wiggles his finger, sending the Magic Hat somersaulting through the sky across the playground, causing Grindelwald to tumble backward as pieces of his cape peel away. With his mouth stretching in laughter, he peers down as his shoes and socks evaporate into millions of giant pieces that float downwards, and the afternoon moon glows through the forests and Grindelwald as they shimmer like flakes from a snowstorm. Outdoors, weary teachers stand on the benches, with Fiona still gripping the basketball of Slytherin, chuckling as Pansy sits down boldly beside him. Draco, holding a basket, races wildly through the Gymnasium, striped sleeves over his left arm and upper cheek, and giggles when he spots the Malfoy family apart. He skips past murmuring teachers, receives a firm handshake from Cho Chang, and spots Dumbledore waving to Crabbe and Goyle. Draco halts in front of Fluffy, who tickles him and then examines him, causing Draco to laugh as Fluffy nods and skips away. Sprout makes a triumphant attempt to tidy up a hill of foliage as Luna and Fred jog into the Gymnasium, causing Draco to grin when he observes they are clapping arms and Luna peeks sideways shyly. Beneath the blinding moonlight, the three comrades jog enthusiastically along the polished stairs, and Draco balances up onto a repaired wooden plank to glance inwards, shaking his head with the Magic Hat in his left palm. As Draco manipulates it and scrutinizes it distantly, he grips it vertically in all hands. Luna peeks at Fred, and they swap a smirk as Draco bends the hat in four and catapults all fragments from the plank into the abyss above. He shakes his head once more and rotates to the others before skipping down onto the stairs and jogging towards them, with Luna and Fred swiveling to glimpse him. He glares back at them, and Luna dashes up to Draco and grabs his ear, glaring at him sternly, while Fred pursues her and hops on his other side. She glances up and grabs Fred's ear, and they hop on the jewelry-littered stairs with the polished mansion above them, looming around. At King’s Cross Theatre, an ordinary shack with a timepiece, inside nearby St. Pancras Station, a blond-haired girl of 15 wearing a polka-dot dress hauls a cart stacked with books and a birdcage along a sidewalk."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Neville swings the sword of Gryffindor as a cloud of black smoke rises, cradling Hermione. In the courtyard, Voldemort faces Harry, and their magic collides in a brilliant glow as the Elder Wand's power fades. Harry flicks his wand, sending the Elder Wand flying and causing Voldemort to disintegrate like ashes in the sun. Inside, Neville smiles with the sword, and Harry wanders the Great Hall, seeing the Weasley family and receiving greetings from others. Hagrid hugs Harry, and Filch futilely sweeps rubble while Hermione and Ron, holding hands, make Harry smile. Outside, the trio strolls along a ruined bridge, and Harry snaps the Elder Wand, tossing it into the chasm. Hermione takes Harry's hand, and Ron joins them as they gaze at the ruined school. At St. Pancras Hotel, an 11-year-old boy with dark hair, wearing a striped shirt, wheels a trolley with luggage and an animal cage along a platform at King's Cross Station."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "At St Pancras Hotel a grand building with a clock tower inside nearby King's Cross Station a darkhaired boy of 11 wearing a striped shirt wheels a trolley piled with luggage and an animal cage along a platform She looks down and takes Ron's hand and they stand on the rubblestrewn bridge with the ruined school behind them gazing ahead  He glances back at them and Hermione strides up to Harry and takes his hand looking at him admiringly while Ron follows her and stands on her other side  He nods to himself again and turns to the others before jumping down onto the bridge and walking away from them with Hermione and Ron turning to watch him  Hermione glances at Ron and they exchange a look as Harry snaps the wand in two and flings both parts off the bridge into the chasm below  As Harry toys with it and studies it closely he holds it horizontally in both hands  Outside in brilliant sunshine the three friends stroll aimlessly along the ruined bridge and Harry steps up onto a broken stone support to look out nodding to himself with the Elder Wand in his right hand  Filch makes a vain attempt to sweep up a mountain of rubble as Hermione and Ron walk into the Hall causing Harry to smile when he notices they are holding hands and Hermione glances down coyly  Harry stops in front of Hagrid who hugs him and then studies him causing Harry to grin as Hagrid turns and walks away  He walks past chattering students receives a weak smile from Cho Chang and sees Aberforth chatting to Dean and Seamus  Harry holding a mug wanders aimlessly through the Great Hall congealed blood under his right nostril and bottom lip and smiles when he sees the Weasley family together  Inside exhausted students sit on the stairs with Neville still holding the sword of Gryffindor smiling as Luna sits down coyly beside him  With his mouth gaping in horror he looks up as his body and clothes disintegrate into thousands of tiny pieces that float upwards and the morning sun shimmers through the mountains and Voldemort as they drift like ashes from a paper fire  Harry flicks his wand sending the Elder Wand cartwheeling through the air across the courtyard causing Voldemort to fall forwards as pieces of his skull break away  Red and green blasts meet in a brilliant white and orange glow as Harry presses forward forcing Voldemort back as the energy from the Elder Wand dissipates and dies  In the courtyard Voldemort reels and Harry turns to face him prompting the Dark Lord's face to fill with fury  Neville swings the sword of Gryffindor as a cloud of black smoke rises cradling Hermione in the rubble while the power fades in the Elder Wand "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Inside exhausted students sit on the stairs with Neville still holding the sword of Gryffindor smiling as Luna sits down coyly beside him  Red and green blasts meet in a brilliant white and orange glow as Harry presses forward forcing Voldemort back as the energy from the Elder Wand dissipates and dies  Hermione glances at Ron and they exchange a look as Harry snaps the wand in two and flings both parts off the bridge into the chasm below  Filch makes a vain attempt to sweep up a mountain of rubble as Hermione and Ron walk into the Hall causing Harry to smile when he notices they are holding hands and Hermione glances down coyly  In the courtyard Voldemort reels and Harry turns to face him prompting the Dark Lord's face to fill with fury  At St Pancras Hotel a grand building with a clock tower inside nearby King's Cross Station a darkhaired boy of 11 wearing a striped shirt wheels a trolley piled with luggage and an animal cage along a platform He nods to himself again and turns to the others before jumping down onto the bridge and walking away from them with Hermione and Ron turning to watch him  With his mouth gaping in horror he looks up as his body and clothes disintegrate into thousands of tiny pieces that float upwards and the morning sun shimmers through the mountains and Voldemort as they drift like ashes from a paper fire  He walks past chattering students receives a weak smile from Cho Chang and sees Aberforth chatting to Dean and Seamus  Harry flicks his wand sending the Elder Wand cartwheeling through the air across the courtyard causing Voldemort to fall forwards as pieces of his skull break away  She looks down and takes Ron's hand and they stand on the rubblestrewn bridge with the ruined school behind them gazing ahead  Harry stops in front of Hagrid who hugs him and then studies him causing Harry to grin as Hagrid turns and walks away  He glances back at them and Hermione strides up to Harry and takes his hand looking at him admiringly while Ron follows her and stands on her other side  Outside in brilliant sunshine the three friends stroll aimlessly along the ruined bridge and Harry steps up onto a broken stone support to look out nodding to himself with the Elder Wand in his right hand  As Harry toys with it and studies it closely he holds it horizontally in both hands  Harry holding a mug wanders aimlessly through the Great Hall congealed blood under his right nostril and bottom lip and smiles when he sees the Weasley family together  Neville swings the sword of Gryffindor as a cloud of black smoke rises cradling Hermione in the rubble while the power fades in the Elder Wand "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Filch makes a vain attempt to sweep up a mountain of rubble as Hermione and Ron walk into the Hall causing Harry to smile when he notices they are holding hands and Hermione glances down coyly  Outside in brilliant sunshine the three friends stroll aimlessly along the ruined bridge and Harry steps up onto a broken stone support to look out nodding to himself with the Elder Wand in his right hand  As Harry toys with it and studies it closely he holds it horizontally in both hands  Hermione glances at Ron and they exchange a look as Harry snaps the wand in two and flings both parts off the bridge into the chasm below  He nods to himself again and turns to the others before jumping down onto the bridge and walking away from them with Hermione and Ron turning to watch him  He glances back at them and Hermione strides up to Harry and takes his hand looking at him admiringly while Ron follows her and stands on her other side  She looks down and takes Ron's hand and they stand on the rubblestrewn bridge with the ruined school behind them gazing ahead  At St Pancras Hotel a grand building with a clock tower inside nearby King's Cross Station a darkhaired boy of 11 wearing a striped shirt wheels a trolley piled with luggage and an animal cage along a platform Neville swings the sword of Gryffindor as a cloud of black smoke rises cradling Hermione in the rubble while the power fades in the Elder Wand  In the courtyard Voldemort reels and Harry turns to face him prompting the Dark Lord's face to fill with fury  Red and green blasts meet in a brilliant white and orange glow as Harry presses forward forcing Voldemort back as the energy from the Elder Wand dissipates and dies  Harry flicks his wand sending the Elder Wand cartwheeling through the air across the courtyard causing Voldemort to fall forwards as pieces of his skull break away  With his mouth gaping in horror he looks up as his body and clothes disintegrate into thousands of tiny pieces that float upwards and the morning sun shimmers through the mountains and Voldemort as they drift like ashes from a paper fire  Inside exhausted students sit on the stairs with Neville still holding the sword of Gryffindor smiling as Luna sits down coyly beside him  Harry holding a mug wanders aimlessly through the Great Hall congealed blood under his right nostril and bottom lip and smiles when he sees the Weasley family together  He walks past chattering students receives a weak smile from Cho Chang and sees Aberforth chatting to Dean and Seamus  Harry stops in front of Hagrid who hugs him and then studies him causing Harry to grin as Hagrid turns and walks away "
        }
      ]
    }
  ]
}