{
  "ground_truth": "The dragon rises and breathes fire, then cowers as Griphook shakes a bell. Ron shakes the bell given to him by the goblin, allowing them to ease past the dragon. They continue along a narrow passageway and reach a door, where Griphook presses Bogrod's hand into the locking mechanism, causing Bogrod to grin inanely as the door opens. The dragon belches flame as they enter the vault and close the door. Light appears at the tip of their three wands, revealing a vault filled with treasure, including gold and silver goblets, candlesticks, jewels, and stacks of coins. Harry walks further into the vault, moving ahead of the others, until he stops, turns his head, blinks, and stares up at a gold cup with two handles. Hermione dislodges a ring, which replicates, causing other objects to start replicating. Hermione throws the ring to Harry, who, catching it, wades through the growing mass of treasure. Up to his knees, Harry scrambles over the treasure towards the cup, which has now risen to waist height. Harry stretches the sword high above his head, reaching for the cup, but he disappears from sight, lost in a mountain of gold and silver treasure. The others remain stock-still as he stumbles and drops the cup. Griphook grabs it as Harry tosses him the sword and flings the cup to Hermione. Griphook presses Bogrod's hand against the door, and replicating treasure tumbles out through the open doorway, burying the three inside the vault. Griphook rings the bells to keep the dragon at bay. Harry struggles out of the vault and runs to a balustrade, while Griphook runs off, leaving the grinning Bogrod alone with the dragon, which raises its head and breathes fire, incinerating Bogrod. Armed guards rush in, throwing explosive bursts from their wands, as Hermione destroys the balustrade and, taking a run-up, leaps through the opening onto the dragon's back. Clinging to its spikes, she hauls herself up as the beast belches flame and goblins take cover. Ron and Harry are still by the vault and leap onto the dragon's back. Hermione's spell releases the dragon's chains, and it breathes fire, looking up towards a pinprick of light high above. The three friends cling on desperately as the dragon climbs towards the light, while a guard shoots from an approaching rail cart, which the dragon knocks off the track with its head, causing the cart and its passengers to plummet. All is quiet in the banking hall as rows of tellers pore over ledgers, and above their heads, a chandelier starts to sway. A teller looks up as the dragon bursts through a grating in the floor, causing guards and goblins to flee the flames. The dragon's head hits the chandelier as the three cling on while it bursts its way through a glass dome onto the roof.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The serpent ascends and exhales flame, then cringes as Griphook jingles a chime. Ron jingles the chime bestowed to him by the goblin, permitting them to slip past the serpent. They proceed along a slender corridor and arrive at a portal, where Griphook pushes Bogrod's palm into the securing apparatus, causing Bogrod to beam inanely as the portal opens. The serpent belches blaze as they enter the vault and shut the portal. Illumination materializes at the tip of their three rods, uncovering a vault brimming with riches, including gold and silver chalices, candelabras, gems, and heaps of coins. Harry strides further into the vault, advancing ahead of the others, until he halts, turns his head, blinks, and gazes up at a gold vessel with two grips. Hermione dislodges a circlet, which duplicates, causing other items to begin duplicating. Hermione hurls the circlet to Harry, who, catching it, wades through the expanding mass of riches. Up to his knees, Harry scrambles over the riches towards the vessel, which has now ascended to waist height. Harry stretches the blade high above his head, reaching for the vessel, but he vanishes from view, concealed in a mound of gold and silver riches. The others remain motionless as he stumbles and drops the vessel. Griphook snatches it as Harry tosses him the blade and flings the vessel to Hermione. Griphook presses Bogrod's palm against the portal, and duplicating riches cascade out through the open doorway, entombing the three inside the vault. Griphook chimes the bells to keep the serpent at bay. Harry struggles out of the vault and runs to a balustrade, while Griphook dashes off, leaving the beaming Bogrod alone with the serpent, which elevates its head and exhales flame, incinerating Bogrod. Armed sentinels rush in, casting explosive bursts from their rods, as Hermione demolishes the balustrade and, taking a run-up, leaps through the aperture onto the serpent's back. Clinging to its spines, she hoists herself up as the beast belches blaze and goblins seek cover. Ron and Harry are still by the vault and leap onto the serpent's back. Hermione's enchantment releases the serpent's chains, and it exhales flame, gazing up towards a pinpoint of glow high above. The three allies cling on desperately as the serpent ascends towards the glow, while a sentinel fires from an approaching rail carriage, which the serpent knocks off the track with its skull, causing the carriage and its occupants to descend. All is silent in the banking chamber as rows of tellers pore over registers, and above their heads, a chandelier starts to sway. A teller glances up as the serpent bursts through a grating in the floor, causing sentinels and goblins to flee the flames. The serpent's skull hits the chandelier as the three cling on while it bursts its way through a glass dome onto the rooftop."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The dragon is risen and fire is breathed by it, then it cowers as a bell is shaken by Griphook. The bell given to Ron by the goblin is shaken by Ron, allowing the dragon to be eased past by them. A narrow passageway is continued along by them, and a door is reached, where Bogrod's hand is pressed by Griphook into the locking mechanism, causing an inane grin to be given by Bogrod as the door is opened. Flame is belched by the dragon as the vault is entered by them and the door is closed. Light is appeared at the tip of their three wands, revealing a vault filled with treasure, including gold and silver goblets, candlesticks, jewels, and stacks of coins. Further into the vault walks Harry, moving ahead of the others, until a stop is made by him, his head is turned, he blinks, and a stare is cast up at a gold cup with two handles. A ring is dislodged by Hermione, which is replicated, causing other objects to start replicating. The ring is thrown by Hermione to Harry, who, catching it, wades through the growing mass of treasure. Harry, up to his knees, scrambles over the treasure towards the cup, which has now risen to waist height. The sword is stretched high above his head by Harry, reaching for the cup, but he disappears from sight, lost in a mountain of gold and silver treasure. Stock-still remain the others as the cup is stumbled upon and dropped by him. The cup is grabbed by Griphook as the sword is tossed to him by Harry and thrown to Hermione. Bogrod's hand is pressed by Griphook against the door, and replicating treasure is tumbled out through the open doorway, burying the three inside the vault. The bells are rung by Griphook to keep the dragon at bay. Out of the vault struggles Harry and runs to a balustrade, while Griphook runs off, leaving the grinning Bogrod alone with the dragon, which raises its head and fire is breathed, incinerating Bogrod. Armed guards rush in, explosive bursts are thrown from their wands, as the balustrade is destroyed by Hermione and, taking a run-up, leaps through the opening onto the back of the dragon. Clinging to its spikes, she hauls herself up as flame is belched by the beast and goblins take cover. Ron and Harry are still by the vault and the dragon's back is leapt onto by them. The dragon's chains are released by Hermione's spell, and fire is breathed by it, looking up towards a pinprick of light high above. The three friends cling on desperately as the dragon is climbed towards by them towards the light, while a shot is taken by a guard from an approaching rail cart, which is knocked off the track by the dragon's head, causing the cart and its passengers to plummet. All is quiet in the banking hall as ledgers are pored over by rows of tellers, and above their heads, a chandelier starts to sway. Up looks a teller as the dragon bursts through a grating in the floor, causing guards and goblins to flee the flames. The chandelier is hit by the dragon's head as the three cling on while a burst is made its way through a glass dome onto the roof."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The dragon rises and breathes fire, then cowers as Griphook rings a bell. Ron uses the goblin's bell to ease past the dragon. They proceed down a narrow passage to a door, where Griphook uses Bogrod's hand to unlock it, making Bogrod grin as it opens. The dragon breathes fire as they enter and close the door. Light from their wands reveals a treasure-filled vault with goblets, candlesticks, jewels, and coins. Harry moves ahead, stops, and stares at a gold cup. Hermione dislodges a ring, which replicates, starting a chain reaction. She throws the ring to Harry, who wades through the treasure. He scrambles toward the cup, raising the sword to reach it but vanishes in gold and silver. The others stay still as he stumbles and drops the cup. Griphook grabs it as Harry tosses him the sword and gives the cup to Hermione. Griphook uses Bogrod's hand to open the door, and replicating treasure spills out, burying them. Griphook rings the bells to control the dragon. Harry escapes, runs to a balustrade, while Griphook departs, leaving Bogrod incinerated by the dragon's fire. Armed guards arrive, throwing explosive spells. Hermione destroys the balustrade and leaps onto the dragon, hauling herself up as it breathes fire. Ron and Harry jump onto the dragon. Hermione releases its chains, and it ascends toward light. The trio clings on as a guard shoots from a rail cart, which the dragon knocks off track. In the banking hall, as tellers work, a chandelier sways. A teller looks up as the dragon bursts through the floor, causing chaos. The dragon hits the chandelier, breaks through a dome, and reaches the roof as the three cling on."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The dragon rises, breathing fire, then cowers as Griphook shakes a bell. Ron uses the bell to ease past it. They reach a door where Griphook uses Bogrod's hand to unlock it, making Bogrod grin. The dragon belches flame as they enter the vault, revealing treasure. Harry, ahead of the others, stops at a gold cup. Hermione dislodges a ring, causing replication. She throws it to Harry, who wades through the growing treasure towards the cup. Harry reaches for it, but vanishes in a mountain of gold. He stumbles, dropping the cup, which Griphook grabs and tosses to Hermione. Griphook uses Bogrod's hand again, burying the three inside the vault. He rings the bells, keeping the dragon at bay. Harry escapes and runs to a balustrade, while Griphook flees, leaving Bogrod to be incinerated by the dragon. Armed guards attack as Hermione destroys the balustrade and leaps onto the dragon's back. Ron and Harry join her. Hermione releases the dragon's chains, and it flies towards a light, knocking an approaching rail cart off track. All is quiet in the hall until the dragon bursts through the floor, scattering guards and goblins. It hits a chandelier, then bursts through a glass dome onto the roof."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As the mighty dragon begins to rise majestically, it inhales deeply and then unleashes a furious torrent of scorching fire. However, it quickly shrinks back in fear when Griphook ominously shakes a little bell. Ron, holding the bell that had been handed to him by the goblin, gives it a shake, thereby creating a magical distraction that allows them to ease their way past the formidable beast. They continue onward, maneuvering along a narrow, winding passageway and eventually arrive at a door. Here, Griphook takes Bogrod's hand and firmly presses it into the intricate locking mechanism, which triggers a response causing Bogrod to grin inanely as the door slowly swings open. The dragon emits a fiery belch just as they enter the vault, hastily closing the door behind them. Light materializes at the very tips of their three wands, illuminating an awe-inspiring sight: a vault brimming with all sorts of treasures, including dazzling gold and silver goblets, intricately designed candlesticks, sparkling jewels, and stacks of gleaming coins. Harry advances further into the vault, moving confidently ahead of his companions, until he comes to a halt, turns his head slightly, blinks in amazement, and gazes upward at a magnificent gold cup adorned with two elegant handles. Meanwhile, Hermione accidentally dislodges a ring, which astonishingly replicates, triggering a chain reaction as other objects follow suit. Hermione quickly tosses the ring to Harry, who catches it deftly and wades through the rapidly growing mass of treasure. Up to his knees now, Harry struggles and scrambles over the mountain of treasure, striving to reach the cup that has now risen to a daunting waist height. With great determination, Harry stretches the sword high above his head, attempting to grab the cup, but then he vanishes from sight, swallowed by a veritable mountain of gold and silver treasures. The others stand rooted to their spots as he stumbles and inadvertently drops the cup. In a quick maneuver, Griphook snatches it up as Harry throws the sword to him, and then flings the cup to Hermione. Griphook uses Bogrod's hand against the door once more, with replicating treasure pouring through the open doorway, burying the three companions inside the vault. Griphook rings the bell again to keep the dragon at a safe distance. Harry struggles vigorously to extricate himself from the vault and makes a dash to a nearby balustrade, while Griphook scampers off, leaving the grinning Bogrod alone to face the dragon, which ominously raises its head and breathes out a deadly stream of fire, incinerating Bogrod in an instant. Armed guards rush in, unleashing explosive bursts from their wands, while Hermione strategically demolishes the balustrade and, with a determined run-up, leaps through the opening, landing onto the dragon’s enormous back. Clinging desperately to its intimidating spikes, she pulls herself up just as the beast releases a belch of flames, causing the goblins to duck for cover. Ron and Harry, still near the vault, leap onto the dragon's back in a daring move. Hermione casts a spell that releases the dragon from its chains, and it breathes fire once more, gazing upward toward a distant pinprick of light high above them. The trio clings on desperately as the dragon begins its ascent skyward toward the small glimmer of light, while a guard fires shots from an advancing rail cart. The dragon retaliates by striking it off the track with its massive head, sending both the cart and its unfortunate passengers plummeting. A hush falls over the banking hall, where rows of tellers diligently peruse ledgers, while above them, a grand chandelier begins to sway ominously. A teller looks up just as the dragon erupts through a grating in the floor, sending guards and goblins alike scattering from the fierce flames. The dragon’s head crashes into the chandelier as the three friends cling on tightly while it forces its way through a fragile glass dome, finally emerging triumphantly onto the roof."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As the mighty and imposing dragon begins to rise with breathtaking majesty, it inhales deeply, drawing in a vast amount of air, and then, in a sudden and powerful release, unleashes a furious torrent of scorching, blistering fire. However, it quickly shrinks back in palpable fear and trepidation when Griphook ominously shakes a small and seemingly innocuous little bell. Ron, clutching the bell that had been handed to him by the goblin, gives it a deliberate shake, thereby creating a magical distraction that cleverly allows them to ease their way past the formidable, fire-breathing beast. They continue onward, carefully maneuvering along a narrow, winding passageway, and eventually arrive at a solid door. At this point, Griphook takes Bogrod's hand confidently and firmly presses it into the intricate and complex locking mechanism, which triggers an almost mechanical response causing Bogrod to grin inanely as the door slowly swings open with a creak. The dragon emits a fiery belch just as they hurriedly enter the vault, hastily closing the door behind them to ensure their safety. Light materializes at the very tips of their three wands, illuminating an awe-inspiring sight before them: a vault brimming with all sorts of treasures, including dazzling gold and silver goblets, intricately designed candlesticks, sparkling jewels, and stacks of gleaming, glittering coins. Harry advances further into the vault, moving confidently ahead of his companions, until he comes to an abrupt halt, turns his head slightly, blinks in sheer amazement, and gazes upward at a magnificent, exquisite gold cup adorned with two elegant handles. Meanwhile, Hermione accidentally dislodges a ring, which astonishingly begins to replicate, triggering a chain reaction as other objects follow suit. Hermione quickly tosses the ring to Harry, who catches it deftly and wades through the rapidly growing and multiplying mass of treasure. Up to his knees now in the gleaming treasures, Harry struggles and scrambles over the burgeoning mountain of treasure, striving to reach the cup that has now risen to a daunting waist height. With great determination, Harry stretches the sword high above his head, attempting to grab the elusive cup, but then he suddenly vanishes from sight, swallowed whole by a veritable mountain of gold and silver treasures. The others stand rooted to their spots as he stumbles and inadvertently drops the cup. In a quick, deft maneuver, Griphook snatches it up as Harry throws the sword to him, and then flings the cup to Hermione. Griphook uses Bogrod's hand against the door once more, with the replicating treasure pouring through the open doorway, burying the three companions inside the vault. Griphook rings the bell again to keep the intimidating dragon at a safe distance. Harry struggles vigorously to extricate himself from the vault and makes a dash to a nearby balustrade, while Griphook scampers off into the distance, leaving the grinning Bogrod alone to face the dragon, which ominously raises its head and breathes out a deadly stream of fire, incinerating Bogrod in an instant. Armed guards rush in, unleashing explosive bursts from their wands, while Hermione strategically demolishes the balustrade and, with a determined run-up, leaps gracefully through the opening, landing onto the dragon’s enormous, menacing back. Clinging desperately to its intimidating spikes, she pulls herself up just as the beast releases a belch of flames, causing the goblins to duck for cover. Ron and Harry, who are still near the vault, leap onto the dragon's back in a daring move. Hermione deftly casts a spell that releases the dragon from its chains, and it breathes fire once more, gazing upward toward a distant pinprick of light high above them. The trio clings on desperately as the dragon begins its ascent skyward toward the small glimmer of light, while a guard fires shots from an approaching rail cart. The dragon retaliates by striking it off the track with its massive head, sending both the cart and its unfortunate passengers plummeting to the ground below. A hush falls over the bustling banking hall, where rows of tellers diligently peruse their ledgers, while above them, an opulent grand chandelier begins to sway ominously. A teller looks up just as the dragon erupts violently through a grating in the floor, sending guards and goblins alike scattering from the fierce, raging flames. The dragon’s head crashes into the chandelier as the three friends cling on tightly, while it forces its way triumphantly through a fragile glass dome, finally emerging onto the rooftop, victorious and free."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the immense dragon begins to rise from its resting position, it draws in a deep breath and releases a fiery torrent from its open mouth, filling the air with heat and light. However, its intimidating display is abruptly cut short when Griphook, with precise timing, shakes a bell, creating a sound that compels the fearsome beast to cower back into submission. Seizing the opportunity created by the goblin's strategic intervention, Ron takes hold of the bell handed to him by Griphook and shakes it with determined purpose, allowing their party to advance past the subdued dragon without provoking its wrath. As they proceed cautiously through the narrow passageway, they eventually reach a hefty door. Here, Griphook takes Bogrod's hand and applies it to the locking mechanism embedded in the door. The contact activates the mechanism, and a faint but unmistakably vacant grin spreads across Bogrod’s face as the door swings open to reveal what lies beyond. As they cross the threshold and enter the vault, the dragon, now behind them, releases another jet of flame in a belch of defiance, but they quickly shut the door, momentarily sealing themselves safely inside. At the tip of their three wands, light springs forth, illuminating the vast chamber before them, which is stacked high with dazzling treasures—glinting gold and silver goblets, ornate candlesticks, brilliant jewels, and heaps of coins that shimmer enticingly under their wand-light. With keen interest, Harry ventures further into the vault, moving confidently ahead of his companions. He halts his forward motion, turns his head slightly, blinks as if to reassess his sight, and fixes his gaze on a particular gold cup with two gracefully curved handles. Meanwhile, Hermione, inadvertently, causes a ring to dislodge from its perch. This simple act triggers a chain reaction, causing the surrounding objects to begin replicating themselves. In a rapid response, she hurls the troublesome ring towards Harry. He deftly catches it and begins to maneuver through the multiplying treasure, which now rises to engulf his lower legs. As the gleaming riches pile up relentlessly, reaching his waist, Harry strains and scrambles over the burgeoning mass, his eyes still on the gold cup that now seems to float almost within his grasp. Determined, Harry raises the sword high above him, stretching to seize the cup, but the swelling tide of precious metals and duplicating artifacts soon swallows him, obscuring him from view beneath an overwhelming mound of wealth. The others stand frozen in place as Harry, partially buried, struggles to maintain his balance. As he fumbles, the cup slips from his grip, but Griphook acts swiftly, snatching it up. In a synchronized gesture, Harry relinquishes the sword to Griphook, who in turn flings the cup to Hermione. Griphook then repositions Bogrod's hand to the door's mechanism, triggering the doorway to swing open once again, allowing the continuously replicating treasure to spill out, enveloping the trio inside the vault in a cascade of golden chaos. Amid the clamor, Griphook shakes the bells once more, ensuring the dragon remains at bay. In the midst of this tumult, Harry manages to extricate himself from the vault's suffocating grip and dashes towards a nearby balustrade. As Griphook seizes the moment to escape, he abandons the still-grinning Bogrod to face the dragon alone. The creature, rising once more, emits another searing conflagration, which engulfs Bogrod completely. Chaos ensues as armed guards respond, rushing into the fray and unleashing explosive spell bursts from their wands. Seizing the moment, Hermione destroys the balustrade, and with a calculated build-up of speed, she launches herself through the opening, landing squarely on the dragon’s back. Gripping its spikes with determination, she pulls herself upward as the beast releases yet another fiery plume and the nearby goblins scatter for cover. Meanwhile, as Ron and Harry linger near the vault, they spring into action, leaping onto the dragon's back to join Hermione. With a decisive incantation, Hermione's spell severs the chains that bind the dragon, setting it free. Unfettered, the creature rears upward, exhaling fire and fixing its gaze on a distant pinprick of light far above. Clinging tightly to its scales, the three intrepid friends hold on as the dragon begins a steady ascent toward the beckoning light. A guard, advancing towards them in a rail cart, unleashes a shot aimed at the trio, but the dragon swiftly counters, using its powerful head to dislodge the cart from its track, sending it and its hapless occupants plummeting into the abyss below. Down in the banking hall, a deceptive calm prevails as rows of tellers focus diligently on their ledgers, all unaware of the impending upheaval. Above them, a chandelier starts to sway ominously, prompting one teller to glance upward at the precise moment the dragon erupts through a floor grating, unleashing its fiery breath upon the hall. Guards and goblins flee before the onslaught as the dragon’s head collides with the chandelier. Despite the tumult, the three friends remain steadfast, clinging desperately to the dragon as it demolishes the glass dome above them, ultimately perching triumphantly on the roof, free at last."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The dragon rises, breathes fire, and then cowers as Griphook and Ron use a bell to ease past it. They proceed along a narrow passageway to a door, where Griphook uses Bogrod's hand to unlock it, causing Bogrod to grin inanely. As they enter the vault and close the door, the dragon belches flame behind them. Illuminated by their wand tips, the vault reveals an array of treasures, including goblets, candlesticks, jewels, and coins. Harry ventures further inside, fixating on a gold cup with two handles. Meanwhile, Hermione dislodges a ring that replicates, triggering other objects to do the same. She tosses the ring to Harry, who makes his way through the growing mass of treasure to reach the cup, now risen to waist height. Stretching the sword above his head, Harry reaches for the cup but disappears under a rising pile of gold and silver. As he stumbles, Griphook seizes the cup after Harry tosses him the sword, and then throws the cup to Hermione. Using Bogrod's hand, Griphook opens the door, releasing a torrent of replicating treasure that buries them inside. Griphook rings the bells to keep the dragon at bay as Harry escapes to a balustrade. Griphook flees, leaving Bogrod alone to be incinerated by the dragon. Armed guards enter, casting explosive spells. Hermione destroys the balustrade and jumps onto the dragon's back, urging Ron and Harry to follow. Her spell releases the dragon's chains, and it ascends toward a distant light. Clinging on as the dragon knocks a rail cart off its path, the three friends hang on tightly. In the banking hall, tellers are oblivious until the dragon bursts through the floor, sending guards and goblins fleeing. The dragon’s head hits a chandelier as it smashes through a glass dome onto the roof."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The dragon, a creature often associated with mythical tales and known for guarding treasures, rises and breathes fire, then cowers as Griphook, a cunning goblin familiar with the dragon's weaknesses, shakes a bell. Ron shakes the bell given to him by the goblin, a member of the ancient race skilled in metalwork and banking, allowing them to ease past the dragon. They continue along a narrow passageway expertly carved into the stone by generations of goblins and reach a door, where Griphook presses Bogrod's hand, the goblin banker under an enchantment, into the locking mechanism, causing Bogrod to grin inanely as the door opens. The dragon belches flame as they enter the vault, a high-security storage for valuables, and close the door. Light appears at the tip of their three wands, magical tools used by wizards to channel their spells, revealing a vault filled with treasure, including gold and silver goblets, candlesticks, jewels, and stacks of coins—prized possessions amassed over centuries. Harry walks further into the vault, moving ahead of the others, until he stops, turns his head, blinks, and stares up at a gold cup with two handles, identified as a significant magical artifact. Hermione dislodges a ring, which replicates due to a protective enchantment, causing other objects to start replicating. Hermione throws the ring to Harry, who, catching it, wades through the growing mass of treasure, a defensive measure against intruders. Up to his knees, Harry scrambles over the treasure towards the cup, which has now risen to waist height. Harry stretches the sword, a weapon once belonging to a legendary wizard, high above his head, reaching for the cup, but he disappears from sight, lost in a mountain of gold and silver treasure. The others remain stock-still as he stumbles and drops the cup. Griphook grabs it as Harry tosses him the sword and flings the cup to Hermione. Griphook presses Bogrod's hand against the door, and replicating treasure tumbles out through the open doorway, burying the three inside the vault. Griphook, knowing the dragon's fear of bells, rings them to keep the dragon at bay. Harry struggles out of the vault and runs to a balustrade, part of the ornate architecture common in ancient buildings, while Griphook runs off, leaving the grinning Bogrod, still under enchantment, alone with the dragon, which raises its head and breathes fire, incinerating Bogrod. Armed guards, tasked with protecting the vault, rush in, throwing explosive bursts from their wands, as Hermione destroys the balustrade and, taking a run-up, leaps through the opening onto the dragon's back. Clinging to its spikes, she hauls herself up as the beast belches flame and goblins take cover. Ron and Harry are still by the vault and leap onto the dragon's back. Hermione's spell releases the dragon's chains, a sign of their captivity, and it breathes fire, looking up towards a pinprick of light high above, a glimmer of freedom. The three friends cling on desperately as the dragon climbs towards the light, while a guard shoots from an approaching rail cart, part of the underground transport system, which the dragon knocks off the track with its head, causing the cart and its passengers to plummet. All is quiet in the banking hall, the financial hub of the building, as rows of tellers pore over ledgers, and above their heads, a chandelier starts to sway. A teller looks up as the dragon bursts through a grating in the floor, causing guards and goblins to flee the flames. The dragon's head hits the chandelier as the three cling on while it bursts its way through a glass dome onto the roof, a dramatic escape into the open sky."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Light appears at the tip of their three wands revealing a vault filled with treasure including gold and silver goblets candlesticks jewels and stacks of coins The three friends cling on desperately as the dragon climbs towards the light while a guard shoots from an approaching rail cart which the dragon knocks off the track with its head causing the cart and its passengers to plummet The dragon rises and breathes fire then cowers as Griphook shakes a bell The dragon belches flame as they enter the vault and close the door Ron shakes the bell given to him by the goblin allowing them to ease past the dragon They continue along a narrow passageway and reach a door where Griphook presses Bogrod's hand into the locking mechanism causing Bogrod to grin inanely as the door opens The dragon belches flame as they enter the vault and close the door The dragon rises and breathes fire then cowers as Griphook shakes a bell Up to his knees Light appears at the tip of their three wands revealing a vault filled with treasure including gold and silver goblets candlesticks jewels and stacks of coins Harry walks further into the vault moving ahead of the others until he stops turns his head blinks and stares up at a gold cup with two handles Hermione dislodges a ring which replicates causing other objects to start replicating A teller looks up as the dragon bursts through a grating in the floor causing guards and goblins to flee the flames Hermione throws the ring to Harry who catching it wades through the growing mass of treasure Harry scrambles over the treasure towards the cup which has now risen to waist height Up to his knees Harry scrambles over the treasure towards the cup which has now risen to waist height All is quiet in the banking hall as rows of tellers pore over ledgers and above their heads a chandelier starts to sway Harry stretches the sword high above his head reaching for the cup but he disappears from sight lost in a mountain of gold and silver treasure The others remain stockstill as he stumbles and drops the cup Hermione throws the ring to Harry who catching it wades through the growing mass of treasure Griphook grabs it as Harry tosses him the sword and flings the cup to Hermione Griphook presses Bogrod's hand against the door and replicating treasure tumbles out through the open doorway burying the three inside the vault Hermione's spell releases the dragon's chains and it breathes fire looking up towards a pinprick of light high above Griphook rings the bells to keep the dragon at bay Harry struggles out of the vault and runs to a balustrade while Griphook runs off leaving the grinning Bogrod alone with the dragon which raises its head and breathes fire incinerating Bogrod Armed guards rush in throwing explosive bursts from their wands as Hermione destroys the balustrade and taking a runup leaps through the opening onto the dragon's back Clinging to its spikes she hauls herself up as the beast belches flame and goblins take cover They continue along a narrow passageway and reach a door where Griphook presses Bogrod's hand into the locking mechanism causing Bogrod to grin inanely as the door opens Hermione dislodges a ring which replicates causing other objects to start replicating Ron and Harry are still by the vault and leap onto the dragon's back Hermione's spell releases the dragon's chains and it breathes fire looking up towards a pinprick of light high above The three friends cling on desperately as the dragon climbs towards the light while a guard shoots from an approaching rail cart which the dragon knocks off the track with its head causing the cart and its passengers to plummet All is quiet in the banking hall as rows of tellers pore over ledgers and above their heads a chandelier starts to sway A teller looks up as the dragon bursts through a grating in the floor causing guards and goblins to flee the flames The dragon's head hits the chandelier as the three cling on while it bursts its way through a glass dome onto the roof"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The dragon rises and breathes fire then cowers as Griphook shakes a bell. Ron shakes the bell given to him by the goblin allowing them to ease past the dragon. They continue along a narrow passageway and reach a door where Griphook presses Bogrod's hand into the locking mechanism causing Bogrod to grin inanely as the door opens. The dragon belches flame as they enter the vault and close the door. Light appears at the tip of their three wands revealing a vault filled with treasure including gold and silver goblets candlesticks jewels and stacks of coins. Harry walks further into the vault moving ahead of the others until he stops turns his head blinks and stares up at a gold cup with two handles. Hermione dislodges a ring which replicates causing other objects to start replicating. Hermione throws the ring to Harry who catching it wades through the growing mass of treasure. Up to his knees. Harry scrambles over the treasure towards the cup which has now risen to waist height. Harry stretches the sword high above his head reaching for the cup but he disappears from sight lost in a mountain of gold and silver treasure. The others remain stockstill as he stumbles and drops the cup. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Griphook grabs it as Harry tosses him the sword and flings the cup to Hermione. Griphook presses Bogrod's hand against the door and replicating treasure tumbles out through the open doorway burying the three inside the vault. Griphook rings the bells to keep the dragon at bay. Harry struggles out of the vault and runs to a balustrade while Griphook runs off leaving the grinning Bogrod alone with the dragon which raises its head and breathes fire incinerating Bogrod. Armed guards rush in throwing explosive bursts from their wands as Hermione destroys the balustrade and taking a runup leaps through the opening onto the dragon's back. Clinging to its spikes she hauls herself up as the beast belches flame and goblins take cover. Ron and Harry are still by the vault and leap onto the dragon's back. Hermione's spell releases the dragon's chains and it breathes fire looking up towards a pinprick of light high above. The three friends cling on desperately as the dragon climbs towards the light while a guard shoots from an approaching rail cart which the dragon knocks off the track with its head causing the cart and its passengers to plummet. All is quiet in the banking hall as rows of tellers pore over ledgers and above their heads a chandelier starts to sway. A teller looks up as the dragon bursts through a grating in the floor causing guards and goblins to flee the flames. The dragon's head hits the chandelier as the three cling on while it bursts its way through a glass dome onto the roof."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The dragon rises and breathes fire then cowers as Griphook shakes a bell. Ron shakes the bell given to him by the goblin allowing them to ease past the dragon. They continue along a narrow passageway and reach a door where Griphook presses Bogrod's hand into the locking mechanism causing Bogrod to grin inanely as the door opens. The dragon belches flame as they enter the vault and close the door. Light appears at the tip of their three wands revealing a vault filled with treasure including gold and silver goblets candlesticks jewels and stacks of coins. Harry walks further into the vault moving ahead of the others until he stops turns his head blinks and stares up at a gold cup with two handles. Hermione dislodges a ring which replicates causing other objects to start replicating. Hermione throws the ring to Harry who catching it wades through the growing mass of treasure. Up to his knees. Harry scrambles over the treasure towards the cup which has now risen to waist height. Harry stretches the sword high above his head reaching for the cup but he disappears from sight lost in a mountain of gold and silver treasure. The others remain stockstill as he stumbles and drops the cup. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Griphook grabs it as Harry tosses him the sword and flings the cup to Hermione. Griphook presses Bogrod's hand against the door and replicating treasure tumbles out through the open doorway burying the three inside the vault. Griphook rings the bells to keep the dragon at bay. Harry struggles out of the vault and runs to a balustrade while Griphook runs off leaving the grinning Bogrod alone with the dragon which raises its head and breathes fire incinerating Bogrod. Armed guards rush in throwing explosive bursts from their wands as Hermione destroys the balustrade and taking a runup leaps through the opening onto the dragon's back. Clinging to its spikes she hauls herself up as the beast belches flame and goblins take cover. Ron and Harry are still by the vault and leap onto the dragon's back. Hermione's spell releases the dragon's chains and it breathes fire looking up towards a pinprick of light high above. The three friends cling on desperately as the dragon climbs towards the light while a guard shoots from an approaching rail cart which the dragon knocks off the track with its head causing the cart and its passengers to plummet. All is quiet in the banking hall as rows of tellers pore over ledgers and above their heads a chandelier starts to sway. A teller looks up as the dragon bursts through a grating in the floor causing guards and goblins to flee the flames. The dragon's head hits the chandelier as the three cling on while it bursts its way through a glass dome onto the roof."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The dragon rises and breathes fire then cowers as Griphook shakes a bell. Ron shakes the bell given to him by the goblin allowing them to ease past the dragon. They continue along a narrow passageway and reach a door where Griphook presses Bogrod's hand into the locking mechanism causing Bogrod to grin inanely as the door opens. The dragon belches flame as they enter the vault and close the door. Light appears at the tip of their three wands revealing a vault filled with treasure including gold and silver goblets candlesticks jewels and stacks of coins. Harry walks further into the vault moving ahead of the others until he stops turns his head blinks and stares up at a gold cup with two handles. Ron and Harry are still by the vault and leap onto the dragon's back. Hermione's spell releases the dragon's chains and it breathes fire looking up towards a pinprick of light high above. The three friends cling on desperately as the dragon climbs towards the light while a guard shoots from an approaching rail cart which the dragon knocks off the track with its head causing the cart and its passengers to plummet. All is quiet in the banking hall as rows of tellers pore over ledgers and above their heads a chandelier starts to sway. A teller looks up as the dragon bursts through a grating in the floor causing guards and goblins to flee the flames. The dragon's head hits the chandelier as the three cling on while it bursts its way through a glass dome onto the roof."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The dragon rises and breathes fire then cowers as Griphook shakes a bell. Ron shakes the bell given to him by the goblin allowing them to ease past the dragon. They continue along a narrow passageway and reach a door where Griphook presses Bogrod's hand into the locking mechanism causing Bogrod to grin inanely as the door opens. A teller looks up as the dragon bursts through a grating in the floor causing guards and goblins to flee the flames. The dragon's head hits the chandelier as the three cling on while it bursts its way through a glass dome onto the roof."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The squirrel rises and breathes fire, then cowers as the statue shakes a bell. The giraffe shakes the bell given to it by the turtle, allowing them to ease past the squirrel. They continue along a narrow passageway and reach a door, where the statue presses the musician's hand into the locking mechanism, causing the musician to grin inanely as the door opens. The squirrel belches flame as they enter the vault and close the door. Light appears at the tip of their three wands, revealing a vault filled with treasure, including gold and silver goblets, candlesticks, jewels, and stacks of coins. The penguin walks further into the vault, moving ahead of the others, until it stops, turns its head, blinks, and stares up at a gold cup with two handles. The kangaroo dislodges a ring, which replicates, causing other objects to start replicating. The kangaroo throws the ring to the penguin, who, catching it, wades through the growing mass of treasure. Up to its knees, the penguin scrambles over the treasure towards the cup, which has now risen to waist height. The penguin stretches the sword high above its head, reaching for the cup, but it disappears from sight, lost in a mountain of gold and silver treasure. The others remain stock-still as it stumbles and drops the cup. The statue grabs it as the penguin tosses it the sword and flings the cup to the kangaroo. The statue presses the musician's hand against the door, and replicating treasure tumbles out through the open doorway, burying the three inside the vault. The statue rings the bells to keep the squirrel at bay. The penguin struggles out of the vault and runs to a balustrade, while the statue runs off, leaving the grinning musician alone with the squirrel, which raises its head and breathes fire, incinerating the musician. Armed guards rush in, throwing explosive bursts from their wands, as the kangaroo destroys the balustrade and, taking a run-up, leaps through the opening onto the squirrel's back. Clinging to its spikes, it hauls itself up as the beast belches flame and turtles take cover. The giraffe and the penguin are still by the vault and leap onto the squirrel's back. The kangaroo's spell releases the squirrel's chains, and it breathes fire, looking up towards a pinprick of light high above. The three friends cling on desperately as the squirrel climbs towards the light, while a guard shoots from an approaching rail cart, which the squirrel knocks off the track with its head, causing the cart and its passengers to plummet. All is quiet in the banking hall as rows of hippos pore over ledgers, and above their heads, a chandelier starts to sway. A hippo looks up as the squirrel bursts through a grating in the floor, causing guards and turtles to flee the flames. The squirrel's head hits the chandelier as the three cling on while it bursts its way through a glass dome onto the roof."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The pegasus rises and breathes ice, then cowers as Griphook shakes a whistle. Ron shakes the whistle given to him by the elf, allowing them to ease past the pegasus. They continue along a narrow corridor and reach a gate, where Griphook presses Bogrod's paw into the release lever, causing Bogrod to grin inanely as the gate opens. The pegasus belches frost as they enter the chamber and close the door. Light appears at the tip of their three torches, revealing a chamber filled with riches, including emerald and sapphire goblets, lanterns, gemstones, and piles of trinkets. Harry walks further into the chamber, moving ahead of the others, until he stops, turns his head, blinks, and stares up at an emerald vase with two handles. Hermione dislodges a bracelet, which replicates, causing other items to start replicating. Hermione throws the bracelet to Harry, who, catching it, wades through the growing mass of riches. Up to his knees, Harry scrambles over the riches towards the vase, which has now risen to waist height. Harry stretches the staff high above his head, reaching for the vase, but he disappears from sight, lost in a mountain of emerald and sapphire riches. The others remain stock-still as he stumbles and drops the vase. Griphook grabs it as Harry tosses him the staff and flings the vase to Hermione. Griphook presses Bogrod's paw against the gate, and replicating riches tumble out through the open gateway, burying the three inside the chamber. Griphook rings the whistles to keep the pegasus at bay. Harry struggles out of the chamber and runs to a landing, while Griphook runs off, leaving the grinning Bogrod alone with the pegasus, which raises its head and breathes ice, freezing Bogrod. Armed sentries rush in, throwing explosive bursts from their torches, as Hermione destroys the landing and, taking a run-up, leaps through the opening onto the pegasus's back. Clinging to its feathers, she hauls herself up as the beast belches frost and elves take cover. Ron and Harry are still by the chamber and leap onto the pegasus's back. Hermione's spell releases the pegasus's harness, and it breathes ice, looking up towards a pinprick of light high above. The three friends cling on desperately as the pegasus climbs towards the light, while a sentry shoots from an approaching gondola, which the pegasus knocks off the track with its head, causing the gondola and its passengers to plummet. All is quiet in the trading hall as rows of scribes pore over scrolls, and above their heads, a lantern starts to sway. A scribe looks up as the pegasus bursts through a trapdoor in the floor, causing sentries and elves to flee the frost. The pegasus's head hits the lantern as the three cling on while it bursts its way through a glass turret onto the roof."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The dragon ascends and spits water, then trembles as Griphook jingles a flute. Ron waves the flute given to him by the goblin, allowing them to slip past the dragon. They wander along a narrow passageway and arrive at a door, where Griphook rubs Bogrod's hand on the locking mechanism, causing Bogrod to chuckle inanely as the door swings open. The dragon burps as they exit the vault and latch the door. Light flickers at the tip of their three wands, exposing a vault filled with treasure, including gold and silver goblets, candlesticks, jewels, and stacks of coins. Harry shuffles further into the vault, sauntering ahead of the others, until he pauses, tilts his head, squints, and glares up at a gold cup with two handles. Hermione snags a ring, which duplicates, causing other objects to start duplicating. Hermione flings the ring to Harry, who, catching it, strides through the swelling mass of treasure. Up to his knees, Harry crawls over the treasure towards the cup, which has now floated to waist height. Harry swings the sword high above his head, grasping for the cup, but he vanishes from sight, submerged in a mountain of gold and silver treasure. The others remain motionless as he falters and releases the cup. Griphook snatches it as Harry hands him the sword and chucks the cup to Hermione. Griphook strokes Bogrod's hand against the door, and duplicating treasure spills out through the open doorway, entombing the three inside the vault. Griphook chimes the flutes to keep the dragon at bay. Harry wriggles out of the vault and darts to a parapet, while Griphook hurries off, leaving the smirking Bogrod alone with the dragon, which lifts its head and spits water, dousing Bogrod. Armed guards storm in, launching explosive sparks from their wands, as Hermione dismantles the parapet and, taking a run-up, jumps through the gap onto the dragon's back. Clinging to its scales, she pulls herself up as the beast burps and goblins duck for cover. Ron and Harry are still by the vault and hop onto the dragon's back. Hermione's spell loosens the dragon's chains, and it spits water, gazing up towards a glimmer of light high above. The three friends cling on anxiously as the dragon soars towards the light, while a guard fires from an approaching rail cart, which the dragon nudges off the track with its nose, causing the cart and its passengers to tumble. All is silent in the banking hall as rows of tellers mull over ledgers, and above their heads, a chandelier sways. A teller glances up as the dragon breaks through a grating in the floor, causing guards and goblins to flee the steam. The dragon's head taps the chandelier as the three cling on while it smashes its way through a glass dome onto the roof."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The refrigerator rises and breathes clouds, then cowers as a shoelace shakes a spoon. A pancake shakes the spoon given to him by the aardvark, allowing them to ease past the refrigerator. They continue along a narrow riverbank and reach a trampoline, where a shoelace presses the panda's nose into the locking mechanism, causing the panda to grin inanely as the trampoline opens. The refrigerator belches rainbows as they enter the drum and close the trampoline. Light appears at the tip of their three forks, revealing a drum filled with trinkets, including emerald and bronze spatulas, candlesticks, marbles, and stacks of buttons. A kite walks further into the drum, moving ahead of the others, until it stops, turns its head, blinks, and stares up at a silver spoon with two handles. A trapeze dislodges a pebble, which replicates, causing other objects to start replicating. A trapeze throws the pebble to a kite, who, catching it, wades through the growing mass of trinkets. Up to its knees, a kite scrambles over the trinkets towards the spoon, which has now risen to waist height. A kite stretches the broom high above its head, reaching for the spoon, but it disappears from sight, lost in a mountain of emerald and bronze trinkets. The others remain stock-still as it stumbles and drops the spoon. A shoelace grabs it as a kite tosses it the broom and flings the spoon to a trapeze. A shoelace presses the panda's nose against the trampoline, and replicating trinkets tumble out through the open doorway, burying the three inside the drum. A shoelace rings the spoons to keep the refrigerator at bay. A kite struggles out of the drum and runs to a bookshelf, while a shoelace runs off, leaving the grinning panda alone with the refrigerator, which raises its head and breathes clouds, incinerating the panda. Armed penguins rush in, throwing explosive bursts from their forks, as a trapeze destroys the bookshelf and, taking a run-up, leaps through the opening onto the refrigerator's back. Clinging to its horns, she hauls herself up as the beast belches clouds and aardvarks take cover. A pancake and a kite are still by the drum and leap onto the refrigerator's back. A trapeze's spell releases the refrigerator's ropes, and it breathes clouds, looking up towards a pinprick of light high above. The three cactuses cling on desperately as the refrigerator climbs towards the light, while a penguin shoots from an approaching rail hammock, which the refrigerator knocks off the track with its hose, causing the hammock and its passengers to plummet. All is quiet in the trading hall as rows of podcasts pore over ledgers, and above their heads, a chandelier starts to sway. A podcast looks up as the refrigerator bursts through a drum in the floor, causing penguins and aardvarks to flee the clouds. The refrigerator's hose hits the chandelier as the three cling on while it bursts its way through a glass dome onto the roof."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The unicorn ascends and sings a melody, then crouches as Blitzen spins a top. Neville spins the top given to him by the elf, allowing them to sneak past the unicorn. They meander along a narrow passageway and reach a door, where Blitzen smacks Wiggly's foot into the locking mechanism, causing Wiggly to grimace inanely as the door opens. The unicorn hums a tune as they enter the vault and shut the door. Light glows at the tip of their three batons, uncovering a vault filled with treasure, including emerald and ruby vases, candelabras, trinkets, and piles of gems. Luna skips further into the vault, pirouetting ahead of the others, until she pauses, tilts her head, winks, and gawks up at a silver platter with two edges. Ginny loosens a bracelet, which multiplies, causing other objects to start multiplying. Ginny hurls the bracelet to Luna, who, catching it, trudges through the expanding heap of treasure. Up to her waist, Luna clambers over the treasure towards the platter, which has now elevated to shoulder height. Luna hoists the staff high above her head, reaching for the platter, but she vanishes from sight, engulfed by a mound of emerald and ruby treasure. The others stand motionless as she trips and topples the platter. Blitzen snatches it as Luna flings him the staff and tosses the platter to Ginny. Blitzen smacks Wiggly's foot against the doorway, and multiplying treasure cascades out through the open gateway, entombing the three inside the vault. Blitzen rings the chimes to keep the unicorn at bay. Luna struggles out of the vault and strides to a ladder, while Blitzen dashes away, leaving the grinning Wiggly alone with the unicorn, which lifts its head and sings a tune, enchanting Wiggly. Armed guards hurry in, launching fireworks from their batons, as Ginny dismantles the ladder and, taking a step back, jumps through the gap onto the unicorn's back. Clutching its mane, she pulls herself up as the creature hums a tune and elves take cover. Neville and Luna are still by the vault and jump onto the unicorn's back. Ginny's incantation loosens the unicorn's bands, and it sings a melody, gazing up towards a pinprick of light high above. The three friends cling on intently as the unicorn climbs towards the light, while a guard fires from an approaching cable car, which the unicorn nudges off the track with its mane, causing the car and its riders to descend. All is serene in the banking hall as rows of tellers immerse over scrolls, and above their heads, a mobile begins to sway. A teller glances up as the unicorn erupts through a vent in the floor, urging guards and elves to scurry from the tunes. The unicorn's mane brushes the mobile as the three cling on while it bursts its way through a glass ceiling onto the roof."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The dragon ascends and exhales smoke, then ducks as Griphook rattles a tambourine. Ron jingles the tambourine given to him by the goblin, allowing them to slide past the dragon. They proceed along a winding corridor and arrive at a window, where Griphook presses Bogrod's foot against the opening mechanism, causing Bogrod to chuckle inanely as the window swings open. The dragon exhales mist as they enter the chamber and shut the window. Glow appears at the tips of their three staffs, uncovering a chamber filled with riches, including platinum and bronze chalices, lanterns, crystals, and piles of tokens. Harry strolls further into the chamber, advancing ahead of the others, until he halts, turns his gaze, blinks, and fixes his eyes on a bronze cup with three handles. Hermione pulls out a medallion, which multiplies, causing other items to start multiplying. Hermione tosses the medallion to Harry, who, catching it, trudges through the expanding heap of riches. Up to his waist, Harry clambers over the wealth towards the cup, which has now elevated to chest height. Harry swings the spear high above his head, grasping for the cup, but he vanishes from view, engulfed in a hill of platinum and bronze riches. The others stand motionless as he trips and drops the cup. Griphook snatches it as Harry throws him the spear and flings the cup to Hermione. Griphook presses Bogrod's foot against the window, and multiplying riches spill out through the open window, burying the three inside the chamber. Griphook shakes the tambourines to keep the dragon at a distance. Harry struggles out of the chamber and runs to a fence, while Griphook scurries away, leaving the chuckling Bogrod alone with the dragon, which lifts its snout and exhales smoke, scorching Bogrod. Armed sentinels rush in, tossing electric sparks from their staffs, as Hermione shatters the fence and, taking a sprint, jumps through the gap onto the dragon's back. Clinging to its scales, she pulls herself up as the creature exhales mist and goblins dive for cover. Ron and Harry are still by the chamber and leap onto the dragon's back. Hermione's spell loosens the dragon's shackles, and it exhales smoke, gazing up towards a pinpoint of glow high above. The three friends hang on tightly as the dragon ascends towards the glow, while a sentinel shoots from an approaching trolley, which the dragon swipes off the path with its jaw, causing the trolley and its occupants to tumble. All is silent in the banking atrium as rows of clerks study documents, and above their heads, a lantern starts to oscillate. A clerk glances up as the dragon erupts through a ventilation grate in the flooring, causing sentinels and goblins to scatter from the mist. The dragon's snout nudges the lantern as the three cling on while it crashes its way through a crystal dome onto the rooftop."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The kitten levitates and sings a lullaby, then cringes as Zog clinks a spoon. Lucy clinks the spoon handed to her by the elf, allowing them to slink past the kitten. They meander along a winding corridor and find a curtain, where Zog nudges Fogo's foot into the unlocking contraption, prompting Fogo to frown vacantly as the curtain parts. The kitten hiccups smoke as they step into the tunnel and pull the curtain. Shadows dance at the edge of their three oars, uncovering a tunnel brimming with baubles, including bronze and platinum cups, lanterns, gems, and piles of pearls. George strides deeper into the tunnel, advancing past the rest, until he pauses, tilts his gaze, squints, and gazes up at a platinum vase with one handle. Sally unhooks a bracelet, which multiplies, causing other trinkets to begin multiplying. Sally hurls the bracelet to George, who, snatching it, trudges through the expanding mountain of baubles. Up to his elbows, George clambers over the baubles towards the vase, which has now risen to shoulder height. George hoists the shield high above his temple, grasping for the vase, but he vanishes from view, engulfed in a heap of bronze and platinum baubles. The others stand motionless as he trips and drops the vase. Zog snatches it as George hurls him the shield and tosses the vase to Sally. Zog nudges Fogo's foot against the curtain, and multiplying baubles cascade out through the open portal, engulfing the trio inside the tunnel. Zog strikes the spoons to deter the kitten. George fumbles out of the tunnel and dashes to a railing, while Zog sprints away, leaving the frowning Fogo alone with the kitten, which lifts its paw and sings a lullaby, vaporizing Fogo. Armed officers charge in, hurling dazzling flares from their oars, as Sally shatters the railing and, taking a leap, vaults through the chasm onto the kitten's back. Grasping its fur, she pulls herself up as the creature hiccups smoke and elves dive for cover. Lucy and George are still by the tunnel and leap onto the kitten's back. Sally's chant dissolves the kitten's chains, and it sings a lullaby, peering towards a dot of illumination high above. The three allies cling on frantically as the kitten ascends towards the glow, while a sentry launches from a nearing rail sled, which the kitten swats off the track with its nose, causing the sled and its riders to plunge. All is silent in the finance chamber as rows of accountants study books, and above their heads, a mobile begins to stir. An accountant glances up as the kitten bursts through a lattice in the ground, causing officers and elves to scatter from the lullaby. The kitten's nose collides with the mobile as the trio cling on while it barges through a glass peak onto the terrace."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The dragon rises and breathes fire but cowers when Griphook shakes a bell. Ron follows Griphook's lead, allowing them to safely pass the dragon. They reach a door, where Griphook uses Bogrod's hand to unlock it. Inside the vault filled with treasure, Hermione accidentally causes objects to replicate. She throws a ring to Harry, who, wading through the multiplying treasure, reaches for a gold cup. Harry raises a sword to grab it but disappears in the growing pile of treasure. Griphook seizes the cup, and as Harry tosses him the sword, Griphook opens the door, burying the group as he rings the bells to keep the dragon at bay. Harry escapes and joins Hermione and Ron as they leap onto the dragon's back. Hermione frees the dragon, which ascends towards a light above. Guards attack, but the dragon knocks them off their rail cart. In the banking hall, the dragon bursts through, causing chaos as guards and goblins flee. It breaks through a glass dome, and the trio holds on as it reaches the roof."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The dragon's head hits the chandelier as the three cling on while it bursts its way through a glass dome onto the roof A teller looks up as the dragon bursts through a grating in the floor causing guards and goblins to flee the flames All is quiet in the banking hall as rows of tellers pore over ledgers and above their heads a chandelier starts to sway The three friends cling on desperately as the dragon climbs towards the light while a guard shoots from an approaching rail cart which the dragon knocks off the track with its head causing the cart and its passengers to plummet Hermione's spell releases the dragon's chains and it breathes fire looking up towards a pinprick of light high above Ron and Harry are still by the vault and leap onto the dragon's back Clinging to its spikes she hauls herself up as the beast belches flame and goblins take cover Armed guards rush in throwing explosive bursts from their wands as Hermione destroys the balustrade and taking a runup leaps through the opening onto the dragon's back Harry struggles out of the vault and runs to a balustrade while Griphook runs off leaving the grinning Bogrod alone with the dragon which raises its head and breathes fire incinerating Bogrod Griphook rings the bells to keep the dragon at bay Griphook presses Bogrod's hand against the door and replicating treasure tumbles out through the open doorway burying the three inside the vault Griphook grabs it as Harry tosses him the sword and flings the cup to Hermione The others remain stockstill as he stumbles and drops the cup Harry stretches the sword high above his head reaching for the cup but he disappears from sight lost in a mountain of gold and silver treasure Harry scrambles over the treasure towards the cup which has now risen to waist height Up to his knees Hermione throws the ring to Harry who catching it wades through the growing mass of treasure Hermione dislodges a ring which replicates causing other objects to start replicating Harry walks further into the vault moving ahead of the others until he stops turns his head blinks and stares up at a gold cup with two handles Light appears at the tip of their three wands revealing a vault filled with treasure including gold and silver goblets candlesticks jewels and stacks of coins The dragon belches flame as they enter the vault and close the door They continue along a narrow passageway and reach a door where Griphook presses Bogrod's hand into the locking mechanism causing Bogrod to grin inanely as the door opens Ron shakes the bell given to him by the goblin allowing them to ease past the dragon The dragon rises and breathes fire then cowers as Griphook shakes a bell"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Harry struggles out of the vault and runs to a balustrade while Griphook runs off leaving the grinning Bogrod alone with the dragon which raises its head and breathes fire incinerating Bogrod Harry walks further into the vault moving ahead of the others until he stops turns his head blinks and stares up at a gold cup with two handles Ron and Harry are still by the vault and leap onto the dragon's back The dragon's head hits the chandelier as the three cling on while it bursts its way through a glass dome onto the roof Griphook presses Bogrod's hand against the door and replicating treasure tumbles out through the open doorway burying the three inside the vault Harry stretches the sword high above his head reaching for the cup but he disappears from sight lost in a mountain of gold and silver treasure Clinging to its spikes she hauls herself up as the beast belches flame and goblins take cover The others remain stockstill as he stumbles and drops the cup Griphook rings the bells to keep the dragon at bay Armed guards rush in throwing explosive bursts from their wands as Hermione destroys the balustrade and taking a runup leaps through the opening onto the dragon's back Ron shakes the bell given to him by the goblin allowing them to ease past the dragon Griphook grabs it as Harry tosses him the sword and flings the cup to Hermione All is quiet in the banking hall as rows of tellers pore over ledgers and above their heads a chandelier starts to sway Hermione dislodges a ring which replicates causing other objects to start replicating Harry scrambles over the treasure towards the cup which has now risen to waist height They continue along a narrow passageway and reach a door where Griphook presses Bogrod's hand into the locking mechanism causing Bogrod to grin inanely as the door opens A teller looks up as the dragon bursts through a grating in the floor causing guards and goblins to flee the flames Light appears at the tip of their three wands revealing a vault filled with treasure including gold and silver goblets candlesticks jewels and stacks of coins Hermione's spell releases the dragon's chains and it breathes fire looking up towards a pinprick of light high above Hermione throws the ring to Harry who catching it wades through the growing mass of treasure Up to his knees The dragon rises and breathes fire then cowers as Griphook shakes a bell The dragon belches flame as they enter the vault and close the door The three friends cling on desperately as the dragon climbs towards the light while a guard shoots from an approaching rail cart which the dragon knocks off the track with its head causing the cart and its passengers to plummet"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Griphook grabs it as Harry tosses him the sword and flings the cup to Hermione Griphook presses Bogrod's hand against the door and replicating treasure tumbles out through the open doorway burying the three inside the vault Griphook rings the bells to keep the dragon at bay Harry struggles out of the vault and runs to a balustrade while Griphook runs off leaving the grinning Bogrod alone with the dragon which raises its head and breathes fire incinerating Bogrod Armed guards rush in throwing explosive bursts from their wands as Hermione destroys the balustrade and taking a runup leaps through the opening onto the dragon's back Clinging to its spikes she hauls herself up as the beast belches flame and goblins take cover Ron and Harry are still by the vault and leap onto the dragon's back Hermione's spell releases the dragon's chains and it breathes fire looking up towards a pinprick of light high above The three friends cling on desperately as the dragon climbs towards the light while a guard shoots from an approaching rail cart which the dragon knocks off the track with its head causing the cart and its passengers to plummet All is quiet in the banking hall as rows of tellers pore over ledgers and above their heads a chandelier starts to sway A teller looks up as the dragon bursts through a grating in the floor causing guards and goblins to flee the flames The dragon's head hits the chandelier as the three cling on while it bursts its way through a glass dome onto the roof The dragon rises and breathes fire then cowers as Griphook shakes a bell Ron shakes the bell given to him by the goblin allowing them to ease past the dragon They continue along a narrow passageway and reach a door where Griphook presses Bogrod's hand into the locking mechanism causing Bogrod to grin inanely as the door opens The dragon belches flame as they enter the vault and close the door Light appears at the tip of their three wands revealing a vault filled with treasure including gold and silver goblets candlesticks jewels and stacks of coins Harry walks further into the vault moving ahead of the others until he stops turns his head blinks and stares up at a gold cup with two handles Hermione dislodges a ring which replicates causing other objects to start replicating Hermione throws the ring to Harry who catching it wades through the growing mass of treasure Up to his knees Harry scrambles over the treasure towards the cup which has now risen to waist height Harry stretches the sword high above his head reaching for the cup but he disappears from sight lost in a mountain of gold and silver treasure The others remain stockstill as he stumbles and drops the cup"
        }
      ]
    }
  ]
}