{
  "ground_truth": "The snake locks begin to move, and the heavy, circular, stone door of the Chamber of Secrets swings open. Meanwhile, the protective shield and the burning wooden ground stones at the Quidditch Pitch illuminate the dark hillside, as illusions continue to pound against the shield. Neville stands on a covered wooden bridge, looking out across the landscape, and he sees an army of Snatchers, led by Scabior, racing towards the school. Neville recoils as two Snatchers run ahead, hit the shield, and disintegrate, while Scabior steadies his men and stares at Neville, who is guarding the entrance up ahead. In the Chamber of Secrets, Ron approaches the skeleton of the Basilisk and wrenches a fang from its jaw. Hermione takes the two-handled gold cup from her bottomless bag, and Ron hands her the fang. He kneels down and places the golden cup on the ground between them. Hermione sinks to her knees, hesitating as she stares at the cup. Harry budges his way through students, as Ron raises his eyes to Hermione. She draws back her arm and plunges the fang into the cup. Voldemort roars as the cup spins across the floor, and Harry gasps and reels back as water bursts into the chamber, prompting Hermione and Ron to run from it. Immediately, the Dark Lord appears in the swelling torrent and breathes deeply, while gasping, Harry leans back against a pillar. Ron and Hermione, with the receding waters behind them, turn to each other and kiss hungrily, standing as if on a bridge with the waters on either side, before they break apart. On the outcrop, Voldemort, with Nagini coiled beside him, unleashes a powerful blast of light toward the shield from the Elder Wand. Professor McGonagall and Ginny stare upwards as parts of the shield start to burn. Remus reaches out to Nymphadora, and their fingers almost touch. Holding the Elder Wand, Voldemort suddenly recoils and looks down as energy crackles through the nut-nutted wand. He gazes at the smoldering shield, which now resembles a burning dome of flame. Harry seems to regain his strength and moves with determination through the fleeing students as the disintegrating shield fills the skies with burning debris. Scabior catches one of the flaming embers on the tip of his wand, open-mouthed, and scowls at Neville, who remains on guard on the wooden bridge. Scabior takes a very slow and tentative step forward, grins, and Neville backs away while the Snatchers race behind Scabior and make for the bridge. They haul fireballs at Neville, who dodges them, and a spell from Neville's wand ignites charges in the joints of the bridge supports, causing them to start to explode. As Scabior runs faster, the bridge collapses behind him while Ginny and the others watch as Neville sprints towards them, and a huge explosion rips the bridge apart.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The serpent fastenings commence to shift, and the weighty, round, rock portal of the Hall of Mysteries swings ajar. Meanwhile, the defensive barrier and the blazing timbered ground pebbles at the Quidditch Field illuminate the darkened slope, as deceptions persist to strike against the shield. Neville stands on a sheltered wooden passage, gazing out across the scenery, and he perceives a battalion of Captors, led by Scabior, speeding towards the academy. Neville flinches as two Captors dash forward, strike the barrier, and disintegrate, while Scabior steadies his followers and gazes at Neville, who is safeguarding the entryway up ahead. In the Hall of Mysteries, Ron advances to the frame of the Basilisk and wrenches a tooth from its maw. Hermione extracts the dual-handled aureate chalice from her infinite purse, and Ron hands her the tooth. He kneels down and places the gilded cup on the terrain betwixt them. Hermione lowers herself to her knees, hesitating as she gazes at the goblet. Harry pushes his way through pupils, as Ron elevates his gaze to Hermione. She retracts her arm and thrusts the tooth into the chalice. Voldemort bellows as the goblet twirls across the floor, and Harry gasps and staggers back as water erupts into the chamber, prompting Hermione and Ron to flee from it. Forthwith, the Dark Lord materializes in the surging deluge and inhales deeply, while panting, Harry leans back against a column. Ron and Hermione, with the ebbing waters behind them, turn to one another and kiss hungrily, standing as though on a passage with the waters on either side, before they separate. On the ledge, Voldemort, with Nagini spiraled beside him, releases a mighty burst of radiance toward the barrier from the Elder Wand. Professor McGonagall and Ginny gape upwards as segments of the barrier begin to combust. Remus extends a hand to Nymphadora, and their fingers nearly meet. Grasping the Elder Wand, Voldemort abruptly flinches and glances down as energy crackles through the nut-nutted wand. He stares at the smoldering barrier, which now mirrors a blazing dome of flame. Harry seems to recover his vigor and moves with resolve through the evacuating pupils as the disintegrating barrier fills the skies with burning fragments. Scabior catches one of the flaming cinders on the tip of his wand, gaping, and scowls at Neville, who remains on watch on the wooden passage. Scabior takes a very slow and hesitant step forward, grins, and Neville retreats while the Captors charge behind Scabior and head for the bridge. They hurl fireballs at Neville, who evades them, and a spell from Neville's wand ignites charges in the joints of the bridge braces, causing them to commence to detonate. As Scabior sprints faster, the passage collapses behind him while Ginny and the others observe as Neville dashes towards them, and a colossal detonation tears the bridge asunder."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The movement of the snake locks is begun, and the opening of the heavy, circular, stone door of the Chamber of Secrets is completed. Meanwhile, the dark hillside is illuminated by the protective shield and the burning wooden ground stones at the Quidditch Pitch, as the shield is pounded against by illusions. On a covered wooden bridge, Neville stands, looking out across the landscape, and an army of Snatchers, led by Scabior, is seen racing towards the school by him. As the shield is hit by two Snatchers running ahead, they disintegrate, and Neville recoils while his men are steadied by Scabior, who stares at Neville, guarding the entrance up ahead. In the Chamber of Secrets, the skeleton of the Basilisk is approached by Ron, and a fang is wrenched from its jaw by him. From her bottomless bag, the two-handled gold cup is taken by Hermione, and the fang is handed to her by Ron. The golden cup is placed on the ground between them by him as he kneels down. To her knees, Hermione sinks, hesitating as the cup is stared at by her. Students are budged through by Harry, as Hermione is looked up to by Ron. Her arm is drawn back by her, and the fang is plunged into the cup. The roar of Voldemort is heard as the cup is spun across the floor, and the gasp and reel back of Harry are prompted by the water bursting into the chamber, causing Hermione and Ron to run from it. Immediately, in the swelling torrent, the Dark Lord appears and breathes deeply, while back against a pillar, Harry leans gasping. With the receding waters behind them, a kiss is turned to by Ron and Hermione, standing as if on a bridge with the waters on either side, before apart they break. On the outcrop, a powerful blast of light is unleashed by Voldemort, with Nagini coiled beside him, toward the shield from the Elder Wand. Upwards, Professor McGonagall and Ginny stare as the burning of parts of the shield begins. The reaching out to Nymphadora is done by Remus, and the almost touching of their fingers occurs. Suddenly, holding the Elder Wand, Voldemort recoils and energy crackles through the nut-nutted wand as it is looked down upon by him. At the smoldering shield, which now resembles a burning dome of flame, he gazes. Harry’s strength seems to be regained, and through the fleeing students, he moves with determination as the skies are filled with burning debris by the disintegrating shield. One of the flaming embers is caught on the tip of his wand by Scabior, open-mouthed, and at Neville, who remains on guard on the wooden bridge, he scowls. A very slow and tentative step forward is taken by Scabior, a grin is given, and while Neville backs away, the Snatchers race behind Scabior and make for the bridge. At Neville, fireballs are hauled by them, who dodges them, and charges in the joints of the bridge supports are ignited by a spell from Neville's wand, causing the start of explosions. As Scabior runs faster, the collapse of the bridge occurs behind him while the watch by Ginny and the others happens as Neville sprints towards them, and the huge explosion that rips the bridge apart occurs."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The snake locks move, and the heavy stone door of the Chamber of Secrets opens. Meanwhile, the protective shield and burning ground stones at the Quidditch Pitch light up the dark hillside as illusions pound against the shield. Neville stands on a covered bridge, watching an army of Snatchers, led by Scabior, race toward the school. Two Snatchers hit the shield and disintegrate, while Scabior steadies his men and stares at Neville, guarding the entrance. In the Chamber of Secrets, Ron approaches the Basilisk skeleton, wrenches a fang, and hands it to Hermione, who takes a gold cup from her bag. Ron places the cup on the ground, and Hermione plunges the fang into it. Voldemort roars as the cup spins, and water bursts into the chamber, prompting Hermione and Ron to flee. The Dark Lord appears in the torrent, while Harry leans against a pillar. Ron and Hermione kiss as the waters recede. On the outcrop, Voldemort, with Nagini, unleashes a blast of light from the Elder Wand at the shield. Professor McGonagall and Ginny watch as parts of the shield burn. Remus reaches for Nymphadora, their fingers almost touching. Voldemort recoils as energy crackles through the wand, gazing at the smoldering shield. Harry regains strength and moves through fleeing students as the disintegrating shield fills the sky with debris. Scabior catches a flaming ember on his wand and scowls at Neville, who remains on guard. Scabior steps forward, grins, and Neville backs away as Snatchers race behind Scabior. They hurl fireballs at Neville, who dodges them, and a spell from Neville's wand ignites charges in the bridge supports, causing explosions. As Scabior runs, the bridge collapses behind him, and Neville sprints toward Ginny and the others as a huge explosion rips the bridge apart."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The snake locks move, opening the Chamber of Secrets' stone door. At the Quidditch Pitch, the shield and burning ground stones light the hillside as illusions hit the shield. Neville, on a wooden bridge, sees Snatchers led by Scabior approaching. Two Snatchers disintegrate on the shield, while Scabior steadies his men, staring at Neville. In the Chamber, Ron grabs a Basilisk fang, and Hermione takes a gold cup from her bag. Ron places the cup on the ground, and Hermione plunges the fang into it. Voldemort roars as the cup spins, and water bursts in, prompting Ron and Hermione to flee. The Dark Lord appears in the torrent, while Harry leans against a pillar. Ron and Hermione kiss as the waters recede. On an outcrop, Voldemort, with Nagini, blasts the shield with the Elder Wand. McGonagall and Ginny watch as the shield burns. Remus and Nymphadora almost touch fingers. Voldemort recoils as energy crackles through the wand, and the shield becomes a dome of flame. Harry regains strength, moving through fleeing students as the shield disintegrates. Scabior catches a flaming ember, scowling at Neville. Scabior steps forward, grinning, as Neville backs away. Snatchers race for the bridge, throwing fireballs at Neville, who ignites charges in the bridge supports. As Scabior runs, the bridge collapses, and Neville sprints to safety as a huge explosion rips it apart."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The intricate snake locks begin to shift and turn, setting into motion the heavy, circular stone door of the Chamber of Secrets, which slowly swings open with a deep, resonant sound. Meanwhile, at the Quidditch Pitch, the protective shield and the burning wooden ground stones cast a bright, flickering light that illuminates the dark hillside. This light reveals the illusions that continue to pound relentlessly against the shield. Standing on a covered wooden bridge, Neville gazes out across the expansive landscape and spots an army of Snatchers, led by the menacing Scabior, racing determinedly towards the school. Neville recoils in shock as two of the Snatchers sprint ahead, collide with the shield, and disintegrate into nothingness. Meanwhile, Scabior steadies his men, fixing a steely gaze on Neville, who stands resolutely guarding the entrance up ahead. \n\nInside the Chamber of Secrets, Ron approaches the massive skeleton of the Basilisk and forcefully wrenches a sharp fang from its formidable jaw. Hermione retrieves the two-handled gold cup from her seemingly bottomless bag, and Ron promptly hands her the fang. He then kneels down, carefully placing the golden cup on the ground between them. Hermione sinks to her knees, hesitating momentarily as she stares intently at the cup. Elsewhere, Harry pushes his way through the throng of students, while Ron raises his eyes to meet Hermione's. She draws back her arm with determination and plunges the fang into the cup. Voldemort lets out a furious roar as the cup spins wildly across the floor, and Harry gasps, reeling back in shock as water bursts forth into the chamber, prompting Hermione and Ron to flee from it. \n\nIn that instant, the Dark Lord materializes within the swelling torrent, breathing deeply, while a gasping Harry leans back against a sturdy pillar. With the receding waters behind them, Ron and Hermione turn to each other and share a passionate, hungry kiss, standing as if on a bridge with the waters on either side, before they finally break apart. On the outcrop, Voldemort, with Nagini coiled menacingly beside him, unleashes a powerful blast of light from the Elder Wand toward the shield. Professor McGonagall and Ginny stare upwards in alarm as parts of the shield begin to burn. Remus reaches out to Nymphadora, their fingers almost touching in a moment of connection. Holding the Elder Wand, Voldemort suddenly recoils, looking down in surprise as energy crackles through the nut-nutted wand. He gazes at the smoldering shield, which now resembles a burning dome of flame. \n\nHarry seems to regain his strength and moves with renewed determination through the fleeing students as the disintegrating shield fills the skies with burning debris. Scabior catches one of the flaming embers on the tip of his wand, open-mouthed in awe, and scowls at Neville, who remains steadfastly on guard on the wooden bridge. Scabior takes a very slow and tentative step forward, grinning with malice, and Neville backs away cautiously while the Snatchers race behind Scabior, making their way toward the bridge. They hurl fireballs at Neville, who skillfully dodges them, and a spell from Neville's wand ignites charges in the joints of the bridge supports, causing them to start to explode. As Scabior runs faster, the bridge collapses dramatically behind him, while Ginny and the others watch in horror as Neville sprints towards them, and a huge explosion rips the bridge apart with a deafening roar."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The complex and intricate snake locks gradually begin to shift and turn, setting into motion the heavy and imposing circular stone door of the Chamber of Secrets. This ancient door slowly swings open with a deep, resonant sound that echoes throughout the chamber. Concurrently, over at the Quidditch Pitch, the protective shield, along with the burning wooden ground stones, casts a bright and flickering light that vividly illuminates the surrounding dark hillside. This dynamic light exposes the illusions that continue to pound relentlessly against the shield with unwavering force. Standing on a covered wooden bridge, Neville gazes out across the expansive and vast landscape, spotting a formidable army of Snatchers. These Snatchers are led by the menacing and intimidating Scabior, who races determinedly towards the school. Neville recoils in shock as he witnesses two of the Snatchers sprint ahead with great speed, only to collide with the shield and disintegrate into nothingness. Meanwhile, Scabior steadies his men, fixing a steely and unyielding gaze on Neville, who stands resolutely guarding the entrance that lies up ahead.\n\nDeep inside the Chamber of Secrets, Ron approaches the massive and intimidating skeleton of the Basilisk. With a forceful effort, he wrenches a sharp fang from its formidable and menacing jaw. Hermione then retrieves the two-handled gold cup from her seemingly bottomless bag, and Ron promptly hands her the freshly obtained fang. He kneels down with care, placing the golden cup gently on the ground between them. Hermione sinks to her knees beside him, hesitating momentarily as she stares intently and thoughtfully at the cup. Meanwhile, elsewhere, Harry pushes his way through the throng of students with urgency, while Ron raises his eyes to meet Hermione's. She draws back her arm with determination, plunging the fang decisively into the cup. In response, Voldemort lets out a furious roar as the cup spins wildly and uncontrollably across the floor, causing Harry to gasp and reel back in shock as water bursts forth into the chamber, prompting Hermione and Ron to flee from the impending deluge.\n\nIn that instant, the Dark Lord materializes within the swelling torrent, breathing deeply and menacingly, while a gasping Harry leans back against a sturdy pillar for support. With the receding waters behind them, Ron and Hermione turn to face each other, sharing a passionate and hungry kiss, standing as if on a bridge with the waters on either side, before they finally break apart. On the outcrop, Voldemort, accompanied by Nagini who is coiled menacingly beside him, unleashes a powerful blast of brilliant light from the Elder Wand directed towards the shield. Professor McGonagall and Ginny look upwards with alarm as parts of the shield start to burn ominously. Remus reaches out with longing to Nymphadora, their fingers almost, but not quite, touching in a poignant moment of connection. Holding the Elder Wand, Voldemort suddenly recoils in surprise, looking down as energy crackles through the ancient wand. He gazes intently at the smoldering shield, which now resembles a massive burning dome of flame.\n\nHarry appears to regain his strength and moves with renewed and determined purpose through the fleeing students, while the disintegrating shield fills the skies with burning debris. Scabior catches one of the flaming embers on the tip of his wand, standing open-mouthed in awe, and then scowls at Neville, who remains steadfastly on guard on the wooden bridge. With malice in his eyes, Scabior takes a very slow and tentative step forward, grinning malevolently, as Neville cautiously backs away. The Snatchers race behind Scabior, making their way towards the bridge. They hurl fiery fireballs at Neville, who skillfully dodges these attacks, and a well-aimed spell from Neville's wand ignites charges in the joints of the bridge supports, causing them to begin to explode. As Scabior runs faster, the bridge collapses dramatically behind him, while Ginny and the others watch in horror. Neville sprints toward them, and a huge, deafening explosion rips the bridge apart with a mighty roar."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The snake locks begin to move with a slow, grinding motion, and the heavy, circular stone door of the Chamber of Secrets gradually swings open, revealing the hidden interior. Meanwhile, at the Quidditch Pitch, the protective shield shimmers into visibility, and the burning wooden ground stones cast a flickering light across the dark hillside, as illusions relentlessly pound against the shield, creating a dramatic scene. Neville stands on a covered wooden bridge, peering out across the landscape, and his eyes widen as he spots an army of Snatchers, led by Scabior, racing determinedly towards the school. Neville instinctively recoils as two Snatchers sprint ahead, collide with the shield, and disintegrate into nothingness, while Scabior steadies his men, fixing a steely gaze on Neville, who stands resolute, guarding the entrance up ahead. In the Chamber of Secrets, Ron approaches the massive skeleton of the Basilisk, his eyes scanning its formidable form, and with a determined effort, he wrenches a fang from its jaw. Hermione, standing nearby, retrieves the two-handled gold cup from her bottomless bag, and Ron carefully hands her the fang. He then kneels down, placing the golden cup on the ground between them, creating a solemn moment. Hermione sinks to her knees, hesitating as she stares intently at the cup, contemplating the task ahead. Meanwhile, Harry pushes his way through the throng of students, his focus unwavering, as Ron raises his eyes to meet Hermione's. She draws back her arm with resolve and plunges the fang into the cup with a decisive motion. Voldemort lets out a roar as the cup spins wildly across the floor, and Harry gasps, reeling back in shock as water bursts into the chamber, prompting Hermione and Ron to turn and run from the impending flood. Immediately, the Dark Lord's visage appears in the swelling torrent, and he breathes deeply, while Harry, still gasping, leans back against a pillar for support. Ron and Hermione, with the receding waters behind them, turn to each other, their emotions overflowing, and they kiss hungrily, standing as if on a bridge with the waters on either side, before they break apart, breathless. On the outcrop, Voldemort, with Nagini coiled menacingly beside him, unleashes a powerful blast of light toward the shield from the Elder Wand, creating a spectacle of magical force. Professor McGonagall and Ginny stare upwards in awe as parts of the shield begin to burn, signaling the intensity of the attack. Remus reaches out to Nymphadora, their fingers almost touching in a moment of connection. Holding the Elder Wand, Voldemort suddenly recoils, looking down in surprise as energy crackles ominously through the nut-nutted wand. He gazes at the smoldering shield, which now resembles a burning dome of flame, a testament to the battle's ferocity. Harry seems to regain his strength, his resolve hardening, and he moves with determination through the fleeing students as the disintegrating shield fills the skies with burning debris. Scabior catches one of the flaming embers on the tip of his wand, his mouth open in a mix of awe and defiance, and he scowls at Neville, who remains steadfast on guard on the wooden bridge. Scabior takes a very slow and tentative step forward, a grin spreading across his face, and Neville instinctively backs away while the Snatchers, emboldened, race behind Scabior and make for the bridge. They hurl fireballs at Neville, who deftly dodges them, and with a swift motion, a spell from Neville's wand ignites charges in the joints of the bridge supports, causing them to start to explode with a series of loud cracks. As Scabior runs faster, the bridge collapses behind him in a dramatic cascade of destruction, while Ginny and the others watch with bated breath as Neville sprints towards them, and a huge explosion rips the bridge apart, sealing the fate of those who dared to cross."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The snake locks activate, opening the heavy stone door of the Chamber of Secrets. Simultaneously, the Quidditch Pitch's protective shield and burning ground stones illuminate the dark hillside as illusions strike the shield. On a covered wooden bridge, Neville observes an army of Snatchers, led by Scabior, approaching the school. He recoils as two Snatchers disintegrate upon hitting the shield, while Scabior steadies his men and locks eyes with Neville, who guards the entrance. In the Chamber of Secrets, Ron retrieves a Basilisk fang and hands it to Hermione, who takes the gold cup from her bag. They place the cup on the ground, and Hermione hesitates before plunging the fang into it. Voldemort roars as the cup spins, and water bursts into the chamber, prompting Ron and Hermione to flee. The Dark Lord appears in the torrent, while Harry, gasping, leans against a pillar. With the waters receding, Ron and Hermione share a passionate kiss before breaking apart. On an outcrop, Voldemort, with Nagini beside him, unleashes a blast of light from the Elder Wand at the shield. Professor McGonagall and Ginny watch as the shield starts to burn. Remus reaches for Nymphadora, their fingers almost touching. Voldemort recoils as energy crackles through the wand, and he observes the smoldering shield, now a dome of flame. Harry regains his strength and moves determinedly through fleeing students as the disintegrating shield fills the sky with debris. Scabior catches a flaming ember on his wand and scowls at Neville, who remains on guard. Scabior steps forward, grinning, as the Snatchers race behind him, hurling fireballs at Neville. Neville dodges and ignites charges in the bridge supports, causing explosions. As Scabior runs, the bridge collapses behind him, and Neville sprints towards Ginny and the others, while a massive explosion tears the bridge apart."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The snake locks, intricate mechanisms that respond only to Parseltongue, begin to move, and the heavy, circular, stone door of the Chamber of Secrets, built centuries ago by Salazar Slytherin, swings open. Meanwhile, the protective shield, conjured by Hogwarts' professors to repel dark forces, and the burning wooden ground stones at the Quidditch Pitch, a popular wizarding sport venue, illuminate the dark hillside, as illusions known as Dementors continue to pound against the shield. Neville, a courageous member of Dumbledore’s Army, stands on a covered wooden bridge, designed to connect various parts of the school, looking out across the landscape, and he sees an army of Snatchers, mercenaries employed by Voldemort, led by Scabior, racing towards the school. Neville recoils as two Snatchers run ahead, hit the shield, an ancient spell barrier, and disintegrate, while Scabior steadies his men and stares at Neville, who is guarding the entrance up ahead. In the Chamber of Secrets, Ron approaches the skeleton of the Basilisk, a giant serpent once defeated by Harry Potter, and wrenches a fang from its jaw. Hermione takes the two-handled gold cup, once belonging to Helga Hufflepuff and now a Horcrux, from her bottomless bag, a magical extension charm containing numerous items, and Ron hands her the fang. He kneels down and places the golden cup on the ground between them. Hermione sinks to her knees, hesitating as she stares at the cup, knowing its destruction is crucial to defeating Voldemort. Harry, determined to locate more Horcruxes, budges his way through students, as Ron raises his eyes to Hermione. She draws back her arm and plunges the fang into the cup. Voldemort, the Dark Lord, roars as the cup spins across the floor, and Harry gasps and reels back as water, conjured from the cup's destruction, bursts into the chamber, prompting Hermione and Ron to run from it. Immediately, the Dark Lord appears in the swelling torrent and breathes deeply, while gasping, Harry leans back against a pillar. Ron and Hermione, with the receding waters behind them, turn to each other and kiss hungrily, standing as if on a bridge with the waters on either side, before they break apart. On the outcrop, Voldemort, with Nagini, his faithful snake and living Horcrux, coiled beside him, unleashes a powerful blast of light toward the shield from the Elder Wand, a legendary wand with unbeatable power. Professor McGonagall and Ginny stare upwards as parts of the shield start to burn. Remus, a former Defense Against the Dark Arts professor and werewolf, reaches out to Nymphadora, his wife, and their fingers almost touch. Holding the Elder Wand, Voldemort suddenly recoils and looks down as energy crackles through the ancient, nut-nutted wand. He gazes at the smoldering shield, which now resembles a burning dome of flame. Harry seems to regain his strength and moves with determination through the fleeing students as the disintegrating shield fills the skies with burning debris. Scabior catches one of the flaming embers on the tip of his wand, open-mouthed, and scowls at Neville, who remains on guard on the wooden bridge. Scabior takes a very slow and tentative step forward, grins, and Neville backs away while the Snatchers race behind Scabior and make for the bridge. They haul fireballs, a common magical attack, at Neville, who dodges them, and a spell from Neville's wand ignites charges in the joints of the bridge supports, causing them to start to explode. As Scabior runs faster, the bridge collapses behind him while Ginny and the others watch as Neville sprints towards them, and a huge explosion rips the bridge apart, marking a pivotal moment of defense for Hogwarts."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The snake locks begin to move and the heavy circular stone door of the Chamber of Secrets swings open. Meanwhile the protective shield and the burning wooden ground stones at the Quidditch Pitch illuminate the dark hillside as illusions continue to pound against the shield. Neville stands on a covered wooden bridge looking out across the landscape and he sees an army of Snatchers led by Scabior racing towards the school. Neville recoils as two Snatchers run ahead hit the shield and disintegrate while Scabior steadies his men and stares at Neville who is guarding the entrance up ahead. In the Chamber of Secrets Ron approaches the skeleton of the Basilisk and wrenches a fang from its jaw. Hermione takes the twohandled gold cup from her bottomless bag and Ron hands her the fang. He kneels down and places the golden cup on the ground between them. Hermione sinks to her knees hesitating as she stares at the cup. Harry budges his way through students as Ron raises his eyes to Hermione. She draws back her arm and plunges the fang into the cup. Voldemort roars as the cup spins across the floor and Harry gasps and reels back as water bursts into the chamber prompting Hermione and Ron to run from it. Immediately the Dark Lord appears in the swelling torrent and breathes deeply while gasping. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Harry leans back against a pillar. Ron and Hermione with the receding waters behind them turn to each other and kiss hungrily standing as if on a bridge with the waters on either side before they break apart. On the outcrop Voldemort with Nagini coiled beside him unleashes a powerful blast of light toward the shield from the Elder Wand. Professor McGonagall and Ginny stare upwards as parts of the shield start to burn. Remus reaches out to Nymphadora and their fingers almost touch. Holding the Elder Wand Voldemort suddenly recoils and looks down as energy crackles through the nutnutted wand. He gazes at the smoldering shield which now resembles a burning dome of flame. Harry seems to regain his strength and moves with determination through the fleeing students as the disintegrating shield fills the skies with burning debris. Scabior catches one of the flaming embers on the tip of his wand openmouthed and scowls at Neville who remains on guard on the wooden bridge. Scabior takes a very slow and tentative step forward grins and Neville backs away while the Snatchers race behind Scabior and make for the bridge. They haul fireballs at Neville who dodges them and a spell from Neville's wand ignites charges in the joints of the bridge supports causing them to start to explode. As Scabior runs faster the bridge collapses behind him while Ginny and the others watch as Neville sprints towards them and a huge explosion rips the bridge apart."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The snake locks begin to move and the heavy circular stone door of the Chamber of Secrets swings open. Meanwhile the protective shield and the burning wooden ground stones at the Quidditch Pitch illuminate the dark hillside as illusions continue to pound against the shield. Neville stands on a covered wooden bridge looking out across the landscape and he sees an army of Snatchers led by Scabior racing towards the school. Neville recoils as two Snatchers run ahead hit the shield and disintegrate while Scabior steadies his men and stares at Neville who is guarding the entrance up ahead. In the Chamber of Secrets Ron approaches the skeleton of the Basilisk and wrenches a fang from its jaw. Hermione takes the twohandled gold cup from her bottomless bag and Ron hands her the fang. He kneels down and places the golden cup on the ground between them. Hermione sinks to her knees hesitating as she stares at the cup. Harry budges his way through students as Ron raises his eyes to Hermione. She draws back her arm and plunges the fang into the cup. Voldemort roars as the cup spins across the floor and Harry gasps and reels back as water bursts into the chamber prompting Hermione and Ron to run from it. Immediately the Dark Lord appears in the swelling torrent and breathes deeply while gasping. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Harry leans back against a pillar. Ron and Hermione with the receding waters behind them turn to each other and kiss hungrily standing as if on a bridge with the waters on either side before they break apart. On the outcrop Voldemort with Nagini coiled beside him unleashes a powerful blast of light toward the shield from the Elder Wand. Professor McGonagall and Ginny stare upwards as parts of the shield start to burn. Remus reaches out to Nymphadora and their fingers almost touch. Holding the Elder Wand Voldemort suddenly recoils and looks down as energy crackles through the nutnutted wand. He gazes at the smoldering shield which now resembles a burning dome of flame. Harry seems to regain his strength and moves with determination through the fleeing students as the disintegrating shield fills the skies with burning debris. Scabior catches one of the flaming embers on the tip of his wand openmouthed and scowls at Neville who remains on guard on the wooden bridge. Scabior takes a very slow and tentative step forward grins and Neville backs away while the Snatchers race behind Scabior and make for the bridge. They haul fireballs at Neville who dodges them and a spell from Neville's wand ignites charges in the joints of the bridge supports causing them to start to explode. As Scabior runs faster the bridge collapses behind him while Ginny and the others watch as Neville sprints towards them and a huge explosion rips the bridge apart."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The snake locks begin to move and the heavy circular stone door of the Chamber of Secrets swings open. Meanwhile the protective shield and the burning wooden ground stones at the Quidditch Pitch illuminate the dark hillside as illusions continue to pound against the shield. Neville stands on a covered wooden bridge looking out across the landscape and he sees an army of Snatchers led by Scabior racing towards the school. Neville recoils as two Snatchers run ahead hit the shield and disintegrate while Scabior steadies his men and stares at Neville who is guarding the entrance up ahead. In the Chamber of Secrets Ron approaches the skeleton of the Basilisk and wrenches a fang from its jaw. Hermione takes the twohandled gold cup from her bottomless bag and Ron hands her the fang. He gazes at the smoldering shield which now resembles a burning dome of flame. Harry seems to regain his strength and moves with determination through the fleeing students as the disintegrating shield fills the skies with burning debris. Scabior catches one of the flaming embers on the tip of his wand openmouthed and scowls at Neville who remains on guard on the wooden bridge. Scabior takes a very slow and tentative step forward grins and Neville backs away while the Snatchers race behind Scabior and make for the bridge. They haul fireballs at Neville who dodges them and a spell from Neville's wand ignites charges in the joints of the bridge supports causing them to start to explode. As Scabior runs faster the bridge collapses behind him while Ginny and the others watch as Neville sprints towards them and a huge explosion rips the bridge apart."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The snake locks begin to move and the heavy circular stone door of the Chamber of Secrets swings open. Meanwhile the protective shield and the burning wooden ground stones at the Quidditch Pitch illuminate the dark hillside as illusions continue to pound against the shield. Neville stands on a covered wooden bridge looking out across the landscape and he sees an army of Snatchers led by Scabior racing towards the school. They haul fireballs at Neville who dodges them and a spell from Neville's wand ignites charges in the joints of the bridge supports causing them to start to explode. As Scabior runs faster the bridge collapses behind him while Ginny and the others watch as Neville sprints towards them and a huge explosion rips the bridge apart."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The dolphins unlock begin to sway, and the lightweight, rectangular, wooden gate of the Chamber of Missteps glides closed. Meanwhile, the defensive net and the freezing stone ground tiles at the Quidditch Lounge dim the bright valley, as echoes continue to whisper against the net. Luna lounges on a painted stone dock, gazing over the ocean, and she notices a fleet of Hoppers, led by Fidget, hovering towards the park. Luna recoils as two Hoppers swim ahead, graze the net, and evaporate, while Fidget calms his crew and glares at Luna, who is blocking the exit up above. In the Chamber of Missteps, Draco approaches the fur of the Hippogriff and pries a scale from its coat. Pansy retrieves the two-wheeled silver wagon from her shallow sack, and Draco passes her the scale. He sprawls out and sets the silver wagon on the pavement beside them. Pansy kneels to her feet, wavering as she gazes at the wagon. Ginny tiptoes her way through teachers, as Draco lowers his chin to Pansy. She pulls in her leg and hurls the scale into the wagon. Grindelwald sneers as the wagon skids along the ceiling, and Ginny gasps and stumbles forward as air floods into the corridor, urging Pansy and Draco to jump from it. Directly, the Light Prince arrives in the rumbling breeze and blinks slowly, while groaning, Ginny leans forward against a beam. Draco and Pansy, with the receding air around them, glance at one another and hug gently, standing as if on a dock with the air all around, before they drift apart. On the hillside, Grindelwald, with Aragog wrapped near him, releases a gentle puff of smoke toward the net from the Maple Staff. Madam Pomfrey and Percy gaze downward as parts of the net begin to dissolve. Sirius reaches out to Remus, and their hands almost join. Gripping the Maple Staff, Grindelwald suddenly lunges and glances up as sparks crackle through the apple-carved staff. He glances at the dissolving net, which now appears to be a misty globe of mist. Ginny appears to lose her courage and tiptoes with hesitation among the approaching teachers as the melting net fills the fields with icy shards. Fidget catches one of the frosty shards on the edge of his staff, eyes wide, and grins at Luna, who remains blocking the way on the stone dock. Fidget takes a very swift and daring leap backward, chuckles, and Luna strides forward while the Hoppers dart behind Fidget and dash for the dock. They toss snowflakes at Luna, who catches them, and a glare from Luna's eyes ignites flares in the seams of the dock pillars, causing them to start to implode. As Fidget swims quicker, the dock shatters beneath him while Percy and the others smile as Luna leaps toward them, and a massive implosion splinters the dock into pieces."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The stone door of the Chamber of Secrets swings open as Neville stands guard on a bridge, spotting an army led by Scabior advancing. In the Chamber, Ron retrieves a Basilisk fang and, with Hermione, prepares to destroy a Horcrux cup. Hermione hesitates but plunges the fang into the cup, causing Voldemort to roar and prompting a flood. As Ron and Hermione kiss, Voldemort attacks the shield with the Elder Wand, causing it to burn. Harry regains strength amid chaos, while Scabior leads Snatchers towards Neville. Neville dodges fireballs, triggering explosions that collapse the bridge, prompting Ginny and others to watch in awe as Neville escapes."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "As Scabior runs faster the bridge collapses behind him while Ginny and the others watch as Neville sprints towards them and a huge explosion rips the bridge apart They haul fireballs at Neville who dodges them and a spell from Neville's wand ignites charges in the joints of the bridge supports causing them to start to explode  Scabior takes a very slow and tentative step forward grins and Neville backs away while the Snatchers race behind Scabior and make for the bridge  Scabior catches one of the flaming embers on the tip of his wand openmouthed and scowls at Neville who remains on guard on the wooden bridge  Harry seems to regain his strength and moves with determination through the fleeing students as the disintegrating shield fills the skies with burning debris  He gazes at the smoldering shield which now resembles a burning dome of flame  Holding the Elder Wand Voldemort suddenly recoils and looks down as energy crackles through the nutnutted wand  Remus reaches out to Nymphadora and their fingers almost touch  Professor McGonagall and Ginny stare upwards as parts of the shield start to burn  On the outcrop Voldemort with Nagini coiled beside him unleashes a powerful blast of light toward the shield from the Elder Wand  Ron and Hermione with the receding waters behind them turn to each other and kiss hungrily standing as if on a bridge with the waters on either side before they break apart  Harry leans back against a pillar  Immediately the Dark Lord appears in the swelling torrent and breathes deeply while gasping  Voldemort roars as the cup spins across the floor and Harry gasps and reels back as water bursts into the chamber prompting Hermione and Ron to run from it  She draws back her arm and plunges the fang into the cup  Harry budges his way through students as Ron raises his eyes to Hermione  Hermione sinks to her knees hesitating as she stares at the cup  He kneels down and places the golden cup on the ground between them  Hermione takes the twohandled gold cup from her bottomless bag and Ron hands her the fang  In the Chamber of Secrets Ron approaches the skeleton of the Basilisk and wrenches a fang from its jaw  Neville recoils as two Snatchers run ahead hit the shield and disintegrate while Scabior steadies his men and stares at Neville who is guarding the entrance up ahead  Neville stands on a covered wooden bridge looking out across the landscape and he sees an army of Snatchers led by Scabior racing towards the school  Meanwhile the protective shield and the burning wooden ground stones at the Quidditch Pitch illuminate the dark hillside as illusions continue to pound against the shield  The snake locks begin to move and the heavy circular stone door of the Chamber of Secrets swings open "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Meanwhile the protective shield and the burning wooden ground stones at the Quidditch Pitch illuminate the dark hillside as illusions continue to pound against the shield The snake locks begin to move and the heavy circular stone door of the Chamber of Secrets swings open Neville recoils as two Snatchers run ahead hit the shield and disintegrate while Scabior steadies his men and stares at Neville who is guarding the entrance up ahead Neville stands on a covered wooden bridge looking out across the landscape and he sees an army of Snatchers led by Scabior racing towards the school Hermione takes the twohandled gold cup from her bottomless bag and Ron hands her the fang In the Chamber of Secrets Ron approaches the skeleton of the Basilisk and wrenches a fang from its jaw Hermione sinks to her knees hesitating as she stares at the cup He kneels down and places the golden cup on the ground between them She draws back her arm and plunges the fang into the cup Harry budges his way through students as Ron raises his eyes to Hermione Immediately the Dark Lord appears in the swelling torrent and breathes deeply while gasping Voldemort roars as the cup spins across the floor and Harry gasps and reels back as water bursts into the chamber prompting Hermione and Ron to run from it Ron and Hermione with the receding waters behind them turn to each other and kiss hungrily standing as if on a bridge with the waters on either side before they break apart Harry leans back against a pillar Professor McGonagall and Ginny stare upwards as parts of the shield start to burn On the outcrop Voldemort with Nagini coiled beside him unleashes a powerful blast of light toward the shield from the Elder Wand Holding the Elder Wand Voldemort suddenly recoils and looks down as energy crackles through the nutnutted wand Remus reaches out to Nymphadora and their fingers almost touch Harry seems to regain his strength and moves with determination through the fleeing students as the disintegrating shield fills the skies with burning debris He gazes at the smoldering shield which now resembles a burning dome of flame Scabior takes a very slow and tentative step forward grins and Neville backs away while the Snatchers race behind Scabior and make for the bridge Scabior catches one of the flaming embers on the tip of his wand openmouthed and scowls at Neville who remains on guard on the wooden bridge As Scabior runs faster the bridge collapses behind him while Ginny and the others watch as Neville sprints towards them and a huge explosion rips the bridge apart They haul fireballs at Neville who dodges them and a spell from Neville's wand ignites charges in the joints of the bridge supports causing them to start to explode"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Harry leans back against a pillar  Ron and Hermione with the receding waters behind them turn to each other and kiss hungrily standing as if on a bridge with the waters on either side before they break apart  On the outcrop Voldemort with Nagini coiled beside him unleashes a powerful blast of light toward the shield from the Elder Wand  Professor McGonagall and Ginny stare upwards as parts of the shield start to burn  Remus reaches out to Nymphadora and their fingers almost touch  Holding the Elder Wand Voldemort suddenly recoils and looks down as energy crackles through the nutnutted wand  He gazes at the smoldering shield which now resembles a burning dome of flame  Harry seems to regain his strength and moves with determination through the fleeing students as the disintegrating shield fills the skies with burning debris  Scabior catches one of the flaming embers on the tip of his wand openmouthed and scowls at Neville who remains on guard on the wooden bridge  Scabior takes a very slow and tentative step forward grins and Neville backs away while the Snatchers race behind Scabior and make for the bridge  They haul fireballs at Neville who dodges them and a spell from Neville's wand ignites charges in the joints of the bridge supports causing them to start to explode  As Scabior runs faster the bridge collapses behind him while Ginny and the others watch as Neville sprints towards them and a huge explosion rips the bridge apart The snake locks begin to move and the heavy circular stone door of the Chamber of Secrets swings open  Meanwhile the protective shield and the burning wooden ground stones at the Quidditch Pitch illuminate the dark hillside as illusions continue to pound against the shield  Neville stands on a covered wooden bridge looking out across the landscape and he sees an army of Snatchers led by Scabior racing towards the school  Neville recoils as two Snatchers run ahead hit the shield and disintegrate while Scabior steadies his men and stares at Neville who is guarding the entrance up ahead  In the Chamber of Secrets Ron approaches the skeleton of the Basilisk and wrenches a fang from its jaw  Hermione takes the twohandled gold cup from her bottomless bag and Ron hands her the fang  He kneels down and places the golden cup on the ground between them  Hermione sinks to her knees hesitating as she stares at the cup  Harry budges his way through students as Ron raises his eyes to Hermione  She draws back her arm and plunges the fang into the cup  Voldemort roars as the cup spins across the floor and Harry gasps and reels back as water bursts into the chamber prompting Hermione and Ron to run from it  Immediately the Dark Lord appears in the swelling torrent and breathes deeply while gasping "
        }
      ]
    }
  ]
}