{
  "ground_truth": "They stare in horror at the gaping drop ahead of them as a hand tosses up a wand, then a second hand appears, and finally, Neville's head, as he pulls himself up. An army of Dementors, Death Eaters, and Giants make their way towards the school from the other side. Flitwick backs away between ranks of the Stone Army as a Giant approaches, but vines strip up the giant and pin him to the ground. Death Eaters swoop down, aiming blasts of green light at the Stone Warriors, while two bold giants swing between pronged weapons and knock people flying, plowing through the Stone Army in pursuit of the tinny Professor Flitwick. An explosion rips through the courtyard, and people run for cover as parts of the school are ablaze. Death Eaters burst into a tower, and Arthur Weasley fends one of them off while Kingsley Shacklebolt suspends another in midair, then sends him flying back out of the window. Hurrying down the stairs, Harry turns and propels a third Death Eater before continuing down the stairs. Neville sprints off, and amidst the mayhem, Ginny and Harry kiss before she runs upstairs. Draco grabs two cronies and frog marches Blaise and Goyle away. Harry runs along a corridor where the roof is collapsing, avoiding the falling rubble, and stops suddenly as he reaches a black stone wall—the entrance to the Room of Requirement. He concentrates as Ron studies the Marauder's Map, looks up from the map, and stares ahead wide-eyed. Draco sees the entrance door to the Room of Requirement, turns to his cronies, and as they run towards the door, it disappears and becomes a blank wall again. Inside, Harry sees a cavernous storeroom stacked high with furniture and junk, making his way deeper into the room along the aisles between the stacks, roving around as he continues searching the vast space, passing books, statues, gold, and silver ornaments, striding at a breathtaking pace. A winged blue Pixie watches him from high up on the top of a gold picture frame and flutters lower to get a closer look. Harry stops and listens, turns around, and gazes back the way he came. He walks very slowly and deliberately, drawn towards a clothed table piled high with bric-a-brac, moving a coil silk rope aside to find a plain wooden casket. He pulls the casket forward, unfastens it, and opens the lid to reveal the diadem, a silver tiara in the shape of a raven with a huge blue stone in its center, and another stone hanging from it in the shape of a tear. Blaise glances across at Goyle, and the spells collide, with the diadem thrown into the air.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "They gaze in terror at the yawning descent ahead of them as a hand flings up a staff, then a subsequent hand surfaces, and eventually, Neville's head, as he hoists himself up. A legion of Dementors, Dark Wizards, and Giants advance towards the academy from the opposite side. Flitwick retreats between lines of the Stone Legion as a Giant nears, but tendrils strip up the giant and pin him to the soil. Dark Wizards swoop down, targeting bursts of emerald light at the Stone Soldiers, while two daring giants swing between forked arms and hurl individuals flying, plowing through the Stone Legion in pursuit of the diminutive Professor Flitwick. A detonation tears through the courtyard, and individuals run to shelter as sections of the academy are aflame. Dark Wizards storm into a tower, and Arthur Weasley defends one of them off while Kingsley Shacklebolt suspends another in midair, then sends him hurtling back out of the window. Hastening down the stairs, Harry pivots and hurls a third Dark Wizard before proceeding down the stairs. Neville dashes off, and amidst the chaos, Ginny and Harry kiss before she dashes upstairs. Draco seizes two henchmen and frog marches Blaise and Goyle away. Harry sprints along a passage where the roof is caving in, dodging the tumbling debris, and halts abruptly as he approaches a black stone barrier—the entrance to the Chamber of Requirement. He focuses as Ron examines the Marauder's Map, lifts his eyes from the map, and gazes ahead wide-eyed. Draco spots the entrance door to the Chamber of Requirement, turns to his henchmen, and as they rush towards the door, it vanishes and becomes a blank barrier again. Inside, Harry observes a cavernous depository piled high with furnishings and clutter, making his way deeper into the area along the lanes between the piles, roving around as he continues exploring the vast expanse, passing books, statuettes, golden, and silver decorations, striding at a breathtaking pace. A winged azure Pixie observes him from high up on the top of a golden picture frame and flutters lower to get a closer glimpse. Harry halts and listens, turns around, and gazes back the way he came. He walks very slowly and deliberately, drawn towards a covered table heaped high with bric-a-brac, moving a coiled silk cord aside to discover a plain wooden chest. He pulls the chest forward, unfastens it, and opens the lid to unveil the diadem, a silver crown in the shape of a raven with a massive blue gem in its center, and another gem hanging from it in the shape of a tear. Blaise glances across at Goyle, and the spells clash, with the diadem hurled into the air."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "They are stared at in horror by the gaping drop ahead of them as a wand is tossed up by a hand, then a second hand appears, and finally, Neville's head as he is pulled up by himself. The school is approached by an army of Dementors, Death Eaters, and Giants from the other side. Flitwick is backed away between ranks of the Stone Army as a Giant approaches, but the giant is stripped up by vines and pinned to the ground. Blasts of green light are aimed at the Stone Warriors by Death Eaters swooping down, while between pronged weapons, two bold giants are swinging and are knocking people flying, plowing through the Stone Army pursuing the tinny Professor Flitwick. The courtyard is ripped through by an explosion, and cover is run for by people as parts of the school are ablaze. A tower is burst into by Death Eaters, and one of them is fended off by Arthur Weasley while Kingsley Shacklebolt suspends another in midair, sending him flying back out of the window. Down the stairs hurries Harry, turning and propelling a third Death Eater before the stairs are continued down by him. Neville sprints off, and amidst the mayhem, Ginny and Harry are kissed before she runs upstairs. Two cronies are grabbed by Draco, and Blaise and Goyle are frog-marched away by him. A corridor where the roof is collapsing is run along by Harry, with falling rubble being avoided, and a sudden stop is made by him as a black stone wall—the entrance to the Room of Requirement—is reached. As the Marauder's Map is studied by Ron, Harry concentrates, looks up from the map, and stares ahead wide-eyed. The entrance door to the Room of Requirement is seen by Draco, who turns to his cronies, and as the door is run towards by them, it disappears and becomes a blank wall again. Inside, a cavernous storeroom stacked high with furniture and junk is seen by Harry, who makes his way deeper into the room along the aisles between the stacks, roving around as the vast space is continued to be searched, passing books, statues, gold, and silver ornaments, striding at a breathtaking pace. Watched by a winged blue Pixie from high up on the top of a gold picture frame, Harry is fluttered lower towards by it to get a closer look. Harry stops and listens, turns around and gazes back the way he came. Drawn towards a clothed table piled high with bric-a-brac, he walks very slowly and deliberately, moving a coiled silk rope aside to find a plain wooden casket. The casket is pulled forward, unfastened by him, and the lid is opened to reveal the diadem—a silver tiara in the shape of a raven with a huge blue stone in its center—and another stone hangs from it in the shape of a tear. Blaise glances across at Goyle, and they collide spells, throwing the diadem into the air."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "They stare in horror at the gaping drop ahead as a hand tosses up a wand, followed by a second hand and Neville's head as he pulls himself up. An army of Dementors, Death Eaters, and Giants advances toward the school. Flitwick retreats between the Stone Army ranks as a Giant approaches, but vines pin the giant down. Death Eaters swoop, firing green blasts at the Stone Warriors, while two bold giants swing weapons, scattering people and pursuing Professor Flitwick. An explosion rocks the courtyard, and people seek cover as parts of the school burn. Death Eaters storm a tower; Arthur Weasley fends one off, and Kingsley Shacklebolt suspends another midair, sending him flying out the window. Harry propels a third Death Eater down the stairs. Amidst the chaos, Neville sprints off, and Ginny and Harry kiss before she runs upstairs. Draco grabs two cronies and marches Blaise and Goyle away. Harry runs along a collapsing corridor, dodging rubble, and stops at a black stone wall—the Room of Requirement entrance. He concentrates as Ron studies the Marauder's Map, then stares ahead wide-eyed. Draco sees the entrance door, but it vanishes into a blank wall. Inside, Harry navigates a cavernous storeroom filled with furniture and junk, searching the vast space. A winged blue Pixie watches him from a gold picture frame. Harry stops, listens, and approaches a table piled with bric-a-brac, moving a silk rope to find a wooden casket. He opens it to reveal the diadem, a silver tiara with a blue stone and a tear-shaped stone. Blaise glances at Goyle, and the spells collide, sending the diadem into the air."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "They stare in horror at the drop ahead as a hand tosses a wand, then Neville's head appears as he pulls up. Dementors, Death Eaters, and Giants approach the school. Flitwick retreats as a Giant nears, but vines pin it down. Death Eaters attack the Stone Warriors, and giants knock people aside, pursuing Flitwick. An explosion rocks the courtyard, and the school burns. Death Eaters invade a tower; Arthur Weasley fends one off, and Kingsley Shacklebolt suspends another, sending him out the window. Harry propels a third Death Eater and continues downstairs. Neville runs off, and amidst chaos, Ginny and Harry kiss before she runs upstairs. Draco grabs cronies and marches Blaise and Goyle away. Harry dodges falling rubble and stops at a black stone wall—the Room of Requirement entrance. He concentrates as Ron studies the Marauder's Map. Draco sees the entrance, but it vanishes. Inside, Harry navigates a storeroom filled with furniture and junk, passing books and ornaments. A winged Pixie watches him. Harry finds a table, moves a silk rope, and opens a casket revealing a diadem, a silver tiara with a blue stone. Blaise and Goyle's spells collide, sending the diadem into the air."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "They stand frozen, staring in absolute horror at the vast, gaping drop that looms ominously ahead of them. Suddenly, a hand appears, tossing a wand into the air, followed by a second hand, and finally, Neville's head emerges as he pulls himself up with determination. Meanwhile, an intimidating army composed of Dementors, Death Eaters, and Giants advances menacingly towards the school from the opposite side. Professor Flitwick, feeling the threat, cautiously backs away between the ranks of the Stone Army as a Giant approaches with heavy steps. However, vines suddenly spring up, wrapping around the giant and pinning him firmly to the ground. Death Eaters swoop down from above, aiming deadly blasts of green light at the Stone Warriors, while two bold giants swing their massive, pronged weapons, sending people flying and plowing through the Stone Army in their relentless pursuit of the diminutive Professor Flitwick. An explosion violently rips through the courtyard, causing chaos as people scramble for cover, with parts of the school now ablaze. Death Eaters burst into a tower, where Arthur Weasley bravely fends one of them off, while Kingsley Shacklebolt skillfully suspends another in midair, then sends him flying back out of the window with a powerful spell. As Harry hurries down the stairs, he turns and propels a third Death Eater away before continuing his descent. Amidst the mayhem, Neville sprints off, and Ginny and Harry share a passionate kiss before she runs upstairs. Draco, seizing the moment, grabs two of his cronies and frog-marches Blaise and Goyle away. Harry races along a corridor where the roof is collapsing, deftly avoiding the falling rubble, and comes to an abrupt stop as he reaches a solid black stone wall—the entrance to the Room of Requirement. He concentrates intently as Ron studies the Marauder's Map, then looks up from the map, staring ahead with wide, astonished eyes. Draco spots the entrance door to the Room of Requirement, turns to his cronies, and as they rush towards the door, it vanishes, transforming into a blank wall once again. Inside, Harry finds himself in a cavernous storeroom stacked high with furniture and assorted junk. He makes his way deeper into the room, navigating the aisles between the towering stacks, roving around as he continues his search through the vast space, passing by books, statues, and gold and silver ornaments, striding at a breathtaking pace. A winged blue Pixie observes him from high atop a gold picture frame, fluttering lower to get a closer look. Harry pauses, listening intently, then turns around and gazes back the way he came. He walks very slowly and deliberately, drawn towards a table piled high with bric-a-brac, moving a coil of silk rope aside to reveal a plain wooden casket. He carefully pulls the casket forward, unfastens it, and opens the lid to reveal the diadem—a silver tiara shaped like a raven with a large blue stone at its center, and another stone hanging from it in the shape of a tear. Blaise glances across at Goyle, and as their spells collide, the diadem is thrown dramatically into the air."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "They remain utterly motionless, completely frozen in place, as they stare in absolute horror at the vast, gaping drop that ominously looms ahead of them. Out of nowhere, a hand makes an unexpected appearance, swiftly tossing a wand high into the air. This is immediately followed by the emergence of a second hand, and finally, with a great show of determination, Neville's head appears as he pulls himself up with resolute effort. Meanwhile, an intimidating army, composed of Dementors, Death Eaters, and Giants, steadily advances in a menacing manner toward the school, approaching from the opposite direction. Feeling the overwhelming threat, Professor Flitwick cautiously retreats, backing away carefully between the ranks of the Stone Army as a Giant approaches with thunderous, heavy steps. However, in a surprising turn of events, vines unexpectedly spring up, wrapping themselves tightly around the giant and pinning him firmly to the solid ground. From above, Death Eaters swoop down, aiming deadly and lethal blasts of ominous green light directly at the Stone Warriors. Simultaneously, two bold and fearless giants swing their massive, pronged weapons, sending people flying through the air and plowing mercilessly through the Stone Army, relentlessly pursuing the diminutive and agile Professor Flitwick. An earth-shattering explosion violently rips through the courtyard, creating widespread chaos as people scramble desperately for cover, with parts of the school now engulfed in flames. Death Eaters burst into a towering structure, where Arthur Weasley valiantly fends off one of them, while Kingsley Shacklebolt skillfully suspends another in midair, then expertly sends him flying backward out of the window with a powerful and effective spell. As Harry hastens down the stairs, he turns abruptly and propels a third Death Eater away with force before continuing his rapid descent. Amidst the dizzying mayhem, Neville sprints off quickly, and Ginny and Harry share a passionate and heartfelt kiss before she rushes off upstairs. Seizing the opportune moment, Draco grabs two of his cronies and hastily frog-marches Blaise and Goyle away. Harry races determinedly along a corridor, where the roof is collapsing dangerously, deftly avoiding the falling debris, and he comes to an abrupt stop as he reaches a solid, imposing black stone wall—marking the entrance to the Room of Requirement. Concentrating intently, he focuses his mind, while Ron attentively studies the Marauder's Map. Then Ron looks up from the map, staring straight ahead with wide, astonished eyes. Draco notices the entrance door leading to the Room of Requirement, turns to his cronies with urgency, and as they rush eagerly towards the door, it vanishes, transforming into a blank wall once again. Inside, Harry finds himself in what seems like a cavernous storeroom, stacked high with an array of furniture and assorted junk. He makes his way deeper and deeper into the vast room, navigating the narrow aisles between towering stacks, roving around as he meticulously continues his search through the immense space, passing by books, statues, and gold and silver ornaments, striding at a breathtaking pace. A winged blue Pixie observes him from its perch high atop a gold picture frame, fluttering lower to get a closer and more curious look. Harry pauses momentarily, listening intently for any sound. Then he turns around and gazes back in the direction from which he came. He walks very slowly and deliberately, feeling drawn toward a table piled high with assorted bric-a-brac, moving a coiled silk rope aside to reveal a plain wooden casket. With careful precision, he pulls the casket forward, unfastens it deliberately, and opens the lid to reveal the diadem—a magnificent silver tiara intricately shaped like a raven, with a large blue stone set at its center, and another, smaller stone hanging delicately from it in the shape of a tear. Blaise glances across at Goyle, and as their spells collide with force, the diadem is thrown dramatically into the air."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "They stand frozen, their eyes wide with horror as they gaze at the terrifying drop before them. Suddenly, a hand emerges, tossing a wand into the air, followed by a second hand, and then Neville's head appears as he strains and pulls himself up to safety. Meanwhile, an ominous army of Dementors, Death Eaters, and Giants advances menacingly toward the school from the opposite direction. Professor Flitwick, sensing the danger, cautiously retreats, weaving his way between the ranks of the Stone Army as a Giant looms closer. In a swift and unexpected turn, vines snake up the Giant's massive form, entangling and pinning him firmly to the ground. Death Eaters swoop down with deadly intent, unleashing blasts of green light aimed at the Stone Warriors, while two daring giants wield pronged weapons with brutal force, sending people flying and bulldozing through the Stone Army in their relentless pursuit of the diminutive Professor Flitwick. Chaos erupts as an explosion tears through the courtyard, prompting people to scatter and seek cover while parts of the school are engulfed in flames. Death Eaters storm into a tower, where Arthur Weasley bravely fends off one of them, and Kingsley Shacklebolt deftly suspends another in midair before hurling him back out of the window. As Harry hurries down the stairs, he turns sharply, propelling a third Death Eater away before continuing his descent. Amidst the pandemonium, Neville dashes off, and in a brief moment of calm, Ginny and Harry share a kiss before she races upstairs. Draco seizes two of his cronies, forcefully marching Blaise and Goyle away. Harry sprints along a corridor, deftly dodging the collapsing roof and avoiding the falling debris, until he halts abruptly upon reaching a solid black stone wall—the entrance to the Room of Requirement. He focuses intently as Ron examines the Marauder's Map, then looks up from the map, his eyes widening in realization. Draco spots the entrance to the Room of Requirement, turns to his cronies, and as they rush toward the door, it vanishes, transforming into a blank wall once more. Inside, Harry finds himself in a vast storeroom, its towering stacks of furniture and junk creating narrow aisles. He navigates deeper into the room, weaving through the clutter, his eyes scanning the endless array of books, statues, and gold and silver ornaments, striding with a sense of urgency. A winged blue Pixie perched high atop a gold picture frame observes him curiously, fluttering down for a closer look. Harry pauses, listening intently, then turns and gazes back along the path he has taken. He moves slowly and deliberately, drawn toward a table draped with cloth and piled high with bric-a-brac. Carefully, he shifts a coil of silk rope aside to reveal a plain wooden casket. He pulls the casket forward, unfastens it, and lifts the lid to uncover the diadem—a silver tiara shaped like a raven, adorned with a large blue stone at its center and another stone hanging like a tear. Blaise glances at Goyle, and as their spells collide, the diadem is flung into the air."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "They stare in horror at the gaping drop ahead as Neville pulls himself up, revealing his head and hands. An army of Dementors, Death Eaters, and Giants advances toward the school. Flitwick retreats between the Stone Army ranks as a Giant approaches, but vines ensnare the giant, pinning him down. Death Eaters attack the Stone Warriors with green blasts, while two giants swing weapons, scattering people and pursuing Flitwick. An explosion rocks the courtyard, igniting parts of the school and sending people running for cover. Death Eaters storm a tower, where Arthur Weasley fends one off, and Kingsley Shacklebolt suspends another in midair before ejecting him through a window. Harry, hurrying down the stairs, propels a third Death Eater away. Amidst the chaos, Neville sprints off, and Ginny and Harry share a kiss before she runs upstairs. Draco grabs his cronies, marching Blaise and Goyle away. Harry navigates a collapsing corridor, dodging rubble, and stops at the black stone wall marking the Room of Requirement's entrance. Concentrating, he watches as Ron studies the Marauder's Map, then stares ahead wide-eyed. Draco sees the Room's entrance, but as he and his cronies approach, it vanishes into a blank wall. Inside, Harry explores a vast storeroom filled with furniture and junk, moving swiftly through aisles, passing books, statues, and ornaments. A winged blue Pixie observes him from a gold picture frame, fluttering closer. Harry pauses, listens, and turns back, drawn to a table piled with bric-a-brac. He uncovers a plain wooden casket, opens it, and reveals the diadem—a silver tiara with a large blue stone and a tear-shaped stone. Blaise and Goyle's spells collide, sending the diadem into the air."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "They stare in horror at the gaping drop ahead of them as a hand tosses up a wand, an essential tool for wizards and witches to channel their magic, then a second hand appears, and finally, Neville's head, as he pulls himself up. An army of Dementors, soul-sucking creatures known for their ability to induce despair, Death Eaters, devoted followers of Voldemort, and Giants, huge humanoid creatures often allied with dark forces, make their way towards the school from the other side. Flitwick, the Charms professor renowned for his duel mastery, backs away between ranks of the Stone Army, enchanted statues that guard the school, as a Giant approaches, but vines, likely conjured by a nature-based spell, strip up the giant and pin him to the ground. Death Eaters swoop down, aiming blasts of the Killing Curse, a deadly spell with a green light, at the Stone Warriors, while two bold giants swing between pronged weapons resembling giant spears and knock people flying, plowing through the Stone Army in pursuit of the tinny Professor Flitwick. An explosion rips through the courtyard, and people run for cover to avoid debris and flames as parts of the school, Hogwarts, the historic wizarding school, are ablaze. Death Eaters burst into a tower, and Arthur Weasley, a member of the Order of the Phoenix resisting dark forces, fends one of them off while Kingsley Shacklebolt, a skilled Auror known for his leadership, suspends another in midair with a spell, then sends him flying back out of the window. Hurrying down the stairs, Harry, the central figure in the fight against Voldemort, turns and propels a third Death Eater with a forceful spell before continuing down the stairs. Neville sprints off, and amidst the mayhem, Ginny and Harry share a brief, passionate moment before she runs upstairs to assist in the ongoing battle. Draco, usually aligned with the Death Eaters but facing inner turmoil, grabs two cronies, Pansy and Crabbe, and frog marches Blaise and Goyle away. Harry runs along a corridor where the roof is collapsing, avoiding the falling rubble, and stops suddenly as he reaches a black stone wall—the entrance to the Room of Requirement, a magical room that appears when needed. He concentrates as Ron studies the Marauder's Map, a magical map that reveals everyone's location at Hogwarts, looks up from the map, and stares ahead wide-eyed. Draco sees the entrance door to the Room of Requirement, turns to his cronies, but as they run towards the door, it disappears and becomes a blank wall again, a defensive feature of the room. Inside, Harry sees a cavernous storeroom stacked high with furniture and junk, remnants from years of students' hidden items, making his way deeper into the room along the aisles between the stacks, roving around as he continues searching the vast space, passing books, statues, gold, and silver ornaments, striding at a breathtaking pace. A winged blue Pixie, reminiscent of Cornish Pixies known for their mischief, watches him from high up on the top of a gold picture frame and flutters lower to get a closer look. Harry stops and listens, turns around, and gazes back the way he came. He walks very slowly and deliberately, drawn towards a clothed table piled high with bric-a-brac, moving a coil silk rope aside to find a plain wooden casket. He pulls the casket forward, unfastens it, and opens the lid to reveal the diadem, an ancient artifact belonging to Rowena Ravenclaw, a founder of Hogwarts, a silver tiara in the shape of a raven with a huge blue stone in its center, and another stone hanging from it in the shape of a tear. Blaise glances across at Goyle, and the spells collide, with the diadem thrown into the air, highlighting its fragility amidst the chaos."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "They stare in horror at the gaping drop ahead of them as a hand tosses up a wand then a second hand appears and finally Neville's head as he pulls himself up. An army of Dementors Death Eaters and Giants make their way towards the school from the other side. Flitwick backs away between ranks of the Stone Army as a Giant approaches but vines strip up the giant and pin him to the ground. Death Eaters swoop down aiming blasts of green light at the Stone Warriors while two bold giants swing between pronged weapons and knock people flying plowing through the Stone Army in pursuit of the tinny Professor Flitwick. An explosion rips through the courtyard and people run for cover as parts of the school are ablaze. Death Eaters burst into a tower and Arthur Weasley fends one of them off while Kingsley Shacklebolt suspends another in midair then sends him flying back out of the window. Hurrying down the stairs Harry turns and propels a third Death Eater before continuing down the stairs. Neville sprints off and amidst the mayhem Ginny and Harry kiss before she runs upstairs. Draco grabs two cronies and frog marches Blaise and Goyle away. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Harry runs along a corridor where the roof is collapsing avoiding the falling rubble and stops suddenly as he reaches a black stone wall—the entrance to the Room of Requirement. He concentrates as Ron studies the Marauder's Map looks up from the map and stares ahead. wideeyed. Draco sees the entrance door to the Room of Requirement turns to his cronies and as they run towards the door it disappears and becomes a blank wall again. Inside Harry sees a cavernous storeroom stacked high with furniture and junk making his way deeper into the room along the aisles between the stacks roving around as he continues searching the vast space passing books statues gold and silver ornaments striding at a breathtaking pace. A winged blue Pixie watches him from high up on the top of a gold picture frame and flutters lower to get a closer look. Harry stops and listens turns around and gazes back the way he came. He walks very slowly and deliberately drawn towards a clothed table piled high with bricabrac moving a coil silk rope aside to find a plain wooden casket. He pulls the casket forward unfastens it and opens the lid to reveal the diadem a silver tiara in the shape of a raven with a huge blue stone in its center and another stone hanging from it in the shape of a tear. Blaise glances across at Goyle and the spells collide with the diadem thrown into the air."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "They stare in horror at the gaping drop ahead of them as a hand tosses up a wand then a second hand appears and finally Neville's head as he pulls himself up. An army of Dementors Death Eaters and Giants make their way towards the school from the other side. Flitwick backs away between ranks of the Stone Army as a Giant approaches but vines strip up the giant and pin him to the ground. Death Eaters swoop down aiming blasts of green light at the Stone Warriors while two bold giants swing between pronged weapons and knock people flying plowing through the Stone Army in pursuit of the tinny Professor Flitwick. An explosion rips through the courtyard and people run for cover as parts of the school are ablaze. Death Eaters burst into a tower and Arthur Weasley fends one of them off while Kingsley Shacklebolt suspends another in midair then sends him flying back out of the window. Hurrying down the stairs Harry turns and propels a third Death Eater before continuing down the stairs. Neville sprints off and amidst the mayhem Ginny and Harry kiss before she runs upstairs. Draco grabs two cronies and frog marches Blaise and Goyle away. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Harry runs along a corridor where the roof is collapsing avoiding the falling rubble and stops suddenly as he reaches a black stone wall—the entrance to the Room of Requirement. He concentrates as Ron studies the Marauder's Map looks up from the map and stares ahead. wideeyed. Draco sees the entrance door to the Room of Requirement turns to his cronies and as they run towards the door it disappears and becomes a blank wall again. Inside Harry sees a cavernous storeroom stacked high with furniture and junk making his way deeper into the room along the aisles between the stacks roving around as he continues searching the vast space passing books statues gold and silver ornaments striding at a breathtaking pace. A winged blue Pixie watches him from high up on the top of a gold picture frame and flutters lower to get a closer look. Harry stops and listens turns around and gazes back the way he came. He walks very slowly and deliberately drawn towards a clothed table piled high with bricabrac moving a coil silk rope aside to find a plain wooden casket. He pulls the casket forward unfastens it and opens the lid to reveal the diadem a silver tiara in the shape of a raven with a huge blue stone in its center and another stone hanging from it in the shape of a tear. Blaise glances across at Goyle and the spells collide with the diadem thrown into the air."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "They stare in horror at the gaping drop ahead of them as a hand tosses up a wand then a second hand appears and finally Neville's head as he pulls himself up. An army of Dementors Death Eaters and Giants make their way towards the school from the other side. Flitwick backs away between ranks of the Stone Army as a Giant approaches but vines strip up the giant and pin him to the ground. Death Eaters swoop down aiming blasts of green light at the Stone Warriors while two bold giants swing between pronged weapons and knock people flying plowing through the Stone Army in pursuit of the tinny Professor Flitwick. An explosion rips through the courtyard and people run for cover as parts of the school are ablaze. A winged blue Pixie watches him from high up on the top of a gold picture frame and flutters lower to get a closer look. Harry stops and listens turns around and gazes back the way he came. He walks very slowly and deliberately drawn towards a clothed table piled high with bricabrac moving a coil silk rope aside to find a plain wooden casket. He pulls the casket forward unfastens it and opens the lid to reveal the diadem a silver tiara in the shape of a raven with a huge blue stone in its center and another stone hanging from it in the shape of a tear. Blaise glances across at Goyle and the spells collide with the diadem thrown into the air."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "They stare in horror at the gaping drop ahead of them as a hand tosses up a wand then a second hand appears and finally Neville's head as he pulls himself up. An army of Dementors Death Eaters and Giants make their way towards the school from the other side. He pulls the casket forward unfastens it and opens the lid to reveal the diadem a silver tiara in the shape of a raven with a huge blue stone in its center and another stone hanging from it in the shape of a tear. Blaise glances across at Goyle and the spells collide with the diadem thrown into the air."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "They gape in disbelief at the towering canyon ahead of them as a paw flips up a flag, then a second paw emerges, and finally, Luna's foot, as she pushes herself up. A squad of robots, zombies, and ogres hustle toward the market from the opposite side. Hagrid darts away between rows of the Metal Brigade as an ogre lumbers closer, but ropes tie up the ogre and pin it to the floor. Zombies glide down, firing beams of red fire at the Metal Defenders, while two audacious ogres hurl between forked tools and send chairs flying, bulldozing through the Metal Brigade in pursuit of the squeaky Chef Hagrid. A blast tears through the plaza, and chairs dash for shelter as parts of the market are smoking. Zombies storm into a cabin, and Molly Prewett repels one of them while Charlie Weasley suspends another in midair, then launches him gliding back out of the entrance. Sprinting up the ladder, Ron turns and hurls a fourth zombie before veering up the ladder. Luna dashes off, and amid the chaos, Hermione and Ron hug before she climbs downstairs. Sirius pulls two allies and sternly guides Seamus and Parvati away. Ron sprints along a hallway where the ceiling is crumbling, dodging the tumbling debris, and halts abruptly as he reaches a white wooden door—the entrance to the Chamber of Secrets. He focuses as Hermione examines the Marauder's Diary, glances up from the diary, and gazes forward startled. Sirius spots the entryway to the Chamber of Secrets, turns to his allies, and as they race toward the entryway, it vanishes and becomes a solid door again. Inside, Ron discovers a vast warehouse cluttered with cookware and debris, navigating deeper into the room along the passageways between the piles, wandering around as he continues scouring the immense area, passing maps, dolls, gold, and bronze figures, striding at a dazzling tempo. A flying red Dragon observes him from high above atop a silver clock and soars lower to get a better look. Ron halts and listens, spins around, and gazes back the way he came. He paces very slowly and intentionally, drawn towards a covered bench brimming with odds and ends, shifting a braided fishnet aside to discover a simple plastic crate. He slides the crate forward, unlatches it, and lifts the cover to disclose the locket, a bronze necklace in the shape of a phoenix with an enormous red stone in its center, and another stone hanging from it in the shape of a bolt. Seamus peers across at Parvati, and the charms clash, with the locket hurled into the air."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Neville pulls himself up to face the advancing threat of Dementors, Death Eaters, and Giants at the school. As a Giant approaches, Flitwick retreats while vines subdue it. Death Eaters attack with blasts of green light, and giants wreak havoc among the Stone Army. Amidst the chaos, an explosion sets parts of the school ablaze. Arthur Weasley and Kingsley Shacklebolt fend off attackers in a tower, while Harry continues battling Death Eaters. Neville runs as Ginny and Harry share a kiss before she departs. Draco hastily escorts Blaise and Goyle away. Harry navigates a collapsing corridor to reach the Room of Requirement, where he searches a cavernous storeroom stacked with clutter. A Pixie observes him as he finds a wooden casket. Inside, he discovers a diadem shaped like a raven with a blue stone. As spells from Blaise and Goyle collide, the diadem is sent flying."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Blaise glances across at Goyle and the spells collide with the diadem thrown into the air He pulls the casket forward unfastens it and opens the lid to reveal the diadem a silver tiara in the shape of a raven with a huge blue stone in its center and another stone hanging from it in the shape of a tear  He walks very slowly and deliberately drawn towards a clothed table piled high with bricabrac moving a coil silk rope aside to find a plain wooden casket  Harry stops and listens turns around and gazes back the way he came  A winged blue Pixie watches him from high up on the top of a gold picture frame and flutters lower to get a closer look  Inside Harry sees a cavernous storeroom stacked high with furniture and junk making his way deeper into the room along the aisles between the stacks roving around as he continues searching the vast space passing books statues gold and silver ornaments striding at a breathtaking pace  Draco sees the entrance door to the Room of Requirement turns to his cronies and as they run towards the door it disappears and becomes a blank wall again  wideeyed  He concentrates as Ron studies the Marauder's Map looks up from the map and stares ahead  Harry runs along a corridor where the roof is collapsing avoiding the falling rubble and stops suddenly as he reaches a black stone wall—the entrance to the Room of Requirement  Draco grabs two cronies and frog marches Blaise and Goyle away  Neville sprints off and amidst the mayhem Ginny and Harry kiss before she runs upstairs  Hurrying down the stairs Harry turns and propels a third Death Eater before continuing down the stairs  Death Eaters burst into a tower and Arthur Weasley fends one of them off while Kingsley Shacklebolt suspends another in midair then sends him flying back out of the window  An explosion rips through the courtyard and people run for cover as parts of the school are ablaze  Death Eaters swoop down aiming blasts of green light at the Stone Warriors while two bold giants swing between pronged weapons and knock people flying plowing through the Stone Army in pursuit of the tinny Professor Flitwick  Flitwick backs away between ranks of the Stone Army as a Giant approaches but vines strip up the giant and pin him to the ground  An army of Dementors Death Eaters and Giants make their way towards the school from the other side  They stare in horror at the gaping drop ahead of them as a hand tosses up a wand then a second hand appears and finally Neville's head as he pulls himself up "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "An army of Dementors Death Eaters and Giants make their way towards the school from the other side They stare in horror at the gaping drop ahead of them as a hand tosses up a wand then a second hand appears and finally Neville's head as he pulls himself up Death Eaters swoop down aiming blasts of green light at the Stone Warriors while two bold giants swing between pronged weapons and knock people flying plowing through the Stone Army in pursuit of the tinny Professor Flitwick Flitwick backs away between ranks of the Stone Army as a Giant approaches but vines strip up the giant and pin him to the ground Death Eaters burst into a tower and Arthur Weasley fends one of them off while Kingsley Shacklebolt suspends another in midair then sends him flying back out of the window An explosion rips through the courtyard and people run for cover as parts of the school are ablaze Neville sprints off and amidst the mayhem Ginny and Harry kiss before she runs upstairs Hurrying down the stairs Harry turns and propels a third Death Eater before continuing down the stairs Harry runs along a corridor where the roof is collapsing avoiding the falling rubble and stops suddenly as he reaches a black stone wall—the entrance to the Room of Requirement Draco grabs two cronies and frog marches Blaise and Goyle away wideeyed He concentrates as Ron studies the Marauder's Map looks up from the map and stares ahead Inside Harry sees a cavernous storeroom stacked high with furniture and junk making his way deeper into the room along the aisles between the stacks roving around as he continues searching the vast space passing books statues gold and silver ornaments striding at a breathtaking pace Draco sees the entrance door to the Room of Requirement turns to his cronies and as they run towards the door it disappears and becomes a blank wall again Harry stops and listens turns around and gazes back the way he came A winged blue Pixie watches him from high up on the top of a gold picture frame and flutters lower to get a closer look He pulls the casket forward unfastens it and opens the lid to reveal the diadem a silver tiara in the shape of a raven with a huge blue stone in its center and another stone hanging from it in the shape of a tear He walks very slowly and deliberately drawn towards a clothed table piled high with bricabrac moving a coil silk rope aside to find a plain wooden casket Blaise glances across at Goyle and the spells collide with the diadem thrown into the air"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He concentrates as Ron studies the Marauder's Map looks up from the map and stares ahead  wideeyed  Draco sees the entrance door to the Room of Requirement turns to his cronies and as they run towards the door it disappears and becomes a blank wall again  Inside Harry sees a cavernous storeroom stacked high with furniture and junk making his way deeper into the room along the aisles between the stacks roving around as he continues searching the vast space passing books statues gold and silver ornaments striding at a breathtaking pace  A winged blue Pixie watches him from high up on the top of a gold picture frame and flutters lower to get a closer look  Harry stops and listens turns around and gazes back the way he came  He walks very slowly and deliberately drawn towards a clothed table piled high with bricabrac moving a coil silk rope aside to find a plain wooden casket  He pulls the casket forward unfastens it and opens the lid to reveal the diadem a silver tiara in the shape of a raven with a huge blue stone in its center and another stone hanging from it in the shape of a tear  Blaise glances across at Goyle and the spells collide with the diadem thrown into the air They stare in horror at the gaping drop ahead of them as a hand tosses up a wand then a second hand appears and finally Neville's head as he pulls himself up  An army of Dementors Death Eaters and Giants make their way towards the school from the other side  Flitwick backs away between ranks of the Stone Army as a Giant approaches but vines strip up the giant and pin him to the ground  Death Eaters swoop down aiming blasts of green light at the Stone Warriors while two bold giants swing between pronged weapons and knock people flying plowing through the Stone Army in pursuit of the tinny Professor Flitwick  An explosion rips through the courtyard and people run for cover as parts of the school are ablaze  Death Eaters burst into a tower and Arthur Weasley fends one of them off while Kingsley Shacklebolt suspends another in midair then sends him flying back out of the window  Hurrying down the stairs Harry turns and propels a third Death Eater before continuing down the stairs  Neville sprints off and amidst the mayhem Ginny and Harry kiss before she runs upstairs  Draco grabs two cronies and frog marches Blaise and Goyle away  Harry runs along a corridor where the roof is collapsing avoiding the falling rubble and stops suddenly as he reaches a black stone wall—the entrance to the Room of Requirement "
        }
      ]
    }
  ]
}