{
  "ground_truth": "Stars drift slowly in the blackness of space and a moon glows silver in the darkness, seen from the mountainous surface of the Earth. Letters form around the moon, and a circle of reflected sunlight and the Earth form the two Os. In 1928, a blizzard lashes the Karakoram mountains in India. In a tent, a candle glows in a lantern, and a cup of snow is placed on a gas burner. Climbing spikes are sharpened, and wind tears at the canvas walls of the tent. A light shines outside, then goes dark, and a bearded climber looks puzzled. He emerges from the tent in thick furs with a climbing ax and a rope wrapped around him, and he pulls on goggles to protect his eyes. Beams of light radiate skywards from behind a rocky ridge as the climber carefully ascends a snowy slope and inches up a near vertical cliff. He plunges his ice ax into the rock and hauls himself up over the edge of the rock face, standing slowly upright and moving forward as the wind howls around him. He moves on, steadying himself with the ice ax, raising his goggles to stare at a glowing ball embedded in the snowy rock. Lights pulse inside the orb as he approaches it, closing on the object, which is about 10 feet high, with a crystalline surface and shadows and lights swirling inside. He reaches out a laser mutant hand on the orb and slowly runs his hand over the surface, eyes narrowed above his snow-crusted dark beard, then raises the eye axe. Light shines out as he breaks the crystalline crust, squinting at the intensity of the swirling brilliance within. He is enveloped in a brilliant light of overwhelming intensity, and the eye sac lies on the snow as the climber lies next to it, his eyes closed. He awakens and rises slowly, seats up, and looks around. There is a spherical hole in the snowy rock face, but the orb is gone. The climber looks at his right hand, finding the mitten has a hole in it. He removes it, revealing a round coin-sized scar on the back of his hand, frowns, and checks his palm, too. He seats on the snow-covered rocky ground and looks skywards through the swirling snow. An object seen through an electron microscope appears on a screen. The tutor is slim, with dark hair tied in a ponytail, and she smiles hesitantly. Cars stream across an arched iron bridge over a river as the tutor drives a small silver hatchback. A computer game character has a sword across his back, and Jacob has got long dark curly hair. The tutor, his guardian, is white, and Jacob is black. She crosses to the bed where he's concentrating on the game and sits beside him.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Stars drift leisurely in the void of cosmos and a satellite glows argent in the obscurity, observed from the hilly exterior of the Earth. Characters shape around the satellite, and a loop of mirrored daylight and the Earth shape the two Os. In 1928, a snowstorm lashes the Karakoram peaks in India. In a shelter, a taper glows in a lamp, and a mug of frost is situated on a gas range. Climbing cleats are honed, and breeze rips at the canvas barriers of the shelter. A beam illuminates outside, then goes dim, and a whiskered mountaineer appears perplexed. He emerges from the shelter in dense pelts with a climbing axe and a cord wrapped around him, and he pulls on spectacles to shield his eyes. Rays of light extend skywards from behind a stony escarpment as the mountaineer cautiously scales a frosty incline and inches up a near perpendicular bluff. He thrusts his ice axe into the boulder and pulls himself up over the brink of the boulder face, standing gradually upright and moving onward as the wind wails around him. He proceeds on, balancing himself with the ice axe, lifting his spectacles to gaze at a glowing sphere embedded in the frosty boulder. Lights throb inside the orb as he nears it, approaching the artifact, which is about 10 feet tall, with a crystal-like shell and shadows and lights swirling within. He reaches out a laser mutant hand on the orb and slowly runs his hand over the surface, eyes narrowed above his snow-encrusted dark beard, then raises the eye axe. Light shines out as he fractures the crystal-like crust, squinting at the strength of the swirling brilliance within. He is shrouded in a dazzling light of immense strength, and the eye axe lies on the snow as the mountaineer lies beside it, his eyes sealed. He awakens and rises slowly, sits up, and looks around. There is a spherical void in the frosty boulder face, but the orb is absent. The mountaineer looks at his right hand, discovering the mitten has a void in it. He removes it, revealing a circular coin-sized scar on the back of his hand, frowns, and inspects his palm, too. He sits on the snow-blanketed stony ground and looks skywards through the swirling snow. An entity observed through an electron microscope appears on a display. The tutor is slender, with dark hair tied in a ponytail, and she smiles hesitantly. Cars stream across an arched iron bridge over a river as the tutor drives a small silver hatchback. A computer game character has a sword across his back, and Jacob has got long dark curly hair. The tutor, his guardian, is white, and Jacob is black. She crosses to the bed where he's concentrating on the game and seats beside him."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Stars are slowly drifted in the blackness of space, and the moon is glowed silver in the darkness, as seen from the mountainous surface of the Earth. The moon forms letters around it, and the two Os are formed by a circle of reflected sunlight and the Earth. In 1928, the Karakoram mountains in India are lashed by a blizzard. In a tent, a lantern is glowed by a candle, and someone places a cup of snow on a gas burner. Someone sharpens the climbing spikes, and the canvas walls of the tent are torn at by the wind. A light is shone outside, then someone makes it go dark, and a bearded climber is made puzzled by it. The tent is emerged from by him in thick furs with a climbing ax and a rope wrapped around him, and goggles are pulled on by him to protect his eyes. Beams of light are radiated skywards from behind a rocky ridge as a snowy slope is carefully ascended by the climber, who inches up a near vertical cliff. The ice ax is plunged by him into the rock, and he hauls himself up over the edge of the rock face, standing slowly upright and moving forward as the wind is howled around him. He is moved on, steadied by the ice ax, and raises his goggles to stare at a glowing ball that is embedded in the snowy rock. Inside the orb, lights pulse as he approaches it, closing on the object, which is about 10 feet high, with a crystalline surface and shadows and lights swirling inside. The orb is reached out to by a laser mutant hand, and the surface is slowly run over by his hand, eyes narrowed above his snow-crusted dark beard, then the eye axe is raised by him. Light is shone out as the crystalline crust is broken by him, squinting at the intensity of the swirling brilliance within. He becomes enveloped in a brilliant light of overwhelming intensity, and the eye axe is left lying on the snow as the climber lies next to it, his eyes closed. Slowly, he awakens and rises, seating up, and is looking around. In the snowy rock face, a spherical hole is seen, but the orb is gone. His right hand is looked at by the climber, finding the mitten has a hole in it. He removes it, revealing a round coin-sized scar on the back of his hand, frowns, and checks his palm, too. On the snow-covered rocky ground, he seats and looks skywards through the swirling snow. An object is seen through an electron microscope, which appears on a screen. The tutor, slim with dark hair tied in a ponytail, smiles hesitantly. Cars are streamed across an arched iron bridge over a river by the tutor, who drives a small silver hatchback. Across the back of a computer game character is a sword, and Jacob has long dark curly hair. The tutor, his guardian, is white, while Jacob is black. She crosses to the bed where he's concentrating on the game and sits beside him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Stars drift gently in space with a silver moon visible from Earth's mountainous surface. Letters form around the moon, using sunlight and Earth for the Os. In 1928, a blizzard hits the Karakoram mountains, India. A candle flickers in a tent where snow melts on a burner, spikes are sharpened, and wind pelts the tent's canvas. A bearded climber, in thick furs, emerges with a climbing ax, goggles, and rope. He ascends a snowy slope, using his ice ax to scale a cliff. At the top, he discovers a glowing orb embedded in the rock. Lights pulse inside as he touches its crystalline surface, then breaks it with his ax, unleashing intense light. He collapses and wakes to find a hole in the rock but the orb gone. A mitten with a hole reveals a coin-sized scar on his hand. Seated on the snow, he looks skyward. An object under an electron microscope appears. A slim tutor with a ponytail hesitantly smiles. Cars cross an iron bridge as she drives a silver hatchback. A computer game shows a character with a sword, and Jacob, with long curly hair, plays. The tutor, his guardian, is white; Jacob is black. She sits beside him on the bed as he focuses on the game."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Stars drift in space, and a moon glows, viewed from Earth's mountains. Letters form around the moon, with sunlight and Earth creating the Os. In 1928, a blizzard hits India's Karakoram mountains. Inside a tent, a candle glows, snow melts on a burner, and spikes are sharpened while wind lashes the tent. A climber in furs exits with a rope and climbing ax, dons goggles, and climbs a snowy slope and cliff. He uses his ax to pull himself up, standing in howling wind, then approaches a glowing orb in the snow. Lights pulse as he examines it, touching it with a laser-mutated hand. Light bursts as he breaks the orb with his ax, engulfing him. Waking, he finds the orb gone, a hole in his mitten, and a scar on his hand. He sits, gazing skyward through snow. An object under an electron microscope appears on a screen. A slim tutor with dark hair drives over a bridge. A computer game character has a sword, and Jacob has long dark hair. The white tutor, Jacob's guardian, joins him on his bed as he plays."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Stars drift lazily and effortlessly in the inky blackness of the vast space, while a solitary moon casts a silver glow, illuminating the darkness. This celestial scene is observed from the rugged, mountainous surface of the Earth. Gradually, letters start to form around the glowing moon, and in a clever design, a circle of reflected sunlight and the Earth together form the two Os in the title. In the year 1928, a fierce blizzard relentlessly lashes the towering Karakoram mountains located in India. Within the confines of a tent, a lone candle flickers dimly inside a lantern, while a cup filled with snow is placed purposefully on a gas burner. Meanwhile, climbing spikes are methodically sharpened, and the wind fiercely tears at the canvas walls of the tent. A light shines momentarily outside, only to suddenly extinguish, leading a bearded climber to look puzzled. He emerges cautiously from the tent, wearing thick, protective furs, equipped with a climbing ax and a rope securely wrapped around him. He pulls on a pair of goggles to shield and protect his eyes. Beams of light radiate skywards from behind a jagged rocky ridge as the determined climber carefully ascends the snowy slope, inching his way up a nearly vertical cliff. He forcefully plunges his ice ax into the rock, laboriously hauling himself up over the edge of the rock face, standing slowly upright, and moving forward as the wind howls ferociously around him. He presses on, steadying himself with the trusty ice ax, raising his goggles to examine a mysteriously glowing ball embedded in the snowy rock. Lights pulse rhythmically inside the orb as he approaches it, closing in on the intriguing object, which stands about 10 feet high, with an enchanting crystalline surface and mesmerizing shadows and lights swirling within it. He reaches out with a laser mutant hand, slowly running his hand over the smooth surface, eyes narrowed above his snow-crusted dark beard. Then, summoning his courage, he raises the eye ax. Light bursts forth as he breaks through the crystalline crust, squinting against the intense swirling brilliance within. He suddenly becomes enveloped in a brilliant, overwhelming light of unimaginable intensity, and the eye ax lies abandoned on the snow as the climber rests beside it, his eyes closed. Gradually, he awakens and rises slowly, sitting up and looking around in confusion. There is now a spherical hole in the snowy rock face, but the orb is mysteriously gone. The climber looks at his right hand and discovers the mitten has a hole in it. He removes it, revealing a puzzling round, coin-sized scar on the back of his hand, frowns in thought, and checks his palm, too. He sits down heavily on the snow-covered rocky ground, staring skywards through the swirling snowflakes. Meanwhile, an object seen through an electron microscope appears on a screen. The tutor, a slim figure with dark hair tied neatly in a ponytail, smiles hesitantly. Cars stream steadily across a grand, arched iron bridge over a river as the tutor drives a small silver hatchback. In a virtual world, a computer game character carries a sword slung across his back, and Jacob is depicted with long, dark, curly hair. The tutor, who is also his guardian, is white, while Jacob is black. She crosses over to the bed where he is intently concentrating on the game and sits down beside him."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Stars drift lazily and effortlessly across the vast, inky blackness of the endless space above. Meanwhile, a solitary moon casts its gentle, silver glow, illuminating the darkness with a soothing light. This celestial scene, with its serene beauty, is observed from the rugged, mountainous surface of our Earth. Gradually, letters begin to take shape around the glowing moon. In an ingenious design, a circle of reflected sunlight and the Earth together creatively form the two Os in the title. In the year 1928, a fierce and unyielding blizzard relentlessly lashes the towering, majestic Karakoram mountains situated in India. Within the confines of a small tent, a lone candle flickers dimly inside a protective lantern, casting flickering shadows, while a cup filled with snow is placed purposefully on a gas burner to melt. Nearby, climbing spikes are being methodically sharpened, and the wind howls fiercely as it tears at the canvas walls of the tent. A light momentarily shines outside, only to be suddenly extinguished, prompting a puzzled, bearded climber to look around questioningly. He emerges cautiously from the tent, wearing thick, protective furs and equipped with a climbing ax and a rope securely wrapped around him. He carefully pulls on a pair of goggles to shield and protect his eyes from the harsh elements. Beams of light radiate skyward from behind a jagged, rocky ridge as the determined climber undertakes the daunting task of carefully ascending the snowy slope, inching his way up a nearly vertical cliff. With determination, he forcefully plunges his ice ax into the rock, hauling himself up laboriously over the edge of the rock face. Slowly standing upright, he moves forward as the wind howls ferociously around him. He presses on, steadying himself with the trusty ice ax, before raising his goggles to examine a mysteriously glowing ball that is embedded in the snowy rock. Lights pulse rhythmically inside the orb as he approaches it, closing in on the intriguing object, which stands about 10 feet high, with an enchanting crystalline surface that mesmerizes with swirling shadows and lights. He reaches out with his laser mutant hand, slowly running it over the smooth surface, his eyes narrowing above his snow-crusted, dark beard. Then, mustering his courage, he raises the ice ax. A burst of light surges forth as he breaks through the crystalline crust, squinting against the intense swirling brilliance within. Suddenly, he becomes enveloped in a blinding, brilliant light of unimaginable intensity, leaving the ice ax abandoned on the snow. The climber rests beside it, his eyes closed. Gradually, he awakens, rising slowly, and sits up, looking around in confusion. A spherical hole now marks the snowy rock face, but the orb is mysteriously gone. The climber looks at his right hand and discovers a hole in his mitten. He removes it, revealing a puzzling round, coin-sized scar on the back of his hand, frowns in thought, and checks his palm as well. He sits down heavily on the snow-covered, rocky ground, staring skywards through the ever-swirling snowflakes. Meanwhile, an object, magnified under an electron microscope, appears on a display screen. The tutor, a slim individual with dark hair tied neatly in a ponytail, smiles hesitantly. Cars stream steadily across a grand, arched iron bridge spanning a river, as the tutor drives a small silver hatchback. In a virtual world, a computer game character carries a sword slung across his back, and Jacob is depicted with long, dark, curly hair. The tutor, who also happens to be his guardian, is white, while Jacob is black. She crosses over to the bed where he is intently concentrating on the game and sits down beside him, offering companionship and support."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As stars drift slowly in the expanse of space, casting their subtle glow into the vast blackness, a moon glows with a silvery luminescence, prominently visible from the mountainous surface of the Earth. Amidst this celestial view, letters begin to form around the moon, while a circle, reflecting sunlight and the Earth, seamlessly creates the two Os. Shifting to the harsh winter of 1928, a fierce blizzard relentlessly lashes against the towering peaks of the Karakoram mountains in India. Inside a small, weather-beaten tent, a solitary candle flickers within a lantern, casting a warm glow. A cup brimming with snow is dutifully placed on a gas burner, beginning the slow process of melting. Climbing spikes are meticulously sharpened, preparing for the treacherous ascent, as the relentless wind tears at the canvas walls of the tent with unyielding force. Suddenly, a light pierces through the darkness outside before abruptly going dark, prompting a bearded climber to look around with a puzzled expression. He emerges from the protective confines of the tent, clad in thick furs to shield against the cold, and carries essential climbing gear, including a climbing ax and a rope secured around his body. To protect his eyes from the biting wind and swirling snow, he pulls on protective goggles. As beams of light radiate upwards from behind a rocky ridge, he begins his careful ascent up a snowy slope, inching slowly and deliberately up a near-vertical cliff. Driving his ice ax into the firm rock, he hauls himself to the top of the rock face, then stands slowly, stabilizing himself against the howling wind. Moving forward, he steadies himself with his ice ax, then raises his goggles to get an unobstructed view of a fascinating sight—a glowing orb embedded within the snowy rock. As he approaches, the orb's lights pulse with intensity, drawing him closer to this mysterious object, which stands about 10 feet high with a crystalline surface and swirling shadows and lights inside. He reaches out, his hand hovering over the orb's surface, and slowly runs his fingers across it, his eyes narrowing beneath his snow-crusted dark beard. As he raises his ice ax, light spills forth when he breaks through the crystalline crust, forcing him to squint against the swirling brilliance emanating from within. Enveloped in an overwhelming brilliance, he drops the ice ax, which lies on the snow as he collapses beside it, his eyes closing involuntarily. Slowly, he awakens, gingerly rising to a seated position to gather his bearings. Surveying the area, he notices a spherical hole in the snowy rock face, but the mysterious orb has vanished. Inspecting his right hand, he discovers a hole in his mitten. Removing it, he reveals a round, coin-sized scar on the back of his hand, prompting a frown as he checks his palm for further changes. He sits on the snow-covered rocky ground and lifts his gaze skyward, contemplating the swirling snow above. In a sudden shift, an image of an object viewed through an electron microscope appears on a screen. A slim tutor, her dark hair tied back in a ponytail, smiles hesitantly. Meanwhile, cars stream effortlessly across an arched iron bridge spanning a river as the tutor navigates a small silver hatchback, seamlessly blending into the flow of traffic. In a different setting, a computer game character is depicted with a sword strapped to his back. Jacob, a young boy with long dark curly hair, is deeply absorbed in the game. The tutor, identified as his guardian, is white, and Jacob is black. She crosses the room, approaching the bed where Jacob is engrossed in his game, and sits beside him, offering company and connection in his focused world."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Stars fill the blackness of space while a moon glows, seen from the Earth’s mountainous surface. Letters form around the moon, with reflected sunlight and Earth creating the Os. In 1928, a blizzard rages in the Karakoram mountains, India. In a tent, a candle-lit lantern illuminates a climber sharpening spikes, warming snow over a burner, with wind battering the tent walls. Noticing a light outside that disappears, the bearded climber, clad in thick fur, goggles, and climbing gear, exits the tent. He ascends a snowy slope and a sheer cliff with his ice ax, eventually reaching a glowing orb in the rock. As he explores the orb's crystalline surface, lights pulse inside. He breaks the crust with his ax, releasing a blinding light that envelops him. Awakening beside his ax, he finds the orb gone, a coin-sized scar on his hand, and looks skyward through the swirling snow.\n\nElsewhere, an object appears under an electron microscope. A slim tutor with dark hair tied in a ponytail hesitantly smiles. She drives a silver hatchback over an arched iron bridge. At home, she joins Jacob, a black youth with long dark curly hair, on his bed as he focuses on a computer game featuring a character with a sword. The tutor, his guardian, watches him play."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Stars drift slowly in the blackness of space, an endless expanse where galaxies and nebulae stretch over incomprehensible distances, and a moon glows silver in the darkness, seen from the mountainous surface of the Earth where ancient peaks like the Himalayas rise majestically. Letters form around the moon, and a circle of reflected sunlight and the Earth form the two Os, reminiscent of the celestial dance between the sun, Earth, and moon that creates solar and lunar eclipses.\n\nIn 1928, a blizzard lashes the Karakoram mountains in India, a formidable range that hosts some of the world's highest peaks, including K2. In a tent, a candle glows in a lantern, providing a fragile light akin to the adventurous spirit of early 20th-century mountaineers, and a cup of snow is placed on a gas burner, a crucial survival method for melting drinking water at high altitudes. Climbing spikes are sharpened with precision, essential tools for gripping icy surfaces, and wind tears at the canvas walls of the tent, a testament to the harsh and unforgiving nature of high-altitude weather. A light shines outside, then goes dark, and a bearded climber looks puzzled. He emerges from the tent in thick furs, a necessity for warmth in subzero temperatures, with a climbing ax and a rope wrapped around him, each tool crucial for safe ascension, and he pulls on goggles to protect his eyes from the blinding glare of snow and ice. Beams of light, possibly from the morning sun, radiate skywards from behind a rocky ridge as the climber carefully ascends a snowy slope and inches up a near-vertical cliff. He plunges his ice ax into the rock and hauls himself up over the edge of the rock face, standing slowly upright and moving forward as the wind howls around him, a sound that echoes the isolation of the high altitudes. He moves on, steadying himself with the ice ax, raising his goggles to stare at a glowing ball embedded in the snowy rock. Lights pulse inside the orb as he approaches it, closing on the object, which is about 10 feet high, with a crystalline surface and shadows and lights swirling inside, reminiscent of early accounts of mysterious artifacts found in unexplored regions. He reaches out a laser mutant hand on the orb and slowly runs his hand over the surface, eyes narrowed above his snow-crusted dark beard, then raises the eye ax. Light shines out as he breaks the crystalline crust, squinting at the intensity of the swirling brilliance within. He is enveloped in a brilliant light of overwhelming intensity, and the eye sac lies on the snow as the climber lies next to it, his eyes closed.\n\nHe awakens and rises slowly, seats up, and looks around. There is a spherical hole in the snowy rock face, but the orb is gone. The climber looks at his right hand, finding the mitten has a hole in it. He removes it, revealing a round coin-sized scar on the back of his hand, frowns, and checks his palm, too. He seats on the snow-covered rocky ground and looks skywards through the swirling snow, contemplating the mysteries of the universe. An object seen through an electron microscope, a tool allowing scientists to view objects at the atomic level, appears on a screen. The tutor is slim, with dark hair tied in a ponytail, and she smiles hesitantly, suggesting a sense of mild uncertainty or encouragement. Cars stream across an arched iron bridge over a river, perhaps one of the many historic bridges like the Brooklyn Bridge, as the tutor drives a small silver hatchback, a common and economical vehicle. A computer game character has a sword across his back, reminiscent of classic fantasy adventures, and Jacob has got long dark curly hair. The tutor, his guardian, is white, and Jacob is black, highlighting their close relationship across cultural backgrounds. She crosses to the bed where he's concentrating on the game and sits beside him, sharing a quiet moment in their shared space."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Stars drift slowly in the blackness of space and a moon glows silver in the darkness seen from the mountainous surface of the Earth. Letters form around the moon and a circle of reflected sunlight and the Earth form the two Os. In 1928 a blizzard lashes the Karakoram mountains in India. In a tent a candle glows in a lantern and a cup of snow is placed on a gas burner. Climbing spikes are sharpened and wind tears at the canvas walls of the tent. A light shines outside then goes dark and a bearded climber looks puzzled. He emerges from the tent in thick furs with a climbing ax and a rope wrapped around him and he pulls on goggles to protect his eyes. Beams of light radiate skywards from behind a rocky ridge as the climber carefully ascends a snowy slope and inches up a near vertical cliff. He plunges his ice ax into the rock and hauls himself up over the edge of the rock face standing slowly upright and moving forward as the wind howls around him. He moves on steadying himself with the ice ax raising his goggles to stare at a glowing ball embedded in the snowy rock. Lights pulse inside the orb as he approaches it closing on the object which is about 10 feet high with a crystalline surface and shadows and lights swirling inside. He reaches out a laser mutant hand on the orb and slowly runs his hand over the surface eyes narrowed above his snowcrusted dark beard then raises the eye axe. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Light shines out as he breaks the crystalline crust squinting at the intensity of the swirling brilliance within. He is enveloped in a brilliant light of overwhelming intensity and the eye sac lies on the snow as the climber lies next to it his eyes closed. He awakens and rises slowly seats up and looks around. There is a spherical hole in the snowy rock face but the orb is gone. The climber looks at his right hand finding the mitten has a hole in it. He removes it revealing a round coinsized scar on the back of his hand frowns and checks his palm too. He seats on the snowcovered rocky ground and looks skywards through the swirling snow. An object seen through an electron microscope appears on a screen. The tutor is slim with dark hair tied in a ponytail and she smiles hesitantly. Cars stream across an arched iron bridge over a river as the tutor drives a small silver hatchback. A computer game character has a sword across his back and Jacob has got long dark curly hair. The tutor his guardian is white and Jacob is black. She crosses to the bed where he is concentrating on the game and sits beside him."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Stars drift slowly in the blackness of space and a moon glows silver in the darkness seen from the mountainous surface of the Earth. Letters form around the moon and a circle of reflected sunlight and the Earth form the two Os. In 1928 a blizzard lashes the Karakoram mountains in India. In a tent a candle glows in a lantern and a cup of snow is placed on a gas burner. Climbing spikes are sharpened and wind tears at the canvas walls of the tent. A light shines outside then goes dark and a bearded climber looks puzzled. He emerges from the tent in thick furs with a climbing ax and a rope wrapped around him and he pulls on goggles to protect his eyes. Beams of light radiate skywards from behind a rocky ridge as the climber carefully ascends a snowy slope and inches up a near vertical cliff. He plunges his ice ax into the rock and hauls himself up over the edge of the rock face standing slowly upright and moving forward as the wind howls around him. He moves on steadying himself with the ice ax raising his goggles to stare at a glowing ball embedded in the snowy rock. Lights pulse inside the orb as he approaches it closing on the object which is about 10 feet high with a crystalline surface and shadows and lights swirling inside. He reaches out a laser mutant hand on the orb and slowly runs his hand over the surface eyes narrowed above his snowcrusted dark beard then raises the eye axe. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Light shines out as he breaks the crystalline crust squinting at the intensity of the swirling brilliance within. He is enveloped in a brilliant light of overwhelming intensity and the eye sac lies on the snow as the climber lies next to it his eyes closed. He awakens and rises slowly seats up and looks around. There is a spherical hole in the snowy rock face but the orb is gone. The climber looks at his right hand finding the mitten has a hole in it. He removes it revealing a round coinsized scar on the back of his hand frowns and checks his palm too. He seats on the snowcovered rocky ground and looks skywards through the swirling snow. An object seen through an electron microscope appears on a screen. The tutor is slim with dark hair tied in a ponytail and she smiles hesitantly. Cars stream across an arched iron bridge over a river as the tutor drives a small silver hatchback. A computer game character has a sword across his back and Jacob has got long dark curly hair. The tutor his guardian is white and Jacob is black. She crosses to the bed where he is concentrating on the game and sits beside him."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Stars drift slowly in the blackness of space and a moon glows silver in the darkness seen from the mountainous surface of the Earth. Letters form around the moon and a circle of reflected sunlight and the Earth form the two Os. In 1928 a blizzard lashes the Karakoram mountains in India. In a tent a candle glows in a lantern and a cup of snow is placed on a gas burner. Climbing spikes are sharpened and wind tears at the canvas walls of the tent. A light shines outside then goes dark and a bearded climber looks puzzled. He seats on the snowcovered rocky ground and looks skywards through the swirling snow. An object seen through an electron microscope appears on a screen. The tutor is slim with dark hair tied in a ponytail and she smiles hesitantly. Cars stream across an arched iron bridge over a river as the tutor drives a small silver hatchback. A computer game character has a sword across his back and Jacob has got long dark curly hair. The tutor his guardian is white and Jacob is black. She crosses to the bed where he is concentrating on the game and sits beside him."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Stars drift slowly in the blackness of space and a moon glows silver in the darkness seen from the mountainous surface of the Earth. Letters form around the moon and a circle of reflected sunlight and the Earth form the two Os. A computer game character has a sword across his back and Jacob has got long dark curly hair. The tutor his guardian is white and Jacob is black. She crosses to the bed where he is concentrating on the game and sits beside him."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Comets drift gently in the void of the ocean and a lantern glows green in the twilight, seen from the sandy bottom of the sea. Numbers form around the lantern, and a ring of mirrored flames and the ocean form the two Os. In 1953, a tornado rattles the Andes peaks in Brazil. In a cabin, an oil lamp glimmers in a bottle, and a dish of pebbles is placed on a coal stove. Fishing hooks are polished, and rain hammers at the wooden doors of the cabin. A glow flickers inside, then fades out, and a masked sailor appears confused. She steps out of the cabin in light armor with a fishing net and a snake coiled around her, and she dons spectacles to shield her eyes. Streams of mist radiate groundwards from beneath a towering dune as the sailor carefully descends a sandy hill and slithers down a sheer granite wall. She thrusts her spear into the granite and drags herself up over the lip of the cliff face, rising steadily upright and moving onward as the gusts roar around her. She advances, stabilizing herself with the spear, lowering her spectacles to gaze at a flickering cube embedded in the sandy granite. Shadows flicker inside the block as she nears it, nearing the structure, which is about 20 feet tall, with a metallic exterior and glimmers and shadows spiraling inside. She extends a silicon animal paw on the block and gently traces her paw over the exterior, eyes drowsy above her sand-dusted light mask, then lifts the hand claw. Glow bursts out as she pierces the metallic shell, blinking at the power of the spiraling radiance within. She is engulfed in a dazzling blaze of extreme power, and the hand claw rests on the granite as the sailor reclines next to it, her eyes shut. She comes to consciousness and rises gradually, hops up, and peers around. There is a cylindrical gap in the sandy granite wall, but the block is vanished. The sailor examines her left paw, noticing the glove has a rip in it. She takes it off, exposing a square token-sized dent on the back of her paw, grimaces, and inspects her wrist, too. She hops on the sand-sprinkled granite ground and gazes groundwards through the stagnant fog. A creature observed through a telescope forms on a display. The instructor is plump, with blonde hair tied in a braid, and he laughs awkwardly. Birds soar past a crumbling stone viaduct across a canyon as the instructor skates a tiny bronze skateboard. A virtual reality game creature has a spear over her shoulder, and Emily has short blonde straight hair. The instructor, her caretaker, is green, and Emily is blue. He strolls to the chair where she's fixated on the game and kneels beside her."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Stars drift in the darkness of space, with a silver moon glowing above the mountainous Earth. In 1928, a climber battles a blizzard in India’s Karakoram mountains. Inside his tent, he prepares gear as wind tears at the canvas. Puzzled by a light outside, he ventures out, armed with climbing gear and goggles. Ascending a snowy slope and vertical cliff, he finds a glowing orb embedded in rock. As he touches and strikes it with his axe, a brilliant light engulfs him. When he recovers, the orb is gone, leaving a scar on his hand. He sits, gazing skyward through swirling snow. Meanwhile, a tutor, slim with dark hair, drives across an iron bridge, overseeing Jacob, a young guardian with long curly hair, as he plays a computer game."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She crosses to the bed where he is concentrating on the game and sits beside him The tutor his guardian is white and Jacob is black A computer game character has a sword across his back and Jacob has got long dark curly hair Cars stream across an arched iron bridge over a river as the tutor drives a small silver hatchback The tutor is slim with dark hair tied in a ponytail and she smiles hesitantly An object seen through an electron microscope appears on a screen He seats on the snowcovered rocky ground and looks skywards through the swirling snow He removes it revealing a round coinsized scar on the back of his hand frowns and checks his palm too The climber looks at his right hand finding the mitten has a hole in it There is a spherical hole in the snowy rock face but the orb is gone He awakens and rises slowly seats up and looks around He is enveloped in a brilliant light of overwhelming intensity and the eye sac lies on the snow as the climber lies next to it his eyes closed Light shines out as he breaks the crystalline crust squinting at the intensity of the swirling brilliance within He reaches out a laser mutant hand on the orb and slowly runs his hand over the surface eyes narrowed above his snowcrusted dark beard then raises the eye axe Lights pulse inside the orb as he approaches it closing on the object which is about 10 feet high with a crystalline surface and shadows and lights swirling inside He moves on steadying himself with the ice ax raising his goggles to stare at a glowing ball embedded in the snowy rock He plunges his ice ax into the rock and hauls himself up over the edge of the rock face standing slowly upright and moving forward as the wind howls around him Beams of light radiate skywards from behind a rocky ridge as the climber carefully ascends a snowy slope and inches up a near vertical cliff He emerges from the tent in thick furs with a climbing ax and a rope wrapped around him and he pulls on goggles to protect his eyes A light shines outside then goes dark and a bearded climber looks puzzled Climbing spikes are sharpened and wind tears at the canvas walls of the tent In a tent a candle glows in a lantern and a cup of snow is placed on a gas burner In 1928 a blizzard lashes the Karakoram mountains in India Letters form around the moon and a circle of reflected sunlight and the Earth form the two Os Stars drift slowly in the blackness of space and a moon glows silver in the darkness seen from the mountainous surface of the Earth"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Letters form around the moon and a circle of reflected sunlight and the Earth form the two Os Stars drift slowly in the blackness of space and a moon glows silver in the darkness seen from the mountainous surface of the Earth In a tent a candle glows in a lantern and a cup of snow is placed on a gas burner In 1928 a blizzard lashes the Karakoram mountains in India A light shines outside then goes dark and a bearded climber looks puzzled Climbing spikes are sharpened and wind tears at the canvas walls of the tent Beams of light radiate skywards from behind a rocky ridge as the climber carefully ascends a snowy slope and inches up a near vertical cliff He emerges from the tent in thick furs with a climbing ax and a rope wrapped around him and he pulls on goggles to protect his eyes He moves on steadying himself with the ice ax raising his goggles to stare at a glowing ball embedded in the snowy rock He plunges his ice ax into the rock and hauls himself up over the edge of the rock face standing slowly upright and moving forward as the wind howls around him He reaches out a laser mutant hand on the orb and slowly runs his hand over the surface eyes narrowed above his snowcrusted dark beard then raises the eye axe Lights pulse inside the orb as he approaches it closing on the object which is about 10 feet high with a crystalline surface and shadows and lights swirling inside He is enveloped in a brilliant light of overwhelming intensity and the eye sac lies on the snow as the climber lies next to it his eyes closed Light shines out as he breaks the crystalline crust squinting at the intensity of the swirling brilliance within There is a spherical hole in the snowy rock face but the orb is gone He awakens and rises slowly seats up and looks around He removes it revealing a round coinsized scar on the back of his hand frowns and checks his palm too The climber looks at his right hand finding the mitten has a hole in it An object seen through an electron microscope appears on a screen He seats on the snowcovered rocky ground and looks skywards through the swirling snow Cars stream across an arched iron bridge over a river as the tutor drives a small silver hatchback The tutor is slim with dark hair tied in a ponytail and she smiles hesitantly The tutor his guardian is white and Jacob is black A computer game character has a sword across his back and Jacob has got long dark curly hair She crosses to the bed where he is concentrating on the game and sits beside him"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He is enveloped in a brilliant light of overwhelming intensity and the eye sac lies on the snow as the climber lies next to it his eyes closed He awakens and rises slowly seats up and looks around There is a spherical hole in the snowy rock face but the orb is gone The climber looks at his right hand finding the mitten has a hole in it He removes it revealing a round coinsized scar on the back of his hand frowns and checks his palm too He seats on the snowcovered rocky ground and looks skywards through the swirling snow An object seen through an electron microscope appears on a screen The tutor is slim with dark hair tied in a ponytail and she smiles hesitantly Cars stream across an arched iron bridge over a river as the tutor drives a small silver hatchback A computer game character has a sword across his back and Jacob has got long dark curly hair The tutor his guardian is white and Jacob is black She crosses to the bed where he is concentrating on the game and sits beside him Stars drift slowly in the blackness of space and a moon glows silver in the darkness seen from the mountainous surface of the Earth Letters form around the moon and a circle of reflected sunlight and the Earth form the two Os In 1928 a blizzard lashes the Karakoram mountains in India In a tent a candle glows in a lantern and a cup of snow is placed on a gas burner Climbing spikes are sharpened and wind tears at the canvas walls of the tent A light shines outside then goes dark and a bearded climber looks puzzled He emerges from the tent in thick furs with a climbing ax and a rope wrapped around him and he pulls on goggles to protect his eyes Beams of light radiate skywards from behind a rocky ridge as the climber carefully ascends a snowy slope and inches up a near vertical cliff He plunges his ice ax into the rock and hauls himself up over the edge of the rock face standing slowly upright and moving forward as the wind howls around him He moves on steadying himself with the ice ax raising his goggles to stare at a glowing ball embedded in the snowy rock Lights pulse inside the orb as he approaches it closing on the object which is about 10 feet high with a crystalline surface and shadows and lights swirling inside He reaches out a laser mutant hand on the orb and slowly runs his hand over the surface eyes narrowed above his snowcrusted dark beard then raises the eye axe Light shines out as he breaks the crystalline crust squinting at the intensity of the swirling brilliance within"
        }
      ]
    }
  ]
}