{
  "ground_truth": "The redcap goes up the steps into the car. Neff laboriously swings himself up onto the box and from there up on the steps, keeping his head down. Meantime, Phyllis is holding the attention of the conductor and porter by showing them the ticket. Phyllis nods and takes the ticket back. Neff has reached the top of the steps. She goes up after him and gives him the ticket. They are now close together. She kisses him. The redcap comes from inside the car. Redcap descends. Phyllis kisses Neff again quickly. She runs down the steps. The porter picks up the box. He and the conductor get on board the train. Phyllis stands there waving goodbye as the train starts moving, and the porter begins to close the car door. Phyllis turns and walks out of the shot in the direction of the parked car. Neff and the porter. The conductor is going on into the car. Neff is half turned away from the porter. He holds the vestibule door open. Neff hobbles through. Most of the berths are made up. As Neff hobbles along, another porter and some passengers make way for the crippled man solicitously. Neff hobbles on through. Four or five passengers are reading or writing. Dark except for a little light coming from inside the parlor car. Neff has come out and hobbled to the railing. He stands looking back along the rails. Neff stands silent. He starts patting his pockets as if looking for something. Jackson takes out a small bag of tobacco and a packet of cigarette papers. He rises and exits into the parlor car. Neff turns slowly and watches Jackson go back through the car. Then he moves to one side of the platform and looks ahead along the track to orientate himself. He gives one last glance back into the parlor car to make sure no one is watching him. He slips the crutches from under his arms and stands on both feet. He drops the crutches off the train onto the tracks, then quickly swings his body over the rail. Neff is hanging onto the railing. He looks down, then lets go and drops to the right-of-way. The camera stops. The train recedes slowly into the night. Neff has fallen on the tracks. He picks himself up, rubs one knee and looks back along the line of the tracks and off to one side. Close beyond the edge of the right-of-way, the silhouette of a dump shows up. Beside it looms the dark bulk of the Dietrichson sedan. The headlights blink twice and go out. He starts running towards the car. He runs a little awkwardly because of the improvised cast on his left foot.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The porter ascends the stairs into the vehicle. Neff laboriously hoists himself up onto the crate and from there up on the steps, keeping his head lowered. Meanwhile, Phyllis is holding the focus of the conductor and porter by showing them the pass. Phyllis nods and takes the pass back. Neff has reached the top of the stairs. She ascends after him and gives him the pass. They are now close together. She kisses him. The porter comes from inside the vehicle. Porter descends. Phyllis kisses Neff again swiftly. She runs down the stairs. The porter grabs the crate. He and the conductor board the train. Phyllis stands there waving farewell as the train begins moving, and the porter starts to close the vehicle entrance. Phyllis turns and walks out of the shot in the direction of the parked vehicle. Neff and the porter. The conductor is going on into the vehicle. Neff is half turned away from the porter. He holds the entryway door ajar. Neff hobbles through. Most of the berths are arranged. As Neff hobbles along, another porter and some travelers make way for the incapacitated man solicitously. Neff hobbles on through. Four or five travelers are reading or writing. Dark except for a little light coming from inside the lounge vehicle. Neff has come out and hobbled to the railing. He stands gazing back along the rails. Neff stands silent. He starts patting his pockets as if searching for something. Jackson takes out a small pouch of tobacco and a packet of cigarette papers. He rises and exits into the lounge vehicle. Neff turns slowly and observes Jackson go back through the vehicle. Then he moves to one side of the platform and looks ahead along the track to position himself. He gives one last glance back into the lounge vehicle to make sure no one is observing him. He slips the crutches from under his arms and stands on both feet. He drops the crutches off the train onto the tracks, then swiftly swings his body over the rail. Neff is gripping the railing. He looks down, then lets go and drops to the right-of-way. The camera stops. The train diminishes slowly into the night. Neff has fallen on the tracks. He picks himself up, rubs one knee, and looks back along the line of the tracks and off to one side. Close beyond the edge of the right-of-way, the silhouette of a dump shows up. Beside it looms the dark bulk of the Dietrichson sedan. The headlights blink twice and go out. He starts running towards the vehicle. He runs a little awkwardly because of the improvised cast on his left foot."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The steps are gone up by the redcap into the car. Neff laboriously is swung up onto the box by himself, and from there, up on the steps, his head kept down. Meantime, the attention of the conductor and porter is being held by Phyllis by showing them the ticket. The ticket is nodded at by Phyllis and taken back by her. The top of the steps has been reached by Neff. They are now approached closely. He is kissed by her. The car is exited by the redcap. The steps are descended by the redcap. Neff is quickly kissed again by Phyllis. Down the steps, she runs. The box is picked up by the porter. The train is boarded by him and the conductor. Goodbye is waved by Phyllis as the train starts moving, and the car door is begun to be closed by the porter. The shot is walked out of by Phyllis in the direction of the parked car. Neff and the porter. The car is gone into by the conductor. Away from the porter, Neff is half turned. The vestibule door is held open by him. Through it, Neff hobbles. Made up are most of the berths. Along, as Neff hobbles, way is made by another porter and some passengers for the crippled man solicitously. On through, Neff hobbles. Passengers are reading or writing, numbering four or five. Dark, except for a little light coming from inside the parlor car. To the railing, Neff has come out and hobbled. Back along the rails, he stands looking. Silent stands Neff. His pockets are patted by him as if looking for something. A small bag of tobacco and a packet of cigarette papers are taken out by Jackson. Into the parlor car, he rises and exits. Slowly Neff turns and Jackson is watched by him as he goes back through the car. Then to one side of the platform, he moves and looks ahead along the track to orientate himself. One last glance is given back into the parlor car by him to make sure no one is watching him. The crutches are slipped from under his arms and both feet are stood on by him. Off the train, the crutches are dropped by him onto the tracks, then his body is quickly swung over the rail. The railing is hung onto by Neff. Down is looked by him, then he lets go and the right-of-way is dropped to by him. Stops the camera. Into the night, the train slowly recedes. On the tracks, Neff has fallen. Himself is picked up by him, one knee is rubbed by him, and he looks back along the line of the tracks and off to one side. Close beyond the edge of the right-of-way, a dump's silhouette shows up. Beside it, the dark bulk of the Dietrichson sedan looms. Twice, the headlights blink and go out. Towards the car, he starts running. A little awkwardly he runs because of the improvised cast on his left foot."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The redcap ascends the steps into the car. Neff laboriously climbs onto the box, then onto the steps, keeping his head lowered. Meanwhile, Phyllis distracts the conductor and porter with the ticket. She nods, retrieves the ticket, then ascends to Neff, handing it to him. Close together, she kisses him. The redcap exits the car. Phyllis quickly kisses Neff again before descending. The porter picks up the box, and he and the conductor board the train. Phyllis waves as the train departs while the porter shuts the car door. She turns and walks toward the parked car. Neff and the porter, with the conductor entering the car, leave Neff half-turned away from the porter, holding the vestibule door. Neff hobbles forward as passengers make way for him. Dark, with some light from inside the parlor car, Neff reaches the railing and looks back. He pats his pockets as if searching for something. Jackson offers tobacco and cigarette papers, then exits into the parlor car. Neff observes Jackson, then moves to the platform's side to orient himself. He glances back into the parlor car to ensure no one's watching, then drops his crutches onto the tracks and swings his body over the rail. Hanging onto the railing, he lets go and falls to the right-of-way. The train recedes into the night as Neff, fallen on the tracks, gets up, rubs his knee, and looks along the tracks. Near the right-of-way, the silhouette of a dump and the dark bulk of the Dietrichson sedan appear. The headlights blink twice and fade. Neff runs awkwardly toward the car due to his improvised cast."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The redcap enters the car, and Neff painstakingly climbs up, keeping his head low. Meanwhile, Phyllis distracts the conductor and porter with the ticket, nods, and retrieves it. Neff reaches the top of the steps. She follows him, gives him the ticket, they kiss. The redcap exits. Phyllis quickly kisses Neff again, hurries down, and waves goodbye as the train departs. The porter and conductor board. Neff, holding the vestibule door open, hobbles through the car with passengers making way. Most berths are ready. Neff reaches the railing, looks back, and checks his pockets. Jackson takes out tobacco, exits to the parlor car, and Neff watches him leave. Neff then hides his crutches, stands on both feet, drops the crutches onto the tracks, and swings over the rail. He lets go, falls on the tracks, rubs his knee, and looks back. He spots the silhouette of a dump and the Dietrichson sedan, with headlights blinking. He runs awkwardly towards the car due to his cast."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The redcap, with a sense of purpose, ascends the steps leading into the passenger car. Meanwhile, Neff exerts considerable effort to hoist himself up onto the box, and once there, he maneuvers upward onto the steps, taking care to keep his head lowered. During this time, Phyllis skillfully holds the attention of both the conductor and the porter by presenting them with the ticket. She gives a nod and retrieves the ticket back from them. By now, Neff has successfully reached the top of the steps. Phyllis follows him up and hands him the ticket. They find themselves in close proximity, and she tenderly kisses him. The redcap emerges from inside the car, descending the steps. Phyllis gives Neff another quick kiss before hastily running down the steps. The vigilant porter picks up the box, and both he and the conductor proceed to board the train. Phyllis remains standing, waving a fond farewell as the train slowly begins to move, and the porter starts closing the car door. She then turns and walks out of the frame, heading in the direction of the parked car. Inside, Neff and the porter continue, while the conductor progresses further into the car. Neff, half-turned away from the porter, holds open the vestibule door and hobbles through. Most of the berths are already prepared for the journey. As Neff hobbles along, another attentive porter and several passengers make way for the man who appears to be struggling, showing him due consideration. Neff perseveres, moving steadily onward. Four or five passengers are quietly reading or writing, creating an atmosphere of calm. The car is dimly lit, save for the soft glow emanating from inside the parlor car. Neff has emerged and hobbled to the railing, where he stands silently, gazing back along the rails. As he stands in contemplation, he begins to pat his pockets as if searching for something. Nearby, Jackson retrieves a small bag of tobacco and a packet of cigarette papers, rises from his seat, and exits into the parlor car. Neff slowly turns, watching Jackson make his way back through the car. Subsequently, Neff moves to one side of the platform and looks along the track ahead to get his bearings. He takes one final glance back into the parlor car to ensure he remains unobserved. Confident that no one is watching, he slips the crutches from under his arms, standing on both feet unassisted. He decisively drops the crutches off the moving train onto the tracks, then swiftly swings his body over the rail. Neff clings onto the rail, briefly hesitates, and then lets go, dropping down to the right-of-way below. The camera halts as the train gradually recedes into the darkness of the night. Neff has landed on the tracks, but he quickly picks himself up, rubs one knee to alleviate the pain, and looks back along the line of the tracks, then off to one side. Just beyond the edge of the right-of-way, the outline of a dump becomes visible. Nearby, the dark, imposing shape of the Dietrichson sedan rises. Its headlights blink twice before extinguishing completely. With determination, he starts running towards the car, his gait slightly awkward due to the makeshift cast on his left foot."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a focused sense of purpose, the redcap makes his way up the steps leading into the passenger car. Meanwhile, Neff, exerting quite a bit of effort, hoists himself onto the box, and once there, he carefully maneuvers his way upward onto the steps, ensuring that he keeps his head bowed to avoid suspicion. During this period, Phyllis skillfully captures and maintains the attention of both the conductor and the porter by presenting them with the ticket. She acknowledges their assistance with a nod and smoothly retrieves the ticket back from them. At this point, Neff has successfully managed to reach the topmost part of the steps. Close behind him, Phyllis ascends and hands the ticket over to him. As they find themselves in close proximity, she leans in and affectionately kisses him. The redcap then emerges from the car and begins descending the steps. Phyllis bestows upon Neff a quick kiss once more before she hurriedly runs down the stairs. Observant and efficient, the porter promptly picks up the box, and he, alongside the conductor, proceeds to board the train. Phyllis remains standing, waving a fond farewell with warmth in her gestures as the train slowly begins to move, and the porter starts closing the car door. She then pivots and walks out of the frame, making her way towards the parked car. Inside, Neff and the porter continue onward, while the conductor further progresses into the depths of the car. Neff, half-turned away from the porter, keeps the vestibule door open and hobbles through with determination. Most of the berths are already prepared and set for the upcoming journey. As Neff hobbles along, another attentive porter and several considerate passengers make way for him, the man who seems to be struggling, showing him proper respect and consideration. Yet, Neff perseveres, moving steadily onward. Four or five passengers are quietly engrossed in reading or writing, creating a serene and calm atmosphere in the car. The dimly lit space, save for the soft glow coming from inside the parlor car, adds to the tranquil setting. Neff eventually emerges and hobbles his way over to the railing, where he stands silently, gazing thoughtfully back along the rails. As he stands in contemplation, he begins patting down his pockets as if searching for something. Nearby, Jackson retrieves a small bag of tobacco along with a packet of cigarette papers, rises from his seat, and exits into the parlor car. Neff slowly turns, carefully watching Jackson as he makes his way back through the car. Subsequently, Neff moves to one side of the platform thoughtfully and looks along the track ahead to get his bearings. He takes one final cautious glance back into the parlor car, ensuring that he remains unobserved. Once confident that no one is watching him closely, he slips the crutches from under his arms, standing unsupported on both feet. He decisively lets the crutches drop off the moving train onto the tracks below, then swiftly swings his body over the rail. Neff clings onto the rail for a brief moment, hesitates slightly, and then lets go, dropping down to the right-of-way below. The camera halts as the train gradually recedes into the enveloping darkness of the night. Neff has landed on the tracks with a thud, but he quickly gathers himself, rubs one knee to alleviate the pain, and looks back decisively along the line of the tracks, then off to one side. Just beyond the edge of the right-of-way, the outline of a dump becomes visible in the dim light. Nearby, the dark and imposing shape of the Dietrichson sedan rises. Its headlights flash twice before extinguishing completely. With determination etched on his face, he starts running towards the car, his gait characterized by a slight awkwardness due to the makeshift cast on his left foot."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The redcap ascends the steps leading into the car, making his way inside with determined strides. Meanwhile, Neff, exhibiting great effort, hoists himself up onto the box positioned nearby and then gingerly maneuvers himself up onto the steps, all while ensuring his head stays lowered to avoid detection. During this time, Phyllis adeptly engages the attention of both the conductor and the porter by presenting them with the ticket, effectively holding their focus. Once their attention is satisfactorily captured, Phyllis nods in acknowledgment and retrieves the ticket from their grasp. By now, Neff has successfully reached the top of the steps, and Phyllis promptly follows his ascent, joining him at his side to hand over the ticket. Standing intimately close, she leans in and kisses him, their brief moment shared before the redcap emerges once again from inside the car and descends back down the steps. Seizing this opportunity, Phyllis bestows another quick kiss upon Neff and swiftly makes her way down the steps. Observing the proceedings, the porter lifts the box as he and the conductor board the waiting train. Phyllis remains on the platform, energetically waving goodbye as the train lurches into motion, prompting the porter to begin closing the car door. With her farewell complete, Phyllis pivots and walks out of the frame, heading in the direction of the parked car. Inside, Neff and the porter are left behind, with the conductor advancing further into the car. Neff, meanwhile, turns partially away from the porter and holds the vestibule door open, then hobbles through the narrow passage. Most of the berths are made up, which Neff notices as he continues his hobbling journey, prompting other passengers and a nearby porter to courteously make way for him, recognizing his apparent disability. Neff persistently hobbles onward as several passengers immerse themselves in reading or writing under the dim lighting, which is gently illuminated by a light source from inside the parlor car. Having emerged onto the platform, Neff takes a moment to survey the tracks stretching behind him, standing in silence. He begins patting his pockets as though searching for some item, only to be interrupted by Jackson, who produces a small bag of tobacco and a packet of cigarette papers, then rises and exits into the parlor car. Neff watches Jackson's retreat intently, following his movement as he navigates back through the car. With a sense of purpose, Neff shifts to one side of the platform and peers ahead along the track, orienting himself with a careful eye. He sneaks a final glance back into the parlor car to confirm that no one is monitoring him before discreetly slipping the crutches from under his arms, testing his full weight on both feet. With a swift and decisive motion, he dismisses the crutches, letting them fall off the train onto the tracks below, and with urgency, he swings his body over the rail. Clinging to the railing momentarily, Neff casts a downward glance before relinquishing his grip to drop onto the right-of-way. The camera halts its motion as the train gradually fades into the obscurity of the night. After landing on the tracks, Neff collects himself, rubbing his knee while surveying the tracks and the adjacent terrain. In the near distance beyond the edge of the right-of-way, the silhouette of a dump becomes discernible, accompanied by the imposing shadow of the Dietrichson sedan. Its headlights flicker twice before extinguishing, signaling him. Mobilized by this cue, Neff breaks into a run towards the car, moving with a slightly awkward gait due to the improvised cast on his left foot."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The redcap ascends the steps into the car as Neff laboriously maneuvers himself onto the box and up the steps, keeping his head down. Meanwhile, Phyllis distracts the conductor and porter by showing them the ticket, retrieves it, and follows Neff up the steps, handing him the ticket. They share a kiss before the redcap exits the car, then Phyllis gives Neff a quick farewell kiss and descends the steps as the porter and conductor board the train. Phyllis waves goodbye as the train starts moving, and the porter closes the car door. She exits the scene toward the parked car. Inside the car, Neff holds the vestibule door open, hobbling through as passengers make way for him. Most berths are prepared, and Neff makes his way to the railing, looking back along the rails. As he stands silently, he pats his pockets, prompting Jackson to offer him a small bag of tobacco and cigarette papers. Jackson then exits into the parlor car, and Neff watches him, ensuring no one is observing him. Neff discreetly slips the crutches from under his arms, stands on both feet, drops the crutches off the train onto the tracks, and swings himself over the rail. He lets go, dropping to the right-of-way as the train recedes into the night. After falling, he picks himself up, rubs his knee, checks the tracks, and spots the silhouette of a dump and the Dietrichson sedan nearby. The car's headlights blink twice and go out, prompting Neff to run awkwardly towards it due to the improvised cast on his left foot."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The redcap, an employee at the train station responsible for handling luggage, goes up the steps into the car. Neff, with a watchful eye on his surroundings, laboriously swings himself up onto the box, a maneuver made more challenging by his feigned injury, and from there up on the steps, keeping his head down to avoid drawing attention. Meantime, Phyllis is holding the attention of the conductor, who manages train operations, and the porter by showing them the ticket, a crucial element for boarding. Phyllis nods and takes the ticket back with a practiced ease. Neff has reached the top of the steps. She goes up after him and gives him the ticket, maintaining the charade. They are now close together. She kisses him, a gesture loaded with both affection and conspiratorial exchange. The redcap comes from inside the car, having completed his duties. Redcap descends. Phyllis kisses Neff again quickly, sealing the moment with another brief display of intimacy. She runs down the steps with a sense of urgency. The porter picks up the box, likely filled with necessities for the journey. He and the conductor get on board the train, finalizing preparations for departure. Phyllis stands there waving goodbye as the train starts moving, and the porter begins to close the car door, marking the end of their brief encounter. Phyllis turns and walks out of the shot in the direction of the parked car, a nearby getaway vehicle. Neff and the porter. The conductor is going on into the car, checking on the passengers. Neff is half turned away from the porter, ensuring his actions go unnoticed. He holds the vestibule door open, a critical maneuver for what's to come. Neff hobbles through, his feigned limp convincing. Most of the berths are made up, ready for passengers to rest. As Neff hobbles along, another porter and some passengers make way for the crippled man solicitously, unaware of his ruse. Neff hobbles on through. Four or five passengers are reading or writing, wrapped up in their own business. Dark except for a little light coming from inside the parlor car, where travelers can find more comfort. Neff has come out and hobbled to the railing. He stands looking back along the rails, ensuring his plan remains unnoticed. Neff stands silent. He starts patting his pockets as if looking for something, maintaining his guise. Jackson, a fellow passenger, takes out a small bag of tobacco and a packet of cigarette papers, a common sight on long journeys. He rises and exits into the parlor car. Neff turns slowly and watches Jackson go back through the car, ensuring that he is not being observed. Then he moves to one side of the platform and looks ahead along the track to orientate himself for the next step. He gives one last glance back into the parlor car to make sure no one is watching him. He slips the crutches from under his arms and stands on both feet, revealing his deception. He drops the crutches off the train onto the tracks, then quickly swings his body over the rail in a daring escape. Neff is hanging onto the railing. He looks down, then lets go and drops to the right-of-way, risking injury for his freedom. The camera stops. The train recedes slowly into the night, continuing its journey without him. Neff has fallen on the tracks. He picks himself up, rubs one knee, feeling the impact, and looks back along the line of the tracks and off to one side. Close beyond the edge of the right-of-way, the silhouette of a dump shows up, a prearranged meeting spot. Beside it looms the dark bulk of the Dietrichson sedan, waiting for his arrival. The headlights blink twice and go out, a signal confirming the coast is clear. He starts running towards the car. He runs a little awkwardly because of the improvised cast on his left foot, hindering his speed but not his determination."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The redcap goes up the steps into the car. Neff laboriously swings himself up onto the box and from there up on the steps keeping his head down. Meantime. Phyllis is holding the attention of the conductor and porter by showing them the ticket. Phyllis nods and takes the ticket back. Neff has reached the top of the steps. She goes up after him and gives him the ticket. They are now close together. She kisses him. The redcap comes from inside the car. Redcap descends. Phyllis kisses Neff again quickly. She runs down the steps. The porter picks up the box. He and the conductor get on board the train. Phyllis stands there waving goodbye as the train starts moving and the porter begins to close the car door. Phyllis turns and walks out of the shot in the direction of the parked car. Neff and the porter. The conductor is going on into the car. Neff is half turned away from the porter. He holds the vestibule door open. Neff hobbles through. Most of the berths are made up. As Neff hobbles along another porter and some passengers make way for the crippled man solicitously. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Neff hobbles on through. Four or five passengers are reading or writing. Dark except for a little light coming from inside the parlor car. Neff has come out and hobbled to the railing. He stands looking back along the rails. Neff stands silent. He starts patting his pockets as if looking for something. Jackson takes out a small bag of tobacco and a packet of cigarette papers. He rises and exits into the parlor car. Neff turns slowly and watches Jackson go back through the car. Then he moves to one side of the platform and looks ahead along the track to orientate himself. He gives one last glance back into the parlor car to make sure no one is watching him. He slips the crutches from under his arms and stands on both feet. He drops the crutches off the train onto the tracks then quickly swings his body over the rail. Neff is hanging onto the railing. He looks down then let us go and drops to the rightofway. The camera stops. The train recedes slowly into the night. Neff has fallen on the tracks. He picks himself up rubs one knee and looks back along the line of the tracks and off to one side. Close beyond the edge of the rightofway the silhouette of a dump shows up. Beside it looms the dark bulk of the Dietrichson sedan. The headlights blink twice and go out. He starts running towards the car. He runs a little awkwardly because of the improvised cast on his left foot."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The redcap goes up the steps into the car. Neff laboriously swings himself up onto the box and from there up on the steps keeping his head down. Meantime. Phyllis is holding the attention of the conductor and porter by showing them the ticket. Phyllis nods and takes the ticket back. Neff has reached the top of the steps. She goes up after him and gives him the ticket. They are now close together. She kisses him. The redcap comes from inside the car. Redcap descends. Phyllis kisses Neff again quickly. She runs down the steps. The porter picks up the box. He and the conductor get on board the train. Phyllis stands there waving goodbye as the train starts moving and the porter begins to close the car door. Phyllis turns and walks out of the shot in the direction of the parked car. Neff and the porter. The conductor is going on into the car. Neff is half turned away from the porter. He holds the vestibule door open. Neff hobbles through. Most of the berths are made up. As Neff hobbles along another porter and some passengers make way for the crippled man solicitously. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Neff hobbles on through. Four or five passengers are reading or writing. Dark except for a little light coming from inside the parlor car. Neff has come out and hobbled to the railing. He stands looking back along the rails. Neff stands silent. He starts patting his pockets as if looking for something. Jackson takes out a small bag of tobacco and a packet of cigarette papers. He rises and exits into the parlor car. Neff turns slowly and watches Jackson go back through the car. Then he moves to one side of the platform and looks ahead along the track to orientate himself. He gives one last glance back into the parlor car to make sure no one is watching him. He slips the crutches from under his arms and stands on both feet. He drops the crutches off the train onto the tracks then quickly swings his body over the rail. Neff is hanging onto the railing. He looks down then let us go and drops to the rightofway. The camera stops. The train recedes slowly into the night. Neff has fallen on the tracks. He picks himself up rubs one knee and looks back along the line of the tracks and off to one side. Close beyond the edge of the rightofway the silhouette of a dump shows up. Beside it looms the dark bulk of the Dietrichson sedan. The headlights blink twice and go out. He starts running towards the car. He runs a little awkwardly because of the improvised cast on his left foot."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The redcap goes up the steps into the car. Neff laboriously swings himself up onto the box and from there up on the steps keeping his head down. Meantime. Phyllis is holding the attention of the conductor and porter by showing them the ticket. Phyllis nods and takes the ticket back. Neff has reached the top of the steps. She goes up after him and gives him the ticket. They are now close together. She kisses him. The redcap comes from inside the car. Redcap descends. Phyllis kisses Neff again quickly. He slips the crutches from under his arms and stands on both feet. He drops the crutches off the train onto the tracks then quickly swings his body over the rail. Neff is hanging onto the railing. He looks down then let us go and drops to the rightofway. The camera stops. The train recedes slowly into the night. Neff has fallen on the tracks. He picks himself up rubs one knee and looks back along the line of the tracks and off to one side. Close beyond the edge of the rightofway the silhouette of a dump shows up. Beside it looms the dark bulk of the Dietrichson sedan. The headlights blink twice and go out. He starts running towards the car. He runs a little awkwardly because of the improvised cast on his left foot."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The redcap goes up the steps into the car. Neff laboriously swings himself up onto the box and from there up on the steps keeping his head down. Meantime. Phyllis is holding the attention of the conductor and porter by showing them the ticket. Phyllis nods and takes the ticket back. Close beyond the edge of the rightofway the silhouette of a dump shows up. Beside it looms the dark bulk of the Dietrichson sedan. The headlights blink twice and go out. He starts running towards the car. He runs a little awkwardly because of the improvised cast on his left foot."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The toad leaps down the ladder into the cave. Luna painstakingly slides herself down onto the throne and from there down on the ladder, keeping her hat up. Meanwhile, Calliope is losing the attention of the gardener and valet by concealing from them the passport. Calliope laughs and hides the passport away. Luna has stumbled to the bottom of the ladder. He climbs down before her and tosses her the passport. They are now far apart. He tickles her. The toad leaps from outside the cave. Toad ascends. Calliope tickles Luna again hastily. He dances up the ladder. The valet drops off the throne. She and the gardener jump off board the spaceship. Calliope hops up, scowling hello as the spaceship halts resting, and the valet finishes opening the cave window. Calliope spins and leaps into the view in the direction of the flying ship. Luna and the valet. The gardener is leaving off into the cave. Luna is half spun towards the valet. She closes the veranda window shut. Luna skips through. None of the altars are torn down. As Luna skips along, another valet and many strangers take space for the nimble boy curiously. Luna skips on through. Seven or eight strangers are painting or knitting. Bright except for much darkness coming from outside the meadow ship. Luna has jumped in and skipped from the trellis. He kneels facing forward along the brush. Luna kneels loudly. He stops rubbing his shoes as if finding for nothing. Martin holds in a large tarp of parsley and a bunch of noodle containers. He sits and enters from the meadow ship. Luna skips quickly and observes Martin enter forward from the cave. Then he rests to the other side of the trellis and hops behind along the path to orbit himself. He takes one quick smile forward into the meadow ship to make sure everyone is ignoring him. She floats the wheelchairs onto his legs and kneels on four hands. He pulls the wheelchairs onto the spaceship past the paths, then gradually swings his legs under the trellis. Luna is lifting over the trellis. She jumps up, then holds on and swings from the wrong-of-left. The telescope shudders. The spaceship advances quickly into the day. Luna is lying under the paths. She shoves herself down, scratches one elbow and watches forward along the lane of the paths and up to one top. Far before the middle of the wrong-of-left, the outline of a tower dulls down. Beyond it disappears the vivid leap of the Henderson bicycle. The taillights flash twice and stay on. She stops walking away from the ship. She walks a lot gracefully despite the professional boot on his right knee."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Neff climbs onto the train while Phyllis distracts the conductor and porter. After giving Neff the ticket, she kisses him and waves goodbye as the train departs. Inside, Neff hobbles through the car, assisted by a porter and passengers. He checks his surroundings, ensuring no one is watching, then discards his crutches and drops off the train. Picking himself up after falling, he spots the silhouette of a dump and the Dietrichson sedan. When the headlights blink twice, Neff runs awkwardly toward the car due to his improvised cast."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He runs a little awkwardly because of the improvised cast on his left foot He starts running towards the car The headlights blink twice and go out Beside it looms the dark bulk of the Dietrichson sedan Close beyond the edge of the rightofway the silhouette of a dump shows up He picks himself up rubs one knee and looks back along the line of the tracks and off to one side Neff has fallen on the tracks The train recedes slowly into the night The camera stops He looks down then let us go and drops to the rightofway Neff is hanging onto the railing He drops the crutches off the train onto the tracks then quickly swings his body over the rail He slips the crutches from under his arms and stands on both feet He gives one last glance back into the parlor car to make sure no one is watching him Then he moves to one side of the platform and looks ahead along the track to orientate himself Neff turns slowly and watches Jackson go back through the car He rises and exits into the parlor car Jackson takes out a small bag of tobacco and a packet of cigarette papers He starts patting his pockets as if looking for something Neff stands silent He stands looking back along the rails Neff has come out and hobbled to the railing Dark except for a little light coming from inside the parlor car Four or five passengers are reading or writing Neff hobbles on through As Neff hobbles along another porter and some passengers make way for the crippled man solicitously Most of the berths are made up Neff hobbles through He holds the vestibule door open Neff is half turned away from the porter The conductor is going on into the car Neff and the porter Phyllis turns and walks out of the shot in the direction of the parked car Phyllis stands there waving goodbye as the train starts moving and the porter begins to close the car door He and the conductor get on board the train The porter picks up the box She runs down the steps Phyllis kisses Neff again quickly Redcap descends The redcap comes from inside the car She kisses him They are now close together She goes up after him and gives him the ticket Neff has reached the top of the steps Phyllis nods and takes the ticket back Phyllis is holding the attention of the conductor and porter by showing them the ticket Meantime Neff laboriously swings himself up onto the box and from there up on the steps keeping his head down The redcap goes up the steps into the car"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Neff laboriously swings himself up onto the box and from there up on the steps keeping his head down The redcap goes up the steps into the car Phyllis is holding the attention of the conductor and porter by showing them the ticket Meantime Neff has reached the top of the steps Phyllis nods and takes the ticket back They are now close together She goes up after him and gives him the ticket The redcap comes from inside the car She kisses him Phyllis kisses Neff again quickly Redcap descends The porter picks up the box She runs down the steps Phyllis stands there waving goodbye as the train starts moving and the porter begins to close the car door He and the conductor get on board the train Neff and the porter Phyllis turns and walks out of the shot in the direction of the parked car Neff is half turned away from the porter The conductor is going on into the car Neff hobbles through He holds the vestibule door open As Neff hobbles along another porter and some passengers make way for the crippled man solicitously Most of the berths are made up Four or five passengers are reading or writing Neff hobbles on through Neff has come out and hobbled to the railing Dark except for a little light coming from inside the parlor car Neff stands silent He stands looking back along the rails Jackson takes out a small bag of tobacco and a packet of cigarette papers He starts patting his pockets as if looking for something Neff turns slowly and watches Jackson go back through the car He rises and exits into the parlor car He gives one last glance back into the parlor car to make sure no one is watching him Then he moves to one side of the platform and looks ahead along the track to orientate himself He drops the crutches off the train onto the tracks then quickly swings his body over the rail He slips the crutches from under his arms and stands on both feet He looks down then let us go and drops to the rightofway Neff is hanging onto the railing The train recedes slowly into the night The camera stops He picks himself up rubs one knee and looks back along the line of the tracks and off to one side Neff has fallen on the tracks Beside it looms the dark bulk of the Dietrichson sedan Close beyond the edge of the rightofway the silhouette of a dump shows up He starts running towards the car The headlights blink twice and go out He runs a little awkwardly because of the improvised cast on his left foot"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Four or five passengers are reading or writing Dark except for a little light coming from inside the parlor car Neff has come out and hobbled to the railing He stands looking back along the rails Neff stands silent He starts patting his pockets as if looking for something Jackson takes out a small bag of tobacco and a packet of cigarette papers He rises and exits into the parlor car Neff turns slowly and watches Jackson go back through the car Then he moves to one side of the platform and looks ahead along the track to orientate himself He gives one last glance back into the parlor car to make sure no one is watching him He slips the crutches from under his arms and stands on both feet He drops the crutches off the train onto the tracks then quickly swings his body over the rail Neff is hanging onto the railing He looks down then let us go and drops to the rightofway The camera stops The train recedes slowly into the night Neff has fallen on the tracks He picks himself up rubs one knee and looks back along the line of the tracks and off to one side Close beyond the edge of the rightofway the silhouette of a dump shows up Beside it looms the dark bulk of the Dietrichson sedan The headlights blink twice and go out He starts running towards the car He runs a little awkwardly because of the improvised cast on his left foot The redcap goes up the steps into the car Neff laboriously swings himself up onto the box and from there up on the steps keeping his head down Meantime Phyllis is holding the attention of the conductor and porter by showing them the ticket Phyllis nods and takes the ticket back Neff has reached the top of the steps She goes up after him and gives him the ticket They are now close together She kisses him The redcap comes from inside the car Redcap descends Phyllis kisses Neff again quickly She runs down the steps The porter picks up the box He and the conductor get on board the train Phyllis stands there waving goodbye as the train starts moving and the porter begins to close the car door Phyllis turns and walks out of the shot in the direction of the parked car Neff and the porter The conductor is going on into the car Neff is half turned away from the porter He holds the vestibule door open Neff hobbles through Most of the berths are made up As Neff hobbles along another porter and some passengers make way for the crippled man solicitously Neff hobbles on through"
        }
      ]
    }
  ]
}