{
  "ground_truth": "An object blasts out, raising clouds of leaves and knocking people off their feet as a child's buggy is blown away and a park bench is ripped from its mountings. An Apache attack helicopter heads into the cloud as a scientist chopper lands in a park, and soldiers file out with weapons raised and torches blazing, followed by scientists wearing hazmat protective suits with glass-fronted helmets covering their heads. They move cautiously through the trees towards the glowing vapor-shrouded object, with torches mounted on rifles cutting shafts of light through the dense gloom, and Helen advances with the others through the mist as the object casts an eerie green glow in the haze. She stands still, concentrating, as lights swirl in the fog cutting brightly through the dissipating mists, and the gathered crowds stare up at the pulsating sphere which is hundreds of feet high. Helen gapes with her mouth open behind her visor as an intense beam of white light sweeps across the ground, and she looks around in alarm as the military arrives in Hummers with heavy machine guns, while police vehicles draw up in convoy and soldiers fan out to firing positions. A soldier arms his .50 caliber heavy machine gun and points it at the sphere as floodlights illuminate the site and police snipers take positions overlooking the park. The Apache circles the sphere as lights blaze out from the interior, then concentrate at the base of the towering object with such power that Helen has to look away and raises an arm to shield her eyes. Police and soldiers stand tensely with their weapons raised as a figure moves in the white blaze of light, and Helen moves towards the hazy figure. As the soldiers prepare to fire, Helen keeps moving slowly forward and approaches the figure near the base of the sphere, hesitating before the figure holds out a human-like hand, which Helen goes to take. Red blood sprays Helen's visor as the figure falls into her arms, and she looks down at the humanoid shape with a featureless face as personnel hurry to help. More lights blaze within the sphere, and everybody looks up, staring, as a humanoid robot some 50 feet high emerges from the sphere with a light shining out from an eye slit in its head. Every weapon becomes inoperable and all the lights go out, as people cringe and fall to the ground in pain from the noise emitted by the robot. It strides forward and looms over Helen, who's still holding the wounded visitor, and it bends its head down towards her, stretching out a vast hand, then withdraws its hand, raises its head, and stands with its arms by its sides as the light in the eye slit goes out. Finally, all the lights, power, and weapons systems are restored.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "An item explodes out, lifting billows of foliage and toppling individuals off their feet as a child's stroller is blown away and a park bench is torn from its fittings. An Apache assault helicopter heads into the fog as a scientist chopper lands in a park, and troopers file out with arms raised and flashlights blazing, followed by scientists wearing hazmat protective suits with glass-fronted helmets covering their heads. They move cautiously through the trees towards the glowing vapor-shrouded item, with flashlights mounted on rifles cutting beams of light through the thick murk, and Helen advances with the others through the mist as the item casts an eerie verdant glow in the haze. She stands still, focusing, as lights whirl in the fog cutting brightly through the dissipating mists, and the gathered crowds gaze up at the pulsating orb which is hundreds of feet high. Helen stares with her mouth open behind her visor as an intense beam of white light sweeps across the ground, and she looks around in panic as the military arrives in Hummers with heavy machine guns, while police vehicles draw up in convoy and troopers fan out to shooting positions. A soldier arms his .50 caliber heavy machine gun and points it at the orb as floodlights illuminate the site and police snipers take positions overlooking the park. The Apache circles the orb as lights blaze out from the interior, then concentrate at the base of the towering item with such intensity that Helen has to look away and raises an arm to shield her eyes. Police and troopers stand tensely with their arms raised as a figure moves in the white blaze of light, and Helen moves towards the hazy figure. As the troopers prepare to fire, Helen keeps moving slowly forward and approaches the figure near the base of the orb, hesitating before the figure holds out a human-like hand, which Helen goes to take. Red blood sprays Helen's visor as the figure falls into her arms, and she looks down at the humanoid shape with a featureless face as personnel hurry to help. More lights blaze within the orb, and everybody looks up, staring, as a humanoid automaton some 50 feet high emerges from the orb with a light shining out from an eye slit in its head. Every arm becomes inoperable and all the lights go out, as individuals cringe and fall to the ground in agony from the noise emitted by the automaton. It strides forward and looms over Helen, who's still holding the injured visitor, and it bends its head down towards her, extending a vast hand, then withdraws its hand, raises its head, and stands with its arms by its sides as the light in the eye slit goes out. Finally, all the lights, power, and arms systems are restored."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "An object is blasted out, and clouds of leaves are raised, knocking people off their feet as a child's buggy is blown away and a park bench is ripped from its mountings. The cloud is headed into by an Apache attack helicopter as a scientist chopper lands in a park, and weapons are raised and torches are blazing by soldiers who file out, followed by scientists wearing hazmat protective suits with glass-fronted helmets covering their heads. Caution is used as they move through the trees towards the glowing vapor-shrouded object, with shafts of light being cut through the dense gloom by torches mounted on rifles, and Helen is advanced with by the others through the mist as the object casts an eerie green glow in the haze. Stillness is maintained by her, concentrating, as lights are swirled in the fog cutting brightly through the dissipating mists, and the pulsating sphere which is hundreds of feet high is stared up at by the gathered crowds. Her mouth is gaped open by Helen behind her visor as an intense beam of white light is swept across the ground, and alarm is looked around in by her as Hummers are arrived in by the military with heavy machine guns, while a convoy is drawn up by police vehicles and soldiers fan out to firing positions. His .50 caliber heavy machine gun is armed by a soldier and pointed at the sphere as the site is illuminated by floodlights and positions are taken by police snipers overlooking the park. The sphere is circled by the Apache as lights blaze out from the interior, then concentrated at the base of the towering object with such power that looking away is required by Helen, and her eyes are shielded with a raised arm. Police and soldiers stand tensely with their weapons raised as a figure is moved in the white blaze of light, and towards the hazy figure, Helen is moved. Firing is prepared for by the soldiers, and Helen keeps moving slowly forward and approaches the figure near the base of the sphere, hesitating before a human-like hand is held out by the figure, which she goes to take. Her visor is sprayed with red blood as the figure falls into her arms, and down at the humanoid shape with a featureless face, she looks as personnel hurries to help. More lights are blazed within the sphere, and up is looked by everybody, staring, as a humanoid robot some 50 feet high emerges from the sphere with a light shining out from an eye slit in its head. Weapons become inoperable and lights go out, as people cringe and fall to the ground in pain from the noise emitted by the robot. Forward is strode by it and over Helen, who's still holding the wounded visitor, it looms, and down towards her, its head is bent by it, stretching out a vast hand, then its hand is withdrawn, the head is raised, and with its arms by its sides, it stands as the light in the eye slit goes out. Finally, all the lights, power, and weapons systems are restored."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "An object erupts, scattering leaves and knocking people over as a child's buggy is blown away and a park bench is uprooted. An Apache helicopter enters the cloud as a scientist's chopper lands in a park, deploying soldiers with weapons and torches, followed by scientists in hazmat suits. They cautiously approach the glowing, vapor-shrouded object, their rifle-mounted torches piercing the gloom. Helen advances through the mist as the object emits an eerie green glow. She stands still, concentrating, as lights swirl in the fog, and crowds gaze at the pulsating sphere hundreds of feet high. Helen gapes as a white light sweeps the ground, and military Hummers with machine guns and police vehicles arrive. A soldier aims a .50 caliber gun at the sphere as floodlights illuminate the site, and police snipers take positions. The Apache circles the sphere, and lights concentrate at its base, forcing Helen to shield her eyes. Police and soldiers stand tensely as a figure appears in the light, and Helen approaches it. As soldiers prepare to fire, she hesitates before the figure extends a human-like hand. Red blood sprays Helen's visor as the figure collapses, and she cradles the humanoid shape. More lights blaze within the sphere, and a 50-foot humanoid robot emerges, emitting noise that disables weapons and lights, causing people to cringe in pain. It looms over Helen, who holds the wounded visitor, then withdraws its hand and stands still as the light in its eye slit goes out. Finally, all lights, power, and weapons systems are restored."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "An object blasts out, scattering leaves, knocking people over, blowing away a child's buggy, and ripping a park bench from its mountings. An Apache helicopter enters the cloud as a scientist chopper lands, soldiers with weapons and torches emerge, followed by hazmat-suited scientists. They cautiously approach the glowing object, torches cutting through the gloom, as Helen advances through the mist. The object casts an eerie green glow, and lights swirl in the fog. Crowds stare at the pulsating sphere, hundreds of feet high. Helen gapes as a white light sweeps the ground, and military Hummers with machine guns and police vehicles arrive. A soldier aims a .50 caliber gun at the sphere as floodlights illuminate the site, and police snipers take positions. The Apache circles the sphere, lights concentrate at its base, forcing Helen to shield her eyes. Police and soldiers stand tensely as a figure moves in the light. Helen approaches the figure, hesitating before taking its human-like hand. Red blood sprays her visor as the figure falls, and she looks at the humanoid shape. More lights blaze as a 50-foot humanoid robot emerges, emitting noise that disables weapons and lights, causing pain. It looms over Helen, holding the wounded visitor, bends its head, stretches a hand, then withdraws it, standing with arms by its sides as the eye light goes out. Finally, all systems are restored."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "An object suddenly blasts out with tremendous force, sending clouds of leaves swirling into the air and knocking people off their feet in a chaotic scene. A child's buggy is violently blown away, and a park bench is forcefully ripped from its mountings. In the midst of this turmoil, an Apache attack helicopter makes its way into the cloud, while a scientist's chopper lands in the park. Soldiers, armed and ready, file out of the helicopter with their weapons raised and torches blazing brightly. They are followed by scientists clad in protective hazmat suits, their heads encased in glass-fronted helmets. Moving cautiously and deliberately through the trees, they advance towards the mysterious, glowing, vapor-shrouded object. The torches mounted on their rifles cut through the dense gloom, casting shafts of light as Helen advances with the others through the mist. The object emits an eerie green glow that permeates the haze. \n\nHelen stands still for a moment, concentrating intently, as lights swirl in the fog, cutting brightly through the dissipating mists. The gathered crowds stare up in awe at the pulsating sphere, which towers hundreds of feet high. Helen, her mouth agape behind her visor, watches as an intense beam of white light sweeps across the ground. Alarmed, she looks around as the military arrives in Hummers equipped with heavy machine guns, while police vehicles draw up in a convoy. Soldiers fan out to take firing positions. A soldier arms his .50 caliber heavy machine gun, aiming it at the sphere as floodlights illuminate the site, and police snipers take strategic positions overlooking the park. The Apache helicopter circles the sphere, and lights blaze out from its interior, concentrating at the base of the towering object with such intensity that Helen has to avert her gaze, raising an arm to shield her eyes from the blinding light. \n\nPolice and soldiers stand tensely, their weapons raised, as a figure begins to move within the white blaze of light. Helen moves cautiously towards the hazy figure. As the soldiers prepare to fire, she continues to move slowly forward, approaching the figure near the base of the sphere. She hesitates momentarily before the figure extends a human-like hand, which Helen reaches out to take. Suddenly, red blood sprays across Helen's visor as the figure collapses into her arms. She looks down at the humanoid shape, noting its featureless face, as personnel hurry to provide assistance. More lights blaze within the sphere, drawing everyone's attention upwards. They stare in astonishment as a humanoid robot, towering some 50 feet high, emerges from the sphere. A light shines out from an eye slit in its head. \n\nIn an instant, every weapon becomes inoperable, and all the lights go out, plunging the area into darkness. People cringe and fall to the ground in pain from the noise emitted by the robot. It strides forward with purpose, looming over Helen, who is still holding the wounded visitor. The robot bends its head down towards her, stretching out a vast hand, then withdraws it, raises its head, and stands with its arms by its sides as the light in the eye slit goes out. Finally, all the lights, power, and weapons systems are restored, returning the scene to a semblance of normalcy."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A massive object suddenly bursts forth with immense, unstoppable force, sending waves of leaves swirling wildly into the air and knocking people off their feet in a scene of utter chaos. A child's buggy is violently swept away by the powerful blast, and a park bench is forcefully torn from its secure mountings. Amidst this chaos and confusion, an Apache attack helicopter makes its formidable entrance into the swirling cloud, while a scientist's helicopter lands strategically in the nearby park. Armed soldiers, ready and prepared for any threat, file out of the helicopter with their weapons raised and torches blazing brilliantly. They are closely followed by a team of scientists clad in protective hazmat suits, their heads encased in helmets with glass fronts. Moving with caution and great care through the thick trees, they advance towards the enigmatic, glowing, vapor-shrouded object. The torches affixed to their rifles slice through the dense, oppressive gloom, casting sharp shafts of light as Helen, with determination, advances with the team through the mist. The mysterious object emits an eerie green glow that seeps into the surrounding haze. \n\nHelen pauses momentarily, focusing intently as lights swirl dramatically in the fog, cutting brightly through the thinning mists. The gathered crowds stare up in sheer awe at the pulsating sphere, which looms hundreds of feet high. Helen, her mouth agape behind the protective visor, watches in astonishment as an intense beam of white light sweeps decisively across the ground. Alarmed, she glances around as the military arrives in a fleet of Hummers equipped with formidable heavy machine guns, while police vehicles draw up in an orderly convoy. Soldiers fan out strategically to take up firing positions. One soldier arms his .50 caliber heavy machine gun, aiming it directly at the towering sphere as floodlights illuminate the area, and police snipers assume strategic positions overlooking the park. The Apache helicopter circles the sphere ominously, and lights blaze out from its interior, concentrating at the base of the towering object with such intensity that Helen has to avert her gaze, raising an arm to shield her eyes from the blinding light. \n\nPolice officers and soldiers stand tensely, their weapons poised, as a mysterious figure begins to move within the dazzling blaze of white light. Helen cautiously moves forward towards the hazy, indistinct figure. As the soldiers prepare to fire, she continues to advance slowly, approaching the figure near the base of the sphere. She hesitates momentarily before the figure extends a hand, human-like in appearance, which Helen instinctively reaches out to take. Suddenly, red blood sprays across Helen's visor as the figure collapses into her arms. She looks down at the humanoid shape, noting the unsettling featureless face, as personnel rush to provide urgent assistance. More intense lights blaze within the sphere, drawing everyone's attention upwards in astonishment. They stare in disbelief as a humanoid robot, towering an impressive 50 feet high, emerges from the sphere. A brilliant light shines out from an eye slit in its head. \n\nIn an instant, every weapon becomes completely inoperable, and all the lights extinguish, plunging the area into darkness. People cringe and fall to the ground, wincing in pain from the cacophony emitted by the robot. It strides forward with deliberate purpose, looming over Helen, who remains cradling the wounded visitor. The robot bends its colossal head down towards her, stretching out a vast hand, then withdraws it, raises its head, and stands with its arms by its sides as the light in the eye slit fades. Finally, all the lights, power, and complex weapons systems are restored, returning the scene to a semblance of normalcy."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "An object suddenly blasts out with tremendous force, sending clouds of leaves swirling into the air and knocking people off their feet, while a child's buggy is violently blown away and a park bench is forcefully ripped from its mountings. An Apache attack helicopter swiftly heads into the cloud, and simultaneously, a scientist's helicopter descends and lands in the park. Soldiers quickly file out of the helicopter, their weapons raised and torches blazing, followed closely by scientists clad in hazmat protective suits with glass-fronted helmets securely covering their heads. They move cautiously through the trees, advancing towards the glowing, vapor-shrouded object, with torches mounted on their rifles cutting sharp shafts of light through the dense gloom. Helen advances with the others through the mist, her eyes fixed on the object that casts an eerie green glow in the haze. She stands still, concentrating intently, as lights swirl in the fog, cutting brightly through the dissipating mists, while the gathered crowds stare up in awe at the pulsating sphere towering hundreds of feet high. Helen gapes, her mouth open behind her visor, as an intense beam of white light sweeps across the ground, prompting her to look around in alarm as the military arrives in Hummers equipped with heavy machine guns. Police vehicles draw up in a convoy, and soldiers fan out to take firing positions. A soldier methodically arms his .50 caliber heavy machine gun and points it directly at the sphere as floodlights illuminate the site, and police snipers take strategic positions overlooking the park. The Apache helicopter circles the sphere, its lights blazing out from the interior, then concentrating at the base of the towering object with such intensity that Helen has to avert her gaze and raises an arm to shield her eyes. Police and soldiers stand tensely, their weapons raised, as a figure begins to move within the white blaze of light. Helen moves cautiously towards the hazy figure, and as the soldiers prepare to fire, she continues to move slowly forward, approaching the figure near the base of the sphere. She hesitates momentarily before the figure extends a human-like hand, which Helen reaches out to take. Suddenly, red blood sprays across Helen's visor as the figure collapses into her arms, and she looks down at the humanoid shape with a featureless face as personnel rush to assist. More lights blaze within the sphere, drawing everyone's gaze upward as a humanoid robot, approximately 50 feet high, emerges from the sphere with a light shining out from an eye slit in its head. In an instant, every weapon becomes inoperable, and all the lights go out, causing people to cringe and fall to the ground in pain from the noise emitted by the robot. It strides forward, looming over Helen, who is still holding the wounded visitor, and bends its head down towards her, stretching out a vast hand. Then, it withdraws its hand, raises its head, and stands with its arms by its sides as the light in the eye slit goes out. Finally, all the lights, power, and weapons systems are restored, returning the scene to a semblance of normalcy."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "An object erupts, scattering leaves and knocking people over as a child's buggy is swept away and a park bench is uprooted. An Apache helicopter approaches the cloud while a scientist chopper lands, deploying soldiers and scientists in hazmat suits. They cautiously advance through the trees toward the glowing, vapor-shrouded object, their rifle-mounted torches piercing the gloom. Helen moves with them, captivated by the eerie green glow. As lights swirl through the fog, the crowd gazes at the pulsating sphere towering above. Helen watches in alarm as military and police vehicles arrive, soldiers take firing positions, and a soldier aims a heavy machine gun at the sphere. The Apache circles as floodlights illuminate the site, and police snipers position themselves. Intense lights from the sphere force Helen to shield her eyes. Amidst the tension, a figure emerges in the light, and Helen approaches it. As soldiers prepare to fire, she hesitates before reaching for the figure's outstretched hand. Blood sprays her visor as the figure collapses into her arms, revealing a humanoid shape. Personnel rush to assist as a massive humanoid robot emerges from the sphere, disabling all weapons and lights with its presence. The robot strides forward, looming over Helen and the wounded visitor, then withdraws its hand and stands still as its eye light extinguishes. Finally, power and systems are restored."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "An unknown object blasts out from the sky, raising clouds of leaves, knocking people off their feet, and blowing away a child's buggy while ripping a park bench from its mountings, a scene reminiscent of science fiction films such as \"War of the Worlds.\" An Apache attack helicopter, a highly advanced combat helicopter used by the U.S. Army, heads into the developing cloud of chaos as a scientist chopper, equipped with specialized instruments for analyzing airborne threats, lands in a nearby park. Soldiers file out with weapons ready and torches blazing, their beams cutting sharply through the dimness, followed by scientists donning hazmat protective suits, often worn in environments with unknown biological or chemical contaminants, with glass-fronted helmets shielding their identities. They move cautiously through the trees towards the glowing vapor-shrouded object, perhaps reminiscent of unidentified flying objects or UFOs in popular culture, with torches mounted on rifles slicing through the dense gloom. Meanwhile, Helen advances with the others through the mist as the object casts an eerie green glow, reminiscent of bioluminescent phenomena in nature, in the haze. She stands still, concentrating deeply, as lights swirl in the fog, their brilliance cutting sharply through the dissipating mists, and the gathered crowds stare up at the pulsating sphere, an enigmatic structure hundreds of feet high, akin to giant cinematic alien crafts. Helen gapes with her mouth open behind her visor as an intense beam of white light sweeps across the ground, a technique often used in search operations. She looks around in alarm as the military arrives in Hummers, these vehicles known for their durability in rough terrains, with heavy machine guns mounted, while police vehicles draw up in a convoy, demonstrating a coordinated response, and soldiers fan out to their firing positions. A soldier readies his .50 caliber heavy machine gun, a weapon noted for its power and range, and points it at the sphere as floodlights illuminate the site, and police snipers position themselves to overlook the park. The Apache circles the sphere as lights blaze out from its interior, focusing at the base of this towering object with such power that Helen must avert her gaze and raise an arm to shield her eyes. Police and soldiers stand tensely with their weapons raised as a figure moves in the intense white blaze of light, and Helen moves toward the hazy figure. As the soldiers prepare to fire, Helen continues moving cautiously forward, approaching the figure near the base of the sphere, pausing before the figure extends a human-like hand, which Helen reaches to take. Red blood sprays Helen's visor as the figure collapses into her arms, revealing a humanoid shape with a featureless face, drawing parallels to depictions of extraterrestrial beings in science fiction, as personnel rush to assist. More lights blaze within the sphere, and everyone looks upward at a towering humanoid robot, some 50 feet high, emerging with a light shining from an eye slit in its head, a vision reminiscent of classic robot imagery in literature. Every weapon becomes inoperable and all the lights extinguish, causing people to cringe and fall to the ground from the noise emitted by the robot, a concept often explored in speculative technology. It strides forward, looming over Helen, who's still holding the wounded visitor, bending its head down towards her, stretching out its enormous hand, then retreats its hand, raises its head, and stands with its arms by its sides as the light in the eye slit extinguishes. Finally, all the lights, power, and weapons systems are miraculously restored, suggesting a return to normalcy in the midst of chaos."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "An object blasts out raising clouds of leaves and knocking people off their feet as a child's buggy is blown away and a park bench is ripped from its mountings. An Apache attack helicopter heads into the cloud as a scientist chopper lands in a park and soldiers file out with weapons raised and torches blazing followed by scientists wearing hazmat protective suits with glassfronted helmets covering their heads. They move cautiously through the trees towards the glowing vaporshrouded object with torches mounted on rifles cutting shafts of light through the dense gloom and Helen advances with the others through the mist as the object casts an eerie green glow in the haze. She stands still concentrating as lights swirl in the fog cutting brightly through the dissipating mists and the gathered crowds stare up at the pulsating sphere which is hundreds of feet high. Helen gapes with her mouth open behind her visor as an intense beam of white light sweeps across the ground and she looks around in alarm as the military arrives in. Hummers with heavy machine guns while police vehicles draw up in convoy and soldiers fan out to firing positions. A soldier arms his 50 caliber heavy machine gun and points it at the sphere as floodlights illuminate the site and police snipers take positions overlooking the park. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. The Apache circles the sphere as lights blaze out from the interior then concentrate at the base of the towering object with such power that Helen has to look away and raises an arm to shield her eyes. Police and soldiers stand tensely with their weapons raised as a figure moves in the white blaze of light and Helen moves towards the hazy figure. As the soldiers prepare to fire Helen keeps moving slowly forward and approaches the figure near the base of the sphere hesitating before the figure holds out a humanlike hand which Helen goes to take. Red blood sprays Helen's visor as the figure falls into her arms and she looks down at the humanoid shape with a featureless face as personnel hurry to help. More lights blaze within the sphere and everybody looks up staring as a humanoid robot some 50 feet high emerges from the sphere with a light shining out from an eye slit in its head. Every weapon becomes inoperable and all the lights go out as people cringe and fall to the ground in pain from the noise emitted by the robot. It strides forward and looms over Helen who is still holding the wounded visitor and it bends its head down towards her stretching out a vast hand then withdraws its hand raises its head and stands with its arms by its sides as the light in the eye slit goes out. Finally all the lights power and weapons systems are restored."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "An object blasts out raising clouds of leaves and knocking people off their feet as a child's buggy is blown away and a park bench is ripped from its mountings. An Apache attack helicopter heads into the cloud as a scientist chopper lands in a park and soldiers file out with weapons raised and torches blazing followed by scientists wearing hazmat protective suits with glassfronted helmets covering their heads. They move cautiously through the trees towards the glowing vaporshrouded object with torches mounted on rifles cutting shafts of light through the dense gloom and Helen advances with the others through the mist as the object casts an eerie green glow in the haze. She stands still concentrating as lights swirl in the fog cutting brightly through the dissipating mists and the gathered crowds stare up at the pulsating sphere which is hundreds of feet high. Helen gapes with her mouth open behind her visor as an intense beam of white light sweeps across the ground and she looks around in alarm as the military arrives in. Hummers with heavy machine guns while police vehicles draw up in convoy and soldiers fan out to firing positions. A soldier arms his 50 caliber heavy machine gun and points it at the sphere as floodlights illuminate the site and police snipers take positions overlooking the park. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. The Apache circles the sphere as lights blaze out from the interior then concentrate at the base of the towering object with such power that Helen has to look away and raises an arm to shield her eyes. Police and soldiers stand tensely with their weapons raised as a figure moves in the white blaze of light and Helen moves towards the hazy figure. As the soldiers prepare to fire Helen keeps moving slowly forward and approaches the figure near the base of the sphere hesitating before the figure holds out a humanlike hand which Helen goes to take. Red blood sprays Helen's visor as the figure falls into her arms and she looks down at the humanoid shape with a featureless face as personnel hurry to help. More lights blaze within the sphere and everybody looks up staring as a humanoid robot some 50 feet high emerges from the sphere with a light shining out from an eye slit in its head. Every weapon becomes inoperable and all the lights go out as people cringe and fall to the ground in pain from the noise emitted by the robot. It strides forward and looms over Helen who is still holding the wounded visitor and it bends its head down towards her stretching out a vast hand then withdraws its hand raises its head and stands with its arms by its sides as the light in the eye slit goes out. Finally all the lights power and weapons systems are restored."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "An object blasts out raising clouds of leaves and knocking people off their feet as a child's buggy is blown away and a park bench is ripped from its mountings. An Apache attack helicopter heads into the cloud as a scientist chopper lands in a park and soldiers file out with weapons raised and torches blazing followed by scientists wearing hazmat protective suits with glassfronted helmets covering their heads. They move cautiously through the trees towards the glowing vaporshrouded object with torches mounted on rifles cutting shafts of light through the dense gloom and Helen advances with the others through the mist as the object casts an eerie green glow in the haze. She stands still concentrating as lights swirl in the fog cutting brightly through the dissipating mists and the gathered crowds stare up at the pulsating sphere which is hundreds of feet high. More lights blaze within the sphere and everybody looks up staring as a humanoid robot some 50 feet high emerges from the sphere with a light shining out from an eye slit in its head. Every weapon becomes inoperable and all the lights go out as people cringe and fall to the ground in pain from the noise emitted by the robot. It strides forward and looms over Helen who is still holding the wounded visitor and it bends its head down towards her stretching out a vast hand then withdraws its hand raises its head and stands with its arms by its sides as the light in the eye slit goes out. Finally all the lights power and weapons systems are restored."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "An object blasts out raising clouds of leaves and knocking people off their feet as a child's buggy is blown away and a park bench is ripped from its mountings. It strides forward and looms over Helen who is still holding the wounded visitor and it bends its head down towards her stretching out a vast hand then withdraws its hand raises its head and stands with its arms by its sides as the light in the eye slit goes out. Finally all the lights power and weapons systems are restored."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "A frisbee glides in, scattering swirls of confetti and jostling robots off their stools as a raccoon's skateboard rolls away and a picnic table is plucked from its bolts. A kite-flying dragon swoops into the confetti as a beekeeper blimp rests in a forest, and bakers parade out with cameras lifted and lanterns glowing, followed by botanists wearing rainproof diving helmets with steel-bottomed hats protecting their shoulders. They glide stealthily through the reeds towards the glittering mist-covered frisbee, with lanterns strapped on lollipops casting beams of darkness through the thick brightness, and Gary drifts with the crowd through the cloud as the frisbee emits an ominous purple twinkle in the fog. He squats down, pondering, as shadows orbit in the mist slicing faintly through the gathering clouds, and the assembled flocks glance sideways at the shimmering rhombus which is dozens of inches tall. Gary giggles with his eyes shut behind his monocle as a muted ray of yellow shadow sweeps below the soil, and he whistles around in excitement as the firefighters approach in tractors with floral water pistols, while gumdrop drones park in tandem and bakers scatter to scripting arenas. A baker fuels his micro fiber water pistol and gestures it at the rhombus as spotlights flood the arena and gumdrop artists stake galleries overlooking the forest. The kite-flying dragon spirals the rhombus as shadows flicker from the exterior, then converge at the top of the minuscule frisbee with such intensity that Gary has to glance aside and lowers a foot to warm his toes. Gumdrops and bakers stand jauntily with their cameras lifted as a jellybean crawls in the dim swirl of shadow, and Gary strolls towards the blurry jellybean. As the bakers brace to sketch, Gary keeps striding gradually backward and sidles past the jellybean near the front of the rhombus, doubting before the jellybean retracts a gorilla-like tentacle, which Gary declines to hold. Blue sugar sprinkles Gary's monocle as the jellybean floats onto his shoulders, and he holds up the feline structure with a detailed coat as dentists hustle to relax. More shadows fade beyond the rhombus, and everyone gazes down, peering, as a feline teapot roughly 10 inches short peeks from the rhombus with a shadow dimming in an ear crease at its tail. Each camera turns functional and all the shadows illuminate, as robots shout and rise to the sky in joy from the silence radiating by the teapot. It dances downward and flits near Gary, who's still cradling the glittery jellybean, and it wiggles a tail back towards him, extending a tiny tentacle, then retracts its tentacle, dips its tail, and squats with its wings over its paws as the shadow in the ear crease flashes on. Subsequently, every shadow, silence, and camera ensemble are activated."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "An object erupts, scattering debris and people, while an Apache helicopter and a chopper with scientists and soldiers approach the site. Soldiers and scientists in hazmat suits move cautiously towards the glowing object through the mist. Helen, among them, watches a pulsating sphere, hundreds of feet high. As military reinforcements arrive with heavy artillery, the sphere emits intense light, forcing Helen to shield her eyes. A humanoid figure appears, and as Helen approaches, it reaches out a hand before blood sprays across her visor. Holding the figure, she sees its featureless face. Then a massive humanoid robot emerges from the sphere, rendering all weapons and lights inactive with its noise. It approaches Helen, leans down, and then retreats. As the lights and systems restore, the robot stands silent, arms by its sides."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Finally all the lights power and weapons systems are restored It strides forward and looms over Helen who's still holding the wounded visitor and it bends its head down towards her stretching out a vast hand then withdraws its hand raises its head and stands with its arms by its sides as the light in the eye slit goes out  Every weapon becomes inoperable and all the lights go out as people cringe and fall to the ground in pain from the noise emitted by the robot  More lights blaze within the sphere and everybody looks up staring as a humanoid robot some 50 feet high emerges from the sphere with a light shining out from an eye slit in its head  Red blood sprays Helen's visor as the figure falls into her arms and she looks down at the humanoid shape with a featureless face as personnel hurry to help  As the soldiers prepare to fire Helen keeps moving slowly forward and approaches the figure near the base of the sphere hesitating before the figure holds out a humanlike hand which Helen goes to take  Police and soldiers stand tensely with their weapons raised as a figure moves in the white blaze of light and Helen moves towards the hazy figure  The Apache circles the sphere as lights blaze out from the interior then concentrate at the base of the towering object with such power that Helen has to look away and raises an arm to shield her eyes  A soldier arms his 50 caliber heavy machine gun and points it at the sphere as floodlights illuminate the site and police snipers take positions overlooking the park  Hummers with heavy machine guns while police vehicles draw up in convoy and soldiers fan out to firing positions  Helen gapes with her mouth open behind her visor as an intense beam of white light sweeps across the ground and she looks around in alarm as the military arrives in  She stands still concentrating as lights swirl in the fog cutting brightly through the dissipating mists and the gathered crowds stare up at the pulsating sphere which is hundreds of feet high  They move cautiously through the trees towards the glowing vaporshrouded object with torches mounted on rifles cutting shafts of light through the dense gloom and Helen advances with the others through the mist as the object casts an eerie green glow in the haze  An Apache attack helicopter heads into the cloud as a scientist chopper lands in a park and soldiers file out with weapons raised and torches blazing followed by scientists wearing hazmat protective suits with glassfronted helmets covering their heads  An object blasts out raising clouds of leaves and knocking people off their feet as a child's buggy is blown away and a park bench is ripped from its mountings "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "An Apache attack helicopter heads into the cloud as a scientist chopper lands in a park and soldiers file out with weapons raised and torches blazing followed by scientists wearing hazmat protective suits with glassfronted helmets covering their heads An object blasts out raising clouds of leaves and knocking people off their feet as a child's buggy is blown away and a park bench is ripped from its mountings She stands still concentrating as lights swirl in the fog cutting brightly through the dissipating mists and the gathered crowds stare up at the pulsating sphere which is hundreds of feet high They move cautiously through the trees towards the glowing vaporshrouded object with torches mounted on rifles cutting shafts of light through the dense gloom and Helen advances with the others through the mist as the object casts an eerie green glow in the haze Hummers with heavy machine guns while police vehicles draw up in convoy and soldiers fan out to firing positions Helen gapes with her mouth open behind her visor as an intense beam of white light sweeps across the ground and she looks around in alarm as the military arrives in The Apache circles the sphere as lights blaze out from the interior then concentrate at the base of the towering object with such power that Helen has to look away and raises an arm to shield her eyes A soldier arms his 50 caliber heavy machine gun and points it at the sphere as floodlights illuminate the site and police snipers take positions overlooking the park As the soldiers prepare to fire Helen keeps moving slowly forward and approaches the figure near the base of the sphere hesitating before the figure holds out a humanlike hand which Helen goes to take Police and soldiers stand tensely with their weapons raised as a figure moves in the white blaze of light and Helen moves towards the hazy figure More lights blaze within the sphere and everybody looks up staring as a humanoid robot some 50 feet high emerges from the sphere with a light shining out from an eye slit in its head Red blood sprays Helen's visor as the figure falls into her arms and she looks down at the humanoid shape with a featureless face as personnel hurry to help It strides forward and looms over Helen who is still holding the wounded visitor and it bends its head down towards her stretching out a vast hand then withdraws its hand raises its head and stands with its arms by its sides as the light in the eye slit goes out Every weapon becomes inoperable and all the lights go out as people cringe and fall to the ground in pain from the noise emitted by the robot Finally all the lights power and weapons systems are restored"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Police and soldiers stand tensely with their weapons raised as a figure moves in the white blaze of light and Helen moves towards the hazy figure  As the soldiers prepare to fire Helen keeps moving slowly forward and approaches the figure near the base of the sphere hesitating before the figure holds out a humanlike hand which Helen goes to take  Red blood sprays Helen's visor as the figure falls into her arms and she looks down at the humanoid shape with a featureless face as personnel hurry to help  More lights blaze within the sphere and everybody looks up staring as a humanoid robot some 50 feet high emerges from the sphere with a light shining out from an eye slit in its head  Every weapon becomes inoperable and all the lights go out as people cringe and fall to the ground in pain from the noise emitted by the robot  It strides forward and looms over Helen who's still holding the wounded visitor and it bends its head down towards her stretching out a vast hand then withdraws its hand raises its head and stands with its arms by its sides as the light in the eye slit goes out  Finally all the lights power and weapons systems are restored An object blasts out raising clouds of leaves and knocking people off their feet as a child's buggy is blown away and a park bench is ripped from its mountings  An Apache attack helicopter heads into the cloud as a scientist chopper lands in a park and soldiers file out with weapons raised and torches blazing followed by scientists wearing hazmat protective suits with glassfronted helmets covering their heads  They move cautiously through the trees towards the glowing vaporshrouded object with torches mounted on rifles cutting shafts of light through the dense gloom and Helen advances with the others through the mist as the object casts an eerie green glow in the haze  She stands still concentrating as lights swirl in the fog cutting brightly through the dissipating mists and the gathered crowds stare up at the pulsating sphere which is hundreds of feet high  Helen gapes with her mouth open behind her visor as an intense beam of white light sweeps across the ground and she looks around in alarm as the military arrives in  Hummers with heavy machine guns while police vehicles draw up in convoy and soldiers fan out to firing positions  A soldier arms his 50 caliber heavy machine gun and points it at the sphere as floodlights illuminate the site and police snipers take positions overlooking the park  The Apache circles the sphere as lights blaze out from the interior then concentrate at the base of the towering object with such power that Helen has to look away and raises an arm to shield her eyes "
        }
      ]
    }
  ]
}