{
  "ground_truth": "Stunned people pick themselves up off the ground as the vast metallic-skinned robot stands immobile with the sphere swirling in light and vapor behind it. The visitor's body is rushed to a medical facility on a covered gurney, with Helen accompanying it. A sarcophagus-like gurney is wheeled to a prefab hut in a hangar where the protective cover is unsealed. Mike looks baffled while Helen glances at him, and his scalpel cuts into the patient's gray, gelatinous skin, causing the gray skin to come apart as the surgeon drops the bullet into a sample tube. Helen slowly shakes her head as the surgeon, wearing a suit that even covers his feet, drops lumps of blubbery flesh into a basin. On the operating table, the naked, slime-covered body of a man curls up into a fetal position, and Mike and Helen stare in disbelief. The patient lies under a protective tent attended by a technician before Helen enters the room, descending three steps from the gallery area where she was watching, and cautiously approaches the tent. She peers in and sees the man's eyes fluttering. The patient begins thrashing around inside the tent, and Mike comes in to check a monitor. The Secretary's chopper touches down at Fort Linwood while the being lies on a gurney wearing gray hospital pajamas and an oxygen mask. Officials stand at a window overlooking the room as, watched closely by Helen, Mike removes the oxygen mask and offers the being a cup of water, which he takes and draws shakily towards him. They all watch him intently, the Secretary taking a step towards him as he uses both hands to steady the plastic beaker, while they all stare. Regina glances at the scientists as Helen steps forward to help him put down the cup, noting that he looks just like the climber from 1928. His head swivels towards her. Helen enters a storeroom with shelves full of vials of drugs, leans back against the door to compose herself, then takes a hypodermic in a sealed packet from a glass cabinet, putting it in her pocket and scanning the shelves. The agent hands her a vial which she pockets along with a vial of saline solution, then goes to the syringe cabinet, opens, and closes the door before turning around and holding up the syringe packet for the benefit of the suspicious agent. Jaw thrust forward, Regina eyeballs Klaatu, and having swapped the two vials, Helen approaches him, rolls up his sleeve, and jabs the hypodermic into his arm. The Defense Secretary watches dispassionately then turns away as Klaatu's dark eyes stare at Helen. Three military policemen surround Helen and escort her from the room as Klaatu glances down at his arm while the agent from the drugstore comes in, and they eyeball one another.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Stunned individuals lift themselves up off the earth as the enormous metallic-skinned automaton stands motionless with the orb swirling in illumination and mist behind it. The visitor's form is rushed to a medical center on a covered stretcher, with Helen accompanying it. A coffin-like stretcher is wheeled to a prefab shelter in a hangar where the protective cover is opened. Mike looks perplexed while Helen glances at him, and his scalpel incises the patient's gray, gelatinous epidermis, causing the gray epidermis to separate as the surgeon drops the projectile into a specimen tube. Helen slowly shakes her head as the surgeon, wearing an outfit that even covers his feet, drops chunks of blubbery tissue into a basin. On the operating platform, the unclothed, slime-covered form of a man curls up into an embryonic position, and Mike and Helen gaze in disbelief. The patient lies under a protective canopy attended by a technician before Helen enters the area, descending three steps from the gallery section where she was observing, and cautiously approaches the canopy. She peers in and sees the man's eyes fluttering. The patient begins thrashing around inside the canopy, and Mike comes in to examine a monitor. The Secretary's helicopter touches down at Fort Linwood while the entity lies on a stretcher wearing gray hospital pajamas and an oxygen mask. Officials stand at a window overlooking the area as, observed closely by Helen, Mike removes the oxygen mask and offers the entity a cup of water, which he takes and draws unsteadily towards him. They all watch him intently, the Secretary taking a step towards him as he uses both hands to steady the plastic container, while they all stare. Regina glances at the scientists as Helen steps forward to assist him put down the cup, noting that he looks just like the mountaineer from 1928. His head swivels towards her. Helen enters a storeroom with shelves full of vials of medications, leans back against the door to calm herself, then takes a hypodermic in a sealed packet from a glass cabinet, putting it in her pocket and scanning the shelves. The officer hands her a vial which she pockets along with a vial of saline solution, then goes to the syringe cabinet, opens, and closes the door before turning around and holding up the syringe packet for the benefit of the suspicious officer. Jaw thrust forward, Regina eyes Klaatu, and having swapped the two vials, Helen approaches him, rolls up his sleeve, and jabs the hypodermic into his arm. The Defense Secretary watches dispassionately then turns away as Klaatu's dark eyes gaze at Helen. Three military police surround Helen and escort her from the area as Klaatu glances down at his arm while the officer from the pharmacy comes in, and they eye one another."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Stunned people are picked up off the ground by themselves as the vast metallic-skinned robot is stood immobile with the sphere swirling in light and vapor behind it. A medical facility rushes the visitor's body on a covered gurney, with Helen accompanying it. An attendant wheels a sarcophagus-like gurney to a prefab hut in a hangar where they unseal the protective cover. Mike is looked at baffled by Helen, and a scalpel is used by him to cut into the patient's gray, gelatinous skin, causing the gray skin to be parted as the bullet is dropped into a sample tube by the surgeon. Helen's head is slowly shaken as lumps of blubbery flesh are dropped into a basin by the surgeon, who wears a suit that even covers his feet. On the operating table, the naked, slime-covered body of a man is curled up into a fetal position, and disbelief is stared at by Mike and Helen. A technician attends to the patient lying under a protective tent before Helen enters the room, descends three steps from the gallery area where she was watching, and the tent is approached cautiously by her. She peers in and sees the man's eyes fluttering. Inside the tent, thrashing around begins by the patient, and a monitor is checked by Mike who comes in. The Secretary's chopper is touched down at Fort Linwood while a gurney holds the being wearing gray hospital pajamas and an oxygen mask. A window overlooking the room is stood at by officials as Helen closely watches Mike remove the oxygen mask and offer the being a cup of water, which is taken and drawn shakily towards him. They all watch him intently, a step is taken by the Secretary towards him as the plastic beaker is steadied using both hands by the being, while they all stare. Regina glances at the scientists as Helen steps forward to help him put down the cup, noting that the climber from 1928 is just like him. His head is swiveled towards her. A storeroom with shelves full of vials of drugs is entered by Helen, who leans back against the door to compose herself, then takes a hypodermic in a sealed packet from a glass cabinet, putting it in her pocket and the shelves are scanned by her. An agent hands her a vial which is pocketed along with a vial of saline solution, then she goes to the syringe cabinet, opens, and closes the door before the syringe packet is held up for the benefit of the suspicious agent. Klaatu is eyeballed by Regina, jaw thrust forward, and having swapped the two vials, he is approached by Helen, his sleeve is rolled up by her, and his arm is jabbed with the hypodermic. The Defense Secretary watches dispassionately then turns away as Helen is stared at by Klaatu's dark eyes. Three military policemen surround her and escort her from the room as Klaatu's arm is glanced down at by him while the agent from the drugstore comes in, and they eyeball one another."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Stunned people rise from the ground as the massive metallic-skinned robot stands still, the sphere swirling with light and vapor behind it. The visitor's body is rushed to a medical facility on a covered gurney, with Helen accompanying it. The gurney is brought to a prefab hut in a hangar, where the protective cover is unsealed. Mike looks confused as Helen watches him, and his scalpel cuts into the gray, gelatinous skin, dropping the bullet into a sample tube. Helen shakes her head as the suited surgeon drops blubbery flesh into a basin. On the table, the naked, slime-covered man's body curls into a fetal position, and Mike and Helen stare in disbelief. Under a protective tent attended by a technician, the man's eyes flutter as Helen enters, cautiously approaching. He begins thrashing, and Mike checks a monitor. The Secretary's chopper lands at Fort Linwood while the being lies on a gurney in gray hospital pajamas and an oxygen mask. Officials watch from a window as Mike removes the mask and offers water, which the being shakily accepts. They watch intently as the Secretary steps towards him, and Regina glances at scientists as Helen notes his resemblance to the 1928 climber. Helen enters a storeroom with drug vials, composes herself, takes a hypodermic, and pockets a vial and saline. She shows the syringe packet to a suspicious agent, swaps vials, and injects Klaatu. The Defense Secretary turns away as Klaatu's dark eyes stare at Helen. Military police escort Helen out, and Klaatu glances at his arm as the drugstore agent enters, and they lock eyes."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Stunned people rise from the ground as a metallic-skinned robot stands still, with a light-filled sphere swirling behind it. The visitor's body is rushed to a medical facility on a covered gurney, accompanied by Helen. A sarcophagus-like gurney is taken to a hangar's prefab hut where it's unsealed. Mike looks confused as Helen watches him cut into the patient's gray, gelatinous skin, extracting a bullet into a tube. Helen shakes her head while the suited surgeon drops flesh into a basin. The man's slime-covered body curls into a fetal position as Mike and Helen watch in disbelief. Under a protective tent, attended by a technician, the patient thrashes as Mike checks a monitor. The Secretary's chopper lands at Fort Linwood as the being lies on a gurney in gray hospital pajamas and an oxygen mask. Officials observe from a window while Mike, observed by Helen, removes the mask and offers water. They watch intently as he steadies the beaker, with the Secretary stepping closer. Regina notes the resemblance to the 1928 climber. Helen composes herself in a storeroom, takes a hypodermic from a cabinet, pockets a vial and saline solution, and presents the syringe to a suspicious agent. Regina eyes Klaatu as Helen swaps vials, injects him, and the Defense Secretary turns away. Military police escort Helen out as Klaatu and the agent exchange glances."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "People, initially in a state of shock and disbelief, gradually begin to pick themselves up off the ground after the immense metallic-skinned robot suddenly stands immobile. Behind it, a sphere swirls mesmerizingly in a dance of light and vapor. The visitor's body is swiftly transported to a medical facility; it is placed on a covered gurney, with Helen solemnly accompanying it. The gurney, resembling a sarcophagus, is wheeled into a prefab hut situated within a hangar, where the protective cover is carefully unsealed. Mike appears utterly baffled as Helen glances at him, all while his scalpel makes a precise incision into the patient's eerie, gray, gelatinous skin. The gray skin comes apart, and the surgeon, engrossed in his task, drops the extracted bullet into a waiting sample tube. Helen slowly shakes her head in dismay as the surgeon, fully adorned in a suit that even covers his feet for utmost protection, deposits lumps of blubbery flesh into a basin. On the operating table, the uncovered, slime-laden body of a man curls into a fetal position, with both Mike and Helen staring in sheer disbelief. The patient now lies protected beneath a tent, attentively monitored by a technician. Helen enters the room, descending three steps from the gallery area where she was observing, to approach the tent with cautious curiosity. She peers inside, noticing the man's eyes fluttering open. Suddenly, the patient begins to thrash around energetically inside the confines of the tent, prompting Mike to come in and check the monitor. A chopper carrying the Secretary lands smoothly at Fort Linwood, while the being remains reclined on a gurney, dressed in gray hospital pajamas and assisted by an oxygen mask. Officials stand gathered at a window overlooking the area, while, under Helen's close watch, Mike gently removes the oxygen mask and offers the being a cup of water. The being takes it, drawing it shakily toward him, as everyone present watches with great intensity. The Secretary takes a step forward, observing as the being uses both hands to steady the plastic beaker, under the collective stare of the room. Regina throws a glance at the scientists, while Helen steps forward to assist the man with the cup, noting with astonishment that he appears strikingly similar to the climber from 1928. His head turns toward her with recognition. Helen then enters a storeroom lined with shelves filled with vials of various drugs. She leans back against the door to compose herself, then selects a hypodermic needle in a sealed packet from a glass cabinet, placing it in her pocket while scanning the array of shelves. An agent hands her a vial, which she places in her pocket along with a vial of saline solution. She approaches the syringe cabinet, opening and closing the door before turning to hold up the syringe packet for the scrutinizing eyes of the suspicious agent. With determination, Regina, her jaw thrust forward, eyeballs Klaatu. Having discreetly swapped the two vials, Helen approaches Klaatu, rolls up his sleeve, and deftly injects the hypodermic into his arm. The Defense Secretary watches with dispassion before turning away, as Klaatu's dark, intense eyes remain fixed on Helen. Three military policemen quickly surround Helen, escorting her out of the room, while Klaatu glances down at his arm with curiosity, as the agent from the drugstore enters, and the two eye each other with discernment."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Initially, people find themselves in a profound state of shock and disbelief. As time passes, they gradually begin to pick themselves up off the ground after witnessing the immense, metallic-skinned robot that has now suddenly become immobile. Behind this mechanical giant, a swirling sphere captivates the onlookers with its mesmerizing dance of light and vapor. The visitor's body is swiftly transported to a nearby medical facility; it is solemnly placed on a covered gurney, with Helen accompanying it in a dignified manner. This gurney, reminiscent of a sarcophagus, is carefully wheeled into a prefab hut, strategically situated within a hangar, where the protective cover is meticulously unsealed. Mike appears utterly baffled as Helen directs a glance at him. Meanwhile, his scalpel makes a precise incision into the patient's eerie, gray, gelatinous skin. As the gray skin comes apart, the surgeon, engrossed in his meticulous task, drops the extracted bullet into a waiting sample tube. Helen slowly shakes her head in dismay as the surgeon, fully adorned in a comprehensive protective suit that even covers his feet, deposits lumps of blubbery, flesh-like material into a basin. On the operating table, the uncovered, slime-laden body of a man curls into a fetal position, with both Mike and Helen staring in sheer disbelief at the sight. The patient now lies protected beneath a tent, diligently monitored by a technician. With cautious curiosity, Helen enters the room, descending three steps from the gallery area where she was observing, to approach the tent. She peers inside, noticing with intrigue as the man's eyes begin to flutter open. Suddenly, the patient starts to thrash around energetically within the confines of the tent, which prompts Mike to come in and check the monitor with urgency. Outside, a chopper carrying the Secretary lands smoothly at Fort Linwood, while the being remains reclined on a gurney, dressed in gray hospital pajamas and aided by an oxygen mask. Officials stand gathered at a window overlooking this critical area, while, under Helen's close and attentive watch, Mike gently removes the oxygen mask and offers the being a cup of water. The being takes it with effort, drawing it shakily toward him, as everyone present watches with great intensity and anticipation. The Secretary takes a deliberate step forward, observing closely as the being uses both hands to steady the plastic beaker, under the collective, intense stare of the room. Regina throws a glance towards the scientists, while Helen steps forward to assist the man with the cup, noting with astonishment that he bears a striking resemblance to the climber from the year 1928. His head turns toward her with a look of recognition. Helen then enters a storeroom lined with shelves filled with vials of various drugs, feeling a need to compose herself. She leans back against the door for a moment, then selects a hypodermic needle in a sealed packet from a glass cabinet, carefully placing it in her pocket while scanning the array of shelves. An agent hands her a vial, which she also places in her pocket along with a vial of saline solution. She approaches the cabinet containing syringes, opening and closing the door deliberately before turning to hold up the syringe packet for the scrutinizing eyes of the suspicious agent. With steadfast determination, Regina, her jaw thrust forward with resolve, eyeballs Klaatu. Having discreetly swapped the two vials, Helen approaches Klaatu, rolls up his sleeve, and deftly injects the hypodermic into his arm. Observing all this, the Defense Secretary watches with dispassion before turning away, as Klaatu's dark, intense eyes remain ever fixed on Helen. Three military policemen quickly surround Helen, escorting her out of the room, while Klaatu glances down at his arm with curiosity. Meanwhile, the agent from the drugstore enters, and the two eye each other with discernment."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Amidst the scene of chaos and confusion, stunned individuals begin to regain their composure, carefully picking themselves up off the ground as they come to terms with the presence of a vast robot, its metallic skin glinting under the light, standing perfectly still. Behind it, a sphere swirls with light and vapor, casting an otherworldly glow. Meanwhile, the visitor's body is swiftly transported to a medical facility, resting on a covered gurney that moves steadily, with Helen walking alongside, her expression a mix of concern and determination. The gurney, resembling a sarcophagus in its form, is wheeled with purpose to a prefabricated hut located within a hangar. There, the protective cover is unsealed, revealing the scene to those present. Mike stands by, looking baffled, while Helen catches his eye, offering a silent acknowledgment as a surgeon, focused and precise, uses a scalpel to incise the patient's gray, gelatinous skin. As the blade slices through, the peculiar skin parts, and the surgeon carefully extracts a bullet, dropping it into a sample tube with a soft clink. Helen slowly shakes her head in disbelief while the surgeon, clad in a suit so comprehensive it even covers his feet, methodically drops lumps of blubbery flesh into a waiting basin. On the operating table, the naked, slime-covered body of a man suddenly curls up into a fetal position, a sight that leaves both Mike and Helen staring in deep disbelief. The patient, now under the shelter of a protective tent, is attended by a technician working diligently nearby. Helen, observing from the gallery area above, decides to descend. She carefully takes three steps down, each footfall measured and deliberate, before she cautiously approaches the tent, her heart in her throat. Peering inside, she is taken aback to see the man's eyes fluttering open. Suddenly, he begins to thrash violently within the confines of the tent, prompting Mike to enter and quickly check a nearby monitor for any signs of distress or anomaly. As all of this unfolds, the Secretary's chopper makes a precise landing at Fort Linwood, where the being lies inert on a gurney, now clad in gray hospital pajamas, an oxygen mask securely affixed to his face. A group of officials stand at a window overlooking the room, their expressions a mix of intrigue and skepticism, while, inside, Mike, under the watchful gaze of Helen, gently removes the oxygen mask from the being's face. He offers a cup of water, which the being accepts, drawing it slowly and shakily towards his lips with noticeable effort. The room's attention is palpable, with the Secretary stepping forward, eager to observe any interaction, as the being uses both hands to steady the flimsy plastic beaker. They all watch him with rapt attention, seeing every small movement as significant. Regina, standing beside them, glances momentarily at the scientists, her mind evidently weighing the implications of the scene before her. Helen, sensing the being's struggle, steps forward to assist him, helping guide the cup back down. It is then she notices something familiar, recognizing a resemblance to a climber from 1928, which makes her pause. The being's head turns towards her, drawn to her presence. Later, Helen finds herself entering a storeroom, its shelves lined with vials of drugs. Once inside, she leans back against the closed door, allowing herself a moment to gather her thoughts before proceeding. She selects a hypodermic needle in a sealed packet from a glass cabinet and carefully places it in her pocket, her eyes then scanning the shelves for what she needs next. An agent nearby hands her a vial, which she discreetly adds to her pocket along with a vial of saline solution. With practiced efficiency, she moves to the syringe cabinet, opens it with a swift motion, and upon closing the door, turns to face the room, holding up the syringe packet to satisfy the suspicious agent’s gaze. Regina stands with her jaw set, eyes trained intently on Klaatu, scrutinizing him. Having deftly swapped the two vials, Helen approaches Klaatu with a determined air. She gently rolls up his sleeve and, with a steady hand, administers the hypodermic injection into his arm. As she does so, the Defense Secretary stands nearby, watching the proceedings with a detached demeanor before turning away, uninterested. Klaatu's dark eyes remain fixed on Helen, silently communicating a depth of understanding. Almost immediately, three military policemen converge around Helen, their presence commanding, as they escort her out of the room. Klaatu shifts his gaze to his arm, examining the injection site, just as the agent from the drugstore enters, their eyes meeting in a silent exchange loaded with unspoken tension."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Stunned people recover from the ground as the vast metallic-skinned robot remains immobile, with the sphere swirling in light and vapor behind it. The visitor's body is rushed to a medical facility on a covered gurney, accompanied by Helen. Once at a prefab hut in a hangar, the gurney is unsealed, and Mike looks baffled while Helen glances at him as he performs a procedure, removing a bullet from the patient's gray, gelatinous skin. As the surgeon, clad in a full suit, continues, Helen shakes her head while lumps of blubbery flesh are dropped into a basin. On the operating table, the naked, slime-covered body of a man curls into a fetal position, prompting disbelief from Mike and Helen. Under a protective tent, attended by a technician, the patient is observed by Helen who cautiously approaches and sees the man's eyes fluttering. When the patient begins to thrash, Mike checks a monitor. Meanwhile, the Secretary's chopper arrives at Fort Linwood; officials observe as the being, on a gurney in gray hospital pajamas and an oxygen mask, is attended by Mike and Helen. Mike removes the mask, offering the being a cup of water, which he shakily accepts, watched intently by all present. Regina notes the resemblance to a climber from 1928 as Helen steps forward to assist, causing his head to swivel towards her. Helen then enters a storeroom, composes herself, and selects a hypodermic and a vial of saline solution, pocketing them. She retrieves and swaps a vial for another before demonstrating the syringe packet to a suspicious agent. With determination, Regina observes Klaatu as Helen administers the injection. The Defense Secretary, watching dispassionately, turns away as Klaatu's dark eyes fix on Helen. Military policemen escort Helen from the room as Klaatu and the drugstore agent exchange glances."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Stunned people pick themselves up off the ground as the vast metallic-skinned robot, reminiscent of those described in tales of advanced alien technology, stands immobile with the sphere swirling in light and vapor behind it, an eerie presence that seems to defy the laws of physics. The visitor's body is rushed to a medical facility on a covered gurney, the kind often used in critical situations to shield the patient from external contaminants, with Helen accompanying it, her face a mask of concern. A sarcophagus-like gurney, designed to keep its occupant safe from potentially harmful environmental factors, is wheeled to a prefab hut within a hangar, a typical military installation constructed for rapid assembly, where the protective cover is unsealed. Mike looks baffled while Helen glances at him as his scalpel cuts into the patient's gray, gelatinous skin, a texture unlike anything found on Earth, causing the gray skin to come apart as the surgeon, performing under immense pressure, drops the bullet into a sample tube for further analysis. Helen slowly shakes her head, realizing the gravity of the situation, as the surgeon, wearing a suit that even covers his feet to prevent any contamination, drops lumps of blubbery flesh into a basin. On the operating table, the naked, slime-covered body of a man curls up into a fetal position, a universal sign of vulnerability, and Mike and Helen stare in disbelief as they try to comprehend the implications. The patient lies under a protective tent attended by a technician, ensuring a sterile environment, before Helen enters the room, descending three steps from the gallery area where she was watching to maintain a safe distance, and cautiously approaches the tent. She peers in and sees the man's eyes fluttering, a sign of returning consciousness. The patient begins thrashing around inside the tent, possibly experiencing disorientation, and Mike comes in to check a monitor, assessing his vital signs. The Secretary's chopper, a state-of-the-art military helicopter designed for quick transportation, touches down at Fort Linwood, a fortified location used for high-security incidents, while the being lies on a gurney wearing gray hospital pajamas and an oxygen mask to aid his breathing. Officials stand at a window overlooking the room as, watched closely by Helen, Mike removes the oxygen mask and offers the being a cup of water sourced from a sterile supply, which he takes and draws shakily towards him, a small yet significant gesture of trust. They all watch him intently, the Secretary taking a step towards him as he uses both hands to steady the plastic beaker, a challenge for someone not used to Earth’s gravity, while they all stare. Regina glances at the scientists, wondering about the implications of their findings, as Helen steps forward to help him put down the cup, noting that he looks just like the climber from 1928, a historical figure whose mysterious disappearance has puzzled historians for decades. His head swivels towards her, indicating a level of awareness that surprises them all. Helen enters a storeroom, a place stocked with essential medical supplies, with shelves full of vials of drugs, leans back against the door to compose herself, then takes a hypodermic in a sealed packet from a glass cabinet, putting it in her pocket and scanning the shelves for what she needs. The agent hands her a vial which she pockets along with a vial of saline solution, then goes to the syringe cabinet, opens, and closes the door before turning around and holding up the syringe packet for the benefit of the suspicious agent, whose eyes follow her every move. Jaw thrust forward, Regina eyeballs Klaatu, the being whose presence has upset the status quo, and having swapped the two vials, a critical and risky maneuver, Helen approaches him, rolls up his sleeve, and jabs the hypodermic into his arm, delivering a solution devised to stabilize his condition. The Defense Secretary watches dispassionately, accustomed to the high-stakes atmosphere of political intrigue, then turns away as Klaatu's dark eyes, full of an unfathomable depth, stare at Helen in silent communication. Three military policemen, trained to handle high-profile security breaches, surround Helen and escort her from the room as Klaatu glances down at his arm, possibly sensing a change, while the agent from the drugstore comes in, and they eyeball one another, each aware of the other's role in this unprecedented event."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Stunned people pick themselves up off the ground as the vast metallicskinned robot stands immobile with the sphere swirling in light and vapor behind it. The visitor's body is rushed to a medical facility on a covered gurney with Helen accompanying it. A sarcophaguslike gurney is wheeled to a prefab hut in a hangar where the protective cover is unsealed. Mike looks baffled while Helen glances at him and his scalpel cuts into the patient's gray gelatinous skin causing the gray skin to come apart as the surgeon drops the bullet into a sample tube. Helen slowly shakes her head as the surgeon wearing a suit that even covers his feet drops lumps of blubbery flesh into a basin. On the operating table the naked slimecovered body of a man curls up into a fetal position and Mike and Helen stare in disbelief. The patient lies under a protective tent attended by a technician before Helen enters the room descending three steps from the gallery area where she was watching and cautiously approaches the tent. She peers in and sees the man's eyes fluttering. The patient begins thrashing around inside the tent and Mike comes in to check a monitor. The Secretary's chopper touches down at Fort Linwood while the being lies on a gurney wearing gray hospital pajamas and an oxygen mask. Officials stand at a window overlooking the room as watched closely by Helen. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Mike removes the oxygen mask and offers the being a cup of water which he takes and draws shakily towards him. They all watch him intently. the Secretary taking a step towards him as he uses both hands to steady the plastic beaker. while they all stare. Regina glances at the scientists as Helen steps forward to help him put down the cup noting that he looks just like the climber from 1928. His head swivels towards her. Helen enters a storeroom with shelves full of vials of drugs leans back against the door to compose herself then takes a hypodermic in a sealed packet from a glass cabinet putting it in her pocket and scanning the shelves. The agent hands her a vial which she pockets along with a vial of saline solution then goes to the syringe cabinet opens and closes the door before turning around and holding up the syringe packet for the benefit of the suspicious agent Jaw thrust forward. Regina eyeballs Klaatu and having swapped the two vials Helen approaches him rolls up his sleeve and jabs the hypodermic into his arm. The Defense Secretary watches dispassionately then turns away as Klaatu's dark eyes stare at Helen. Three military policemen surround Helen and escort her from the room as Klaatu glances down at his arm while the agent from the drugstore comes in and they eyeball one another."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Stunned people pick themselves up off the ground as the vast metallicskinned robot stands immobile with the sphere swirling in light and vapor behind it. The visitor's body is rushed to a medical facility on a covered gurney with Helen accompanying it. A sarcophaguslike gurney is wheeled to a prefab hut in a hangar where the protective cover is unsealed. Mike looks baffled while Helen glances at him and his scalpel cuts into the patient's gray gelatinous skin causing the gray skin to come apart as the surgeon drops the bullet into a sample tube. Helen slowly shakes her head as the surgeon wearing a suit that even covers his feet drops lumps of blubbery flesh into a basin. On the operating table the naked slimecovered body of a man curls up into a fetal position and Mike and Helen stare in disbelief. The patient lies under a protective tent attended by a technician before Helen enters the room descending three steps from the gallery area where she was watching and cautiously approaches the tent. She peers in and sees the man's eyes fluttering. The patient begins thrashing around inside the tent and Mike comes in to check a monitor. The Secretary's chopper touches down at Fort Linwood while the being lies on a gurney wearing gray hospital pajamas and an oxygen mask. Officials stand at a window overlooking the room as watched closely by Helen. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Mike removes the oxygen mask and offers the being a cup of water which he takes and draws shakily towards him. They all watch him intently. the Secretary taking a step towards him as he uses both hands to steady the plastic beaker. while they all stare. Regina glances at the scientists as Helen steps forward to help him put down the cup noting that he looks just like the climber from 1928. His head swivels towards her. Helen enters a storeroom with shelves full of vials of drugs leans back against the door to compose herself then takes a hypodermic in a sealed packet from a glass cabinet putting it in her pocket and scanning the shelves. The agent hands her a vial which she pockets along with a vial of saline solution then goes to the syringe cabinet opens and closes the door before turning around and holding up the syringe packet for the benefit of the suspicious agent Jaw thrust forward. Regina eyeballs Klaatu and having swapped the two vials Helen approaches him rolls up his sleeve and jabs the hypodermic into his arm. The Defense Secretary watches dispassionately then turns away as Klaatu's dark eyes stare at Helen. Three military policemen surround Helen and escort her from the room as Klaatu glances down at his arm while the agent from the drugstore comes in and they eyeball one another."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Stunned people pick themselves up off the ground as the vast metallicskinned robot stands immobile with the sphere swirling in light and vapor behind it. The visitor's body is rushed to a medical facility on a covered gurney with Helen accompanying it. A sarcophaguslike gurney is wheeled to a prefab hut in a hangar where the protective cover is unsealed. Mike looks baffled while Helen glances at him and his scalpel cuts into the patient's gray gelatinous skin causing the gray skin to come apart as the surgeon drops the bullet into a sample tube. Helen slowly shakes her head as the surgeon wearing a suit that even covers his feet drops lumps of blubbery flesh into a basin. On the operating table the naked slimecovered body of a man curls up into a fetal position and Mike and Helen stare in disbelief. Helen enters a storeroom with shelves full of vials of drugs leans back against the door to compose herself then takes a hypodermic in a sealed packet from a glass cabinet putting it in her pocket and scanning the shelves. The agent hands her a vial which she pockets along with a vial of saline solution then goes to the syringe cabinet opens and closes the door before turning around and holding up the syringe packet for the benefit of the suspicious agent Jaw thrust forward. Regina eyeballs Klaatu and having swapped the two vials Helen approaches him rolls up his sleeve and jabs the hypodermic into his arm. The Defense Secretary watches dispassionately then turns away as Klaatu's dark eyes stare at Helen. Three military policemen surround Helen and escort her from the room as Klaatu glances down at his arm while the agent from the drugstore comes in and they eyeball one another."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Stunned people pick themselves up off the ground as the vast metallicskinned robot stands immobile with the sphere swirling in light and vapor behind it. The visitor's body is rushed to a medical facility on a covered gurney with Helen accompanying it. A sarcophaguslike gurney is wheeled to a prefab hut in a hangar where the protective cover is unsealed. The Defense Secretary watches dispassionately then turns away as Klaatu's dark eyes stare at Helen. Three military policemen surround Helen and escort her from the room as Klaatu glances down at his arm while the agent from the drugstore comes in and they eyeball one another."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Astonished felines lift themselves up off the couch as the enormous paper-feathered dragon sits inactive with the cube dancing in shadows and mist beside it. The tourist's suitcase is flown to a veterinary lab on a tiny raft, with Lisa trailing it. A coffin-like boat is sailed to a bamboo tent in a garden where the protective tarp is popped open. Tom looks perplexed while Lisa gazes at him, and his paintbrush slices into the sculpture's blue, crusty shell, causing the blue shell to split as the painter flicks the pebble into a test jar. Lisa slowly nods her head as the painter, wearing a cloak that even covers his ears, tosses chunks of rubbery clay into a bucket. On the crafting bench, the stripped, oil-slicked frame of a sculpture folds into a sleeping posture, and Tom and Lisa gawk in disbelief. The statue rests under a transparent dome monitored by a gardener before Lisa enters the garage, ascending five ladders from the workshop area where she was observing, and timidly reaches for the dome. She squints in and sees the sculpture's hands twitching. The statue starts tumbling about inside the dome, and Tom strides in to inspect a telescope. The Mayor's blimp hovers down at Camp Greenfield while the creature reclines on a boat wearing blue parade armor and a snorkel. Scholars stand at a balcony surveying the space as, under Lisa's attentive gaze, Tom lifts the snorkel and presents the creature a jug of tea, which it accepts and drags uncertainly towards itself. They all observe it intensely, the Mayor stepping back from it as it uses both paws to balance the ceramic pitcher, while they all gaze. Diana peers at the programmers as Lisa edges forward to assist it in setting the jug aside, remarking that it resembles the explorer from 1850. Its head pivots towards her. Lisa steps into a warehouse with racks of boxes of herbs, leans against the window to collect herself, then grabs a pipette in a sealed envelope from a metal drawer, slipping it into her purse and browsing the boxes. The spy hands her a box which she slips into her purse alongside a box of scented candles, then approaches the pipette storage, opens, and shuts the window before spinning around and displaying the pipette envelope for the benefit of the skeptical spy. Chin raised upward, Diana scrutinizes Zog, and having exchanged the two boxes, Lisa nears him, lifts his pant leg, and plunges the pipette into his toe. The Justice Overseer observes flatly then spins around as Zog's bright eyes gaze at Lisa. Three security guards encircle Lisa and steer her out of the warehouse as Zog inspects his toe while the spy from the herbal shop enters, and they scrutinize each other."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Stunned individuals rise from the ground as a metallic-skinned robot stands still, with a glowing sphere behind it. The visitor's body is taken to a medical facility, accompanied by Helen. A sarcophagus-like gurney is brought to a hangar, where Helen observes as Mike operates on the patient, revealing gray, gelatinous skin. The patient, resembling a man, curls into a fetal position, leaving Mike and Helen in disbelief. As Helen watches from above, the patient, under a protective tent, shows signs of life. When he thrashes, Mike checks on him. Later, at Fort Linwood, the being lies on a gurney in hospital attire, observed by officials. Helen assists him with a cup of water, noting his resemblance to a climber from 1928. Helen retrieves drugs, takes a hypodermic syringe, and swaps vials before injecting Klaatu, watched by the Defense Secretary. Military police escort Helen out as Klaatu looks at his arm, and an agent enters, exchanging a glance with him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Three military policemen surround Helen and escort her from the room as Klaatu glances down at his arm while the agent from the drugstore comes in and they eyeball one another The Defense Secretary watches dispassionately then turns away as Klaatu's dark eyes stare at Helen Regina eyeballs Klaatu and having swapped the two vials Helen approaches him rolls up his sleeve and jabs the hypodermic into his arm The agent hands her a vial which she pockets along with a vial of saline solution then goes to the syringe cabinet opens and closes the door before turning around and holding up the syringe packet for the benefit of the suspicious agent Jaw thrust forward Helen enters a storeroom with shelves full of vials of drugs leans back against the door to compose herself then takes a hypodermic in a sealed packet from a glass cabinet putting it in her pocket and scanning the shelves His head swivels towards her Regina glances at the scientists as Helen steps forward to help him put down the cup noting that he looks just like the climber from 1928 while they all stare the Secretary taking a step towards him as he uses both hands to steady the plastic beaker They all watch him intently Mike removes the oxygen mask and offers the being a cup of water which he takes and draws shakily towards him Officials stand at a window overlooking the room as watched closely by Helen The Secretary's chopper touches down at Fort Linwood while the being lies on a gurney wearing gray hospital pajamas and an oxygen mask The patient begins thrashing around inside the tent and Mike comes in to check a monitor She peers in and sees the man's eyes fluttering The patient lies under a protective tent attended by a technician before Helen enters the room descending three steps from the gallery area where she was watching and cautiously approaches the tent On the operating table the naked slimecovered body of a man curls up into a fetal position and Mike and Helen stare in disbelief Helen slowly shakes her head as the surgeon wearing a suit that even covers his feet drops lumps of blubbery flesh into a basin Mike looks baffled while Helen glances at him and his scalpel cuts into the patient's gray gelatinous skin causing the gray skin to come apart as the surgeon drops the bullet into a sample tube A sarcophaguslike gurney is wheeled to a prefab hut in a hangar where the protective cover is unsealed The visitor's body is rushed to a medical facility on a covered gurney with Helen accompanying it Stunned people pick themselves up off the ground as the vast metallicskinned robot stands immobile with the sphere swirling in light and vapor behind it"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The visitor's body is rushed to a medical facility on a covered gurney with Helen accompanying it Stunned people pick themselves up off the ground as the vast metallicskinned robot stands immobile with the sphere swirling in light and vapor behind it Mike looks baffled while Helen glances at him and his scalpel cuts into the patient's gray gelatinous skin causing the gray skin to come apart as the surgeon drops the bullet into a sample tube A sarcophaguslike gurney is wheeled to a prefab hut in a hangar where the protective cover is unsealed On the operating table the naked slimecovered body of a man curls up into a fetal position and Mike and Helen stare in disbelief Helen slowly shakes her head as the surgeon wearing a suit that even covers his feet drops lumps of blubbery flesh into a basin She peers in and sees the man's eyes fluttering The patient lies under a protective tent attended by a technician before Helen enters the room descending three steps from the gallery area where she was watching and cautiously approaches the tent The Secretary's chopper touches down at Fort Linwood while the being lies on a gurney wearing gray hospital pajamas and an oxygen mask The patient begins thrashing around inside the tent and Mike comes in to check a monitor Mike removes the oxygen mask and offers the being a cup of water which he takes and draws shakily towards him Officials stand at a window overlooking the room as watched closely by Helen the Secretary taking a step towards him as he uses both hands to steady the plastic beaker They all watch him intently Regina glances at the scientists as Helen steps forward to help him put down the cup noting that he looks just like the climber from 1928 while they all stare Helen enters a storeroom with shelves full of vials of drugs leans back against the door to compose herself then takes a hypodermic in a sealed packet from a glass cabinet putting it in her pocket and scanning the shelves His head swivels towards her Regina eyeballs Klaatu and having swapped the two vials Helen approaches him rolls up his sleeve and jabs the hypodermic into his arm The agent hands her a vial which she pockets along with a vial of saline solution then goes to the syringe cabinet opens and closes the door before turning around and holding up the syringe packet for the benefit of the suspicious agent Jaw thrust forward Three military policemen surround Helen and escort her from the room as Klaatu glances down at his arm while the agent from the drugstore comes in and they eyeball one another The Defense Secretary watches dispassionately then turns away as Klaatu's dark eyes stare at Helen"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Mike removes the oxygen mask and offers the being a cup of water which he takes and draws shakily towards him They all watch him intently the Secretary taking a step towards him as he uses both hands to steady the plastic beaker while they all stare Regina glances at the scientists as Helen steps forward to help him put down the cup noting that he looks just like the climber from 1928 His head swivels towards her Helen enters a storeroom with shelves full of vials of drugs leans back against the door to compose herself then takes a hypodermic in a sealed packet from a glass cabinet putting it in her pocket and scanning the shelves The agent hands her a vial which she pockets along with a vial of saline solution then goes to the syringe cabinet opens and closes the door before turning around and holding up the syringe packet for the benefit of the suspicious agent Jaw thrust forward Regina eyeballs Klaatu and having swapped the two vials Helen approaches him rolls up his sleeve and jabs the hypodermic into his arm The Defense Secretary watches dispassionately then turns away as Klaatu's dark eyes stare at Helen Three military policemen surround Helen and escort her from the room as Klaatu glances down at his arm while the agent from the drugstore comes in and they eyeball one another Stunned people pick themselves up off the ground as the vast metallicskinned robot stands immobile with the sphere swirling in light and vapor behind it The visitor's body is rushed to a medical facility on a covered gurney with Helen accompanying it A sarcophaguslike gurney is wheeled to a prefab hut in a hangar where the protective cover is unsealed Mike looks baffled while Helen glances at him and his scalpel cuts into the patient's gray gelatinous skin causing the gray skin to come apart as the surgeon drops the bullet into a sample tube Helen slowly shakes her head as the surgeon wearing a suit that even covers his feet drops lumps of blubbery flesh into a basin On the operating table the naked slimecovered body of a man curls up into a fetal position and Mike and Helen stare in disbelief The patient lies under a protective tent attended by a technician before Helen enters the room descending three steps from the gallery area where she was watching and cautiously approaches the tent She peers in and sees the man's eyes fluttering The patient begins thrashing around inside the tent and Mike comes in to check a monitor The Secretary's chopper touches down at Fort Linwood while the being lies on a gurney wearing gray hospital pajamas and an oxygen mask Officials stand at a window overlooking the room as watched closely by Helen"
        }
      ]
    }
  ]
}