{
  "ground_truth": "Helen and her escort walk past two agents pushing an empty wheelchair towards Klaatu's room as the lift doors slide open. Inside the lift is Klaatu in a wheelchair with four agents, manacled to the chair, and pushed down a passageway with pipes lining one wall. He's pushed into a room where the agent bringing up the rear checks the passageway before entering and closing the door. The room is large, with a man in glasses sitting at a table covered with electronic equipment, and Klaatu is pushed up to the table. Electrodes are placed around his body and attached to his temples, and the operator activates the polygraph. The agents leave the room and join others standing guard outside at regular intervals along the walls of the corridor. The man studies his equipment as the operator stares at the electronic traces on his flickering screen. Klaatu turns to look at the man, while the polygraph operator stares fixedly at his screen through glasses perched on the end of his nose as his screen blurs and distorts. Needles trace wave patterns on scrolling graph paper, and Klaatu eyes the interrogator steadily. The man returns his stare with a frown, then reaches out to his console, and is thrown backwards by the charge. Half lying under the table, he twitches, then slowly slides back upright, staring blankly. Klaatu focuses his vision down the electrode cables, wiring to a security camera overlooking an agent standing guard, then channels through to another camera and another guard. Two more suited agents walk along the corridor as Klaatu closes his eyes. The agents clamp their hands over their earpieces, and all collapse to the floor in agony. Still seated but wearing a suit, Klaatu looks up as the lights flicker and the power fluctuates all over the building. Helen looks up in alarm, then puts on her coat and grabs the sample of Klaatu's fatty outer skin. The alien, now standing, turns to the catatonic polygraph operator sitting in his underwear, removes the electrodes, and the operator collapses on the table. Klaatu strides down the corridor past the agents who are still writhing in agony while Helen, glancing around warily, runs down a corridor full of shadows cast by the flickering lights. Klaatu enters the lift, walks down a railway line in an industrial area, with flame flaring from a stack at a refinery behind him, and arrives on a railway station platform. In slow motion, he walks alongside a train, then into the busy station concourse. He walks calmly through the teeming crowds and looks up at the departures board where all the trains are delayed. A guy with a beard jostles through the crowd and snatches a ticket from a man's pocket as he brushes past him.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Helen and her companion stroll past two operatives pushing an unoccupied wheelchair towards Klaatu's chamber as the elevator doors glide open. Inside the elevator is Klaatu in a wheelchair with four operatives, shackled to the chair, and propelled down a corridor with pipes lining one partition. He's moved into a chamber where the operative bringing up the rear inspects the corridor before entering and sealing the door. The chamber is expansive, with a man in spectacles seated at a table covered with electronic apparatus, and Klaatu is moved up to the table. Electrodes are placed around his physique and connected to his temples, and the technician activates the lie detector. The operatives exit the chamber and join others standing sentinel outside at regular intervals along the walls of the hallway. The man examines his apparatus as the technician stares at the electronic traces on his flickering display. Klaatu turns to gaze at the man, while the lie detector technician stares fixedly at his display through spectacles perched on the tip of his nose as his display blurs and contorts. Needles trace wave configurations on scrolling graph paper, and Klaatu eyes the interrogator intently. The man returns his gaze with a scowl, then extends to his console, and is hurled backwards by the charge. Half reclining under the table, he twitches, then slowly slides back upright, staring vacantly. Klaatu concentrates his sight down the electrode cables, wiring to a surveillance camera overlooking an operative standing sentinel, then channels through to another camera and another guard. Two more attired operatives stride along the hallway as Klaatu shuts his eyes. The operatives clamp their hands over their earpieces, and all collapse to the floor in torment. Still seated but wearing a suit, Klaatu gazes up as the lights flicker and the power oscillates throughout the structure. Helen gazes up in apprehension, then dons her coat and seizes the specimen of Klaatu's fatty outer layer. The alien, now standing, turns to the catatonic lie detector technician seated in his underwear, detaches the electrodes, and the technician collapses on the table. Klaatu strides down the hallway past the operatives who are still writhing in torment while Helen, glancing around cautiously, dashes down a corridor full of silhouettes cast by the flickering lights. Klaatu enters the elevator, walks down a railway track in an industrial region, with flame flaring from a chimney at a refinery behind him, and arrives on a railway station platform. In slow motion, he walks alongside a train, then into the busy station concourse. He walks calmly through the bustling crowds and gazes up at the departures board where all the trains are delayed. A fellow with a beard jostles through the crowd and snatches a ticket from a man's pocket as he brushes past him."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Helen and her escort walk past two agents as an empty wheelchair is pushed towards Klaatu's room when the lift doors slide open. Inside the lift is Klaatu in a wheelchair with four agents. He is manacled to the chair and agents push him down a passageway with pipes lining one wall. A room is entered where the passageway is checked by the agent bringing up the rear before he enters and closes the door. The room is large, and a man in glasses sits at a table covered with electronic equipment, to which Klaatu is pushed up. Electrodes are placed around his body and attached to his temples, and the polygraph is activated by the operator. The agents leave the room and they join others who stand guard outside at regular intervals along the walls of the corridor. His equipment is studied by the man as the electronic traces on his flickering screen are stared at by the operator. Klaatu turns to look at the man, while the polygraph screen is stared at fixedly by the operator through glasses perched on the end of his nose as the screen blurs and distorts. Wave patterns are traced by needles on scrolling graph paper, and the interrogator is eyed steadily by Klaatu. The man's stare is returned with a frown, then he reaches out to his console, and the charge throws him backwards. Under the table, he twitches half-lying, then slowly slides back upright, staring blankly. The electrode cables are focused on by Klaatu as he wires to a security camera overlooking an agent standing guard, then channels through to another camera and another guard. Two more suited agents walk along the corridor as Klaatu closes his eyes. Their hands are clamped over their earpieces by the agents, and all collapse to the floor in agony. Still seated but wearing a suit, Klaatu looks up as the lights flicker and the power fluctuates all over the building. Helen looks up in alarm, then her coat is put on and she grabs the sample of Klaatu's fatty outer skin. The alien, now standing, turns to the polygraph operator sitting catatonically in his underwear, removes the electrodes, and collapses the operator on the table. Klaatu strides down the corridor past the agents who writhe still in agony while Helen, glancing around warily, runs down a corridor full of shadows cast by the flickering lights. The lift is entered by Klaatu, he walks down a railway line in an industrial area, with flame flaring from a stack at a refinery behind him, and a railway station platform is arrived at by him. He walks alongside a train in slow motion, then enters the busy station concourse. The teeming crowds are walked through calmly by him and the departures board, where all the trains are delayed, is looked up at. A guy with a beard jostles through the crowd and a ticket is snatched from a man's pocket as he brushes past him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Helen and her escort pass two agents pushing an empty wheelchair toward Klaatu's room as the lift doors open. Inside, Klaatu is in a wheelchair, manacled, with four agents, and pushed down a passageway lined with pipes. He's taken into a large room where an agent checks the passageway before closing the door. A man in glasses sits at a table with electronic equipment, and Klaatu is positioned at the table. Electrodes are attached to his body and temples, and the polygraph is activated. The agents leave to join others guarding the corridor. The man studies his equipment while the operator watches the screen. Klaatu looks at the man, and the operator focuses on his screen as it blurs. Needles trace patterns on graph paper, and Klaatu stares at the interrogator, who frowns and is thrown back by a charge. He twitches under the table, then sits upright, staring blankly. Klaatu channels his vision through electrode cables to security cameras, affecting guards. Two agents walk the corridor as Klaatu closes his eyes, causing the agents to collapse in agony. Klaatu, in a suit, looks up as lights flicker and power fluctuates. Helen, alarmed, puts on her coat and grabs Klaatu's skin sample. The alien stands, removes electrodes from the catatonic operator, who collapses. Klaatu walks past writhing agents while Helen runs down a shadowy corridor. Klaatu enters the lift, walks along a railway line in an industrial area, and arrives at a station platform. In slow motion, he walks alongside a train into the busy station concourse, calmly moving through crowds. He looks at the departures board showing all trains delayed. A bearded man jostles through the crowd, snatching a ticket from another man's pocket."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Helen and her escort pass two agents pushing an empty wheelchair as the lift doors open. Inside, Klaatu is manacled in a wheelchair with four agents, pushed down a passageway lined with pipes. He's taken to a large room with a man in glasses at a table with electronic equipment. Electrodes are attached to Klaatu, and the polygraph is activated. The agents leave to guard the corridor. The man studies the equipment while the operator watches the screen. Klaatu stares at the man, who frowns and is thrown back by a charge. He twitches, then sits upright, staring blankly. Klaatu focuses on the security cameras, causing agents to collapse in agony. Seated, Klaatu looks up as the building's power fluctuates. Helen, alarmed, grabs Klaatu's skin sample. Klaatu stands, removes the electrodes from the catatonic operator, and walks past the writhing agents. Helen runs down a shadowy corridor. Klaatu enters the lift, walks along a railway line, and arrives at a station platform. In slow motion, he walks through the busy concourse, looking at the delayed departures board. A bearded man jostles through the crowd, stealing a ticket from another man's pocket."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Helen and her escort make their way past two agents who are busily pushing an empty wheelchair in the direction of Klaatu's room just as the lift doors smoothly slide open. Inside the lift, Klaatu is seated in a wheelchair, surrounded by four agents. He is securely manacled to the chair, and they proceed to push him down a long passageway, where pipes are neatly lining one of the walls. Klaatu is wheeled into a spacious room, and the agent at the rear takes a moment to check the passageway before stepping inside and closing the door behind him. The room is quite large, and a man wearing glasses is seated at a table that is covered with various pieces of electronic equipment. Klaatu is positioned right up to the table, and electrodes are carefully placed around his body and attached to his temples. The operator then activates the polygraph machine. The agents exit the room and join others who are standing guard outside, positioned at regular intervals along the corridor walls. The man with glasses intently studies his equipment while the operator focuses on the electronic traces flickering on his screen. Klaatu turns his gaze towards the man, and the polygraph operator continues to stare fixedly at his screen through glasses perched precariously on the end of his nose, even as the screen blurs and distorts. Needles trace intricate wave patterns on the scrolling graph paper, and Klaatu maintains a steady gaze at the interrogator. The man returns Klaatu's stare with a frown, then reaches out to his console, only to be violently thrown backwards by a sudden charge. Half lying under the table, he twitches momentarily, then slowly slides back upright, staring blankly ahead. Klaatu focuses his vision down the electrode cables, tracing the wiring to a security camera that overlooks an agent standing guard. He then channels through to another camera and another guard. Two more agents, dressed in suits, walk along the corridor as Klaatu closes his eyes. The agents clamp their hands over their earpieces, and all of them collapse to the floor, writhing in agony. Still seated but wearing a suit, Klaatu looks up as the lights flicker and the power fluctuates throughout the entire building. Helen, alarmed by the situation, looks up, then quickly puts on her coat and grabs the sample of Klaatu's fatty outer skin. The alien, now standing, turns his attention to the catatonic polygraph operator, who is sitting in his underwear. Klaatu removes the electrodes, and the operator collapses onto the table. Klaatu strides confidently down the corridor, passing by the agents who are still writhing in agony, while Helen, glancing around warily, runs down a corridor filled with shadows cast by the flickering lights. Klaatu enters the lift, then walks down a railway line in an industrial area, with flames flaring dramatically from a stack at a nearby refinery behind him. He arrives at a railway station platform. In slow motion, he walks alongside a train and then enters the bustling station concourse. He moves calmly through the teeming crowds and looks up at the departures board, where all the trains are marked as delayed. A man with a beard jostles his way through the crowd and deftly snatches a ticket from another man's pocket as he brushes past him."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Helen and her escort make their way down the corridor, moving past a pair of agents who are busily maneuvering an empty wheelchair toward Klaatu's room, precisely as the lift doors smoothly slide open with a quiet whoosh. Once inside the lift, Klaatu is seated in a wheelchair, his presence surrounded by four attentive agents. He is securely fastened to the chair with manacles, and they proceed to guide him down a long, dimly lit passageway, where pipes are neatly and uniformly lining one of the sturdy walls. Klaatu is wheeled into a large room that feels spacious, and the agent at the rear pauses for a brief moment to scrutinize the passageway before stepping inside and shutting the door with a decisive thud. The room is considerably large, and there, a man wearing glasses is seated at a table that is thoroughly covered with a variety of electronic equipment. Klaatu is positioned directly up to the table, and electrodes are carefully and precisely placed around his body and specifically attached to his temples. The operator then proceeds to activate the polygraph machine with deliberate intent. The agents exit the room in an orderly manner, joining others who are vigilantly standing guard outside, each positioned at regular intervals along the neatly maintained corridor walls. The man with glasses intently studies his intricate equipment, while the operator maintains a focused gaze on the electronic traces flickering on his screen. Klaatu slowly turns his gaze towards the man, as the polygraph operator continues to stare fixedly at his screen, glasses precariously perched on the very edge of his nose, even as the screen begins to blur and distort. Needles trace intricate and meticulous wave patterns on the scrolling graph paper, while Klaatu maintains a steady and unwavering gaze at the interrogator. The man returns Klaatu's intense stare with a frown, then reaches out towards his console, only to be violently thrown backwards by an unexpected and sudden charge. Half lying under the table, he twitches momentarily, then gradually slides back upright, staring blankly and vacantly ahead. Klaatu focuses his vision along the electrode cables, tracing the intricate wiring to a security camera that surveys an agent standing guard. He then channels his focus through to another camera and, subsequently, another guard. Two more agents, clad in sharp suits, walk briskly along the corridor as Klaatu closes his eyes with intentional calm. The agents suddenly clamp their hands tightly over their earpieces, and all of them collapse to the floor, writhing and contorting in agony. Still seated yet wearing a suit, Klaatu looks upwards thoughtfully as the lights flicker unpredictably, and the power fluctuates throughout the entire building. Helen, alarmed and startled by the unfolding situation, looks upwards, then hastily puts on her coat and urgently grabs the sample of Klaatu's fatty outer skin. The alien, now standing, directs his attention to the now catatonic polygraph operator, who sits helplessly in his underwear. Klaatu removes the electrodes carefully, and the operator slumps helplessly onto the table. Klaatu strides with confident determination down the corridor, passing by the agents who remain writhing in agony, while Helen, casting furtive glances around, runs hurriedly down a corridor filled with ominous shadows cast by the flickering lights. Klaatu enters the lift with purposeful strides, then seamlessly transitions to walking down a railway line set in an industrial area, with flames flaring dramatically from a tall stack at a nearby refinery behind him, painting a vivid backdrop. He arrives at a railway station platform with a sense of purpose. Moving in slow motion, he walks alongside a train, then enters the bustling and energetic station concourse. He proceeds calmly through the teeming crowds, his demeanor unruffled, and looks upwards at the departures board, where frustratingly all the trains are marked as delayed. A man with a beard, navigating the crowd with purpose, deftly jostles his way through and skillfully snatches a ticket from another man's pocket as he brushes past him, vanishing into the anonymity of the throng."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As Helen and her escort make their way down the corridor, they pass by two agents who are steadily pushing an empty wheelchair towards Klaatu's room. At that moment, the lift doors slide open to reveal Klaatu seated in a wheelchair, surrounded by four agents. He is securely manacled to the chair, and the group proceeds to push him down a passageway where pipes run along one wall. Upon reaching a designated room, Klaatu is wheeled inside, and the agent at the rear takes a moment to scan the passageway for any activity before stepping in and closing the door behind him. The room is spacious, dominated by a table laden with electronic equipment, where a man in glasses is seated. Klaatu is positioned in front of this table, and electrodes are meticulously placed around his body, with some attached to his temples. The operator then activates the polygraph machine. The agents exit the room, leaving Klaatu with the man and the operator, and they join others who are stationed at regular intervals along the corridor walls, maintaining a vigilant guard. Inside, the man intently examines his equipment while the operator focuses on the electronic traces flickering across his screen. Klaatu turns his gaze towards the man, who is absorbed in the data, while the operator, with glasses perched on the end of his nose, stares fixedly at his screen, which begins to blur and distort. Needles on the polygraph trace wave patterns onto scrolling graph paper as Klaatu maintains a steady gaze at the interrogator. The man, meeting Klaatu's stare with a frown, reaches out to his console, only to be violently thrown backwards by an unexpected charge. He ends up half-lying under the table, twitching momentarily before slowly sliding back upright, his expression now blank and vacant. Klaatu then concentrates his vision down the electrode cables, tracing the wiring to a security camera that overlooks an agent standing guard. He extends his focus through to another camera and another guard. Meanwhile, two more agents in suits walk along the corridor as Klaatu closes his eyes. Suddenly, the agents clamp their hands over their earpieces and collapse to the floor, writhing in agony. Still seated but now wearing a suit, Klaatu looks up as the lights flicker and the power fluctuates throughout the building. Helen, noticing the disturbance, looks up in alarm, quickly dons her coat, and grabs a sample of Klaatu's fatty outer skin. The alien, now standing, turns his attention to the catatonic polygraph operator, who is sitting in his underwear. Klaatu removes the electrodes, causing the operator to collapse onto the table. Klaatu then strides confidently down the corridor, passing by the agents who continue to writhe in pain, while Helen, casting wary glances around her, runs down a corridor filled with shadows cast by the flickering lights. Klaatu enters the lift and subsequently walks down a railway line in an industrial area, with flames flaring from a stack at a nearby refinery. He arrives at a railway station platform and, in slow motion, walks alongside a train before entering the bustling station concourse. Moving calmly through the teeming crowds, he looks up at the departures board, noting that all the trains are delayed. Amidst the crowd, a man with a beard jostles his way through, deftly snatching a ticket from another man's pocket as he brushes past him."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Helen and her escort pass two agents pushing an empty wheelchair as they approach Klaatu's room. Klaatu, manacled to a wheelchair, is escorted by four agents through a passageway lined with pipes and into a large room. There, a man with glasses sits at a table filled with electronic equipment, and Klaatu is positioned in front of him. Electrodes are attached to Klaatu, and the polygraph is activated. The agents exit, joining others stationed along the corridor. The man monitors the equipment while the operator focuses on the polygraph screen. Klaatu meets the man's gaze, who frowns and reaches for his console, only to be thrown back by a charge. He recovers, staring blankly. Klaatu channels his focus through the electrode cables to security cameras, affecting the guards. As Klaatu closes his eyes, the agents clutch their earpieces and collapse in pain. Klaatu, now standing, removes the electrodes from the catatonic operator, who collapses. He strides down the corridor past the incapacitated agents, while Helen, alarmed by the flickering lights, dons her coat and takes a sample of Klaatu's skin. Klaatu enters a lift, walks through an industrial area, and arrives at a railway station platform. In slow motion, he moves alongside a train and into the bustling station concourse, where he observes the delayed departures board. Meanwhile, a bearded man stealthily steals a ticket from another man's pocket in the crowd."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Helen and her escort walk past two agents pushing an empty wheelchair towards Klaatu's room as the lift doors slide open, revealing the high-security facility's strict surveillance protocols. Inside the lift is Klaatu in a wheelchair with four agents, manacled to the chair, and pushed down a passageway with pipes lining one wall, reminiscent of utilitarian designs often found in military or research installations. He's pushed into a room where the agent bringing up the rear checks the passageway for any unauthorized personnel before entering and closing the door. The room is large, with a man in glasses sitting at a table covered with cutting-edge electronic equipment of the sort used for advanced interrogation techniques, and Klaatu is pushed up to the table. Electrodes are placed around his body and attached to his temples, reminiscent of the early polygraph machines used to detect deception through physiological responses, and the operator activates the polygraph. The agents leave the room and join others standing guard outside at regular intervals along the walls of the corridor, maintaining a heightened level of vigilance typical in high-risk situations. The man studies his equipment as the operator stares at the electronic traces on his flickering screen, keenly analyzing fluctuations for signs of distress or deception. Klaatu turns to look at the man, while the polygraph operator stares fixedly at his screen through glasses perched on the end of his nose, a common sight among those engrossed in their work, as his screen blurs and distorts. Needles trace wave patterns on scrolling graph paper, capturing physiological data over time, and Klaatu eyes the interrogator steadily. The man returns his stare with a frown, then reaches out to his console, unknowingly triggering a defensive mechanism, and is thrown backwards by the charge. Half lying under the table, he twitches, then slowly slides back upright, staring blankly as if in shock. Klaatu focuses his vision down the electrode cables, establishing a mental link to a security camera overlooking an agent standing guard, then channels through to another camera and another guard, demonstrating an advanced form of neural interfacing. Two more suited agents walk along the corridor as Klaatu closes his eyes, indicating a concentration of his mental abilities. The agents clamp their hands over their earpieces, reacting to a sudden, disabling auditory disturbance, and all collapse to the floor in agony. Still seated but wearing a suit, Klaatu looks up as the lights flicker and the power fluctuates all over the building, hinting at the strain placed on the electrical system by his actions. Helen looks up in alarm, then puts on her coat and grabs the sample of Klaatu's fatty outer skin, crucial evidence of his extraterrestrial origin. The alien, now standing, turns to the catatonic polygraph operator sitting in his underwear, removes the electrodes, and the operator collapses on the table, likely a result of mental overload. Klaatu strides down the corridor past the agents who are still writhing in agony while Helen, glancing around warily, runs down a corridor full of shadows cast by the flickering lights, which create an eerie and tense atmosphere. Klaatu enters the lift, walks down a railway line in an industrial area, with flame flaring from a stack at a refinery behind him, a common sight in regions known for heavy industry, and arrives on a railway station platform. In slow motion, he walks alongside a train, then into the busy station concourse. He walks calmly through the teeming crowds and looks up at the departures board where all the trains are delayed, indicating a wider disruption possibly caused by earlier power fluctuations. A guy with a beard jostles through the crowd and snatches a ticket from a man's pocket as he brushes past him, a common occurrence in bustling areas where pickpockets can easily blend in."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Helen and her escort walk past two agents pushing an empty wheelchair towards Klaatu's room as the lift doors slide open. Inside the lift is Klaatu in a wheelchair with four agents manacled to the chair and pushed down a passageway with pipes lining one wall. He is pushed into a room where the agent bringing up the rear checks the passageway before entering and closing the door. The room is large with a man in glasses sitting at a table covered with electronic equipment and Klaatu is pushed up to the table. Electrodes are placed around his body and attached to his temples and the operator activates the polygraph. The agents leave the room and join others standing guard outside at regular intervals along the walls of the corridor. The man studies his equipment as the operator stares at the electronic traces on his flickering screen. Klaatu turns to look at the man while the polygraph operator stares fixedly at his screen through glasses perched on the end of his nose as his screen blurs and distorts. Needles trace wave patterns on scrolling graph paper and Klaatu eyes the interrogator steadily. The man returns his stare with a frown then reaches out to his console and is thrown backwards by the charge. Half lying under the table he twitches then slowly slides back upright staring blankly. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Klaatu focuses his vision down the electrode cables wiring to a security camera overlooking an agent standing guard then channels through to another camera and another guard. Two more suited agents walk along the corridor as Klaatu closes his eyes. The agents clamp their hands over their earpieces and all collapse to the floor in agony. Still seated but wearing a suit Klaatu looks up as the lights flicker and the power fluctuates all over the building. Helen looks up in alarm then puts on her coat and grabs the sample of Klaatu's fatty outer skin. The alien now standing turns to the catatonic polygraph operator sitting in his underwear removes the electrodes and the operator collapses on the table. Klaatu strides down the corridor past the agents who are still writhing in agony while Helen glancing around warily runs down a corridor full of shadows cast by the flickering lights. Klaatu enters the lift walks down a railway line in an industrial area with flame flaring from a stack at a refinery behind him and arrives on a railway station platform. In slow motion he walks alongside a train then into the busy station concourse. He walks calmly through the teeming crowds and looks up at the departures board where all the trains are delayed. A guy with a beard jostles through the crowd and snatches a ticket from a man's pocket as he brushes past him."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Helen and her escort walk past two agents pushing an empty wheelchair towards Klaatu's room as the lift doors slide open. Inside the lift is Klaatu in a wheelchair with four agents manacled to the chair and pushed down a passageway with pipes lining one wall. He is pushed into a room where the agent bringing up the rear checks the passageway before entering and closing the door. The room is large with a man in glasses sitting at a table covered with electronic equipment and Klaatu is pushed up to the table. Electrodes are placed around his body and attached to his temples and the operator activates the polygraph. The agents leave the room and join others standing guard outside at regular intervals along the walls of the corridor. The man studies his equipment as the operator stares at the electronic traces on his flickering screen. Klaatu turns to look at the man while the polygraph operator stares fixedly at his screen through glasses perched on the end of his nose as his screen blurs and distorts. Needles trace wave patterns on scrolling graph paper and Klaatu eyes the interrogator steadily. The man returns his stare with a frown then reaches out to his console and is thrown backwards by the charge. Half lying under the table he twitches then slowly slides back upright staring blankly. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Klaatu focuses his vision down the electrode cables wiring to a security camera overlooking an agent standing guard then channels through to another camera and another guard. Two more suited agents walk along the corridor as Klaatu closes his eyes. The agents clamp their hands over their earpieces and all collapse to the floor in agony. Still seated but wearing a suit Klaatu looks up as the lights flicker and the power fluctuates all over the building. Helen looks up in alarm then puts on her coat and grabs the sample of Klaatu's fatty outer skin. The alien now standing turns to the catatonic polygraph operator sitting in his underwear removes the electrodes and the operator collapses on the table. Klaatu strides down the corridor past the agents who are still writhing in agony while Helen glancing around warily runs down a corridor full of shadows cast by the flickering lights. Klaatu enters the lift walks down a railway line in an industrial area with flame flaring from a stack at a refinery behind him and arrives on a railway station platform. In slow motion he walks alongside a train then into the busy station concourse. He walks calmly through the teeming crowds and looks up at the departures board where all the trains are delayed. A guy with a beard jostles through the crowd and snatches a ticket from a man's pocket as he brushes past him."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Helen and her escort walk past two agents pushing an empty wheelchair towards Klaatu's room as the lift doors slide open. Inside the lift is Klaatu in a wheelchair with four agents manacled to the chair and pushed down a passageway with pipes lining one wall. He is pushed into a room where the agent bringing up the rear checks the passageway before entering and closing the door. The room is large with a man in glasses sitting at a table covered with electronic equipment and Klaatu is pushed up to the table. Electrodes are placed around his body and attached to his temples and the operator activates the polygraph. The agents leave the room and join others standing guard outside at regular intervals along the walls of the corridor. Klaatu strides down the corridor past the agents who are still writhing in agony while Helen glancing around warily runs down a corridor full of shadows cast by the flickering lights. Klaatu enters the lift walks down a railway line in an industrial area with flame flaring from a stack at a refinery behind him and arrives on a railway station platform. In slow motion he walks alongside a train then into the busy station concourse. He walks calmly through the teeming crowds and looks up at the departures board where all the trains are delayed. A guy with a beard jostles through the crowd and snatches a ticket from a man's pocket as he brushes past him."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Helen and her escort walk past two agents pushing an empty wheelchair towards Klaatu's room as the lift doors slide open. Inside the lift is Klaatu in a wheelchair with four agents manacled to the chair and pushed down a passageway with pipes lining one wall. He is pushed into a room where the agent bringing up the rear checks the passageway before entering and closing the door. He walks calmly through the teeming crowds and looks up at the departures board where all the trains are delayed. A guy with a beard jostles through the crowd and snatches a ticket from a man's pocket as he brushes past him."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Lila and her chauffeur drift beyond two artists dragging a silent canoe towards Zog's cave as the gate hinges swing shut. Within the gate is Zog in a hammock with six artists, chained to the hammock, and hoisted up a staircase with vines crowning one ceiling. She's hoisted into a cave where the artist monitoring the tail inspects the staircase before joining and sealing the gate. The cave is narrow, with a woman in a hat reclining at a desk piled with culinary tools, and Zog is hoisted next to the desk. Magnets are hung around its torso and fastened to its knees, and the cook deactivates the telescope. The artists exit the cave and join musicians assembling watch inside at random moments along the ceilings of the hallway. The woman examines her tools as the cook blinks at the culinary drawings on his glowing mural. Zog swivels to gaze at the woman, while the telescope cook blinks completely at his mural through spectacles dangling on the edge of his chin as his mural sharpens and clears. Pencils etch burst designs on flowing canvas sheet, and Zog glares at the analyst calmly. The woman returns its glare with a cheer, then tugs over to her shelf, and is lifted forwards by the breeze. Half standing above the desk, she jolts, then suddenly rolls down sideways, grinning cheerfully. Zog diverts its hearing up the magnet strands, threading to a radio tower overseeing an artist assembling watch, then directs beyond to another tower and another artist. Four additional cloaked artists drift within the hallway as Zog opens its ears. The artists lock their feet over their belts, and all ascend to the ceiling in euphoria. Still reclining but donning a cloak, Zog gazes down as the walls glow and the heat stabilizes throughout the planet. Lila gazes down in delight, then removes her hat and places down the fragment of Zog's stone-like inner core. The creature, now reclining, swivels to the energetic telescope cook cloaking in his overalls, attaches the magnets, and the cook ascends under the desk. Zog sprints within the hallway beyond the artists who are still stretching in euphoria while Lila, peering below cautiously, jogs within a hallway devoid of shadows dissolved by the glowing walls. Zog exits the gate, sprints within a waterfall path in an agricultural zone, with mist veiling from a field at a vineyard before it, and departs on a waterfall chasm embankment. In rapid motion, it sprints above a boat, then into the vacant chasm gallery. It sprints anxiously through the tranquil corridors and gazes down at the letters board where none of the boats are departing. A girl with bangs nudges within the corridor and drops a map from a woman's backpack as she leaps beside her."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Helen and her escort pass two agents with an empty wheelchair as an elevator opens to reveal Klaatu in a wheelchair, manacled and escorted by four agents. They enter a room where a man with glasses and electronic equipment awaits. Electrodes are placed on Klaatu, and a polygraph is activated. The agents exit, leaving Klaatu with the man and the polygraph operator. As the operator watches the screen, the man frowns at Klaatu, who retaliates, causing the man to jolt back due to a charge. Klaatu mentally manipulates security cameras, incapacitating agents in the corridor. As lights flicker and power fluctuates, Helen grabs a sample of Klaatu's skin and dons her coat. Klaatu, free of electrodes, leaves the room past agonized agents and joins Helen as she moves through the shadowed corridor. Klaatu exits the building, walks along railway tracks, and reaches a station platform. He moves through the station's crowd and observes delayed trains on the departures board, while a man pickpockets a ticket in the bustling concourse."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "A guy with a beard jostles through the crowd and snatches a ticket from a man's pocket as he brushes past him He walks calmly through the teeming crowds and looks up at the departures board where all the trains are delayed  In slow motion he walks alongside a train then into the busy station concourse  Klaatu enters the lift walks down a railway line in an industrial area with flame flaring from a stack at a refinery behind him and arrives on a railway station platform  Klaatu strides down the corridor past the agents who are still writhing in agony while Helen glancing around warily runs down a corridor full of shadows cast by the flickering lights  The alien now standing turns to the catatonic polygraph operator sitting in his underwear removes the electrodes and the operator collapses on the table  Helen looks up in alarm then puts on her coat and grabs the sample of Klaatu's fatty outer skin  Still seated but wearing a suit Klaatu looks up as the lights flicker and the power fluctuates all over the building  The agents clamp their hands over their earpieces and all collapse to the floor in agony  Two more suited agents walk along the corridor as Klaatu closes his eyes  Klaatu focuses his vision down the electrode cables wiring to a security camera overlooking an agent standing guard then channels through to another camera and another guard  Half lying under the table he twitches then slowly slides back upright staring blankly  The man returns his stare with a frown then reaches out to his console and is thrown backwards by the charge  Needles trace wave patterns on scrolling graph paper and Klaatu eyes the interrogator steadily  Klaatu turns to look at the man while the polygraph operator stares fixedly at his screen through glasses perched on the end of his nose as his screen blurs and distorts  The man studies his equipment as the operator stares at the electronic traces on his flickering screen  The agents leave the room and join others standing guard outside at regular intervals along the walls of the corridor  Electrodes are placed around his body and attached to his temples and the operator activates the polygraph  The room is large with a man in glasses sitting at a table covered with electronic equipment and Klaatu is pushed up to the table  He's pushed into a room where the agent bringing up the rear checks the passageway before entering and closing the door  Inside the lift is Klaatu in a wheelchair with four agents manacled to the chair and pushed down a passageway with pipes lining one wall  Helen and her escort walk past two agents pushing an empty wheelchair towards Klaatu's room as the lift doors slide open "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Inside the lift is Klaatu in a wheelchair with four agents manacled to the chair and pushed down a passageway with pipes lining one wall Helen and her escort walk past two agents pushing an empty wheelchair towards Klaatu's room as the lift doors slide open The room is large with a man in glasses sitting at a table covered with electronic equipment and Klaatu is pushed up to the table He is pushed into a room where the agent bringing up the rear checks the passageway before entering and closing the door The agents leave the room and join others standing guard outside at regular intervals along the walls of the corridor Electrodes are placed around his body and attached to his temples and the operator activates the polygraph Klaatu turns to look at the man while the polygraph operator stares fixedly at his screen through glasses perched on the end of his nose as his screen blurs and distorts The man studies his equipment as the operator stares at the electronic traces on his flickering screen The man returns his stare with a frown then reaches out to his console and is thrown backwards by the charge Needles trace wave patterns on scrolling graph paper and Klaatu eyes the interrogator steadily Klaatu focuses his vision down the electrode cables wiring to a security camera overlooking an agent standing guard then channels through to another camera and another guard Half lying under the table he twitches then slowly slides back upright staring blankly The agents clamp their hands over their earpieces and all collapse to the floor in agony Two more suited agents walk along the corridor as Klaatu closes his eyes Helen looks up in alarm then puts on her coat and grabs the sample of Klaatu's fatty outer skin Still seated but wearing a suit Klaatu looks up as the lights flicker and the power fluctuates all over the building Klaatu strides down the corridor past the agents who are still writhing in agony while Helen glancing around warily runs down a corridor full of shadows cast by the flickering lights The alien now standing turns to the catatonic polygraph operator sitting in his underwear removes the electrodes and the operator collapses on the table In slow motion he walks alongside a train then into the busy station concourse Klaatu enters the lift walks down a railway line in an industrial area with flame flaring from a stack at a refinery behind him and arrives on a railway station platform A guy with a beard jostles through the crowd and snatches a ticket from a man's pocket as he brushes past him He walks calmly through the teeming crowds and looks up at the departures board where all the trains are delayed"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Klaatu focuses his vision down the electrode cables wiring to a security camera overlooking an agent standing guard then channels through to another camera and another guard  Two more suited agents walk along the corridor as Klaatu closes his eyes  The agents clamp their hands over their earpieces and all collapse to the floor in agony  Still seated but wearing a suit Klaatu looks up as the lights flicker and the power fluctuates all over the building  Helen looks up in alarm then puts on her coat and grabs the sample of Klaatu's fatty outer skin  The alien now standing turns to the catatonic polygraph operator sitting in his underwear removes the electrodes and the operator collapses on the table  Klaatu strides down the corridor past the agents who are still writhing in agony while Helen glancing around warily runs down a corridor full of shadows cast by the flickering lights  Klaatu enters the lift walks down a railway line in an industrial area with flame flaring from a stack at a refinery behind him and arrives on a railway station platform  In slow motion he walks alongside a train then into the busy station concourse  He walks calmly through the teeming crowds and looks up at the departures board where all the trains are delayed  A guy with a beard jostles through the crowd and snatches a ticket from a man's pocket as he brushes past him Helen and her escort walk past two agents pushing an empty wheelchair towards Klaatu's room as the lift doors slide open  Inside the lift is Klaatu in a wheelchair with four agents manacled to the chair and pushed down a passageway with pipes lining one wall  He's pushed into a room where the agent bringing up the rear checks the passageway before entering and closing the door  The room is large with a man in glasses sitting at a table covered with electronic equipment and Klaatu is pushed up to the table  Electrodes are placed around his body and attached to his temples and the operator activates the polygraph  The agents leave the room and join others standing guard outside at regular intervals along the walls of the corridor  The man studies his equipment as the operator stares at the electronic traces on his flickering screen  Klaatu turns to look at the man while the polygraph operator stares fixedly at his screen through glasses perched on the end of his nose as his screen blurs and distorts  Needles trace wave patterns on scrolling graph paper and Klaatu eyes the interrogator steadily  The man returns his stare with a frown then reaches out to his console and is thrown backwards by the charge  Half lying under the table he twitches then slowly slides back upright staring blankly "
        }
      ]
    }
  ]
}