{
  "ground_truth": "The Previa cruises slowly into the Loring's fancy gated community, where Mark and Vanessa Loring have an impressive, though generic McMansion. The entire yard is unlandscaped soil, and Mac pulls over and parks on the curb. Both look mortified as they wait for someone to greet them, until Vanessa, a pretty, meticulous woman in her early thirties, opens the door and awkwardly leads them into her home. Juno takes off her hooded sweatshirt and thrusts it into Vanessa's arms, who sets it on a bench. Mark Loring, a boyishly attractive guy in his mid-thirties, appears next to Vanessa and glances sheepishly at her upon hearing the Penny Saver mention, then extends his hand to Mac and Juno. Mac seizes Mark's hand and pumps it heartily. Mark and Vanessa usher Juno and Mac into the austere, spacious living room, where a woman in a business suit sits on the couch with a briefcase in her lap. Vanessa is clearly ecstatic as Mark and Juno lock eyes, and Juno holds her wrist up to Mark's twitching nostrils, which he inhales. Juno is staring into a room with the door slightly ajar, revealing guitars mounted on the wall and the edges of posters. Meanwhile, Vanessa, Mac, and Gerta Rauss are waiting in awkward silence for Juno and Mark to return, and Mac notices a brand new Pilates machine sitting in its packaging in a corner of the room. Vanessa and Gerta have no response, and Vanessa looks to the ceiling, while Mark and Juno tool around on the guitars unplugged, playing little riffs. Mark seems visibly embarrassed by Vanessa's manic demeanor. Juno and Mac have put their coats on and are in the process of leaving, with Vanessa and Mark trailing behind as Mac stares at Juno gravely. Juno looks at Mark, and then she and Mac exit, with Mark shutting the door. The track team jogs in formation, leaving tracks in the snow, while Bleeker runs alone on the track. Bleeker's friend Vijay, a solemn, skinny boy much like Bleeker, jogs up alongside him, commenting that those bastards never stop running before jogging off. Bleeker stops and wipes away his sweat. We're then looking over Juno's now five-month pregnant belly to a school administrator filling out a slip, which Juno takes and turns around smiling all the way out. Juno exits the head office and bumps into Bleeker. Later, the monitor reveals the baby's head, and Juno, Leah, and Bren become immediately defensive, with Bren gesturing to the ultrasound monitor before the ultrasound tech exits in a huff. Juno lays in bed checking out the ultrasound printout. The Previa drives into the front gate of Mark and Vanessa's exclusive community, and Juno rings the doorbell, shifting her weight in the cold, until Mark, dressed in a t-shirt and jeans, answers the door.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The Previa glides slowly into the Loring's elegant enclosed neighborhood, where Mark and Vanessa Loring possess an impressive, albeit standard McMansion. The entire lawn is unlandscaped earth, and Mac pulls over and parks on the verge. Both appear mortified as they await someone to welcome them, until Vanessa, a pretty, meticulous lady in her early thirties, opens the door and awkwardly leads them into her residence. Juno removes her hooded sweatshirt and thrusts it into Vanessa's arms, who places it on a bench. Mark Loring, a boyishly handsome fellow in his mid-thirties, materializes next to Vanessa and glances sheepishly at her upon hearing the Penny Saver reference, then extends his hand to Mac and Juno. Mac grasps Mark's hand and pumps it vigorously. Mark and Vanessa usher Juno and Mac into the austere, spacious living room, where a woman in a business suit perches on the couch with a briefcase in her lap. Vanessa is clearly ecstatic as Mark and Juno lock eyes, and Juno holds her wrist up to Mark's twitching nostrils, which he inhales. Juno is staring into a chamber with the door slightly ajar, revealing guitars mounted on the wall and the edges of posters. Meanwhile, Vanessa, Mac, and Gerta Rauss are waiting in awkward silence for Juno and Mark to return, and Mac notices a brand-new Pilates apparatus sitting in its packaging in a corner of the room. Vanessa and Gerta have no response, and Vanessa looks to the ceiling, while Mark and Juno tool around on the guitars unplugged, playing little riffs. Mark seems visibly embarrassed by Vanessa's manic demeanor. Juno and Mac have put their coats on and are in the process of departing, with Vanessa and Mark trailing behind as Mac stares at Juno gravely. Juno looks at Mark, and then she and Mac exit, with Mark closing the door. The track team jogs in formation, leaving marks in the snow, while Bleeker runs alone on the track. Bleeker's friend Vijay, a solemn, skinny boy much like Bleeker, jogs up alongside him, commenting that those bastards never stop running before jogging off. Bleeker halts and wipes away his sweat. We're then looking over Juno's now five-month pregnant belly to a school administrator filling out a slip, which Juno takes and turns around smiling all the way out. Juno exits the head office and bumps into Bleeker. Later, the monitor reveals the baby's head, and Juno, Leah, and Bren become immediately defensive, with Bren gesturing to the ultrasound monitor before the ultrasound tech exits in a huff. Juno lies in bed examining the ultrasound printout. The Previa drives into the front gate of Mark and Vanessa's exclusive community, and Juno rings the doorbell, shifting her weight in the cold, until Mark, dressed in a t-shirt and jeans, answers the door."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The Previa is cruised slowly into the Loring's fancy gated community, where an impressive, though generic McMansion is had by Mark and Vanessa Loring. Unlandscaped soil covers the entire yard, and the curb is parked on by Mac after pulling over. Both are looking mortified as someone is waited for to greet them, until the door is opened by Vanessa, a pretty, meticulous woman in her early thirties, who awkwardly leads them into her home. Her hooded sweatshirt is taken off by Juno and thrust into Vanessa's arms, by whom it is set on a bench. Mark Loring, a boyishly attractive guy in his mid-thirties, appears next to Vanessa and sheepishly glances at her upon hearing the Penny Saver mention, then he extends his hand to Mac and Juno. Mark's hand is seized by Mac, who pumps it heartily. Juno and Mac are ushered by Mark and Vanessa into the austere, spacious living room, where a woman in a business suit is sitting on the couch with a briefcase in her lap. Mark and Juno lock eyes as Vanessa is clearly ecstatic, and Mark's twitching nostrils are inhaled upon by Juno holding her wrist up to him. A room with the door slightly ajar is stared into by Juno, revealing guitars mounted on the wall and the edges of posters. Meanwhile, Vanessa, Mac, and Gerta Rauss are waiting in awkward silence for Juno and Mark to return, and a brand new Pilates machine sitting in its packaging in a corner of the room is noticed by Mac. Vanessa and Gerta have no response, and Vanessa looks to the ceiling, while guitars are tooled around on by Mark and Juno unplugged, playing little riffs. Vanessa's manic demeanor visibly embarrasses Mark. Coats are put on by Juno and Mac and the process of leaving is initiated, with Vanessa and Mark trailing behind as Juno is stared at gravely by Mac. Mark is looked at by Juno, and then she and Mac exit, with the door being shut by Mark. The track team is jogged in formation by, leaving tracks in the snow, while the track is run on alone by Bleeker. Bleeker's friend Vijay, a solemn, skinny boy much like Bleeker, jogs up alongside him, commenting that those bastards never stop running before he jogs off. Bleeker stops and his sweat is wiped away. We're then looking over Juno's now five-month pregnant belly to a school administrator, who is filling out a slip, which is taken by Juno, who turns around smiling all the way out. The head office is exited by Juno, and into Bleeker is bumped. Later, the baby's head is revealed by the monitor, and Juno, Leah, and Bren become immediately defensive, with the ultrasound monitor being gestured to by Bren before the ultrasound tech exits in a huff. Juno lays in bed checking out the ultrasound printout. The Previa is driven into the front gate of Mark and Vanessa's exclusive community, and the doorbell is rung by Juno, who shifts her weight in the cold, until the door is answered by Mark, dressed in a t-shirt and jeans."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The Previa slowly enters the Loring's upscale gated community, where Mark and Vanessa Loring own an impressive but generic McMansion. The yard is bare soil, and Mac parks at the curb. They look uneasy until Vanessa, a meticulous woman in her early thirties, awkwardly invites them in. Juno removes her sweatshirt, handing it to Vanessa, who places it on a bench. Mark Loring, a boyishly attractive man in his mid-thirties, joins Vanessa, sheepishly acknowledging the Penny Saver mention, and shakes hands with Mac and Juno. They lead Juno and Mac into the spacious living room, where a woman in a business suit sits with a briefcase. Vanessa is thrilled as Mark and Juno exchange glances, and Juno offers her wrist to Mark, who inhales. Juno notices a room with guitars and posters. Meanwhile, Vanessa, Mac, and Gerta Rauss wait awkwardly, with Mac spotting a new Pilates machine. Vanessa and Gerta remain silent as Mark and Juno play unplugged guitar riffs. Mark appears embarrassed by Vanessa's manic behavior. Juno and Mac prepare to leave, with Vanessa and Mark following as Mac gives Juno a grave look. Juno glances at Mark before she and Mac exit, and Mark closes the door. The track team jogs in formation, leaving snow tracks, while Bleeker runs alone. His friend Vijay, a solemn, skinny boy, joins him briefly, commenting on the relentless runners before jogging off. Bleeker stops to wipe his sweat. We see Juno's five-month pregnant belly as a school administrator fills out a slip, which Juno takes, smiling as she leaves. Juno exits the office and bumps into Bleeker. Later, the ultrasound monitor shows the baby's head, prompting Juno, Leah, and Bren to become defensive, with Bren gesturing at the monitor before the tech leaves in a huff. Juno lies in bed examining the ultrasound printout. The Previa enters Mark and Vanessa's exclusive community again, and Juno rings the doorbell, shifting in the cold until Mark, in a t-shirt and jeans, answers."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The Previa slowly enters the Loring's upscale gated community, where Mark and Vanessa Loring own a generic McMansion. The yard is bare soil, and Mac parks at the curb. They wait nervously until Vanessa, a meticulous woman in her early thirties, awkwardly invites them in. Juno hands her sweatshirt to Vanessa, who places it on a bench. Mark, a boyishly attractive man in his mid-thirties, joins Vanessa, sheepishly acknowledging the Penny Saver mention, and shakes hands with Mac and Juno. They lead Juno and Mac into the spacious living room, where a woman in a business suit sits with a briefcase. Vanessa is thrilled as Mark and Juno exchange glances, and Juno offers her wrist to Mark, who inhales. Juno notices a room with guitars and posters. Meanwhile, Vanessa, Mac, and Gerta Rauss wait awkwardly, and Mac spots a new Pilates machine. Vanessa and Gerta remain silent as Mark and Juno play unplugged guitar riffs. Mark is embarrassed by Vanessa's manic behavior. Juno and Mac prepare to leave, with Vanessa and Mark following. Mac looks at Juno seriously before they exit, and Mark closes the door. The track team jogs in the snow, while Bleeker runs alone. His friend Vijay comments on the relentless runners before jogging off. Bleeker stops to wipe his sweat. We see Juno's five-month pregnant belly as a school administrator fills out a slip, which Juno takes, smiling. Juno exits the office and bumps into Bleeker. Later, the ultrasound reveals the baby's head, and Juno, Leah, and Bren become defensive, with Bren gesturing at the monitor before the tech leaves in a huff. Juno examines the ultrasound printout in bed. The Previa returns to Mark and Vanessa's community, and Juno rings the doorbell, shifting in the cold until Mark, in a t-shirt and jeans, answers."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The Previa, a vehicle moving at a leisurely pace, makes its way into the upscale, exclusive gated community where the Loring family resides. Mark and Vanessa Loring own an impressive, albeit somewhat generic, McMansion within this community. The entire yard surrounding their home is nothing but unlandscaped soil, giving it a barren appearance. Mac pulls the vehicle over and parks it on the curb. Both Mac and Juno appear mortified as they sit in anticipation, waiting for someone to come out and greet them. Eventually, Vanessa, a pretty and meticulous woman in her early thirties, opens the door and awkwardly leads them into her home. Juno removes her hooded sweatshirt and thrusts it into Vanessa's arms, who then sets it down on a nearby bench. Mark Loring, a boyishly attractive man in his mid-thirties, appears beside Vanessa. Upon hearing the mention of the Penny Saver, he glances sheepishly at her before extending his hand to both Mac and Juno. Mac seizes Mark's hand and pumps it heartily in a friendly manner. Mark and Vanessa then usher Juno and Mac into their austere yet spacious living room, where a woman dressed in a business suit sits on the couch with a briefcase resting on her lap. Vanessa is clearly ecstatic as Mark and Juno lock eyes, and Juno holds her wrist up to Mark's twitching nostrils, which he inhales. Juno's gaze drifts into a room with a door slightly ajar, revealing guitars mounted on the wall and the edges of posters. Meanwhile, Vanessa, Mac, and Gerta Rauss wait in awkward silence for Juno and Mark to return, and Mac notices a brand new Pilates machine still in its packaging in a corner of the room. Vanessa and Gerta have no response, and Vanessa looks up at the ceiling, while Mark and Juno tool around on the guitars unplugged, playing little riffs. Mark seems visibly embarrassed by Vanessa's manic demeanor. Juno and Mac have put their coats back on and are in the process of leaving, with Vanessa and Mark trailing behind them as Mac stares at Juno gravely. Juno looks at Mark, and then she and Mac exit, with Mark shutting the door behind them. Outside, the track team jogs in formation, leaving tracks in the snow, while Bleeker runs alone on the track. Bleeker's friend Vijay, a solemn and skinny boy much like Bleeker, jogs up alongside him, commenting that those bastards never stop running before jogging off. Bleeker stops and wipes away his sweat. We then see Juno's now five-month pregnant belly as a school administrator fills out a slip, which Juno takes and turns around, smiling all the way out. Juno exits the head office and bumps into Bleeker. Later, the monitor reveals the baby's head, and Juno, Leah, and Bren become immediately defensive, with Bren gesturing to the ultrasound monitor before the ultrasound tech exits in a huff. Juno lays in bed, checking out the ultrasound printout. The Previa drives once more into the front gate of Mark and Vanessa's exclusive community, and Juno rings the doorbell, shifting her weight in the cold, until Mark, dressed casually in a t-shirt and jeans, answers the door."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The Previa, a vehicle moving at a leisurely and unhurried pace, slowly makes its way into the upscale, exclusive gated community where the Loring family resides in their impressive home. Mark and Vanessa Loring are the proud owners of an impressive, though somewhat generic, McMansion within this exclusive area. The entire expansive yard surrounding their home is nothing more than unlandscaped soil, giving it a rather barren and desolate appearance. Mac pulls the vehicle over and parks it on the curb just outside. Both Mac and Juno appear mortified and slightly uncomfortable as they sit quietly in anticipation, waiting for someone to eventually come out and greet them. Eventually, Vanessa, a pretty and meticulous woman in her early thirties, opens the door and awkwardly leads them into her home. Juno promptly removes her hooded sweatshirt and casually thrusts it into Vanessa's arms, who then sets it down on a nearby bench. Mark Loring, a boyishly attractive man in his mid-thirties, appears beside Vanessa. Upon hearing the mention of the Penny Saver, he glances sheepishly at her before extending his hand to both Mac and Juno. Mac seizes Mark's hand and pumps it heartily in an overly friendly manner. Mark and Vanessa then usher Juno and Mac into their austere yet spacious living room, where a woman dressed in a business suit sits on the couch with a briefcase resting on her lap, exuding an air of professionalism. Vanessa is clearly ecstatic as Mark and Juno lock eyes, and Juno holds her wrist up to Mark's twitching nostrils, which he inhales with interest. Juno's gaze drifts into a nearby room with a door slightly ajar, revealing guitars mounted on the wall and the edges of posters hinting at a passion for music. Meanwhile, Vanessa, Mac, and Gerta Rauss wait in awkward silence for Juno and Mark to return. Mac notices a brand-new Pilates machine still in its packaging in a corner of the room, a sign of unfulfilled fitness ambitions. Vanessa and Gerta have no response, and Vanessa looks up at the ceiling, while Mark and Juno tool around on the guitars, playing little riffs without amplification. Mark seems visibly embarrassed by Vanessa's manic demeanor. Juno and Mac have put their coats back on and are in the process of leaving, with Vanessa and Mark trailing closely behind them as Mac stares at Juno gravely. Juno looks at Mark, and then she and Mac exit the house, with Mark shutting the door behind them as they leave. Outside, the track team jogs in formation, leaving tracks in the freshly fallen snow, while Bleeker runs alone on the track. Bleeker's friend Vijay, a solemn and skinny boy much like Bleeker, jogs up alongside him, commenting that those bastards never stop running before jogging off. Bleeker stops and wipes away the sweat from his brow. We then see Juno’s now five-month pregnant belly as a school administrator meticulously fills out a slip, which Juno takes and turns around, smiling all the way out of the office. Juno exits the head office and accidentally bumps into Bleeker in the hallway. Later, the ultrasound monitor reveals the baby’s head, and Juno, Leah, and Bren become immediately defensive, with Bren gesturing to the ultrasound monitor before the ultrasound tech exits in a huff of frustration. Juno lies in bed, checking out the ultrasound printout thoughtfully. The Previa drives once more through the front gate of Mark and Vanessa’s exclusive community, and Juno rings the doorbell, shifting her weight from foot to foot in the cold, until Mark, dressed casually in a t-shirt and jeans, finally answers the door."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The Previa glides slowly into the entrance of the Loring's upscale gated community, navigating through the well-maintained roads until it reaches the impressive yet somewhat generic McMansion belonging to Mark and Vanessa Loring. The vehicle comes to a halt, and Mac carefully pulls over to park on the curb beside the unlandscaped expanse of soil that makes up the yard. Both Mac and Juno sit in the car, their expressions reflecting a mix of anxiety and anticipation as they wait for someone to come out and greet them. After a brief moment, Vanessa, a pretty and meticulous woman in her early thirties, appears at the door. She opens it and, with a hint of awkwardness, gestures for them to enter her home. As they step inside, Juno removes her hooded sweatshirt and, without hesitation, thrusts it into Vanessa's arms. Vanessa, slightly taken aback, places the sweatshirt on a nearby bench. At that moment, Mark Loring, a boyishly attractive man in his mid-thirties, emerges beside Vanessa. He casts a sheepish glance at her upon hearing the mention of the Penny Saver, then extends his hand in greeting to both Mac and Juno. Mac responds by firmly grasping Mark's hand and giving it a hearty shake. Mark and Vanessa then guide Juno and Mac into their austere yet spacious living room, where a woman dressed in a business suit sits on the couch with a briefcase resting on her lap. Vanessa's excitement is palpable as Mark and Juno make eye contact, and Juno playfully holds her wrist up to Mark's twitching nostrils, which he inhales with a sense of amusement. Juno's attention is momentarily captured by a room with a slightly ajar door, through which she glimpses guitars mounted on the wall and the edges of posters. Meanwhile, Vanessa, Mac, and Gerta Rauss remain in the living room, enveloped in an awkward silence as they await the return of Juno and Mark. Mac's eyes wander around the room, eventually landing on a brand new Pilates machine still in its packaging, tucked away in a corner. Vanessa and Gerta offer no response to this observation, and Vanessa's gaze drifts upward to the ceiling. In the meantime, Mark and Juno are in the other room, casually strumming on the unplugged guitars and playing little riffs, with Mark appearing visibly embarrassed by Vanessa's overly enthusiastic demeanor. Eventually, Juno and Mac don their coats, signaling their departure, while Vanessa and Mark follow closely behind. Mac casts a grave look at Juno as they make their way to the door. Juno exchanges a glance with Mark before she and Mac step outside, with Mark gently closing the door behind them. Outside, the track team jogs in formation, their feet leaving tracks in the snow, while Bleeker runs alone on the track. His friend Vijay, a solemn and skinny boy much like Bleeker, jogs up alongside him, making a comment about how those bastards never stop running before continuing on his way. Bleeker pauses for a moment to wipe away the sweat from his brow. The scene shifts to a view over Juno's now five-month pregnant belly as a school administrator fills out a slip, which Juno takes with a smile, turning around and maintaining her cheerful demeanor as she exits the office. As she leaves, she bumps into Bleeker. Later, during an ultrasound appointment, the monitor reveals the baby's head, prompting Juno, Leah, and Bren to become immediately defensive. Bren gestures towards the ultrasound monitor, and the ultrasound technician exits the room in a huff. Juno later lies in bed, examining the ultrasound printout. The Previa once again drives through the front gate of Mark and Vanessa's exclusive community, and Juno rings the doorbell, shifting her weight from one foot to the other in the cold, until Mark, casually dressed in a t-shirt and jeans, answers the door."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The Previa cruises into the Loring's upscale gated community, where Mark and Vanessa Loring reside in an impressive McMansion. The unlandscaped yard surrounds the house as Mac parks on the curb. Both he and Juno appear mortified while waiting for a greeting, until Vanessa, a meticulous woman in her early thirties, opens the door and awkwardly invites them inside. Juno removes her hooded sweatshirt and hands it to Vanessa, who places it on a bench. Mark Loring, a boyishly attractive man in his mid-thirties, joins Vanessa, sheepishly acknowledges the Penny Saver mention, and shakes hands with Mac and Juno. The Lorings lead them into the austere, spacious living room, where a woman in a business suit sits with a briefcase. Vanessa is ecstatic as Mark and Juno exchange glances, with Juno offering her wrist for Mark to sniff. Juno notices a room with guitars and posters visible through a slightly ajar door. Meanwhile, Vanessa, Mac, and Gerta Rauss wait in awkward silence, with Mac observing a new Pilates machine in the corner. Vanessa and Gerta remain unresponsive as Mark and Juno play unplugged guitar riffs, with Mark embarrassed by Vanessa's manic demeanor. As Juno and Mac prepare to leave, Vanessa and Mark follow, with Mac giving Juno a grave look before they exit and Mark closes the door. The track team jogs in formation, leaving tracks in the snow, while Bleeker runs alone. His friend Vijay briefly joins him, commenting on the relentless runners before jogging off. Bleeker stops to wipe his sweat. The scene shifts to Juno's five-month pregnant belly as a school administrator fills out a slip, which Juno takes, smiling as she leaves. She bumps into Bleeker upon exiting the office. Later, during an ultrasound, Juno, Leah, and Bren become defensive, with Bren gesturing at the monitor before the tech leaves in a huff. Juno later examines the ultrasound printout in bed. The Previa returns to the Loring's community, and Juno rings the doorbell, shifting in the cold until Mark, in a t-shirt and jeans, answers."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The Previa, a popular minivan model often chosen for its spacious interior, cruises slowly into the Loring's fancy gated community, known for its high property values and security features, where Mark and Vanessa Loring have an impressive, though generic McMansion. The entire yard is unlandscaped soil, a stark contrast to the meticulously manicured lawns common in such neighborhoods, and Mac pulls over and parks on the curb. Both look mortified as they wait for someone to greet them, until Vanessa, a pretty, meticulous woman in her early thirties who is known for her attention to detail, opens the door and awkwardly leads them into her home. Juno takes off her hooded sweatshirt and thrusts it into Vanessa's arms, who sets it on a bench that matches the home's minimalist decor. Mark Loring, a boyishly attractive guy in his mid-thirties with a passion for music that is evident in his collection of vinyl records, appears next to Vanessa and glances sheepishly at her upon hearing the Penny Saver mention, a nod to a popular classifieds publication, then extends his hand to Mac and Juno. Mac seizes Mark's hand and pumps it heartily, displaying his straightforward, friendly demeanor. Mark and Vanessa usher Juno and Mac into the austere, spacious living room, where a woman in a business suit, indicative of her professional role possibly in real estate or finance, sits on the couch with a briefcase in her lap. Vanessa is clearly ecstatic as Mark and Juno lock eyes, and Juno holds her wrist up to Mark's twitching nostrils, which he inhales, perhaps recognizing her scent from a shared past. Juno is staring into a room with the door slightly ajar, revealing guitars mounted on the wall, showcasing Mark's long-standing hobby, and the edges of posters, likely from his favorite bands. Meanwhile, Vanessa, Mac, and Gerta Rauss, a highly regarded adoption agent with a reputation for discretion, are waiting in awkward silence for Juno and Mark to return, and Mac notices a brand new Pilates machine sitting in its packaging in a corner of the room, indicative of Vanessa's interest in fitness trends. Vanessa and Gerta have no response, and Vanessa looks to the ceiling, a common gesture of frustration, while Mark and Juno tool around on the guitars unplugged, playing little riffs that reflect their casual enjoyment of music. Mark seems visibly embarrassed by Vanessa's manic demeanor, which is uncharacteristic of her usually composed nature. Juno and Mac have put their coats on and are in the process of leaving, with Vanessa and Mark trailing behind as Mac stares at Juno gravely, his fatherly concern evident. Juno looks at Mark, who appears caught between conflicting emotions, and then she and Mac exit, with Mark shutting the door. The track team jogs in formation, leaving tracks in the snow, their dedication evident despite the cold, while Bleeker runs alone on the track, preferring solitude. Bleeker's friend Vijay, a solemn, skinny boy much like Bleeker who shares the same dedication to running, jogs up alongside him, commenting that those bastards never stop running, a testament to the team's relentless commitment, before jogging off. Bleeker stops and wipes away his sweat, feeling the exertion from his solitary effort. We're then looking over Juno's now five-month pregnant belly, a significant milestone in her pregnancy, to a school administrator filling out a slip, which Juno takes and turns around smiling all the way out, her mood uplifted by the task completion. Juno exits the head office and bumps into Bleeker, their paths crossing as if by fate. Later, the monitor reveals the baby's head, and Juno, Leah, and Bren become immediately defensive, with Bren gesturing to the ultrasound monitor to emphasize its significance before the ultrasound tech, likely sensing their tension, exits in a huff. Juno lays in bed checking out the ultrasound printout, a memento of her imminent motherhood. The Previa again drives into the front gate of Mark and Vanessa's exclusive community, where property values have steadily risen, and Juno rings the doorbell, shifting her weight in the cold, a subtle indication of her discomfort, until Mark, dressed in a t-shirt and jeans that suggest his laid-back personality, answers the door."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The Previa cruises slowly into the Loring's fancy gated community where Mark and Vanessa Loring have an impressive though generic McMansion  The entire yard is unlandscaped soil and Mac pulls over and parks on the curb  Both look mortified as they wait for someone to greet them until Vanessa a pretty meticulous woman in her early thirties opens the door and awkwardly leads them into her home  Vanessa and Gerta have no response and Vanessa looks to the ceiling while Mark and Juno tool around on the guitars unplugged playing little riffs  Mark seems visibly embarrassed by Vanessa's manic demeanor  Juno and Mac have put their coats on and are in the process of leaving with Vanessa and Mark trailing behind as Mac stares at Juno gravely  Juno looks at Mark and then she and Mac exit with Mark shutting the door  The track team jogs in formation leaving tracks in the snow while Bleeker runs alone on the track  Bleeker's friend Vijay a solemn skinny boy much like Bleeker jogs up alongside him commenting that those bastards never stop running before jogging off  Bleeker stops and wipes away his sweat  We're then looking over Juno's now fivemonth pregnant belly to a school administrator filling out a slip which Juno takes and turns around smiling all the way out  Juno exits the head office and bumps into Bleeker  Later the monitor reveals the baby's head and Juno Leah and Bren become immediately defensive with Bren gesturing to the ultrasound monitor before the ultrasound tech exits in a huff  Juno lays in bed checking out the ultrasound printout  Juno takes off her hooded sweatshirt and thrusts it into Vanessa's arms who sets it on a bench  Mark Loring a boyishly attractive guy in his midthirties appears next to Vanessa and glances sheepishly at her upon hearing the Penny Saver mention then extends his hand to Mac and Juno  Mac seizes Mark's hand and pumps it heartily  Mark and Vanessa usher Juno and Mac into the austere spacious living room where a woman in a business suit sits on the couch with a briefcase in her lap  Vanessa is clearly ecstatic as Mark and Juno lock eyes and Juno holds her wrist up to Mark's twitching nostrils which he inhales  Juno is staring into a room with the door slightly ajar revealing guitars mounted on the wall and the edges of posters  Meanwhile Vanessa Mac and Gerta Rauss are waiting in awkward silence for Juno and Mark to return and Mac notices a brand new Pilates machine sitting in its packaging in a corner of the room  Vanessa and Gerta have no response and Vanessa looks to the ceiling while Mark and Juno tool around on the guitars unplugged playing little riffs  Mark seems visibly embarrassed by Vanessa's manic demeanor  Juno and Mac have put their coats on and are in the process of leaving with Vanessa and Mark trailing behind as Mac stares at Juno gravely  Juno looks at Mark and then she and Mac exit with Mark shutting the door  The track team jogs in formation leaving tracks in the snow while Bleeker runs alone on the track  Bleeker's friend Vijay a solemn skinny boy much like Bleeker jogs up alongside him commenting that those bastards never stop running before jogging off  Bleeker stops and wipes away his sweat  We're then looking over Juno's now fivemonth pregnant belly to a school administrator filling out a slip which Juno takes and turns around smiling all the way out  Juno exits the head office and bumps into Bleeker  Later the monitor reveals the baby's head and Juno Leah and Bren become immediately defensive with Bren gesturing to the ultrasound monitor before the ultrasound tech exits in a huff  Juno lays in bed checking out the ultrasound printout  The Previa drives into the front gate of Mark and Vanessa's exclusive community and Juno rings the doorbell shifting her weight in the cold until Mark dressed in a tshirt and jeans answers the door"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The Previa cruises slowly into the Loring's fancy gated community where Mark and Vanessa Loring have an impressive though generic McMansion. The entire yard is unlandscaped soil and Mac pulls over and parks on the curb. Both look mortified as they wait for someone to greet them until Vanessa a pretty meticulous woman in her early thirties opens the door and awkwardly leads them into her home. Juno takes off her hooded sweatshirt and thrusts it into Vanessa's arms who sets it on a bench. Mark Loring a boyishly attractive guy in his midthirties appears next to Vanessa and glances sheepishly at her upon hearing the Penny Saver mention then extends his hand to Mac and Juno. Mac seizes Mark's hand and pumps it heartily. Mark and Vanessa usher Juno and Mac into the austere spacious living room where a woman in a business suit sits on the couch with a briefcase in her lap. Vanessa is clearly ecstatic as Mark and Juno lock eyes and Juno holds her wrist up to Mark's twitching nostrils which he inhales. Juno is staring into a room with the door slightly ajar revealing guitars mounted on the wall and the edges of posters. Meanwhile Vanessa Mac and Gerta Rauss are waiting in awkward silence for Juno and Mark to return and Mac notices a brand new Pilates machine sitting in its packaging in a corner of the room. Vanessa and Gerta have no response and Vanessa looks to the ceiling while Mark and Juno tool around on the guitars unplugged playing little riffs. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Mark seems visibly embarrassed by Vanessa's manic demeanor. Juno and Mac have put their coats on and are in the process of leaving with Vanessa and Mark trailing behind as Mac stares at Juno gravely. Juno looks at Mark and then she and Mac exit with Mark shutting the door. The track team jogs in formation leaving tracks in the snow while Bleeker runs alone on the track. Bleeker's friend Vijay a solemn skinny boy much like Bleeker jogs up alongside him commenting that those bastards never stop running before jogging off. Bleeker stops and wipes away his sweat. We are then looking over Juno's now fivemonth pregnant belly to a school administrator filling out a slip which Juno takes and turns around smiling all the way out. Juno exits the head office and bumps into Bleeker. Later the monitor reveals the baby's head and Juno. Leah and Bren become immediately defensive with Bren gesturing to the ultrasound monitor before the ultrasound tech exits in a huff. Juno lays in bed checking out the ultrasound printout. The Previa drives into the front gate of Mark and Vanessa's exclusive community and Juno rings the doorbell shifting her weight in the cold until Mark dressed in a tshirt and jeans answers the door."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The Previa cruises slowly into the Loring's fancy gated community where Mark and Vanessa Loring have an impressive though generic McMansion. The entire yard is unlandscaped soil and Mac pulls over and parks on the curb. Both look mortified as they wait for someone to greet them until Vanessa a pretty meticulous woman in her early thirties opens the door and awkwardly leads them into her home. Juno takes off her hooded sweatshirt and thrusts it into Vanessa's arms who sets it on a bench. Mark Loring a boyishly attractive guy in his midthirties appears next to Vanessa and glances sheepishly at her upon hearing the Penny Saver mention then extends his hand to Mac and Juno. Mac seizes Mark's hand and pumps it heartily. Mark and Vanessa usher Juno and Mac into the austere spacious living room where a woman in a business suit sits on the couch with a briefcase in her lap. Vanessa is clearly ecstatic as Mark and Juno lock eyes and Juno holds her wrist up to Mark's twitching nostrils which he inhales. Juno is staring into a room with the door slightly ajar revealing guitars mounted on the wall and the edges of posters. Meanwhile Vanessa Mac and Gerta Rauss are waiting in awkward silence for Juno and Mark to return and Mac notices a brand new Pilates machine sitting in its packaging in a corner of the room. Vanessa and Gerta have no response and Vanessa looks to the ceiling while Mark and Juno tool around on the guitars unplugged playing little riffs. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Mark seems visibly embarrassed by Vanessa's manic demeanor. Juno and Mac have put their coats on and are in the process of leaving with Vanessa and Mark trailing behind as Mac stares at Juno gravely. Juno looks at Mark and then she and Mac exit with Mark shutting the door. The track team jogs in formation leaving tracks in the snow while Bleeker runs alone on the track. Bleeker's friend Vijay a solemn skinny boy much like Bleeker jogs up alongside him commenting that those bastards never stop running before jogging off. Bleeker stops and wipes away his sweat. We are then looking over Juno's now fivemonth pregnant belly to a school administrator filling out a slip which Juno takes and turns around smiling all the way out. Juno exits the head office and bumps into Bleeker. Later the monitor reveals the baby's head and Juno. Leah and Bren become immediately defensive with Bren gesturing to the ultrasound monitor before the ultrasound tech exits in a huff. Juno lays in bed checking out the ultrasound printout. The Previa drives into the front gate of Mark and Vanessa's exclusive community and Juno rings the doorbell shifting her weight in the cold until Mark dressed in a tshirt and jeans answers the door."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The Previa cruises slowly into the Loring's fancy gated community where Mark and Vanessa Loring have an impressive though generic McMansion. The entire yard is unlandscaped soil and Mac pulls over and parks on the curb. Both look mortified as they wait for someone to greet them until Vanessa a pretty meticulous woman in her early thirties opens the door and awkwardly leads them into her home. Juno takes off her hooded sweatshirt and thrusts it into Vanessa's arms who sets it on a bench. Mark Loring a boyishly attractive guy in his midthirties appears next to Vanessa and glances sheepishly at her upon hearing the Penny Saver mention then extends his hand to Mac and Juno. Mac seizes Mark's hand and pumps it heartily. We are then looking over Juno's now fivemonth pregnant belly to a school administrator filling out a slip which Juno takes and turns around smiling all the way out. Juno exits the head office and bumps into Bleeker. Later the monitor reveals the baby's head and Juno. Leah and Bren become immediately defensive with Bren gesturing to the ultrasound monitor before the ultrasound tech exits in a huff. Juno lays in bed checking out the ultrasound printout. The Previa drives into the front gate of Mark and Vanessa's exclusive community and Juno rings the doorbell shifting her weight in the cold until Mark dressed in a tshirt and jeans answers the door."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The Previa cruises slowly into the Loring's fancy gated community where Mark and Vanessa Loring have an impressive though generic McMansion. The entire yard is unlandscaped soil and Mac pulls over and parks on the curb. Leah and Bren become immediately defensive with Bren gesturing to the ultrasound monitor before the ultrasound tech exits in a huff. Juno lays in bed checking out the ultrasound printout. The Previa drives into the front gate of Mark and Vanessa's exclusive community and Juno rings the doorbell shifting her weight in the cold until Mark dressed in a tshirt and jeans answers the door."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The koala cruises slowly into the Loring's fancy gated community, where a giraffe and Vanessa Loring have an impressive, though generic McMansion. The entire yard is unlandscaped soil, and a rabbit pulls over and parks on the curb. Both look mortified as they wait for someone to greet them, until a lemur, a pretty, meticulous woman in her early thirties, opens the door and awkwardly leads them into her home. A penguin takes off her hooded sweatshirt and thrusts it into the lemur's arms, who sets it on a bench. A dolphin, a boyishly attractive guy in his mid-thirties, appears next to the lemur and glances sheepishly at her upon hearing the Penny Saver mention, then extends his hand to the rabbit and the penguin. The rabbit seizes the dolphin's hand and pumps it heartily. The dolphin and the lemur usher the penguin and the rabbit into the austere, spacious living room, where a kangaroo in a business suit sits on the couch with a briefcase in her lap. The lemur is clearly ecstatic as the dolphin and the penguin lock eyes, and the penguin holds her wrist up to the dolphin's twitching nostrils, which he inhales. The penguin is staring into a room with the door slightly ajar, revealing guitars mounted on the wall and the edges of posters. Meanwhile, the lemur, the rabbit, and Gerta Rauss are waiting in awkward silence for the penguin and the dolphin to return, and the rabbit notices a brand new Pilates machine sitting in its packaging in a corner of the room. The lemur and Gerta have no response, and the lemur looks to the ceiling, while the dolphin and the penguin tool around on the guitars unplugged, playing little riffs. The dolphin seems visibly embarrassed by the lemur's manic demeanor. The penguin and the rabbit have put their coats on and are in the process of leaving, with the lemur and the dolphin trailing behind as the rabbit stares at the penguin gravely. The penguin looks at the dolphin, and then she and the rabbit exit, with the dolphin shutting the door. The track team jogs in formation, leaving tracks in the snow, while an elephant runs alone on the track. The elephant's friend Vijay, a solemn, skinny boy much like the elephant, jogs up alongside him, commenting that those bastards never stop running before jogging off. The elephant stops and wipes away his sweat. We're then looking over the penguin's now five-month pregnant belly to a lion filling out a slip, which the penguin takes and turns around smiling all the way out. The penguin exits the head office and bumps into the elephant. Later, the monitor reveals the baby's head, and the penguin, Leah, and Bren become immediately defensive, with Bren gesturing to the ultrasound monitor before the ultrasound tech exits in a huff. The penguin lays in bed checking out the ultrasound printout. The koala drives into the front gate of the dolphin and the lemur's exclusive community, and the penguin rings the doorbell, shifting her weight in the cold, until the dolphin, dressed in a t-shirt and jeans, answers the door."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The kayak glides slowly into the Loring's elaborate gated neighborhood, where Mark and Vanessa Loring have an impressive, though generic penthouse. The entire yard is a barren sandy lot, and Mac pulls over and parks on the gravel. Both look mortified as they wait for someone to greet them, until Vanessa, a pretty, meticulous woman in her early thirties, opens the door and awkwardly leads them into her domicile. Juno takes off her windbreaker and thrusts it into Vanessa's arms, who sets it on a counter. Mark Loring, a boyishly attractive guy in his mid-thirties, appears next to Vanessa and glances sheepishly at her upon hearing the Socket Saver mention, then extends his hand to Mac and Juno. Mac seizes Mark's hand and pumps it heartily. Mark and Vanessa usher Juno and Mac into the minimalist, expansive den, where a woman in a business suit sits on the ottoman with a portfolio in her lap. Vanessa is clearly ecstatic as Mark and Juno lock eyes, and Juno holds her wrist up to Mark's twitching nostrils, which he inhales. Juno is staring into a room with the door slightly ajar, revealing violins mounted on the wall and the edges of paintings. Meanwhile, Vanessa, Mac, and Gerta Rauss are waiting in awkward silence for Juno and Mark to return, and Mac notices a brand new treadmill sitting in its packaging in a corner of the room. Vanessa and Gerta have no response, and Vanessa looks to the ceiling, while Mark and Juno tool around on the violins unplugged, playing little melodies. Mark seems visibly embarrassed by Vanessa's manic demeanor. Juno and Mac have put their jackets on and are in the process of leaving, with Vanessa and Mark trailing behind as Mac stares at Juno gravely. Juno looks at Mark, and then she and Mac exit, with Mark shutting the door. The dance troupe jogs in formation, leaving footprints in the snow, while Bleeker runs alone on the path. Bleeker's friend Vijay, a solemn, skinny boy much like Bleeker, jogs up alongside him, commenting that those bastards never stop running before jogging off. Bleeker stops and wipes away his sweat. We're then looking over Juno's now five-month pregnant belly to a school librarian filling out a slip, which Juno takes and turns around smiling all the way out. Juno exits the head office and bumps into Bleeker. Later, the monitor reveals the baby's head, and Juno, Leah, and Bren become immediately defensive, with Bren gesturing to the heart rate monitor before the ultrasound tech exits in a huff. Juno lays in bed checking out the ultrasound printout. The kayak paddles into the front gate of Mark and Vanessa's exclusive community, and Juno presses the intercom, shifting her weight in the cold, until Mark, dressed in a t-shirt and jeans, answers the door."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The Previa drifts slowly into the Loring's fancy gated community, where Mark and Vanessa Loring possess an impressive, though generic McMansion. The entire yard is untouched soil, and Mac halts and idles on the curb. Both look startled as they anticipate someone to notice them, until Vanessa, a pretty, meticulous woman in her early thirties, opens the door and clumsily invites them into her home. Juno sheds her hooded sweatshirt and flings it into Vanessa's arms, who places it on a bench. Mark Loring, a boyishly attractive guy in his mid-thirties, appears next to Vanessa and peers sheepishly at her upon hearing the Penny Saver mention, then raises his hand to Mac and Juno. Mac grasps Mark's hand and shakes it vigorously. Mark and Vanessa guide Juno and Mac into the austere, spacious living room, where a woman in a business suit perches on the couch with a briefcase in her lap. Vanessa is clearly overjoyed as Mark and Juno make eye contact, and Juno lifts her wrist up to Mark's twitching nostrils, which he sniffs. Juno is gazing into a room with the door slightly ajar, showing guitars displayed on the wall and the edges of posters. Meanwhile, Vanessa, Mac, and Gerta Rauss are lingering in awkward silence for Juno and Mark to come back, and Mac spots a fresh Pilates machine sitting in its packaging in a corner of the room. Vanessa and Gerta have no reaction, and Vanessa gazes at the ceiling, while Mark and Juno experiment on the guitars unplugged, strumming little riffs. Mark seems visibly flustered by Vanessa's manic demeanor. Juno and Mac have donned their coats and are in the act of departing, with Vanessa and Mark trailing behind as Mac looks at Juno gravely. Juno glances at Mark, and then she and Mac depart, with Mark closing the door. The track team strolls in formation, leaving trails in the snow, while Bleeker strides alone on the track. Bleeker's friend Vijay, a solemn, skinny boy much like Bleeker, arrives alongside him, noting that those bastards never pause running before departing. Bleeker halts and wipes away his sweat. We're then examining Juno's now five-month pregnant belly to a school administrator drafting a slip, which Juno receives and pivots around grinning all the way out. Juno exits the head office and collides with Bleeker. Later, the monitor shows the baby's head, and Juno, Leah, and Bren become instantly protective, with Bren pointing to the ultrasound monitor before the ultrasound tech departs in a huff. Juno reclines in bed examining the ultrasound printout. The Previa rolls into the front gate of Mark and Vanessa's exclusive community, and Juno buzzes the doorbell, shifting her weight in the cold, until Mark, clad in a t-shirt and jeans, responds to the door."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The watermelon glides slowly into the owl's ancient hidden forest, where Daisy and Anthony Owl have a towering, though indistinguishable skyscraper. The entire floor is unpainted canvas, and Oliver drifts over and parks on the nose. Both look ecstatic as they wait for something to surprise them, until Anthony, a shiny, chaotic man in his late twenties, opens the hatch and quietly leads them into his cave. Whisperer takes off her velvet scarf and flings it into Anthony's wings, who places it on a throne. Daisy Owl, a girlishly charming creature in her early forties, appears next to Anthony and peers curiously at him upon hearing the Noggin Saver mention, then stretches her paw to Oliver and Whisperer. Oliver clasps Daisy's paw and shakes it gently. Daisy and Anthony guide Whisperer and Oliver into the opulent, tiny watering hole, where a dolphin in a diving suit rests on the branch with a suitcase in its fin. Anthony is clearly mortified as Daisy and Whisperer lock whiskers, and Whisperer holds her claw up to Daisy's fluttering antennae, which she sniffs. Whisperer is gazing into a cabin with the flap slightly ajar, revealing anvils mounted on the ceiling and the shadows of paintings. Meanwhile, Anthony, Oliver, and Vera Zimmig are hiding in jovial laughter for Whisperer and Daisy to emerge, and Oliver notices a decrepit sewing machine lying in its wrapping in a corner of the cave. Anthony and Vera have no celebration, and Anthony looks to the floor, while Daisy and Whisperer roam around on the anvils speechless, crafting tiny melodies. Daisy seems visibly amused by Anthony's tranquil presence. Whisperer and Oliver have taken their hats off and are in the process of arriving, with Anthony and Daisy chasing behind as Oliver blinks at Whisperer cheerfully. Whisperer gazes at Daisy, and then she and Oliver arrive, with Daisy swinging the hatch. The chess club marches in disarray, leaving pawns in the grass, while Marble skips quickly on the board. Marble's teammate Cal, a joyful, chubby girl much like Marble, marches up beside her, whispering that those shadows never stop skipping before marching on. Marble pauses and wipes away her tears. We're then glancing over Whisperer's now ten-week invisible cape to a harmony conductor filling out a chart, which Whisperer takes and spins around laughing all the way in. Whisperer returns to the front lounge and dances into Marble. Later, the structure flashes the animal's ears, and Whisperer, Flora, and Time become suddenly amused, with Time waving to the solar monitor before the solar tech skips in a song. Whisperer floats in water inspecting the solar snapshot. The watermelon glides into the back window of Daisy and Anthony's ordinary mansion, and Whisperer lights the candle, shifting her gaze in the heat, until Daisy, dressed in a suit and skirt, greets the window."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The Zeppelin glides gracefully into the O'Malley's lavish bubble city, where Alice and John O'Malley own a grand, albeit generic, castle. The entire garden is barren earth, and Clark taxis over and anchors on the curb. Both appear bewildered as they anticipate someone to welcome them, until Alice, a charming, precise woman in her late twenties, opens the gate and hesitantly leads them into her chateau. Jamie sheds her leather jacket and pitches it into Alice's hands, who places it on a chaise. John O'Malley, a boyishly charming man in his early forties, emerges beside Alice and peers bashfully at her upon hearing the Grocery Gazette reference, then reaches out his hand to Clark and Jamie. Clark clasps John's hand and shakes it eagerly. John and Alice guide Jamie and Clark into the minimalist, cavernous drawing room, where a lady in a formal dress perches on the divan with a laptop in her hands. Alice is visibly thrilled as John and Jamie exchange glances, and Jamie raises her wrist to John's quivering lips, which he sniffs. Jamie gazes into a chamber with the door slightly ajar, revealing violins mounted on the wall and the borders of paintings. Meanwhile, Alice, Clark, and Sally Brink are lingering in uneasy silence for Jamie and John to return, and Clark catches sight of a brand new rowing machine encased in a corner of the chamber. Alice and Sally have no reaction, and Alice gazes at the ceiling, while John and Jamie fool around on the violins unplugged, playing little melodies. John appears noticeably ashamed by Alice's frenetic demeanor. Jamie and Clark have donned their hats and are preparing to leave, with Alice and John trailing as Clark gazes at Jamie solemnly. Jamie glances at John, and then she and Clark depart, with John latching the gate. The cycling team pedals in formation, leaving marks in the mud, while Carl sprints solo on the field. Carl's companion Ivan, an earnest, lanky youth much like Carl, cycles up next to him, noting that those scoundrels never cease pedaling before cycling off. Carl halts and dabs away his perspiration. We're then observing Jamie's now five-month pregnant belly as a school counselor jots down a note, which Jamie grabs and spins around grinning all the way out. Jamie leaves the main office and collides with Carl. Later, the projector unveils the infant's outline, and Jamie, Lisa, and Fran become instantly guarded, with Fran pointing to the ultrasound projector before the ultrasound technician storms out in a huff. Jamie reclines in bed inspecting the ultrasound image. The Zeppelin floats into the main gate of John and Alice's elite city, and Jamie presses the intercom, shifting her foot in the breeze, until John, clad in a tank top and shorts, greets her."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The convertible glides effortlessly into the Loring's quaint open neighborhood, where Mark and Vanessa Loring have a modest, though distinctive cottage. The entire yard is lush with dense jungle, and Mac coasts past and idles by the driveway. Both appear fascinated as they anticipate someone to join them, until Vanessa, a quirky, casual woman in her early thirties, flings the window open and cheerfully guides them into her garden. Juno removes her wool coat and flings it towards Vanessa's hands, who places it on a hammock. Mark Loring, a ruggedly refined guy in his mid-thirties, appears next to Vanessa and winks slyly at her upon hearing the Penny Saver reference, then offers his elbow to Mac and Juno. Mac grips Mark's elbow and swings it enthusiastically. Mark and Vanessa beckon Juno and Mac into the cozy, cluttered kitchen, where a man in a tracksuit reclines on the recliner with a comic book in his palm. Vanessa is clearly content as Mark and Juno make eye contact, and Juno raises her elbow toward Mark's flickering ears, which he sniffs. Juno is gazing into a room with the curtain slightly drawn, revealing violins hung on the window and the corners of paintings. Meanwhile, Vanessa, Mac, and Gerta Rauss are lounging in comfortable conversation for Juno and Mark to return, and Mac observes an antique exercise bike wrapped in its coverings in a corner of the hall. Vanessa and Gerta have no remark, and Vanessa glances to the floor, while Mark and Juno strum around on the violins, playing little sonatas. Mark seems visibly perplexed by Vanessa's serene demeanor. Juno and Mac have slipped their scarves on and are in the process of retreating, with Vanessa and Mark trailing behind as Mac gazes at Juno thoughtfully. Juno gazes at Mark, and then she and Mac vacate, with Mark sealing the curtains. The dance group pirouettes in sequence, leaving imprints in the sand, while Bleeker skips alone on the field. Bleeker's friend Vijay, a lively, robust boy much like Bleeker, hops up beside him, noting that those dancers never pause moving before skipping away. Bleeker halts and brushes off his excitement. We're then glancing over Juno's now five-month pregnant belly to a librarian scribbling a ticket, which Juno grasps and spins around giggling all the way out. Juno slips from the study and collides with Bleeker. Later, the display shows the baby's foot, and Juno, Leah, and Bren become immediately perplexed, with Bren pointing to the ultrasound display before the ultrasound tech flees in a huff. Juno lounges in bed examining the ultrasound snapshot. The convertible slides through the entrance gate of Mark and Vanessa's idyllic settlement, and Juno knocks on the window, shifting her stance in the breeze, until Mark, dressed in a hoodie and shorts, opens the window."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The tricycle glides swiftly into the Pringle's rustic open meadow, where Bill and Susan Pringle own a quaint, though peculiar treehouse. The entire space is overgrown weeds, and Tim halts and dismounts on the trail. Both appear elated as they wait for someone to challenge them, until Susan, a tall, careless man in his late forties, swings the gate and eagerly guides them into his shack. Alex sheds her woolen scarf and tosses it into Susan's hands, who hangs it on a fence. Bill Pringle, a grizzled, rugged woman in her early sixties, emerges beside Susan and glances slyly at him upon hearing the Weekly Journal mention, then waves her foot to Tim and Alex. Tim grabs Bill's foot and shakes it gently. Bill and Susan guide Alex and Tim into the cluttered, snug kitchen, where a child in a party hat stands on the table with a backpack in their arms. Susan is visibly unimpressed as Bill and Alex share a chuckle, and Alex raises her elbow to Bill's giggling chin, which she exhales. Alex is peering into a closet with the drape slightly open, revealing helmets hung on the ceiling and the edges of maps. Meanwhile, Susan, Tim, and Hitch Bowers are resting in lively conversation for Alex and Bill to emerge, and Tim spots a dusty yoga mat lying in its wrapping in a nook of the house. Susan and Hitch have a witty exchange, and Susan looks to the floor, while Bill and Alex fiddle with the helmets unplugged, strumming sweet melodies. Bill appears visibly amused by Susan's serene composure. Alex and Tim have slipped their shoes on and are in the act of arriving, with Susan and Bill drifting ahead as Tim glances at Alex warmly. Alex gazes at Bill, and then she and Tim enter, with Bill opening the curtain. The choir chants in unison, leaving echoes in the wind, while Carter dances alone on the stage. Carter's cousin Raj, an exuberant, stocky boy nothing like Carter, pirouettes up alongside him, noting that those angels always keep singing before dancing off. Carter halts and brushes off his boots. We're then glancing over Alex's now three-month full backpack to a forest ranger marking a trail, which Alex grabs and spins around laughing all the way in. Alex enters the main hall and bumps into Carter. Earlier, the compass displays the north arrow, and Alex, Dana, and Ken become cheerfully open, with Ken pointing to the compass before the park guide storms in with joy. Alex lounges in a hammock scrolling through the compass reading. The tricycle speeds into the back trail of Bill and Susan's secluded meadow, and Alex taps the window, adjusting her stance in the heat, until Bill, dressed in a sweater and shorts, opens the window."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The Previa drives into the upscale community of Mark and Vanessa Loring, whose impressive McMansion has an unlandscaped yard. Mac and Juno nervously wait until Vanessa, a meticulous woman, awkwardly welcomes them inside. Mark, boyishly attractive, greets them as well. In the spacious living room, they meet Gerta Rauss, seated with a briefcase. Juno locks eyes with Mark and explores a room displaying guitars and posters. Vanessa, Mac, and Gerta wait in silence, noticing a new Pilates machine. Mark is embarrassed by Vanessa's demeanor as he and Juno play unplugged guitars. As Juno and Mac prepare to leave, Vanessa and Mark follow them to the door. Elsewhere, Bleeker jogs alone on the track, joined briefly by his friend Vijay. Bleeker stops and wipes his sweat, while Juno, now five months pregnant, gets a school slip. After a defensive ultrasound appointment, Juno checks the printout in bed. Later, Juno visits Mark and Vanessa's community again, ringing the doorbell until Mark answers."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The Previa drives into the front gate of Mark and Vanessa's exclusive community and Juno rings the doorbell shifting her weight in the cold until Mark dressed in a tshirt and jeans answers the door Juno lays in bed checking out the ultrasound printout  Later the monitor reveals the baby's head and Juno Leah and Bren become immediately defensive with Bren gesturing to the ultrasound monitor before the ultrasound tech exits in a huff  Juno exits the head office and bumps into Bleeker  We're then looking over Juno's now fivemonth pregnant belly to a school administrator filling out a slip which Juno takes and turns around smiling all the way out  Bleeker stops and wipes away his sweat  Bleeker's friend Vijay a solemn skinny boy much like Bleeker jogs up alongside him commenting that those bastards never stop running before jogging off  The track team jogs in formation leaving tracks in the snow while Bleeker runs alone on the track  Juno looks at Mark and then she and Mac exit with Mark shutting the door  Juno and Mac have put their coats on and are in the process of leaving with Vanessa and Mark trailing behind as Mac stares at Juno gravely  Mark seems visibly embarrassed by Vanessa's manic demeanor  Vanessa and Gerta have no response and Vanessa looks to the ceiling while Mark and Juno tool around on the guitars unplugged playing little riffs  Meanwhile Vanessa Mac and Gerta Rauss are waiting in awkward silence for Juno and Mark to return and Mac notices a brand new Pilates machine sitting in its packaging in a corner of the room  Juno is staring into a room with the door slightly ajar revealing guitars mounted on the wall and the edges of posters  Vanessa is clearly ecstatic as Mark and Juno lock eyes and Juno holds her wrist up to Mark's twitching nostrils which he inhales  Mark and Vanessa usher Juno and Mac into the austere spacious living room where a woman in a business suit sits on the couch with a briefcase in her lap  Mac seizes Mark's hand and pumps it heartily  Mark Loring a boyishly attractive guy in his midthirties appears next to Vanessa and glances sheepishly at her upon hearing the Penny Saver mention then extends his hand to Mac and Juno  Juno takes off her hooded sweatshirt and thrusts it into Vanessa's arms who sets it on a bench  Both look mortified as they wait for someone to greet them until Vanessa a pretty meticulous woman in her early thirties opens the door and awkwardly leads them into her home  The entire yard is unlandscaped soil and Mac pulls over and parks on the curb  The Previa cruises slowly into the Loring's fancy gated community where Mark and Vanessa Loring have an impressive though generic McMansion "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Meanwhile Vanessa Mac and Gerta Rauss are waiting in awkward silence for Juno and Mark to return and Mac notices a brand new Pilates machine sitting in its packaging in a corner of the room  Juno takes off her hooded sweatshirt and thrusts it into Vanessa's arms who sets it on a bench  Vanessa and Gerta have no response and Vanessa looks to the ceiling while Mark and Juno tool around on the guitars unplugged playing little riffs  Bleeker stops and wipes away his sweat  Bleeker's friend Vijay a solemn skinny boy much like Bleeker jogs up alongside him commenting that those bastards never stop running before jogging off  Juno exits the head office and bumps into Bleeker  The entire yard is unlandscaped soil and Mac pulls over and parks on the curb  Later the monitor reveals the baby's head and Juno Leah and Bren become immediately defensive with Bren gesturing to the ultrasound monitor before the ultrasound tech exits in a huff  Mark Loring a boyishly attractive guy in his midthirties appears next to Vanessa and glances sheepishly at her upon hearing the Penny Saver mention then extends his hand to Mac and Juno  Mac seizes Mark's hand and pumps it heartily  Mark and Vanessa usher Juno and Mac into the austere spacious living room where a woman in a business suit sits on the couch with a briefcase in her lap  Mark seems visibly embarrassed by Vanessa's manic demeanor  Both look mortified as they wait for someone to greet them until Vanessa a pretty meticulous woman in her early thirties opens the door and awkwardly leads them into her home  The Previa drives into the front gate of Mark and Vanessa's exclusive community and Juno rings the doorbell shifting her weight in the cold until Mark dressed in a tshirt and jeans answers the door Juno and Mac have put their coats on and are in the process of leaving with Vanessa and Mark trailing behind as Mac stares at Juno gravely  The Previa cruises slowly into the Loring's fancy gated community where Mark and Vanessa Loring have an impressive though generic McMansion  Juno is staring into a room with the door slightly ajar revealing guitars mounted on the wall and the edges of posters  The track team jogs in formation leaving tracks in the snow while Bleeker runs alone on the track  Vanessa is clearly ecstatic as Mark and Juno lock eyes and Juno holds her wrist up to Mark's twitching nostrils which he inhales  Juno looks at Mark and then she and Mac exit with Mark shutting the door  We're then looking over Juno's now fivemonth pregnant belly to a school administrator filling out a slip which Juno takes and turns around smiling all the way out  Juno lays in bed checking out the ultrasound printout "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Mark seems visibly embarrassed by Vanessa's manic demeanor  Juno and Mac have put their coats on and are in the process of leaving with Vanessa and Mark trailing behind as Mac stares at Juno gravely  Juno looks at Mark and then she and Mac exit with Mark shutting the door  The track team jogs in formation leaving tracks in the snow while Bleeker runs alone on the track  Bleeker's friend Vijay a solemn skinny boy much like Bleeker jogs up alongside him commenting that those bastards never stop running before jogging off  Bleeker stops and wipes away his sweat  We're then looking over Juno's now fivemonth pregnant belly to a school administrator filling out a slip which Juno takes and turns around smiling all the way out  Juno exits the head office and bumps into Bleeker  Later the monitor reveals the baby's head and Juno Leah and Bren become immediately defensive with Bren gesturing to the ultrasound monitor before the ultrasound tech exits in a huff  Juno lays in bed checking out the ultrasound printout  The Previa drives into the front gate of Mark and Vanessa's exclusive community and Juno rings the doorbell shifting her weight in the cold until Mark dressed in a tshirt and jeans answers the door The Previa cruises slowly into the Loring's fancy gated community where Mark and Vanessa Loring have an impressive though generic McMansion  The entire yard is unlandscaped soil and Mac pulls over and parks on the curb  Both look mortified as they wait for someone to greet them until Vanessa a pretty meticulous woman in her early thirties opens the door and awkwardly leads them into her home  Juno takes off her hooded sweatshirt and thrusts it into Vanessa's arms who sets it on a bench  Mark Loring a boyishly attractive guy in his midthirties appears next to Vanessa and glances sheepishly at her upon hearing the Penny Saver mention then extends his hand to Mac and Juno  Mac seizes Mark's hand and pumps it heartily  Mark and Vanessa usher Juno and Mac into the austere spacious living room where a woman in a business suit sits on the couch with a briefcase in her lap  Vanessa is clearly ecstatic as Mark and Juno lock eyes and Juno holds her wrist up to Mark's twitching nostrils which he inhales  Juno is staring into a room with the door slightly ajar revealing guitars mounted on the wall and the edges of posters  Meanwhile Vanessa Mac and Gerta Rauss are waiting in awkward silence for Juno and Mark to return and Mac notices a brand new Pilates machine sitting in its packaging in a corner of the room  Vanessa and Gerta have no response and Vanessa looks to the ceiling while Mark and Juno tool around on the guitars unplugged playing little riffs "
        }
      ]
    }
  ]
}