{
  "ground_truth": "Bo runs to the front bumper and climbs onto the hood, while Merrill climbs up over the side and joins Morgan on the roof, keeping a hand on his nephew as Morgan raises the monitor above his head. There's movement right next to him, causing Graham to spin and aim the flashlight at the crops to his right, but the light only penetrates a few feet into the crops. Graham holds his breath, turns, and drops the flashlight at the same time, causing the beam of light to turn off when the flashlight hits the ground. Graham kneels down and gropes in the darkness, searching with his hands over the ground in all directions until they finally touch the flashlight. He tries to get up but stumbles backward into the crops, tangled as he struggles to rise. He gets up and starts running, with leaves and stalks slapping him from all directions and something coming behind. Graham makes a sudden right turn, putting his hands in front of him to protect his face and eyes, then makes another sudden turn left, and keeps running across the yard until he steps into the kitchen. His hair is messed and his shirt has a few leaves from corn stalks stuck to it, but the children don't notice his presence. Graham takes two steps to the kitchen table and slowly takes a seat as the children splash each other at the sink while cleaning the dinner dishes. His kind eyes stare down at the ground as he slows his mind, his breathing a slow controlled pant. The children stop playing and look up to Graham, following his stare to the kitchen table until Graham looks up at them. Morgan reaches into the pile of video tapes under the television stand, grabs one, and Bo snatches it as Morgan tries to put it into the VCR. Morgan stares at his sister, while Graham and Merrill sit down at the same time on the sofa with the same dazed, slow movements. Morgan rummages through the pile of videos frantically, finds one, and reaches for the VCR, breathing heavily and wheezing. He moves to the sofa and takes a seat between his father and his uncle, as Bo walks over and squeezes in also. The four of them stare at the television as Morgan brings his asthma spray to his mouth and inhales. The family room lights are off now, with a couple of glasses of Bo's water on the television. Bo is asleep on Graham's shoulder, and Morgan is asleep on Merrill's lap, while Graham turns his sleepy eyes away from the screen to Merrill, who looks his brother in the eyes and then at the TV screen.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Bo dashes to the front fender and scales onto the hood, while Merrill scrambles up over the flank and joins Morgan on the roof, keeping a hand on his nephew as Morgan lifts the display above his head. There's movement right next to him, causing Graham to whirl and direct the torch at the crops to his right, but the light only pierces a few feet into the crops. Graham holds his breath, pivots, and drops the torch at the same time, causing the ray of light to turn off when the torch hits the ground. Graham kneels down and feels in the darkness, searching with his hands over the ground in all directions until they finally touch the torch. He tries to get up but stumbles backward into the crops, entangled as he struggles to rise. He gets up and starts sprinting, with leaves and stalks striking him from all directions and something chasing behind. Graham makes a sudden right turn, putting his hands in front of him to shield his face and eyes, then makes another sudden turn left, and keeps running across the yard until he steps into the kitchen. His hair is disheveled and his shirt has a few leaves from corn stalks attached to it, but the children don't notice his presence. Graham takes two steps to the kitchen table and slowly takes a seat as the children splash each other at the sink while washing the dinner dishes. His kind eyes gaze down at the ground as he slows his mind, his breathing a slow controlled pant. The children cease playing and look up to Graham, following his gaze to the kitchen table until Graham looks up at them. Morgan reaches into the stack of video tapes under the television stand, grabs one, and Bo snatches it as Morgan tries to insert it into the VCR. Morgan stares at his sister, while Graham and Merrill sit down at the same time on the sofa with the same dazed, slow motions. Morgan sifts through the pile of videos frantically, finds one, and reaches for the VCR, breathing heavily and wheezing. He moves to the sofa and takes a seat between his father and his uncle, as Bo walks over and squeezes in also. The four of them gaze at the television as Morgan brings his asthma spray to his mouth and inhales. The family room lights are off now, with a couple of glasses of Bo's water on the television. Bo is asleep on Graham's shoulder, and Morgan is asleep on Merrill's lap, while Graham turns his drowsy eyes away from the screen to Merrill, who looks his brother in the eyes and then at the TV screen."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Bo runs to the front bumper and climbs onto the hood, while Merrill climbs up over the side and joins Morgan on the roof, keeping a hand on his nephew as the monitor is raised above his head by Morgan. There's movement right next to him, causing Graham to spin and aim the flashlight at the crops to his right, but only a few feet are penetrated by the light into the crops. Graham holds his breath, turns, and drops the flashlight at the same time, causing the beam of light to be turned off when the ground is hit by the flashlight. Graham kneels down and gropes in the darkness, searching with his hands over the ground in all directions until the flashlight is finally touched by them. He tries to get up but stumbles backward into the crops, tangled as he struggles to rise. He gets up and starts running, with leaves and stalks slapping him from all directions and something coming behind. Graham makes a sudden right turn, putting his hands in front of him to protect his face and eyes, then makes another sudden turn left, and keeps running across the yard until the kitchen is stepped into by him. His hair is messed and a few leaves from corn stalks are stuck to his shirt, but his presence isn't noticed by the children. Graham takes two steps to the kitchen table and slowly takes a seat as the children splash each other at the sink while the dinner dishes are cleaned. His kind eyes stare down at the ground as he slows his mind, his breathing a slow controlled pant. The children stop playing and look up to Graham, following his stare to the kitchen table until they are looked up at by Graham. Morgan reaches into the pile of video tapes under the television stand, grabs one, and Bo snatches it as the VCR is tried to be put into by Morgan. Morgan stares at his sister, while Graham and Merrill sit down at the same time on the sofa with the same dazed, slow movements. Morgan rummages through the pile of videos frantically, finds one, and reaches for the VCR, breathing heavily and wheezing. He moves to the sofa and takes a seat between his father and his uncle, as Bo walks over and squeezes in also. The four of them stare at the television as Morgan brings his asthma spray to his mouth and inhales. The family room lights are off now, with a couple of glasses of Bo's water on the television. Bo is asleep on Graham's shoulder, and Morgan is asleep on Merrill's lap, while Graham turns his sleepy eyes away from the screen to Merrill, who looks his brother in the eyes and then at the TV screen."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Bo climbs onto the car hood, while Merrill joins Morgan on the roof, keeping a hand on him as Morgan raises the monitor. Graham spins to the right and aims his flashlight at the crops, but it only illuminates a few feet. He drops the flashlight, causing it to turn off, and searches blindly until he finds it. Tangled in the crops, he stumbles but rises and runs, leaves slapping him while something follows. Making sudden turns to protect himself, he runs into the kitchen, disheveled but unnoticed by the children playing at the sink. Graham sits at the table, calming his breathing. Morgan grabs a video tape, but Bo takes it. Graham and Merrill sit on the sofa, dazed, as Morgan finds another tape and joins them. The kids fall asleep on Graham and Merrill, while they sit quietly in the dark room, with a couple of glasses of Bo's water on the television. Graham turns his sleepy eyes to Merrill, who looks at him and then the screen."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Bo climbs onto the hood while Merrill joins Morgan on the roof, keeping a hand on him as Morgan raises the monitor. Movement next to Graham causes him to aim his flashlight at the crops, but it only penetrates a few feet. Dropping the flashlight, Graham gropes in the dark until he finds it, stumbles, then runs with stalks slapping him and something pursuing. Making sharp turns to protect his face, he runs into the kitchen. Disheveled, he sits at the table as the kids wash dishes. They stop and watch him as Morgan grabs a video tape, and Bo intercepts it. Morgan finds another tape, breathes heavily, and sits between Graham and Merrill. They stare at the TV as Morgan uses his asthma spray. The lights are off, Bo sleeps on Graham's shoulder, Morgan on Merrill's lap. Graham looks at Merrill, who shifts his gaze from his brother to the TV."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Bo, with a quick and determined motion, runs eagerly to the front bumper of the vehicle and skillfully climbs onto the hood. Meanwhile, Merrill makes his way up over the side of the vehicle, joining Morgan, who is positioned on the roof. Merrill places a steadying hand on his young nephew as Morgan confidently raises the monitor high above his head. Suddenly, Graham senses movement right beside him, prompting him to swiftly spin around and aim his flashlight at the crops situated to his right. However, the narrow beam of light only succeeds in penetrating a mere few feet into the dense crops. Graham finds himself holding his breath as he turns, and in the same tense moment, he inadvertently drops the flashlight, which causes the illuminating beam to extinguish as it hits the ground. Kneeling down, Graham fumbles through the darkness, his hands groping over the ground in every direction until they finally make contact with the lost flashlight. As he attempts to stand, he stumbles backward into the crops, becoming entangled as he struggles to regain his footing. Eventually, he manages to rise and begins to run, feeling the relentless slap of leaves and stalks against him from every angle, with the sensation of something pursuing him from behind. In a burst of panic, Graham makes an abrupt right turn, instinctively shielding his face and eyes with his hands for protection. He then makes another quick left turn, continuing to run with urgency across the yard until he finally finds himself stepping into the safety of the kitchen. His hair is disheveled and his shirt bears a few clinging leaves from the corn stalks, yet the children are too preoccupied to notice his entrance. Graham takes two measured steps toward the kitchen table and slowly sinks into a chair, watching as the children joyfully splash each other with water at the sink while they clean the dinner dishes. His gentle, kind eyes gaze intently at the ground as he works to calm his racing mind, his breathing now a slow and controlled pant. The children cease their playful antics and look up to Graham, their eyes following his downward stare to the kitchen table until Graham raises his gaze to meet theirs. Morgan reaches into the disorganized pile of videotapes beneath the television stand, grabbing one, but Bo quickly snatches it away just as Morgan tries to insert it into the VCR. Morgan stares back at his sister, while Graham and Merrill, in unison, sink down onto the sofa, their movements slow and dazed. Frantically rummaging through the pile of videos, Morgan finally finds one, reaches for the VCR, his breath coming in heavy, wheezing gasps. He moves to the sofa, settling himself between his father and uncle, as Bo walks over and squeezes in, also taking a seat. The four of them sit together, their eyes fixed on the television screen as Morgan brings his asthma spray to his mouth and takes an inhalation. Now, with the family room cloaked in darkness and a couple of glasses of Bo's water sitting on top of the television, the scene is serene. Bo is peacefully asleep, resting on Graham's shoulder, while Morgan has drifted off to sleep on Merrill's lap. Graham drowsily shifts his gaze from the screen to Merrill, who meets his brother's sleepy eyes and then turns his attention back to the television screen."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Bo, with a swift and determined motion, eagerly dashes to the very front bumper of the vehicle, where he skillfully climbs up onto the hood with practiced ease. Meanwhile, Merrill makes his way along the side of the vehicle, carefully climbing up to join Morgan, who is already positioned with confidence on the roof. Merrill places a steadying hand on his young nephew, providing support as Morgan confidently raises the monitor high above his head with both hands. Suddenly, right beside him, Graham senses some kind of movement, prompting him to quickly spin around and direct his flashlight towards the dense crops situated to his right. However, the narrow beam of light only manages to penetrate a mere few feet into the thick crops. Graham finds himself holding his breath in tense anticipation as he makes this sudden move, and in the very same moment, he inadvertently drops the flashlight. The illuminating beam extinguishes as it hits the ground, leaving him in darkness. Kneeling down, Graham fumbles anxiously in the darkness, his hands groping over the ground in every direction until, with relief, they make contact with the lost flashlight. As he attempts to stand back up, he stumbles backward into the crops, becoming entangled in the mass of leaves and stalks as he struggles to regain his footing. Eventually, he manages to rise and begins to run, feeling the relentless slap of leaves and stalks against him from every angle. A sensation of something pursuing him closely from behind adds urgency to his movements. In a burst of panic, Graham makes an abrupt right turn, instinctively lifting his hands to shield his face and eyes from potential harm. He then makes another quick left turn, continuing to run with a sense of urgency across the yard until he finally steps into the safety of the familiar kitchen. His hair is disheveled, and his shirt bears several clinging leaves from the corn stalks, yet the children remain too preoccupied to notice his entrance. Graham takes two slow, measured steps toward the kitchen table and gradually sinks into a chair, watching as the children joyfully splash water at each other at the sink while they clean the dinner dishes. His gentle, kind eyes gaze intently at the ground as he works to calm his racing mind, his breathing settling into a slow and controlled pant. The children cease their playful antics and look up at Graham, their eyes following his downward stare to the kitchen table. Graham eventually raises his gaze to meet theirs. Morgan reaches into a disorganized pile of videotapes under the television stand, selecting one, but Bo quickly snatches it away just as Morgan tries to insert it into the VCR. Morgan stares back at his sister in frustration, while Graham and Merrill, in a synchronized manner, sink down onto the sofa, their movements slow and dazed by the recent events. Frantically rummaging through the pile of videos, Morgan finally finds one he deems suitable and reaches for the VCR, his breath coming in heavy, wheezing gasps. He moves cautiously to the sofa, settling himself between his father and uncle, as Bo walks over and squeezes in, also taking a seat amongst them. The four of them sit together in quiet companionship, their eyes fixed intently on the television screen as Morgan brings his asthma spray to his mouth and takes a much-needed inhalation. Now, as the family room becomes cloaked in the comforting embrace of darkness and a couple of glasses of Bo's water sit undisturbed on top of the television, the scene feels serene and calming. Bo, utterly peaceful, has fallen asleep resting on Graham's shoulder, while Morgan has drifted off to sleep on Merrill's welcoming lap. Graham, drowsily, shifts his gaze away from the screen toward Merrill, who meets his brother's sleepy eyes with an understanding look before turning his attention back to the television screen, as the room remains enveloped in a gentle quietude."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Bo dashes swiftly to the front bumper and carefully climbs onto the hood, his movements deliberate and quick, while Merrill makes his way up over the side of the vehicle in a fluid motion, joining Morgan on the roof. Merrill keeps a protective hand on his nephew as Morgan raises the monitor high above his head, showing a strong grip and determined focus. Meanwhile, a sudden motion catches Graham's attention, prompting him to spin on his heel and direct his flashlight toward the crops to his right. However, the dim light only manages to cut through a few feet of the crop's dense growth. Graham pauses for a moment, holding his breath with a mix of anticipation and fear, then, in a sudden and unplanned gesture, turns and inadvertently lets go of the flashlight. As it falls, the beam of light is extinguished upon hitting the ground. Immediately, Graham drops to his knees, his hands sweeping over the dark ground in a desperate attempt to locate the flashlight amidst the obscurity. Finally, his fingers make contact with it, but as he attempts to rise, he tangles himself in the stalks, causing him to stumble backward into the thick crops. Struggling to regain his footing, Graham finally manages to stand upright and begins running, the leaves and stalks whipping against him from all sides, while an indistinct presence trails behind. With urgency, Graham abruptly veers to the right, instinctively raising his hands to shield his face and eyes from further assault by the foliage, then quickly changes direction again with a left turn. He continues his sprint across the open yard until the welcome relief of the kitchen greets him. His disheveled hair and shirt, adorned with stray leaves from the corn stalks, go unnoticed by the children who remain absorbed in each other's company. Graham takes a couple of measured steps towards the kitchen table and eases himself into a chair as the children relive their playful antics at the sink, splashing each other while attending to the dinner dishes. With a demeanor reflecting gentle weariness, his kind eyes lower to the ground, allowing him to calm his racing mind and regulate his breathing to a slow, controlled pant. The children's playful banter subsides as they become aware of Graham's presence, turning their attention to him and following his gaze to the kitchen table. Graham eventually lifts his eyes to meet theirs. Morgan steps forward, sifting through a pile of video tapes nestled under the television stand, and selects one with determination. Before he can place it into the VCR, Bo swiftly intercepts it, causing Morgan to lock eyes with his sister in a silent exchange. As Morgan resumes his search through the videos with urgency, breathing heavily and wheezing from exertion, Graham and Merrill find their places on the sofa, mirroring each other's slow, dazed movements as they sit down. Morgan locates another tape, reaches for the VCR with newfound purpose, and then joins his father and uncle on the sofa, sinking into a seat positioned between the two. As Bo wanders over, she nestles in alongside them. Together, all four family members fix their gaze on the television, a shared sense of anticipation filling the room. Morgan pauses briefly to bring his asthma spray to his mouth, inhaling deeply. With the family room now shrouded in darkness, faint illumination comes from the glow of a couple of glasses of Bo's water resting on the television. As the evening progresses, Bo drifts into a peaceful slumber against Graham's shoulder, while Morgan finds rest in Merrill's lap. Graham, his eyes heavy with fatigue, slowly turns his gaze from the flickering screen to Merrill, sharing a silent moment of connection when their eyes meet. Merrill looks from Graham to the TV screen, a shared understanding passing between them as the quiet night envelops them."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Bo climbs onto the hood of the vehicle, while Merrill joins Morgan on the roof and steadies his nephew as Morgan raises the monitor. Nearby, movement prompts Graham to turn and illuminate the crops with his flashlight, but the light barely penetrates. Startled, he drops the flashlight, which turns off as it hits the ground. Graham kneels, feeling around in the darkness until he recovers it, then stumbles into the crops while attempting to stand. Regaining his footing, he runs, pushing through the leaves and stalks, with something pursuing him. He makes abrupt turns to avoid obstacles, finally reaching the kitchen, disheveled with corn stalk remnants on his shirt. The children, distracted by cleaning dishes, don't notice him as he quietly sits at the table, calming his breathing. When they do, they follow his gaze until he looks up. Morgan takes a videotape from under the television, but Bo grabs it before he can load it into the VCR. As Morgan retrieves another tape and breathes heavily, he joins his father and uncle on the sofa, with Bo squeezing in beside them. Morgan uses his inhaler, and the four watch the TV, with Bo asleep on Graham's shoulder and Morgan on Merrill's lap. Graham glances at Merrill, who returns his gaze before they both look at the screen."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Bo runs to the front bumper of the old family pickup truck, a vehicle that has been in the family for years and holds countless memories, and climbs onto the hood, while Merrill, a former minor league baseball player known for his agility, climbs up over the side and joins Morgan on the roof, keeping a hand on his nephew as Morgan raises the monitor above his head to get a better signal. There's movement right next to him, causing Graham to spin and aim the flashlight at the crops to his right, but the light only penetrates a few feet into the dense cornfield, which stretches out for acres around their rural farmhouse. Graham holds his breath, turns, and drops the flashlight at the same time, causing the beam of light to turn off when the flashlight hits the ground with a soft thud. Graham kneels down and gropes in the darkness, searching with his hands over the rough, dirt-covered ground in all directions until they finally touch the flashlight. He tries to get up but stumbles backward into the thick rows of crops, tangled as he struggles to rise. He gets up and starts running, with leaves and stalks slapping him from all directions and something, perhaps just the eerie stillness of the night, coming behind. Graham makes a sudden right turn, putting his hands in front of him to protect his face and eyes from the scratchy stalks, then makes another sudden left turn, and keeps running across the yard until he steps into the warm and familiar kitchen. His hair is messed and his shirt has a few leaves from corn stalks stuck to it, but the children, caught in their playful routine, don't notice his presence. Graham takes two steps to the kitchen table, an old oak table handed down from his parents, and slowly takes a seat as the children splash each other at the sink while cleaning the dinner dishes from their evening meal. His kind eyes stare down at the ground as he slows his mind, his breathing a slow controlled pant. The children stop playing and look up to Graham, following his stare to the kitchen table until Graham looks up at them. Morgan reaches into the pile of video tapes under the television stand, tapes from the family's vast collection of old movies, grabs one, and Bo snatches it as Morgan tries to put it into the VCR, an old model that occasionally jams. Morgan stares at his sister, while Graham and Merrill sit down at the same time on the sofa, an old, comfortable piece of furniture, with the same dazed, slow movements. Morgan rummages through the pile of videos frantically, finds one, and reaches for the VCR, breathing heavily and wheezing, a reminder of his childhood bouts of asthma. He moves to the sofa and takes a seat between his father and his uncle, as Bo walks over and squeezes in also. The four of them stare at the television as Morgan brings his asthma spray to his mouth and inhales, feeling the relief of the medication. The family room lights are off now, with a couple of glasses of Bo's water on the television, a habit she developed since hearing about the importance of hydration. Bo is asleep on Graham's shoulder, and Morgan is asleep on Merrill's lap, while Graham turns his sleepy eyes away from the screen to Merrill, who looks his brother in the eyes, sharing an unspoken bond forged over years of shared experiences, and then at the TV screen."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He moves to the sofa and takes a seat between his father and his uncle as Bo walks over and squeezes in also Bo runs to the front bumper and climbs onto the hood while Merrill climbs up over the side and joins Morgan on the roof keeping a hand on his nephew as Morgan raises the monitor above his head Graham holds his breath turns and drops the flashlight at the same time causing the beam of light to turn off when the flashlight hits the ground Bo is asleep on Graham's shoulder and Morgan is asleep on Merrill's lap while Graham turns his sleepy eyes away from the screen to Merrill who looks his brother in the eyes and then at the TV screen There is movement right next to him causing Graham to spin and aim the flashlight at the crops to his right but the light only penetrates a few feet into the crops Graham kneels down and gropes in the darkness searching with his hands over the ground in all directions until they finally touch the flashlight Morgan reaches into the pile of video tapes under the television stand grabs one and Bo snatches it as Morgan tries to put it into the VCR There is movement right next to him causing Graham to spin and aim the flashlight at the crops to his right but the light only penetrates a few feet into the crops Graham holds his breath turns and drops the flashlight at the same time causing the beam of light to turn off when the flashlight hits the ground Graham kneels down and gropes in the darkness searching with his hands over the ground in all directions until they finally touch the flashlight He tries to get up but stumbles backward into the crops tangled as he struggles to rise He gets up and starts running with leaves and stalks slapping him from all directions and something coming behind Graham makes a sudden right turn putting his hands in front of him to protect his face and eyes then makes another sudden turn left and keeps running across the yard until he steps into the kitchen His hair is messed and his shirt has a few leaves from corn stalks stuck to it but the children do not notice his presence Graham takes two steps to the kitchen table and slowly takes a seat as the children splash each other at the sink while cleaning the dinner dishes His kind eyes stare down at the ground as he slows his mind his breathing a slow controlled pant The four of them stare at the television as Morgan brings his asthma spray to his mouth and inhales The children stop playing and look up to Graham following his stare to the kitchen table until Graham looks up at them Morgan reaches into the pile of video tapes under the television stand grabs one and Bo snatches it as Morgan tries to put it into the VCR Graham takes two steps to the kitchen table and slowly takes a seat as the children splash each other at the sink while cleaning the dinner dishes Morgan stares at his sister while Graham and Merrill sit down at the same time on the sofa with the same dazed slow movements Morgan rummages through the pile of videos frantically finds one and reaches for the VCR breathing heavily and wheezing He moves to the sofa and takes a seat between his father and his uncle as Bo walks over and squeezes in also The four of them stare at the television as Morgan brings his asthma spray to his mouth and inhales The family room lights are off now with a couple of glasses of Bo's water on the television Bo runs to the front bumper and climbs onto the hood while Merrill climbs up over the side and joins Morgan on the roof keeping a hand on his nephew as Morgan raises the monitor above his head Bo is asleep on Graham's shoulder and Morgan is asleep on Merrill's lap while Graham turns his sleepy eyes away from the screen to Merrill who looks his brother in the eyes and then at the TV screen"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Bo runs to the front bumper and climbs onto the hood while Merrill climbs up over the side and joins Morgan on the roof keeping a hand on his nephew as Morgan raises the monitor above his head. There is movement right next to him causing Graham to spin and aim the flashlight at the crops to his right but the light only penetrates a few feet into the crops. Graham holds his breath turns and drops the flashlight at the same time causing the beam of light to turn off when the flashlight hits the ground. Graham kneels down and gropes in the darkness searching with his hands over the ground in all directions until they finally touch the flashlight. He tries to get up but stumbles backward into the crops tangled as he struggles to rise. He gets up and starts running with leaves and stalks slapping him from all directions and something coming behind. Graham makes a sudden right turn putting his hands in front of him to protect his face and eyes then makes another sudden turn left and keeps running across the yard until he steps into the kitchen. His hair is messed and his shirt has a few leaves from corn stalks stuck to it but the children do not notice his presence. Graham takes two steps to the kitchen table and slowly takes a seat as the children splash each other at the sink while cleaning the dinner dishes. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. His kind eyes stare down at the ground as he slows his mind his breathing a slow controlled pant. The children stop playing and look up to Graham following his stare to the kitchen table until Graham looks up at them. Morgan reaches into the pile of video tapes under the television stand grabs one and Bo snatches it as Morgan tries to put it into the VCR. Morgan stares at his sister while Graham and Merrill sit down at the same time on the sofa with the same dazed slow movements. Morgan rummages through the pile of videos frantically finds one and reaches for the VCR breathing heavily and wheezing. He moves to the sofa and takes a seat between his father and his uncle as Bo walks over and squeezes in also. The four of them stare at the television as Morgan brings his asthma spray to his mouth and inhales. The family room lights are off now with a couple of glasses of Bo's water on the television. Bo is asleep on Graham's shoulder and Morgan is asleep on Merrill's lap while Graham turns his sleepy eyes away from the screen to Merrill who looks his brother in the eyes and then at the TV screen."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Bo runs to the front bumper and climbs onto the hood while Merrill climbs up over the side and joins Morgan on the roof keeping a hand on his nephew as Morgan raises the monitor above his head. There is movement right next to him causing Graham to spin and aim the flashlight at the crops to his right but the light only penetrates a few feet into the crops. Graham holds his breath turns and drops the flashlight at the same time causing the beam of light to turn off when the flashlight hits the ground. Graham kneels down and gropes in the darkness searching with his hands over the ground in all directions until they finally touch the flashlight. He tries to get up but stumbles backward into the crops tangled as he struggles to rise. He gets up and starts running with leaves and stalks slapping him from all directions and something coming behind. Graham makes a sudden right turn putting his hands in front of him to protect his face and eyes then makes another sudden turn left and keeps running across the yard until he steps into the kitchen. His hair is messed and his shirt has a few leaves from corn stalks stuck to it but the children do not notice his presence. Graham takes two steps to the kitchen table and slowly takes a seat as the children splash each other at the sink while cleaning the dinner dishes. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. His kind eyes stare down at the ground as he slows his mind his breathing a slow controlled pant. The children stop playing and look up to Graham following his stare to the kitchen table until Graham looks up at them. Morgan reaches into the pile of video tapes under the television stand grabs one and Bo snatches it as Morgan tries to put it into the VCR. Morgan stares at his sister while Graham and Merrill sit down at the same time on the sofa with the same dazed slow movements. Morgan rummages through the pile of videos frantically finds one and reaches for the VCR breathing heavily and wheezing. He moves to the sofa and takes a seat between his father and his uncle as Bo walks over and squeezes in also. The four of them stare at the television as Morgan brings his asthma spray to his mouth and inhales. The family room lights are off now with a couple of glasses of Bo's water on the television. Bo is asleep on Graham's shoulder and Morgan is asleep on Merrill's lap while Graham turns his sleepy eyes away from the screen to Merrill who looks his brother in the eyes and then at the TV screen."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Bo runs to the front bumper and climbs onto the hood while Merrill climbs up over the side and joins Morgan on the roof keeping a hand on his nephew as Morgan raises the monitor above his head. There is movement right next to him causing Graham to spin and aim the flashlight at the crops to his right but the light only penetrates a few feet into the crops. Graham holds his breath turns and drops the flashlight at the same time causing the beam of light to turn off when the flashlight hits the ground. Graham kneels down and gropes in the darkness searching with his hands over the ground in all directions until they finally touch the flashlight. He tries to get up but stumbles backward into the crops tangled as he struggles to rise. He moves to the sofa and takes a seat between his father and his uncle as Bo walks over and squeezes in also. The four of them stare at the television as Morgan brings his asthma spray to his mouth and inhales. The family room lights are off now with a couple of glasses of Bo's water on the television. Bo is asleep on Graham's shoulder and Morgan is asleep on Merrill's lap while Graham turns his sleepy eyes away from the screen to Merrill who looks his brother in the eyes and then at the TV screen."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Bo runs to the front bumper and climbs onto the hood while Merrill climbs up over the side and joins Morgan on the roof keeping a hand on his nephew as Morgan raises the monitor above his head. There is movement right next to him causing Graham to spin and aim the flashlight at the crops to his right but the light only penetrates a few feet into the crops. The family room lights are off now with a couple of glasses of Bo's water on the television. Bo is asleep on Graham's shoulder and Morgan is asleep on Merrill's lap while Graham turns his sleepy eyes away from the screen to Merrill who looks his brother in the eyes and then at the TV screen."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Bo runs to the front bumper and climbs onto the hood, while a giraffe climbs up over the side and joins a penguin on the roof, keeping a hand on its nephew as the penguin raises the monitor above its head. There's movement right next to it, causing a dolphin to spin and aim the flashlight at the crops to its right, but the light only penetrates a few feet into the crops. The dolphin holds its breath, turns, and drops the flashlight at the same time, causing the beam of light to turn off when the flashlight hits the ground. The dolphin kneels down and gropes in the darkness, searching with its hands over the ground in all directions until they finally touch the flashlight. It tries to get up but stumbles backward into the crops, tangled as it struggles to rise. It gets up and starts running, with leaves and stalks slapping it from all directions and something coming behind. The dolphin makes a sudden right turn, putting its hands in front of it to protect its face and eyes, then makes another sudden turn left, and keeps running across the yard until it steps into the kitchen. Its hair is messed and its shirt has a few leaves from corn stalks stuck to it, but the raccoons don't notice its presence. The dolphin takes two steps to the kitchen table and slowly takes a seat as the raccoons splash each other at the sink while cleaning the dinner dishes. Its kind eyes stare down at the ground as it slows its mind, its breathing a slow controlled pant. The raccoons stop playing and look up to the dolphin, following its stare to the kitchen table until the dolphin looks up at them. The penguin reaches into the pile of video tapes under the television stand, grabs one, and Bo snatches it as the penguin tries to put it into the VCR. The penguin stares at its sister, while the dolphin and the giraffe sit down at the same time on the sofa with the same dazed, slow movements. The penguin rummages through the pile of videos frantically, finds one, and reaches for the VCR, breathing heavily and wheezing. It moves to the sofa and takes a seat between its father and its uncle, as Bo walks over and squeezes in also. The four of them stare at the television as the penguin brings its asthma spray to its mouth and inhales. The family room lights are off now, with a couple of glasses of Bo's water on the television. Bo is asleep on the dolphin's shoulder, and the penguin is asleep on the giraffe's lap, while the dolphin turns its sleepy eyes away from the screen to the giraffe, who looks its brother in the eyes and then at the TV screen."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Bo runs to the front grill and climbs onto the car, while Merrill climbs up over the fender and joins Morgan on the canopy, keeping a hand on his nephew as Morgan raises the radio above his head. There's movement right next to him, causing Graham to spin and aim the lantern at the trees to his right, but the light only penetrates a few feet into the trees. Graham holds his breath, turns, and drops the lantern at the same time, causing the beam of light to turn off when the lantern hits the soil. Graham kneels down and gropes in the darkness, searching with his hands over the soil in all directions until they finally touch the lantern. He tries to get up but stumbles backward into the trees, tangled as he struggles to rise. He gets up and starts running, with branches and twigs slapping him from all directions and something coming behind. Graham makes a sudden right turn, putting his hands in front of him to protect his face and eyes, then makes another sudden turn left, and keeps running across the lawn until he steps into the pantry. His hair is messed and his shirt has a few leaves from oak twigs stuck to it, but the children don't notice his presence. Graham takes two steps to the pantry counter and slowly takes a seat as the children splash each other at the basin while cleaning the lunch trays. His kind eyes stare down at the tiles as he slows his mind, his breathing a slow controlled pant. The children stop playing and look up to Graham, following his stare to the pantry counter until Graham looks up at them. Morgan reaches into the pile of comic books under the bookshelf, grabs one, and Bo snatches it as Morgan tries to put it into the DVD player. Morgan stares at his sister, while Graham and Merrill sit down at the same time on the armchair with the same dazed, slow movements. Morgan rummages through the pile of comics frantically, finds one, and reaches for the DVD player, breathing heavily and wheezing. He moves to the armchair and takes a seat between his father and his uncle, as Bo walks over and squeezes in also. The four of them stare at the wall as Morgan brings his nasal spray to his mouth and inhales. The living room lights are off now, with a couple of mugs of Bo's lemonade on the wall unit. Bo is asleep on Graham's shoulder, and Morgan is asleep on Merrill's lap, while Graham turns his sleepy eyes away from the wallpaper to Merrill, who looks his brother in the eyes and then at the wall unit."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Bo jogs to the front bumper and bounds onto the hood, while Merrill clambers up over the side and perches next to Morgan on the roof, keeping a hand on his nephew as Morgan hoists the monitor above his head. There's a sound right next to him, prompting Graham to whirl and swing the flashlight at the crops to his right, but the light only grazes a few feet into the crops. Graham inhales deeply, swivels, and flings the flashlight at the same time, causing the beam of light to vanish when the flashlight strikes the ground. Graham crouches down and fumbles in the darkness, feeling with his hands over the ground in various directions until they ultimately encounter the flashlight. He attempts to stand up but trips backward into the crops, ensnared as he fights to rise. He stands up and begins strolling, with leaves and stalks brushing against him from all directions and something following behind. Graham makes a sudden right turn, putting his hands beside him to guard his face and eyes, then makes another abrupt turn left, and continues strolling across the yard until he stumbles into the kitchen. His hair is tousled and his shirt has a few leaves from corn stalks attached to it, but the children don't register his presence. Graham takes two steps to the kitchen table and slowly perches as the children splash each other at the sink while tidying the dinner dishes. His kind eyes gaze down at the ground as he calms his mind, his breathing a deliberate controlled sigh. The children cease playing and glance up to Graham, following his gaze to the kitchen table until Graham looks up at them. Morgan digs into the pile of video tapes under the television stand, seizes one, and Bo nabs it as Morgan tries to slot it into the VCR. Morgan glares at his sister, while Graham and Merrill settle down at the same time on the sofa with the same languid, slow movements. Morgan digs through the pile of videos frantically, locates one, and reaches for the VCR, breathing heavily and panting. He shuffles to the sofa and nestles between his father and his uncle, as Bo ambles over and squeezes in as well. The four of them gaze at the television as Morgan raises his asthma spray to his mouth and exhales. The family room lights are off now, with a couple of glasses of Bo's water on the television. Bo dozes off on Graham's shoulder, and Morgan naps on Merrill's lap, while Graham turns his drowsy eyes from the screen to Merrill, who meets his brother's gaze and then at the TV screen."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The kite runs to the front billboard and climbs onto the hammock, while the suitcase climbs up over the bench and joins the frisbee on the balcony, keeping a hand on its umbrella as the frisbee raises the telescope above its head. There's movement right next to it, causing the bicycle to spin and aim the flashlight at the reeds to its right, but the light only penetrates a few feet into the reeds. The bicycle holds its breath, turns, and drops the flashlight at the same time, causing the beam of light to turn off when the flashlight hits the ground. The bicycle kneels down and gropes in the darkness, searching with its hands over the ground in all directions until they finally touch the flashlight. It tries to get up but stumbles backward into the reeds, tangled as it struggles to rise. It gets up and starts running, with fabric and wires slapping it from all directions and something coming behind. The bicycle makes a sudden right turn, putting its hands in front of it to protect its face and eyes, then makes another sudden turn left, and keeps running across the arena until it steps into the tent. Its hair is messed and its coat has a few threads from plant fibers stuck to it, but the flowers don't notice its presence. The bicycle takes two steps to the tent pillar and slowly takes a seat as the flowers splash each other at the basin while cleaning the lunch trays. Its kind eyes stare down at the ground as it slows its mind, its breathing a slow controlled pant. The flowers stop dancing and look up to the bicycle, following its stare to the tent pillar until the bicycle looks up at them. The frisbee reaches into the pile of albums under the bookshelf, grabs one, and the kite snatches it as the frisbee tries to put it into the turntable. The frisbee stares at its sibling, while the bicycle and the suitcase sit down at the same time on the carpet with the same dazed, slow movements. The frisbee rummages through the pile of albums frantically, finds one, and reaches for the turntable, breathing heavily and wheezing. It moves to the carpet and takes a seat between its telescope and its painting, as the kite walks over and squeezes in also. The four of them stare at the painting as the frisbee brings its whistle to its mouth and inhales. The living tent lights are off now, with a couple of glasses of the kite's juice on the bookshelf. The kite is asleep on the bicycle's shoulder, and the frisbee is asleep on the suitcase's lap, while the bicycle turns its sleepy eyes away from the canvas to the suitcase, who looks its sibling in the eyes and then at the canvas."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Arlo sprints to the front bumper and jumps onto the hood, while Bennett swings up over the side and joins Casey on the roof, holding a hand on his cousin as Casey hoists the monitor above his head. There's rustling right beside him, prompting Oliver to whirl and direct the flashlight at the crops to his right, but the beam only illuminates a few feet into the crops. Oliver catches his breath, pivots, and releases the flashlight at the same moment, causing the beam to extinguish when the flashlight touches the ground. Oliver crouches and searches in the darkness, feeling with his fingers over the ground in all directions until they finally grasp the flashlight. He attempts to stand but stumbles backward into the crops, caught as he fights to rise. He stands up and begins sprinting, with leaves and stalks brushing him from all sides and something trailing behind. Oliver makes a sudden right turn, placing his hands in front of him to shield his face and eyes, then makes another abrupt left turn, and continues running across the yard until he stumbles into the kitchen. His hair is tousled and his shirt has a few leaves from corn stalks clinging to it, but the kids don't notice his entrance. Oliver takes two steps to the kitchen table and slowly lowers himself as the kids splatter each other at the sink while scrubbing the dinner plates. His gentle eyes gaze down at the ground as he calms his mind, his breath a slow controlled gasp. The kids cease their play and look up to Oliver, following his gaze to the kitchen table until Oliver gazes up at them. Casey delves into the stack of video tapes under the television stand, grabs one, and Arlo snatches it as Casey tries to insert it into the VCR. Casey glares at his sibling, while Oliver and Bennett settle down at the same time on the sofa with the same lethargic, slow motions. Casey rummages through the heap of videos urgently, finds one, and reaches for the VCR, breathing heavily and coughing. He shifts to the sofa and takes a seat between his dad and his uncle, as Arlo walks over and squeezes in too. The four of them gaze at the television as Casey brings his inhaler to his mouth and inhales. The family room lights are off now, with a couple of glasses of Arlo's water on the television. Arlo is dozing on Oliver's shoulder, and Casey is napping on Bennett's lap, while Oliver turns his drowsy eyes away from the screen to Bennett, who looks his brother in the eyes and then at the TV screen."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Bo sprints to the back wheel and swings onto the trunk, while Merrill clambers over the fender and joins Morgan on the chimney, keeping a hand on his nephew as Morgan lifts the laptop above his head. There's a rustle right next to him, causing Graham to twirl and direct the spotlight at the bushes to his right, but the glow only reaches a few inches into the bushes. Graham holds his breath, pivots, and tosses the spotlight at the same moment, causing it to flicker off when it strikes the earth. Graham crouches down and fumbles in the shadows, probing with his fingers over the earth in all directions until they finally touch the spotlight. He tries to rise but trips backward into the bushes, ensnared as he struggles to stand. He stands up and begins sprinting, with twigs and branches brushing him from all sides and something trailing behind. Graham makes an abrupt left turn, placing his palms ahead to shield his face and eyes, then makes another abrupt right, and keeps sprinting across the lawn until he steps into the pantry. His hair is disheveled and his shirt has a few twigs from berry bushes clinging to it, but the children don't notice his arrival. Graham takes two strides to the kitchen counter and slowly settles into a chair as the children splash each other at the fountain while rinsing the supper pots. His gentle eyes observe the surface as he calms his thoughts, his breathing a slow, measured puff. The children cease their frolic and glance up to Graham, trailing his gaze to the countertop until Graham lifts his eyes to them. Morgan reaches into the stack of video games under the bookshelf, grabs one, and Bo snatches it as Morgan attempts to insert it into the game console. Morgan gawks at his sister, while Graham and Merrill plop down simultaneously on the loveseat with the same stunned, gradual motions. Morgan rifles through the heap of games frantically, finds one, and reaches for the console, breathing heavily and gasping. He shifts to the loveseat and settles between his father and his uncle, as Bo ambles over and squeezes in as well. The four of them gaze at the display as Morgan brings his inhaler to his mouth and takes a puff. The living room lights are off now, with a couple of mugs of Bo's soda on the table. Bo is asleep on Graham's shoulder, and Morgan is asleep on Merrill's lap, while Graham turns his drowsy eyes away from the display to Merrill, who looks his brother in the eyes and then at the screen."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Finn dashes to the rear tire and swings onto the trunk, while Casey scrambles up over the railing and joins Alex on the ladder, keeping a toe on his cousin as Alex hoists the basket over his shoulder. There's rustling right beside him, making Sam to leap and point the torch at the bushes to his left, but the beam only pierces a couple of inches into the shrubs. Sam holds his throat, spins, and hurls the torch at the same moment, causing the shaft of light to flicker off when the torch strikes the pavement. Sam crouches down and fumbles in the haze, sweeping with his fingers over the pavement in all directions until they eventually graze the torch. He attempts to stand but tumbles forward into the hedges, enmeshed as he strives to rise. He stands and begins sprinting, with branches and stems smacking him from all angles and a shadow approaching behind. Sam takes a swift left pivot, placing his elbows in front of him to shield his nose and chin, then takes another quick pivot right, and continues sprinting across the clearing until he steps into the library. His hat is askew and his jacket has a few petals from rose vines stuck to it, but the youngsters don't notice his entrance. Sam takes two strides to the dining bench and cautiously takes a perch as the youngsters splash one another at the basin while rinsing the breakfast cups. His warm eyes fixate down at the carpet as he calms his thoughts, his respiration a steady controlled gasp. The youngsters cease splashing and glance up to Sam, tracing his gaze to the dining bench until Sam gazes up at them. Alex reaches into the stack of novels under the radio shelf, snatches one, and Finn seizes it as Alex attempts to slide it into the DVD player. Alex glowers at his sibling, while Sam and Casey sink down simultaneously on the couch with the same bewildered, deliberate actions. Alex digs through the heap of books frantically, locates one, and reaches for the DVD player, panting heavily and gasping. He shifts to the couch and takes a perch between his uncle and his aunt, as Finn strolls over and squeezes in too. The four of them gaze at the radio as Alex lifts his water bottle to his lips and sips. The lounge lights are dimmed now, with a few mugs of Finn's tea on the projector. Finn is napping on Sam's arm, and Alex is dozing on Casey's knees, while Sam diverts his weary eyes from the display to Casey, who meets his sibling in the gaze and then at the radio display."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Bo climbs onto the hood while Merrill joins Morgan on the roof, keeping a hand on his nephew as Morgan raises the monitor. Graham, startled by movement, drops his flashlight, losing its beam. He gropes in the dark, retrieves it, then stumbles and runs through the crops, pursued and slapped by leaves. Entering the kitchen disheveled, the children don’t notice him until he sits at the table, panting and calming his mind. As the children finish dishes, Morgan fetches a video tape, and Bo snatches it. Graham and Merrill sit on the sofa, dazed. Morgan finds another tape, sits between his father and uncle, and uses his asthma spray. With the lights off, Bo and Morgan fall asleep on their elders. Graham and Merrill exchange a tired look before turning back to the TV."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Bo is asleep on Graham's shoulder and Morgan is asleep on Merrill's lap while Graham turns his sleepy eyes away from the screen to Merrill who looks his brother in the eyes and then at the TV screen The family room lights are off now with a couple of glasses of Bo's water on the television The four of them stare at the television as Morgan brings his asthma spray to his mouth and inhales He moves to the sofa and takes a seat between his father and his uncle as Bo walks over and squeezes in also Morgan rummages through the pile of videos frantically finds one and reaches for the VCR breathing heavily and wheezing Morgan stares at his sister while Graham and Merrill sit down at the same time on the sofa with the same dazed slow movements Morgan reaches into the pile of video tapes under the television stand grabs one and Bo snatches it as Morgan tries to put it into the VCR The children stop playing and look up to Graham following his stare to the kitchen table until Graham looks up at them His kind eyes stare down at the ground as he slows his mind his breathing a slow controlled pant Graham takes two steps to the kitchen table and slowly takes a seat as the children splash each other at the sink while cleaning the dinner dishes His hair is messed and his shirt has a few leaves from corn stalks stuck to it but the children do not notice his presence Graham makes a sudden right turn putting his hands in front of him to protect his face and eyes then makes another sudden turn left and keeps running across the yard until he steps into the kitchen He gets up and starts running with leaves and stalks slapping him from all directions and something coming behind He tries to get up but stumbles backward into the crops tangled as he struggles to rise Graham kneels down and gropes in the darkness searching with his hands over the ground in all directions until they finally touch the flashlight Graham holds his breath turns and drops the flashlight at the same time causing the beam of light to turn off when the flashlight hits the ground There is movement right next to him causing Graham to spin and aim the flashlight at the crops to his right but the light only penetrates a few feet into the crops Bo runs to the front bumper and climbs onto the hood while Merrill climbs up over the side and joins Morgan on the roof keeping a hand on his nephew as Morgan raises the monitor above his head"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Morgan rummages through the pile of videos frantically finds one and reaches for the VCR breathing heavily and wheezing Morgan stares at his sister while Graham and Merrill sit down at the same time on the sofa with the same dazed slow movements He tries to get up but stumbles backward into the crops tangled as he struggles to rise His kind eyes stare down at the ground as he slows his mind his breathing a slow controlled pant He gets up and starts running with leaves and stalks slapping him from all directions and something coming behind His hair is messed and his shirt has a few leaves from corn stalks stuck to it but the children do not notice his presence The family room lights are off now with a couple of glasses of Bo's water on the television Graham makes a sudden right turn putting his hands in front of him to protect his face and eyes then makes another sudden turn left and keeps running across the yard until he steps into the kitchen The children stop playing and look up to Graham following his stare to the kitchen table until Graham looks up at them The four of them stare at the television as Morgan brings his asthma spray to his mouth and inhales There is movement right next to him causing Graham to spin and aim the flashlight at the crops to his right but the light only penetrates a few feet into the crops Morgan reaches into the pile of video tapes under the television stand grabs one and Bo snatches it as Morgan tries to put it into the VCR Graham holds his breath turns and drops the flashlight at the same time causing the beam of light to turn off when the flashlight hits the ground He moves to the sofa and takes a seat between his father and his uncle as Bo walks over and squeezes in also Bo is asleep on Graham's shoulder and Morgan is asleep on Merrill's lap while Graham turns his sleepy eyes away from the screen to Merrill who looks his brother in the eyes and then at the TV screen Graham takes two steps to the kitchen table and slowly takes a seat as the children splash each other at the sink while cleaning the dinner dishes Bo runs to the front bumper and climbs onto the hood while Merrill climbs up over the side and joins Morgan on the roof keeping a hand on his nephew as Morgan raises the monitor above his head Graham kneels down and gropes in the darkness searching with his hands over the ground in all directions until they finally touch the flashlight"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "His kind eyes stare down at the ground as he slows his mind his breathing a slow controlled pant The children stop playing and look up to Graham following his stare to the kitchen table until Graham looks up at them Morgan reaches into the pile of video tapes under the television stand grabs one and Bo snatches it as Morgan tries to put it into the VCR Morgan stares at his sister while Graham and Merrill sit down at the same time on the sofa with the same dazed slow movements Morgan rummages through the pile of videos frantically finds one and reaches for the VCR breathing heavily and wheezing He moves to the sofa and takes a seat between his father and his uncle as Bo walks over and squeezes in also The four of them stare at the television as Morgan brings his asthma spray to his mouth and inhales The family room lights are off now with a couple of glasses of Bo's water on the television Bo is asleep on Graham's shoulder and Morgan is asleep on Merrill's lap while Graham turns his sleepy eyes away from the screen to Merrill who looks his brother in the eyes and then at the TV screen Bo runs to the front bumper and climbs onto the hood while Merrill climbs up over the side and joins Morgan on the roof keeping a hand on his nephew as Morgan raises the monitor above his head There is movement right next to him causing Graham to spin and aim the flashlight at the crops to his right but the light only penetrates a few feet into the crops Graham holds his breath turns and drops the flashlight at the same time causing the beam of light to turn off when the flashlight hits the ground Graham kneels down and gropes in the darkness searching with his hands over the ground in all directions until they finally touch the flashlight He tries to get up but stumbles backward into the crops tangled as he struggles to rise He gets up and starts running with leaves and stalks slapping him from all directions and something coming behind Graham makes a sudden right turn putting his hands in front of him to protect his face and eyes then makes another sudden turn left and keeps running across the yard until he steps into the kitchen His hair is messed and his shirt has a few leaves from corn stalks stuck to it but the children do not notice his presence Graham takes two steps to the kitchen table and slowly takes a seat as the children splash each other at the sink while cleaning the dinner dishes"
        }
      ]
    }
  ]
}