{
  "ground_truth": "Gandhi starts to go down, and others around him, convinced by the authority of his voice, follow suit. The sense of the idea seizes Gandhi, and as the sound of the galloping horses nears, he turns and shouts too. The miners begin to go down, some face up, shielding their faces with their hands, some burying their faces in the earth and covering their heads with their hands. The sergeant's point of view shows a close fast traveling shot to the prone miners. Close on Gandhi, we see his arms crossed in front of his face, staring up, frightened but determined to bear it. The horses cannot bring themselves to gallop over the human carpet; they rear, plunge, and swerve. Gandhi turns to see the sergeant thrown off his horse, landing heavily, scrambling up, furious, and darting after it. Mounting again, the sergeant is enraged to hear laughter. Gandhi's command, angry in its own way but carrying all the weight of his influence, causes them to begin to go down again. The sergeant wheels his horse and rides at Gandhi. With a deliberate, almost fatalistic pace, Gandhi goes first to his knees and then sprawls down flat, his hands over the top of his head, awaiting the blow of the horse's hoof. A close shot of the horse's head shows its eyes rolling as it swerves again, while the sergeant, cursing, is unable to make it plunge down on the man. Surveying the whole procession sprawled on the ground, the sergeant, angrily wheeling his horse, sees his mounted police circling in front of them, unsure of what to do. He turns his horse angrily and gallops back toward the factories. Gandhi, Singh, and Tyeb Mohammed look off at the retreating horses. The car with the civilian has returned in the distance, and the sergeant wheels by it as his police turn their horses, lining up across the road again. Gandhi and the miners come on once more, chanting forcefully. Meanwhile, a congregation listens stiffly and unsympathetically to a clergyman who has given Charlie the use of his pulpit and sits beneath it, embarrassed but resolute. As Charlie struggles on, a few men in the congregation rise, escorting their families from the church, with more members rising and marching out, though a few pointedly do not. Gandhi threads his way in a line for soup, which winds through masses of prisoners, some with bowls, eating, some not yet in line. As Gandhi nears the two stone blocks holding the large barrels of soup, he sees that Khan is serving from one of them.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Gandhi begins to descend, and others around him, persuaded by the power of his voice, follow suit. The sense of the concept grips Gandhi, and as the noise of the galloping steeds approaches, he turns and shouts too. The miners commence to descend, some supine, shielding their faces with their hands, some burying their faces in the soil and covering their heads with their hands. The sergeant's perspective displays a close fast-moving shot to the prone miners. Close on Gandhi, we observe his arms crossed in front of his face, gazing up, scared but resolved to endure it. The horses cannot bring themselves to charge over the human carpet; they rear, dive, and veer. Gandhi turns to witness the sergeant thrown off his horse, landing heavily, scrambling up, furious, and darting after it. Mounting again, the sergeant is infuriated to hear laughter. Gandhi's command, indignant in its own manner but carrying all the weight of his sway, prompts them to commence to descend again. The sergeant wheels his horse and rides at Gandhi. With an intentional, almost resigned pace, Gandhi goes first to his knees and then sprawls down flat, his hands over the top of his head, awaiting the strike of the horse's hoof. A close shot of the horse's head displays its eyes rolling as it veers again, while the sergeant, cursing, is unable to make it dive down on the man. Observing the whole procession sprawling on the ground, the sergeant, irritably wheeling his horse, sees his mounted police circling in front of them, unsure of what to do. He turns his horse furiously and gallops back toward the factories. Gandhi, Singh, and Tyeb Mohammed gaze at the retreating steeds. The car with the civilian has returned in the distance, and the sergeant wheels by it as his police turn their horses, aligning across the road again. Gandhi and the miners advance once more, chanting forcefully. Meanwhile, a gathering listens stiffly and unsympathetically to a clergyman who has given Charlie the use of his pulpit and sits beneath it, embarrassed but steadfast. As Charlie struggles on, a few men in the gathering rise, escorting their families from the church, with more members rising and marching out, though a few pointedly do not. Gandhi threads his way in a line for broth, which winds through masses of prisoners, some with bowls, eating, some not yet in line. As Gandhi nears the two stone blocks holding the large barrels of broth, he sees that Khan is serving from one of them."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Gandhi is started to be gone down by others around him, who are convinced by the authority of his voice, and they follow suit. Gandhi is seized by the sense of the idea, and as the sound of the galloping horses nears, he turns and shouts too. The miners are begun to be gone down by some, some face up, shielding their faces with their hands, some burying their faces in the earth and covering their heads with their hands. A close fast traveling shot to the prone miners is shown by the sergeant's point of view. Close on Gandhi, his arms are seen crossed in front of his face, staring up, frightened but determined to bear it. The horses cannot be brought by themselves to gallop over the human carpet; they rear, plunge, and swerve. Gandhi turns to see the sergeant being thrown off his horse, landing heavily, scrambling up, furious, and darting after it. The sergeant, mounting again, hears laughter and is enraged. The miners are caused to begin to be gone down again by Gandhi’s command, angry in its own way but carrying all the weight of his influence. Gandhi is ridden at by the sergeant, who wheels his horse. With a deliberate, almost fatalistic pace, Gandhi goes first to his knees and then sprawls down flat, his hands over the top of his head, awaiting the blow of the horse's hoof. The horse's head is shown in a close shot, its eyes rolling as it swerves again, while the sergeant, cursing, is unable to make it plunge down on the man. The whole procession sprawled on the ground is surveyed by the sergeant, who angrily wheels his horse and sees his mounted police circling in front of them, unsure of what to do. His horse is turned angrily by him, and he gallops back toward the factories. The retreating horses are looked off at by Gandhi, Singh, and Tyeb Mohammed. In the distance, the car with the civilian returns, and as his police turn their horses, lining up across the road again, the sergeant wheels by it. Gandhi and the miners forcefully chant as they come on once more. Meanwhile, a clergyman stiffly and unsympathetically listens to a congregation that has been given to Charlie for the use of his pulpit, sitting beneath it, embarrassed but resolute. As Charlie struggles on, a few men in the congregation rise, escort their families from the church, with more members rising and marching out, though a few pointedly do not. Gandhi threads his way in a line for soup, which has been wound through masses of prisoners, some with bowls, eating, some not yet in line. As Gandhi nears the two stone blocks holding the large barrels of soup, he sees Khan serving from one of them."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Gandhi begins to go down, and others, convinced by his authority, follow. As galloping horses approach, Gandhi shouts, and miners drop, shielding their faces or burying them in the earth. The sergeant's view shows miners prone. Gandhi, arms crossed, looks up, frightened but determined. The horses can't gallop over them; they rear and swerve. Gandhi sees the sergeant thrown off his horse, scrambling up, furious. Mounting again, the sergeant hears laughter. Gandhi's command, authoritative and angry, makes them go down again. The sergeant rides at Gandhi, who deliberately sprawls flat, hands over his head, awaiting the horse's blow. The horse swerves, eyes rolling, and the sergeant can't make it plunge. The sergeant, angry, sees his police circling, unsure. He gallops back toward the factories. Gandhi, Singh, and Tyeb Mohammed watch the retreating horses. A car with a civilian returns, and the sergeant wheels by as police line up across the road. Gandhi and the miners advance, chanting. Meanwhile, a congregation listens stiffly to a clergyman who has given Charlie his pulpit. As Charlie speaks, some men escort their families out, while others stay. Gandhi joins a soup line among prisoners, some eating, some waiting. Nearing the soup barrels, he sees Khan serving."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Gandhi begins to go down, and others, convinced by his authority, follow. As galloping horses approach, Gandhi shouts. Miners go down, shielding their faces. The sergeant's view shows miners prone. Gandhi, arms crossed, looks up, frightened but determined. Horses can't gallop over them, rearing and swerving. The sergeant is thrown, remounts, and hears laughter. Gandhi's command makes them go down again. The sergeant rides at Gandhi, who deliberately sprawls flat, awaiting the horse's blow. The horse swerves, and the sergeant can't make it plunge. The sergeant sees his police circling, unsure, and gallops back to the factories. Gandhi, Singh, and Tyeb Mohammed watch the retreating horses. A car returns, and the sergeant wheels by as police line up again. Gandhi and miners chant forcefully. Meanwhile, a congregation listens unsympathetically to a clergyman who gave Charlie his pulpit. As Charlie struggles, some men escort families out, while others stay. Gandhi lines up for soup among prisoners, seeing Khan serving."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Gandhi begins to descend, and those surrounding him, persuaded by the commanding authority of his voice, follow his lead without hesitation. The essence of the idea grips Gandhi firmly, and as the thunderous sound of galloping horses draws nearer, he turns with urgency and shouts as well. The miners start to lower themselves to the ground, some lying face up, shielding their faces with their hands, while others bury their faces into the earth, covering their heads protectively with their hands. From the sergeant's perspective, there is a rapid, close-up shot of the miners lying prone on the ground. Focusing closely on Gandhi, we observe his arms crossed defensively in front of his face, his eyes staring upward, filled with fear yet resolute in his determination to endure the situation. The horses, unable to bring themselves to trample over the human carpet, rear up, plunge, and swerve away. Gandhi turns his gaze to witness the sergeant being thrown off his horse, landing heavily on the ground, scrambling to his feet, furious, and chasing after the horse. Mounting the horse once more, the sergeant is infuriated to hear the sound of laughter. Gandhi's command, though angry in its own right, carries the full weight of his influence, prompting them to begin lowering themselves to the ground once again. The sergeant wheels his horse around and charges at Gandhi. With a deliberate, almost fatalistic pace, Gandhi first drops to his knees and then sprawls flat on the ground, his hands covering the top of his head, bracing himself for the anticipated blow from the horse's hoof. A close-up shot of the horse's head reveals its eyes rolling wildly as it swerves once more, while the sergeant, cursing in frustration, is unable to force it to plunge down upon the man. Surveying the entire procession sprawled on the ground, the sergeant, angrily wheeling his horse around, observes his mounted police circling uncertainly in front of them, unsure of their next move. He turns his horse angrily and gallops back toward the factories. Gandhi, along with Singh and Tyeb Mohammed, looks off at the retreating horses. In the distance, the car with the civilian has returned, and the sergeant wheels by it as his police turn their horses, lining up across the road once more. Gandhi and the miners advance again, chanting with renewed force. Meanwhile, a congregation listens stiffly and unsympathetically to a clergyman who has allowed Charlie the use of his pulpit and sits beneath it, feeling embarrassed yet resolute. As Charlie continues to struggle on, a few men in the congregation rise, escorting their families out of the church, with more members rising and marching out, although a few pointedly choose to remain. Gandhi threads his way through a line for soup, which winds through masses of prisoners, some holding bowls and eating, while others have not yet joined the line. As Gandhi approaches the two stone blocks supporting the large barrels of soup, he notices that Khan is serving from one of them."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Gandhi initiates his descent, and those surrounding him, influenced by the authoritative power of his voice and presence, instinctively follow his lead without the slightest hesitation. The core of the idea grasps Gandhi with unyielding strength, and as the deafening roar of galloping horses approaches ever closer, he swiftly turns with urgency and shouts to galvanize the people around him. The miners begin to lower themselves to the ground with varied movements, some lying face up, using their hands to shield their faces defensively, while others press their faces down into the earth, protecting their heads with their hands. From the perspective of the sergeant, there is a quick, close-up shot capturing the miners sprawled on the ground. As the focus shifts closely to Gandhi, we clearly see his arms crossed protectively in front of his face, his eyes directed upward, filled with a mix of fear and steadfast determination to withstand the unfolding situation. The horses, unable or unwilling to trample over the human carpet before them, rear up, plunge, and swerve away dramatically. Gandhi turns his gaze in time to witness the sergeant being thrown off his horse, landing heavily on the ground, clambering to his feet, filled with anger, and hastily chasing after the horse. As he remounts, the sergeant is enraged by the sound of laughter that greets him. Gandhi's command, though laced with its own anger, carries the full weight and influence of his authoritative presence, prompting them to begin lowering themselves to the ground yet again. The sergeant maneuvers his horse around and charges directly at Gandhi. With deliberate, almost fatalistic slowness, Gandhi first sinks to his knees and then sprawls flat on the ground, his hands covering the top of his head in anticipation of the expected impact from the horse's hoof. A close-up shot of the horse's head reveals its eyes rolling wildly as it swerves away once more, while the sergeant, cursing in frustration, is unable to force it to plunge down upon the man. Surveying the entire procession spread out on the ground, the sergeant, angrily maneuvering his horse around, observes his mounted police circling uncertainly before them, unsure about their next move. He turns his horse angrily and gallops back toward the factories. Gandhi, accompanied by Singh and Tyeb Mohammed, looks off into the distance at the retreating horses. In the far distance, the car with the civilian has returned, and the sergeant wheels by it as his police force repositions their horses, lining up across the road once again. Gandhi and the miners advance once more, their chanting growing in renewed strength and force. Meanwhile, a congregation sits stiffly and unsympathetically as a clergyman, who has granted Charlie the use of his pulpit, listens below, feeling both embarrassed and resolute. As Charlie continues his struggle, a few men in the congregation rise, usher their families out of the church, followed by more members rising and marching out, while a small number pointedly choose to remain. Gandhi navigates his way through a line for soup that snakes through a crowd of prisoners, some clutching bowls and eating, while others have not yet joined the line. As Gandhi approaches the two stone blocks supporting the large barrels of soup, he notices Khan serving from one of them."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Gandhi begins to lower himself to the ground, and those around him, swayed by the authority and conviction in his voice, start to follow his lead. The idea takes hold of Gandhi with a powerful grip, and as the sound of galloping horses grows louder, he turns abruptly and shouts, his voice carrying over the noise. The miners, responding to the urgency of the situation, begin to lower themselves as well; some lie face up, using their hands to shield their faces, while others press their faces into the earth, covering their heads with their hands for protection. From the sergeant's perspective, we see a rapid, close-up shot of the miners lying prone on the ground. Focusing closely on Gandhi, we observe him crossing his arms in front of his face, his eyes fixed upward, a mix of fear and determination etched on his features as he braces himself for what is to come. The horses, confronted with the sight of people sprawled on the ground, hesitate and cannot bring themselves to trample over the human barrier; instead, they rear up, plunge, and swerve to avoid them. Gandhi turns his head to witness the sergeant being thrown off his horse, landing heavily on the ground, then scrambling to his feet, visibly furious, as he chases after the horse. The sergeant, once mounted again, is incensed to hear laughter echoing around him. Gandhi's command, though tinged with anger, carries the full weight of his influence, prompting the miners to lower themselves to the ground once more. The sergeant, filled with rage, directs his horse toward Gandhi. With a deliberate and almost fatalistic slowness, Gandhi first drops to his knees and then stretches out flat on the ground, his hands placed protectively over his head, as he awaits the potential impact of the horse's hooves. A close-up shot of the horse's head reveals its eyes rolling wildly as it swerves again, while the sergeant, cursing under his breath, finds himself unable to force the horse to trample the man. Surveying the entire scene of people sprawled on the ground, the sergeant, still seething with anger, wheels his horse around and observes his mounted police circling uncertainly in front of the prone figures, unsure of their next move. Frustrated, he turns his horse sharply and gallops back toward the factories. Gandhi, along with Singh and Tyeb Mohammed, watches the retreating horses. In the distance, a car carrying a civilian has returned, and the sergeant rides past it as his police turn their horses, forming a line across the road once more. Gandhi and the miners advance again, their voices rising in a forceful chant. Meanwhile, inside a church, a congregation listens stiffly and without sympathy to a clergyman who has allowed Charlie to use his pulpit; Charlie stands beneath it, feeling both embarrassed and resolute. As Charlie continues to speak, a few men in the congregation stand up, escorting their families out of the church, with more members following suit, though a few pointedly remain seated. Gandhi makes his way through a line of prisoners waiting for soup, the line winding through a mass of people, some holding bowls and eating, others still waiting their turn. As Gandhi approaches the two stone blocks supporting the large barrels of soup, he notices that Khan is serving from one of them."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Gandhi initiates a movement to lie down, prompting others to follow his lead. As the sound of galloping horses approaches, Gandhi, seized by the urgency of the moment, shouts a command. The miners respond by lying down, some shielding their faces, others burying them in the earth. The sergeant observes the scene, focusing on Gandhi, who remains resolute despite his fear. The horses, unable to trample the prone miners, rear and swerve. Gandhi watches as the sergeant is thrown from his horse, scrambles up, and remounts, only to be further enraged by laughter. Gandhi's authoritative command prompts the miners to lie down again as the sergeant charges at him. Gandhi deliberately kneels and then lies flat, bracing for the horse's approach. The horse, however, swerves, and the sergeant, frustrated, cannot force it to trample Gandhi. Surveying the scene, the sergeant sees his confused mounted police and angrily retreats toward the factories. Gandhi, Singh, and Tyeb Mohammed watch the retreating horses. Meanwhile, a car with a civilian returns, and the sergeant and his police regroup across the road. Gandhi and the miners advance again, chanting. Concurrently, a congregation listens to a clergyman who has allowed Charlie to use his pulpit. As Charlie speaks, some congregants leave with their families, while others remain. Gandhi navigates a line for soup among prisoners, observing Khan serving from one of the large barrels."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Gandhi starts to go down in the dusty streets of South Africa, where he is leading a nonviolent protest, and others around him, convinced by the authority of his voice known worldwide for advocating peace, follow suit. The sense of the idea, rooted in his philosophy of Satyagraha or 'truth force,' seizes Gandhi, and as the sound of the galloping horses nears, he turns and shouts too. The miners, Indian laborers fighting against oppressive colonial laws, begin to go down, some face up, shielding their faces with their hands, some burying their faces in the earth and covering their heads with their hands, a tactic of defenseless resistance. The sergeant's point of view shows a close fast traveling shot to the prone miners. Close on Gandhi, we see his arms crossed in front of his face, staring up, frightened but determined to bear it, as a testament to his unwavering commitment to nonviolence. The horses cannot bring themselves to gallop over the human carpet; they rear, plunge, and swerve, perhaps sensing the chaos of the moment. Gandhi turns to see the sergeant, a symbol of colonial enforcement, thrown off his horse, landing heavily, scrambling up, furious, and darting after it. Mounting again, the sergeant is enraged to hear laughter, a sound of unexpected resistance from the demonstrators. Gandhi's command, angry in its own way but carrying all the weight of his influence as a leader of civil disobedience, causes them to begin to go down again. The sergeant wheels his horse and rides at Gandhi. With a deliberate, almost fatalistic pace, Gandhi goes first to his knees and then sprawls down flat, his hands over the top of his head, awaiting the blow of the horse's hoof, symbolizing willing sacrifice for the greater cause. A close shot of the horse's head shows its eyes rolling, an instinctive reaction to avoid harm, as it swerves again, while the sergeant, cursing, is unable to make it plunge down on the man. Surveying the whole procession sprawled on the ground, the sergeant, angrily wheeling his horse, sees his mounted police circling in front of them, unsure of what to do in the face of such unusual resistance. He turns his horse angrily and gallops back toward the factories, likely owned by colonial authorities benefiting from miner labor. Gandhi, Singh, a fellow activist, and Tyeb Mohammed, another leader of the resistance, look off at the retreating horses. The car with the civilian has returned in the distance, and the sergeant wheels by it as his police turn their horses, lining up across the road again as a blockade. Gandhi and the miners come on once more, chanting forcefully, their voices carrying the message of defiance. Meanwhile, a congregation listens stiffly and unsympathetically to a clergyman who has given Charlie, perhaps a local ally, the use of his pulpit and sits beneath it, embarrassed but resolute. As Charlie struggles on, a few men in the congregation rise, escorting their families from the church, unwilling to associate with the controversial cause, with more members rising and marching out, though a few pointedly do not, indicating division in opinion. Gandhi threads his way in a line for soup, which winds through masses of prisoners detained for their protest activities, some with bowls, eating, some not yet in line. As Gandhi nears the two stone blocks holding the large barrels of soup, he sees that Khan, likely a fellow detainee committed to the cause, is serving from one of them, showcasing camaraderie even in difficult circumstances."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Gandhi starts to go down and others around him convinced by the authority of his voice follow suit. The sense of the idea seizes Gandhi and as the sound of the galloping horses nears he turns and shouts too. The miners begin to go down some face up shielding their faces with their hands some burying their faces in the earth and covering their heads with their hands. The sergeant's point of view shows a close fast traveling shot to the prone miners. Close on Gandhi we see his arms crossed in front of his face staring up frightened but determined to bear it. The horses cannot bring themselves to gallop over the human carpet. they rear plunge and swerve. Gandhi turns to see the sergeant thrown off his horse landing heavily scrambling up furious and darting after it. Mounting again the sergeant is enraged to hear laughter. Gandhi's command angry in its own way but carrying all the weight of his influence causes them to begin to go down again. The sergeant wheels his horse and rides at Gandhi. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. With a deliberate almost fatalistic pace Gandhi goes first to his knees and then sprawls down flat his hands over the top of his head awaiting the blow of the horse's hoof. A close shot of the horse's head shows its eyes rolling as it swerves again. while the sergeant cursing is unable to make it plunge down on the man. Surveying the whole procession sprawled on the ground the sergeant angrily wheeling his horse sees his mounted police circling in front of them unsure of what to do. He turns his horse angrily and gallops back toward the factories. Gandhi Singh and Tyeb Mohammed look off at the retreating horses. The car with the civilian has returned in the distance and the sergeant wheels by it as his police turn their horses lining up across the road again. Gandhi and the miners come on once more chanting forcefully. Meanwhile a congregation listens stiffly and unsympathetically to a clergyman who has given Charlie the use of his pulpit and sits beneath it embarrassed but resolute. As Charlie struggles on a few men in the congregation rise escorting their families from the church with more members rising and marching out though a few pointedly do not. Gandhi threads his way in a line for soup which winds through masses of prisoners some with bowls eating some not yet in line. As Gandhi nears the two stone blocks holding the large barrels of soup he sees that Khan is serving from one of them."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Gandhi starts to go down and others around him convinced by the authority of his voice follow suit. The sense of the idea seizes Gandhi and as the sound of the galloping horses nears he turns and shouts too. The miners begin to go down some face up shielding their faces with their hands some burying their faces in the earth and covering their heads with their hands. The sergeant's point of view shows a close fast traveling shot to the prone miners. Close on Gandhi we see his arms crossed in front of his face staring up frightened but determined to bear it. The horses cannot bring themselves to gallop over the human carpet. they rear plunge and swerve. Gandhi turns to see the sergeant thrown off his horse landing heavily scrambling up furious and darting after it. Mounting again the sergeant is enraged to hear laughter. Gandhi's command angry in its own way but carrying all the weight of his influence causes them to begin to go down again. The sergeant wheels his horse and rides at Gandhi. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. With a deliberate almost fatalistic pace Gandhi goes first to his knees and then sprawls down flat his hands over the top of his head awaiting the blow of the horse's hoof. A close shot of the horse's head shows its eyes rolling as it swerves again. while the sergeant cursing is unable to make it plunge down on the man. Surveying the whole procession sprawled on the ground the sergeant angrily wheeling his horse sees his mounted police circling in front of them unsure of what to do. He turns his horse angrily and gallops back toward the factories. Gandhi Singh and Tyeb Mohammed look off at the retreating horses. The car with the civilian has returned in the distance and the sergeant wheels by it as his police turn their horses lining up across the road again. Gandhi and the miners come on once more chanting forcefully. Meanwhile a congregation listens stiffly and unsympathetically to a clergyman who has given Charlie the use of his pulpit and sits beneath it embarrassed but resolute. As Charlie struggles on a few men in the congregation rise escorting their families from the church with more members rising and marching out though a few pointedly do not. Gandhi threads his way in a line for soup which winds through masses of prisoners some with bowls eating some not yet in line. As Gandhi nears the two stone blocks holding the large barrels of soup he sees that Khan is serving from one of them."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Gandhi starts to go down and others around him convinced by the authority of his voice follow suit. The sense of the idea seizes Gandhi and as the sound of the galloping horses nears he turns and shouts too. The miners begin to go down some face up shielding their faces with their hands some burying their faces in the earth and covering their heads with their hands. The sergeant's point of view shows a close fast traveling shot to the prone miners. Close on Gandhi we see his arms crossed in front of his face staring up frightened but determined to bear it. The horses cannot bring themselves to gallop over the human carpet. The car with the civilian has returned in the distance and the sergeant wheels by it as his police turn their horses lining up across the road again. Gandhi and the miners come on once more chanting forcefully. Meanwhile a congregation listens stiffly and unsympathetically to a clergyman who has given Charlie the use of his pulpit and sits beneath it embarrassed but resolute. As Charlie struggles on a few men in the congregation rise escorting their families from the church with more members rising and marching out though a few pointedly do not. Gandhi threads his way in a line for soup which winds through masses of prisoners some with bowls eating some not yet in line. As Gandhi nears the two stone blocks holding the large barrels of soup he sees that Khan is serving from one of them."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Gandhi starts to go down and others around him convinced by the authority of his voice follow suit. The sense of the idea seizes Gandhi and as the sound of the galloping horses nears he turns and shouts too. As Charlie struggles on a few men in the congregation rise escorting their families from the church with more members rising and marching out though a few pointedly do not. Gandhi threads his way in a line for soup which winds through masses of prisoners some with bowls eating some not yet in line. As Gandhi nears the two stone blocks holding the large barrels of soup he sees that Khan is serving from one of them."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Jones begins to climb up, and others around him, impressed by the sweetness of his song, jump in. The flash of the thought grips Jones, and as the sound of barking dogs approaches, he spins and whispers too. The bakers start to climb up, some head down, protecting their arms with their hats, some planting their hands in the water and covering their toes with their shoes. The driver's angle reveals a wide slow-floating glance to the standing bakers. Close on Jones, we observe his fingers wrapped around his neck, gazing down, terrified but resolved to endure it. The dogs cannot force themselves to bark over the wooden bridge; they sit, leap, and float. Jones spins to witness the driver lifted off his bicycle, landing softly, crawling down, delighted, and sliding after it. Standing again, the driver is tickled to sense music. Jones's message, delighted in its own way but bearing none of the charm of his melody, prompts them to start to climb up again. The driver rotates his bicycle and glides at Jones. With a hesitant, almost hopeful stride, Jones walks first to his feet and then tumbles up straight, his legs under the bottom of his shoes, anticipating the kick of the dog's tail. A distant shot of the dog's tail reveals its ears twitching as it floats again, while the driver, laughing, is unable to make it jump up on the tree. Viewing the entire parade standing on the roof, the driver, happily rotating his bicycle, notices his flying monkeys hovering behind them, eager to laugh. He flips his bicycle happily and glides back toward the mountains. Jones, Patel, and Ali Shah glance up at the approaching dogs. The train with the sailor has departed in the sky, and the driver flips by it as his monkeys flip their bicycles, lining up beside the train again. Jones and the bakers climb down yet again, singing quietly. Meanwhile, a swarm watches closely and kindly at a teacher who has handed Edward the use of his chair and sits beside it, anxious but confident. As Edward stumbles down, a few women in the swarm rise, leading their animals from the market, with fewer creatures rising and dancing out, though a few loudly do. Jones hops his path in a stream for honey, which drifts through valleys of kings, some with books, reading, some not yet in stream. As Jones approaches the two metal flags holding the small jugs of honey, he notices that Omar is sipping from one of them."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Gandhi begins to go down, and others follow his lead. As horses approach, Gandhi shouts, prompting miners to protect themselves on the ground. The sergeant attempts to control the situation but is thwarted by the horses’ reluctance to trample the miners. Gandhi fearlessly awaits the horse’s advance, but the sergeant's efforts fail as the horse swerves. Frustrated, the sergeant retreats to the factories with his police, leaving Gandhi and the miners to advance again, chanting. Nearby, a congregation listens to a clergyman who has allowed Charlie to preach, but some congregants leave, unimpressed. Gandhi joins a line for soup among prisoners, and sees Khan serving from one of the large barrels."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "As Gandhi nears the two stone blocks holding the large barrels of soup he sees that Khan is serving from one of them Gandhi threads his way in a line for soup which winds through masses of prisoners some with bowls eating some not yet in line  As Charlie struggles on a few men in the congregation rise escorting their families from the church with more members rising and marching out though a few pointedly do not  Meanwhile a congregation listens stiffly and unsympathetically to a clergyman who has given Charlie the use of his pulpit and sits beneath it embarrassed but resolute  Gandhi and the miners come on once more chanting forcefully  The car with the civilian has returned in the distance and the sergeant wheels by it as his police turn their horses lining up across the road again  Gandhi Singh and Tyeb Mohammed look off at the retreating horses  He turns his horse angrily and gallops back toward the factories  Surveying the whole procession sprawled on the ground the sergeant angrily wheeling his horse sees his mounted police circling in front of them unsure of what to do  while the sergeant cursing is unable to make it plunge down on the man  A close shot of the horse's head shows its eyes rolling as it swerves again  With a deliberate almost fatalistic pace Gandhi goes first to his knees and then sprawls down flat his hands over the top of his head awaiting the blow of the horse's hoof  The sergeant wheels his horse and rides at Gandhi  Gandhi's command angry in its own way but carrying all the weight of his influence causes them to begin to go down again  Mounting again the sergeant is enraged to hear laughter  Gandhi turns to see the sergeant thrown off his horse landing heavily scrambling up furious and darting after it  they rear plunge and swerve  The horses cannot bring themselves to gallop over the human carpet  Close on Gandhi we see his arms crossed in front of his face staring up frightened but determined to bear it  The sergeant's point of view shows a close fast traveling shot to the prone miners  The miners begin to go down some face up shielding their faces with their hands some burying their faces in the earth and covering their heads with their hands  The sense of the idea seizes Gandhi and as the sound of the galloping horses nears he turns and shouts too  Gandhi starts to go down and others around him convinced by the authority of his voice follow suit "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The sense of the idea seizes Gandhi and as the sound of the galloping horses nears he turns and shouts too Gandhi starts to go down and others around him convinced by the authority of his voice follow suit The sergeant's point of view shows a close fast traveling shot to the prone miners The miners begin to go down some face up shielding their faces with their hands some burying their faces in the earth and covering their heads with their hands The horses cannot bring themselves to gallop over the human carpet Close on Gandhi we see his arms crossed in front of his face staring up frightened but determined to bear it Gandhi turns to see the sergeant thrown off his horse landing heavily scrambling up furious and darting after it they rear plunge and swerve Gandhi's command angry in its own way but carrying all the weight of his influence causes them to begin to go down again Mounting again the sergeant is enraged to hear laughter With a deliberate almost fatalistic pace Gandhi goes first to his knees and then sprawls down flat his hands over the top of his head awaiting the blow of the horse's hoof The sergeant wheels his horse and rides at Gandhi while the sergeant cursing is unable to make it plunge down on the man A close shot of the horse's head shows its eyes rolling as it swerves again He turns his horse angrily and gallops back toward the factories Surveying the whole procession sprawled on the ground the sergeant angrily wheeling his horse sees his mounted police circling in front of them unsure of what to do The car with the civilian has returned in the distance and the sergeant wheels by it as his police turn their horses lining up across the road again Gandhi Singh and Tyeb Mohammed look off at the retreating horses Meanwhile a congregation listens stiffly and unsympathetically to a clergyman who has given Charlie the use of his pulpit and sits beneath it embarrassed but resolute Gandhi and the miners come on once more chanting forcefully Gandhi threads his way in a line for soup which winds through masses of prisoners some with bowls eating some not yet in line As Charlie struggles on a few men in the congregation rise escorting their families from the church with more members rising and marching out though a few pointedly do not As Gandhi nears the two stone blocks holding the large barrels of soup he sees that Khan is serving from one of them"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "A close shot of the horse's head shows its eyes rolling as it swerves again  while the sergeant cursing is unable to make it plunge down on the man  Surveying the whole procession sprawled on the ground the sergeant angrily wheeling his horse sees his mounted police circling in front of them unsure of what to do  He turns his horse angrily and gallops back toward the factories  Gandhi Singh and Tyeb Mohammed look off at the retreating horses  The car with the civilian has returned in the distance and the sergeant wheels by it as his police turn their horses lining up across the road again  Gandhi and the miners come on once more chanting forcefully  Meanwhile a congregation listens stiffly and unsympathetically to a clergyman who has given Charlie the use of his pulpit and sits beneath it embarrassed but resolute  As Charlie struggles on a few men in the congregation rise escorting their families from the church with more members rising and marching out though a few pointedly do not  Gandhi threads his way in a line for soup which winds through masses of prisoners some with bowls eating some not yet in line  As Gandhi nears the two stone blocks holding the large barrels of soup he sees that Khan is serving from one of them Gandhi starts to go down and others around him convinced by the authority of his voice follow suit  The sense of the idea seizes Gandhi and as the sound of the galloping horses nears he turns and shouts too  The miners begin to go down some face up shielding their faces with their hands some burying their faces in the earth and covering their heads with their hands  The sergeant's point of view shows a close fast traveling shot to the prone miners  Close on Gandhi we see his arms crossed in front of his face staring up frightened but determined to bear it  The horses cannot bring themselves to gallop over the human carpet  they rear plunge and swerve  Gandhi turns to see the sergeant thrown off his horse landing heavily scrambling up furious and darting after it  Mounting again the sergeant is enraged to hear laughter  Gandhi's command angry in its own way but carrying all the weight of his influence causes them to begin to go down again  The sergeant wheels his horse and rides at Gandhi  With a deliberate almost fatalistic pace Gandhi goes first to his knees and then sprawls down flat his hands over the top of his head awaiting the blow of the horse's hoof "
        }
      ]
    }
  ]
}