{
  "ground_truth": "Mathison puts down his shopping bags and moves to her, kneels down, and gestures for the bundle of sweatshirts in her arms. The woman smiles for the first time and hands him the wrapped child. The doctor lowers the baby to his lap and unwraps him while the woman, unable to see her baby, watches Dr. Mathison as he looks down and examines her child. The doctor finally glances up, looking shaken, and makes eye contact with the woman for only a second, causing a chill to go through her body. He looks to the three saleswomen in the room, his hard stare unsettling them, and the older saleswoman speaks up. Everyone becomes very still, the mother looks like she stopped breathing, and the baby screams. The doctor whispers something we can't hear, looks up to the saleswoman who brought him in, and Mathison turns back to the mother. The woman looks over the one being offered and then points to the Sports Illustrated peeking out of the seat pocket, and David pulls the magazine out and gives it to her. David waits until the opposing train passes. The woman goes back to her magazine, and Kelly looks up from her Sports Illustrated, her striking blue eyes gazing at David. She holds up her hand, taps the diamond ring on her finger, leading to an awkward silence. Kelly gets up, balances herself against a headrest as the train rumbles, and starts to the back of the car, leaving David sitting alone looking like he's drowning, but there's no water. David feels a stare, glancing up to see the little girl spying on him from between the seats. He leans towards the window to avoid eye contact, his hand reaching into his coat to slide out his wedding band, which he puts back on. The vibration of the train begins to lull his eyes closed, and his head bounces lightly against the window, but the shaking of the glass never allows his eyes to completely close. He sits up when he realizes the shaking is getting stronger and looks out the window, where the scenery blurs as it flies by. David turns, noticing some of the other passengers reacting as the train picks up speed, with the normal bumps of the tracks becoming amplified and the train going faster. David's eyes move to the seat in front of him to find the little girl no longer watching him. David looks to the passengers across from him, seeing the ground slowly drop away in the windows behind them as a boy, age ten, sits on his head on the family couch and watches television upside down, his floppy brown hair spreading out in a circle in front of his red face.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Mathison places down his shopping parcels and advances to her, kneels down, and signals for the bundle of sweatshirts in her arms. The woman grins for the first time and hands him the wrapped infant. The physician lowers the baby to his lap and unwraps him while the woman, unable to see her infant, observes Dr. Mathison as he looks down and inspects her child. The physician finally glances up, appearing shaken, and makes eye contact with the woman for only a second, causing a chill to go through her body. He looks to the three saleswomen in the chamber, his hard gaze unsettling them, and the older saleswoman speaks up. Everyone becomes very still, the mother looks like she stopped breathing, and the infant screams. The physician murmurs something we can't hear, looks up to the saleswoman who brought him in, and Mathison turns back to the mother. The woman looks over the one being offered and then points to the Sports Illustrated peeking out of the seat pocket, and David pulls the periodical out and gives it to her. David waits until the opposite train passes. The woman goes back to her periodical, and Kelly looks up from her Sports Illustrated, her striking azure eyes gazing at David. She holds up her hand, taps the gemstone ring on her finger, leading to an awkward silence. Kelly gets up, steadies herself against a headrest as the train rumbles, and starts to the back of the car, leaving David sitting alone looking like he's drowning, but there's no water. David feels a gaze, glancing up to see the little girl spying on him from between the seats. He leans towards the window to avoid eye contact, his hand reaching into his coat to slide out his wedding band, which he puts back on. The vibration of the train begins to lull his eyes closed, and his head bounces lightly against the window, but the shaking of the glass never permits his eyes to completely close. He sits up when he realizes the shaking is getting stronger and looks out the window, where the scenery blurs as it flies by. David turns, noticing some of the other travelers reacting as the train picks up velocity, with the normal bumps of the tracks becoming amplified and the train going faster. David's eyes move to the seat in front of him to find the little girl no longer watching him. David looks to the travelers across from him, seeing the ground slowly drop away in the panes behind them as a boy, age ten, sits on his head on the family couch and watches television inverted, his floppy brown hair spreading out in a circle in front of his scarlet face."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Mathison's shopping bags are put down by him, and he is moved to by her, knelt down, and a gesture is made by him for the bundle of sweatshirts in her arms. The first smile is given by the woman, and the wrapped child is handed to him by her. The baby is lowered to his lap by the doctor and unwrapped, while the baby is watched by the woman, unable to see her child, as Dr. Mathison looks down and examines the child. The doctor finally glances up, his shaken look observed by the woman for only a second, causing her body to be chilled. The three saleswomen in the room are looked to by him, and his hard stare unsettles them, then the older saleswoman speaks up. Everyone stays very still, with the mother looking like her breath has stopped, and the baby screams. Something we can't hear is whispered by the doctor, who then looks up to the saleswoman who brought him in, and the mother is turned back to by Mathison. The one being offered is looked over by the woman, who then points to the Sports Illustrated peeking out of the seat pocket, prompting David to pull the magazine out and give it to her. The opposing train is waited for by David until it passes. Her magazine is gone back to by the woman, and Sports Illustrated is looked up from by Kelly, her striking blue eyes gazing at David. Her hand is held up by her, tapping the diamond ring on her finger, which leads to an awkward silence. Kelly rises, balancing herself against a headrest as the train rumbles, and starts to the back of the car, leaving David sitting alone looking as if he's drowning, but there's no water. A stare is felt by David, and he glances up to see the little girl spying on him from between the seats. Towards the window, he leans to avoid eye contact, his hand reaching into his coat to slide out his wedding band, which he puts back on. The train's vibration begins to lull his eyes closed, and lightly his head bounces against the window, but the glass's shaking never allows his eyes to completely close. When he realizes the shaking is getting stronger, he sits up and looks out the window, where the scenery blurs as it flies by. David notices some of the other passengers reacting as the train picks up speed, with the track's normal bumps becoming amplified and the train going faster. His eyes move to the seat in front of him to find the little girl no longer watching him. The passengers across from him are looked to by David, who sees the ground slowly dropping away in the windows behind them as a boy, age ten, sits on his head on the family couch and watches television upside down, his floppy brown hair spreading out in a circle in front of his red face."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Mathison sets down his shopping bags, kneels, and gestures for the bundle of sweatshirts. The woman smiles and hands him the wrapped child. He lowers the baby to his lap, unwraps him, and examines the child while the woman watches. Mathison looks up, shaken, meeting her eyes briefly, causing her to shiver. His hard stare unsettles the saleswomen, and the older one speaks. Everyone becomes still; the mother seems breathless, and the baby screams. The doctor whispers something inaudible, looks at the saleswoman who brought him, and turns back to the mother. She points to the Sports Illustrated in the seat pocket, and David hands it to her. He waits for the opposing train to pass. The woman returns to her magazine, and Kelly looks up from her Sports Illustrated, her blue eyes on David. She taps her diamond ring, leading to awkward silence. Kelly gets up, steadies herself, and heads to the back of the car, leaving David alone, looking lost. He feels a stare, sees a little girl watching him, and leans toward the window, avoiding eye contact. He slides his wedding band back on. The train's vibration lulls him, but the shaking glass keeps him awake. He sits up as the shaking intensifies, noticing the scenery blurring by. Other passengers react as the train speeds up, the bumps amplifying. David looks to the seat in front, finding the little girl gone. He glances at passengers across, seeing the ground drop away in the windows, while a ten-year-old boy watches TV upside down on the couch, his brown hair fanned out around his red face."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Mathison sets down his bags, approaches the woman, kneels, and gestures for the sweatshirts. She smiles and hands him the child. He unwraps the baby on his lap while she watches. Mathison looks shaken, meets her eyes briefly, unsettling her. He glances at the saleswomen, and the older one speaks. Everyone freezes; the mother seems breathless, and the baby cries. The doctor whispers inaudibly, then turns back to the mother. She points to a Sports Illustrated, and David hands it to her. As the train passes, she reads, and Kelly looks at David, tapping her diamond ring, creating awkward silence. Kelly leaves, and David feels watched by a girl between seats. He avoids eye contact, puts on his wedding band, and dozes off as the train's vibration lulls him. He notices the train speeding up, the scenery blurring, and passengers reacting. The girl is no longer watching him. David sees the ground drop away outside, while a boy watches TV upside down on a couch."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Mathison carefully places his shopping bags on the floor and moves towards the woman, kneeling down with a gentle demeanor. He gestures for the bundle of sweatshirts she is holding in her arms. The woman, who has not smiled until this moment, finally allows a smile to grace her face and hands over the wrapped child to him. Dr. Mathison gently lowers the baby onto his lap and begins to unwrap the layers of fabric, while the woman, unable to see her baby directly, watches Dr. Mathison intently as he examines her child with a focused expression. After a moment, the doctor looks up, appearing visibly shaken, and briefly makes eye contact with the woman, sending a chill through her body. His gaze then shifts to the three saleswomen present in the room, and his intense stare causes them to feel uneasy. The older saleswoman, sensing the tension, speaks up. The atmosphere becomes tense and still, as if time has momentarily stopped. The mother appears as though she has ceased breathing, and the baby lets out a piercing scream. The doctor leans in and whispers something inaudible, then looks up at the saleswoman who had initially brought him in, before turning his attention back to the mother. The woman glances over the options being presented to her and then points to the Sports Illustrated magazine that is partially visible, peeking out from the seat pocket. David obligingly pulls the magazine out and hands it to her. He waits patiently until the opposing train passes by. The woman returns her focus to the magazine, while Kelly, with her striking blue eyes, looks up from her own copy of Sports Illustrated and gazes at David. She raises her hand and taps the diamond ring on her finger, creating an awkward silence between them. Kelly stands up, carefully balancing herself against a headrest as the train rumbles beneath her feet, and makes her way to the back of the car, leaving David sitting alone, looking as if he is drowning in an invisible sea. David senses a stare and glances up to find a little girl peering at him from between the seats. To avoid her gaze, he leans towards the window, reaching into his coat pocket to slide out his wedding band, which he then slips back onto his finger. The rhythmic vibration of the train begins to lull him into a drowsy state, his head lightly bouncing against the window, though the constant shaking of the glass prevents his eyes from fully closing. He sits up abruptly when he notices the shaking intensifying and looks out the window, where the scenery blurs rapidly as it rushes past. David turns his attention to the other passengers, observing their reactions as the train accelerates, with the usual bumps of the tracks becoming more pronounced and the speed increasing. His eyes shift to the seat in front of him, realizing the little girl is no longer watching him. David then looks at the passengers seated across from him, noticing the ground slowly dropping away in the windows behind them. Meanwhile, a ten-year-old boy sits upside down on the family couch, watching television with his floppy brown hair fanned out in a circle around his flushed red face."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Mathison, exhibiting meticulous care, gently places his collection of shopping bags on the floor, ensuring they are neatly arranged before redirecting his attention to the woman nearby. With a graceful and careful movement, he approaches her, lowering himself to one knee with a demeanor that exudes warmth and kindness. Mathison softly gestures towards the bundle of soft sweatshirts clutched in her arms, indicating his desire to assist. Until this very moment, the woman has maintained a somber expression, but now, a long-awaited smile slowly begins to spread across her face. She then entrusts the carefully wrapped child to Mathison. With tender hands, Dr. Mathison tenderly rests the baby on his lap, proceeding with great care to unwrap the multiple layers of fabric encasing the infant. Meanwhile, the woman, unable to have a direct view of her child, keeps her eyes fixed intently on Dr. Mathison, observing as he thoroughly examines her baby with a look of unwavering concentration. After a few tense moments have passed, the doctor, appearing somewhat visibly disturbed, lifts his gaze to meet the woman's eyes, a gesture that sends an unsettling shiver coursing through her body. His eyes then shift towards the trio of saleswomen present in the room, and his intense, scrutinizing stare fills them with a growing sense of discomfort. Recognizing the increasing tension in the room, the older saleswoman decides to break the silence by speaking up. The atmosphere thickens with tension, becoming so still and quiet that it seems as though time itself has momentarily paused. At this crucial moment, the mother appears as if she has completely stopped breathing, while the baby suddenly lets out a piercing, high-pitched scream. The doctor leans in closer and whispers something inaudible into the air, then directs his gaze towards the saleswoman who initially invited him in, before finally turning his attention back towards the mother once more. The woman carefully considers all the options displayed before her, and she points decisively to the Sports Illustrated magazine, which is partially visible, peeking out from the seat pocket in front of her. David, responding promptly, extracts the magazine and extends it to her. With patience, he waits quietly for the opposing train to pass by. As the woman diverts her attention back to the magazine, Kelly, characterized by her striking blue eyes, lifts her gaze from her own copy of Sports Illustrated and fixes her stare on David. In a silent gesture full of meaning, she raises her hand and taps the diamond ring gleaming on her finger, creating an awkward silence that hangs between them. Kelly then stands up, carefully balancing herself against the headrest for support, as the train moves steadily beneath her feet. She proceeds gracefully towards the back of the railcar, leaving David sitting alone, looking as though he is drowning in an unseen, intangible sea of emotions. Feeling a gaze upon him, David looks up to discover a little girl peering at him from the narrow space between the seats. Trying to avoid her inquisitive eyes, he turns towards the window, reaching into his coat pocket to retrieve his wedding band, which he discreetly slips back onto his finger. The rhythmic, gentle vibration of the train starts to lull him into a relaxed, drowsy state, his head gently bobbing against the window's glass. However, the constant, unrelenting shaking of the window prevents him from succumbing entirely to sleep. Suddenly, he sits up with a jolt as he notices the shaking intensifying, and his eyes dart to the window, where the scenery outside blurs rapidly as it rushes past in a whirl of motion. David then shifts his focus to the various passengers around him, observing their reactions as the train picks up speed, the usual bumps of the tracks becoming more pronounced and the speed steadily increasing. He turns his gaze to the seat directly in front of him, realizing that the little girl is no longer watching him. His attention then moves to the passengers seated across from him, noticing how the ground below appears to gradually drop away in the windows behind them. Meanwhile, elsewhere, a ten-year-old boy finds himself perched upside down on the family couch, his perspective of the world inverted as he watches television, his floppy brown hair spreading out in a circle around his reddened, flushed face."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Mathison carefully places his shopping bags on the floor, ensuring they are stable before moving towards the woman. He gently kneels down in front of her, extending his hands in a gesture that indicates he is ready to receive the bundle of sweatshirts she is holding. The woman, her face softening into a smile for the first time, trusts him and hands over the wrapped child. Mathison, now with the baby in his lap, begins to delicately unwrap the layers of fabric, revealing the child within. As he does this, the woman, unable to see her baby directly, focuses intently on Dr. Mathison, watching his every move as he examines her child with a concentrated gaze. After a thorough examination, Mathison finally lifts his eyes to meet the woman's, his expression visibly shaken, and their brief eye contact sends a chill through her body. He then shifts his attention to the three saleswomen present in the room, his intense stare causing a ripple of unease among them, prompting the older saleswoman to speak up. The atmosphere becomes tense and still, with the mother appearing as though she has stopped breathing, and the baby suddenly lets out a scream. Mathison leans in to whisper something inaudible, then looks up at the saleswoman who had initially brought him in, before turning his focus back to the mother. The woman, assessing the situation, glances over the options available and points to the Sports Illustrated magazine partially visible from the seat pocket. David, understanding her gesture, reaches over, retrieves the magazine, and hands it to her. He then waits patiently as the opposing train passes by. The woman returns her attention to the magazine, while Kelly, engrossed in her own copy of Sports Illustrated, lifts her gaze to meet David's, her striking blue eyes locking onto his. She raises her hand, tapping the diamond ring on her finger, which creates an awkward silence between them. Kelly stands up, carefully balancing herself against a headrest as the train continues to rumble, and makes her way to the back of the car, leaving David sitting alone, feeling overwhelmed as if he is drowning without any water around. Sensing a stare, David glances up to find a little girl peering at him from between the seats. To avoid her gaze, he leans towards the window, discreetly reaching into his coat to slide out his wedding band, which he then slips back onto his finger. The rhythmic vibration of the train begins to lull him into a drowsy state, his head gently bouncing against the window, though the constant shaking prevents him from fully closing his eyes. Realizing the shaking is intensifying, he sits up and looks out the window, observing the scenery blurring past at an increasing speed. Turning his attention back inside, he notices other passengers reacting to the train's acceleration, the usual bumps of the tracks now more pronounced as the train speeds up. David's eyes shift to the seat in front of him, noting the absence of the little girl who was previously watching him. He then looks across to the passengers opposite him, seeing the ground outside the windows behind them gradually dropping away. Meanwhile, a ten-year-old boy is at home, sitting upside down on the family couch, watching television with his floppy brown hair fanned out in a circle around his flushed red face."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Mathison sets down his shopping bags and approaches the woman, kneeling to gesture for the bundle of sweatshirts she holds. She smiles for the first time and hands him the wrapped child. He places the baby on his lap, unwraps him, and examines him while the mother watches intently. After a moment, Mathison looks up, visibly shaken, and briefly meets the woman's eyes, sending a chill through her. His hard stare unsettles the three saleswomen in the room, prompting the older one to speak. The atmosphere becomes tense; the mother appears breathless, and the baby screams. Mathison whispers something inaudible, then turns back to the mother. She points to a Sports Illustrated magazine in the seat pocket, and David retrieves it for her. As the opposing train passes, the woman returns to her magazine, and Kelly looks up from her Sports Illustrated, her striking blue eyes meeting David's. She taps her diamond ring, creating an awkward silence before getting up and balancing against a headrest as the train rumbles, leaving David alone and looking forlorn. He notices a little girl watching him from between the seats and leans toward the window to avoid her gaze, discreetly sliding his wedding band back on. The train's vibrations begin to lull him, but the shaking glass prevents him from fully closing his eyes. Realizing the shaking intensifies, he looks out to see the scenery blur by as the train speeds up. Observing other passengers reacting to the increased speed and amplified track bumps, he notices the little girl is no longer watching him. His attention shifts to the passengers across from him, where the ground outside the window drops away, and a ten-year-old boy watches television upside down on a family couch, his floppy brown hair fanned out around his red face."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Mathison, a dedicated pediatrician known for his compassionate care, puts down his shopping bags filled with medical supplies and kneels beside the woman, gestures for the bundle of sweatshirts in her arms. The woman, whose weary face tells of sleepless nights and anxious days, smiles for the first time and hands him the wrapped child. The doctor, recognized for his expertise in neonatal care, gently lowers the baby to his lap and unwraps him while the woman, her heart racing with anticipation and fear, watches Dr. Mathison as he looks down and examines her child with a practiced eye. The doctor finally glances up, looking shaken, and makes eye contact with the woman for only a second, causing a chill to go through her body like a wave. He looks to the three saleswomen in the room, his hard stare unsettling them as if he were challenging them to comprehend the gravity of the moment, and the older saleswoman, whose years of experience in the store have taught her to read the subtlest cues, speaks up. Everyone becomes very still, the mother looks like she stopped breathing, and the baby screams, a piercing sound that echoes in the silent tension of the room. The doctor whispers something we can't hear, his words like a secret carried on a breeze, looks up to the saleswoman who brought him in, and Mathison turns back to the mother. The woman, wearing a coat that has seen better days, looks over the one being offered and then points to the Sports Illustrated peeking out of the seat pocket, a publication known for its iconic sports photography, and David pulls the magazine out and gives it to her. David waits until the opposing train, a high-speed bullet train known for its precision and speed, passes. The woman goes back to her magazine, flipping through glossy pages filled with athletes in motion, and Kelly looks up from her Sports Illustrated, her striking blue eyes gazing at David with a mix of curiosity and mischief. She holds up her hand, taps the diamond ring on her finger, a symbol of a recent engagement that still feels new, leading to an awkward silence. Kelly gets up, balances herself against a headrest as the train rumbles along the tracks like a metal serpent, and starts to the back of the car, leaving David sitting alone looking like he's drowning, but there's no water in sight. David feels a stare, glancing up to see the little girl spying on him from between the seats, her inquisitive nature evident in her wide eyes. He leans towards the window to avoid eye contact, his hand reaching into his coat to slide out his wedding band, a gold circle that ties him to a life of vows and commitments, which he puts back on. The vibration of the train begins to lull his eyes closed, and his head bounces lightly against the window, but the shaking of the glass never allows his eyes to completely close. He sits up when he realizes the shaking is getting stronger and looks out the window, where the scenery blurs as it flies by in a kaleidoscope of colors. David turns, noticing some of the other passengers reacting as the train picks up speed, with the normal bumps of the tracks becoming amplified and the train, built for high velocity, going faster. David's eyes move to the seat in front of him to find the little girl no longer watching him, perhaps distracted by the world outside. David looks to the passengers across from him, seeing the ground slowly drop away in the windows behind them as a boy, age ten, sits on his head on the family couch and watches television upside down, his floppy brown hair spreading out in a circle in front of his red face, a common sight as children find odd comfort in unusual positions."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Mathison puts down his shopping bags and moves to her kneels down and gestures for the bundle of sweatshirts in her arms. The woman smiles for the first time and hands him the wrapped child. The doctor lowers the baby to his lap and unwraps him while the woman unable to see her baby watches Dr Mathison as he looks down and examines her child. The doctor finally glances up looking shaken and makes eye contact with the woman for only a second causing a chill to go through her body. He looks to the three saleswomen in the room his hard stare unsettling them and the older saleswoman speaks up. Everyone becomes very still. the mother looks like she stopped breathing and the baby screams. The doctor whispers something we cannot hear looks up to the saleswoman who brought him in and Mathison turns back to the mother. The woman looks over the one being offered and then points to the Sports Illustrated peeking out of the seat pocket and David pulls the magazine out and gives it to her. David waits until the opposing train passes. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. The woman goes back to her magazine and Kelly looks up from her Sports Illustrated her striking blue eyes gazing at David. She holds up her hand taps the diamond ring on her finger leading to an awkward silence. Kelly gets up balances herself against a headrest as the train rumbles and starts to the back of the car leaving David sitting alone looking like he is drowning but there is no water. David feels a stare glancing up to see the little girl spying on him from between the seats. He leans towards the window to avoid eye contact his hand reaching into his coat to slide out his wedding band which he puts back on. The vibration of the train begins to lull his eyes closed and his head bounces lightly against the window but the shaking of the glass never allows his eyes to completely close. He sits up when he realizes the shaking is getting stronger and looks out the window where the scenery blurs as it flies by. David turns noticing some of the other passengers reacting as the train picks up speed with the normal bumps of the tracks becoming amplified and the train going faster. David's eyes move to the seat in front of him to find the little girl no longer watching him. David looks to the passengers across from him seeing the ground slowly drop away in the windows behind them as a boy age ten sits on his head on the family couch and watches television upside down his floppy brown hair spreading out in a circle in front of his red face."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Mathison puts down his shopping bags and moves to her kneels down and gestures for the bundle of sweatshirts in her arms. The woman smiles for the first time and hands him the wrapped child. The doctor lowers the baby to his lap and unwraps him while the woman unable to see her baby watches Dr Mathison as he looks down and examines her child. The doctor finally glances up looking shaken and makes eye contact with the woman for only a second causing a chill to go through her body. He looks to the three saleswomen in the room his hard stare unsettling them and the older saleswoman speaks up. Everyone becomes very still. the mother looks like she stopped breathing and the baby screams. The doctor whispers something we cannot hear looks up to the saleswoman who brought him in and Mathison turns back to the mother. The woman looks over the one being offered and then points to the Sports Illustrated peeking out of the seat pocket and David pulls the magazine out and gives it to her. David waits until the opposing train passes. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. The woman goes back to her magazine and Kelly looks up from her Sports Illustrated her striking blue eyes gazing at David. She holds up her hand taps the diamond ring on her finger leading to an awkward silence. Kelly gets up balances herself against a headrest as the train rumbles and starts to the back of the car leaving David sitting alone looking like he is drowning but there is no water. David feels a stare glancing up to see the little girl spying on him from between the seats. He leans towards the window to avoid eye contact his hand reaching into his coat to slide out his wedding band which he puts back on. The vibration of the train begins to lull his eyes closed and his head bounces lightly against the window but the shaking of the glass never allows his eyes to completely close. He sits up when he realizes the shaking is getting stronger and looks out the window where the scenery blurs as it flies by. David turns noticing some of the other passengers reacting as the train picks up speed with the normal bumps of the tracks becoming amplified and the train going faster. David's eyes move to the seat in front of him to find the little girl no longer watching him. David looks to the passengers across from him seeing the ground slowly drop away in the windows behind them as a boy age ten sits on his head on the family couch and watches television upside down his floppy brown hair spreading out in a circle in front of his red face."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Mathison puts down his shopping bags and moves to her kneels down and gestures for the bundle of sweatshirts in her arms. The woman smiles for the first time and hands him the wrapped child. The doctor lowers the baby to his lap and unwraps him while the woman unable to see her baby watches Dr Mathison as he looks down and examines her child. The doctor finally glances up looking shaken and makes eye contact with the woman for only a second causing a chill to go through her body. He looks to the three saleswomen in the room his hard stare unsettling them and the older saleswoman speaks up. The vibration of the train begins to lull his eyes closed and his head bounces lightly against the window but the shaking of the glass never allows his eyes to completely close. He sits up when he realizes the shaking is getting stronger and looks out the window where the scenery blurs as it flies by. David turns noticing some of the other passengers reacting as the train picks up speed with the normal bumps of the tracks becoming amplified and the train going faster. David's eyes move to the seat in front of him to find the little girl no longer watching him. David looks to the passengers across from him seeing the ground slowly drop away in the windows behind them as a boy age ten sits on his head on the family couch and watches television upside down his floppy brown hair spreading out in a circle in front of his red face."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Mathison puts down his shopping bags and moves to her kneels down and gestures for the bundle of sweatshirts in her arms. The woman smiles for the first time and hands him the wrapped child. David's eyes move to the seat in front of him to find the little girl no longer watching him. David looks to the passengers across from him seeing the ground slowly drop away in the windows behind them as a boy age ten sits on his head on the family couch and watches television upside down his floppy brown hair spreading out in a circle in front of his red face."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Thompson drops his luggage and strolls to the pirate, squats down, and signals for the stack of paintings in her hands. The captain frowns for the last time and tosses him the bundled kitten. The chef raises the kitten to his hat and unwraps it while the captain, unable to spot her kitten, observes Chef Thompson as he gazes up and inspects her furball. The chef finally glances down, appearing amused, and makes eye contact with the captain for only a moment, triggering a warmth to rise within her spirit. He looks to the trio of gardeners in the arena, his gentle smile comforting them, and the younger gardener calls out. Everyone gets very loud, the captain looks like she started laughing, and the kitten purrs. The chef shouts something audible, gazes down to the gardener who directed him in, and Thompson turns back to the captain. The pirate glances over the one being ignored and then suggests the crossword puzzle peeking out of the backpack, and Adrian snatches the puzzle out and hands it to her. Adrian pauses until the trailing bus arrives. The pirate moves back to her puzzle, and Sandy peers down at her crossword puzzle, her striking green hat emerging at Adrian. She lifts her foot, taps the rubber boot on her toe, leading to pleasant chatter. Sandy sits down, steadies herself against a curtain as the bus shimmies, and strides to the front of the vehicle, leaving Adrian standing lonely appearing as if he's climbing, but there's no ladder. Adrian senses a whisper, peering down to discover the tiny boy writing about him from behind the cushion. He slides towards the aisle to encourage conversation, his hand reaching into his shirt to lift out his necklace, which he removes. The rhythm of the bus begins to stir his hands open, and his fingers bounce lightly against the cushion, but the shuddering of the fabric never allows his hands to fully open. He leans down when he suspects the shuddering is getting weaker and peers into the aisle, where the landscape sharpens as it floats by. Adrian rotates, observing some of the other travelers relaxing as the bus slows down, with the unusual jolts of the road becoming muffled and the bus moving slower. Adrian’s hands swing to the cushion under him to find the tiny boy still watching him. Adrian glances at the travelers beside him, spotting the sky slowly rise in the mirrors behind them as a cat, age five, curls on its tail on the carpeted floor and listens to music upright, its sharp claws stretching out in a pattern under its white ears."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Dr. Mathison kneels to take a wrapped child from a woman, examining the baby with a concerned expression that unsettles the room and chills the mother. As tension fills the air, the baby's cries break the silence. Meanwhile, David and Kelly, riding a train, navigate an awkward interaction. Kelly gestures to her diamond ring, creating a tense moment before she leaves. David, feeling uneasy, notices a little girl watching him and avoids eye contact, discreetly putting on his wedding band. As the train's speed intensifies, David becomes alert, noticing passengers reacting to the increasing velocity. The little girl is no longer visible, and David observes the scenery blur by, apprehensive about the growing speed."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "David looks to the passengers across from him seeing the ground slowly drop away in the windows behind them as a boy age ten sits on his head on the family couch and watches television upside down his floppy brown hair spreading out in a circle in front of his red face David's eyes move to the seat in front of him to find the little girl no longer watching him  David turns noticing some of the other passengers reacting as the train picks up speed with the normal bumps of the tracks becoming amplified and the train going faster  He sits up when he realizes the shaking is getting stronger and looks out the window where the scenery blurs as it flies by  The vibration of the train begins to lull his eyes closed and his head bounces lightly against the window but the shaking of the glass never allows his eyes to completely close  He leans towards the window to avoid eye contact his hand reaching into his coat to slide out his wedding band which he puts back on  David feels a stare glancing up to see the little girl spying on him from between the seats  Kelly gets up balances herself against a headrest as the train rumbles and starts to the back of the car leaving David sitting alone looking like he's drowning but there's no water  She holds up her hand taps the diamond ring on her finger leading to an awkward silence  The woman goes back to her magazine and Kelly looks up from her Sports Illustrated her striking blue eyes gazing at David  David waits until the opposing train passes  The woman looks over the one being offered and then points to the Sports Illustrated peeking out of the seat pocket and David pulls the magazine out and gives it to her  The doctor whispers something we can't hear looks up to the saleswoman who brought him in and Mathison turns back to the mother  the mother looks like she stopped breathing and the baby screams  Everyone becomes very still  He looks to the three saleswomen in the room his hard stare unsettling them and the older saleswoman speaks up  The doctor finally glances up looking shaken and makes eye contact with the woman for only a second causing a chill to go through her body  The doctor lowers the baby to his lap and unwraps him while the woman unable to see her baby watches Dr Mathison as he looks down and examines her child  The woman smiles for the first time and hands him the wrapped child  Mathison puts down his shopping bags and moves to her kneels down and gestures for the bundle of sweatshirts in her arms "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The woman smiles for the first time and hands him the wrapped child Mathison puts down his shopping bags and moves to her kneels down and gestures for the bundle of sweatshirts in her arms The doctor finally glances up looking shaken and makes eye contact with the woman for only a second causing a chill to go through her body The doctor lowers the baby to his lap and unwraps him while the woman unable to see her baby watches Dr Mathison as he looks down and examines her child Everyone becomes very still He looks to the three saleswomen in the room his hard stare unsettling them and the older saleswoman speaks up The doctor whispers something we cannot hear looks up to the saleswoman who brought him in and Mathison turns back to the mother the mother looks like she stopped breathing and the baby screams David waits until the opposing train passes The woman looks over the one being offered and then points to the Sports Illustrated peeking out of the seat pocket and David pulls the magazine out and gives it to her She holds up her hand taps the diamond ring on her finger leading to an awkward silence The woman goes back to her magazine and Kelly looks up from her Sports Illustrated her striking blue eyes gazing at David David feels a stare glancing up to see the little girl spying on him from between the seats Kelly gets up balances herself against a headrest as the train rumbles and starts to the back of the car leaving David sitting alone looking like he is drowning but there is no water The vibration of the train begins to lull his eyes closed and his head bounces lightly against the window but the shaking of the glass never allows his eyes to completely close He leans towards the window to avoid eye contact his hand reaching into his coat to slide out his wedding band which he puts back on David turns noticing some of the other passengers reacting as the train picks up speed with the normal bumps of the tracks becoming amplified and the train going faster He sits up when he realizes the shaking is getting stronger and looks out the window where the scenery blurs as it flies by David looks to the passengers across from him seeing the ground slowly drop away in the windows behind them as a boy age ten sits on his head on the family couch and watches television upside down his floppy brown hair spreading out in a circle in front of his red face David's eyes move to the seat in front of him to find the little girl no longer watching him"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The woman goes back to her magazine and Kelly looks up from her Sports Illustrated her striking blue eyes gazing at David  She holds up her hand taps the diamond ring on her finger leading to an awkward silence  Kelly gets up balances herself against a headrest as the train rumbles and starts to the back of the car leaving David sitting alone looking like he's drowning but there's no water  David feels a stare glancing up to see the little girl spying on him from between the seats  He leans towards the window to avoid eye contact his hand reaching into his coat to slide out his wedding band which he puts back on  The vibration of the train begins to lull his eyes closed and his head bounces lightly against the window but the shaking of the glass never allows his eyes to completely close  He sits up when he realizes the shaking is getting stronger and looks out the window where the scenery blurs as it flies by  David turns noticing some of the other passengers reacting as the train picks up speed with the normal bumps of the tracks becoming amplified and the train going faster  David's eyes move to the seat in front of him to find the little girl no longer watching him  David looks to the passengers across from him seeing the ground slowly drop away in the windows behind them as a boy age ten sits on his head on the family couch and watches television upside down his floppy brown hair spreading out in a circle in front of his red face Mathison puts down his shopping bags and moves to her kneels down and gestures for the bundle of sweatshirts in her arms  The woman smiles for the first time and hands him the wrapped child  The doctor lowers the baby to his lap and unwraps him while the woman unable to see her baby watches Dr Mathison as he looks down and examines her child  The doctor finally glances up looking shaken and makes eye contact with the woman for only a second causing a chill to go through her body  He looks to the three saleswomen in the room his hard stare unsettling them and the older saleswoman speaks up  Everyone becomes very still  the mother looks like she stopped breathing and the baby screams  The doctor whispers something we can't hear looks up to the saleswoman who brought him in and Mathison turns back to the mother  The woman looks over the one being offered and then points to the Sports Illustrated peeking out of the seat pocket and David pulls the magazine out and gives it to her  David waits until the opposing train passes "
        }
      ]
    }
  ]
}