{
  "ground_truth": "A man in a prison uniform with a bandage on his head turns and reacts to seeing Gandhi, taking his soup from Khan. Gandhi surveys the crowded yard, observing soiled bandages and determined faces, but is distracted by a group of guards, including an officer and four men, pushing through the prisoners. The prisoners reluctantly move back, their glances revealing Gandhi's identity. The prison officer's eyes meet Gandhi's, and Gandhi, now manacled, is marched down the pavement between two guards with the officer in front. A tall civil servant waits for them, and the officer removes Gandhi's manacles. The civil servant, showing distaste for his task, walks ahead of Gandhi, followed by a guard, toward a grand staircase. Office workers pause to stare at Gandhi as he passes, self-conscious of his prison attire. Tall white doors open, and the civil servant gestures for Gandhi to enter. Gandhi passes two secretaries, as the civil servant moves around him to knock on the inner doors, opening them and motioning Gandhi inside. Inside, Smuts stands behind a grand desk, having been seen previously with Walker. He nods to the civil servant, who bows and closes the door. Smuts crosses to a cabinet, observing Gandhi with surprise at his frigid tone, then smiles. Gandhi offers a wry smile and sits on the chair indicated by Smuts. Smuts assesses Gandhi, unsure of how to handle him, and takes Gandhi's irony at face value, challenging him, expecting a contest. Gandhi considers, then stands, uncertain about his sudden change in status. Smuts signs a document, misreading Gandhi's doubt. Daniels, the civil servant, enters, stares, then confusedly produces a shilling from his pocket and hands it to Gandhi, hinting at the ignominy of Gandhi's entrance. A prison guard appears, looking perplexed at Gandhi before seeking guidance from the office. Meanwhile, a British general descends a gangplank with his ADC.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A gentleman in a penitentiary outfit with a dressing on his cranium swivels and responds to noticing Gandhi, obtaining his broth from Khan. Gandhi examines the congested enclosure, perceiving sullied dressings and resolute visages, but is sidetracked by a cluster of wardens, including a commander and four individuals, shoving through the captives. The detainees grudgingly shift back, their looks exposing Gandhi's persona. The penitentiary official's gaze meets Gandhi's, and Gandhi, now shackled, is escorted along the walkway between two wardens with the commander ahead. A lofty bureaucrat awaits them, and the commander takes off Gandhi's shackles. The bureaucrat, displaying disdain for his duty, strides ahead of Gandhi, followed by a warden, toward a stately stairway. Clerical workers halt to gaze at Gandhi as he proceeds, self-conscious of his penitentiary garb. Lofty alabaster gates open, and the bureaucrat signals for Gandhi to enter. Gandhi passes two clerks, as the bureaucrat maneuvers around him to rap on the interior gates, opening them and gesturing Gandhi inside. Within, Smuts stands behind a majestic bureau, having been observed previously with Walker. He nods to the bureaucrat, who inclines and shuts the gate. Smuts crosses to a cupboard, observing Gandhi with astonishment at his icy tenor, then grins. Gandhi offers a sardonic grin and seats himself on the stool indicated by Smuts. Smuts evaluates Gandhi, unsure of how to address him, and accepts Gandhi's sarcasm at face worth, confronting him, anticipating a duel. Gandhi contemplates, then rises, unsure about his sudden shift in standing. Smuts endorses a manuscript, misjudging Gandhi's hesitation. Daniels, the bureaucrat, enters, gawks, then bewilderedly extracts a coin from his pocket and hands it to Gandhi, alluding to the humiliation of Gandhi's entrance. A penitentiary warden emerges, appearing baffled at Gandhi before seeking direction from the bureau. Meanwhile, a British officer descends a gangway with his ADC."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A man in a prison uniform with a bandage on his head turns and reacts to seeing Gandhi, taking his soup from Khan. The crowded yard is surveyed by Gandhi, with soiled bandages and determined faces being observed by him, but he is distracted by a group of guards, including an officer and four men, who push through the prisoners. The prisoners reluctantly move back, and Gandhi's identity is revealed by their glances. Gandhi's eyes are met by the prison officer's, and Gandhi, now manacled, is marched down the pavement between two guards with the officer in front. They are waited for by a tall civil servant, and Gandhi's manacles are removed by the officer. The civil servant, showing distaste for his task, walks ahead of Gandhi, followed by a guard, toward a grand staircase. Gandhi is stared at by office workers as he passes, self-conscious of his prison attire. Tall white doors open, and Gandhi is gestured to enter by the civil servant. Gandhi passes two secretaries, as the civil servant moves around him to knock on the inner doors, which he opens and motions Gandhi inside. Inside, Smuts stands behind a grand desk, having been seen previously with Walker. He nods to the civil servant, who bows and closes the door. Smuts crosses to a cabinet, observing Gandhi with surprise at his frigid tone, then smiles. A wry smile is offered by Gandhi, and he sits on the chair indicated by Smuts. Gandhi is assessed by Smuts, who is unsure of how to handle him, and he takes Gandhi's irony at face value, challenging him, expecting a contest. Gandhi considers, then stands, uncertain about his sudden change in status. A document is signed by Smuts, who misreads Gandhi's doubt. Daniels, the civil servant, enters, stares, then confusedly produces a shilling from his pocket and hands it to Gandhi, hinting at the ignominy of Gandhi's entrance. A prison guard appears, looking perplexed at Gandhi before seeking guidance from the office. Meanwhile, a gangplank is descended by a British general with his ADC."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A man in a prison uniform, head bandaged, turns and reacts upon seeing Gandhi, taking soup from Khan. Gandhi surveys the crowded yard, noting dirty bandages and determined faces, but is distracted by guards, including an officer and four men, moving through prisoners who reluctantly reveal Gandhi's identity. The officer's eyes meet Gandhi's as he is manacled and marched down the pavement with guards. A tall civil servant waits, the officer removes Gandhi's manacles, and Gandhi follows the civil servant, who shows distaste for his task, toward a grand staircase. Office workers stare at Gandhi, walking self-consciously in prison garb. Tall white doors open, the civil servant gestures Gandhi to enter. Gandhi passes two secretaries as the civil servant knocks, opens inner doors, and motions Gandhi inside. Inside, Smuts, previously seen with Walker, stands behind a grand desk. Smuts acknowledges the civil servant, who bows and closes the door. Smuts crosses to a cabinet, surprised by Gandhi's cold tone, and then smiles. Gandhi wryly smiles, sitting in a chair Smuts indicates. Smuts assesses Gandhi, unsure of handling him, and, expecting a challenge, misreads Gandhi's irony. Gandhi stands, uncertain of his change in status. Smuts signs a document, misreading Gandhi's doubt. Daniels, the civil servant, enters and confusedly hands Gandhi a shilling, hinting at the ignominy of his entrance. A prison guard appears, puzzled by Gandhi, seeking guidance. Meanwhile, a British general descends a gangplank with his ADC."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A man in a prison uniform with a head bandage reacts to seeing Gandhi take soup from Khan. Gandhi observes the crowded yard, noticing soiled bandages and determined faces, then becomes distracted by guards, including an officer, pushing through prisoners who recognize Gandhi. The officer's eyes meet Gandhi's, and Gandhi, manacled, is escorted by two guards following the officer. A tall civil servant removes Gandhi's manacles and leads him toward a grand staircase. Office workers stare at Gandhi as he passes. Tall doors open, and the civil servant gestures for Gandhi to enter, passing secretaries before opening inner doors where Smuts stands. Smuts observes Gandhi with surprise before smiling; Gandhi returns a wry smile and sits. Smuts, unsure, challenges Gandhi, who stands uncertainly. Smuts signs a document, misinterpreting Gandhi's doubt. Daniels, the civil servant, gives Gandhi a shilling, hinting at his entrance's ignominy. A prison guard looks confused at Gandhi, seeking guidance. Meanwhile, a British general descends a gangplank with his ADC."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A man, donning a prison uniform and with a fresh bandage wrapped around his head, turns around with a start and reacts upon seeing Gandhi approach. At this moment, he is in the process of receiving his soup from Khan. Gandhi, with a thoughtful gaze, surveys the bustling yard filled with prisoners, taking note of the soiled bandages and the determined expressions etched onto their faces. His observation is interrupted by the commotion of a group of guards, which includes an officer and a contingent of four men, as they forcefully make their way through the throng of prisoners. The prisoners grudgingly step aside, their sidelong glances betraying the realization of Gandhi’s identity among them. The eyes of the prison officer lock onto Gandhi's, and with a solemn air, Gandhi, now shackled, is escorted down the paved pathway by two guards, with the officer leading the procession. Awaiting them at the end of the path is a tall civil servant, who shows an evident disapproval of his duty as he unfastens Gandhi's manacles. This civil servant, clearly reluctant, starts walking ahead of Gandhi, who is followed closely by a guard, making their way toward an imposing grand staircase. As they proceed, office workers momentarily halt their tasks, captivated by the sight of Gandhi moving past them, evidently self-conscious of his conspicuous prison garb. The imposing tall white doors swing open, and the civil servant motions for Gandhi to proceed inside. As they advance, Gandhi passes by two secretaries before the civil servant circles around him, knocks on the inner doors, and opens them, indicating for Gandhi to enter. Within the room, Smuts stands authoritatively behind a large, distinguished desk. Having previously been seen with Walker, Smuts acknowledges the civil servant with a nod, who respectfully bows and closes the door behind him. Smuts then moves over to a cabinet, keenly observing Gandhi with a hint of surprise at the chill in his demeanor, and a smile begins to form on his lips. Gandhi returns a wry smile and takes a seat in the chair that Smuts has indicated. Smuts continues to scrutinize Gandhi, uncertain of how best to engage with him, taking Gandhi’s ironic demeanor at face value and bracing for an intellectual duel. Gandhi, lost in thought, stands up, appearing slightly unsure about the abrupt shift in his status. As Smuts goes about signing a document, he misinterprets Gandhi's moment of doubt. Daniels, the civil servant, steps back into the room and stares at Gandhi before, seemingly bewildered, he produces a shilling from his pocket. He hands it to Gandhi, subtly alluding to the humiliation of Gandhi's initial entrance. A prison guard appears as well, casting a puzzled glance at Gandhi, before seeking direction from the office. Meanwhile, outside, a British general descends the gangplank, accompanied by his ADC, making their way down."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A man, wearing a striped prison uniform and with a fresh white bandage carefully wrapped around his head, turns around abruptly and reacts with a start upon seeing Gandhi approach him. At this particular moment, he is in the process of receiving his bowl of soup from Khan. Gandhi, with a contemplative gaze, surveys the bustling yard that is teeming with prisoners, taking careful note of their soiled bandages and the determined expressions that are clearly etched onto their faces. His observation is suddenly interrupted by the noisy commotion of a group of guards, which includes an officer and a contingent of four men, as they forcefully make their way through the throng of prisoners. The prisoners grudgingly step aside, their sidelong glances betraying their realization of Gandhi’s identity among them. The eyes of the prison officer lock onto Gandhi's, and with a solemn air, Gandhi, now shackled, is escorted down a neatly paved pathway by two guards, with the officer leading the solemn procession. Awaiting them at the end of the path is a tall civil servant, who displays an evident disapproval of his duty as he unfastens Gandhi's manacles. This civil servant, clearly reluctant and hesitant, starts walking ahead of Gandhi, who is closely followed by a guard, making their way toward an imposing grand staircase. As they proceed along this path, office workers momentarily halt their tasks, captivated and intrigued by the sight of Gandhi moving past them, evidently self-conscious of his conspicuous prison garb. The imposing tall white doors swing open with a creak, and the civil servant motions for Gandhi to proceed inside. As they advance further along, Gandhi passes by two secretaries before the civil servant circles around him, knocks gently on the inner doors, and opens them, indicating for Gandhi to enter. Within this room, Smuts stands authoritatively behind a large, distinguished desk. Having been previously seen accompanying Walker, Smuts acknowledges the civil servant with a nod, who respectfully bows and closes the door behind him. Smuts then moves over to a cabinet, keenly observing Gandhi with a hint of surprise at the sudden chill in his demeanor, and a smile begins to form on his lips. Gandhi returns a wry smile and takes a seat in the chair that Smuts has indicated. Smuts continues to scrutinize Gandhi, uncertain of how best to engage with him, taking Gandhi’s ironic demeanor at face value and bracing himself for an intellectual duel. Gandhi, momentarily lost in thought, stands up, appearing slightly unsure about the abrupt shift in his status. As Smuts goes about signing a document, he misinterprets Gandhi's moment of doubt. Daniels, the civil servant, steps back into the room and stares at Gandhi before, seemingly bewildered, he produces a shilling from his pocket. He hands it to Gandhi, subtly alluding to the humiliation of Gandhi's initial entrance. A prison guard appears as well, casting a puzzled glance at Gandhi, before seeking further direction from the office. Meanwhile, outside, a British general descends the gangplank, accompanied by his attentive ADC, making their way down together."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A man dressed in a prison uniform, sporting a bandage on his head, turns his head upon realizing Gandhi's presence and reacts swiftly as he takes his soup from Khan. Meanwhile, Gandhi stands and surveys the crowded yard, his eyes moving over the scene as he takes in the sight of soiled bandages and determined faces, though his attention is soon captured by a group of guards. Among them is an officer with four men, who are decisively pushing their way through the gathered prisoners. As the guards advance, the prisoners begin to move back, albeit reluctantly, their sidelong glances revealing to one another Gandhi's notable identity. As the prison officer's eyes lock onto Gandhi's, Gandhi finds himself manacled and is then escorted down the pavement between two guards, with the officer leading the way. Awaiting them is a tall civil servant who appears ready to perform his duties. Upon arrival, the officer proceeds to remove Gandhi's manacles. With a visible expression of distaste for his task, the civil servant steps ahead of Gandhi, leading the way, followed in turn by a guard, as they proceed toward a grand staircase. Around them, office workers momentarily pause, their eyes following Gandhi, who feels self-conscious under their scrutiny, acutely aware of his attire that marks him as a prisoner. Upon reaching the destination, tall white doors stand before them, which are opened to reveal the passage ahead, and the civil servant gestures for Gandhi to proceed inside. Gandhi walks past two secretaries, each glance weighing on him, as the civil servant deftly moves around Gandhi, reaching the inner door. He knocks in a familiar manner, opens it, and motions for Gandhi to step inside. Inside the room stands Smuts behind a grand desk, an individual previously seen with Walker. Smuts nods towards the civil servant, who acknowledges the gesture with a bow and then quietly closes the door behind him. Smuts moves across to a cabinet, eyeing Gandhi with a mix of surprise at Gandhi's restrained, frigid tone. However, Smuts allows a smile to break through, prompting Gandhi to offer a wry smile in return and take his seat in the chair indicated by Smuts. As Smuts observes Gandhi, he tries to gauge the situation, unsure of how to interact with him and choosing to take Gandhi's irony at face value, positioning himself for an expected contest of wills. Gandhi, in turn, takes a moment to reflect, rising to his feet as he grapples with the uncertainty surrounding his abrupt change in status. Smuts, meanwhile, signs a document, misinterpreting Gandhi's silent doubt. The scenario is further complicated when Daniels, the civil servant, reenters the scene. He stares momentarily, then, with a look of confusion, retrieves a shilling from his pocket and extends it to Gandhi, an action subtly hinting at the ignominy of Gandhi's earlier entrance. Simultaneously, a prison guard appears, casting a perplexed look in Gandhi's direction, as if waiting for some form of guidance from within the office. Concurrently, the scene shifts to a British general who is making his way down a gangplank, accompanied by his ADC."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A man in a prison uniform with a bandage on his head reacts to seeing Gandhi as he receives soup from Khan. Gandhi surveys the crowded yard and its determined faces but becomes distracted by guards, including an officer, moving through the prisoners. As the prisoners move back, their glances reveal Gandhi's identity. The prison officer and Gandhi's eyes meet, and Gandhi, now manacled, is escorted between two guards while the officer leads them. Upon reaching a tall civil servant, the officer removes Gandhi's manacles, and the civil servant, reluctantly assuming his role, leads Gandhi, followed by a guard, toward a grand staircase. Office workers pause to stare at Gandhi as he passes in his prison attire. The civil servant gestures Gandhi through tall white doors, past two secretaries, and opens the inner doors, directing Gandhi inside. Smuts, standing behind a grand desk, acknowledges the civil servant, who closes the door. Smuts, initially surprised by Gandhi's demeanor, smiles as Gandhi offers a wry smile and takes a seat. Smuts, unsure of how to proceed, challenges Gandhi, expecting a contest. Gandhi contemplates this interaction, then stands, uncertain about his new status. Smuts signs a document, misinterpreting Gandhi's hesitation. Daniels, the civil servant, enters and, after a moment of confusion, hands Gandhi a shilling, symbolizing the irony of Gandhi's entrance. A perplexed prison guard enters, seeking guidance, while meanwhile, a British general descends a gangplank with his ADC."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A man in a prison uniform, typical of the South African penal system during the early 20th century, with a bandage on his head turns and reacts to seeing Gandhi, the prominent leader known for his nonviolent resistance, taking his soup from Khan. Gandhi surveys the crowded yard, a reflection of the harsh conditions faced by many political prisoners at the time, observing soiled bandages and determined faces, but is distracted by a group of guards, including an officer and four men, pushing through the prisoners. The prisoners reluctantly move back, their glances revealing Gandhi's identity, recognizing him as the famous advocate for Indian civil rights. The prison officer's eyes meet Gandhi's, and Gandhi, now manacled, is marched down the pavement, an experience common for detainees to signify their loss of freedom, between two guards with the officer in front. A tall civil servant, an indication of the bureaucratic nature of colonial administration, waits for them, and the officer removes Gandhi's manacles before his appearance in a formal setting. The civil servant, showing distaste for his task possibly due to Gandhi's high-profile status, walks ahead of Gandhi, followed by a guard, toward a grand staircase reminiscent of colonial architecture. Office workers pause to stare at Gandhi as he passes, likely aware of his significant role in opposing colonial policies, self-conscious of his prison attire. Tall white doors open, symbolizing the entrance to British authority, and the civil servant gestures for Gandhi to enter. Gandhi passes two secretaries, as the civil servant moves around him to knock on the inner doors, opening them and motioning Gandhi inside. Inside, Smuts, a key figure in the South African government known for his complex relationship with Gandhi, stands behind a grand desk, having been seen previously with Walker, Gandhi's ally in journalism. He nods to the civil servant, who bows, a gesture of respect within the hierarchical structure, and closes the door. Smuts crosses to a cabinet, observing Gandhi with surprise at his frigid tone, then smiles, recalling their earlier encounters marked by mutual respect and philosophical differences. Gandhi offers a wry smile and sits on the chair indicated by Smuts. Smuts assesses Gandhi, unsure of how to handle him, recalling past debates and negotiations, and takes Gandhi's irony at face value, challenging him, expecting a contest of ideals. Gandhi considers, then stands, uncertain about his sudden change in status from prisoner to negotiator. Smuts signs a document, misreading Gandhi's doubt, an action that reflects the legal processes of the time. Daniels, the civil servant, enters, stares, then, following a common bureaucratic gesture of the era, confusedly produces a shilling from his pocket and hands it to Gandhi, hinting at the ignominy of Gandhi's entrance in the colonial system. A prison guard appears, looking perplexed at Gandhi, perhaps unaccustomed to seeing such a notable figure, before seeking guidance from the office. Meanwhile, a British general, representing the military presence during Britain's colonial rule, descends a gangplank with his ADC, or aide-de-camp, reflecting the structured military hierarchy."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "A man in a prison uniform with a bandage on his head turns and reacts to seeing Gandhi taking his soup from Khan. Gandhi surveys the crowded yard observing soiled bandages and determined faces but is distracted by a group of guards including an officer and four men pushing through the prisoners. The prisoners reluctantly move back their glances revealing Gandhi's identity. The prison officer's eyes meet Gandhi's and Gandhi now manacled is marched down the pavement between two guards with the officer in front. A tall civil servant waits for them and the officer removes Gandhi's manacles. The civil servant showing distaste for his task walks ahead of Gandhi followed by a guard toward a grand staircase. Office workers pause to stare at Gandhi as he passes selfconscious of his prison attire. Tall white doors open and the civil servant gestures for Gandhi to enter. Gandhi passes two secretaries as the civil servant moves around him to knock on the inner doors opening them and motioning Gandhi inside. Inside. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Smuts stands behind a grand desk having been seen previously with Walker. He nods to the civil servant who bows and closes the door. Smuts crosses to a cabinet observing Gandhi with surprise at his frigid tone then smiles. Gandhi offers a wry smile and sits on the chair indicated by Smuts. Smuts assesses Gandhi unsure of how to handle him and takes Gandhi's irony at face value challenging him expecting a contest. Gandhi considers then stands uncertain about his sudden change in status. Smuts signs a document misreading Gandhi's doubt. Daniels the civil servant enters stares then confusedly produces a shilling from his pocket and hands it to Gandhi hinting at the ignominy of Gandhi's entrance. A prison guard appears looking perplexed at Gandhi before seeking guidance from the office. Meanwhile a British general descends a gangplank with his ADC."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "A man in a prison uniform with a bandage on his head turns and reacts to seeing Gandhi taking his soup from Khan. Gandhi surveys the crowded yard observing soiled bandages and determined faces but is distracted by a group of guards including an officer and four men pushing through the prisoners. The prisoners reluctantly move back their glances revealing Gandhi's identity. The prison officer's eyes meet Gandhi's and Gandhi now manacled is marched down the pavement between two guards with the officer in front. A tall civil servant waits for them and the officer removes Gandhi's manacles. The civil servant showing distaste for his task walks ahead of Gandhi followed by a guard toward a grand staircase. Office workers pause to stare at Gandhi as he passes selfconscious of his prison attire. Tall white doors open and the civil servant gestures for Gandhi to enter. Gandhi passes two secretaries as the civil servant moves around him to knock on the inner doors opening them and motioning Gandhi inside. Inside. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Smuts stands behind a grand desk having been seen previously with Walker. He nods to the civil servant who bows and closes the door. Smuts crosses to a cabinet observing Gandhi with surprise at his frigid tone then smiles. Gandhi offers a wry smile and sits on the chair indicated by Smuts. Smuts assesses Gandhi unsure of how to handle him and takes Gandhi's irony at face value challenging him expecting a contest. Gandhi considers then stands uncertain about his sudden change in status. Smuts signs a document misreading Gandhi's doubt. Daniels the civil servant enters stares then confusedly produces a shilling from his pocket and hands it to Gandhi hinting at the ignominy of Gandhi's entrance. A prison guard appears looking perplexed at Gandhi before seeking guidance from the office. Meanwhile a British general descends a gangplank with his ADC."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "A man in a prison uniform with a bandage on his head turns and reacts to seeing Gandhi taking his soup from Khan. Gandhi surveys the crowded yard observing soiled bandages and determined faces but is distracted by a group of guards including an officer and four men pushing through the prisoners. The prisoners reluctantly move back their glances revealing Gandhi's identity. The prison officer's eyes meet Gandhi's and Gandhi now manacled is marched down the pavement between two guards with the officer in front. A tall civil servant waits for them and the officer removes Gandhi's manacles. Gandhi considers then stands uncertain about his sudden change in status. Smuts signs a document misreading Gandhi's doubt. Daniels the civil servant enters stares then confusedly produces a shilling from his pocket and hands it to Gandhi hinting at the ignominy of Gandhi's entrance. A prison guard appears looking perplexed at Gandhi before seeking guidance from the office. Meanwhile a British general descends a gangplank with his ADC."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "A man in a prison uniform with a bandage on his head turns and reacts to seeing Gandhi taking his soup from Khan. Gandhi surveys the crowded yard observing soiled bandages and determined faces but is distracted by a group of guards including an officer and four men pushing through the prisoners. A prison guard appears looking perplexed at Gandhi before seeking guidance from the office. Meanwhile a British general descends a gangplank with his ADC."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "A dog in a tuxedo with a feather cap spins and sneezes at spotting Einstein, grabbing his sandwich from Smith. Einstein examines the busy garden, noticing muddy shoes and playful kittens, but is sidetracked by a herd of teachers, including a principal and four children, skipping through the squirrels. The squirrels hesitantly leap aside, their ears revealing Einstein's presence. The principal's nose sniffs Einstein's, and Einstein, now wearing earmuffs, is raced down the hallway between two teachers with the principal leading. A short librarian stands ready for them, and the principal removes Einstein's earmuffs. The librarian, displaying delight for her role, skips away from Einstein, trailed by a teacher, toward a tiny elevator. Shoppers hesitate to wave at Einstein as he dances, self-aware of his tuxedo outfit. Short black curtains part, and the librarian signals for Einstein to jump. Einstein glides past two chefs, as the librarian tiptoes around him to whistle at the outer curtains, pushing them and beckoning Einstein outside. Outside, Tesla waits behind a massive tree, having been observed earlier with Churchill. He winks at the librarian, who curtsies and drapes the curtain. Tesla strides to a shelf, eyeing Einstein with delight at his warm demeanor, then chuckles. Einstein presents a sincere laugh and reclines on the trampoline pointed to by Tesla. Tesla studies Einstein, puzzled by how to nurture him, and takes Einstein's humor at close range, daring him, predicting a game. Einstein wonders, then leaps, uneasy about his abrupt shift in surroundings. Tesla bakes a cake, misunderstanding Einstein's excitement. Robins, the librarian, skips, then excitedly tosses a penny from her bag and flips it to Einstein, alluding to the joyfulness of Einstein's leap. A shopkeeper arrives, feeling baffled at Einstein before seeking advice from the park. Meanwhile, an Italian chef climbs a ferris wheel with his intern."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In a prison yard, a man reacts upon seeing Gandhi, who observes the crowded scene until distracted by guards pushing through prisoners. Recognizing Gandhi's identity, the prison officer leads him, now manacled, between two guards. A tall civil servant removes the manacles and, distastefully, escorts Gandhi past staring office workers to a grand staircase. As tall white doors open, Gandhi passes secretaries, and the civil servant leads him inside to Smuts, who is surprised by Gandhi's tone but smiles. Gandhi sits as Smuts assesses him, expecting a challenge. Gandhi stands, contemplating his sudden change in status, while Smuts misreads his intentions and signs a document. Daniels, the civil servant, awkwardly hands Gandhi a shilling, symbolizing his humiliating entry, just as a perplexed prison guard and a British general with his aide arrive."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Meanwhile a British general descends a gangplank with his ADC A prison guard appears looking perplexed at Gandhi before seeking guidance from the office Daniels the civil servant enters stares then confusedly produces a shilling from his pocket and hands it to Gandhi hinting at the ignominy of Gandhi's entrance Smuts signs a document misreading Gandhi's doubt Gandhi considers then stands uncertain about his sudden change in status Smuts assesses Gandhi unsure of how to handle him and takes Gandhi's irony at face value challenging him expecting a contest Gandhi offers a wry smile and sits on the chair indicated by Smuts Smuts crosses to a cabinet observing Gandhi with surprise at his frigid tone then smiles He nods to the civil servant who bows and closes the door Smuts stands behind a grand desk having been seen previously with Walker Inside Gandhi passes two secretaries as the civil servant moves around him to knock on the inner doors opening them and motioning Gandhi inside Tall white doors open and the civil servant gestures for Gandhi to enter Office workers pause to stare at Gandhi as he passes selfconscious of his prison attire The civil servant showing distaste for his task walks ahead of Gandhi followed by a guard toward a grand staircase A tall civil servant waits for them and the officer removes Gandhi's manacles The prison officer's eyes meet Gandhi's and Gandhi now manacled is marched down the pavement between two guards with the officer in front The prisoners reluctantly move back their glances revealing Gandhi's identity Gandhi surveys the crowded yard observing soiled bandages and determined faces but is distracted by a group of guards including an officer and four men pushing through the prisoners A man in a prison uniform with a bandage on his head turns and reacts to seeing Gandhi taking his soup from Khan"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Gandhi surveys the crowded yard observing soiled bandages and determined faces but is distracted by a group of guards including an officer and four men pushing through the prisoners A man in a prison uniform with a bandage on his head turns and reacts to seeing Gandhi taking his soup from Khan The prison officer's eyes meet Gandhi's and Gandhi now manacled is marched down the pavement between two guards with the officer in front The prisoners reluctantly move back their glances revealing Gandhi's identity The civil servant showing distaste for his task walks ahead of Gandhi followed by a guard toward a grand staircase A tall civil servant waits for them and the officer removes Gandhi's manacles Tall white doors open and the civil servant gestures for Gandhi to enter Office workers pause to stare at Gandhi as he passes selfconscious of his prison attire Inside Gandhi passes two secretaries as the civil servant moves around him to knock on the inner doors opening them and motioning Gandhi inside He nods to the civil servant who bows and closes the door Smuts stands behind a grand desk having been seen previously with Walker Gandhi offers a wry smile and sits on the chair indicated by Smuts Smuts crosses to a cabinet observing Gandhi with surprise at his frigid tone then smiles Gandhi considers then stands uncertain about his sudden change in status Smuts assesses Gandhi unsure of how to handle him and takes Gandhi's irony at face value challenging him expecting a contest Daniels the civil servant enters stares then confusedly produces a shilling from his pocket and hands it to Gandhi hinting at the ignominy of Gandhi's entrance Smuts signs a document misreading Gandhi's doubt Meanwhile a British general descends a gangplank with his ADC A prison guard appears looking perplexed at Gandhi before seeking guidance from the office"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Smuts stands behind a grand desk having been seen previously with Walker He nods to the civil servant who bows and closes the door Smuts crosses to a cabinet observing Gandhi with surprise at his frigid tone then smiles Gandhi offers a wry smile and sits on the chair indicated by Smuts Smuts assesses Gandhi unsure of how to handle him and takes Gandhi's irony at face value challenging him expecting a contest Gandhi considers then stands uncertain about his sudden change in status Smuts signs a document misreading Gandhi's doubt Daniels the civil servant enters stares then confusedly produces a shilling from his pocket and hands it to Gandhi hinting at the ignominy of Gandhi's entrance A prison guard appears looking perplexed at Gandhi before seeking guidance from the office Meanwhile a British general descends a gangplank with his ADC A man in a prison uniform with a bandage on his head turns and reacts to seeing Gandhi taking his soup from Khan Gandhi surveys the crowded yard observing soiled bandages and determined faces but is distracted by a group of guards including an officer and four men pushing through the prisoners The prisoners reluctantly move back their glances revealing Gandhi's identity The prison officer's eyes meet Gandhi's and Gandhi now manacled is marched down the pavement between two guards with the officer in front A tall civil servant waits for them and the officer removes Gandhi's manacles The civil servant showing distaste for his task walks ahead of Gandhi followed by a guard toward a grand staircase Office workers pause to stare at Gandhi as he passes selfconscious of his prison attire Tall white doors open and the civil servant gestures for Gandhi to enter Gandhi passes two secretaries as the civil servant moves around him to knock on the inner doors opening them and motioning Gandhi inside Inside"
        }
      ]
    }
  ]
}