{
  "ground_truth": "Under his shirt, we see the wrappings around his ribs. Audrey is taken off guard by the question. She stares at Elijah. Elijah smiles warmly. Audrey smiles softly back. Elijah smiles even bigger. Audrey's eyes become utterly still. David stands at the lip of a tunnel that opens out onto the upper section of the second level. Waves of people move from their seats through the tunnel to the bathrooms and concession stands and back again. David stares to the side away from the movement, his shoulder leaned up against the wall. His shoulder leaves the wall. He steps out into the stream of people. Shoulders and arms bump into him and brush by him as they move. David's eyes are looking down -- his expression still -- like he's listening. He's in the heaviest part of the movement now. Fans continue to brush against him as they pass. And then it happens. A stocky woman bumps into him. Joseph turns to the thermometer boy. David nods. David stares at the white-haired nurse. David stares at the woman. David seems lost in his thoughts. He looks up at the nurse. Joseph finally looks up. Tears in his eyes. David moves closer to Joseph on the bench. Joseph just stares at his father. David is rinsing out the bowl when Audrey walks in. David turns off the water. Audrey sees David's shocked expression. Audrey turns around. She screams. He's crying hard. In his outstretched hands is the hand gun from David's closet. It's pointed directly at David. David shoots a tense glance at Audrey. David starts moving a little to his right. Joseph follows him with the barrel of the handgun. David stops moving. Joseph stops moving. Joseph's small face tenses. Confusion mixes with the desperation on his face. Joseph looks up, tears streaming down his cheeks. Joseph starts pressing the trigger. The hammer clicks back. Joseph freezes. David flashes a desperate glance at Audrey then back to Joseph. David becomes still as his words register. David looks unsteady all of a sudden. Elijah seems shaken for the first time. David stares at him coldly. The top of the man's head doesn't move. Ponytail man closes his register and walks towards the back. As he gets closer to the customer, he realizes that the man is in a wheelchair. The Ponytail man walks up to Elijah. He sits in his chair in a quiet daze. Ponytail man leans over. The Ponytail man shakes his head, moves behind Elijah. He starts wheeling him towards the front of the store. They move down a narrow aisle of comics. Elijah suddenly grabs the left wheel and turns the chair. His immobilized left leg hits a rack of comic books.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Beneath his shirt, we observe the bandages around his ribs. Audrey is caught off guard by the inquiry. She gazes at Elijah. Elijah grins warmly. Audrey grins softly back. Elijah grins even bigger. Audrey's eyes become completely still. David stands at the edge of a tunnel that opens out onto the upper portion of the second level. Waves of people proceed from their seats through the tunnel to the restrooms and concession booths and back again. David gazes to the side away from the movement, his shoulder leaned up against the barrier. His shoulder leaves the barrier. He steps out into the stream of people. Shoulders and arms jostle into him and brush by him as they proceed. David's eyes are looking downward -- his expression still -- like he's listening. He's in the densest part of the movement now. Fans continue to brush against him as they proceed. And then it occurs. A stout woman jostles into him. Joseph turns to the thermostat boy. David nods. David gazes at the white-haired nurse. David gazes at the woman. David seems lost in his musings. He glances up at the nurse. Joseph finally glances up. Tears in his eyes. David moves nearer to Joseph on the bench. Joseph just gazes at his father. David is rinsing out the bowl when Audrey walks in. David turns off the water. Audrey observes David's shocked expression. Audrey turns around. She shouts. He's weeping hard. In his outstretched hands is the handgun from David's closet. It's aimed directly at David. David shoots a tense glance at Audrey. David starts shifting a little to his right. Joseph follows him with the barrel of the handgun. David halts shifting. Joseph halts shifting. Joseph's small face tenses. Confusion blends with the desperation on his face. Joseph glances up, tears streaming down his cheeks. Joseph starts pressing the trigger. The hammer clicks back. Joseph freezes. David flashes a desperate glance at Audrey then back to Joseph. David becomes still as his words register. David looks unstable all of a sudden. Elijah seems shaken for the first time. David gazes at him coldly. The top of the man's head doesn't move. Ponytail man shuts his register and walks towards the back. As he gets nearer to the customer, he realizes that the man is in a wheelchair. The Ponytail man walks up to Elijah. He sits in his chair in a quiet daze. Ponytail man leans over. The Ponytail man shakes his head, moves behind Elijah. He starts wheeling him towards the front of the store. They move down a narrow aisle of comics. Elijah suddenly grabs the left wheel and turns the chair. His immobilized left leg hits a rack of comic books."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Under his shirt, the wrappings around his ribs are seen by us. The question takes Audrey off guard. Elijah is stared at by her. A warm smile is given by Elijah. A soft smile is given back by Audrey. An even bigger smile is given by Elijah. Audrey's eyes become utterly still. At the lip of a tunnel that opens out onto the upper section of the second level, David stands. Their seats are left by waves of people as they move through the tunnel to the bathrooms and concession stands and back again. Away from the movement, David stares to the side, his shoulder leaning up against the wall. The wall is left by his shoulder. Out into the stream of people, he steps. He is bumped into and brushed by shoulders and arms as they move. Down, David's eyes are looking—his expression still—like he's listening. He's now in the heaviest part of the movement. As they pass, fans continue to brush against him. And then it happens. Into him, a stocky woman bumps. To the thermometer boy, Joseph turns. A nod is given by David. At the white-haired nurse, David stares. At the woman, David stares. Lost in his thoughts, David seems. Up at the nurse, he looks. Joseph finally looks up, tears in his eyes. Closer to Joseph on the bench, David moves. At his father, Joseph just stares. Out the bowl is being rinsed by David when Audrey walks in. The water is turned off by David. David's shocked expression is seen by Audrey. Around, Audrey turns. A scream is let out by her. Hard, he's crying. The handgun from David's closet is in his outstretched hands. Directly at David, it's pointed. At Audrey, a tense glance is shot by David. A little to his right, David starts moving. With the barrel of the handgun, Joseph follows him. Moving, David stops. Moving, Joseph stops. A tense expression takes over Joseph's small face. With desperation, confusion mixes on his face. Up, Joseph looks, tears streaming down his cheeks. The trigger starts being pressed by Joseph. Back, the hammer clicks. Frozen, Joseph becomes. A desperate glance is flashed by David at Audrey then back to Joseph. Still, David becomes as his words are registered. Unsteadiness is shown by David all of a sudden. For the first time, Elijah seems shaken. Coldly, David stares at him. The top of the man's head doesn't move. His register is closed by Ponytail man, and towards the back, he walks. As he gets closer to the customer, it is realized by him that the man is in a wheelchair. Up to Elijah, the Ponytail man walks. In his chair, he sits in a quiet daze. Over the chair, Ponytail man leans. He shakes his head and moves behind Elijah. Towards the front of the store, he starts wheeling him. Down a narrow aisle of comics, they move. The left wheel is suddenly grabbed by Elijah and the chair is turned. A rack of comic books is hit by his immobilized left leg."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Under his shirt, we see Elijah's rib wrappings. Audrey is surprised by the question and stares at Elijah, who smiles warmly. Audrey smiles softly back, and Elijah's smile grows. Audrey's eyes become still. David stands at a tunnel's edge on the second level. People move through the tunnel to bathrooms and concessions. David leans against the wall, then steps into the crowd. Shoulders and arms brush against him as he listens, eyes down. A stocky woman bumps into him. Joseph turns to the thermometer boy. David nods and stares at the white-haired nurse, lost in thought. He looks up at the nurse. Joseph finally looks up, tears in his eyes. David moves closer to Joseph on the bench. Joseph stares at his father. David rinses a bowl when Audrey enters. David turns off the water, shocked. Audrey turns and screams. Joseph is crying, holding a handgun from David's closet, aimed at David. David glances tensely at Audrey and moves right. Joseph follows with the gun. Both stop moving. Joseph's face tenses with confusion and desperation. Tears stream as Joseph starts pressing the trigger. The hammer clicks back, and Joseph freezes. David glances desperately at Audrey, then Joseph. David becomes still, unsteady. Elijah seems shaken for the first time. David stares coldly at him. The man's head doesn't move. Ponytail man closes his register and approaches Elijah, realizing he's in a wheelchair. He wheels Elijah towards the store's front. They move down a narrow comic aisle. Elijah grabs the left wheel, turning the chair, and his immobilized leg hits a comic rack."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Under his shirt, Elijah's ribs are wrapped. Audrey is surprised by the question and stares at Elijah, who smiles warmly. Audrey smiles back softly, and Elijah's smile grows. Audrey's eyes become still. David stands at a tunnel's edge on the second level. People move through the tunnel to bathrooms and concessions. David leans against the wall, then steps into the crowd. People bump and brush past him. David looks down, listening, in the thick of the movement. A stocky woman bumps him. Joseph turns to the thermometer boy. David nods, staring at a white-haired nurse and a woman, lost in thought. He looks up at the nurse. Joseph, teary-eyed, looks up. David moves closer to Joseph on the bench. Joseph stares at his father. David rinses a bowl when Audrey enters. David turns off the water, shocked. Audrey turns and screams. Joseph, crying, holds a handgun from David's closet, aimed at David. David glances tensely at Audrey and moves right. Joseph follows with the gun. Both stop moving. Joseph's face tenses with confusion and desperation. Tears stream as Joseph starts pressing the trigger. The hammer clicks back, and Joseph freezes. David glances desperately at Audrey, then Joseph. David becomes still, unsteady. Elijah is shaken for the first time. David stares coldly. The man's head doesn't move. Ponytail man closes his register, approaches Elijah in a wheelchair, and wheels him to the store's front. They move down a comic aisle. Elijah grabs the left wheel, turning the chair, and his immobilized leg hits a comic rack."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Beneath his shirt, we can clearly see the bandages wrapped snugly around his ribs. Audrey is caught off guard by the unexpected question. She finds herself staring at Elijah, who responds with a warm, inviting smile. Audrey, in turn, offers a soft, gentle smile back at him. Elijah's smile grows even larger, radiating warmth. Audrey's eyes become completely still, as if frozen in the moment. Meanwhile, David stands at the edge of a tunnel that opens out onto the upper section of the second level. Waves of people are moving from their seats, flowing through the tunnel to the bathrooms and concession stands, and then returning again. David directs his gaze to the side, away from the bustling movement, with his shoulder leaned up against the wall for support. His shoulder eventually leaves the wall as he steps out into the stream of people. As he moves, shoulders and arms bump into him and brush past him. David's eyes are cast downward, his expression remaining still, as if he is listening intently. He finds himself in the densest part of the crowd now. Fans continue to brush against him as they pass by. And then, it happens. A stocky woman bumps into him. Joseph turns his attention to the thermometer boy. David gives a nod. David fixes his stare on the white-haired nurse. He then shifts his gaze to the woman, appearing lost in his thoughts. He looks up at the nurse. Joseph finally looks up, tears welling in his eyes. David moves closer to Joseph on the bench, closing the distance between them. Joseph simply stares at his father. David is in the process of rinsing out the bowl when Audrey walks in. David promptly turns off the water. Audrey notices David's shocked expression. She turns around abruptly and screams. He's crying hard, and in his outstretched hands is the handgun from David's closet, pointed directly at David. David shoots a tense, urgent glance at Audrey. He begins to move slightly to his right. Joseph follows him with the barrel of the handgun, mirroring his movements. David halts his movement. Joseph also stops. Joseph's small face tenses, a mix of confusion and desperation etched across it. Joseph looks up, tears streaming down his cheeks. He starts pressing the trigger, and the hammer clicks back. Joseph freezes in place. David flashes a desperate glance at Audrey, then back to Joseph. David becomes still as his words register. Suddenly, David looks unsteady. Elijah appears shaken for the first time. David stares at him coldly. The top of the man's head remains motionless. The Ponytail man closes his register and walks towards the back. As he approaches the customer, he realizes that the man is in a wheelchair. The Ponytail man walks up to Elijah, who sits in his chair in a quiet daze. The Ponytail man leans over, shaking his head, and moves behind Elijah. He begins wheeling him towards the front of the store. They navigate down a narrow aisle filled with comics. Suddenly, Elijah grabs the left wheel and turns the chair sharply. His immobilized left leg collides with a rack of comic books."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Beneath his shirt, the bandages wrapped snugly around his ribs are clearly visible to anyone who looks. Audrey finds herself taken by surprise, caught off guard by the unexpected nature of the question directed at her. Her gaze becomes fixed on Elijah, who looks back at her with a warm and inviting smile that seems to exude friendliness. In response, Audrey offers him a soft and gentle smile, reciprocating the warmth in his expression. Elijah’s smile widens even further, radiating warmth and joy. Audrey’s eyes, meanwhile, become completely still, as if they are frozen in that moment of connection.\n\nElsewhere, David stands at the edge of a tunnel, which opens out onto the upper section of the second level in the busy arena. Waves of people are steadily moving from their seats, flowing through the tunnel as they make their way to the bathrooms and concession stands, and then returning once again. David directs his gaze to the side, away from the bustling and constant movement around him, leaning his shoulder up against the wall for support. Soon, his shoulder leaves the wall as he steps out, merging into the stream of people. As he does, shoulders and arms from the crowd bump into him and brush past him. With his eyes cast downward, David’s expression remains still and impassive, as if he is listening intently to some distant sound. He finds himself now immersed in the most crowded part of the area. Fans continue to brush against him as they move by. And then, it happens. A stocky woman collides with him unexpectedly. At that moment, Joseph turns his attention to the boy with the thermometer. David gives a nod of acknowledgment. He fixes his stare on the nurse with striking white hair before shifting his gaze to the woman, appearing momentarily lost in his thoughts. Glancing back up at the nurse, Joseph eventually looks up, tears welling in his eyes. He watches as David moves closer to him on the bench, closing the distance between them. Joseph simply stares at his father, caught in the moment.\n\nDavid is in the process of rinsing out the bowl when Audrey walks in unexpectedly. David promptly turns off the running water. Audrey notices David’s shocked expression, and without warning, she turns around abruptly and screams. Tears stream down his face as he cries hard, and in his outstretched hands is the handgun from David’s closet, pointed directly at him. David shoots a tense and urgent glance at Audrey. He begins to move ever so slightly to his right. Joseph follows him with the barrel of the handgun, mirroring each of his movements. David halts his movement. Joseph also comes to a stop. Joseph's small face tenses as a mix of confusion and desperation becomes etched across it. Looking up, tears continue to stream down Joseph’s cheeks. He starts pressing the trigger, the hammer clicking back ominously. Joseph freezes in place. David flashes a desperate glance first at Audrey, then back to Joseph. David becomes perfectly still as the gravity of his words registers. Suddenly, David looks unsteady, as if shaken by a realization. Elijah, for the first time, appears shaken. David stares at him coldly, unyielding. The top of the man's head remains perfectly motionless. \n\nThe Ponytail man closes his cash register and begins walking towards the back. As he approaches the customer, he realizes that the man is seated in a wheelchair. The Ponytail man walks up to Elijah, who sits in his chair, lost in a quiet daze. Leaning over, the Ponytail man shakes his head and moves behind Elijah. He begins to wheel him towards the front of the store. Together, they navigate down a narrow aisle filled with an array of comic books. Suddenly, Elijah makes a sharp move, grabbing the left wheel and turning the chair abruptly. His immobilized left leg collides with a rack of comic books, causing it to sway slightly."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Beneath his shirt, the wrappings around his ribs become visible, revealing the extent of his injuries. Audrey, caught off guard by the unexpected question, finds herself momentarily stunned and stares at Elijah, who responds with a warm smile. This gesture prompts Audrey to smile softly in return, which in turn causes Elijah's smile to grow even bigger. As this exchange unfolds, Audrey's eyes become utterly still, capturing the intensity of the moment. Meanwhile, David stands at the entrance of a tunnel that leads to the upper section of the second level, observing the waves of people moving from their seats through the tunnel to the bathrooms and concession stands and back again. He diverts his gaze to the side, away from the bustling movement, while leaning his shoulder against the wall. After a moment, he pushes off the wall and steps into the stream of people, where shoulders and arms bump into him and brush by as they move past. With his eyes cast downward and his expression remaining still, David appears to be listening intently, even as he finds himself in the thickest part of the crowd. Fans continue to brush against him, and then a stocky woman bumps into him, marking a pivotal moment. Joseph turns his attention to the thermometer boy, and David acknowledges this with a nod. David's gaze shifts to the white-haired nurse, then to the woman, as he seems lost in his thoughts. He looks up at the nurse, and Joseph finally looks up, tears welling in his eyes. David moves closer to Joseph on the bench, and Joseph simply stares at his father. In another scene, David is rinsing out a bowl when Audrey enters the room. He turns off the water, and Audrey notices the shocked expression on his face. She turns around and screams, confronted by the sight of Joseph crying hard, holding the handgun from David's closet in his outstretched hands, pointed directly at David. David shoots a tense glance at Audrey before starting to move slightly to his right, prompting Joseph to follow him with the barrel of the handgun. David halts his movement, and Joseph mirrors him, stopping as well. Joseph's small face tenses, a mix of confusion and desperation etched across it, as he looks up with tears streaming down his cheeks. He begins to press the trigger, and the hammer clicks back, but Joseph freezes. David flashes a desperate glance at Audrey and then back to Joseph, becoming still as his words register. Suddenly, David appears unsteady, and for the first time, Elijah seems shaken. David stares coldly at him, while the top of the man's head remains motionless. The Ponytail man closes his register and walks towards the back, realizing as he approaches that the customer is in a wheelchair. He walks up to Elijah, who sits in his chair in a quiet daze. The Ponytail man leans over, shakes his head, and moves behind Elijah, beginning to wheel him towards the front of the store. They navigate down a narrow aisle of comics, but suddenly, Elijah grabs the left wheel and turns the chair, causing his immobilized left leg to hit a rack of comic books."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Under his shirt, the wrappings around Elijah's ribs are visible. Audrey is caught off guard by the question and exchanges a series of smiles with Elijah, her eyes becoming still. Meanwhile, David stands at the entrance of a tunnel leading to the second level, observing the flow of people moving to and from the bathrooms and concession stands. He leans against the wall, then steps into the crowd, feeling the brush of shoulders and arms as he listens intently. Amidst the movement, a stocky woman bumps into him. Joseph turns to the thermometer boy, nods, and stares at the white-haired nurse, lost in thought. He looks up at the nurse, tears in his eyes, and moves closer to Joseph on the bench, who just stares at him. \n\nDavid is rinsing a bowl when Audrey enters, prompting him to turn off the water. Audrey sees his shocked expression, turns around, and screams. Joseph, crying hard, holds a handgun from David's closet, pointing it directly at him. David shoots a tense glance at Audrey, starts moving to his right, and Joseph follows with the gun. Both stop moving, and Joseph's face tenses with confusion and desperation. As tears stream down his cheeks, Joseph begins to press the trigger, but freezes when the hammer clicks back. David flashes a desperate glance at Audrey, then back to Joseph, becoming still as his words register. He suddenly looks unsteady, and Elijah appears shaken for the first time. David stares coldly at him, while the Ponytail man closes his register and approaches Elijah, realizing he is in a wheelchair. The Ponytail man wheels Elijah towards the front of the store, navigating a narrow aisle of comics. Suddenly, Elijah grabs the left wheel, turning the chair and hitting a rack of comic books with his immobilized left leg."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Under his shirt, we see the wrappings around his ribs, likely a sign of a recent injury that hasn't yet healed. Audrey is taken off guard by the question. She stares at Elijah, a man known for his calm demeanor. Elijah smiles warmly, a gesture that often reassures those around him. Audrey smiles softly back. Elijah smiles even bigger, his trademark infectious grin spreading across his face. Audrey's eyes become utterly still, reflecting her deep concentration. \n\nDavid stands at the lip of a tunnel that opens out onto the upper section of the second level, where the busy crowd of a large stadium fills the air with a hum of excitement. Waves of people move from their seats through the tunnel to the bathrooms and concession stands and back again, typical activities during a break in a sporting event or concert. David stares to the side away from the movement, his shoulder leaned up against the cold concrete wall. His shoulder leaves the wall. He steps out into the stream of people, a flowing mass of fans clad in team colors. Shoulders and arms bump into him and brush by him as they move. David's eyes are looking down -- his expression still -- like he's listening to the faint echo of the stadium announcer overhead. He's in the heaviest part of the movement now. Fans continue to brush against him as they pass. And then it happens. A stocky woman bumps into him, her expression one of focused urgency. \n\nJoseph turns to the thermometer boy, who is known around the neighborhood for always carrying the device. David nods. David stares at the white-haired nurse, her years of experience evident in her calm, steady gaze. David stares at the woman. David seems lost in his thoughts. He looks up at the nurse, expecting some reassurance. Joseph finally looks up. Tears in his eyes. David moves closer to Joseph on the bench, offering silent support. Joseph just stares at his father, confusion written across his young face. David is rinsing out the bowl when Audrey walks in, the kitchen filled with the aroma of freshly cooked food. David turns off the water. Audrey sees David's shocked expression. Audrey turns around. She screams. \n\nHe's crying hard. In his outstretched hands is the hand gun from David's closet, a hidden item meant to be out of reach. It's pointed directly at David. David shoots a tense glance at Audrey. David starts moving a little to his right, trying to diffuse the situation. Joseph follows him with the barrel of the handgun. David stops moving. Joseph stops moving. Joseph's small face tenses. Confusion mixes with the desperation on his face. Joseph looks up, tears streaming down his cheeks, his emotions overwhelming him. Joseph starts pressing the trigger. The hammer clicks back. Joseph freezes, the sound jolting him back to reality. David flashes a desperate glance at Audrey then back to Joseph. David becomes still as his words register. \n\nDavid looks unsteady all of a sudden. Elijah seems shaken for the first time, a rare occurrence for someone usually composed. David stares at him coldly. The top of the man's head doesn't move, indicating his deep focus. Ponytail man closes his register and walks towards the back, his shift nearing its end. As he gets closer to the customer, he realizes that the man is in a wheelchair. The Ponytail man walks up to Elijah. He sits in his chair in a quiet daze, lost in thought. Ponytail man leans over. The Ponytail man shakes his head, moves behind Elijah. He starts wheeling him towards the front of the store, navigating through narrow spaces. They move down a narrow aisle of comics, brightly colored, filled with superheroes and adventures. Elijah suddenly grabs the left wheel and turns the chair. His immobilized left leg hits a rack of comic books, sending them tumbling to the floor."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Under his shirt we see the wrappings around his ribs. Audrey is taken off guard by the question. She stares at Elijah. Elijah smiles warmly. Audrey smiles softly back. Elijah smiles even bigger. Audrey's eyes become utterly still. David stands at the lip of a tunnel that opens out onto the upper section of the second level. Waves of people move from their seats through the tunnel to the bathrooms and concession stands and back again. David stares to the side away from the movement his shoulder leaned up against the wall. His shoulder leaves the wall. He steps out into the stream of people. Shoulders and arms bump into him and brush by him as they move. David's eyes are looking down  his expression still  like he is listening. He is in the heaviest part of the movement now. Fans continue to brush against him as they pass. And then it happens. A stocky woman bumps into him. Joseph turns to the thermometer boy. David nods. David stares at the whitehaired nurse. David stares at the woman. David seems lost in his thoughts. He looks up at the nurse. Joseph finally looks up. Tears in his eyes. David moves closer to Joseph on the bench. Joseph just stares at his father. David is rinsing out the bowl when Audrey walks in. David turns off the water. Audrey sees David's shocked expression. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Audrey turns around. She screams. He is crying hard. In his outstretched hands is the hand gun from David's closet. It is pointed directly at David. David shoots a tense glance at Audrey. David starts moving a little to his right. Joseph follows him with the barrel of the handgun. David stops moving. Joseph stops moving. Joseph's small face tenses. Confusion mixes with the desperation on his face. Joseph looks up tears streaming down his cheeks. Joseph starts pressing the trigger. The hammer clicks back. Joseph freezes. David flashes a desperate glance at Audrey then back to Joseph. David becomes still as his words register. David looks unsteady all of a sudden. Elijah seems shaken for the first time. David stares at him coldly. The top of the man's head does not move. Ponytail man closes his register and walks towards the back. As he gets closer to the customer he realizes that the man is in a wheelchair. The Ponytail man walks up to Elijah. He sits in his chair in a quiet daze. Ponytail man leans over. The Ponytail man shakes his head moves behind Elijah. He starts wheeling him towards the front of the store. They move down a narrow aisle of comics. Elijah suddenly grabs the left wheel and turns the chair. His immobilized left leg hits a rack of comic books."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Under his shirt we see the wrappings around his ribs. Audrey is taken off guard by the question. She stares at Elijah. Elijah smiles warmly. Audrey smiles softly back. Elijah smiles even bigger. Audrey's eyes become utterly still. David stands at the lip of a tunnel that opens out onto the upper section of the second level. Waves of people move from their seats through the tunnel to the bathrooms and concession stands and back again. David stares to the side away from the movement his shoulder leaned up against the wall. His shoulder leaves the wall. He steps out into the stream of people. Shoulders and arms bump into him and brush by him as they move. David's eyes are looking down  his expression still  like he is listening. He is in the heaviest part of the movement now. Fans continue to brush against him as they pass. And then it happens. A stocky woman bumps into him. Joseph turns to the thermometer boy. David nods. David stares at the whitehaired nurse. David stares at the woman. David seems lost in his thoughts. He looks up at the nurse. Joseph finally looks up. Tears in his eyes. David moves closer to Joseph on the bench. Joseph just stares at his father. David is rinsing out the bowl when Audrey walks in. David turns off the water. Audrey sees David's shocked expression. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. Audrey turns around. She screams. He is crying hard. In his outstretched hands is the hand gun from David's closet. It is pointed directly at David. David shoots a tense glance at Audrey. David starts moving a little to his right. Joseph follows him with the barrel of the handgun. David stops moving. Joseph stops moving. Joseph's small face tenses. Confusion mixes with the desperation on his face. Joseph looks up tears streaming down his cheeks. Joseph starts pressing the trigger. The hammer clicks back. Joseph freezes. David flashes a desperate glance at Audrey then back to Joseph. David becomes still as his words register. David looks unsteady all of a sudden. Elijah seems shaken for the first time. David stares at him coldly. The top of the man's head does not move. Ponytail man closes his register and walks towards the back. As he gets closer to the customer he realizes that the man is in a wheelchair. The Ponytail man walks up to Elijah. He sits in his chair in a quiet daze. Ponytail man leans over. The Ponytail man shakes his head moves behind Elijah. He starts wheeling him towards the front of the store. They move down a narrow aisle of comics. Elijah suddenly grabs the left wheel and turns the chair. His immobilized left leg hits a rack of comic books."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Under his shirt we see the wrappings around his ribs. Audrey is taken off guard by the question. She stares at Elijah. Elijah smiles warmly. Audrey smiles softly back. Elijah smiles even bigger. Audrey's eyes become utterly still. David stands at the lip of a tunnel that opens out onto the upper section of the second level. Waves of people move from their seats through the tunnel to the bathrooms and concession stands and back again. David stares to the side away from the movement his shoulder leaned up against the wall. His shoulder leaves the wall. He steps out into the stream of people. Shoulders and arms bump into him and brush by him as they move. David's eyes are looking down  his expression still  like he is listening. He is in the heaviest part of the movement now. Fans continue to brush against him as they pass. David flashes a desperate glance at Audrey then back to Joseph. David becomes still as his words register. David looks unsteady all of a sudden. Elijah seems shaken for the first time. David stares at him coldly. The top of the man's head does not move. Ponytail man closes his register and walks towards the back. As he gets closer to the customer he realizes that the man is in a wheelchair. The Ponytail man walks up to Elijah. He sits in his chair in a quiet daze. Ponytail man leans over. The Ponytail man shakes his head moves behind Elijah. He starts wheeling him towards the front of the store. They move down a narrow aisle of comics. Elijah suddenly grabs the left wheel and turns the chair. His immobilized left leg hits a rack of comic books."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Under his shirt we see the wrappings around his ribs. Audrey is taken off guard by the question. She stares at Elijah. Elijah smiles warmly. Audrey smiles softly back. Elijah smiles even bigger. He sits in his chair in a quiet daze. Ponytail man leans over. The Ponytail man shakes his head moves behind Elijah. He starts wheeling him towards the front of the store. They move down a narrow aisle of comics. Elijah suddenly grabs the left wheel and turns the chair. His immobilized left leg hits a rack of comic books."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Inside his jacket, we observe the bandages covering his elbows. Margaret is caught by surprise with the inquiry. She gazes at Harold. Harold grins broadly. Margaret grins gently in response. Harold grins even wider. Margaret's gaze becomes completely calm. Robert stands at the edge of a bridge that opens out onto the lower section of the third tier. Groups of animals wander from their nest through the bridge to the kitchens and souvenir shops and back again. Robert gazes to the side away from the activity, his knee pressed up against the fence. His knee detaches from the fence. He hops out into the parade of animals. Knees and tails collide with him and graze past him as they wander. Robert's eyes are fixed downward -- his appearance calm -- as if he's hearing. He's now in the thickest part of the parade. Creatures continue to graze past him as they stroll. And then it happens. A bulky parrot collides with him. Michael turns to the compass girl. Robert nods. Robert gazes at the bald farmer. Robert gazes at the parrot. Robert seems absorbed in his musings. He peers up at the farmer. Michael eventually peers up. Raindrops in his glasses. Robert edges nearer to Michael on the log. Michael merely gazes at his uncle. Robert is wiping the pan when Margaret strides in. Robert halts the faucet. Margaret notices Robert's stunned demeanor. Margaret rotates around. She yells. He's sobbing intensely. In his extended fingers is the paintbrush from Robert's locker. It's directed straight at Robert. Robert throws a wary look at Margaret. Robert begins shuffling a bit to his left. Michael tracks him with the point of the paintbrush. Robert halts shuffling. Michael halts shuffling. Michael's tiny face tightens. Bewilderment mingles with the urgency on his expression. Michael gazes up, raindrops trickling down his nose. Michael begins squeezing the nozzle. The brush retracts. Michael stiffens. Robert shoots a frantic look at Margaret then back to Michael. Robert becomes motionless as his language is understood. Robert appears wobbly all of a sudden. Harold seems startled for the initial time. Robert gazes at him icily. The peak of the woman's cap remains idle. Beanie man closes his stall and strolls towards the rear. As he inches nearer to the visitor, he perceives that the woman is on crutches. The Beanie man strolls up to Harold. He reclines in his seat in a silent stupor. Beanie man tilts forward. The Beanie man shakes his mane, strides behind Harold. He begins guiding him towards the entrance of the shop. They wander down a cramped lane of journals. Harold abruptly seizes the right handle and pivots the seat. His stationary right elbow collides with a shelf of graphic novels."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Under his shirt, Elijah's ribs are wrapped. Audrey is surprised by a question and exchanges smiles with Elijah. David stands at a tunnel leading to the second level with people moving around him. He steps into the crowd, bumping into shoulders and arms. Suddenly, a stocky woman collides with him. David's eyes are downcast, lost in thought. Joseph looks tearfully at David, who responds with a tense glance. Joseph points a handgun from David's closet at him, following David’s movements with the barrel. Joseph’s face shows confusion and desperation as he starts pressing the trigger. David becomes unsteady and exchanges desperate glances with Audrey and Joseph. Meanwhile, Ponytail man notices Elijah in a wheelchair and wheels him through the store. Elijah takes control, causing his leg to hit a comic book rack."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "His immobilized left leg hits a rack of comic books Elijah suddenly grabs the left wheel and turns the chair  They move down a narrow aisle of comics  He starts wheeling him towards the front of the store  The Ponytail man shakes his head moves behind Elijah  Ponytail man leans over  He sits in his chair in a quiet daze  The Ponytail man walks up to Elijah  As he gets closer to the customer he realizes that the man is in a wheelchair  Ponytail man closes his register and walks towards the back  The top of the man's head doesn't move  David stares at him coldly  Elijah seems shaken for the first time  David looks unsteady all of a sudden  David becomes still as his words register  David flashes a desperate glance at Audrey then back to Joseph  Joseph freezes  The hammer clicks back  Joseph starts pressing the trigger  Joseph looks up tears streaming down his cheeks  Confusion mixes with the desperation on his face  Joseph's small face tenses  Joseph stops moving  David stops moving  Joseph follows him with the barrel of the handgun  David starts moving a little to his right  David shoots a tense glance at Audrey  It's pointed directly at David  In his outstretched hands is the hand gun from David's closet  He's crying hard  She screams  Audrey turns around  Audrey sees David's shocked expression  David turns off the water  David is rinsing out the bowl when Audrey walks in  Joseph just stares at his father  David moves closer to Joseph on the bench  Tears in his eyes  Joseph finally looks up  He looks up at the nurse  David seems lost in his thoughts  David stares at the woman  David stares at the whitehaired nurse  David nods  Joseph turns to the thermometer boy  A stocky woman bumps into him  And then it happens  Fans continue to brush against him as they pass  He's in the heaviest part of the movement now  David's eyes are looking down  his expression still  like he's listening  Shoulders and arms bump into him and brush by him as they move  He steps out into the stream of people  His shoulder leaves the wall  David stares to the side away from the movement his shoulder leaned up against the wall  Waves of people move from their seats through the tunnel to the bathrooms and concession stands and back again  David stands at the lip of a tunnel that opens out onto the upper section of the second level  Audrey's eyes become utterly still  Elijah smiles even bigger  Audrey smiles softly back  Elijah smiles warmly  She stares at Elijah  Audrey is taken off guard by the question  Under his shirt we see the wrappings around his ribs "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Audrey is taken off guard by the question Under his shirt we see the wrappings around his ribs Elijah smiles warmly She stares at Elijah Elijah smiles even bigger Audrey smiles softly back David stands at the lip of a tunnel that opens out onto the upper section of the second level Audrey's eyes become utterly still David stares to the side away from the movement his shoulder leaned up against the wall Waves of people move from their seats through the tunnel to the bathrooms and concession stands and back again He steps out into the stream of people His shoulder leaves the wall David's eyes are looking down  his expression still  like he is listening Shoulders and arms bump into him and brush by him as they move Fans continue to brush against him as they pass He is in the heaviest part of the movement now A stocky woman bumps into him And then it happens David nods Joseph turns to the thermometer boy David stares at the woman David stares at the whitehaired nurse He looks up at the nurse David seems lost in his thoughts Tears in his eyes Joseph finally looks up Joseph just stares at his father David moves closer to Joseph on the bench David turns off the water David is rinsing out the bowl when Audrey walks in Audrey turns around Audrey sees David's shocked expression He is crying hard She screams It is pointed directly at David In his outstretched hands is the hand gun from David's closet David starts moving a little to his right David shoots a tense glance at Audrey David stops moving Joseph follows him with the barrel of the handgun Joseph's small face tenses Joseph stops moving Joseph looks up tears streaming down his cheeks Confusion mixes with the desperation on his face The hammer clicks back Joseph starts pressing the trigger David flashes a desperate glance at Audrey then back to Joseph Joseph freezes David looks unsteady all of a sudden David becomes still as his words register David stares at him coldly Elijah seems shaken for the first time Ponytail man closes his register and walks towards the back The top of the man's head does not move The Ponytail man walks up to Elijah As he gets closer to the customer he realizes that the man is in a wheelchair Ponytail man leans over He sits in his chair in a quiet daze He starts wheeling him towards the front of the store The Ponytail man shakes his head moves behind Elijah Elijah suddenly grabs the left wheel and turns the chair They move down a narrow aisle of comics His immobilized left leg hits a rack of comic books"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She screams  He's crying hard  In his outstretched hands is the hand gun from David's closet  It's pointed directly at David  David shoots a tense glance at Audrey  David starts moving a little to his right  Joseph follows him with the barrel of the handgun  David stops moving  Joseph stops moving  Joseph's small face tenses  Confusion mixes with the desperation on his face  Joseph looks up tears streaming down his cheeks  Joseph starts pressing the trigger  The hammer clicks back  Joseph freezes  David flashes a desperate glance at Audrey then back to Joseph  David becomes still as his words register  David looks unsteady all of a sudden  Elijah seems shaken for the first time  David stares at him coldly  The top of the man's head doesn't move  Ponytail man closes his register and walks towards the back  As he gets closer to the customer he realizes that the man is in a wheelchair  The Ponytail man walks up to Elijah  He sits in his chair in a quiet daze  Ponytail man leans over  The Ponytail man shakes his head moves behind Elijah  He starts wheeling him towards the front of the store  They move down a narrow aisle of comics  Elijah suddenly grabs the left wheel and turns the chair  His immobilized left leg hits a rack of comic books Under his shirt we see the wrappings around his ribs  Audrey is taken off guard by the question  She stares at Elijah  Elijah smiles warmly  Audrey smiles softly back  Elijah smiles even bigger  Audrey's eyes become utterly still  David stands at the lip of a tunnel that opens out onto the upper section of the second level  Waves of people move from their seats through the tunnel to the bathrooms and concession stands and back again  David stares to the side away from the movement his shoulder leaned up against the wall  His shoulder leaves the wall  He steps out into the stream of people  Shoulders and arms bump into him and brush by him as they move  David's eyes are looking down  his expression still  like he's listening  He's in the heaviest part of the movement now  Fans continue to brush against him as they pass  And then it happens  A stocky woman bumps into him  Joseph turns to the thermometer boy  David nods  David stares at the whitehaired nurse  David stares at the woman  David seems lost in his thoughts  He looks up at the nurse  Joseph finally looks up  Tears in his eyes  David moves closer to Joseph on the bench  Joseph just stares at his father  David is rinsing out the bowl when Audrey walks in  David turns off the water  Audrey sees David's shocked expression  Audrey turns around "
        }
      ]
    }
  ]
}