{
  "ground_truth": "Even at the late hour, there is heavy traffic throughout the station. David's eyes dart up as the slick-haired man turns the corner at the information booth, and he watches him for a beat. David watches the teenager with baggy jeans hanging off his hip as he walks and greets a group of identically dressed friends. David turns his hands back in and seems shaken. He takes a couple of deep breaths as he gathers himself, then steps back to look around. He bumps the shoulder of a man standing behind him, taking a sudden breath like someone punched him in the solar plexus. The enormous glassy-eyed man takes hold of the screen door handle and turns it as the man inside the house grabs the door handle on the inside to stop him. The man inside the house uses all his strength to keep the door from opening, but it opens slowly anyway. David stands frozen in the train station, his face almost unreadable, standing less than a foot away from the man he bumped, and they are shoulder to shoulder. David's eyes slowly move from the ground over his right and then finally onto the man, who is huge, at least three inches taller than David, with massive shoulders and wearing a one-piece orange uniform. The man in the orange uniform leans over a trashcan next to him and removes the full trash bag within it, replaces it with a fresh one, throws the full trash bag into a gray plastic bin with wheels, and starts pushing it. Four identical gray bins sit outside the door, and the huge man disappears with his bin inside. David waits, staring hard at the double doors, and then they open as the huge glassy-eyed man in orange emerges carrying a bag over his shoulder, now wearing a baseball hat with his uniform. He heads toward a back exit, and David lets him get about twenty feet away before deciding to follow him. The man in the orange uniform walks in the driving rain down a residential city block, almost all the lights in the middle-class homes he's passing are off at this late hour. The orange figure turns the corner onto a block of modest standalone homes, walking slower, and looks around carefully as he moves. He turns into a driveway of one of the homes, stops, and pulls a wad of mail out of the mailbox. David stands with the hood of his security coat covering his head and face, standing in the shadows and watching silently as the man in the orange uniform looks over his massive shoulder before turning a knob and entering the white paneled house through a familiar side door with a screen on it.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Even at the late time, there is dense congestion throughout the depot. David's eyes dart up as the slick-haired fellow pivots the corner at the information kiosk, and he observes him for a moment. David observes the adolescent with loose trousers hanging off his hip as he walks and greets a group of similarly dressed comrades. David turns his hands back in and seems unsettled. He takes a couple of deep inhalations as he collects himself, then steps back to glance around. He bumps the shoulder of an individual standing behind him, taking a sudden inhale like someone struck him in the solar plexus. The enormous glassy-eyed fellow takes hold of the screen door handle and rotates it as the individual inside the residence grabs the door handle on the inside to halt him. The individual inside the residence utilizes all his force to keep the door from opening, but it opens gradually regardless. David stands immobilized in the train depot, his face almost inscrutable, standing less than a foot away from the person he bumped, and they are shoulder to shoulder. David's eyes slowly move from the ground over his right and then finally onto the individual, who is gigantic, at least three inches taller than David, with massive shoulders and wearing a single-piece orange attire. The person in the orange attire leans over a trashcan next to him and removes the full trash sack within it, replaces it with a fresh one, throws the full trash sack into a gray plastic container with wheels, and starts pushing it. Four identical gray containers sit outside the entrance, and the enormous person vanishes with his container inside. David waits, staring hard at the double doors, and then they open as the enormous glassy-eyed individual in orange emerges carrying a sack over his shoulder, now wearing a baseball cap with his attire. He heads toward a rear exit, and David lets him get about twenty feet away before resolving to follow him. The individual in the orange attire walks in the driving rain down a residential city block, almost all the lights in the middle-class residences he's passing are off at this late time. The orange figure pivots the corner onto a block of modest standalone residences, walking slower, and looks around cautiously as he moves. He turns into a driveway of one of the residences, stops, and pulls a wad of correspondence out of the mailbox. David stands with the hood of his security coat covering his head and face, standing in the shadows and observing silently as the individual in the orange attire looks over his massive shoulder before turning a knob and entering the white paneled house through a familiar side entrance with a screen on it."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Even at the late hour, heavy traffic is observed throughout the station. David's eyes are darted up as the slick-haired man turns the corner at the information booth, and he watches him for a beat. The teenager with baggy jeans hanging off his hip is watched by David as he walks and greets a group of identically dressed friends. David's hands are turned back in, and he seems shaken. A couple of deep breaths are taken by him as he gathers himself, then he steps back to look around. The shoulder of a man standing behind him is bumped by him, taking a sudden breath like someone punched him in the solar plexus. The screen door handle is taken hold of by the enormous glassy-eyed man, and it is turned as the man inside the house grabs the door handle on the inside to stop him. All his strength is used by the man inside the house to keep the door from opening, but it opens slowly anyway. David stands frozen in the train station, his face almost unreadable, standing less than a foot away from the man he bumped, and they are shoulder to shoulder. From the ground over his right, David's eyes slowly move and then finally onto the man, who is huge, at least three inches taller than David, with massive shoulders and wearing a one-piece orange uniform. Over a trashcan next to him, the man in the orange uniform leans and removes the full trash bag within it, replaces it with a fresh one, throws the full trash bag into a gray plastic bin with wheels, and starts pushing it. Outside the door sit four identical gray bins, and with his bin, the huge man disappears inside. Hard at the double doors, David waits, staring, and then they are opened as the huge glassy-eyed man in orange emerges carrying a bag over his shoulder, now wearing a baseball hat with his uniform. Toward a back exit, he heads, and about twenty feet away, David lets him get before he decides to follow him. Down a residential city block, the man in the orange uniform walks in the driving rain; at this late hour, almost all the lights in the middle-class homes he's passing are off. Onto a block of modest standalone homes, the orange figure turns the corner, walking slower, and looks around carefully as he moves. Into a driveway of one of the homes, he turns, stops, and pulls a wad of mail out of the mailbox. With the hood of his security coat covering his head and face, David stands in the shadows and watches silently as the man in the orange uniform looks over his massive shoulder before a knob is turned by him and the white paneled house is entered through a familiar side door with a screen on it."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Even at the late hour, the station remains busy. David's eyes dart up as the slick-haired man turns the corner at the info booth. He observes a teenager in baggy jeans greet identically dressed friends, then refocuses, appearing shaken. After a few deep breaths, he accidentally bumps a man behind him, reacting as if struck in the solar plexus. This giant, glassy-eyed man grips the screen door handle; the man inside struggles to keep it shut, yet it opens slowly. David stands frozen, almost unreadable, inches from the man he bumped, shoulder to shoulder. The giant, wearing an orange one-piece uniform, leans over a trashcan, replaces the bag, and pushes the bin away. Four identical bins wait outside as the man disappears with his. David watches the doors until the man reemerges, now with a baseball hat, carrying a bag over his shoulder, heading to a back exit. David waits twenty feet before trailing him. In the rain, the orange figure walks down a residential block where most homes are dark. Slowing, he turns onto a block of modest homes, checks his surroundings, retrieves mail from a driveway mailbox, and enters a white-paneled house through a familiar side door with a screen. David, hooded, stands in the shadows, observing."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Despite the late hour, the station is bustling. David watches a slick-haired man at the information booth and a teenager in baggy jeans greet friends. Shaken, David takes deep breaths, bumps into a man behind him, and looks around. A huge man in an orange uniform replaces a trash bag and pushes a bin through doors before reemerging with a bag over his shoulder and a baseball cap. David follows him in the rain through a dim residential area. The orange-clad man carefully moves, checks the mail, and enters a house through a side door. David, hooded, watches from the shadows."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Even at this late hour, the station is overwhelmed with heavy, persistent traffic that continues to flow through. David's eyes swiftly dart upward as he notices a man with slicked-back hair rounding the corner at the information booth, capturing his attention for a brief moment. He then observes a teenager, whose baggy jeans precariously hang off his hip as he makes his way through the crowd, confidently greeting a group of friends who are dressed in identical fashion. Shaken by the bustling scene, David turns his hands inward, appearing somewhat rattled. To steady himself, he takes a few deliberate deep breaths, collecting his composure before stepping back to survey his surroundings once more. In doing so, he unintentionally bumps into the shoulder of a man standing directly behind him, drawing a sharp, startled breath as if he had been unexpectedly punched in the solar plexus. \n\nMeanwhile, an enormous man, with eyes that appear almost glassy, grips the handle of a screen door, attempting to turn it, as someone inside the house desperately holds the door handle from within, straining to keep it closed with all their might. Despite the resistance, the door slowly creaks open anyway. Back at the train station, David remains frozen in place, his expression nearly inscrutable, standing mere inches away from the man he had bumped. They stand shoulder to shoulder as David's gaze gradually lifts from the ground, sweeping over his right shoulder, before finally settling on the towering figure beside him. This man is notably larger than David, towering at least three inches taller with an imposing set of massive shoulders, clad in a bright orange, one-piece uniform. \n\nThe man in the orange uniform bends over a nearby trashcan, efficiently removing the full trash bag within, replacing it with a fresh one. He discards the full bag into a nearby gray plastic bin equipped with wheels and begins to maneuver it away. Outside the door, four identical gray bins sit aligned, and the huge man swiftly disappears into the building with his bin in tow. David remains in place, his eyes fixed intently on the double doors. When they eventually swing open, the same large, glassy-eyed man in orange reemerges. Now carrying a bag over his shoulder, the man has added a baseball hat to his uniform, and he heads purposefully toward a back exit. David waits until the man is about twenty feet ahead before making the decision to discreetly follow him. \n\nThe man in the orange uniform strides through the driving rain down a residential city block, where almost all the lights in the modest middle-class homes are turned off at this late hour. The orange-clad figure turns a corner onto a block of simple, standalone homes, slowing his pace and surveying his surroundings with care. He approaches the driveway of one such home, halts, and retrieves a bundle of mail from the mailbox. Concealed by the hood of his security coat, which covers his head and face, David remains in the shadows, watching silently as the man in the orange uniform glances cautiously over his substantial shoulder. The man then turns a knob and enters the white paneled house through a familiar side door, which is fitted with a screen."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Even at this somewhat advanced hour, the station is still inundated with an unyielding and heavy stream of traffic that persistently flows through the area. David's eyes quickly glance upward, moving swiftly as he catches sight of a man with perfectly slicked-back hair rounding the corner at the busy information booth, momentarily capturing and holding his attention. He then observes a teenager, whose exceedingly baggy jeans hang precariously off his hip as he confidently navigates through the bustling crowd, warmly greeting a group of friends clad in an identical style of attire. Slightly shaken by the teeming scene around him, David turns his hands inward, appearing somewhat rattled and unsettled. To regain his steadiness, he takes several deliberate, deep breaths, collecting and calming his composure before he steps back to survey his surroundings again. In doing so, he unintentionally bumps into the shoulder of a man who is standing directly behind him, drawing a sharp, startled breath, as if he had been unexpectedly struck in the solar plexus. \n\nMeanwhile, an enormous and massive man, with eyes that appear almost unnaturally glassy, tightly grips the handle of a screen door, attempting to turn it as someone inside the house desperately holds the door handle from within, straining with all their might to keep it closed. Despite their resistance, the door slowly creaks open nonetheless. Back at the train station, David remains frozen and rooted in place, his expression almost inscrutable, standing just a few inches away from the man he had bumped. They stand shoulder to shoulder as David's gaze gradually lifts from the ground, sweeping over his right shoulder before finally settling on the towering figure beside him. This man is notably larger in stature than David, standing at least three inches taller with an imposing set of massive shoulders, clad in a bright orange, one-piece uniform that makes him stand out. \n\nThe man in the orange uniform bends over a nearby trashcan, efficiently removing the full and overflowing trash bag within, replacing it with a fresh, new one. He discards the full bag into a nearby gray plastic bin that is equipped with wheels and begins to maneuver it away. Outside the door, four identical gray bins sit aligned in a neat row, and the huge man swiftly disappears into the building with his bin in tow. David remains in place, his eyes fixed intently on the double doors. When they eventually swing back open, the same large, glassy-eyed man in orange reemerges. Now carrying a bag over his shoulder, the man has added a baseball hat to his uniform, and he heads purposefully toward a back exit. David waits patiently until the man is about twenty feet ahead before he makes the decision to discreetly follow him at a safe distance. \n\nThe man in the orange uniform strides through the driving rain down a residential city block, where almost all the lights in the modest, middle-class homes are turned off at this late and quiet hour. The orange-clad figure then turns a corner onto a block of simple, standalone homes, slowing his pace considerably and surveying his surroundings with careful attention. He approaches the driveway of one such home, comes to a halt, and retrieves a bundle of mail from the mailbox. Concealed by the hood of his security coat, which covers his head and face entirely, David remains hidden in the shadows, watching silently and intently as the man in the orange uniform glances cautiously over his substantial shoulder. The man then turns a knob and enters the familiar white paneled house through a side door, which is fitted with a screen."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Even at the late hour, the station is bustling with heavy traffic, and David's gaze shifts upward as he notices a slick-haired man turning the corner at the information booth, holding his attention for a brief moment as the man passes by. His focus then shifts to a teenager whose baggy jeans hang loosely off his hips, and David observes as the teenager strides forward, greeting a group of friends dressed in a similar style. Feeling unsettled, David turns his hands inward and takes a moment to regain his composure, inhaling deeply several times to steady himself before stepping back to survey his surroundings. Inadvertently, he collides with the shoulder of the man standing behind him, causing him to draw in a sharp breath as if he had been struck in the solar plexus. This enormous man with glassy eyes grips the screen door handle firmly and begins to twist it, while inside the house, another man desperately grasps the interior handle in an attempt to prevent the door from opening—straining with all his might, though the door slowly gives way. David remains motionless in the train station, his expression inscrutable as he stands within a foot of the man he bumped, their shoulders occasionally brushing against one another. David's eyes gradually drift from the ground, sliding over to his right, before finally settling on the towering figure beside him. The man is at least three inches taller than David, with broad shoulders clad in a one-piece orange uniform. This man in orange leans over a nearby trashcan to retrieve the filled trash bag from within, quickly replacing it with a fresh one before tossing the full bag into a gray plastic bin on wheels and beginning to push it away. As four identical gray bins sit lined up outside the door, the massive man disappears with his bin inside. David waits, keeping his gaze fixed intently on the double doors until they swing open again to reveal the same huge, glassy-eyed man now emerging with a bag slung over his shoulder and a baseball hat perched atop his uniform. He heads towards a back exit, and after he gets about twenty feet away, David makes the decision to follow him. The man in the orange uniform proceeds to walk through the driving rain down a residential city block, where nearly all the lights in the middle-class homes remain dark at this late hour. The orange-clad figure turns onto a block of modest standalone homes, his pace slowing as he carefully surveys his surroundings. He then turns into the driveway of one of these homes, pauses briefly, and retrieves a wad of mail from the mailbox. Meanwhile, David stands shrouded in shadows, the hood of his security coat obscuring his head and face, silently watching as the man in the orange uniform casts a watchful gaze over his massive shoulder before turning the knob and entering the white-paneled house through a side door that features a familiar screen."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Despite the late hour, the station bustles with heavy traffic. David briefly observes a slick-haired man turn a corner at the information booth and then notes a teenager in baggy jeans joining similarly dressed friends. Appearing shaken, David regains composure with a few deep breaths before inadvertently bumping into a large man behind him. This encounter momentarily startles David as the imposing figure, dressed in an orange uniform, efficiently replaces a trash bag and wheels a bin away. David remains fixated on the double doors, watching as the man in orange reemerges, now with a baseball hat and a bag slung over his shoulder, heading toward a back exit. Allowing a small distance to form, David discreetly follows the man through driving rain across a residential city block, where most lights are off. The man in orange slowly navigates onto a block of modest homes, retrieves mail from a driveway mailbox, and, with a cautious glance over his shoulder, enters a familiar white-paneled house through a side door. David, concealed by the hood of his security coat, watches silently from the shadows."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Even at the late hour, there is heavy traffic throughout the station, a major transit hub in the city known for its round-the-clock activity. David's eyes dart up as the slick-haired man, who bears a striking resemblance to a well-known local businessman, turns the corner at the information booth, and he watches him for a beat. David watches the teenager with baggy jeans hanging off his hip, a fashion trend popularized by hip-hop culture in the 1990s, as he walks and greets a group of identically dressed friends. David turns his hands back in and seems shaken. He takes a couple of deep breaths as he gathers himself, then steps back to look around. He bumps the shoulder of a man standing behind him, taking a sudden breath like someone punched him in the solar plexus, a sensitive area known to incapacitate a person when struck. The enormous glassy-eyed man takes hold of the screen door handle and turns it as the man inside the house grabs the door handle on the inside to stop him. The man inside the house uses all his strength to keep the door from opening, but it opens slowly anyway. David stands frozen in the train station, his face almost unreadable, standing less than a foot away from the man he bumped, and they are shoulder to shoulder. David's eyes slowly move from the ground over his right and then finally onto the man, who is huge, at least three inches taller than David, with massive shoulders and wearing a one-piece orange uniform, typically worn by sanitation workers in the city. The man in the orange uniform leans over a trashcan next to him and removes the full trash bag within it, replaces it with a fresh one, throws the full trash bag into a gray plastic bin with wheels, and starts pushing it. Four identical gray bins sit outside the door, a common sight for efficient waste management at large facilities, and the huge man disappears with his bin inside. David waits, staring hard at the double doors, and then they open as the huge glassy-eyed man in orange emerges carrying a bag over his shoulder, now wearing a baseball hat with his uniform. He heads toward a back exit used by staff for discretion, and David lets him get about twenty feet away before deciding to follow him. The man in the orange uniform walks in the driving rain down a residential city block, where almost all the lights in the middle-class homes he's passing are off at this late hour, typical of a neighborhood that's quiet and family-oriented. The orange figure turns the corner onto a block of modest standalone homes, walking slower, and looks around carefully as he moves. He turns into a driveway of one of the homes, stops, and pulls a wad of mail out of the mailbox, a mundane routine hinting at a personal connection to the residence. David stands with the hood of his security coat, a standard issue for night guards, covering his head and face, standing in the shadows and watching silently as the man in the orange uniform looks over his massive shoulder before turning a knob and entering the white paneled house through a familiar side door with a screen on it."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Even at the late hour there is heavy traffic throughout the station. David's eyes dart up as the slickhaired man turns the corner at the information booth and he watches him for a beat. David watches the teenager with baggy jeans hanging off his hip as he walks and greets a group of identically dressed friends. David turns his hands back in and seems shaken. He takes a couple of deep breaths as he gathers himself then steps back to look around. He bumps the shoulder of a man standing behind him taking a sudden breath like someone punched him in the solar plexus. The enormous glassyeyed man takes hold of the screen door handle and turns it as the man inside the house grabs the door handle on the inside to stop him. The man inside the house uses all his strength to keep the door from opening but it opens slowly anyway. David stands frozen in the train station his face almost unreadable standing less than a foot away from the man he bumped and they are shoulder to shoulder. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. David's eyes slowly move from the ground over his right and then finally onto the man who is huge at least three inches taller than David with massive shoulders and wearing a onepiece orange uniform. The man in the orange uniform leans over a trashcan next to him and removes the full trash bag within it replaces it with a fresh one throws the full trash bag into a gray plastic bin with wheels and starts pushing it. Four identical gray bins sit outside the door and the huge man disappears with his bin inside. David waits staring hard at the double doors and then they open as the huge glassyeyed man in orange emerges carrying a bag over his shoulder now wearing a baseball hat with his uniform. He heads toward a back exit and David let us him get about twenty feet away before deciding to follow him. The man in the orange uniform walks in the driving rain down a residential city block. almost all the lights in the middleclass homes he is passing are off at this late hour. The orange figure turns the corner onto a block of modest standalone homes walking slower and looks around carefully as he moves. He turns into a driveway of one of the homes stops and pulls a wad of mail out of the mailbox. David stands with the hood of his security coat covering his head and face standing in the shadows and watching silently as the man in the orange uniform looks over his massive shoulder before turning a knob and entering the white paneled house through a familiar side door with a screen on it."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Even at the late hour there is heavy traffic throughout the station. David's eyes dart up as the slickhaired man turns the corner at the information booth and he watches him for a beat. David watches the teenager with baggy jeans hanging off his hip as he walks and greets a group of identically dressed friends. David turns his hands back in and seems shaken. He takes a couple of deep breaths as he gathers himself then steps back to look around. He bumps the shoulder of a man standing behind him taking a sudden breath like someone punched him in the solar plexus. The enormous glassyeyed man takes hold of the screen door handle and turns it as the man inside the house grabs the door handle on the inside to stop him. The man inside the house uses all his strength to keep the door from opening but it opens slowly anyway. David stands frozen in the train station his face almost unreadable standing less than a foot away from the man he bumped and they are shoulder to shoulder. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. David's eyes slowly move from the ground over his right and then finally onto the man who is huge at least three inches taller than David with massive shoulders and wearing a onepiece orange uniform. The man in the orange uniform leans over a trashcan next to him and removes the full trash bag within it replaces it with a fresh one throws the full trash bag into a gray plastic bin with wheels and starts pushing it. Four identical gray bins sit outside the door and the huge man disappears with his bin inside. David waits staring hard at the double doors and then they open as the huge glassyeyed man in orange emerges carrying a bag over his shoulder now wearing a baseball hat with his uniform. He heads toward a back exit and David let us him get about twenty feet away before deciding to follow him. The man in the orange uniform walks in the driving rain down a residential city block. almost all the lights in the middleclass homes he is passing are off at this late hour. The orange figure turns the corner onto a block of modest standalone homes walking slower and looks around carefully as he moves. He turns into a driveway of one of the homes stops and pulls a wad of mail out of the mailbox. David stands with the hood of his security coat covering his head and face standing in the shadows and watching silently as the man in the orange uniform looks over his massive shoulder before turning a knob and entering the white paneled house through a familiar side door with a screen on it."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Even at the late hour there is heavy traffic throughout the station. David's eyes dart up as the slickhaired man turns the corner at the information booth and he watches him for a beat. David watches the teenager with baggy jeans hanging off his hip as he walks and greets a group of identically dressed friends. David turns his hands back in and seems shaken. He takes a couple of deep breaths as he gathers himself then steps back to look around. The man in the orange uniform walks in the driving rain down a residential city block. almost all the lights in the middleclass homes he is passing are off at this late hour. The orange figure turns the corner onto a block of modest standalone homes walking slower and looks around carefully as he moves. He turns into a driveway of one of the homes stops and pulls a wad of mail out of the mailbox. David stands with the hood of his security coat covering his head and face standing in the shadows and watching silently as the man in the orange uniform looks over his massive shoulder before turning a knob and entering the white paneled house through a familiar side door with a screen on it."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Even at the late hour there is heavy traffic throughout the station. David's eyes dart up as the slickhaired man turns the corner at the information booth and he watches him for a beat. He turns into a driveway of one of the homes stops and pulls a wad of mail out of the mailbox. David stands with the hood of his security coat covering his head and face standing in the shadows and watching silently as the man in the orange uniform looks over his massive shoulder before turning a knob and entering the white paneled house through a familiar side door with a screen on it."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Even at the early dawn, there is light breeze throughout the field. The elephant's trunk rises as the curly-tailed cat slides past the lemonade stand, and it follows the cat for a moment. The elephant observes the child with floppy boots dragging by their knees as they skip and whisper to a clowder of similarly adorned kittens. The elephant spins its ears inward and seems confused. It takes a couple of shallow gulps as it steadies itself, then rolls forward to survey the area. It brushes the wing of a bird perched beside it, gasping suddenly like someone splashed ice water on its head. The diminutive beady-eyed squirrel clutches the fence post cleat and pulls it as the lizard up the tree clutches the post from the top to hold it steady. The lizard up the tree exerts all its might to steady the post, yet it wobbles loosely anyway. The elephant stands stiff in the forest glade, its expression nearly inscrutable, standing less than a handspan from the bird it nudged, and they are beak to beak. The elephant's gaze drifts from the pebbles to its left and then finally meets the bird, which is gargantuan, at least a claw length taller than the elephant, with wide wings and wearing a flowing red cape. The bird in the red cape leans over a picnic basket beside it and extracts the hefty picnic blanket from it, replaces it with a pristine one, drops the hefty picnic blanket into a blue metal container with legs, and begins rolling it. Four matching blue containers rest beside the fence, and the gargantuan bird vanishes with its container into the meadow. The elephant waits, glaring fiercely at the wooden gate, and then it swings open as the enormous beady-eyed squirrel in red appears carrying a loaf atop its back, now wearing a sunhat with its cloak. It ambles toward a hidden path, and the elephant trails at a distance of about seven strides before choosing to pursue it. The bird in the red cape flies into the clear sky above a rural mountain road, nearly all the windows in the upscale cabins it's traversing past are closed at this early dawn. The red entity glides over a string of humble single-story cottages, fluttering slower, and glances about anxiously as it proceeds. It swoops onto the porch of one of the cottages, pauses, and extracts a bouquet of blossoms from the flowerpot. The elephant waits with the hem of its raincoat obscuring its trunk and eyes, blending into the undergrowth and observing quietly as the bird in the red cape glances around with its broad beak before lifting a latch and entering the blue shingled cabin through a recognizable side window with drapes over it."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Even late at night, the station is bustling with traffic. David is on edge, observing a teenager in baggy jeans and then bumping into a huge man in an orange uniform. This man handles trash bins and disappears briefly through a door. David watches him emerge with a bag and a baseball hat, then follows him discreetly. The man walks through the rain, down a dark residential street of middle-class homes, eventually turning into a driveway. He retrieves mail from the mailbox and enters a white-paneled house through a side door. David remains hidden, hooded, watching the man closely."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "David stands with the hood of his security coat covering his head and face standing in the shadows and watching silently as the man in the orange uniform looks over his massive shoulder before turning a knob and entering the white paneled house through a familiar side door with a screen on it He turns into a driveway of one of the homes stops and pulls a wad of mail out of the mailbox The orange figure turns the corner onto a block of modest standalone homes walking slower and looks around carefully as he moves almost all the lights in the middleclass homes he is passing are off at this late hour The man in the orange uniform walks in the driving rain down a residential city block He heads toward a back exit and David let us him get about twenty feet away before deciding to follow him David waits staring hard at the double doors and then they open as the huge glassyeyed man in orange emerges carrying a bag over his shoulder now wearing a baseball hat with his uniform Four identical gray bins sit outside the door and the huge man disappears with his bin inside The man in the orange uniform leans over a trashcan next to him and removes the full trash bag within it replaces it with a fresh one throws the full trash bag into a gray plastic bin with wheels and starts pushing it David's eyes slowly move from the ground over his right and then finally onto the man who is huge at least three inches taller than David with massive shoulders and wearing a onepiece orange uniform David stands frozen in the train station his face almost unreadable standing less than a foot away from the man he bumped and they are shoulder to shoulder The man inside the house uses all his strength to keep the door from opening but it opens slowly anyway The enormous glassyeyed man takes hold of the screen door handle and turns it as the man inside the house grabs the door handle on the inside to stop him He bumps the shoulder of a man standing behind him taking a sudden breath like someone punched him in the solar plexus He takes a couple of deep breaths as he gathers himself then steps back to look around David turns his hands back in and seems shaken David watches the teenager with baggy jeans hanging off his hip as he walks and greets a group of identically dressed friends David's eyes dart up as the slickhaired man turns the corner at the information booth and he watches him for a beat Even at the late hour there is heavy traffic throughout the station"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "David's eyes dart up as the slickhaired man turns the corner at the information booth and he watches him for a beat Even at the late hour there is heavy traffic throughout the station David turns his hands back in and seems shaken David watches the teenager with baggy jeans hanging off his hip as he walks and greets a group of identically dressed friends He bumps the shoulder of a man standing behind him taking a sudden breath like someone punched him in the solar plexus He takes a couple of deep breaths as he gathers himself then steps back to look around The man inside the house uses all his strength to keep the door from opening but it opens slowly anyway The enormous glassyeyed man takes hold of the screen door handle and turns it as the man inside the house grabs the door handle on the inside to stop him David's eyes slowly move from the ground over his right and then finally onto the man who is huge at least three inches taller than David with massive shoulders and wearing a onepiece orange uniform David stands frozen in the train station his face almost unreadable standing less than a foot away from the man he bumped and they are shoulder to shoulder Four identical gray bins sit outside the door and the huge man disappears with his bin inside The man in the orange uniform leans over a trashcan next to him and removes the full trash bag within it replaces it with a fresh one throws the full trash bag into a gray plastic bin with wheels and starts pushing it He heads toward a back exit and David let us him get about twenty feet away before deciding to follow him David waits staring hard at the double doors and then they open as the huge glassyeyed man in orange emerges carrying a bag over his shoulder now wearing a baseball hat with his uniform almost all the lights in the middleclass homes he is passing are off at this late hour The man in the orange uniform walks in the driving rain down a residential city block He turns into a driveway of one of the homes stops and pulls a wad of mail out of the mailbox The orange figure turns the corner onto a block of modest standalone homes walking slower and looks around carefully as he moves David stands with the hood of his security coat covering his head and face standing in the shadows and watching silently as the man in the orange uniform looks over his massive shoulder before turning a knob and entering the white paneled house through a familiar side door with a screen on it"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The man in the orange uniform leans over a trashcan next to him and removes the full trash bag within it replaces it with a fresh one throws the full trash bag into a gray plastic bin with wheels and starts pushing it Four identical gray bins sit outside the door and the huge man disappears with his bin inside David waits staring hard at the double doors and then they open as the huge glassyeyed man in orange emerges carrying a bag over his shoulder now wearing a baseball hat with his uniform He heads toward a back exit and David let us him get about twenty feet away before deciding to follow him The man in the orange uniform walks in the driving rain down a residential city block almost all the lights in the middleclass homes he is passing are off at this late hour The orange figure turns the corner onto a block of modest standalone homes walking slower and looks around carefully as he moves He turns into a driveway of one of the homes stops and pulls a wad of mail out of the mailbox David stands with the hood of his security coat covering his head and face standing in the shadows and watching silently as the man in the orange uniform looks over his massive shoulder before turning a knob and entering the white paneled house through a familiar side door with a screen on it Even at the late hour there is heavy traffic throughout the station David's eyes dart up as the slickhaired man turns the corner at the information booth and he watches him for a beat David watches the teenager with baggy jeans hanging off his hip as he walks and greets a group of identically dressed friends David turns his hands back in and seems shaken He takes a couple of deep breaths as he gathers himself then steps back to look around He bumps the shoulder of a man standing behind him taking a sudden breath like someone punched him in the solar plexus The enormous glassyeyed man takes hold of the screen door handle and turns it as the man inside the house grabs the door handle on the inside to stop him The man inside the house uses all his strength to keep the door from opening but it opens slowly anyway David stands frozen in the train station his face almost unreadable standing less than a foot away from the man he bumped and they are shoulder to shoulder David's eyes slowly move from the ground over his right and then finally onto the man who is huge at least three inches taller than David with massive shoulders and wearing a onepiece orange uniform"
        }
      ]
    }
  ]
}