{
  "ground_truth": "Santa pushes him off his lap and shoves him on his way. The Elf nods as he peels off a pointed prosthetic ear. Santa pulls a fifth of Old Grandad from the cushions of his throne and takes a swig. With the sound of closing circuits, banks of lights systematically shut down in the various departments of the now empty store. Downstairs, the last of the store employees file out the door past an old Security Guard. Eventually, Santa emerges, and the Security Guard heads for a panel near the doorway and punches a key labeled ARM. The guard exits the store, locks the door, and heads home. Suddenly, a teddy bear moves, bolting upright and sprinting from the room. The alarm continues to count down -- 15. The teddy bear slides down the space between the railing of the escalators and scrambles for the door, crashing into everything in its path. Running past a clothing display, it rips the arm off a mannequin without breaking stride. It skids to a stop at the base of the alarm box, too short to reach the controls. Mission accomplished, the teddy bear rips off its head to reveal its true identity: Santa's Elf -- in civilian life known as Marcus Skidmore. He is covered in sweat and panting like an asthmatic. A hasp flips open, and Marcus swings the door wide to reveal a beer-guzzling Santa-in-the-off-season known as Willie T. Soke. Willie finishes the beer, crushes the can, and drops it to his feet next to eight more empties. Marcus sneers at him as he lumbers past. Marcus reaches into jewelry cases and removes a few particular items, drops them into a stock cart, then checks a typed list before moving on. Marcus pushes the cart through the store, gathering an odd array of items that range from furs to gowns to shoes to makeup. Marcus arrives outside a doorway and looks in to see Willie manning a large water drill and putting it to work on the store's vault. Marcus moves closer as Willie pulls back the drill on the track, places a screwdriver into the exposed lock assembly, and hits it with a sledgehammer. Suddenly, the door swings open, and bundled cash spills to the floor. Both men are impressed. Willie settles on the rear bench as Marcus gets into the passenger seat next to his Pilipino mail-order wife of several years, Lois, who is dressed in expensively ugly clothes and whose mouth is ever down-turned in pruney distaste. The van speeds away through the Christmas Eve night and disappears into the distance, like the down of a thistle. Finally, an alarm clock rings with a jolt, and Willie, in bed, blearily wakes to the insistent alarm.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Santa pushes him off his lap and shoves him on his way. The Elf nods as he peels off a pointed prosthetic ear. Santa pulls a fifth of Old Grandad from the cushions of his throne and takes a swig. With the sound of closing circuits, banks of lights systematically shut down in the various departments of the now empty store. Downstairs, the last of the store employees file out the door past an old Security Guard. Eventually, Santa emerges, and the Security Guard heads for a panel near the doorway and punches a key labeled ARM. The guard exits the store, locks the door, and heads home. Suddenly, a teddy bear moves, bolting upright and sprinting from the room. The alarm continues to count down -- 15. The teddy bear slides down the space between the railing of the escalators and scrambles for the door, crashing into everything in its path. Running past a clothing display, it rips the arm off a mannequin without breaking stride. It skids to a stop at the base of the alarm box, too short to reach the controls. Mission accomplished, the teddy bear rips off its head to reveal its true identity: Santa's Elf -- in civilian life known as Marcus Skidmore. He is covered in sweat and panting like an asthmatic. A hasp flips open, and Marcus swings the door wide to reveal a beer-guzzling Santa-in-the-off-season known as Willie T. Soke. Willie finishes the beer, crushes the can, and drops it to his feet next to eight more empties. Marcus sneers at him as he lumbers past. Marcus reaches into jewelry cases and removes a few particular items, drops them into a stock cart, then checks a typed list before moving on. Marcus pushes the cart through the store, gathering an odd array of items that range from furs to gowns to shoes to makeup. Marcus arrives outside a doorway and looks in to see Willie manning a large water drill and putting it to work on the store's vault. Marcus moves closer as Willie pulls back the drill on the track, places a screwdriver into the exposed lock assembly, and hits it with a sledgehammer. Suddenly, the door swings open, and bundled cash spills to the floor. Both men are impressed. Willie settles on the rear bench as Marcus gets into the passenger seat next to his Pilipino mail-order wife of several years, Lois, who is dressed in expensively ugly clothes and whose mouth is ever down-turned in pruney distaste. The van speeds away through the Christmas Eve night and disappears into the distance, like the down of a thistle. Finally, an alarm clock rings with a jolt, and Willie, in bed, blearily wakes to the insistent alarm."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Him was pushed off Santa's lap and shoved on his way. As the Elf nods, a pointed prosthetic ear is peeled off by him. A fifth of Old Grandad was pulled from the cushions of Santa's throne, and a swig is taken by him. With the sound of closing circuits, lights are systematically shut down in banks in the various departments of the now empty store. Downstairs, the last of the store employees files out the door, passing an old Security Guard. Eventually, the store is emerged from by Santa, and a panel near the doorway is headed for by the Security Guard, who punches a key labeled ARM. The store is exited by the guard, who locks the door and heads home. Suddenly, a teddy bear is moved, bolts upright, and sprints from the room. The alarm counts down -- 15. The space between the railing of the escalators is slid down by the teddy bear, which scrambles for the door, crashing into everything in its path. Past a clothing display it runs, the arm of a mannequin being ripped off by it without breaking stride. At the base of the alarm box, it skids to a stop, too short to reach the controls. Mission accomplished, the head of the teddy bear is ripped off to reveal its true identity: Santa's Elf -- known as Marcus Skidmore in civilian life. Sweat covers him, and panting like an asthmatic is he. A hasp was flipped open, and the door was swung wide by Marcus to reveal Santa-in-the-off-season, known as Willie T. Soke, guzzling beer. The beer is finished by Willie, who crushes the can and drops it to his feet next to eight more empties. As Marcus sneers at him, lumbering past is he. Into jewelry cases, Marcus reaches and removes a few particular items, dropping them into a stock cart, then a typed list is checked by him before moving on. Through the store, the cart is pushed by Marcus, gathering an odd array of items that range from furs to gowns to shoes to makeup. Outside a doorway, Marcus arrives and looks in to see Willie manning a large water drill and putting it to work on the store's vault. Closer Marcus moves as the drill is pulled back by Willie on the track, a screwdriver is placed into the exposed lock assembly, and with a sledgehammer, it is hit by him. Suddenly, the door is swung open, and bundled cash spills to the floor. Both men impress themselves. On the rear bench, Willie settles as the passenger seat is gotten into by Marcus next to his Pilipino mail-order wife of several years, Lois, who wears expensively ugly clothes and whose mouth is ever down-turned in pruney distaste. Through the Christmas Eve night, the van speeds away and disappears into the distance, like the down of a thistle. Finally, an alarm clock is rung with a jolt, and to the insistent alarm, Willie blearily wakes in bed."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Santa pushes him off his lap and sends him on his way. The Elf nods, removing a pointed prosthetic ear. Santa retrieves a bottle of Old Grandad from his throne's cushions and drinks. As circuits close, lights shut down in the now-empty store. Downstairs, the last employees exit past an old Security Guard. Santa eventually appears, and the Guard activates the alarm system, locks the door, and leaves. Suddenly, a teddy bear moves, sprints from the room, and slides down the escalator railing, crashing into everything. It stops at the alarm box, too short to reach the controls. Mission accomplished, the teddy bear removes its head, revealing Santa's Elf, Marcus Skidmore, sweating and panting. Marcus opens a door to reveal Willie T. Soke, a beer-drinking Santa-in-the-off-season. Willie finishes his beer, drops it among eight empties, and Marcus sneers as he passes. Marcus collects items from jewelry cases, checks a list, and pushes a cart through the store, gathering furs, gowns, shoes, and makeup. He finds Willie using a water drill on the store's vault. Willie uses a screwdriver and sledgehammer to open the door, spilling cash. Both are impressed. Willie sits on the rear bench as Marcus joins his Pilipino mail-order wife, Lois, in the passenger seat. The van speeds away into the Christmas Eve night. Finally, an alarm clock rings, and Willie wakes up groggily."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Santa pushes him off his lap, and the Elf nods, removing a prosthetic ear. Santa takes a swig from a bottle hidden in his throne. As lights shut down in the empty store, employees leave past a Security Guard. Santa exits, and the Guard arms the alarm, locks the door, and leaves. Suddenly, a teddy bear moves, sprinting for the door, crashing into displays, and ripping off a mannequin arm. It stops at the alarm box, revealing itself as Marcus Skidmore, Santa's Elf. Marcus opens a door to Willie T. Soke, a beer-drinking Santa. Marcus sneers, collects items from jewelry cases, and pushes a cart through the store, gathering various goods. He finds Willie drilling the store's vault, and they open it, spilling cash. Willie sits in the van as Marcus joins his wife, Lois, and they drive away on Christmas Eve. An alarm clock rings, waking Willie."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Santa, with a dismissive gesture, pushes him off his lap and unceremoniously shoves him on his way. The Elf, acknowledging the situation, nods as he carefully peels off a pointed prosthetic ear, revealing his true self. Meanwhile, Santa, with a casual air, retrieves a bottle of Old Grandad from the depths of the cushions on his throne and takes a hearty swig. As the sound of closing circuits echoes through the store, banks of lights systematically shut down in the various departments of the now deserted store. Downstairs, the last of the store employees make their way out the door, passing by an old Security Guard who stands watch. Eventually, Santa makes his appearance, and the Security Guard heads over to a panel near the doorway, where he punches a key labeled ARM. The guard then exits the store, locks the door securely, and heads home for the night. \n\nSuddenly, a teddy bear, seemingly inanimate, springs to life, bolting upright and sprinting from the room with surprising agility. The alarm continues its relentless countdown -- 15. The teddy bear slides down the narrow space between the railing of the escalators and scrambles frantically for the door, crashing into everything in its path with reckless abandon. As it races past a clothing display, it rips the arm off a mannequin without even breaking stride. It skids to a halt at the base of the alarm box, only to find itself too short to reach the controls. Mission accomplished, the teddy bear dramatically rips off its head to reveal its true identity: Santa's Elf, known in civilian life as Marcus Skidmore. He is drenched in sweat and panting heavily, like an asthmatic struggling for breath. A hasp flips open, and Marcus swings the door wide to reveal a beer-guzzling Santa-in-the-off-season, known as Willie T. Soke. Willie finishes his beer with a flourish, crushes the can with a practiced hand, and drops it to his feet, where it joins a collection of eight more empties. Marcus sneers at him with disdain as he lumbers past.\n\nMarcus reaches into the jewelry cases, carefully selecting a few particular items, which he drops into a stock cart. He then checks a typed list before moving on with his task. Marcus pushes the cart through the store, methodically gathering an odd array of items that range from luxurious furs to elegant gowns, stylish shoes, and an assortment of makeup. Marcus arrives outside a doorway and peers in to see Willie manning a large water drill, putting it to work on the store's vault with determination. Marcus moves closer as Willie expertly pulls back the drill on the track, places a screwdriver into the exposed lock assembly, and strikes it with a sledgehammer. Suddenly, the door swings open, and bundled cash spills to the floor in a satisfying cascade. Both men are visibly impressed by their success.\n\nWillie settles comfortably on the rear bench as Marcus climbs into the passenger seat next to his Pilipino mail-order wife of several years, Lois, who is dressed in expensively ugly clothes and whose mouth is perpetually down-turned in pruney distaste. The van speeds away through the Christmas Eve night, disappearing into the distance like the down of a thistle carried by the wind. Finally, an alarm clock rings with a jolt, and Willie, in bed, blearily wakes to the insistent sound of the alarm, signaling the start of a new day."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a dismissive wave of his hand, Santa abruptly pushes the visitor off his lap and nonchalantly propels him forward. Acknowledging the turn of events, the Elf gives a knowing nod as he meticulously removes a pointed prosthetic ear, revealing the truth beneath the façade. Meanwhile, Santa, exuding an air of casual indifference, retrieves a bottle of Old Grandad from the hidden depths of the cushions on his throne and indulges in a robust swig. As the sound of circuits closing echoes hauntingly through the store, the banks of lights in the various departments systematically shut down, signaling the end of the day in the now deserted store. Downstairs, the last of the store’s employees make their way out the door, passing by an elderly Security Guard who vigilantly stands watch. In due course, Santa makes his appearance known, prompting the Security Guard to approach a panel near the entrance, where he firmly presses a key labeled ARM. With his duty complete, the guard exits the store, locks the door securely behind him, and heads home for the night.\n\nIn an unexpected turn of events, a teddy bear, seemingly lifeless just moments ago, springs to life with remarkable agility, bolting upright and sprinting out of the room. The relentless countdown of the alarm continues—15. The teddy bear deftly slides down the narrow space between the escalator’s railing, scrambling desperately towards the door, crashing into various obstacles with reckless abandon along the way. As it races past a clothing display, it tears the arm off a mannequin without breaking its rapid stride. Coming to a screeching halt at the base of the alarm box, it realizes with dismay that it is too short to reach the controls. Mission momentarily paused, the teddy bear dramatically rips off its head to reveal its true identity: Santa's Elf, known in the mundane world as Marcus Skidmore. He stands there, drenched in sweat and panting heavily, like someone struggling for breath in the grips of an asthma attack. A hasp flips open, and Marcus swings the door wide, revealing a beer-guzzling Santa-in-the-off-season, Willie T. Soke. Willie concludes his beer with a flourish, crushing the can with practiced ease and letting it fall to his feet, where it joins a collection of eight more empties. Marcus sneers at him with a look of disdain as he stumbles past.\n\nReaching into the jewelry cases, Marcus carefully selects a few choice items, which he nonchalantly drops into a stock cart. He then diligently checks a typed list before moving on to the next phase of his task. With steady determination, Marcus pushes the cart through the store, methodically gathering an odd assortment of items that range from luxurious furs to elegant gowns, stylish shoes, and a varied selection of makeup. Arriving outside a doorway, Marcus peers in to witness Willie manning a large water drill, applying it with fierce determination to the store's vault. Drawing closer, Marcus observes as Willie expertly pulls back the drill on its track, inserts a screwdriver into the exposed lock assembly, and strikes it with a heavy sledgehammer. Abruptly, the vault door swings open, and bundles of cash spill to the floor in a satisfying cascade, leaving both men visibly awed by their triumph.\n\nWillie settles into the comfort of the rear bench as Marcus climbs into the passenger seat beside his wife, Lois, a Filipino mail-order bride of several years. She is adorned in expensively garish clothes, her mouth perpetually turned down in a pruny grimace of distaste. The van speeds away into the night of Christmas Eve, vanishing into the distance like the down of a thistle carried by the wind. Eventually, an alarm clock rings with an insistent jolt, and Willie, warmly ensconced in bed, groggily awakens to the persistent ringing, signaling the start of yet another day."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Santa, with a firm push, propels the person off his lap and gives him a forceful nudge to send him on his way. The Elf, acknowledging the situation, gives a nod while carefully removing a pointed prosthetic ear from his head. Meanwhile, Santa reaches into the cushions of his throne, retrieving a bottle of Old Grandad whiskey, and takes a hearty swig. As the store begins to close, the sound of circuits shutting down fills the air, and banks of lights systematically turn off in various departments, leaving the store empty. Downstairs, the last of the store employees make their way out, passing by an old Security Guard stationed at the door. Eventually, Santa makes his appearance, prompting the Security Guard to approach a panel near the doorway and press a key labeled ARM. With the store now secured, the guard exits, locks the door behind him, and heads home. Suddenly, a teddy bear, previously still, springs to life, sitting bolt upright before sprinting out of the room. The alarm continues its countdown, reaching 15. The teddy bear deftly slides down the space between the escalator railings, scrambling towards the door and colliding with everything in its path. As it races past a clothing display, it snatches the arm off a mannequin without pausing. It skids to a halt at the base of the alarm box, only to find itself too short to reach the controls. With its mission accomplished, the teddy bear removes its head, revealing its true identity: Santa's Elf, known in civilian life as Marcus Skidmore. Marcus, drenched in sweat and panting heavily, flips open a hasp and swings the door wide open to reveal Willie T. Soke, a beer-guzzling Santa-in-the-off-season. Willie finishes his beer, crushes the can, and lets it fall to the floor, joining eight other empty cans. Marcus sneers at Willie as he lumbers past him. Marcus then reaches into the jewelry cases, carefully selecting a few specific items, which he drops into a stock cart. He checks a typed list to ensure accuracy before moving on. Pushing the cart through the store, Marcus gathers an eclectic assortment of items, including furs, gowns, shoes, and makeup. He arrives outside a doorway and peers in to see Willie operating a large water drill, which he uses on the store's vault. Marcus moves closer as Willie retracts the drill on its track, inserts a screwdriver into the exposed lock assembly, and strikes it with a sledgehammer. Suddenly, the vault door swings open, and bundles of cash spill onto the floor, impressing both men. Willie settles onto the rear bench as Marcus climbs into the passenger seat next to his Filipino mail-order wife of several years, Lois, who is dressed in expensively ugly clothes and whose mouth is perpetually down-turned in pruney distaste. The van speeds away into the Christmas Eve night, disappearing into the distance like the down of a thistle. Finally, an alarm clock rings with a jolt, and Willie, lying in bed, groggily awakens to the persistent sound of the alarm."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Santa dismisses the child from his lap, and the Elf discreetly removes a prosthetic ear. Santa retrieves a bottle of Old Grandad from his throne's cushions and takes a drink. As the store's lights systematically shut down, the last employees exit past an old Security Guard. Santa eventually leaves, prompting the Guard to arm the security system before locking up and heading home. Suddenly, a teddy bear springs to life, racing through the store as the alarm counts down. It navigates obstacles, tearing off a mannequin's arm, and stops at the alarm box, unable to reach it. The teddy bear reveals itself as Marcus Skidmore, Santa's Elf, who is exhausted and sweating. Marcus opens a door to reveal Willie T. Soke, a beer-drinking Santa in the off-season. Willie finishes his beer and discards the can among several others. Marcus sneers and proceeds to collect specific items from jewelry cases, checking a list as he fills a stock cart with various goods. He joins Willie, who is using a water drill on the store's vault. Willie expertly opens the vault, spilling cash onto the floor, impressing both men. They leave in a van, with Marcus sitting next to his wife, Lois, as they drive away into the Christmas Eve night. Finally, an alarm clock rings, waking Willie from sleep."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Santa, often depicted in folklore as a jolly gift-giver, pushes him off his lap and shoves him on his way. The Elf, part of Santa's North Pole team in popular culture, nods as he peels off a pointed prosthetic ear, indicating a break from his usual role. Santa pulls a fifth of Old Grandad, a classic bourbon known for its high proof and distinctive taste, from the cushions of his throne and takes a swig. With the sound of closing circuits, banks of lights systematically shut down in the various departments of the now empty store, reminiscent of the massive department stores that dominate city centers. Downstairs, the last of the store employees file out the door past an old Security Guard, a figure emblematic of the night watchmen who ensure store security. Eventually, Santa emerges, and the Security Guard heads for a panel near the doorway and punches a key labeled ARM, setting the store's security system. The guard exits the store, locks the door, and heads home, a routine practiced by countless night guards. Suddenly, a teddy bear, reminiscent of the classic children's toy, moves, bolting upright and sprinting from the room. The alarm continues to count down -- 15, marking the final seconds before a security breach alert. The teddy bear slides down the space between the railing of the escalators, a staple feature of multi-level retail spaces, and scrambles for the door, crashing into everything in its path. Running past a clothing display, it rips the arm off a mannequin, a visual merchandising standard, without breaking stride. It skids to a stop at the base of the alarm box, too short to reach the controls. Mission accomplished, the teddy bear rips off its head to reveal its true identity: Santa's Elf -- in civilian life, the clever and elusive Marcus Skidmore. He is covered in sweat and panting like an asthmatic, struggling for breath due to exertion. A hasp flips open, and Marcus swings the door wide to reveal a beer-guzzling Santa-in-the-off-season known as Willie T. Soke, a notorious character from a fictional gritty holiday tale. Willie finishes the beer, crushes the can, and drops it to his feet next to eight more empties, evidence of his habitual drinking problem. Marcus sneers at him as he lumbers past. Marcus reaches into jewelry cases, akin to those found in luxury departments, and removes a few particular items, drops them into a stock cart, then checks a typed list before moving on. Marcus pushes the cart through the store, gathering an odd array of items that range from furs to gowns to shoes to makeup, items often highlighted in holiday shopping sprees. Marcus arrives outside a doorway and looks in to see Willie manning a large water drill and putting it to work on the store's vault, a heavy-duty tool used for burglary attempts. Marcus moves closer as Willie pulls back the drill on the track, places a screwdriver into the exposed lock assembly, and hits it with a sledgehammer, a brute force method for opening secured spaces. Suddenly, the door swings open, and bundled cash spills to the floor, akin to a heist movie climax. Both men are impressed. Willie settles on the rear bench as Marcus gets into the passenger seat next to his Pilipino mail-order wife of several years, Lois, who is dressed in expensively ugly clothes, a caricature of gaudy taste, and whose mouth is ever down-turned in pruney distaste, revealing her constant disapproval. The van speeds away through the Christmas Eve night, the evening known for its festive and magical atmosphere, and disappears into the distance, like the down of a thistle, suggesting a quiet and swift departure. Finally, an alarm clock rings with a jolt, and Willie, in bed, blearily wakes to the insistent alarm, marking the start of another day filled with questionable adventures."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Santa pushes him off his lap and shoves him on his way  The Elf nods as he peels off a pointed prosthetic ear  Santa pulls a fifth of Old Grandad from the cushions of his throne and takes a swig  Running past a clothing display it rips the arm off a mannequin without breaking stride  It skids to a stop at the base of the alarm box too short to reach the controls  Mission accomplished  the teddy bear rips off its head to reveal its true identity  Santa's Elf  in civilian life known as Marcus Skidmore  He is covered in sweat and panting like an asthmatic  A hasp flips open and Marcus swings the door wide to reveal a beerguzzling Santaintheoffseason known as Willie T Soke  Willie finishes the beer crushes the can and drops it to his feet next to eight more empties  Marcus sneers at him as he lumbers past  Marcus reaches into jewelry cases and removes a few particular items drops them into a stock cart then checks a typed list before moving on  Marcus pushes the cart through the store gathering an odd array of items that range from furs to gowns to shoes to makeup  Marcus arrives outside a doorway and looks in to see Willie manning a large water drill and putting it to work on the store's vault  Marcus moves closer as Willie pulls back the drill on the track places a screwdriver into the exposed lock assembly and hits it with a sledgehammer  Suddenly the door swings open and bundled cash spills to the floor  With the sound of closing circuits banks of lights systematically shut down in the various departments of the now empty store  Downstairs the last of the store employees file out the door past an old Security Guard  Eventually Santa emerges and the Security Guard heads for a panel near the doorway and punches a key labeled ARM  The guard exits the store locks the door and heads home  Suddenly a teddy bear moves bolting upright and sprinting from the room  The alarm continues to count down  15  The teddy bear slides down the space between the railing of the escalators and scrambles for the door crashing into everything in its path  Running past a clothing display it rips the arm off a mannequin without breaking stride  It skids to a stop at the base of the alarm box too short to reach the controls  Mission accomplished  the teddy bear rips off its head to reveal its true identity  Santa's Elf  in civilian life known as Marcus Skidmore  He is covered in sweat and panting like an asthmatic  A hasp flips open and Marcus swings the door wide to reveal a beerguzzling Santaintheoffseason known as Willie T Soke  Willie finishes the beer crushes the can and drops it to his feet next to eight more empties  Marcus sneers at him as he lumbers past  Marcus reaches into jewelry cases and removes a few particular items drops them into a stock cart then checks a typed list before moving on  Marcus pushes the cart through the store gathering an odd array of items that range from furs to gowns to shoes to makeup  Marcus arrives outside a doorway and looks in to see Willie manning a large water drill and putting it to work on the store's vault  Marcus moves closer as Willie pulls back the drill on the track places a screwdriver into the exposed lock assembly and hits it with a sledgehammer  Suddenly the door swings open and bundled cash spills to the floor  Both men are impressed  Willie settles on the rear bench as Marcus gets into the passenger seat next to his Pilipino mailorder wife of several years Lois who is dressed in expensively ugly clothes and whose mouth is ever downturned in pruney distaste  The van speeds away through the Christmas Eve night and disappears into the distance like the down of a thistle  Finally an alarm clock rings with a jolt and Willie in bed blearily wakes to the insistent alarm"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Santa pushes him off his lap and shoves him on his way. The Elf nods as he peels off a pointed prosthetic ear. Santa pulls a fifth of Old Grandad from the cushions of his throne and takes a swig. With the sound of closing circuits banks of lights systematically shut down in the various departments of the now empty store. Downstairs the last of the store employees file out the door past an old Security Guard. Eventually Santa emerges and the Security Guard heads for a panel near the doorway and punches a key labeled ARM. The guard exits the store locks the door and heads home. Suddenly a teddy bear moves bolting upright and sprinting from the room. The alarm continues to count down  15. The teddy bear slides down the space between the railing of the escalators and scrambles for the door crashing into everything in its path. Running past a clothing display it rips the arm off a mannequin without breaking stride. It skids to a stop at the base of the alarm box too short to reach the controls. Mission accomplished. the teddy bear rips off its head to reveal its true identity. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Santa's Elf  in civilian life known as Marcus Skidmore. He is covered in sweat and panting like an asthmatic. A hasp flips open and Marcus swings the door wide to reveal a beerguzzling Santaintheoffseason known as Willie T Soke. Willie finishes the beer crushes the can and drops it to his feet next to eight more empties. Marcus sneers at him as he lumbers past. Marcus reaches into jewelry cases and removes a few particular items drops them into a stock cart then checks a typed list before moving on. Marcus pushes the cart through the store gathering an odd array of items that range from furs to gowns to shoes to makeup. Marcus arrives outside a doorway and looks in to see Willie manning a large water drill and putting it to work on the store's vault. Marcus moves closer as Willie pulls back the drill on the track places a screwdriver into the exposed lock assembly and hits it with a sledgehammer. Suddenly the door swings open and bundled cash spills to the floor. Both men are impressed. Willie settles on the rear bench as Marcus gets into the passenger seat next to his Pilipino mailorder wife of several years Lois who is dressed in expensively ugly clothes and whose mouth is ever downturned in pruney distaste. The van speeds away through the Christmas Eve night and disappears into the distance like the down of a thistle. Finally an alarm clock rings with a jolt and Willie in bed blearily wakes to the insistent alarm."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Santa pushes him off his lap and shoves him on his way. The Elf nods as he peels off a pointed prosthetic ear. Santa pulls a fifth of Old Grandad from the cushions of his throne and takes a swig. With the sound of closing circuits banks of lights systematically shut down in the various departments of the now empty store. Downstairs the last of the store employees file out the door past an old Security Guard. Eventually Santa emerges and the Security Guard heads for a panel near the doorway and punches a key labeled ARM. The guard exits the store locks the door and heads home. Suddenly a teddy bear moves bolting upright and sprinting from the room. The alarm continues to count down  15. The teddy bear slides down the space between the railing of the escalators and scrambles for the door crashing into everything in its path. Running past a clothing display it rips the arm off a mannequin without breaking stride. It skids to a stop at the base of the alarm box too short to reach the controls. Mission accomplished. the teddy bear rips off its head to reveal its true identity. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. Santa's Elf  in civilian life known as Marcus Skidmore. He is covered in sweat and panting like an asthmatic. A hasp flips open and Marcus swings the door wide to reveal a beerguzzling Santaintheoffseason known as Willie T Soke. Willie finishes the beer crushes the can and drops it to his feet next to eight more empties. Marcus sneers at him as he lumbers past. Marcus reaches into jewelry cases and removes a few particular items drops them into a stock cart then checks a typed list before moving on. Marcus pushes the cart through the store gathering an odd array of items that range from furs to gowns to shoes to makeup. Marcus arrives outside a doorway and looks in to see Willie manning a large water drill and putting it to work on the store's vault. Marcus moves closer as Willie pulls back the drill on the track places a screwdriver into the exposed lock assembly and hits it with a sledgehammer. Suddenly the door swings open and bundled cash spills to the floor. Both men are impressed. Willie settles on the rear bench as Marcus gets into the passenger seat next to his Pilipino mailorder wife of several years Lois who is dressed in expensively ugly clothes and whose mouth is ever downturned in pruney distaste. The van speeds away through the Christmas Eve night and disappears into the distance like the down of a thistle. Finally an alarm clock rings with a jolt and Willie in bed blearily wakes to the insistent alarm."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Santa pushes him off his lap and shoves him on his way. The Elf nods as he peels off a pointed prosthetic ear. Santa pulls a fifth of Old Grandad from the cushions of his throne and takes a swig. With the sound of closing circuits banks of lights systematically shut down in the various departments of the now empty store. Downstairs the last of the store employees file out the door past an old Security Guard. Eventually Santa emerges and the Security Guard heads for a panel near the doorway and punches a key labeled ARM. The guard exits the store locks the door and heads home. Marcus arrives outside a doorway and looks in to see Willie manning a large water drill and putting it to work on the store's vault. Marcus moves closer as Willie pulls back the drill on the track places a screwdriver into the exposed lock assembly and hits it with a sledgehammer. Suddenly the door swings open and bundled cash spills to the floor. Both men are impressed. Willie settles on the rear bench as Marcus gets into the passenger seat next to his Pilipino mailorder wife of several years Lois who is dressed in expensively ugly clothes and whose mouth is ever downturned in pruney distaste. The van speeds away through the Christmas Eve night and disappears into the distance like the down of a thistle. Finally an alarm clock rings with a jolt and Willie in bed blearily wakes to the insistent alarm."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Santa pushes him off his lap and shoves him on his way. The Elf nods as he peels off a pointed prosthetic ear. Santa pulls a fifth of Old Grandad from the cushions of his throne and takes a swig. Willie settles on the rear bench as Marcus gets into the passenger seat next to his Pilipino mailorder wife of several years Lois who is dressed in expensively ugly clothes and whose mouth is ever downturned in pruney distaste. The van speeds away through the Christmas Eve night and disappears into the distance like the down of a thistle. Finally an alarm clock rings with a jolt and Willie in bed blearily wakes to the insistent alarm."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The reindeer pushes him off its lap and shoves him on his way. The snowman nods as it peels off a pointed prosthetic ear. The reindeer pulls a fifth of Old Grandad from the cushions of its throne and takes a swig. With the sound of closing circuits, banks of lights systematically shut down in the various departments of the now empty store. Downstairs, the last of the store employees file out the door past an old Chef. Eventually, the reindeer emerges, and the Chef heads for a panel near the doorway and punches a key labeled ARM. The Chef exits the store, locks the door, and heads home. Suddenly, a robot moves, bolting upright and sprinting from the room. The alarm continues to count down -- 15. The robot slides down the space between the railing of the escalators and scrambles for the door, crashing into everything in its path. Running past a clothing display, it rips the arm off a mannequin without breaking stride. It skids to a stop at the base of the alarm box, too short to reach the controls. Mission accomplished, the robot rips off its head to reveal its true identity: the snowman's Elf -- in civilian life known as Marcus Skidmore. The snowman is covered in sweat and panting like an asthmatic. A hasp flips open, and Marcus swings the door wide to reveal a carrot-munching reindeer-in-the-off-season known as Willie T. Soke. Willie finishes the carrot, crushes the can, and drops it to his feet next to eight more empties. Marcus sneers at Willie as Willie lumbers past. Marcus reaches into jewelry cases and removes a few particular items, drops them into a stock cart, then checks a typed list before moving on. Marcus pushes the cart through the store, gathering an odd array of items that range from furs to gowns to shoes to makeup. Marcus arrives outside a doorway and looks in to see Willie manning a large water drill and putting it to work on the store's vault. Marcus moves closer as Willie pulls back the drill on the track, places a screwdriver into the exposed lock assembly, and hits it with a sledgehammer. Suddenly, the door swings open, and bundled cash spills to the floor. Both aliens are impressed. Willie settles on the rear bench as Marcus gets into the passenger seat next to his Pilipino mail-order wife of several years, Lois, who is dressed in expensively ugly clothes and whose mouth is ever down-turned in pruney distaste. The van speeds away through the Christmas Eve night and disappears into the distance, like the down of a thistle. Finally, an alarm clock rings with a jolt, and Willie, in bed, blearily wakes to the insistent alarm."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Santa pushes him off his lap and shoves him on his way. The Elf nods as he peels off a feathered cap. Santa pulls a bottle of apple cider from the cushions of his recliner and takes a swig. With the sound of closing shutters, rows of speakers systematically shut down in the various sections of the now empty warehouse. Downstairs, the last of the warehouse workers file out the door past an old Janitor. Eventually, Santa emerges, and the Janitor heads for a panel near the doorway and punches a key labeled SECURE. The janitor exits the warehouse, locks the door, and heads home. Suddenly, a rubber duck moves, bolting upright and sprinting from the room. The alarm continues to count down -- 15. The rubber duck slides down the space between the shelves of the escalators and scrambles for the door, crashing into everything in its path. Running past a tool display, it rips the handle off a hammer without breaking stride. It skids to a stop at the base of the alarm box, too short to reach the controls. Mission accomplished, the rubber duck rips off its head to reveal its true identity: Santa's Elf -- in civilian life known as Marcus Skidmore. He is covered in sweat and panting like an asthmatic. A latch flips open, and Marcus swings the door wide to reveal a soda-drinking Santa-in-the-off-season known as Willie T. Soke. Willie finishes the soda, crushes the can, and drops it to his feet next to eight more empties. Marcus sneers at him as he lumbers past. Marcus reaches into bookcases and removes a few particular items, drops them into a hand truck, then checks a typed list before moving on. Marcus pushes the cart through the warehouse, gathering an odd array of items that range from quilts to curtains to slippers to lotions. Marcus arrives outside a doorway and looks in to see Willie manning a large concrete mixer and putting it to work on the warehouse's vault. Marcus moves closer as Willie pulls back the mixer on the track, places a crowbar into the exposed lock assembly, and hits it with a mallet. Suddenly, the door swings open, and bundles of papers spill to the floor. Both men are impressed. Willie settles on the rear seat as Marcus gets into the passenger seat next to his Thai mail-order spouse of several years, Lois, who is dressed in expensively quirky clothes and whose mouth is ever down-turned in wrinkled distaste. The minivan speeds away through the New Year's Eve night and disappears into the distance, like the fluff of a dandelion. Finally, a kettle whistles with a jolt, and Willie, in bed, blearily wakes to the insistent sound."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Santa flips him off his lap and lifts him on his way. The Elf shrugs as he removes a pointed prosthetic ear. Santa retrieves a bottle of Old Grandad from the cushions of his throne and pours a swig. With the sound of popping circuits, banks of lights randomly flicker on in the various departments of the now silent store. Downstairs, the last of the store employees file through the door past an old Security Guard. Eventually, Santa reappears, and the Security Guard reaches for a panel near the doorway and taps a key labeled RESET. The guard steps outside, shuts the door, and strolls home. Suddenly, a teddy bear stirs, jumping upright and skipping from the room. The alarm continues to count down -- 15. The teddy bear glides down the space between the railing of the escalators and dances toward the door, colliding with everything in its path. Running past a clothing display, it grasps the hand of a mannequin without pausing. It slides to a halt at the base of the alarm box, too short to press the controls. Mission completed, the teddy bear pulls off its head to reveal its true identity: Santa's Elf -- in civilian life known as Marcus Skidmore. He is drenched in sweat and wheezing like an asthmatic. A latch clicks open, and Marcus swings the door wide to reveal a soda-drinking Santa-in-the-off-season known as Willie T. Soke. Willie finishes the soda, crumples the can, and tosses it to his feet next to eight more empties. Marcus glares at him as he strides past. Marcus reaches into jewelry cases and selects a few particular items, places them into a stock cart, then checks a typed list before continuing. Marcus pushes the cart through the store, selecting an unusual collection of items that range from hats to scarves to gloves to makeup. Marcus stops outside a doorway and glances in to see Willie operating a large paintbrush and applying it to the store's vault. Marcus steps closer as Willie withdraws the paintbrush on the track, inserts a wrench into the exposed lock assembly, and taps it with a hammer. Suddenly, the door swings open, and bundled cash cascades to the floor. Both men are astonished. Willie settles on the rear bench as Marcus climbs into the passenger seat next to his Pilipino mail-order wife of several years, Lois, who is dressed in expensively gaudy clothes and whose mouth is ever down-turned in pruney distaste. The van accelerates through the Christmas Eve night and vanishes into the horizon, like the drift of a snowflake. Finally, an alarm clock buzzes with a jolt, and Willie, in bed, sleepily wakes to the persistent alarm."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The reindeer pushes a duck off its wings and shoves the duck on its way. The Christmas tree nods as it peels off a pointed wooden branch. The reindeer pulls a bottle of apple juice from the cushions of its sleigh and takes a swig. With the sound of closing elevators, rows of chairs systematically shut down in the various libraries of the now empty playground. Downstairs, the last of the playground monkeys file out the door past an old Movie Director. Eventually, the reindeer emerges, and the Movie Director heads for a painting near the staircase and punches a button labeled PLAY. The director exits the playground, locks the gate, and heads home. Suddenly, a balloon moves, bolting upright and sprinting from the room. The alarm continues to count down -- 15. The balloon slides down the space between the railing of the staircases and scrambles for the gate, crashing into everything in its path. Running past a book display, it rips the cover off a magazine without breaking stride. It skids to a stop at the base of the alarm clock, too short to reach the buttons. Mission accomplished, the balloon rips off its surface to reveal its true identity: The Christmas tree -- in civilian life known as Oliver Sandstorm. It is covered in rain and panting like a tired cat. A latch flips open, and Oliver swings the gate wide to reveal a soda-slurping reindeer-in-the-spring known as Benny L. Pine. Benny finishes the soda, crushes the cup, and drops it to his feet next to eight more straw wrappers. Oliver sneers at him as he waddles past. Oliver reaches into cookie jars and removes a few particular candies, drops them into a grocery basket, then checks a typed recipe before moving on. Oliver pushes the basket through the playground, gathering an odd assortment of candies that range from chocolates to lollipops to gummies to mints. Oliver arrives outside a tent and looks in to see Benny manning a large cotton candy machine and putting it to work on the fair’s vault. Oliver moves closer as Benny pulls back the machine on the track, places a pencil into the exposed lock assembly, and hits it with a shovel. Suddenly, the tent swings open, and bundled popcorn spills to the floor. Both birds are impressed. Benny settles on the rear couch as Oliver gets into the passenger seat next to his Australian pen-pal brother of several years, Luna, who is dressed in fabulously colorful shoes and whose eyes are ever down-turned in sleepy fascination. The car speeds away through the New Year’s Eve morning and disappears into the mist, like the flight of a butterfly. Finally, a rooster crows with a jolt, and Benny, in bed, blearily wakes to the insistent crowing."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The Easter Bunny shoves him off its lap and nudges him on his way. The Goblin winks as he removes a fake claw. The Easter Bunny extracts a bottle of apple juice from the cushions of its throne and takes a sip. With the sound of closing shutters, walls of mirrors systematically reflect darkness in the various departments of the now empty gallery. Downstairs, the last of the gallery visitors stroll out the door past an ancient Art Critic. Eventually, the Easter Bunny emerges, and the Art Critic strolls to a panel near the doorway and presses a button labeled ACTIVATE. The critic exits the gallery, locks the door, and sets off home. Suddenly, a puppet jerks, leaping upright and dashing from the room. The alarm continues to tick down -- 15. The puppet slides down the gap between the railing of the escalators and races for the exit, colliding with everything in its path. Darting past a painting display, it snatches a hat off a sculpture without breaking stride. It skids to a halt at the base of the alarm box, too short to reach the controls. Objective achieved, the puppet pulls off its head to reveal its true identity: the Easter Bunny's Goblin -- in everyday life known as Oliver Nightshade. He is drenched in sweat and wheezing like a broken accordion. A latch swings open, and Oliver throws the door wide to reveal a soda-drinking Easter Bunny-in-the-off-season known as Tim J. Hopper. Tim finishes the soda, crushes the can, and drops it to the ground next to eight more empties. Oliver frowns at him as he strides past. Oliver reaches into display cases and selects a few specific items, tosses them into a supply cart, then glances at a printed list before proceeding. Oliver pushes the cart through the gallery, gathering an unusual assortment of items that range from paintings to sculptures to vases to canvas. Oliver arrives outside an entryway and glances in to see Tim handling a large paintbrush and putting it to work on the gallery's mural. Oliver steps closer as Tim pulls back the brush on the palette, places a chisel into the sculpture assembly, and taps it with a mallet. Suddenly, the entry swings open, and stacks of paintings topple to the floor. Both creatures are amazed. Tim settles on the rear bench as Oliver climbs into the passenger seat next to his Russian mail-order husband of several years, Alexei, who is dressed in garishly stylish clothes and whose mouth is ever down-turned in sour disdain. The vehicle speeds away through the Easter Eve night and vanishes into the distance, like the fluff of a dandelion. Finally, an alarm clock buzzes with a start, and Tim, in bed, groggily awakens to the persistent alarm."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Santa nudges him off his chair and redirects him on his journey. The Elf winks as he removes a striped mitten. Santa retrieves a bottle of soda from the cushions of his couch and takes a gulp. With the sound of opening blinds, rows of lights spontaneously illuminate in the different sections of the now bustling café. Downstairs, the last of the diners stroll past an ancient Bartender. Eventually, Santa appears, and the Bartender reaches for a lever near the entrance and taps a switch labeled LIGHT. The bartender leaves the café, closes the door, and heads to the market. Suddenly, a robot vacuum swivels, springing upward and dashing across the hallway. The timer continues to tick up -- 30. The robot vacuum glides along the edge between the elevator doors and scrambles for the exit, colliding with everything in its path. Moving past a furniture display, it snatches the hat off a lamp without pausing. It halts abruptly at the top of a stairwell, too short to reach the bottom. Task complete, the robot vacuum flips open to reveal its true identity: Santa's Elf -- known in daily life as Marcus Skidmore. He is drenched in sweat and gasping like a marathoner. A latch clicks shut, and Marcus swings the window open to reveal a soda-slurping Santa-in-the-off-season known as Willie T. Soke. Willie finishes the soda, crumples the cup, and drops it beside nine more empties. Marcus glowers at him as he trundles by. Marcus reaches into storage shelves and selects a few unique articles, places them into a delivery bag, then reviews a handwritten note before continuing. Marcus maneuvers the bag through the café, collecting an unusual assortment of goods that range from scarves to jackets to slippers to combs. Marcus stops outside a hallway and peers in to see Willie operating a massive air compressor and applying it to the café's safe. Marcus approaches as Willie retracts the compressor on the rail, inserts a corkscrew into the visible lock mechanism, and taps it with a mallet. Suddenly, the gate swings open, and stacks of documents flutter to the ground. Both men are pleased. Willie settles on the front bench as Marcus climbs into the driver’s seat next to his French mail-order husband of several years, Louis, who is dressed in extravagantly plain attire and whose expression is perpetually set in sour disdain. The van cruises away through the Christmas Eve dusk and vanishes into the horizon, like a dandelion seed on the breeze. Finally, a doorbell chimes with a start, and Willie, on the couch, groggily responds to the persistent doorbell."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The reindeer nudges her off its cloud and catapults her on her journey. The Gnome winks as it unfastens a twisted decorative antenna. The reindeer extracts a bottle of Root Beer from the depths of its chariot and gulps deeply. With the sound of fading echoes, strings of lanterns gradually flicker out in the various zones of the now silent zoo. Downstairs, the last of the zoo visitors wander out the gate past an ancient Tour Guide. Eventually, the reindeer surfaces, and the Tour Guide heads for a console near the gateway and taps a lever labeled START. The guide leaves the zoo, secures the gate, and ambles home. Abruptly, a penguin stirs, leaping vertically and dashing from the space. The timer continues to tick down -- 15. The penguin tumbles down the gap between the slats of the banisters and dashes for the entrance, colliding with everything in its trajectory. Passing a food display, it tears the wing off a scarecrow without halting pace. It screeches to a halt at the base of the timer, too tiny to reach the buttons. Task finished, the penguin unzips its covering to disclose its actual persona: the reindeer's Gnome -- in normalcy called Trevor Highwater. He is cloaked in mist and wheezing like a smoker. A clasp clicks open, and Trevor throws the entrance wide to reveal a soda-slurping reindeer-out-of-the-holidays known as Gerald Q. Breeze. Gerald completes the soda, squashes the can, and drops it to his hooves beside eight more discards. Trevor glares at him as he trudges onward. Trevor delves into trinket boxes and extracts a few unique objects, deposits them into a supply wagon, then reviews a scribbled inventory before proceeding. Trevor maneuvers the wagon through the zoo, collecting a bizarre collection of objects that span from wools to robes to sandals to face paint. Trevor arrives outside an archway and peers in to observe Gerald operating a massive juice churner and applying it to open the zoo's treasure chamber. Trevor advances closer as Gerald retracts the churner on the rail, inserts a chisel into the visible latch system, and strikes it with a mallet. Instantly, the entrance swings ajar, and bound jewels scatter to the ground. Both creatures are amazed. Gerald settles on the rear rack as Trevor climbs into the co-pilot's spot next to his Lithuanian pen-pal spouse of several years, Doris, who is clad in lavishly unattractive garments and whose expression is perpetually twisted in sour disapproval. The automobile races away through the winter's Eve and vanishes into the horizon, like the fluff of a dandelion. Finally, a cuckoo clock chimes with a start, and Gerald, in slumber, groggily stirs to the persistent chime."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Santa pushes an elf off his lap, and as the store closes, the elf removes his prosthetic ear. Santa drinks from a hidden bottle, and lights shut down. After everyone leaves, a teddy bear comes to life, dashing around to reach an alarm box, revealing itself as Marcus Skidmore, the elf. Meanwhile, the security guard arms the alarm and departs. Marcus opens a door to reveal a beer-drinking Santa, Willie T. Soke. Marcus gathers valuable items, while Willie drills into the store's vault, successfully opening it. They collect cash and flee in a van with Marcus's unhappy wife, Lois. Later, Willie wakes to an alarm clock."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Finally an alarm clock rings with a jolt and Willie in bed blearily wakes to the insistent alarm The van speeds away through the Christmas Eve night and disappears into the distance like the down of a thistle  Willie settles on the rear bench as Marcus gets into the passenger seat next to his Pilipino mailorder wife of several years Lois who is dressed in expensively ugly clothes and whose mouth is ever downturned in pruney distaste  Both men are impressed  Suddenly the door swings open and bundled cash spills to the floor  Marcus moves closer as Willie pulls back the drill on the track places a screwdriver into the exposed lock assembly and hits it with a sledgehammer  Marcus arrives outside a doorway and looks in to see Willie manning a large water drill and putting it to work on the store's vault  Marcus pushes the cart through the store gathering an odd array of items that range from furs to gowns to shoes to makeup  Marcus reaches into jewelry cases and removes a few particular items drops them into a stock cart then checks a typed list before moving on  Marcus sneers at him as he lumbers past  Willie finishes the beer crushes the can and drops it to his feet next to eight more empties  A hasp flips open and Marcus swings the door wide to reveal a beerguzzling Santaintheoffseason known as Willie T Soke  He is covered in sweat and panting like an asthmatic  Santa's Elf  in civilian life known as Marcus Skidmore  the teddy bear rips off its head to reveal its true identity  Mission accomplished  It skids to a stop at the base of the alarm box too short to reach the controls  Running past a clothing display it rips the arm off a mannequin without breaking stride  The teddy bear slides down the space between the railing of the escalators and scrambles for the door crashing into everything in its path  The alarm continues to count down  15  Suddenly a teddy bear moves bolting upright and sprinting from the room  The guard exits the store locks the door and heads home  Eventually Santa emerges and the Security Guard heads for a panel near the doorway and punches a key labeled ARM  Downstairs the last of the store employees file out the door past an old Security Guard  With the sound of closing circuits banks of lights systematically shut down in the various departments of the now empty store  Santa pulls a fifth of Old Grandad from the cushions of his throne and takes a swig  The Elf nods as he peels off a pointed prosthetic ear  Santa pushes him off his lap and shoves him on his way "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Marcus moves closer as Willie pulls back the drill on the track places a screwdriver into the exposed lock assembly and hits it with a sledgehammer  The teddy bear slides down the space between the railing of the escalators and scrambles for the door crashing into everything in its path  Suddenly a teddy bear moves bolting upright and sprinting from the room  Marcus sneers at him as he lumbers past  Marcus arrives outside a doorway and looks in to see Willie manning a large water drill and putting it to work on the store's vault  Santa pushes him off his lap and shoves him on his way  Willie settles on the rear bench as Marcus gets into the passenger seat next to his Pilipino mailorder wife of several years Lois who is dressed in expensively ugly clothes and whose mouth is ever downturned in pruney distaste  Marcus pushes the cart through the store gathering an odd array of items that range from furs to gowns to shoes to makeup  Eventually Santa emerges and the Security Guard heads for a panel near the doorway and punches a key labeled ARM  Finally an alarm clock rings with a jolt and Willie in bed blearily wakes to the insistent alarm He is covered in sweat and panting like an asthmatic  the teddy bear rips off its head to reveal its true identity  The van speeds away through the Christmas Eve night and disappears into the distance like the down of a thistle  A hasp flips open and Marcus swings the door wide to reveal a beerguzzling Santaintheoffseason known as Willie T Soke  Willie finishes the beer crushes the can and drops it to his feet next to eight more empties  Santa's Elf  in civilian life known as Marcus Skidmore  The Elf nods as he peels off a pointed prosthetic ear  The alarm continues to count down  15  Marcus reaches into jewelry cases and removes a few particular items drops them into a stock cart then checks a typed list before moving on  It skids to a stop at the base of the alarm box too short to reach the controls  Suddenly the door swings open and bundled cash spills to the floor  Mission accomplished  Santa pulls a fifth of Old Grandad from the cushions of his throne and takes a swig  With the sound of closing circuits banks of lights systematically shut down in the various departments of the now empty store  Running past a clothing display it rips the arm off a mannequin without breaking stride  Both men are impressed  The guard exits the store locks the door and heads home  Downstairs the last of the store employees file out the door past an old Security Guard "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Santa's Elf  in civilian life known as Marcus Skidmore  He is covered in sweat and panting like an asthmatic  A hasp flips open and Marcus swings the door wide to reveal a beerguzzling Santaintheoffseason known as Willie T Soke  Willie finishes the beer crushes the can and drops it to his feet next to eight more empties  Marcus sneers at him as he lumbers past  Marcus reaches into jewelry cases and removes a few particular items drops them into a stock cart then checks a typed list before moving on  Marcus pushes the cart through the store gathering an odd array of items that range from furs to gowns to shoes to makeup  Marcus arrives outside a doorway and looks in to see Willie manning a large water drill and putting it to work on the store's vault  Marcus moves closer as Willie pulls back the drill on the track places a screwdriver into the exposed lock assembly and hits it with a sledgehammer  Suddenly the door swings open and bundled cash spills to the floor  Both men are impressed  Willie settles on the rear bench as Marcus gets into the passenger seat next to his Pilipino mailorder wife of several years Lois who is dressed in expensively ugly clothes and whose mouth is ever downturned in pruney distaste  The van speeds away through the Christmas Eve night and disappears into the distance like the down of a thistle  Finally an alarm clock rings with a jolt and Willie in bed blearily wakes to the insistent alarm Santa pushes him off his lap and shoves him on his way  The Elf nods as he peels off a pointed prosthetic ear  Santa pulls a fifth of Old Grandad from the cushions of his throne and takes a swig  With the sound of closing circuits banks of lights systematically shut down in the various departments of the now empty store  Downstairs the last of the store employees file out the door past an old Security Guard  Eventually Santa emerges and the Security Guard heads for a panel near the doorway and punches a key labeled ARM  The guard exits the store locks the door and heads home  Suddenly a teddy bear moves bolting upright and sprinting from the room  The alarm continues to count down  15  The teddy bear slides down the space between the railing of the escalators and scrambles for the door crashing into everything in its path  Running past a clothing display it rips the arm off a mannequin without breaking stride  It skids to a stop at the base of the alarm box too short to reach the controls  Mission accomplished  the teddy bear rips off its head to reveal its true identity "
        }
      ]
    }
  ]
}