{
  "ground_truth": "It is early morning and the parking lot is empty except for Marcus' van. The Mercedes eventually pulls in, parking beside him. Marcus throws open the back of the van, revealing the components of the water drill in various prop gift boxes. Willie wears a forbearing smile. He shakes his head and chuckles as Marcus tosses him an empty red Santa sack. Marcus stares. Jesse, the security guard, unlocks the door and opens up for Willie and Marcus. They enter in costume. Willie lugs the filled sack and seems to be straining. As Willie and Marcus enter the store, Gin Slagel drives by their cars, carefully noting their tags. Willie drops the bag with a loud thud. Willie follows Marcus behind the Wonderland backdrop. Marcus points to an air duct in the ceiling. He gets up and walks away. Gin sits at his desk sucking in a Pall Mall filterless. Bob Chipeska sits opposite. A bus clears frame, revealing the kid as he walks toward the mall. Cheering, the six bullies engulf the kid. Willie follows. Willie enters. He goes up and tries to yank the hand, which the hysterical Kid yanks away. As Willie drags him to the sink and runs water over the cut, the Kid takes great gulping breaths and finally manages to say. Willie grabs a vodka bottle standing open on the counter and liberally pours some on the hand. The Kid shrieks. Marcus and Willie go about the business of being a Santa-Elf team. Willie sees off another child. Willie stares at him. Marcus returns to the velvet rope to find Gin Slagel waiting stone-faced. Marcus sighs. Gin leaves. Willie's eyes do not leave the spot in space. The Kid turns to go. Willie beckons him. He displays an envelope. The Kid's eye is indeed black and blue. He reaches self-consciously up to it. Willie, dreamy, refuses to take the bait. Marcus stares at him. Lois, her face set in pruney disapproval, flips slowly through a rack of furs. She somehow senses his presence; without bothering to look around she murmurs. Lois is in the driver's seat. Gin's Ford 4 X 4 speeds around the corner and Marcus flags him down. SCREEEEECH! Gin slams on the brakes, then backs up and pulls over. He emerges from the 4 X 4 with road rage on full brew, and strides over to the van. He shakes his head in disgust. Grumbling, he goes back to the 4 X 4 and drives it into position. He gets out and raises the hood. The two vehicles face each other nose-to-nose, several feet apart as Gin opens the hood. Marcus seems to have a little difficulty reaching the battery terminals.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "It is early dawn and the car park is vacant except for Marcus' van. The Mercedes eventually pulls in, parking beside him. Marcus throws open the back of the van, revealing the elements of the water drill in various prop gift boxes. Willie wears a patient smile. He shakes his head and chuckles as Marcus tosses him an empty red Santa sack. Marcus stares. Jesse, the security guard, unlocks the door and opens up for Willie and Marcus. They enter in costume. Willie lugs the filled sack and seems to be straining. As Willie and Marcus enter the store, Gin Slagel drives by their vehicles, carefully noting their tags. Willie drops the bag with a loud thud. Willie follows Marcus behind the Wonderland backdrop. Marcus points to an air duct in the ceiling. He gets up and walks away. Gin sits at his desk inhaling a Pall Mall filterless. Bob Chipeska sits opposite. A bus clears frame, revealing the child as he walks toward the mall. Cheering, the six bullies engulf the child. Willie follows. Willie enters. He goes up and tries to yank the hand, which the hysterical Kid yanks away. As Willie drags him to the sink and runs water over the cut, the Kid takes great gulping breaths and finally manages to say. Willie grabs a vodka bottle standing open on the counter and liberally pours some on the hand. The Kid shrieks. Marcus and Willie go about the business of being a Santa-Elf team. Willie sees off another child. Willie stares at him. Marcus returns to the velvet rope to find Gin Slagel waiting stone-faced. Marcus sighs. Gin leaves. Willie's eyes do not leave the spot in space. The Kid turns to go. Willie beckons him. He displays an envelope. The Kid's eye is indeed black and blue. He reaches self-consciously up to it. Willie, dreamy, refuses to take the bait. Marcus stares at him. Lois, her face set in pruney disapproval, flips slowly through a rack of furs. She somehow senses his presence; without bothering to look around she murmurs. Lois is in the driver's seat. Gin's Ford 4 X 4 speeds around the corner and Marcus flags him down. SCREEEEECH! Gin slams on the brakes, then backs up and pulls over. He emerges from the 4 X 4 with road rage on full brew, and strides over to the van. He shakes his head in disgust. Grumbling, he goes back to the 4 X 4 and drives it into position. He gets out and raises the hood. The two autos face each other nose-to-nose, several feet apart as Gin opens the hood. Marcus seems to have a little difficulty reaching the battery terminals."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "It is early morning and the parking lot is emptied by everyone except for Marcus' van. The Mercedes is eventually pulled in, parked beside him. The back of the van is thrown open by Marcus, revealing the components of the water drill in various prop gift boxes. A forbearing smile is worn by Willie. His head is shaken, and he chuckles as an empty red Santa sack is tossed to him by Marcus. Marcus is stared at. Jesse, the security guard, unlocks the door and opens it up for Willie and Marcus. They are costumed as they enter. The filled sack is lugged by Willie, and he seems to be straining. As the store is entered by Willie and Marcus, Gin Slagel drives by their cars, carefully noting their tags. The bag is dropped by Willie with a loud thud. Marcus is followed by Willie behind the Wonderland backdrop. An air duct in the ceiling is pointed to by Marcus. He gets up and walks away. Gin sits at his desk, sucking in a Pall Mall filterless. Opposite him sits Bob Chipeska. A bus clears the frame, and the kid is revealed as he walks toward the mall. Cheering is done by the six bullies who engulf the kid. Marcus is followed by Willie. Willie enters and goes up to try yanking the hand, which is yanked away by the hysterical Kid. The sink is approached by Willie, as the Kid is dragged to it, and water is run over the cut. Great gulping breaths are taken by the Kid, who finally manages to speak. A vodka bottle standing open on the counter is grabbed by Willie, and some is poured liberally on the hand. A shriek is let out by the Kid. The business of being a Santa-Elf team is gone about by Marcus and Willie. Another child is seen off by Willie, who stares at him. The velvet rope is returned to by Marcus, who finds Gin Slagel waiting stone-faced. A sigh is let out by Marcus. Gin leaves. The spot in space is not left by Willie's eyes. The Kid turns to go, and he is beckoned by Willie. An envelope is displayed. The Kid's eye is indeed black and blue. He reaches self-consciously up to it. The bait is refused by Willie, who is dreamy. Marcus stares at him. Lois, her face set in pruney disapproval, flips slowly through a rack of furs. His presence is somehow sensed by her; without bothering to look around she murmurs. The driver's seat is occupied by Lois. Gin's Ford 4 X 4 speeds around the corner, flagged down by Marcus. SCREEEEECH! The brakes are slammed on by Gin, who then backs up and pulls over. He emerges from the 4 X 4 with road rage on full brew and strides over to the van. His head is shaken in disgust. Grumbling, he goes back to the 4 X 4 and drives it into position. The hood is raised after he gets out. The two vehicles face each other nose-to-nose, several feet apart as the hood is opened by Gin. A little difficulty seems to be had by Marcus in reaching the battery terminals."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Early morning, the parking lot is empty except for Marcus' van until a Mercedes parks beside him. Marcus opens the van's back, revealing water drill parts in prop gift boxes. Willie smiles, shakes his head, chuckles, and catches an empty Santa sack from Marcus. Security guard Jesse unlocks the door, letting Willie and Marcus, in costume, enter. Willie struggles with the filled sack. As they go inside, Gin Slagel drives by, noting their car tags. Willie drops the bag with a thud and follows Marcus behind the Wonderland backdrop, who points to a ceiling air duct before walking away. Gin smokes a Pall Mall at his desk opposite Bob Chipeska. A bus reveals a kid approaching the mall, where six bullies surround him. Willie follows, tries to grab the kid's hand, and drags him to a sink to treat a cut. Willie pours vodka on the wound, and the kid shrieks. Marcus and Willie continue as a Santa-Elf team, with Willie seeing off another child. Marcus returns to find Gin Slagel waiting. Gin leaves, and Willie watches the space. The kid, with a black eye, turns to leave, but Willie displays an envelope, refusing to react. Marcus stares as Lois flips through furs, sensing his presence. Gin's Ford 4X4 speeds around a corner, and Marcus flags him down. Gin brakes, backs up, pulls over, and steps out angrily. Grumbling, he realigns the 4X4, opens the hood, and struggles to reach the battery terminals."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Early morning, the parking lot is empty except for Marcus' van. A Mercedes parks beside him. Marcus opens the van's back, revealing water drill components in prop gift boxes. Willie chuckles as Marcus tosses him a Santa sack. Jesse, the security guard, lets them in. Willie, straining with the sack, enters as Gin Slagel drives by, noting their tags. Willie loudly drops the bag and follows Marcus behind the backdrop, pointing to a ceiling air duct. Marcus leaves. Gin smokes at his desk. Bob Chipeska sits opposite. The Kid approaches the mall, surrounded by bullies while Willie follows. Willie enters, tries grabbing the Kid's hand, yanked away hysterically. He drags the Kid to the sink, running water over the cut, then pours vodka, making the Kid shriek. Marcus and Willie continue their Santa-Elf duties. Willie dismisses a child while Marcus finds Gin waiting stone-faced, who then leaves. Willie beckons the Kid, displaying an envelope. The Kid touches his black eye. Willie remains unresponsive. Marcus watches him. Lois, disapproving, flips through furs and senses him, murmuring without looking. In the driver's seat, Gin's speeding Ford 4 X 4, flagged by Marcus, screeches and backs up. Gin emerges, furious, then drives the 4 X 4 into position, raising the hood. Marcus struggles with the battery terminals."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In the early hours of the morning, the parking lot is nearly deserted, save for Marcus' trusty van parked alone in the expansive space. Eventually, a sleek Mercedes rolls in, finally coming to a stop right next to Marcus' van. With a flourish, Marcus flings open the back of his van, revealing a jumble of components for the water drill, cleverly disguised within various prop gift boxes. Willie, standing by, wears a smile of patient endurance. He shakes his head with mild amusement and lets out a chuckle as Marcus tosses an empty red Santa sack in his direction. Marcus remains silent, simply staring. Jesse, the security guard on duty, unlocks the door and opens it wide for Willie and Marcus, allowing them entry. Dressed in costume, they step inside. Willie hauls the now-filled sack with visible effort, appearing to strain under its weight. As they make their way into the store, Gin Slagel, driving by in her vehicle, takes careful note of their car tags. Willie clumsily drops the bag with a resonant thud. He trails behind Marcus as they move behind the Wonderland backdrop. Marcus gestures towards an air duct situated high in the ceiling before getting up and walking away. Meanwhile, Gin sits at his desk, inhaling deeply on a Pall Mall filterless cigarette, while Bob Chipeska sits across from him. A bus passes by, and as it clears the frame, the kid emerges, walking determinedly toward the mall. As he approaches, he is immediately surrounded by the spontaneous cheer of six bullies. Willie trails after them. Upon entering, Willie attempts to yank the kid's hand, but the agitated Kid jerks it away. Willie, undeterred, drags him over to the sink and runs cool water over the cut, as the Kid takes deep, gulping breaths before managing to speak. Willie grabs a vodka bottle left open on the counter, pouring it liberally over the cut, causing the Kid to let out a shriek. Meanwhile, Marcus and Willie continue their duties as the Santa-Elf team. Willie sees off another child and watches him intently. Marcus returns to the velvet rope area to find Gin Slagel standing there, stone-faced and waiting. Marcus lets out a sigh of resignation. Gin departs, but Willie's gaze remains fixed on the empty space. As the Kid turns to leave, Willie gestures for him to come over, showing him an envelope. The Kid's eye is noticeably black and blue, and he reaches up to it with self-consciousness. Willie, lost in his thoughts, refuses to acknowledge the situation. Marcus stares at him with concern. Meanwhile, Lois, wearing an expression of pruney disapproval, slowly flips through a rack of furs. Somehow sensing Willie's presence, she murmurs without even turning around. Later, Lois is seen in the driver's seat of her car. Gin's Ford 4 X 4 speeds around the corner as Marcus waves him down. With a loud SCREEEEECH, Gin slams on the brakes, then backs up and pulls over. Emerging from the 4 X 4, his road rage simmering, Gin strides over to the van, shaking his head in disgust. Grumbling under his breath, he returns to the 4 X 4 and maneuvers it into position. He exits the vehicle and raises the hood. The two vehicles, now facing each other nose-to-nose, stand several feet apart as Gin opens the hood. Meanwhile, Marcus appears to struggle a bit with reaching the battery terminals."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As the first light of dawn begins to paint the sky with shades of gentle pink and orange, the parking lot stands almost entirely vacant, creating an impression of vast emptiness. The only vehicle present is Marcus' reliable van, parked in isolation within the expansive lot. Eventually, a luxurious Mercedes glides smoothly into the lot, gracefully coming to a halt right beside Marcus' solitary van. With a theatrical flair, Marcus swings open the rear of his van, unveiling an assortment of water drill components, ingeniously camouflaged within a collection of seemingly festive prop gift boxes. Willie, positioned nearby, wears an expression of patient endurance, his lips curving into a smile tinged with amusement. He shakes his head slightly, allowing himself a soft chuckle as Marcus nonchalantly tosses an empty red Santa sack in his direction. Marcus, maintaining silence, simply fixes his gaze on Willie. Jesse, the diligent security guard stationed on duty, unlocks the door and swings it open wide, granting entry to both Willie and Marcus. Clad in their costumes, they step inside. Willie, struggling under the burden of the now-filled sack, shows signs of exertion as he hauls it along. Making their way into the store, they catch the attention of Gin Slagel, who, driving by in her vehicle, meticulously notes down their car tags. Willie, in a moment of clumsiness, lets the bag fall with a resounding thud. He follows Marcus as they move behind the intricately designed Wonderland backdrop. Marcus, without a word, gestures toward an air duct positioned high up in the ceiling before rising and walking away. Meanwhile, Gin sits at his desk, deeply inhaling from a Pall Mall filterless cigarette, while Bob Chipeska sits opposite him. A bus rumbles past, and as it clears the scene, the kid comes into view, walking with a sense of determination toward the mall. As he draws nearer, he is quickly surrounded by the spontaneous cheer of six bullies. Willie trails after them, entering the scene just as Willie tries to seize the kid's hand, only for the agitated Kid to yank it away forcefully. Unperturbed, Willie drags him over to the sink, running cool water over the cut as the Kid takes deep, gulping breaths before finally speaking. Willie grabs a vodka bottle, left uncapped on the counter, and pours it generously over the cut, prompting the Kid to let out a sharp shriek. In the meantime, Marcus and Willie continue fulfilling their roles as the Santa-Elf team. Willie bids farewell to another child, watching him with intense focus. Marcus soon returns to the velvet rope area, only to find Gin Slagel standing there, stone-faced and waiting with an air of expectancy. Marcus releases a sigh of resignation. Gin eventually departs, yet Willie's gaze remains transfixed on the now-vacant space. As the Kid turns to leave, Willie beckons him to come closer, showing him an envelope. The Kid, with a noticeable black and blue eye, reaches up to touch it, his demeanor full of self-consciousness. Lost in his thoughts, Willie refuses to acknowledge the circumstances. Marcus, observing him, regards Willie with concern etched on his face. Elsewhere, Lois, wearing an expression that could only be described as pruney disapproval, carefully flips through a rack of luxurious furs. Somehow sensing Willie's presence nearby, she murmurs without so much as turning around. Later, Lois is seen in the driver's seat of her car. Gin's Ford 4 X 4 comes roaring around the corner as Marcus waves him down. With a deafening SCREEEEECH, Gin slams on the brakes, then, with precision, backs up and pulls over. Emerging from the 4 X 4 with his road rage barely contained, Gin strides over to the van, shaking his head in evident disgust. Muttering under his breath, he returns to the 4 X 4 and adeptly maneuvers it into position. He exits the vehicle, raising the hood with a sense of purpose. The two vehicles now face each other, nose-to-nose, standing several feet apart as Gin opens the hood. Meanwhile, Marcus appears to be experiencing some difficulty in reaching the battery terminals, his movements indicating a struggle."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "In the early morning light, the parking lot lies empty except for Marcus' van, a lone sentinel in the vast space. After some time, a Mercedes gracefully glides into the lot, coming to a stop beside Marcus' van. With a swift motion, Marcus flings open the back of his van, revealing an array of water drill components cleverly disguised within various prop gift boxes. Watching this unfold, Willie dons a patient smile, his amusement evident as he shakes his head and lets out a light chuckle. Catching Marcus' eye, Willie reaches out to catch the empty red Santa sack Marcus tosses his way. Marcus holds his gaze steady. At that moment, Jesse, the vigilant security guard, approaches the entrance, unlocking the door to grant passage to Willie and Marcus, who both step inside clad in costume. As they make their entrance, Willie heaves the filled sack, his physical strain apparent, while Gin Slagel drives by their vehicles in the parking lot, meticulously taking note of their license plates. Inside the store, Willie allows the hefty bag to fall with a resonant thud. Without missing a beat, Willie trails behind Marcus, navigating past the Wonderland backdrop. Marcus gestures towards an air duct high in the ceiling before rising to his feet and walking away. Meanwhile, Gin Slagel is settled at his desk, inhaling deeply from a Pall Mall filterless cigarette, his eyes meeting those of Bob Chipeska, sitting across from him. Outside, a bus clears the frame, unveiling a kid making his way towards the mall, only to be surrounded and cheered by six bullies who close in on him. Unfazed, Willie quietly follows their trail. Upon entering, Willie approaches and attempts to tug the kid's hand, which the distressed child pulls away in a frenzy. Displaying a commanding presence, Willie manages to drag the kid to a nearby sink, turning on the water and running it over the injured hand as the kid takes in great, calming breaths before finally speaking. With a decisive motion, Willie snatches a vodka bottle from the counter, pouring it generously over the wound, prompting the kid to shriek in response. Meanwhile, Marcus and Willie continue their façade as a Santa-Elf duo, with Willie courteously seeing off yet another child, though his eyes remain locked on the retreating figure. Marcus returns to his station at the velvet rope, only to discover Gin Slagel standing there, his face expressionless. With a resigned sigh, Marcus watches as Gin retreats. Willie, lost in a dream-like state, maintains his focus on an empty spot in space. As the kid turns to leave, Willie gestures for him to return, displaying an envelope. The kid, sporting a visibly bruised eye, self-consciously touches the tender area. Willie, detached, refuses to engage further, while Marcus fixes his gaze on him. Meanwhile, Lois, her expression set in a prune-like disapproval, lazily flips through a rack of furs, instinctively aware of his presence; without so much as a glance, she murmurs softly. Lois, seated in the driver's seat, becomes witness to Gin's Ford 4 X 4 as it hurtles around the corner, with Marcus urgently flagging him down. The screech of brakes fills the air as Gin brings the vehicle to a halt, then reversing slightly, he maneuvers the vehicle over to the side. Emerging from the 4 X 4, his demeanor charged with road rage, Gin advances towards the van, shaking his head with evident disgust. With a disgruntled expression, he returns to his vehicle, carefully positioning it before stepping out to lift the hood. The two vehicles now stand face-to-face, several feet apart, as Gin opens the hood, presenting Marcus with a minor challenge as he stretches to reach the battery terminals."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "It is early morning, and Marcus' van is alone in the parking lot until a Mercedes arrives and parks beside it. Marcus opens the van's back to reveal water drill components disguised in prop gift boxes, and tosses an empty Santa sack to Willie, who responds with a tolerant smile. Jesse, the security guard, unlocks the door for Willie and Marcus, who enter in costume. Willie strains while carrying the filled sack inside the store as Gin Slagel, passing by, notes their vehicle tags. Willie drops the sack noisily and follows Marcus behind the Wonderland backdrop, where Marcus points out an air duct in the ceiling before walking away.\n\nMeanwhile, Gin, sitting across Bob Chipeska at his desk, smokes a cigarette. Outside, a bus passes, unveiling a kid approaching the mall. He is quickly surrounded by six bullies. Willie trails behind, and upon entering, he attends to the kid's cut hand by first trying to grab it, then dragging the kid to the sink to rinse it under water. Willie pours vodka on the wound, causing the kid to shriek. Marcus and Willie continue their roles as the Santa-Elf team, with Willie seeing off another child before staring into space. Marcus returns to find Gin Slagel waiting and sighs as Gin leaves.\n\nWillie, still lost in thought, signals the Kid, noticing his black-and-blue eye. Despite the Kid's self-consciousness, Willie remains unfazed. Marcus watches him as Lois, browsing through a fur rack, senses Marcus' presence and mutters without turning. Later, Lois in the driver's seat, Gin's 4x4 speeds around a corner. Marcus flags him down, prompting Gin to brake abruptly, reverse, and pull over with visible road rage. After a brief exchange, Gin positions his vehicle, opens the hood, and the two vehicles stand face-to-face as Marcus struggles to reach the battery terminals."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "It is early morning and the parking lot, belonging to the strip mall known for its variety of outlet stores, is empty except for Marcus' van. The Mercedes, a sleek model indicating some wealth or status, eventually pulls in, parking beside him. Marcus throws open the back of the van, revealing the components of the water drill cleverly disguised in various prop gift boxes meant for the holiday store display. Willie, known among their circle for his patience, wears a forbearing smile. He shakes his head and chuckles as Marcus tosses him an empty red Santa sack, reminiscent of the classic sacks used in holiday movies. Marcus stares. Jesse, the security guard who is recognized by regulars for his meticulousness, unlocks the door and opens up for Willie and Marcus, well aware of their seasonal roles. They enter in costume. Willie lugs the filled sack and seems to be straining, perhaps due to the concealed equipment inside. As Willie and Marcus enter the store, Gin Slagel, a local detective with a reputation for meticulous note-taking, drives by their cars, carefully noting their tags for future reference. Willie drops the bag, which lands with a loud thud, hinting at its heavy and unusual contents. Willie follows Marcus behind the Wonderland backdrop, a seasonal decoration popular for holiday photo opportunities. Marcus points to an air duct in the ceiling, suggesting a plan that involves accessing restricted areas. He gets up and walks away. Gin, known for his chain-smoking habits, sits at his desk sucking in a Pall Mall filterless, a cigarette brand dating back to the late 19th century. Bob Chipeska, the curious department head concerned about store security, sits opposite. A bus clears frame, revealing the kid who is frequently seen alone as he walks toward the mall. Cheering, the six bullies, notorious in the community for their ruthless teasing, engulf the kid. Willie follows, keeping a careful watch. Willie enters. He goes up and tries to yank the hand, which the hysterical Kid yanks away in distress. As Willie drags him to the sink and runs water over the cut, the Kid takes great gulping breaths, panic gradually subsiding, and finally manages to say. Willie grabs a vodka bottle standing open on the counter, a common scene in holiday break rooms, and liberally pours some on the hand as a rudimentary antiseptic. The Kid shrieks. Marcus and Willie continue their task as the familiar Santa-Elf team hired by the store for the holidays. Willie sees off another child, a typical part of their job during this festive season. Willie stares at him, contemplating. Marcus returns to the velvet rope, a boundary for the waiting line of eager children, to find Gin Slagel waiting stone-faced, ever watchful. Marcus sighs, feeling the weight of scrutiny. Gin leaves. Willie's eyes do not leave the spot in space, as if caught in a moment of introspection. The Kid turns to go. Willie beckons him, a gesture of unexpected kindness. He displays an envelope, perhaps containing a note or message. The Kid's eye is indeed black and blue, a testament to the bullying he endures. He reaches self-consciously up to it, feeling its tenderness. Willie, lost in his own world, dreamy, refuses to take the bait of further engaging in conversation. Marcus stares at him, puzzled by Willie's uncharacteristic behavior. Lois, her face set in pruney disapproval of the mall's frivolity, flips slowly through a rack of furs, likely fake given the store's budget. She somehow senses his presence; without bothering to look around she murmurs, already dismissing him. Lois is in the driver's seat of her old sedan, ready to leave the chaos behind. Gin's Ford 4 X 4, known for its rugged durability, speeds around the corner and Marcus flags him down, signaling an urgency. SCREEEEECH! Gin slams on the brakes, then backs up and pulls over with the precision of someone often in pursuit. He emerges from the 4 X 4 with road rage on full brew, a common occurrence for someone in his line of work, and strides over to the van. He shakes his head in disgust at the scene. Grumbling, he goes back to the 4 X 4 and drives it into position as if orchestrating an impromptu rendezvous. He gets out and raises the hood, understanding the mechanical issue at hand. The two vehicles face each other nose-to-nose, several feet apart as Gin opens the hood, ready to lend assistance. Marcus seems to have a little difficulty reaching the battery terminals, a task requiring some dexterity."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Willie lugs the filled sack and seems to be straining It is early morning and the parking lot is empty except for Marcus' van The Mercedes eventually pulls in parking beside him Marcus throws open the back of the van revealing the components of the water drill in various prop gift boxes Willie wears a forbearing smile Gin leaves Willie's eyes do not leave the spot in space He shakes his head and chuckles as Marcus tosses him an empty red Santa sack Marcus stares Jesse the security guard unlocks the door and opens up for Willie and Marcus They enter in costume Willie lugs the filled sack and seems to be straining Marcus stares Willie dreamy refuses to take the bait Gin's Ford 4 X 4 speeds around the corner and Marcus flags him down As Willie and Marcus enter the store Gin Slagel drives by their cars carefully noting their tags Willie drops the bag with a loud thud Willie beckons him Willie follows Marcus behind the Wonderland backdrop Marcus points to an air duct in the ceiling He gets up and walks away They enter in costume Gin sits at his desk sucking in a Pall Mall filterless Marcus seems to have a little difficulty reaching the battery terminals A bus clears frame revealing the kid as he walks toward the mall Bob Chipeska sits opposite A bus clears frame revealing the kid as he walks toward the mall Cheering the six bullies engulf the kid Willie follows Willie enters He goes up and tries to yank the hand which the hysterical Kid yanks away He gets up and walks away As Willie drags him to the sink and runs water over the cut the Kid takes great gulping breaths and finally manages to say Willie grabs a vodka bottle standing open on the counter and liberally pours some on the hand Marcus returns to the velvet rope to find Gin Slagel waiting stonefaced The Kid shrieks Marcus and Willie go about the business of being a SantaElf team she murmurs The Mercedes eventually pulls in parking beside him Willie sees off another child Willie stares at him Marcus returns to the velvet rope to find Gin Slagel waiting stonefaced He gets out and raises the hood Marcus sighs Gin leaves Willie's eyes do not leave the spot in space The Kid turns to go Willie enters Willie beckons him As Willie drags him to the sink and runs water over the cut the Kid takes great gulping breaths and finally manages to say He displays an envelope Gin slams on the brakes then backs up and pulls over Grumbling he goes back to the 4 X 4 and drives it into position The Kid's eye is indeed black and blue He shakes his head in disgust He reaches selfconsciously up to it Marcus throws open the back of the van revealing the components of the water drill in various prop gift boxes Willie dreamy refuses to take the bait Marcus stares at him Marcus stares at him Lois her face set in pruney disapproval flips slowly through a rack of furs She somehow senses his presence without bothering to look around she murmurs Lois is in the driver's seat Jesse the security guard unlocks the door and opens up for Willie and Marcus Gin's Ford 4 X 4 speeds around the corner and Marcus flags him down SCREEEEECH The Kid's eye is indeed black and blue Willie stares at him Gin slams on the brakes then backs up and pulls over He emerges from the 4 X 4 with road rage on full brew and strides over to the van filterless He shakes his head in disgust Grumbling he goes back to the 4 X 4 and drives it into position He gets out and raises the hood Gin sits at his desk sucking in a Pall Mall The two vehicles face each other nosetonose several feet apart as Gin opens the hood Marcus seems to have a little difficulty reaching the battery terminals"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "It is early morning and the parking lot is empty except for Marcus' van. The Mercedes eventually pulls in parking beside him. Marcus throws open the back of the van revealing the components of the water drill in various prop gift boxes. Willie wears a forbearing smile. He shakes his head and chuckles as Marcus tosses him an empty red Santa sack. Marcus stares. Jesse the security guard unlocks the door and opens up for Willie and Marcus. They enter in costume. Willie lugs the filled sack and seems to be straining. As Willie and Marcus enter the store Gin Slagel drives by their cars carefully noting their tags. Willie drops the bag with a loud thud. Willie follows Marcus behind the Wonderland backdrop. Marcus points to an air duct in the ceiling. He gets up and walks away. Gin sits at his desk sucking in a Pall Mall. filterless. Bob Chipeska sits opposite. A bus clears frame revealing the kid as he walks toward the mall. Cheering the six bullies engulf the kid. Willie follows. Willie enters. He goes up and tries to yank the hand which the hysterical Kid yanks away. As Willie drags him to the sink and runs water over the cut the Kid takes great gulping breaths and finally manages to say. Willie grabs a vodka bottle standing open on the counter and liberally pours some on the hand. The Kid shrieks. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Marcus and Willie go about the business of being a SantaElf team. Willie sees off another child. Willie stares at him. Marcus returns to the velvet rope to find Gin Slagel waiting stonefaced. Marcus sighs. Gin leaves Willie's eyes do not leave the spot in space. The Kid turns to go. Willie beckons him. He displays an envelope. The Kid's eye is indeed black and blue. He reaches selfconsciously up to it. Willie dreamy refuses to take the bait. Marcus stares at him. Lois her face set in pruney disapproval flips slowly through a rack of furs. She somehow senses his presence without bothering to look around. she murmurs. Lois is in the driver's seat. Gin's Ford 4 X 4 speeds around the corner and Marcus flags him down. SCREEEEECH. Gin slams on the brakes then backs up and pulls over. He emerges from the 4 X 4 with road rage on full brew and strides over to the van. He shakes his head in disgust. Grumbling he goes back to the 4 X 4 and drives it into position. He gets out and raises the hood. The two vehicles face each other nosetonose several feet apart as Gin opens the hood. Marcus seems to have a little difficulty reaching the battery terminals."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "It is early morning and the parking lot is empty except for Marcus' van. The Mercedes eventually pulls in parking beside him. Marcus throws open the back of the van revealing the components of the water drill in various prop gift boxes. Willie wears a forbearing smile. He shakes his head and chuckles as Marcus tosses him an empty red Santa sack. Marcus stares. Jesse the security guard unlocks the door and opens up for Willie and Marcus. They enter in costume. Willie lugs the filled sack and seems to be straining. As Willie and Marcus enter the store Gin Slagel drives by their cars carefully noting their tags. Willie drops the bag with a loud thud. Willie follows Marcus behind the Wonderland backdrop. Marcus points to an air duct in the ceiling. He gets up and walks away. Gin sits at his desk sucking in a Pall Mall. filterless. Bob Chipeska sits opposite. A bus clears frame revealing the kid as he walks toward the mall. Cheering the six bullies engulf the kid. Willie follows. Willie enters. He goes up and tries to yank the hand which the hysterical Kid yanks away. As Willie drags him to the sink and runs water over the cut the Kid takes great gulping breaths and finally manages to say. Willie grabs a vodka bottle standing open on the counter and liberally pours some on the hand. The Kid shrieks. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Marcus and Willie go about the business of being a SantaElf team. Willie sees off another child. Willie stares at him. Marcus returns to the velvet rope to find Gin Slagel waiting stonefaced. Marcus sighs. Gin leaves Willie's eyes do not leave the spot in space. The Kid turns to go. Willie beckons him. He displays an envelope. The Kid's eye is indeed black and blue. He reaches selfconsciously up to it. Willie dreamy refuses to take the bait. Marcus stares at him. Lois her face set in pruney disapproval flips slowly through a rack of furs. She somehow senses his presence without bothering to look around. she murmurs. Lois is in the driver's seat. Gin's Ford 4 X 4 speeds around the corner and Marcus flags him down. SCREEEEECH. Gin slams on the brakes then backs up and pulls over. He emerges from the 4 X 4 with road rage on full brew and strides over to the van. He shakes his head in disgust. Grumbling he goes back to the 4 X 4 and drives it into position. He gets out and raises the hood. The two vehicles face each other nosetonose several feet apart as Gin opens the hood. Marcus seems to have a little difficulty reaching the battery terminals."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "It is early morning and the parking lot is empty except for Marcus' van. The Mercedes eventually pulls in parking beside him. Marcus throws open the back of the van revealing the components of the water drill in various prop gift boxes. Willie wears a forbearing smile. He shakes his head and chuckles as Marcus tosses him an empty red Santa sack. Marcus stares. Jesse the security guard unlocks the door and opens up for Willie and Marcus. They enter in costume. Willie lugs the filled sack and seems to be straining. As Willie and Marcus enter the store Gin Slagel drives by their cars carefully noting their tags. Willie drops the bag with a loud thud. Willie follows Marcus behind the Wonderland backdrop. Marcus points to an air duct in the ceiling. Lois her face set in pruney disapproval flips slowly through a rack of furs. She somehow senses his presence without bothering to look around. she murmurs. Lois is in the driver's seat. Gin's Ford 4 X 4 speeds around the corner and Marcus flags him down. SCREEEEECH. Gin slams on the brakes then backs up and pulls over. He emerges from the 4 X 4 with road rage on full brew and strides over to the van. He shakes his head in disgust. Grumbling he goes back to the 4 X 4 and drives it into position. He gets out and raises the hood. The two vehicles face each other nosetonose several feet apart as Gin opens the hood. Marcus seems to have a little difficulty reaching the battery terminals."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "It is early morning and the parking lot is empty except for Marcus' van. The Mercedes eventually pulls in parking beside him. Marcus throws open the back of the van revealing the components of the water drill in various prop gift boxes. Willie wears a forbearing smile. He shakes his head and chuckles as Marcus tosses him an empty red Santa sack. He emerges from the 4 X 4 with road rage on full brew and strides over to the van. He shakes his head in disgust. Grumbling he goes back to the 4 X 4 and drives it into position. He gets out and raises the hood. The two vehicles face each other nosetonose several feet apart as Gin opens the hood. Marcus seems to have a little difficulty reaching the battery terminals."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "It is early morning and the parking lot is empty except for a penguin's van. The Mercedes eventually pulls in, parking beside the penguin. An owl throws open the back of the van, revealing the components of the water drill in various prop gift boxes. A squirrel wears a forbearing smile. The squirrel shakes its head and chuckles as the owl tosses it an empty red Santa sack. The owl stares. A cat, the security guard, unlocks the door and opens up for the squirrel and the owl. They enter in costume. The squirrel lugs the filled sack and seems to be straining. As the squirrel and the owl enter the store, a rabbit drives by their cars, carefully noting their tags. The squirrel drops the bag with a loud thud. The squirrel follows the owl behind the Wonderland backdrop. A mouse points to an air duct in the ceiling. The mouse gets up and walks away. The rabbit sits at its desk sucking in a Pall Mall filterless. A coyote sits opposite. A bus clears frame, revealing the kid as he walks toward the mall. Cheering, the six turtles engulf the kid. The squirrel follows. The squirrel enters. It goes up and tries to yank the hand, which the hysterical Kid yanks away. As the squirrel drags him to the sink and runs water over the cut, the Kid takes great gulping breaths and finally manages to say. The squirrel grabs a vodka bottle standing open on the counter and liberally pours some on the hand. The Kid shrieks. The owl and the squirrel go about the business of being a Santa-Elf team. The squirrel sees off another child. The squirrel stares at the owl. The mouse returns to the velvet rope to find the rabbit waiting stone-faced. The mouse sighs. The rabbit leaves. The squirrel's eyes do not leave the spot in space. The Kid turns to go. The squirrel beckons him. It displays an envelope. The Kid's eye is indeed black and blue. He reaches self-consciously up to it. The squirrel, dreamy, refuses to take the bait. The owl stares at it. A fox, her face set in pruney disapproval, flips slowly through a rack of furs. She somehow senses the presence of the owl; without bothering to look around she murmurs. The fox is in the driver's seat. The rabbit's Ford 4 X 4 speeds around the corner and the mouse flags it down. SCREEEEECH! The rabbit slams on the brakes, then backs up and pulls over. It emerges from the 4 X 4 with road rage on full brew, and strides over to the van. It shakes its head in disgust. Grumbling, it goes back to the 4 X 4 and drives it into position. It gets out and raises the hood. The two vehicles face each other nose-to-nose, several feet apart as the rabbit opens the hood. The mouse seems to have a little difficulty reaching the battery terminals."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "It is early morning and the playground is empty except for Marcus' bicycle. The Volkswagen eventually pulls in, parking beside him. Marcus throws open the back of the bicycle, revealing the components of the music speaker in various prop cereal boxes. Willie wears a forbearing smile. He shakes his head and chuckles as Marcus tosses him an empty blue magician's hat. Marcus stares. Jesse, the concierge, unlocks the door and opens up for Willie and Marcus. They enter in costume. Willie lugs the filled hat and seems to be straining. As Willie and Marcus enter the gallery, Gin Slagel drives by their motorcycles, carefully noting their tags. Willie drops the hat with a loud thud. Willie follows Marcus behind the Carnival backdrop. Marcus points to a stained glass window in the ceiling. He gets up and walks away. Gin sits at his desk sucking in a cigarillo. Bob Chipeska sits opposite. A train clears frame, revealing the kid as he walks toward the library. Cheering, the six bullies engulf the kid. Willie follows. Willie enters. He goes up and tries to yank the pen, which the hysterical Kid yanks away. As Willie drags him to the cooler and runs water over the cut, the Kid takes great gulping breaths and finally manages to say. Willie grabs a whiskey bottle standing open on the counter and liberally pours some on the pen. The Kid shrieks. Marcus and Willie go about the business of being a Santa-Elf team. Willie sees off another toddler. Willie stares at him. Marcus returns to the silk curtain to find Gin Slagel waiting stone-faced. Marcus sighs. Gin leaves. Willie's eyes do not leave the spot in space. The Kid turns to go. Willie beckons him. He displays a postcard. The Kid's eye is indeed black and blue. He reaches self-consciously up to it. Willie, dreamy, refuses to take the bait. Marcus stares at him. Lois, her face set in pruney disapproval, flips slowly through a rack of scarves. She somehow senses his presence; without bothering to look around she murmurs. Lois is in the driver's seat. Gin's Honda ATV speeds around the corner and Marcus flags him down. SCREEEEECH! Gin slams on the brakes, then backs up and pulls over. He emerges from the ATV with road rage on full brew and strides over to the bicycle. He shakes his head in disgust. Grumbling, he goes back to the ATV and drives it into position. He gets out and raises the canopy. The two vehicles face each other nose-to-nose, several feet apart as Gin opens the canopy. Marcus seems to have a little difficulty reaching the fuel terminals."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "It is early morning and the parking lot is empty except for Marcus' van. The Mercedes eventually rolls in, idling beside him. Marcus swings open the back of the van, displaying the components of the water drill in various prop gift boxes. Willie wears a contemplative smile. He nods his head and smirks as Marcus hands him an empty red Santa sack. Marcus glares. Jesse, the security guard, locks the door and gestures for Willie and Marcus. They enter in costume. Willie hauls the filled sack and appears to be struggling. As Willie and Marcus enter the store, Gin Slagel strolls by their cars, carefully noting their tags. Willie sets down the bag with a loud clang. Willie trails Marcus behind the Wonderland backdrop. Marcus gestures to an air duct in the ceiling. He sits down and looks away. Gin sits at his desk puffing on a Pall Mall filterless. Bob Chipeska sits opposite. A bus appears, revealing the kid as he strolls toward the mall. Cheering, the six bullies surround the kid. Willie tags along. Willie approaches. He goes up and tries to tug the hand, which the hysterical Kid pulls away. As Willie leads him to the sink and drips water over the cut, the Kid takes great gulping breaths and finally manages to say. Willie reaches for a vodka bottle standing open on the counter and liberally splashes some on the hand. The Kid squeals. Marcus and Willie engage in the business of being a Santa-Elf team. Willie sends off another child. Willie glares at him. Marcus returns to the velvet rope to find Gin Slagel waiting stone-faced. Marcus groans. Gin departs. Willie's eyes remain fixed on the spot in space. The Kid turns to leave. Willie gestures him over. He brandishes an envelope. The Kid's eye is indeed black and blue. He touches self-consciously up to it. Willie, dreamy, declines to take the bait. Marcus glares at him. Lois, her face set in pruney disapproval, thumbs slowly through a rack of furs. She somehow senses his presence; without bothering to look around, she mutters. Lois is in the driver's seat. Gin's Ford 4 X 4 tears around the corner and Marcus waves him down. SCREEEEECH! Gin slams on the brakes, then rolls forward and parks. He steps out of the 4 X 4 with road rage on full brew, and marches over to the van. He nods his head in disgust. Muttering, he returns to the 4 X 4 and maneuvers it into position. He steps out and lifts the hood. The two vehicles face each other nose-to-nose, several feet apart as Gin closes the hood. Marcus seems to have a little difficulty tapping the battery terminals."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "It is early morning and the garden is empty except for Lisa's tricycle. The bicycle eventually pulls in, parking beside it. Lisa throws open the back of the tricycle, revealing the components of the chocolate mixer in various prop toy cars. Tommy wears a tolerant smirk. He shakes his head and chuckles as Lisa tosses him an empty blue pirate hat. Lisa stares. Sophie, the lifeguard, unlocks the gate and opens up for Tommy and Lisa. They enter in disguise. Tommy lugs the packed hat and seems to be straining. As Tommy and Lisa enter the library, Pat Dorsey rides by their scooters, carefully noting their stickers. Tommy drops the hat with a loud thud. Tommy follows Lisa behind the Carnival stage. Lisa points to a picture frame on the wall. She gets up and walks away. Pat sits at her table sucking in a Lucky Strike filterless. Mike Anderson sits opposite. A skateboard clears view, revealing the cat as it wanders toward the cafe. Cheering, the seven butterflies surround the cat. Tommy follows. Tommy enters. He goes up and tries to yank the shoe, which the hysterical Unicorn yanks away. As Tommy drags it to the stove and runs water over the bruise, the Unicorn takes great gulping breaths and finally manages to say. Tommy grabs a juice carton standing open on the counter and liberally pours some on the shoe. The Unicorn shrieks. Lisa and Tommy go about the business of being a Chef-Maid team. Tommy sees off another mouse. Tommy stares at it. Lisa returns to the silk curtain to find Pat Dorsey waiting stone-faced. Lisa sighs. Pat leaves. Tommy's eyes do not leave the spot in air. The Unicorn turns to go. Tommy beckons it. He displays a postcard. The Unicorn's eye is indeed red and green. It reaches self-consciously up to it. Tommy, dazed, refuses to take the bait. Lisa stares at it. Carla, her face set in apple disapproval, flips slowly through a rack of feathers. She somehow senses its presence; without bothering to look around she murmurs. Carla is in the passenger seat. Pat's Jeep speeds around the corner and Lisa signals her to stop. SCREEEEECH! Pat slams on the brakes, then backs up and pulls over. She emerges from the Jeep with road rage on full steam, and strides over to the tricycle. She shakes her head in disgust. Grumbling, she goes back to the Jeep and drives it into position. She gets out and raises the trunk. The two toys face each other wheel-to-wheel, several feet apart as Pat opens the trunk. Lisa seems to have a little difficulty reaching the bungee cords."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "It is early morning, and the field is vacant except for Walter's bicycle. The Lexus eventually cruises in, settling beside him. Walter flings open the back of the bicycle, revealing the components of the coffee press in various prop suitcases. Diane wears a forbearing grin. She shakes her head and laughs as Walter flings her an empty pink Easter basket. Walter gazes. Laura, the janitor, locks the gate and opens up for Diane and Walter. They proceed in disguise. Diane heaves the filled basket and seems to be straining. As Diane and Walter enter the shop, Tony Blakel drives past their bicycles, carefully noting their tags. Diane drops the basket with a loud clatter. Diane trails Walter behind the Carnival backdrop. Walter gestures to a chandelier in the ceiling. He rises and wanders off. Tony reclines at his chair, puffing on a cigarillo. Steve Donen sits across. A car clears frame, revealing the toddler as she crawls toward the library. Laughing, the six pigeons surround the toddler. Diane trails. Diane enters. She approaches and tries to pull the rope, which the giggling Toddler pulls away. As Diane hauls her to the fountain and splashes water over the scrape, the Toddler takes great gulping breaths and eventually manages to say. Diane picks up a soda bottle standing open on the table and liberally pours some on the rope. The Toddler wails. Walter and Diane go about the business of being a Wizard-Fairy duo. Diane navigates another toddler. Diane gazes at her. Walter returns to the metal gate to find Tony Blakel waiting expressionless. Walter sighs. Tony departs. Diane's eyes do not leave the spot in air. The Toddler turns to leave. Diane gestures her. She presents an envelope. The Toddler's knee is indeed scratched and red. She reaches self-consciously down to it. Diane, dreamy, refuses to take the hint. Walter stares at her. Mary, her face set in prune-like disapproval, flips leisurely through a shelf of scarves. She somehow senses his presence; without bothering to look around she murmurs. Mary is in the conductor's seat. Tony's Jeep 4 X 4 speeds around the bend and Walter waves him down. SCREEEEECH! Tony slams on the brakes, then reverses and pulls over. He emerges from the 4 X 4 with irritation on full display and paces over to the bicycle. He shakes his head in frustration. Muttering, he returns to the 4 X 4 and drives it into alignment. He steps out and raises the bonnet. The two contraptions face each other nose-to-nose, several feet apart as Tony opens the bonnet. Walter seems to have a little difficulty reaching the engine terminals."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "It is early morning and the desert is quiet except for Marcus' tractor. The Cadillac eventually rolls in, landing beside him. Marcus swings open the front of the tractor, unveiling the fragments of the sand mixer in various discarded shoe boxes. Willie wears a thoughtful smirk. He rubs his chin and snickers as Marcus hurls him an empty blue pirate sack. Marcus glares. Jesse, the janitor, unseals the window and slides it open for Willie and Marcus. They enter dressed in pajamas. Willie hauls the packed sack and appears to be wobbling. As Willie and Marcus shuffle into the library, Gin Slagel cruises by their bikes, carefully sketching their designs. Willie plunks the sack with a soft thump. Willie follows Marcus beneath the Bond-themed mural. Marcus gestures to a chandelier on the floor. He kneels down and hops away. Gin perches at his easel chewing on a pencil stub. Bob Chipeska sits across. A bicycle zooms past, exposing the kid as he bounces toward the playground. Whispering, the six pigeons surround the kid. Willie trails. Willie arrives. He goes up and tries to tug the ribbon, which the laughing Kid pulls away. As Willie tugs him to the fountain and splashes milk over the scrape, the Kid takes great wheezing breaths and finally succeeds to whisper. Willie snatches a lemonade bottle lying open on the table and generously douses some on the scrape. The Kid giggles. Marcus and Willie carry on with the task of being a Santa-Elf brigade. Willie waves off another teenager. Willie glares at him. Marcus returns to the velvet curtain to find Gin Slagel standing motionless. Marcus groans. Gin departs. Willie's gaze doesn't shift from the dot in midair. The Kid turns to skip away. Willie summons him. He reveals a postcard. The Kid's eye is indeed pink and yellow. He reaches shyly up to it. Willie, dreamy, refuses to bite the carrot. Marcus gawks at him. Lois, her expression set in lemony dissatisfaction, spins slowly through a column of hats. She somehow senses his arrival; without bothering to turn around she whispers. Lois is in the captain's chair. Gin's Jeep Wrangler zips around the bend and Marcus signals him down. SCREEEEECH! Gin stomps on the accelerator, then inches back and parks. He steps out of the Wrangler with irritation on full display, and strides over to the tractor. He rubs his chin in disbelief. Muttering, he shuffles back to the Wrangler and parks it in alignment. He steps out and lowers the trunk. The two machines gaze at each other wheel-to-wheel, several feet apart as Gin slides open the trunk. Marcus seems to have a little trouble grabbing the latch handles."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "It's mid-afternoon and the jungle gym is deserted except for Samantha's tractor. The Lamborghini eventually sails in, docking beside her. Samantha flings open the side of the tractor, displaying the pieces of the sky scanner in assorted ornate flower pots. Benny sports a whimsical frown. He nods his feet and snorts as Samantha pitches him an occupied blue penguin crate. Samantha glances. Terry, the gardener, unchains the gate and locks out for Benny and Samantha. They proceed in uniform. Benny drags the empty crate and looks to be gliding. As Benny and Samantha exit the cinema, Rick Dreamer skis by their ships, carefully memorizing their flag numbers. Benny lifts the box with a faint whisper. Benny trails Samantha beside the Fantasy forest. Samantha gestures to a tree stump in the ground. She sits down and rolls in. Rick lounges at her piano tuning out a Davidoff cigarillo. Joe Bramble watches nearby. A bicycle shifts gears, unveiling the dog as it trots toward the beach. Singing, the eight cats surround the dog. Benny chases. Benny departs. He ascends and fails to nudge the paw, which the ecstatic Dog paws away. As Benny pulls him toward the waterfall and pushes rain over the scratch, the Dog takes deep hiccuping gasps and eventually succeeds to bark. Benny snatches an orange juice bottle lying unopened on the table and sparingly splashes some on the paw. The Dog howls. Samantha and Benny discuss the art of being a Reindeer-Snowman duo. Benny sends off another kitten. Benny glances at her. Samantha reappears at the iron fence to find Rick Dreamer waiting joyous-faced. Samantha whistles. Rick vanishes. Benny's nose does not follow the expanse to Jupiter. The Dog spins to stay. Benny shuns him. He unfolds a magazine. The Dog's paw is indeed green and purple. He stretches awkwardly out to it. Benny, nostalgic, avoids to see the catch. Samantha gazes at her. Eric, his feet dressed in sprightly acceptance, dances quickly beside a pile of shoes. He instinctively smells her absence; without trying to shout forward he exclaims. Eric is in the passenger seat. Rick's Tesla Model S races through the intersection and Samantha waves her down. WHOOOOOSH! Rick stomps on the accelerator, then turns forward and stops short. She hops into the Tesla Model S with confusion on low brew, and skips toward the tractor. She nods her feet in approval. Cackling, she climbs back to the Tesla Model S and rolls it into sight. She hops out and lowers the tailgate. The two machines face away from each other trunk-to-trunk, several inches apart as Rick closes the tailgate. Samantha seems to have a little trouble avoiding the power sockets."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In the early morning, Marcus waits in an empty parking lot with his van until a Mercedes arrives beside him. He reveals the components of a water drill hidden in gift boxes to Willie, who chuckles and receives an empty Santa sack. Security guard Jesse opens the store for them as Gin Slagel notes their car tags. Inside, Willie struggles with a heavy sack as Marcus points to an air duct. Gin, meanwhile, reviews their activities. Bob Chipeska is nearby, and a kid approaches the mall, eventually bullied by six others. Willie tends to the kid's injuries despite his protests and continues their work as a Santa-Elf duo. Marcus encounters Gin at the velvet rope, and their interaction ends with Gin leaving. Lois senses Willie's presence as she shops, not acknowledging him. Gin's road rage surfaces when Marcus flags him down, leading to a confrontation. Gin reluctantly aids with vehicle issues as Marcus struggles with battery terminals."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Marcus seems to have a little difficulty reaching the battery terminals The two vehicles face each other nosetonose several feet apart as Gin opens the hood He gets out and raises the hood Grumbling he goes back to the 4 X 4 and drives it into position He shakes his head in disgust He emerges from the 4 X 4 with road rage on full brew and strides over to the van Gin slams on the brakes then backs up and pulls over SCREEEEECH Gin's Ford 4 X 4 speeds around the corner and Marcus flags him down Lois is in the driver's seat she murmurs She somehow senses his presence without bothering to look around Lois her face set in pruney disapproval flips slowly through a rack of furs Marcus stares at him Willie dreamy refuses to take the bait He reaches selfconsciously up to it The Kid's eye is indeed black and blue He displays an envelope Willie beckons him The Kid turns to go Gin leaves Willie's eyes do not leave the spot in space Marcus sighs Marcus returns to the velvet rope to find Gin Slagel waiting stonefaced Willie stares at him Willie sees off another child Marcus and Willie go about the business of being a SantaElf team The Kid shrieks Willie grabs a vodka bottle standing open on the counter and liberally pours some on the hand As Willie drags him to the sink and runs water over the cut the Kid takes great gulping breaths and finally manages to say He goes up and tries to yank the hand which the hysterical Kid yanks away Willie enters Willie follows Cheering the six bullies engulf the kid A bus clears frame revealing the kid as he walks toward the mall Bob Chipeska sits opposite filterless Gin sits at his desk sucking in a Pall Mall He gets up and walks away Marcus points to an air duct in the ceiling Willie follows Marcus behind the Wonderland backdrop Willie drops the bag with a loud thud As Willie and Marcus enter the store Gin Slagel drives by their cars carefully noting their tags Willie lugs the filled sack and seems to be straining They enter in costume Jesse the security guard unlocks the door and opens up for Willie and Marcus Marcus stares He shakes his head and chuckles as Marcus tosses him an empty red Santa sack Willie wears a forbearing smile Marcus throws open the back of the van revealing the components of the water drill in various prop gift boxes The Mercedes eventually pulls in parking beside him It is early morning and the parking lot is empty except for Marcus' van"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Willie lugs the filled sack and seems to be straining Gin sits at his desk sucking in a Pall Mall He shakes his head and chuckles as Marcus tosses him an empty red Santa sack filterless He displays an envelope As Willie drags him to the sink and runs water over the cut the Kid takes great gulping breaths and finally manages to say Marcus and Willie go about the business of being a SantaElf team He gets out and raises the hood Grumbling he goes back to the 4 X 4 and drives it into position Cheering the six bullies engulf the kid Bob Chipeska sits opposite She somehow senses his presence without bothering to look around Lois her face set in pruney disapproval flips slowly through a rack of furs Willie enters The Mercedes eventually pulls in parking beside him Jesse the security guard unlocks the door and opens up for Willie and Marcus Gin slams on the brakes then backs up and pulls over Willie sees off another child SCREEEEECH Willie wears a forbearing smile As Willie and Marcus enter the store Gin Slagel drives by their cars carefully noting their tags The two vehicles face each other nosetonose several feet apart as Gin opens the hood she murmurs It is early morning and the parking lot is empty except for Marcus' van He reaches selfconsciously up to it Marcus stares at him Willie beckons him Gin's Ford 4 X 4 speeds around the corner and Marcus flags him down Willie stares at him The Kid turns to go Marcus sighs Gin leaves Willie's eyes do not leave the spot in space He emerges from the 4 X 4 with road rage on full brew and strides over to the van Marcus throws open the back of the van revealing the components of the water drill in various prop gift boxes Willie grabs a vodka bottle standing open on the counter and liberally pours some on the hand He goes up and tries to yank the hand which the hysterical Kid yanks away Willie follows Marcus behind the Wonderland backdrop They enter in costume He shakes his head in disgust Marcus points to an air duct in the ceiling Willie follows Marcus seems to have a little difficulty reaching the battery terminals A bus clears frame revealing the kid as he walks toward the mall Willie drops the bag with a loud thud He gets up and walks away Lois is in the driver's seat Willie dreamy refuses to take the bait Marcus returns to the velvet rope to find Gin Slagel waiting stonefaced The Kid shrieks Marcus stares The Kid's eye is indeed black and blue"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Willie sees off another child Willie stares at him Marcus returns to the velvet rope to find Gin Slagel waiting stonefaced Marcus sighs Gin leaves Willie's eyes do not leave the spot in space The Kid turns to go Willie beckons him He displays an envelope The Kid's eye is indeed black and blue He reaches selfconsciously up to it Willie dreamy refuses to take the bait Marcus stares at him Lois her face set in pruney disapproval flips slowly through a rack of furs She somehow senses his presence without bothering to look around she murmurs Lois is in the driver's seat Gin's Ford 4 X 4 speeds around the corner and Marcus flags him down SCREEEEECH Gin slams on the brakes then backs up and pulls over He emerges from the 4 X 4 with road rage on full brew and strides over to the van He shakes his head in disgust Grumbling he goes back to the 4 X 4 and drives it into position He gets out and raises the hood The two vehicles face each other nosetonose several feet apart as Gin opens the hood Marcus seems to have a little difficulty reaching the battery terminals It is early morning and the parking lot is empty except for Marcus' van The Mercedes eventually pulls in parking beside him Marcus throws open the back of the van revealing the components of the water drill in various prop gift boxes Willie wears a forbearing smile He shakes his head and chuckles as Marcus tosses him an empty red Santa sack Marcus stares Jesse the security guard unlocks the door and opens up for Willie and Marcus They enter in costume Willie lugs the filled sack and seems to be straining As Willie and Marcus enter the store Gin Slagel drives by their cars carefully noting their tags Willie drops the bag with a loud thud Willie follows Marcus behind the Wonderland backdrop Marcus points to an air duct in the ceiling He gets up and walks away Gin sits at his desk sucking in a Pall Mall filterless Bob Chipeska sits opposite A bus clears frame revealing the kid as he walks toward the mall Cheering the six bullies engulf the kid Willie follows Willie enters He goes up and tries to yank the hand which the hysterical Kid yanks away As Willie drags him to the sink and runs water over the cut the Kid takes great gulping breaths and finally manages to say Willie grabs a vodka bottle standing open on the counter and liberally pours some on the hand The Kid shrieks Marcus and Willie go about the business of being a SantaElf team"
        }
      ]
    }
  ]
}