{
  "ground_truth": "He shifts his gaze up the highway to the north where dark clouds are pushing their way over the distant mountains, signaling a coming storm. Bob reenters the diner to find Kyle at the counter with banana pancakes. Kyle is about to speak to Bob again when Bob's attention is stolen elsewhere. The image flickers on the TV but doesn't improve until Bob gives it a final wallop, and the picture snaps into focus on the stark graphic of the Emergency Broadcasting System, accompanied by its hollow tone, filling the diner. Everyone stops and looks at the TV. Bob switches channels, but they are all the same, leading him to step off the chair and back away as if distance will help. He bumps into Kyle, who hustles past Percy, and Charlie clears dishes at the Anderson's table, while all eyes remain on the TV. Kyle, stewing, picks up the phone to redial, and everyone looks at Howard. Kyle reappears in the diner as Jeep works under a Uhaul's hood outside. An old lady turns to the Andersons as a fly begins to buzz around Gladys's head, smiling strangely. Sandra, unsure of what to make of the response, nods at the old woman as the fly crawls across her cheek without her reacting. Howard and Sandra exchange looks as the door jingles and Jeep enters to have a quiet huddle with Bob, keeping one eye on the old lady near the Andersons. Across the diner, Charlie places a bloody red steak in front of Gladys, resting a hand on her belly. A fly lands on the steak, and Charlie tries to wave it away, but another fly lands in its place, causing Charlie to freeze. Kyle glances over from the counter as Charlie shakes her head at Gladys, slaps the check down on the table, and walks to the kitchen, passing Jeep and Bob. Gladys begins to innocently laugh as she continues eating her meat while flies swarm suddenly, shocking Sandra and Howard as they wonder how so many got in. Sandra covers her mouth, and everyone's focus shifts to the old lady. Howard gets up, and everybody freaks when he crumbles to the floor. Gladys rockets to her feet, knocking her table over with blood covering her face and chest. Percy reacts first, hurling a heavy metal frying pan from behind the counter that knocks Gladys's head sideways.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He alters his stare up the roadway to the north where dim clouds are thrusting their method over the far-off peaks, signaling a forthcoming tempest. Bob reenters the eatery to find Kyle at the bar with plantain flapjacks. Kyle is about to converse with Bob again when Bob's attention is diverted elsewhere. The depiction flickers on the television but doesn't enhance until Bob gives it a final whack, and the picture snaps into clarity on the stark diagram of the Emergency Broadcasting System, accompanied by its hollow tone, filling the diner. Everyone halts and glances at the television. Bob changes channels, but they are all identical, leading him to step off the chair and retreat as if distance will assist. He collides into Kyle, who bustles past Percy, and Charlie clears dishes at the Anderson's table, while all gazes remain on the television. Kyle, brooding, picks up the phone to redial, and everyone glances at Howard. Kyle reappears in the diner as Jeep operates under a Uhaul's hood outside. An elderly lady turns to the Andersons as an insect begins to hum around Gladys's head, smiling oddly. Sandra, unsure of what to make of the answer, nods at the elderly woman as the insect crawls across her cheek without her reacting. Howard and Sandra exchange looks as the door jingles and Jeep enters to have a quiet huddle with Bob, keeping one eye on the elderly lady near the Andersons. Across the diner, Charlie places a bloody crimson steak in front of Gladys, resting a hand on her stomach. An insect lands on the steak, and Charlie tries to wave it away, but another insect lands in its place, causing Charlie to freeze. Kyle glances over from the bar as Charlie shakes her head at Gladys, slaps the bill down on the table, and walks to the kitchen, passing Jeep and Bob. Gladys begins to innocently chuckle as she continues eating her meat while insects swarm suddenly, shocking Sandra and Howard as they wonder how so many got in. Sandra covers her mouth, and everyone's focus shifts to the elderly lady. Howard rises, and everybody panics when he collapses to the floor. Gladys rockets to her feet, knocking her table over with blood covering her face and torso. Percy reacts first, hurling a heavy metallic skillet from behind the bar that knocks Gladys's head sideways."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "His gaze is shifted up the highway to the north where dark clouds push their way over the distant mountains, signaling a coming storm. The diner is reentered by Bob to find Kyle at the counter with banana pancakes. Kyle is about to speak to Bob again when elsewhere steals Bob's attention. The image is flickered on the TV but doesn't improve until a final wallop is given by Bob, snapping the picture into focus on the stark graphic of the Emergency Broadcasting System, accompanied by its hollow tone, filling the diner. The TV is looked at by everyone. The channels are switched by Bob, but they are all the same, leading him to step off the chair and back away as if distance will help. Kyle is bumped into by him, who hustles past Percy, and dishes are cleared by Charlie at the Andersons' table, while all eyes remain on the TV. Kyle, stewing, redials the phone, and Howard is looked at by everyone. The diner is reappeared in by Kyle as Jeep works under a Uhaul's hood outside. The Andersons are turned to by an old lady as a fly buzzes around Gladys's head, smiling strangely. Unsure of what to make of the response, Sandra nods at the old woman as the fly crawls across her cheek without her reacting. Looks are exchanged by Howard and Sandra as the door jingles and Jeep enters to have a quiet huddle with Bob, keeping one eye on the old lady near the Andersons. Across the diner, Gladys is placed with a bloody red steak by Charlie, resting a hand on her belly. A fly lands on the steak, and Charlie tries to wave it away, but another fly lands in its place, causing Charlie to freeze. From the counter, the scene is glanced over by Kyle as Charlie shakes her head at Gladys, slaps the check down on the table, and walks to the kitchen, passing Jeep and Bob. Gladys begins to innocently laugh as her meat is continued to be eaten while flies swarm suddenly, shocking Sandra and Howard, who wonder how so many got in. Her mouth is covered by Sandra, and the old lady is focused on by everyone. Howard gets up, and when the floor is crumbled to by him, everybody freaks. To her feet, Gladys rockets, knocking her table over with her face and chest covered in blood. Percy reacts first, hurling a heavy metal frying pan from behind the counter that knocks Gladys's head sideways."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He looks north up the highway, where dark clouds creep over distant mountains, signaling a storm. Bob returns to the diner and sees Kyle at the counter with banana pancakes. Kyle is about to speak when Bob's attention shifts to the flickering TV, which only clears after Bob hits it, displaying the Emergency Broadcasting System with its hollow tone. Everyone watches the TV. Bob changes channels, but they're identical, so he steps back and bumps into Kyle. Kyle moves past Percy, and Charlie clears dishes while all eyes remain glued to the TV. Kyle, frustrated, redials on the phone, and everyone looks at Howard. Kyle reenters as Jeep works under a Uhaul outside. An old lady turns to the Andersons, as a fly buzzes around and lands on Gladys’s head, crawling across her cheek without reaction. Howard and Sandra exchange glances as Jeep enters for a quiet talk with Bob, keeping an eye on the old lady. Charlie serves a bloody steak to Gladys, resting a hand on her belly. A fly lands on the steak; Charlie waves it away, but another replaces it, making her freeze. Kyle glances over as Charlie shakes her head at Gladys, leaves a check, and heads to the kitchen past Jeep and Bob. Gladys laughs, eating as flies swarm, shocking Sandra and Howard, who wonder how they all got in. Sandra covers her mouth, and the focus shifts to the old lady. Howard stands, then collapses, causing panic. Gladys stands abruptly, knocking her table over, blood covering her face and chest. Percy reacts by throwing a heavy frying pan, hitting Gladys's head."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He shifts his gaze north up the highway toward dark clouds over distant mountains, signaling a storm. Bob reenters the diner, seeing Kyle with banana pancakes at the counter. Kyle's about to speak when Bob's attention is stolen by the flickering TV image, which resolves to the Emergency Broadcasting System, stopping everyone. Bob switches channels, but all are the same, so he steps off the chair, bumping into Kyle, who hustles past Percy. Charlie clears dishes at the Andersons' table; all eyes on the TV. Kyle redials the phone, and everyone looks at Howard. Kyle reappears as Jeep works under a Uhaul outside. An old lady turns to the Andersons as a fly buzzes around Gladys's head, smiling strangely. Sandra nods at her, and the fly crawls across her cheek unnoticed. Howard and Sandra exchange looks when Jeep enters to huddle with Bob, watching the old lady. Across the diner, Charlie puts a bloody steak before Gladys as a fly lands on it, and another replaces it when waved away. Kyle glances over as Charlie shakes her head at Gladys, slaps the check on the table, and heads to the kitchen, passing Jeep and Bob. Gladys laughs while eating as flies swarm, shocking Sandra and Howard, wondering how so many got in. Sandra covers her mouth, and everyone focuses on the old lady. Howard stands, and everyone panics as he crumbles. Gladys jumps up, knocking over her table, blood on her face and chest. Percy hurls a metal frying pan, knocking her head sideways."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He directs his gaze upward toward the stretch of highway leading north, where he observes dark, ominous clouds steadily advancing over the distant range of mountains. These clouds signal the imminent arrival of a fierce storm. Bob, feeling the urgency of the situation, heads back into the diner, where he finds Kyle seated comfortably at the counter, enjoying a plate of golden banana pancakes. Just as Kyle prepares to strike up a conversation with Bob once more, Bob's focus is suddenly drawn elsewhere.\n\nThe flickering, unstable image on the television screen catches his attention. Despite several attempts to clear the image, it remains unsteady until Bob gives it a firm slap, causing the picture to finally snap into clarity. It reveals the stark, unmistakable graphic of the Emergency Broadcasting System, accompanied by its chilling, hollow tone that fills the entire diner, capturing the attention of everyone inside. At this moment, all activities cease as every patron turns to stare at the TV. Bob, hoping for different news, changes channels only to find they all display the same dire message. Feeling an unusual sense of urgency, he steps off the chair and moves backward, as if increasing the physical distance might somehow improve the situation. In doing so, he accidentally bumps into Kyle, who quickly maneuvers around Percy.\n\nMeanwhile, Charlie is busy clearing the dishes from the Andersons' table, yet every patron's gaze remains fixated on the television screen. Kyle, clearly irritated, picks up the phone to retry a call, and everyone around him seems to instinctively look at Howard, seeking reassurance. At this moment, Kyle reappears in the diner, and outside, Jeep is diligently working under the hood of a U-Haul truck. An elderly lady turns to speak to the Andersons just as a pesky fly begins to buzz annoyingly around Gladys's head, though she merely smiles in an oddly unsettling way. Sandra, unsure of how to interpret the old woman's expression, nods in acknowledgment as the fly crawls across her cheek, yet she shows no sign of discomfort.\n\nHoward and Sandra exchange concerned glances as the diner door jingles, announcing Jeep's entrance. He quietly approaches Bob for a discreet conversation, ensuring he keeps a watchful eye on the peculiar old lady near the Andersons. Across the buzzing diner, Charlie places a juicy, blood-red steak in front of Gladys, resting a comforting hand on her own belly. As a fly lands on the steak, Charlie attempts to shoo it away, only for another to promptly take its place, prompting her to pause in her actions. Kyle watches the scene unfold from his vantage point at the counter while Charlie shakes her head in disapproval at Gladys. She slaps the check down on the table with a sense of finality and briskly walks back to the kitchen, passing by Jeep and Bob along the way.\n\nGladys, seemingly unfazed, begins to laugh innocently as she continues eating her meat, even as flies swarm around her with sudden intensity. This sight shocks Sandra and Howard, who are left baffled, wondering how so many flies could have possibly gotten into the diner. Sandra hastily covers her mouth, and everyone's attention shifts squarely onto the enigmatic old lady. Howard rises to his feet, and panic spreads when he suddenly collapses to the floor. In a frenetic response, Gladys springs to her feet, overturning her table, with blood smeared across her face and chest in a gruesome display. Percy is the first to react, grabbing a hefty metal frying pan from behind the counter and hurling it with force at Gladys, causing her head to snap sideways from the impact."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He directs his gaze upward, focusing intently on the expansive stretch of highway that leads northward. There, he observes with growing concern the dark, ominous clouds that are steadily advancing, like a menacing front, over the distant, rugged range of mountains. These foreboding clouds ominously signal the imminent approach of a fierce and potentially dangerous storm. Feeling the pressing urgency of the situation, Bob makes the decision to head back into the bustling diner. Inside, he finds Kyle comfortably seated at the counter, thoroughly enjoying a plate of golden banana pancakes. Just as Kyle is about to engage with Bob in conversation once again, Bob's attention is abruptly drawn elsewhere, diverted by an unexpected distraction.\n\nThe flickering, unstable image on the television screen suddenly catches Bob’s attention. After several attempts to clear the image, it stubbornly remains unsteady, until in a decisive action, Bob gives the set a firm slap. This results in the picture finally snapping into clarity, revealing the stark and unmistakable graphic of the Emergency Broadcasting System. The broadcast is accompanied by a chilling, hollow tone that resonates throughout the entire diner, capturing the complete attention of everyone inside. At this critical moment, all activities cease as each and every patron turns their gaze towards the TV screen. Bob, fervently hoping for different news, changes channels, only to discover that each one uniformly displays the same grim message. Feeling an unusual and heightened sense of urgency, he steps off the chair and moves backward, as if by physically increasing the distance, he might somehow improve the situation. In doing so, he accidentally bumps into Kyle, who quickly maneuvers around Percy to regain his balance.\n\nMeanwhile, Charlie is diligently busy clearing the dishes from the Andersons' table, yet every single patron's gaze remains transfixed, fixated on the television screen. Kyle, clearly growing irritated, picks up the phone with intent to retry a call, and everyone around him seems to instinctively turn their gaze to Howard, seeking some form of reassurance. In this tense moment, Kyle reappears in the diner, and outside, Jeep is seen diligently working under the hood of a U-Haul truck. An elderly lady turns her attention to speak to the Andersons just as a pesky fly begins to buzz annoyingly around Gladys’s head. She merely smiles, but in a way that is oddly unsettling. Sandra, unsure of how to interpret the old woman’s expression, nods in acknowledgment, even as the fly crawls across her cheek, yet she shows no sign of discomfort or irritation.\n\nHoward and Sandra exchange concerned, meaningful glances as the diner door jingles, announcing Jeep’s entrance. He quietly approaches Bob to engage in a discreet conversation, all the while ensuring he keeps a watchful eye on the peculiar old lady seated near the Andersons. Across the buzzing and animated diner, Charlie places a juicy, blood-red steak right in front of Gladys, resting a comforting hand on her own belly. As a fly lands directly on the steak, Charlie attempts to shoo it away, only for another to promptly take its place, prompting her to pause in her actions. Kyle, observing the scene unfold from his vantage point at the counter, watches intently as Charlie shakes her head in clear disapproval at Gladys. She slaps the check down on the table with a sense of finality, then briskly walks back towards the kitchen, passing by both Jeep and Bob along the way.\n\nGladys, seemingly unfazed by the unsettling atmosphere, begins to laugh in a way that seems innocent as she continues eating her meat, even as flies swarm around her with an unexpected intensity. This disturbing sight shocks both Sandra and Howard, leaving them completely baffled as they wonder how so many flies could have possibly infiltrated the diner. Sandra hastily covers her mouth in disbelief, and everyone's attention shifts squarely onto the enigmatic old lady. Howard rises to his feet, and a sense of panic quickly spreads throughout the diner when he suddenly collapses down to the floor. In a frenetic response, Gladys springs to her feet, overturning her table in the process, with blood smeared across her face and chest in a shocking, gruesome display. Percy is the first to react, swiftly grabbing a hefty metal frying pan from behind the counter and hurling it with force at Gladys, causing her head to snap sideways from the impact."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As he stands there, he shifts his gaze upward along the stretch of highway extending northward, where his eyes lock onto dark clouds steadily advancing over the distant mountains—an ominous sign of the storm on the horizon. With this unsettling sight in mind, Bob turns away from the view and reenters the diner. Inside, he finds Kyle perched at the counter, eagerly engaged with a plate of banana pancakes. Kyle seems poised to speak, but before he can utter a word, Bob's attention is abruptly diverted elsewhere. The television screen captures his focus, its image flickering intermittently. He tries to fix it, without improvement, until a decisive wallop from him finally snaps the picture into clear focus, revealing the stark graphic of the Emergency Broadcasting System. This image, paired with its hollow tone, reverberates throughout the diner, causing everyone to freeze and redirect their eyes towards the TV. In an attempt to find normalcy, Bob switches through the channels, only to discover they all display the same broadcast, inducing him to step off the chair and instinctively back away, as if putting distance between himself and the unsettling broadcast would help. In his retreat, he inadvertently bumps into Kyle, who is maneuvering past Percy just as Charlie clears dishes at the Andersons' table. Despite the activity, everyone's attention remains glued to the TV. Feeling frustrated, Kyle picks up the phone and redials, his eyes conveying tension, while everyone else looks expectantly at Howard. In the midst of this tension, Kyle reappears in the scene, while outside, Jeep is focused on working under a Uhaul's hood. Meanwhile, an old lady turns her attention to the Andersons as a fly starts to buzz persistently around Gladys's head. Despite the annoyance, Gladys smiles in a way that seems off. Unsure of how to interpret this interaction, Sandra nods at the old woman, even as the fly lands and crawls across her cheek unheeded. Howard and Sandra exchange perplexed looks just as the door jingles with Jeep's arrival. He quietly pulls Bob aside for a private conversation, all the while keeping a cautious eye on the peculiar old lady near the Andersons. Across the room, Charlie brings a plate featuring a bloody red steak to Gladys, resting her hand on her own belly briefly. As a fly lands on the steak, Charlie waves it away, only for another to settle in its place, making her freeze in response. Observing from the counter, Kyle watches as Charlie gives Gladys a disapproving shake of her head, then decisively slaps the check down on the table and strides towards the kitchen, passing by Jeep and Bob. Meanwhile, Gladys begins to laugh innocently as if unaffected, continuing to eat her meat as an unexpected swarm of flies gathers, startling Sandra and Howard, who are baffled by the sheer number suddenly present. With disbelief etched on her face, Sandra covers her mouth, and the collective focus now centers on the old lady. In a moment fraught with tension, Howard stands up, but chaos erupts when he collapses to the floor, causing panic to ripple through the diner. In a violent frenzy, Gladys shoots to her feet, overturning her table with an alarming display of blood smeared across her face and chest. Acting on instinct, Percy is the first to react, grabbing and hurling a heavy metal frying pan from behind the counter, striking Gladys's head and sending it lurching sideways."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Bob notices dark clouds approaching from the north, indicating an impending storm, and reenters the diner to see Kyle at the counter with banana pancakes. Before Kyle can speak again, Bob's attention shifts to the TV, which displays the Emergency Broadcasting System graphic with its ominous tone. As everyone in the diner turns to the TV, Bob switches channels, but the display remains unchanged, prompting him to step back and inadvertently collide with Kyle, who is trying to make a call. A tense atmosphere fills the diner as Jeep works on a Uhaul outside, and an old lady behaves strangely around the Andersons, drawing Sandra and Howard's attention. Jeep enters and discreetly discusses the situation with Bob while monitoring the old lady. Meanwhile, Charlie serves a steak to Gladys, attempting to swat away the flies that persistently land on it. Kyle notices Charlie's discomfort as she hands Gladys the bill and retreats to the kitchen. Suddenly, Gladys's unsettling laughter and the swarming flies alarm Sandra and Howard, shifting everyone's attention to the old lady. Chaos ensues when Howard collapses, causing everyone to panic as Gladys stands abruptly, blood-spattered and knocking over her table. Percy reacts swiftly by hurling a frying pan, striking Gladys."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He shifts his gaze up the highway to the north where dark clouds, often bringing heavy rains during this season in the region, are pushing their way over the distant mountains, signaling a coming storm. Bob reenters the diner, a local favorite known for its breakfast specials, to find Kyle at the counter with banana pancakes, which are a popular dish here thanks to the fresh bananas sourced from local farms. Kyle is about to speak to Bob again when Bob's attention is stolen elsewhere. The image flickers on the TV, an outdated model notorious for poor reception, but doesn't improve until Bob gives it a final wallop, and the picture snaps into focus on the stark graphic of the Emergency Broadcasting System, a service used to deliver urgent messages to the public, accompanied by its hollow tone, filling the diner. Everyone stops and looks at the TV. Bob switches channels, but they are all the same, alluding to the gravity of the situation, leading him to step off the chair and back away as if distance will help. He bumps into Kyle, who hustles past Percy, the hardworking cook who’s been with the diner for years, and Charlie clears dishes at the Anderson's table, regulars who visit every Sunday morning, while all eyes remain on the TV. Kyle, stewing, picks up the phone to redial, likely trying to reach someone important, and everyone looks at Howard, the diner’s owner, expecting him to take charge. Kyle reappears in the diner as Jeep, known for his mechanical skill, works under a Uhaul's hood outside. An old lady turns to the Andersons as a fly begins to buzz around Gladys's head, smiling strangely, her expression unsettling to the onlookers. Sandra, unsure of what to make of the response, nods at the old woman as the fly crawls across her cheek without her reacting, suggesting her detachment from the commotion. Howard and Sandra exchange looks as the door jingles, a familiar sound in the busy diner, and Jeep enters to have a quiet huddle with Bob, keeping one eye on the old lady near the Andersons, sensing something amiss. Across the diner, Charlie places a bloody red steak, which seems oddly undercooked, in front of Gladys, resting a hand on her belly. A fly lands on the steak, and Charlie tries to wave it away, but another fly lands in its place, causing Charlie to freeze, her instincts warning her of something off. Kyle glances over from the counter as Charlie shakes her head at Gladys, slaps the check down on the table, and walks to the kitchen, passing Jeep and Bob, who are still discussing in hushed tones. Gladys begins to innocently laugh as she continues eating her meat while flies swarm suddenly, shocking Sandra and Howard as they wonder how so many got in, the doors often being kept closed. Sandra covers her mouth, and everyone's focus shifts to the old lady, who remains eerily calm. Howard gets up, and everybody freaks when he crumbles to the floor, a shocking twist that accelerates the tension. Gladys rockets to her feet, knocking her table over with blood covering her face and chest, a sight that freezes the room. Percy reacts first, hurling a heavy metal frying pan from behind the counter that knocks Gladys's head sideways, his quick action driven by instinct and fear."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "while flies swarm suddenly shocking Sandra and Howard as they wonder how so many got in Sandra unsure of what to make of the response nods at the old woman as the fly crawls across her cheek without her reacting He shifts his gaze up the highway to the north where dark clouds are pushing their way over the distant mountains signaling a coming storm Everyone stops and looks at the TV Kyle stewing picks up the phone to redial and everyone looks at Howard Bob reenters the diner to find Kyle at the counter with banana pancakes The image flickers on the TV but does not improve until Bob gives it a final wallop and the picture snaps into focus on the stark graphic of the Emergency Broadcasting System accompanied by its hollow tone filling the diner Howard and Sandra exchange looks as the door jingles and Jeep enters to have a quiet huddle with Bob keeping one eye on the old lady near the Andersons Bob reenters the diner to find Kyle at the counter with banana pancakes Kyle is about to speak to Bob again when Bob's attention is stolen elsewhere The image flickers on the TV but does not improve until Bob gives it a final wallop and the picture snaps into focus on the stark graphic of the Emergency Broadcasting System accompanied by its hollow tone filling the diner Everyone stops and looks at the TV Kyle glances over from the counter as Charlie shakes her head at Bob switches channels but they are all the same leading him to step off the chair and back away as if distance will help He bumps into Kyle who hustles past Percy and Charlie clears dishes at the Anderson's table while all eyes remain on the TV Kyle stewing picks up the phone to redial and everyone looks at Howard Kyle reappears in the diner as Jeep works under a Uhaul's hood outside An old lady turns to the Andersons as a fly begins to buzz around Gladys's head smiling strangely Sandra unsure of what to make of the response nods at the old woman as the fly crawls across her cheek without her reacting Howard and Sandra exchange looks as the door jingles and Jeep enters to have a quiet huddle with Bob keeping one eye on the old lady near the Andersons Kyle reappears in the diner as Jeep works under a Uhaul's hood outside Across the diner Charlie places a bloody red steak in front of Gladys resting a hand on her belly A fly lands on the steak and Charlie tries to wave it away but another fly lands in its place causing Charlie to freeze Kyle glances over from the counter as Charlie shakes her head at Gladys slaps the check down on the table and walks to the kitchen passing Jeep and Bob Gladys begins to innocently laugh as she continues eating her meat He shifts his gaze up the highway to the north where dark clouds are pushing their way over the distant mountains signaling a coming storm Gladys rockets to her feet knocking her table over with blood covering her face and chest while flies swarm suddenly shocking Sandra and Howard as they wonder how so many got in Sandra covers her mouth and everyone is focus shifts to the old lady Howard gets up and everybody freaks when he crumbles to the floor Gladys rockets to her feet knocking her table over with blood covering her face and chest Percy reacts first hurling a heavy metal frying pan from behind the counter that knocks Gladys's head sideways"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He shifts his gaze up the highway to the north where dark clouds are pushing their way over the distant mountains signaling a coming storm. Bob reenters the diner to find Kyle at the counter with banana pancakes. Kyle is about to speak to Bob again when Bob's attention is stolen elsewhere. The image flickers on the TV but does not improve until Bob gives it a final wallop and the picture snaps into focus on the stark graphic of the Emergency Broadcasting System accompanied by its hollow tone filling the diner. Everyone stops and looks at the TV. Bob switches channels but they are all the same leading him to step off the chair and back away as if distance will help. He bumps into Kyle who hustles past Percy and Charlie clears dishes at the Anderson's table while all eyes remain on the TV. Kyle stewing picks up the phone to redial and everyone looks at Howard. Kyle reappears in the diner as Jeep works under a Uhaul's hood outside. An old lady turns to the Andersons as a fly begins to buzz around Gladys's head smiling strangely. Sandra unsure of what to make of the response nods at the old woman as the fly crawls across her cheek without her reacting. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Howard and Sandra exchange looks as the door jingles and Jeep enters to have a quiet huddle with Bob keeping one eye on the old lady near the Andersons. Across the diner Charlie places a bloody red steak in front of Gladys resting a hand on her belly. A fly lands on the steak and Charlie tries to wave it away but another fly lands in its place causing Charlie to freeze. Kyle glances over from the counter as Charlie shakes her head at. Gladys slaps the check down on the table and walks to the kitchen passing Jeep and Bob. Gladys begins to innocently laugh as she continues eating her meat. while flies swarm suddenly shocking Sandra and Howard as they wonder how so many got in. Sandra covers her mouth and everyone is focus shifts to the old lady. Howard gets up and everybody freaks when he crumbles to the floor. Gladys rockets to her feet knocking her table over with blood covering her face and chest. Percy reacts first hurling a heavy metal frying pan from behind the counter that knocks Gladys's head sideways."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He shifts his gaze up the highway to the north where dark clouds are pushing their way over the distant mountains signaling a coming storm. Bob reenters the diner to find Kyle at the counter with banana pancakes. Kyle is about to speak to Bob again when Bob's attention is stolen elsewhere. The image flickers on the TV but does not improve until Bob gives it a final wallop and the picture snaps into focus on the stark graphic of the Emergency Broadcasting System accompanied by its hollow tone filling the diner. Everyone stops and looks at the TV. Bob switches channels but they are all the same leading him to step off the chair and back away as if distance will help. He bumps into Kyle who hustles past Percy and Charlie clears dishes at the Anderson's table while all eyes remain on the TV. Kyle stewing picks up the phone to redial and everyone looks at Howard. Kyle reappears in the diner as Jeep works under a Uhaul's hood outside. An old lady turns to the Andersons as a fly begins to buzz around Gladys's head smiling strangely. Sandra unsure of what to make of the response nods at the old woman as the fly crawls across her cheek without her reacting. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Howard and Sandra exchange looks as the door jingles and Jeep enters to have a quiet huddle with Bob keeping one eye on the old lady near the Andersons. Across the diner Charlie places a bloody red steak in front of Gladys resting a hand on her belly. A fly lands on the steak and Charlie tries to wave it away but another fly lands in its place causing Charlie to freeze. Kyle glances over from the counter as Charlie shakes her head at. Gladys slaps the check down on the table and walks to the kitchen passing Jeep and Bob. Gladys begins to innocently laugh as she continues eating her meat. while flies swarm suddenly shocking Sandra and Howard as they wonder how so many got in. Sandra covers her mouth and everyone is focus shifts to the old lady. Howard gets up and everybody freaks when he crumbles to the floor. Gladys rockets to her feet knocking her table over with blood covering her face and chest. Percy reacts first hurling a heavy metal frying pan from behind the counter that knocks Gladys's head sideways."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He shifts his gaze up the highway to the north where dark clouds are pushing their way over the distant mountains signaling a coming storm. Bob reenters the diner to find Kyle at the counter with banana pancakes. Kyle is about to speak to Bob again when Bob's attention is stolen elsewhere. The image flickers on the TV but does not improve until Bob gives it a final wallop and the picture snaps into focus on the stark graphic of the Emergency Broadcasting System accompanied by its hollow tone filling the diner. Everyone stops and looks at the TV. Bob switches channels but they are all the same leading him to step off the chair and back away as if distance will help. while flies swarm suddenly shocking Sandra and Howard as they wonder how so many got in. Sandra covers her mouth and everyone is focus shifts to the old lady. Howard gets up and everybody freaks when he crumbles to the floor. Gladys rockets to her feet knocking her table over with blood covering her face and chest. Percy reacts first hurling a heavy metal frying pan from behind the counter that knocks Gladys's head sideways."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He shifts his gaze up the highway to the north where dark clouds are pushing their way over the distant mountains signaling a coming storm. Bob reenters the diner to find Kyle at the counter with banana pancakes. Kyle is about to speak to Bob again when Bob's attention is stolen elsewhere. Gladys rockets to her feet knocking her table over with blood covering her face and chest. Percy reacts first hurling a heavy metal frying pan from behind the counter that knocks Gladys's head sideways."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "He shifts his gaze up the highway to the north where dark clouds are pushing their way over the distant mountains, signaling a coming storm. The dog reenters the diner to find a squirrel at the counter with banana pancakes. The squirrel is about to speak to the dog again when the dog’s attention is stolen elsewhere. The image flickers on the TV but doesn't improve until the dog gives it a final wallop, and the picture snaps into focus on the stark graphic of the Emergency Broadcasting System, accompanied by its hollow tone, filling the diner. Everyone stops and looks at the TV. The dog switches channels, but they are all the same, leading it to step off the chair and back away as if distance will help. It bumps into the squirrel, who hustles past a rabbit, and the owl clears dishes at the Anderson's table, while all eyes remain on the TV. The squirrel, stewing, picks up the phone to redial, and everyone looks at a penguin. The squirrel reappears in the diner as a raccoon works under a Uhaul's hood outside. A giraffe turns to the Andersons as a fly begins to buzz around Gladys's head, smiling strangely. A bear, unsure of what to make of the response, nods at the giraffe as the fly crawls across her cheek without her reacting. The penguin and the bear exchange looks as the door jingles and the raccoon enters to have a quiet huddle with the dog, keeping one eye on the giraffe near the Andersons. Across the diner, the owl places a bloody red steak in front of Gladys, resting a hand on her belly. A fly lands on the steak, and the owl tries to wave it away, but another fly lands in its place, causing the owl to freeze. The squirrel glances over from the counter as the owl shakes her head at Gladys, slaps the check down on the table, and walks to the kitchen, passing the raccoon and the dog. Gladys begins to innocently laugh as she continues eating her meat while flies swarm suddenly, shocking the bear and the penguin as they wonder how so many got in. The bear covers her mouth, and everyone's focus shifts to the giraffe. The penguin gets up, and everybody freaks when it crumbles to the floor. Gladys rockets to her feet, knocking her table over with blood covering her face and chest. A rabbit reacts first, hurling a heavy metal frying pan from behind the counter that knocks Gladys's head sideways."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He shifts his gaze up the runway to the north where dark clouds are pushing their way over the distant hills, signaling a coming storm. Bob reenters the café to find Kyle at the counter with blueberry muffins. Kyle is about to speak to Bob again when Bob's attention is stolen elsewhere. The image flickers on the radio but doesn't improve until Bob gives it a final smack, and the sound snaps into focus on the stark graphic of the Emergency Alarm System, accompanied by its hollow tone, filling the café. Everyone stops and looks at the radio. Bob switches stations, but they are all the same, leading him to step off the stool and back away as if distance will help. He bumps into Kyle, who hustles past Percy, and Charlie clears mugs at the Johnson's table, while all eyes remain on the radio. Kyle, stewing, picks up the tablet to redial, and everyone looks at Howard. Kyle reappears in the café as Jeep works under a tractor's hood outside. An old lady turns to the Johnsons as a bee begins to buzz around Gladys's head, smiling strangely. Sandra, unsure of what to make of the response, nods at the old woman as the bee crawls across her cheek without her reacting. Howard and Sandra exchange looks as the door jingles and Jeep enters to have a quiet huddle with Bob, keeping one eye on the old lady near the Johnsons. Across the café, Charlie places a rare lamb chop in front of Gladys, resting a hand on her belly. A bee lands on the chop, and Charlie tries to wave it away, but another bee lands in its place, causing Charlie to freeze. Kyle glances over from the counter as Charlie shakes her head at Gladys, slaps the bill down on the table, and walks to the pantry, passing Jeep and Bob. Gladys begins to innocently laugh as she continues eating her meal while bees swarm suddenly, shocking Sandra and Howard as they wonder how so many got in. Sandra covers her mouth, and everyone's focus shifts to the old lady. Howard gets up, and everybody freaks when he collapses to the floor. Gladys rockets to her feet, knocking her chair over with jam covering her face and chest. Percy reacts first, hurling a heavy metal skillet from behind the counter that knocks Gladys's head sideways."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He averts his gaze down the highway to the south where fluffy clouds are drifting their way over the distant mountains, hinting at a clear evening. Bob exits the diner to spot Kyle at the counter with banana pancakes. Kyle is about to gesture to Bob again when Bob's attention is attracted elsewhere. The image dances on the TV but doesn't stabilize until Bob offers it a gentle pat, and the picture jumps into focus on the vivid graphic of the Emergency Broadcasting System, accompanied by its hollow tone, echoing through the diner. Everyone pauses and gazes at the TV. Bob changes channels, but they are all the same, prompting him to climb off the chair and drift away as if distance will help. He collides with Kyle, who strolls past Percy, and Charlie arranges dishes at the Anderson's table, while all eyes continue on the TV. Kyle, fuming, lifts the phone to reattempt, and everyone turns to Howard. Kyle vanishes from the diner as Jeep inspects under a Uhaul's hood outside. An old lady nods to the Andersons as a fly starts to circle around Gladys's head, grinning oddly. Sandra, unsure of what to make of the reaction, gestures at the old woman as the fly dances across her cheek without her flinching. Howard and Sandra share looks as the door chimes and Jeep enters to have a quick huddle with Bob, keeping one eye on the old lady near the Andersons. Across the diner, Charlie serves a juicy red steak in front of Gladys, resting a hand on her lap. A fly lands on the steak, and Charlie tries to shoo it away, but another fly lands in its place, causing Charlie to pause. Kyle peers over from the counter as Charlie nods her head at Gladys, taps the check down on the table, and strolls to the kitchen, passing Jeep and Bob. Gladys begins to softly giggle as she continues savoring her meat while flies gather suddenly, startling Sandra and Howard as they puzzle over how so many arrived. Sandra covers her mouth, and everyone's focus turns to the old lady. Howard stands up, and everybody panics when he drops to the floor. Gladys leaps to her feet, overturning her table with blood covering her face and chest. Percy reacts first, tossing a hefty metal frying pan from behind the counter that nudges Gladys's head sideways."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The bookshelf shifts its gaze up the staircase to the east where golden balloons are pushing their way over the distant skyscrapers, signaling a coming parade. The pineapple reenters the bakery to find the cactus at the bench with cherry waffles. The cactus is about to speak to the pineapple again when the pineapple's attention is stolen elsewhere. The mirror flickers on the ceiling but doesn't improve until the pineapple gives it a final wallop, and the picture snaps into focus on the colorful poster of the Adventure Gaming System, accompanied by its melodic chime, filling the bakery. Everyone stops and looks at the ceiling. The pineapple switches lights, but they are all the same, leading it to step off the carpet and back away as if distance will help. It bumps into the cactus, who hustles past the giraffe, and the elephant clears books at the hamster's shelf, while all eyes remain on the ceiling. The cactus, stewing, picks up the remote to redial, and everyone looks at the flamingo. The cactus reappears in the bakery as the bicycle works under a motorcycle's hood outside. A young boy turns to the hamsters as a bee begins to buzz around the dragonfly's head, smiling strangely. The robot, unsure of what to make of the response, nods at the young boy as the bee crawls across its wing without it reacting. The flamingo and the robot exchange looks as the window jingles and the bicycle enters to have a quiet huddle with the pineapple, keeping one eye on the young boy near the hamsters. Across the bakery, the elephant places a shiny silver teapot in front of the dragonfly, resting a hand on its knee. A bee lands on the teapot, and the elephant tries to wave it away, but another bee lands in its place, causing the elephant to freeze. The cactus glances over from the bench as the elephant shakes its head at the dragonfly, slaps the map down on the shelf, and walks to the garden, passing the bicycle and the pineapple. The dragonfly begins to innocently laugh as it continues sipping its tea while bees swarm suddenly, shocking the robot and the flamingo as they wonder how so many got in. The robot covers its antenna, and everyone's focus shifts to the young boy. The flamingo gets up, and everybody freaks when it crumbles to the rug. The dragonfly rockets to its wings, knocking its shelf over with powder covering its wings and thorax. The giraffe reacts first, hurling a heavy golden trumpet from behind the bench that knocks the dragonfly's wings sideways."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "She directs her eyes up the freeway to the south where bright clouds are floating their way over the nearby hills, indicating a departing storm. Jill exits the bakery to find Mark at the register with chocolate waffles. Mark is about to gesture to Jill again when Jill's focus is captured elsewhere. The sound crackles on the radio but doesn't stabilize until Jill gives it a final smack, and the signal locks into clarity on the vivid alert of the Weather Alert System, accompanied by its hollow beep, filling the bakery. Everyone pauses and listens to the radio. Jill switches stations, but they are all the same, prompting her to jump off the bench and move forward as if closeness will assist. She collides with Mark, who rushes past Terry, and Sam arranges pastries at the Walker's booth, while all ears remain tuned to the radio. Mark, thinking hard, reaches for the tablet to send a message, and everyone listens to Jerry. Mark reappears in the bakery as Van tinkers with a truck's engine outside. An elderly man turns to the Walkers as a butterfly begins to flutter around Doris's hat, grinning oddly. Laura, unsure of what to make of the signal, agrees with the elderly man as the butterfly lands on her shoulder without her flinching. Jerry and Laura exchange nods as the curtain flaps and Van enters to have a brief meeting with Jill, keeping one ear on the elderly man near the Walkers. Across the bakery, Sam places a vivid green salad in front of Doris, patting a hand on her hip. A butterfly settles on the salad, and Sam attempts to shoo it, but another butterfly alights in its spot, causing Sam to pause. Mark peers over from the register as Sam shakes her head at Doris, slams the order slip down on the booth, and walks to the pantry, bypassing Van and Jill. Doris begins to gleefully chuckle as she continues tasting her greens while butterflies swarm unexpectedly, startling Laura and Jerry as they ponder how so many arrived. Laura covers her ears, and everyone's attention shifts to the elderly man. Jerry stands up, and everybody panics when he collapses to the ground. Doris propels herself to her feet, overturning her booth with green dressing covering her face and shirt. Terry acts first, flinging a heavy ceramic mug from behind the register that knocks Doris's hat sideways."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He glances down the river to the south where bright balloons are drifting their way over the nearby forests, indicating a coming festival. Bob exits the bakery to discover Kyle at the booth with apple waffles. Kyle is about to gesture to Bob again when Bob's interest is captured elsewhere. The image blurs on the radio but doesn't clarify until Bob gives it a final shake, and the sound pops into clarity on the cheerful music of the Jazz Hour, accompanied by its lively tune, filling the bakery. Everyone pauses and listens to the radio. Bob changes stations, but they are all identical, prompting him to step off the stool and sidle sideways as if closeness will help. He collides with Kyle, who scurries past Percy, and Charlie collects cups at the Green's booth, while all ears remain on the radio. Kyle, brooding, grabs the remote to rewind, and everyone glances at Howard. Kyle reemerges in the bakery as Jeep tinkers under a tractor's hood outside. An elderly man turns to the Greens as a moth begins to flutter around Gladys's ear, grinning mysteriously. Sandra, unsure how to interpret the interaction, waves at the elderly man as the moth flits across her ear without her noticing. Howard and Sandra swap glances as the door swings and Jeep enters to have a silent chat with Bob, keeping one eye on the elderly man beside the Greens. Across the bakery, Charlie places a frosted chocolate cake in front of Gladys, resting a hand on her shoulder. A moth lands on the cake, and Charlie tries to blow it away, but another moth lands in its place, causing Charlie to pause. Kyle peers over from the counter as Charlie nods at Gladys, slams the menu down on the booth, and strolls to the pantry, passing Jeep and Bob. Gladys begins to quietly hum as she continues savoring her cake while moths gather suddenly, surprising Sandra and Howard as they ponder how so many got in. Sandra covers her eyes, and everyone's focus shifts to the elderly man. Howard stands up, and everybody panics when he slips to the ground. Gladys springs to her feet, toppling her booth over with frosting covering her hands and shirt. Percy reacts first, tossing a large ceramic vase from behind the counter that spins Gladys's head sideways."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Dagny lowers her gaze down the river to the west where glowing stars are twirling their paths under the nearby skyscrapers, hinting at a looming festival. Max exits the bakery to find Jamie at the fountain with avocado omelets. Jamie is about to whistle to Max again when Max's curiosity is captured anywhere else. The sound blares on the radio but doesn't stabilize until Max gives it a final twist, and the tune bursts into clarity on the bright illustration of the Weather Alert System, accompanied by its shrill jingle, invading the bakery. Everyone pauses and listens to the radio. Max flips stations, but they are all identical, prompting him to hop off the stool and edge away as if space will assist. He brushes against Jamie, who scurries past Tilly, and Bruno stacks books at the Nelson's lounge, while all ears remain on the radio. Jamie, simmering, puts down the pencil to rewire, and everyone stares at Gerald. Jamie reappears in the bakery as Scooter toils under a tractor's engine nearby. An elder gentleman turns to the Nelsons as a wasp begins to zoom near Dot's nose, chuckling oddly. Grace, uncertain of how to interpret the answer, shakes her head at the elder chap as the wasp tiptoes across her hand without her noticing. Gerald and Grace trade glances as the bell tolls and Scooter enters to hold a muted confab with Max, keeping one ear on the elder gentleman close to the Nelsons. Beyond the bakery, Bruno delivers a steaming hot pie before Dot, laying a finger on her pocket. A wasp perches on the pie, and Bruno tries to brush it off, but another wasp takes its place, causing Bruno to halt. Jamie peeks over from the fountain as Bruno nods at Dot, slaps the bill on the counter, and strolls to the pantry, passing Scooter and Max. Dot begins to quietly giggle as she continues savoring her pastry while wasps swarm abruptly, startling Grace and Gerald as they ponder how so many emerged. Grace shields her nose, and everyone's concern pivots to the elder gentleman. Gerald rises, and everybody panics when he topples to the ground. Dot leaps to her toes, overturning her bench with berries covering her chin and sleeves. Tilly responds first, launching a bulky wooden spoon from behind the fountain that turns Dot’s ear sideways."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Bob notices a storm brewing in the north as he reenters the diner, where Kyle sits with banana pancakes. A flickering TV demands Bob's attention, showing the Emergency Broadcasting System alert, drawing all eyes. Kyle tries redialing a phone while an old lady, with flies buzzing around her, watches. Jeep enters for a quiet discussion with Bob. Charlie serves a bloody steak to Gladys, noticing flies that she cannot shoo away. Gladys, laughing innocently, eats her meal amidst a thickening swarm of flies, alarming Sandra and Howard. When Howard collapses, the situation erupts as Gladys stands, covered in blood, before Percy hurls a frying pan at her."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Percy reacts first hurling a heavy metal frying pan from behind the counter that knocks Gladys's head sideways Gladys rockets to her feet knocking her table over with blood covering her face and chest Howard gets up and everybody freaks when he crumbles to the floor Sandra covers her mouth and everyone is focus shifts to the old lady while flies swarm suddenly shocking Sandra and Howard as they wonder how so many got in Gladys begins to innocently laugh as she continues eating her meat Gladys slaps the check down on the table and walks to the kitchen passing Jeep and Bob Kyle glances over from the counter as Charlie shakes her head at A fly lands on the steak and Charlie tries to wave it away but another fly lands in its place causing Charlie to freeze Across the diner Charlie places a bloody red steak in front of Gladys resting a hand on her belly Howard and Sandra exchange looks as the door jingles and Jeep enters to have a quiet huddle with Bob keeping one eye on the old lady near the Andersons Sandra unsure of what to make of the response nods at the old woman as the fly crawls across her cheek without her reacting An old lady turns to the Andersons as a fly begins to buzz around Gladys's head smiling strangely Kyle reappears in the diner as Jeep works under a Uhaul's hood outside Kyle stewing picks up the phone to redial and everyone looks at Howard He bumps into Kyle who hustles past Percy and Charlie clears dishes at the Anderson's table while all eyes remain on the TV Bob switches channels but they are all the same leading him to step off the chair and back away as if distance will help Everyone stops and looks at the TV The image flickers on the TV but does not improve until Bob gives it a final wallop and the picture snaps into focus on the stark graphic of the Emergency Broadcasting System accompanied by its hollow tone filling the diner Kyle is about to speak to Bob again when Bob's attention is stolen elsewhere Bob reenters the diner to find Kyle at the counter with banana pancakes He shifts his gaze up the highway to the north where dark clouds are pushing their way over the distant mountains signaling a coming storm"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Percy reacts first hurling a heavy metal frying pan from behind the counter that knocks Gladys's head sideways Bob switches channels but they are all the same leading him to step off the chair and back away as if distance will help Kyle is about to speak to Bob again when Bob's attention is stolen elsewhere Gladys slaps the check down on the table and walks to the kitchen passing Jeep and Bob An old lady turns to the Andersons as a fly begins to buzz around Gladys's head smiling strangely Across the diner Charlie places a bloody red steak in front of Gladys resting a hand on her belly Gladys begins to innocently laugh as she continues eating her meat Howard gets up and everybody freaks when he crumbles to the floor He bumps into Kyle who hustles past Percy and Charlie clears dishes at the Anderson's table while all eyes remain on the TV A fly lands on the steak and Charlie tries to wave it away but another fly lands in its place causing Charlie to freeze Sandra covers her mouth and everyone is focus shifts to the old lady Kyle glances over from the counter as Charlie shakes her head at Sandra unsure of what to make of the response nods at the old woman as the fly crawls across her cheek without her reacting Bob reenters the diner to find Kyle at the counter with banana pancakes Howard and Sandra exchange looks as the door jingles and Jeep enters to have a quiet huddle with Bob keeping one eye on the old lady near the Andersons Everyone stops and looks at the TV while flies swarm suddenly shocking Sandra and Howard as they wonder how so many got in Kyle stewing picks up the phone to redial and everyone looks at Howard Kyle reappears in the diner as Jeep works under a Uhaul's hood outside He shifts his gaze up the highway to the north where dark clouds are pushing their way over the distant mountains signaling a coming storm The image flickers on the TV but does not improve until Bob gives it a final wallop and the picture snaps into focus on the stark graphic of the Emergency Broadcasting System accompanied by its hollow tone filling the diner Gladys rockets to her feet knocking her table over with blood covering her face and chest"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Howard and Sandra exchange looks as the door jingles and Jeep enters to have a quiet huddle with Bob keeping one eye on the old lady near the Andersons Across the diner Charlie places a bloody red steak in front of Gladys resting a hand on her belly A fly lands on the steak and Charlie tries to wave it away but another fly lands in its place causing Charlie to freeze Kyle glances over from the counter as Charlie shakes her head at Gladys slaps the check down on the table and walks to the kitchen passing Jeep and Bob Gladys begins to innocently laugh as she continues eating her meat while flies swarm suddenly shocking Sandra and Howard as they wonder how so many got in Sandra covers her mouth and everyone is focus shifts to the old lady Howard gets up and everybody freaks when he crumbles to the floor Gladys rockets to her feet knocking her table over with blood covering her face and chest Percy reacts first hurling a heavy metal frying pan from behind the counter that knocks Gladys's head sideways He shifts his gaze up the highway to the north where dark clouds are pushing their way over the distant mountains signaling a coming storm Bob reenters the diner to find Kyle at the counter with banana pancakes Kyle is about to speak to Bob again when Bob's attention is stolen elsewhere The image flickers on the TV but does not improve until Bob gives it a final wallop and the picture snaps into focus on the stark graphic of the Emergency Broadcasting System accompanied by its hollow tone filling the diner Everyone stops and looks at the TV Bob switches channels but they are all the same leading him to step off the chair and back away as if distance will help He bumps into Kyle who hustles past Percy and Charlie clears dishes at the Anderson's table while all eyes remain on the TV Kyle stewing picks up the phone to redial and everyone looks at Howard Kyle reappears in the diner as Jeep works under a Uhaul's hood outside An old lady turns to the Andersons as a fly begins to buzz around Gladys's head smiling strangely Sandra unsure of what to make of the response nods at the old woman as the fly crawls across her cheek without her reacting"
        }
      ]
    }
  ]
}