{
  "ground_truth": "Impossibly, Gladys is still standing. She lets out an inhuman scream and scrambles across the diner, knocking tables and chairs over in her wake. Bob pulls a shotgun from behind the counter, and Gladys smiles sweetly before slapping him clear across the room. The shotgun clatters to the floor at Jeep's feet, and he snatches it up and aims at Gladys, who turns calmly to face him. Jeep is about to fire when the old lady's eyes go all white, and he freezes, stunned by her words, overwhelmed with fear that paralyzes him. Gladys rockets straight at him, but Jeep is too afraid to move and clamps his eyes shut, bracing for the end. A rain of bullets rip into Gladys, taking her down like an animal. Jeep slowly opens his eyes, his gun still cocked, and sees Gladys lying dead in a smoldering, bloody heap at his feet. He turns to see Kyle with smoke rising from the barrel of his silver-plated Western Arms 45. Sandra is on the floor with her husband, blood pouring freely from his neck. Kyle stares at the dying man, hesitates for a moment, and then rushes to help. Obeying, she cups her hands over the hole in his neck, desperately trying to stop the flow of blood leaking out between her fingers. Percy scrambles over with a first-aid kit, and together he and Kyle get to work on Howard's neck. A few feet away, Charlie helps Bob, bruised and bleeding, to his feet. Kyle shoots him a look, and they realize it's pedal-to-the-floor time for the eighty miles ahead. Audrey leans forward from the back seat. Up ahead, the dark clouds Jeep saw earlier have closed in, descending onto the highway like a wall. They are black and undulating, and suddenly hundreds of tiny bugs begin to hit the windshield. That's when they realize those aren't clouds. The Escalade enters the swarm, and the car is pummeled by insects, the windshield instantly covered in black and red bug guts. Bob is hunched over the steaming sink, pounding a can of light beer. Jeep is leaning against the wall, looking as if he's about to puke or faint, and Bob, noticing Jeep trembling, rests a hand on his shoulder but cannot get the words out. Before Jeep can respond, they hear the sound of the front door. Bob and Jeep appear from the back as Kyle, Percy, Audrey, and Sandra carry Howard into the diner, all of them stumbling and gasping for air, while Charlie moves in to help and Percy races for the back. Bob, Kyle, and Jeep quickly drag Gladys's body, wrapped in the plastic tablecloth, a short way from the diner, warily eyeing the curtain of flies no more than a hundred yards out.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Inconceivably, Gladys remains upright. She emits an unearthly shriek and scrambles across the eatery, overturning tables and chairs in her path. Bob draws a shotgun from behind the counter, and Gladys grins sweetly before striking him clear across the room. The shotgun clatters to the floor at Jeep's feet, and he snatches it up and aims at Gladys, who turns serenely to face him. Jeep is about to discharge when the elderly woman's eyes become entirely white, and he freezes, stunned by her utterances, overwhelmed with terror that incapacitates him. Gladys rockets directly at him, but Jeep is too frightened to move and shuts his eyes, bracing for the conclusion. A barrage of bullets tears into Gladys, bringing her down like a creature. Jeep slowly opens his eyes, his firearm still cocked, and perceives Gladys lying lifeless in a smoldering, bloody pile at his feet. He turns to see Kyle with smoke rising from the barrel of his silver-plated Western Arms .45. Sandra is on the floor with her spouse, blood pouring freely from his neck. Kyle gazes at the dying man, hesitates briefly, and then hurries to assist. Obeying, she cups her hands over the wound in his neck, desperately attempting to halt the flow of blood seeping out between her fingers. Percy scrambles over with a first-aid kit, and together he and Kyle get to work on Howard's neck. A few feet away, Charlie assists Bob, bruised and bleeding, to his feet. Kyle shoots him a look, and they realize it's pedal-to-the-metal time for the eighty miles ahead. Audrey leans forward from the back seat. Up ahead, the dark clouds Jeep observed earlier have closed in, descending onto the highway like a barricade. They are black and undulating, and suddenly hundreds of tiny bugs begin to strike the windshield. That's when they realize those aren't clouds. The Escalade enters the swarm, and the vehicle is pummeled by insects, the windshield instantly covered in black and red bug entrails. Bob is hunched over the steaming sink, pounding a can of light beer. Jeep is leaning against the wall, appearing as if he's about to vomit or faint, and Bob, noticing Jeep trembling, places a hand on his shoulder but cannot get the words out. Before Jeep can respond, they hear the noise of the front door. Bob and Jeep emerge from the back as Kyle, Percy, Audrey, and Sandra carry Howard into the diner, all of them stumbling and gasping for air, while Charlie moves in to assist and Percy dashes for the back. Bob, Kyle, and Jeep quickly drag Gladys's corpse, wrapped in the plastic tablecloth, a short way from the diner, cautiously eyeing the curtain of flies no more than a hundred yards out."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Impossibly, Gladys is still standing. An inhuman scream is let out by her, and the diner is scrambled across, with tables and chairs being knocked over in her wake. A shotgun is pulled by Bob from behind the counter, and Gladys smiles sweetly before slapping him clear across the room. The shotgun is clattered to the floor at Jeep's feet, and it is snatched up and aimed at Gladys, who turns calmly to face him. Jeep is about to fire when the old lady's eyes go all white, and her words stun him, overwhelming him with fear that paralyzes him. Gladys rockets straight at him, but fear paralyzes Jeep, and his eyes are clamped shut by him, bracing for the end. Gladys is ripped into by a rain of bullets, taking her down like an animal. Jeep slowly opens his eyes, his gun still cocked, and sees her lying dead in a smoldering, bloody heap at his feet. Kyle is turned to by him, and he sees smoke rising from the barrel of Kyle's silver-plated Western Arms 45. Sandra is found on the floor with her husband, blood pouring freely from his neck. Kyle stares at the dying man, hesitates for a moment, and then he rushes to help. A command is obeyed by her, as she cups her hands over the hole in his neck, her fingers desperately trying to stop the flow of blood leaking out. Percy scrambles over with a first-aid kit, and Howard's neck is worked on by him and Kyle together. A few feet away, Bob, bruised and bleeding, is helped to his feet by Charlie. A look is shot by Kyle, and they realize it's pedal-to-the-floor time for the eighty miles ahead. Audrey leans forward from the back seat. Up ahead, the dark clouds Jeep saw earlier have closed in, descending onto the highway like a wall. Black and undulating, hundreds of tiny bugs suddenly begin to hit the windshield. That's when the realization comes to them: those aren't clouds. The Escalade enters the swarm, and insects pummel the car, covering the windshield instantly in black and red bug guts. Bob is hunched over the steaming sink, pounding a can of light beer. The wall is leaned against by Jeep, looking as if he's about to puke or faint, and noticing Jeep trembling, Bob rests a hand on his shoulder but cannot get the words out. Before Jeep can respond, the sound of the front door is heard by them. Bob and Jeep appear from the back as Howard is carried into the diner by Kyle, Percy, Audrey, and Sandra, all of them stumbling and gasping for air, while Charlie moves in to help and Percy races for the back. Gladys's body, wrapped in the plastic tablecloth, is quickly dragged by Bob, Kyle, and Jeep a short way from the diner, warily eyeing the curtain of flies no more than a hundred yards out."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Impossibly, Gladys is still standing. She screams, scrambles across the diner, and knocks over tables and chairs. Bob grabs a shotgun, but Gladys slaps him across the room. The shotgun lands at Jeep's feet, and he aims it at Gladys, who turns to face him. Jeep is about to fire when her eyes turn white, paralyzing him with fear. Gladys rockets at him, but he freezes, bracing for the end. Bullets rip into Gladys, taking her down. Jeep opens his eyes, seeing Gladys dead at his feet, and Kyle holding a smoking silver-plated Western Arms 45. Sandra is on the floor, tending to her husband bleeding from the neck. Percy rushes over with a first-aid kit to help Kyle with Howard's neck. Nearby, Charlie helps a bruised Bob. Kyle signals it's time to go, and Audrey leans forward from the back seat. Dark clouds descend on the highway, and bugs hit the windshield. Realizing they aren't clouds, the Escalade enters the swarm, covering the windshield in insect guts. Bob pounds a beer over the steaming sink as Jeep looks sick. Bob touches his shoulder, but before Jeep responds, they hear the front door. Bob and Jeep join Kyle, Percy, Audrey, and Sandra carrying Howard into the diner, gasping for air. Charlie helps, and Percy races to the back. Bob, Kyle, and Jeep drag Gladys's body, wrapped in plastic, away from the diner, wary of the fly curtain nearby."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Incredibly, Gladys is still upright, screaming as she knocks over diner tables. Bob grabs a shotgun, but Gladys slaps him across the room. The shotgun lands at Jeep's feet. He aims at Gladys, but freezes when her eyes turn white. Just as Gladys attacks, bullets bring her down. Jeep, gun still cocked, sees Gladys dead and Kyle with a smoking barrel. Sandra is tending to her bleeding husband, Howard, as Kyle joins her. Percy brings a first-aid kit to help, while Charlie aids Bob to his feet. Kyle signals they must drive the eighty miles ahead. Audrey spots dark clouds, which turn into a swarm of bugs. The Escalade is covered in insect guts. Bob, by the sink, drinks beer as Jeep looks sick. They then hear the front door. Bob and Jeep see Kyle’s group carrying Howard inside, gasping for air, while Percy runs back. The group drags Gladys's wrapped body away from the diner, cautiously eyeing the nearby flies."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In a manner that seems utterly impossible, Gladys remains upright and standing. She emits an otherworldly, inhuman scream as she frantically scrambles across the diner, knocking over tables and chairs in her chaotic path. Bob, reacting quickly, pulls a shotgun from its place behind the counter. In response, Gladys offers him a deceptively sweet smile before violently slapping him, sending him flying clear across the room. The shotgun slips from Bob's grasp and clatters noisily to the floor right at Jeep's feet. Without hesitation, Jeep quickly snatches it up, aiming directly at Gladys, who turns with an eerie calmness to face him. Just as Jeep is about to fire, the old lady's eyes turn completely white, and he is so stunned by her cryptic words that he is paralyzed by an overwhelming fear. As Gladys rockets directly toward him, Jeep is gripped by terror, unable to move, and clamps his eyes shut, bracing himself for what he is certain is the end. A sudden barrage of bullets pierces Gladys, taking her down as if she were nothing more than an animal. Slowly, Jeep opens his eyes, his gun still cocked, and sees Gladys lying dead in front of him, reduced to a smoldering, bloody heap at his feet. He turns to see Kyle, standing with smoke rising ominously from the barrel of his silver-plated Western Arms 45. Nearby, Sandra is on the floor with her husband, blood gushing freely from the wound on his neck. Kyle stares at the dying man, hesitating briefly, then springs into action to help. Following his lead, Sandra cups her hands over the wound, desperately trying to staunch the flow of blood that is leaking out between her trembling fingers. Percy scrambles over with a first-aid kit in hand, and together he and Kyle begin administering aid to Howard's grievous neck injury. Just a few feet away, Charlie assists a bruised and bleeding Bob to his feet. Kyle shoots Charlie a knowing look, and they both understand it's time to hit the gas, pedal-to-the-floor, for the daunting eighty miles still ahead. Audrey leans forward from her seat in the back. Up ahead, the ominous dark clouds that Jeep had seen earlier have now closed in, descending ominously onto the highway like a solid wall. These clouds are black and undulating, and suddenly hundreds of tiny bugs begin to pelter against the windshield. That's when they come to the chilling realization that these are not clouds at all. The Escalade drives directly into the swarm, and the vehicle is relentlessly pummeled by insects, leaving the windshield instantly smeared with black and red bug guts. Meanwhile, Bob is hunched over the steaming sink, pounding a can of light beer. Jeep leans against the wall, looking as though he might either puke or faint at any moment, and Bob notices Jeep trembling. He rests a comforting hand on Jeep's shoulder but finds himself unable to find the right words. Before Jeep can respond, they hear the sound of the front door opening. Both Bob and Jeep emerge from the back as Kyle, Percy, Audrey, and Sandra, carrying Howard among them, stagger into the diner, all of them stumbling and gasping desperately for air. Charlie rushes in to assist, while Percy races toward the back. Bob, Kyle, and Jeep quickly set to work, dragging Gladys's body, now wrapped in a plastic tablecloth, a short distance away from the diner, all the while warily eyeing the curtain of flies that looms just a mere hundred yards out."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In an incomprehensible and bewildering manner that defies belief, Gladys somehow remains upright and standing, an extraordinary feat given the circumstances. She emits a scream that is utterly otherworldly, piercing the air with an inhuman quality as she frantically scrambles across the diner. In her chaotic path, she knocks over tables and chairs, creating a scene of disarray. Reacting with impressive speed, Bob hastily pulls a shotgun from its designated spot behind the counter. In a shocking response, Gladys gives him a deceptively sweet smile before unleashing a violent slap that sends him flying clear across the room. The shotgun slips from Bob's grasp and crashes noisily to the floor, landing directly at Jeep's feet. Without a moment's hesitation, Jeep swiftly snatches it up, aiming directly at Gladys. She turns to face him with an eerie, unsettling calmness. Just as Jeep is about to fire, the old lady's eyes turn completely white, and he is so stunned by her cryptic words that he is paralyzed by an overwhelming fear. Jeep is gripped by terror, rooted to the spot, unable to move, clamping his eyes shut and bracing himself for what he is certain is the end. In a sudden and unexpected turn of events, a barrage of bullets pierces Gladys, taking her down as if she were nothing more than an animal. Slowly, Jeep opens his eyes, his gun still at the ready, and sees Gladys lying dead in front of him, reduced to a smoldering, bloody heap at his feet. He turns to see Kyle standing with a smoking silver-plated Western Arms 45 in his hand. Nearby, Sandra is on the floor beside her husband, blood seeping freely from the wound on his neck. Kyle stares at the dying man, hesitating briefly before springing into action to help. Following his lead, Sandra cups her hands over the wound, desperately struggling to staunch the flow of blood that is leaking out through her trembling fingers. Percy scrambles over with a first-aid kit in hand, and together, he and Kyle begin administering aid to Howard's severe neck injury. Just a few feet away, Charlie assists a bruised and bleeding Bob to his feet. Kyle shoots Charlie a knowing look, and they both understand that it's time to put the pedal to the metal for the daunting eighty miles still ahead. Audrey leans forward from her seat in the back, peering out the windshield. Up ahead, the ominous dark clouds that Jeep had seen earlier have now closed in, descending menacingly onto the highway like a solid wall. These clouds are black and undulating, and suddenly hundreds of tiny bugs begin to pelt against the windshield. That's when they come to the chilling, horrifying realization that these are not clouds at all. The Escalade drives directly into the swarm, and the vehicle is relentlessly pounded by insects, leaving the windshield instantly smeared with black and red bug guts. Meanwhile, Bob is hunched over the steaming sink, pounding a can of light beer. Jeep leans against the wall, looking as though he might either puke or faint at any given moment. Bob notices Jeep trembling and rests a comforting hand on Jeep's shoulder but finds himself unable to find the right words. Before Jeep can respond, they hear the sound of the front door swinging open. Both Bob and Jeep emerge from the back as Kyle, Percy, Audrey, and Sandra, carrying Howard among them, stagger into the diner, all of them stumbling and gasping desperately for air. Charlie rushes in to lend a hand, while Percy races toward the back. Bob, Kyle, and Jeep quickly set to work, dragging Gladys's lifeless body, now wrapped in a plastic tablecloth, a short distance away from the diner. All the while, they warily eye the ominous curtain of flies that looms just a mere hundred yards out."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Incredibly, Gladys remains on her feet, defying expectations, and suddenly emits a scream that doesn't seem human. She propels herself across the diner with frantic energy, her body colliding with tables and chairs, sending them crashing to the floor in her path. Observing the chaos, Bob reaches behind the counter and retrieves a shotgun, preparing to confront the threat. As he does so, Gladys halts momentarily, flashes him a sweet smile that belies her intentions, and then with a swift, forceful motion, she sends him flying across the room with a slap. The shotgun slips from his grasp and lands with a clatter at Jeep’s feet, who quickly bends down, seizes it, and raises the weapon to aim steadily at Gladys. As Gladys turns to face him, exhibiting an eerie calmness, Jeep braces to fire. However, just as he steadies himself, Gladys's eyes turn completely white, an unsettling sight that leaves him rooted to the spot, her chilling words rendering him motionless and gripped by a paralyzing fear. Gladys, undeterred by his hesitation, rushes toward Jeep with alarming speed, but he remains frozen in terror, his eyes shut tightly as he prepares for the impending doom. Unexpectedly, a barrage of bullets penetrates Gladys, each one impacting with vicious force, and she falls to the ground, reduced to a lifeless, smoldering heap, her body lying bloody and still at Jeep’s feet. Jeep slowly opens his eyes, the shock still visible on his face, his fingers still poised on the cocked gun, now realizing the immediate danger has passed. He looks across the room and spots Kyle, who is holding a smoking silver-plated Western Arms 45, the barrel emitting wisps of smoke from the recent discharge. Meanwhile, Sandra is slumped on the floor, desperately tending to her husband, blood gushing from a vicious wound in his neck. Kyle, momentarily frozen as he processes the scene, then springs into action to assist. Sandra, responding to Kyle's instructions, applies pressure with her hands over the wound, her fingers desperately trying to stem the flow of blood, which stubbornly seeps through. Percy quickly arrives with a first-aid kit and, together with Kyle, begins urgent efforts to treat Howard's neck injury. Nearby, Charlie assists Bob, who is visibly bruised and bleeding, helping him unsteadily to his feet. Kyle exchanges a knowing glance with Bob, indicating that they must hasten their pace for the remaining eighty miles, urgency seeping into their every move. In the vehicle, Audrey leans forward from the back seat, her attention drawn to the ominous clouds ahead. These dark clouds, spotted earlier by Jeep, now engulf the highway, black and undulating, like a barrier descending ominously. Suddenly, countless tiny bugs begin colliding against the windshield, each impact spreading more of the inky substance across the glass. It becomes horrifyingly clear that these aren't clouds at all as the Escalade plows into the thick swarm, the car continuously battered by the insects, the windshield rapidly becoming smeared with the black and red remnants of their bodies. Meanwhile, Bob hunches over the diner’s sink, the steam rising around him as he pounds back a can of light beer, an attempt to calm his nerves. Jeep stands nearby, leaning against the wall with a pallor that suggests he might either vomit or faint, his body visibly trembling. Bob, noticing his distress, places a reassuring hand on Jeep’s shoulder, attempting to offer comfort, but words fail him. Before Jeep can articulate a response, the sound of the front door opening draws their attention. Bob and Jeep emerge from the back area just as Kyle, Percy, Audrey, and Sandra struggle to carry Howard into the diner, each of them gasping for breath and stumbling under his weight. Charlie rushes forward to lend his aid, while Percy hurries to the back in search of additional assistance. Bob, Kyle, and Jeep swiftly band together to drag Gladys’s body, now enshrouded in a plastic tablecloth, a short distance away from the diner, their eyes cautiously monitoring the intimidating curtain of flies hovering no more than a hundred yards away."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Impossibly, Gladys remains standing, letting out an inhuman scream as she rushes through the diner, disrupting tables and chairs. Bob retrieves a shotgun from behind the counter, but Gladys swiftly knocks him across the room. Jeep seizes the fallen shotgun and aims at Gladys, who turns to face him. Just as he’s about to fire, her eyes turn white, leaving him paralyzed with fear. As Gladys charges at Jeep, he braces for impact, but a hail of bullets strikes her down. Jeep opens his eyes to find Gladys dead at his feet and turns to see Kyle with smoke rising from his silver-plated Western Arms 45. Sandra is on the floor beside her husband, trying desperately to stop the bleeding from his neck. Percy arrives with a first-aid kit, and he and Kyle work together to tend to Howard. Nearby, Charlie assists Bob in getting to his feet. Kyle signals to him, and they understand it's time to hurry for the eighty-mile drive ahead. In the Escalade, Audrey notices the dark clouds descending onto the highway, soon realizing they are swarms of bugs that pummel the car, covering it in black and red remains. Meanwhile, Bob leans over the sink with a beer, while Jeep, looking ill, leans against the wall. Bob places a comforting hand on Jeep's shoulder before they hear the front door. As Kyle, Percy, Audrey, Sandra, and the others struggle inside, carrying an injured Howard, Charlie rushes to assist, and Percy heads to the back. Bob, Kyle, and Jeep quickly move Gladys's wrapped body a short distance from the diner, cautiously watching the swarm of flies nearby."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Impossibly, Gladys, who had been a regular at this small-town diner known for its homemade pies, is still standing. She lets out an inhuman scream, reminiscent of horror film banshees, and scrambles across the diner, knocking tables and chairs over in her wake. Bob, a former military man with a stoic demeanor, pulls a shotgun from behind the counter, and Gladys smiles sweetly before slapping him clear across the room with strength that defies her frail appearance. The shotgun clatters to the floor at Jeep's feet, and he snatches it up and aims at Gladys, who turns calmly to face him with a sense of eerie confidence. Jeep is about to fire when the old lady's eyes go all white, like a character possessed in a ghost story, and he freezes, stunned by her words, overwhelmed with fear that paralyzes him. Gladys rockets straight at him, but Jeep is too afraid to move and clamps his eyes shut, bracing for what he believes is the end. A rain of bullets, fired from the quick hands of an experienced marksman, rip into Gladys, taking her down like an animal. Jeep slowly opens his eyes, his gun still cocked, and sees Gladys lying dead in a smoldering, bloody heap at his feet. He turns to see Kyle, a sharpshooter with a notorious reputation, with smoke rising from the barrel of his silver-plated Western Arms 45, a gun model often favored for its reliability and power. Sandra is on the floor with her husband, blood pouring freely from his neck, a visceral reminder of how quickly a life can hang in the balance. Kyle stares at the dying man, hesitates for a moment, and then rushes to help, his instincts as a former EMT kicking in. Obeying, she cups her hands over the hole in his neck, desperately trying to stop the flow of blood leaking out between her fingers as if she were trying to hold back time itself. Percy scrambles over with a first-aid kit, reminiscent of those carried by battlefield medics, and together he and Kyle get to work on Howard's neck. A few feet away, Charlie helps Bob, bruised and bleeding, to his feet, displaying the camaraderie often forged in crisis. Kyle shoots him a look, and they realize it's pedal-to-the-floor time for the eighty-mile sprint to the nearest hospital, a distance that suddenly feels insurmountable. Audrey leans forward from the back seat, her eyes scanning the horizon for any signs of danger. Up ahead, the dark clouds Jeep saw earlier have closed in, descending onto the highway like a wall, reminiscent of apocalyptic storm fronts found in folklore. They are black and undulating, and suddenly hundreds of tiny bugs, a plague-like swarm, begin to hit the windshield. That's when they realize those aren't clouds. The Escalade enters the swarm, and the car is pummeled by insects, the windshield instantly covered in black and red bug guts, a scene right out of an environmental disaster movie. Bob is hunched over the steaming sink, pounding a can of light beer, seeking solace in its familiar taste. Jeep is leaning against the wall, looking as if he's about to puke or faint, his nerves shot from the unrelenting chaos, and Bob, noticing Jeep trembling, rests a hand on his shoulder but cannot get the words out, the gravity of the moment hanging in the air. Before Jeep can respond, they hear the sound of the front door. Bob and Jeep appear from the back as Kyle, Percy, Audrey, and Sandra carry Howard into the diner, all of them stumbling and gasping for air, while Charlie moves in to help and Percy races for the back, their every movement a desperate bid for survival. Bob, Kyle, and Jeep quickly drag Gladys's body, wrapped in the plastic tablecloth, often used for spirited family gatherings, a short way from the diner, warily eyeing the curtain of flies no more than a hundred yards out, as if daring the ominous swarm to come closer."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Impossibly Gladys is still standing. She let us out an inhuman scream and scrambles across the diner knocking tables and chairs over in her wake. Bob pulls a shotgun from behind the counter and Gladys smiles sweetly before slapping him clear across the room. The shotgun clatters to the floor at Jeep's feet and he snatches it up and aims at Gladys who turns calmly to face him. Jeep is about to fire when the old lady's eyes go all white and he freezes stunned by her words overwhelmed with fear that paralyzes him. Gladys rockets straight at him but Jeep is too afraid to move and clamps his eyes shut bracing for the end. A rain of bullets rip into Gladys taking her down like an animal. Jeep slowly opens his eyes his gun still cocked and sees Gladys lying dead in a smoldering bloody heap at his feet. He turns to see Kyle with smoke rising from the barrel of his silverplated Western Arms 45. Sandra is on the floor with her husband blood pouring freely from his neck. Kyle stares at the dying man hesitates for a moment and then rushes to help. Obeying she cups her hands over the hole in his neck desperately trying to stop the flow of blood leaking out between her fingers. Percy scrambles over with a firstaid kit and together he and Kyle get to work on Howard's neck. A few feet away Charlie helps Bob bruised and bleeding to his feet. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Kyle shoots him a look and they realize it is pedaltothefloor time for the eighty miles ahead. Audrey leans forward from the back seat. Up ahead the dark clouds Jeep saw earlier have closed in descending onto the highway like a wall. They are black and undulating and suddenly hundreds of tiny bugs begin to hit the windshield. That is when they realize those are not clouds. The Escalade enters the swarm and the car is pummeled by insects. the windshield instantly covered in black and red bug guts. Bob is hunched over the steaming sink pounding a can of light beer. Jeep is leaning against the wall looking as if he is about to puke or faint and Bob noticing. Jeep trembling rests a hand on his shoulder but cannot get the words out. Before Jeep can respond they hear the sound of the front door. Bob and Jeep appear from the back as Kyle Percy. Audrey and Sandra carry Howard into the diner all of them stumbling and gasping for air while Charlie moves in to help and Percy races for the back. Bob Kyle and Jeep quickly drag Gladys's body wrapped in the plastic tablecloth a short way from the diner warily eyeing the curtain of flies no more than a hundred yards out."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Impossibly Gladys is still standing. She let us out an inhuman scream and scrambles across the diner knocking tables and chairs over in her wake. Bob pulls a shotgun from behind the counter and Gladys smiles sweetly before slapping him clear across the room. The shotgun clatters to the floor at Jeep's feet and he snatches it up and aims at Gladys who turns calmly to face him. Jeep is about to fire when the old lady's eyes go all white and he freezes stunned by her words overwhelmed with fear that paralyzes him. Gladys rockets straight at him but Jeep is too afraid to move and clamps his eyes shut bracing for the end. A rain of bullets rip into Gladys taking her down like an animal. Jeep slowly opens his eyes his gun still cocked and sees Gladys lying dead in a smoldering bloody heap at his feet. He turns to see Kyle with smoke rising from the barrel of his silverplated Western Arms 45. Sandra is on the floor with her husband blood pouring freely from his neck. Kyle stares at the dying man hesitates for a moment and then rushes to help. Obeying she cups her hands over the hole in his neck desperately trying to stop the flow of blood leaking out between her fingers. Percy scrambles over with a firstaid kit and together he and Kyle get to work on Howard's neck. A few feet away Charlie helps Bob bruised and bleeding to his feet. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. Kyle shoots him a look and they realize it is pedaltothefloor time for the eighty miles ahead. Audrey leans forward from the back seat. Up ahead the dark clouds Jeep saw earlier have closed in descending onto the highway like a wall. They are black and undulating and suddenly hundreds of tiny bugs begin to hit the windshield. That is when they realize those are not clouds. The Escalade enters the swarm and the car is pummeled by insects. the windshield instantly covered in black and red bug guts. Bob is hunched over the steaming sink pounding a can of light beer. Jeep is leaning against the wall looking as if he is about to puke or faint and Bob noticing. Jeep trembling rests a hand on his shoulder but cannot get the words out. Before Jeep can respond they hear the sound of the front door. Bob and Jeep appear from the back as Kyle Percy. Audrey and Sandra carry Howard into the diner all of them stumbling and gasping for air while Charlie moves in to help and Percy races for the back. Bob Kyle and Jeep quickly drag Gladys's body wrapped in the plastic tablecloth a short way from the diner warily eyeing the curtain of flies no more than a hundred yards out."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Impossibly Gladys is still standing. She let us out an inhuman scream and scrambles across the diner knocking tables and chairs over in her wake. Bob pulls a shotgun from behind the counter and Gladys smiles sweetly before slapping him clear across the room. The shotgun clatters to the floor at Jeep's feet and he snatches it up and aims at Gladys who turns calmly to face him. Jeep is about to fire when the old lady's eyes go all white and he freezes stunned by her words overwhelmed with fear that paralyzes him. Gladys rockets straight at him but Jeep is too afraid to move and clamps his eyes shut bracing for the end. A rain of bullets rip into Gladys taking her down like an animal. Bob is hunched over the steaming sink pounding a can of light beer. Jeep is leaning against the wall looking as if he is about to puke or faint and Bob noticing. Jeep trembling rests a hand on his shoulder but cannot get the words out. Before Jeep can respond they hear the sound of the front door. Bob and Jeep appear from the back as Kyle Percy. Audrey and Sandra carry Howard into the diner all of them stumbling and gasping for air while Charlie moves in to help and Percy races for the back. Bob Kyle and Jeep quickly drag Gladys's body wrapped in the plastic tablecloth a short way from the diner warily eyeing the curtain of flies no more than a hundred yards out."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Impossibly Gladys is still standing. She let us out an inhuman scream and scrambles across the diner knocking tables and chairs over in her wake. Bob pulls a shotgun from behind the counter and Gladys smiles sweetly before slapping him clear across the room. Bob and Jeep appear from the back as Kyle Percy. Audrey and Sandra carry Howard into the diner all of them stumbling and gasping for air while Charlie moves in to help and Percy races for the back. Bob Kyle and Jeep quickly drag Gladys's body wrapped in the plastic tablecloth a short way from the diner warily eyeing the curtain of flies no more than a hundred yards out."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Unbelievably, Marvin is still kneeling. He lets out a melodic whistle and glides across the playground, upending seesaws and swings in his path. Tina draws a water pistol from under the picnic blanket, and Marvin grins mischievously before tickling her entirely over the sandbox. The water pistol bounces to the ground at Zebra's paws, and she scoops it up and points it at Marvin, who revolves peacefully to greet her. Zebra is set to squirt when the young jester's ears turn all blue, and she pauses, mesmerized by his lyrics, engulfed with dread that immobilizes her. Marvin darts directly at her, but Zebra is too scared to react and squeezes her eyes shut, preparing for the finale. A gust of petals pelt into Marvin, bringing him down like a statue. Zebra slowly lifts her gaze, her water pistol still aimed, and sees Marvin resting lifeless in a crumpled, leafy pile at her paws. She glances over to see Leo with blossoms drifting from the rim of his golden trumpet. Emily is sprawled on the tiles with her partner, petals falling freely from his head. Leo gazes at the wilting figure, pauses for an instant, then dashes to assist. Complying, she places her palms over the gap in his head, fervently attempting to halt the cascade of petals spilling out between her digits. Felix shuffles over with a toolbox, and collectively he and Leo get to work on Oliver's head. A few steps away, Todd aids Tina, scratched and aching, to her knees. Leo shoots him a glance, and they comprehend it's sprint-to-the-end time for the sixty leagues ahead. Nora leans backward from the window seat. Far ahead, the bright blimps Zebra noticed earlier have closed in, hovering over the runway like a curtain. They are white and fluttering, and abruptly thousands of tiny feathers begin to stick to the windshield. That's when they realize those aren't blimps. The limousine enters the flurry, and the vehicle is bombarded by feathers, the windshield swiftly masked in white and yellow fluff. Tina is perched over the sizzling stove, gulping a glass of iced tea. Zebra is perched against the door, appearing as if she's about to giggle or dance, and Tina, observing Zebra trembling, pats a wing on her elbow but cannot form the sentences. Before Zebra can reply, they hear the chime of the cellar door. Tina and Zebra emerge from the front as Leo, Felix, Nora, and Emily haul Oliver into the playground, all of them tripping and gasping for breath, while Todd rushes in to join, and Felix dashes for the front. Tina, Leo, and Zebra promptly haul Marvin's figure, cloaked in the woven picnic basket, a tiny distance from the playground, cautiously watching the veil of petals no more than two hundred feet away."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Gladys unleashes a scream and causes chaos in the diner, knocking over tables. Bob grabs a shotgun, but she knocks him aside. As Jeep aims the gun, he's paralyzed with fear by Gladys's white eyes. Just as Gladys lunges, a barrage of bullets brings her down. Jeep opens his eyes to find Gladys dead, and sees Kyle holding a smoking gun. Sandra is on the floor with her husband Howard, blood gushing from his neck. Kyle rushes to help, while Percy brings a first-aid kit to assist. Charlie aids the injured Bob, and with Kyle’s prompt, they prepare for the challenging drive ahead. As they head out, dark clouds ahead turn out to be a swarm of insects that cover their car's windshield. Bob and Jeep, shaken, hear the others returning to the diner, struggling with Howard. The group, wary of the fly swarm outside, drags Gladys's body away from the diner."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Bob Kyle and Jeep quickly drag Gladys's body wrapped in the plastic tablecloth a short way from the diner warily eyeing the curtain of flies no more than a hundred yards out Audrey and Sandra carry Howard into the diner all of them stumbling and gasping for air while Charlie moves in to help and Percy races for the back Bob and Jeep appear from the back as Kyle Percy Before Jeep can respond they hear the sound of the front door Jeep trembling rests a hand on his shoulder but cannot get the words out Jeep is leaning against the wall looking as if he is about to puke or faint and Bob noticing Bob is hunched over the steaming sink pounding a can of light beer the windshield instantly covered in black and red bug guts The Escalade enters the swarm and the car is pummeled by insects That is when they realize those are not clouds They are black and undulating and suddenly hundreds of tiny bugs begin to hit the windshield Up ahead the dark clouds Jeep saw earlier have closed in descending onto the highway like a wall Audrey leans forward from the back seat Kyle shoots him a look and they realize it is pedaltothefloor time for the eighty miles ahead A few feet away Charlie helps Bob bruised and bleeding to his feet Percy scrambles over with a firstaid kit and together he and Kyle get to work on Howard's neck Obeying she cups her hands over the hole in his neck desperately trying to stop the flow of blood leaking out between her fingers Kyle stares at the dying man hesitates for a moment and then rushes to help Sandra is on the floor with her husband blood pouring freely from his neck He turns to see Kyle with smoke rising from the barrel of his silverplated Western Arms 45 Jeep slowly opens his eyes his gun still cocked and sees Gladys lying dead in a smoldering bloody heap at his feet A rain of bullets rip into Gladys taking her down like an animal Gladys rockets straight at him but Jeep is too afraid to move and clamps his eyes shut bracing for the end Jeep is about to fire when the old lady's eyes go all white and he freezes stunned by her words overwhelmed with fear that paralyzes him The shotgun clatters to the floor at Jeep's feet and he snatches it up and aims at Gladys who turns calmly to face him Bob pulls a shotgun from behind the counter and Gladys smiles sweetly before slapping him clear across the room She let us out an inhuman scream and scrambles across the diner knocking tables and chairs over in her wake Impossibly Gladys is still standing"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "She let us out an inhuman scream and scrambles across the diner knocking tables and chairs over in her wake Impossibly Gladys is still standing The shotgun clatters to the floor at Jeep's feet and he snatches it up and aims at Gladys who turns calmly to face him Bob pulls a shotgun from behind the counter and Gladys smiles sweetly before slapping him clear across the room Gladys rockets straight at him but Jeep is too afraid to move and clamps his eyes shut bracing for the end Jeep is about to fire when the old lady's eyes go all white and he freezes stunned by her words overwhelmed with fear that paralyzes him Jeep slowly opens his eyes his gun still cocked and sees Gladys lying dead in a smoldering bloody heap at his feet A rain of bullets rip into Gladys taking her down like an animal Sandra is on the floor with her husband blood pouring freely from his neck He turns to see Kyle with smoke rising from the barrel of his silverplated Western Arms 45 Obeying she cups her hands over the hole in his neck desperately trying to stop the flow of blood leaking out between her fingers Kyle stares at the dying man hesitates for a moment and then rushes to help A few feet away Charlie helps Bob bruised and bleeding to his feet Percy scrambles over with a firstaid kit and together he and Kyle get to work on Howard's neck Audrey leans forward from the back seat Kyle shoots him a look and they realize it is pedaltothefloor time for the eighty miles ahead They are black and undulating and suddenly hundreds of tiny bugs begin to hit the windshield Up ahead the dark clouds Jeep saw earlier have closed in descending onto the highway like a wall The Escalade enters the swarm and the car is pummeled by insects That is when they realize those are not clouds Bob is hunched over the steaming sink pounding a can of light beer the windshield instantly covered in black and red bug guts Jeep trembling rests a hand on his shoulder but cannot get the words out Jeep is leaning against the wall looking as if he is about to puke or faint and Bob noticing Bob and Jeep appear from the back as Kyle Percy Before Jeep can respond they hear the sound of the front door Bob Kyle and Jeep quickly drag Gladys's body wrapped in the plastic tablecloth a short way from the diner warily eyeing the curtain of flies no more than a hundred yards out Audrey and Sandra carry Howard into the diner all of them stumbling and gasping for air while Charlie moves in to help and Percy races for the back"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Kyle shoots him a look and they realize it is pedaltothefloor time for the eighty miles ahead Audrey leans forward from the back seat Up ahead the dark clouds Jeep saw earlier have closed in descending onto the highway like a wall They are black and undulating and suddenly hundreds of tiny bugs begin to hit the windshield That is when they realize those are not clouds The Escalade enters the swarm and the car is pummeled by insects the windshield instantly covered in black and red bug guts Bob is hunched over the steaming sink pounding a can of light beer Jeep is leaning against the wall looking as if he is about to puke or faint and Bob noticing Jeep trembling rests a hand on his shoulder but cannot get the words out Before Jeep can respond they hear the sound of the front door Bob and Jeep appear from the back as Kyle Percy Audrey and Sandra carry Howard into the diner all of them stumbling and gasping for air while Charlie moves in to help and Percy races for the back Bob Kyle and Jeep quickly drag Gladys's body wrapped in the plastic tablecloth a short way from the diner warily eyeing the curtain of flies no more than a hundred yards out Impossibly Gladys is still standing She let us out an inhuman scream and scrambles across the diner knocking tables and chairs over in her wake Bob pulls a shotgun from behind the counter and Gladys smiles sweetly before slapping him clear across the room The shotgun clatters to the floor at Jeep's feet and he snatches it up and aims at Gladys who turns calmly to face him Jeep is about to fire when the old lady's eyes go all white and he freezes stunned by her words overwhelmed with fear that paralyzes him Gladys rockets straight at him but Jeep is too afraid to move and clamps his eyes shut bracing for the end A rain of bullets rip into Gladys taking her down like an animal Jeep slowly opens his eyes his gun still cocked and sees Gladys lying dead in a smoldering bloody heap at his feet He turns to see Kyle with smoke rising from the barrel of his silverplated Western Arms 45 Sandra is on the floor with her husband blood pouring freely from his neck Kyle stares at the dying man hesitates for a moment and then rushes to help Obeying she cups her hands over the hole in his neck desperately trying to stop the flow of blood leaking out between her fingers Percy scrambles over with a firstaid kit and together he and Kyle get to work on Howard's neck A few feet away Charlie helps Bob bruised and bleeding to his feet"
        }
      ]
    }
  ]
}