{
  "ground_truth": "A dark, bloody shoe steps out from the ice cream truck, and the camera moves up the long grey pant leg spotted with blood stains to reveal a skeletally thin man in tattered coveralls. As he steps into the beams of the headlights, he becomes more clearly visible; he's tall. He surveys the diner, the garage, and the roof, assessing the situation. On the roof, the men wait for something to happen. That's when the ice cream man's jaw unhinges and stretches, causing everyone except Michael to practically hyperventilate with fear. The ice cream man bolts for the diner with startling speed, his movements resembling those of a human insect. Michael aims and bullets rip into the creature's body, knocking him flat on his back, with arms and legs in a twisted, twitching mess. Michael keeps his aim. A rumbling of engines and headlights follow as a freeway full of vehicles of every variety punches through a wall of dust, racing toward the diner. Vehicles swerve and collide, and dark shapes bolt from the burning vehicles, scattering. Suddenly Howard's body is torn away from Sandra as something grabs his legs, waking Sandra and causing her to scream and hold on. Charlie and Audrey rush to Sandra's side, grabbing Howard's arms, with Jeep right behind them, ready to fire at the creature but unable to get a clear shot because the women are in the way. He discards the gun and helps grab Howard's arms as Howard screams and his body is torturously stretched in a human tug-of-war, lurching further out the window. Kyle looks around the roof with alarm as only a few more inches separate Charlie from certain death through the window, and Jeep is losing her. Charlie and Jeep fall back into the diner, with claw-like hands still grasping Charlie's arms, no longer attached to their owners. Michael leaps over her, wielding a butcher's knife in one hand and a machine gun in the other, as the window blinds turn into a wall of fire. Charlie flings the severed appendages off her, and she and Jeep scoot away from the window. Hysterical, Sandra tries to push past Michael to go after Howard, but he intercepts her before she can make it out. Sandra frantically slaps at Michael as he carries her away from the window and thrusts her down into a back booth. She's about to say something when Kyle rushes into the room with a smile on his face, but his excitement falls when he notices the broken window and takes in the room. Bob grabs Kyle's arm, and all eyes turn to Michael. Michael looks squarely at Percy, as Bob stares at him, uncertain how to respond, and Charlie reacts in shock as all eyes suddenly turn to her.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A dim, crimson shoe steps out from the frozen dessert vehicle, and the lens shifts up the lengthy ashen trouser limb dotted with gore marks to disclose a gauntly emaciated individual in ragged overalls. As he steps into the beams of the headlights, he becomes more distinctly visible; he's towering. He examines the eatery, the workshop, and the rooftop, evaluating the scenario. On the rooftop, the men await something to occur. That's when the frozen dessert man's jaw unhinges and elongates, causing everyone except Michael to nearly hyperventilate with terror. The frozen dessert man dashes for the eatery with astonishing swiftness, his motions resembling those of a human insect. Michael targets and projectiles tear into the entity's form, knocking him flat on his back, with limbs in a contorted, twitching chaos. Michael maintains his aim. A rumbling of motors and headlights follow as a highway full of conveyances of every kind punches through a barrier of dust, racing toward the eatery. Conveyances swerve and crash, and dim figures dash from the blazing conveyances, scattering. Suddenly Howard's form is torn away from Sandra as something seizes his legs, waking Sandra and causing her to shriek and hold on. Charlie and Audrey rush to Sandra's side, seizing Howard's arms, with Jeep right behind them, prepared to fire at the entity but unable to get a clear shot because the women are in the way. He discards the firearm and helps seize Howard's arms as Howard screams and his form is agonizingly stretched in a human tug-of-war, lurching further out the window. Kyle looks around the rooftop with alarm as only a few more inches separate Charlie from certain demise through the window, and Jeep is losing her. Charlie and Jeep fall back into the eatery, with claw-like hands still clutching Charlie's arms, no longer attached to their owners. Michael leaps over her, wielding a cleaver in one hand and a submachine gun in the other, as the window blinds transform into a barrier of flame. Charlie flings the severed limbs off her, and she and Jeep scoot away from the window. Hysterical, Sandra tries to push past Michael to go after Howard, but he intercepts her before she can make it out. Sandra frantically slaps at Michael as he carries her away from the window and thrusts her down into a rear booth. She's about to say something when Kyle rushes into the room with a grin on his face, but his excitement diminishes when he notices the shattered window and takes in the room. Bob grabs Kyle's arm, and all eyes turn to Michael. Michael looks squarely at Percy, as Bob stares at him, uncertain how to respond, and Charlie reacts in shock as all eyes suddenly turn to her."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A dark, bloody shoe is stepped out from by the ice cream truck, and the long grey pant leg spotted with blood stains is moved up by the camera to reveal a skeletally thin man in tattered coveralls. As the beams of the headlights are stepped into by him, he is made more clearly visible; he’s tall. The diner, the garage, and the roof are surveyed by him, assessing the situation. On the roof, they wait for something to happen. That’s when his jaw is unhinged and stretched, causing everyone except Michael to practically hyperventilate with fear. The diner is bolted for by the ice cream man with startling speed, his movements resembling those of a human insect. Michael aims and rips bullets into the creature’s body, knocking him flat on his back, with arms and legs in a twisted, twitching mess. His aim is kept by Michael. Engines rumble and headlights follow as a freeway full of vehicles of every variety punches through a wall of dust, racing toward the diner. They swerve and collide, and the burning vehicles are bolted from by dark shapes, scattering. Suddenly, something grabs Howard's legs, tearing his body away from Sandra, waking Sandra and causing her to scream and hold on. Charlie and Audrey rush to Sandra’s side, grabbing Howard’s arms, with Jeep right behind them, ready to fire at the creature but unable to get a clear shot because they are in the way. The gun is discarded by him, and Howard’s arms are helped grab as Howard screams and his body is torturously stretched in a human tug-of-war, lurching further out the window. Kyle looks around the roof with alarm as only a few more inches separate Charlie from certain death through the window, and she is lost by Jeep. Back into the diner, Charlie and Jeep fall, with claw-like hands still grasping Charlie’s arms, no longer attached to their owners. Her is leaped over by Michael, wielding a butcher’s knife in one hand and a machine gun in the other, as the window blinds turn into a wall of fire. The severed appendages are flung off her by Charlie, and away from the window she and Jeep scoot. Hysterical, the attempt to push past Michael to go after Howard is made by Sandra, but before she can make it out she is intercepted by him. Frantically, Michael is slapped at by Sandra as he carries her away from the window and thrusts her down into a back booth. She’s about to say something when the room is rushed into by Kyle with a smile on his face, but when he notices the broken window and takes in the room, his excitement falls. Bob grabs Kyle’s arm, and all eyes turn to Michael. Michael looks squarely at Percy, as Bob stares at him, uncertain how to respond, and shockingly, Charlie reacts as all eyes suddenly turn to her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A dark, bloody shoe emerges from the ice cream truck, revealing a skeletally thin man in blood-stained, tattered coveralls. As he steps into the headlights, his tall figure becomes clear. He surveys the diner, garage, and roof. On the roof, men wait tensely. The ice cream man's jaw unhinges, causing panic, except for Michael. The ice cream man charges the diner with insect-like speed. Michael fires, hitting the creature, leaving it twitching on the ground. Engines rumble as vehicles race toward the diner, swerving and colliding. Dark shapes scatter from burning vehicles. Howard is suddenly pulled away from Sandra, who screams. Charlie, Audrey, and Jeep rush to help, but Jeep can't shoot because the women block her. Jeep drops the gun to help pull Howard back. Kyle, alarmed, sees Charlie nearly pulled through the window. Charlie and Jeep fall back inside, with severed hands still gripping Charlie. Michael leaps over her with a knife and machine gun as the blinds catch fire. Charlie flings the hands away, and she and Jeep retreat. Sandra hysterically tries to reach Howard, but Michael stops her, carrying her to a booth. Kyle enters, smiling, but his expression changes at the broken window. Bob grabs Kyle's arm, and everyone looks to Michael. Michael meets Percy's gaze, while Bob and Charlie react in shock."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A dark, bloody shoe emerges from the ice cream truck, revealing a skeletally thin man in tattered coveralls. As he steps into the headlights, his tall figure becomes clear. He surveys the diner, garage, and roof. On the roof, men wait. The ice cream man's jaw unhinges, terrifying everyone but Michael. The man bolts for the diner with insect-like speed. Michael shoots, knocking him down. Engines rumble as vehicles race toward the diner, swerving and colliding. Dark shapes scatter from burning vehicles. Howard is pulled away from Sandra, who screams. Charlie, Audrey, and Jeep try to help, but Jeep can't shoot because the women block the way. Jeep helps pull Howard, who is stretched in a tug-of-war. Kyle watches in alarm as Charlie nears death. Charlie and Jeep fall back into the diner, with severed hands still on Charlie. Michael leaps over her with a knife and gun as the window blinds ignite. Charlie flings the hands away. Sandra tries to reach Howard, but Michael stops her, carrying her to a booth. Kyle enters, smiling, but his excitement fades seeing the broken window. Bob grabs Kyle's arm, and all eyes turn to Michael, who looks at Percy. Bob and Charlie react in shock as everyone turns to her."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A dark, blood-stained shoe emerges ominously from the depths of the ice cream truck, and the camera slowly pans upward along the lengthy grey pant leg, which is marred with numerous blood stains, to reveal a man of skeletal thinness clad in tattered coveralls. As he steps forward into the glaring beams of the headlights, his tall, gaunt figure becomes more distinctly visible. He takes a moment to survey his surroundings, casting a scrutinizing gaze over the diner, the garage, and the roof, as if assessing the entire situation with a calculating eye. Meanwhile, on the roof, the men are poised, waiting anxiously for something to unfold. It is at this tense moment that the ice cream man's jaw grotesquely unhinges and stretches, a sight so terrifying that everyone, except for Michael, is driven to the brink of hyperventilation with fear. With startling speed, the ice cream man bolts toward the diner, his movements eerily reminiscent of a human insect. Michael takes aim, and bullets pierce the creature's body, sending him sprawling onto his back, his arms and legs contorted into a twisted, twitching mess. Michael maintains his aim, unwavering. Suddenly, a rumbling of engines and a flood of headlights follow as a freeway teeming with vehicles of every imaginable variety bursts through a wall of dust, racing headlong toward the diner. Vehicles swerve wildly and collide, and dark, shadowy figures bolt from the burning wreckage, scattering in all directions. In a sudden, violent motion, Howard's body is wrenched away from Sandra as something seizes his legs, jolting Sandra awake and causing her to scream and cling desperately. Charlie and Audrey rush to Sandra's side, grabbing hold of Howard's arms, with Jeep right behind them, ready to fire at the creature but unable to get a clear shot due to the women obstructing his line of sight. He discards the gun and joins in, helping to grab Howard's arms as Howard screams in agony, his body being torturously stretched in a human tug-of-war, lurching further out the window. Kyle looks around the roof with alarm, realizing that only a few more inches separate Charlie from certain death through the window, and Jeep is losing her grip. Charlie and Jeep tumble back into the diner, with claw-like hands still clutching Charlie's arms, now severed from their owners. Michael leaps over her, brandishing a butcher's knife in one hand and a machine gun in the other, as the window blinds transform into a wall of fire. Charlie flings the severed appendages off her, and she and Jeep hastily scoot away from the window. In a state of hysteria, Sandra attempts to push past Michael to pursue Howard, but he intercepts her before she can make it out. Sandra frantically slaps at Michael as he carries her away from the window and thrusts her down into a back booth. She's on the verge of saying something when Kyle rushes into the room with a smile on his face, but his excitement quickly fades as he notices the shattered window and takes in the chaotic scene. Bob grabs Kyle's arm, and all eyes turn to Michael. Michael looks directly at Percy, as Bob stares at him, uncertain how to respond, and Charlie reacts in shock as all eyes suddenly shift to her."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A dark, blood-stained shoe emerges ominously from the shadowy depths of the battered old ice cream truck, and with deliberate slowness, the camera begins to pan upward, tracing a path along the lengthy, grey pant leg. This fabric leg is marred with a disturbingly large number of bloodstains, ultimately revealing a man of skeletal thinness. He is clad in tattered coveralls that hang loosely on his gaunt frame. As he steps forward into the blinding glare of the headlights, his tall, emaciated figure becomes more distinctly visible, standing out starkly in the harsh beams. He pauses for a moment to take in his surroundings, casting a deeply scrutinizing gaze over the diner, the garage, and the rooftop, as if assessing the entire situation with a calculating and meticulous eye. Meanwhile, perched tensely on the roof, men are poised and waiting anxiously, bracing themselves for something to unfold. At this high-tension moment, the ice cream man's jaw grotesquely unhinges and stretches in a manner so terrifying that it drives everyone, except for Michael, almost to the brink of hyperventilating with fear. With startling speed, the ice cream man bolts toward the diner, his rapid movements eerily reminiscent of a human insect scuttling forward. Michael takes aim with precision, and bullets pierce the creature's body, sending him sprawling onto his back, with arms and legs contorted into a twisted, twitching mess. Michael maintains his aim, unwavering and steady. Suddenly, a rumbling of engines fills the air, and a flood of headlights follows as a freeway, teeming with vehicles of every imaginable variety, bursts through a wall of swirling dust, racing headlong toward the diner. Vehicles swerve wildly and collide with one another, and dark, shadowy figures bolt from the burning wreckage, scattering in all directions like frightened prey. In a sudden, violent motion, Howard's body is wrenched away from Sandra as something seizes his legs, jolting Sandra awake. She screams and clings desperately to him for dear life. Charlie and Audrey rush to Sandra's side, grabbing hold of Howard's arms, with Jeep right behind them, ready to fire his gun at the creature. However, he is unable to get a clear shot due to the women obstructing his line of sight. He quickly discards his weapon and joins in, helping to grab Howard's arms as Howard screams in agony, his body being torturously stretched in a brutal human tug-of-war, lurching further out the window with each passing second. Kyle looks around the roof with alarm, his heart racing as he realizes that only a few more inches separate Charlie from certain death through the window, and Jeep is losing her grip. Charlie and Jeep tumble back into the diner, with claw-like hands still gripping Charlie's arms, severed from their previous owners. Michael leaps over her, brandishing a butcher's knife in one hand and a machine gun in the other, as the flimsy window blinds transform into a wall of fire. Charlie flings the severed appendages off her, and she and Jeep hastily scoot away from the window in a frantic scurry. In a state of sheer hysteria, Sandra attempts to push past Michael in a desperate bid to pursue Howard, but he intercepts her before she can make it out. Sandra frantically slaps at Michael in a panic as he carries her away from the window and thrusts her down into a back booth seat. She's just on the verge of saying something when Kyle rushes into the room with a smile on his face, but his fleeting excitement quickly fades as he notices the shattered window and takes in the chaotic scene unfolding before him. Bob quickly grabs hold of Kyle's arm, and suddenly all eyes in the room turn to Michael. Michael looks directly at Percy, as Bob stares at him, uncertain how to respond to the unfolding chaos, and Charlie reacts in shock as all eyes shift their focus to her."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A dark, bloody shoe emerges from the ice cream truck, and the camera slowly pans upward along the long grey pant leg, which is marred with blood stains, until it reveals a skeletally thin man clad in tattered coveralls. As he steps forward into the bright beams of the headlights, his tall figure becomes more clearly visible. He pauses to survey the scene, casting his gaze over the diner, the garage, and the roof, carefully assessing the situation. Meanwhile, on the roof, the men are poised, waiting for something to unfold. At that moment, the ice cream man's jaw suddenly unhinges and stretches unnaturally, causing everyone except Michael to nearly hyperventilate with fear. With startling speed, the ice cream man bolts toward the diner, his movements eerily reminiscent of a human insect. Michael takes aim, and bullets tear into the creature's body, sending him crashing onto his back, his arms and legs contorted into a twisted, twitching mess. Michael maintains his aim as a rumbling of engines and the glare of headlights follow, revealing a freeway full of vehicles of every kind that burst through a wall of dust, racing toward the diner. The vehicles swerve and collide, and dark shapes emerge from the burning wrecks, scattering in all directions. Suddenly, Howard's body is violently yanked away from Sandra as something seizes his legs, jolting Sandra awake and prompting her to scream and cling to him. Charlie and Audrey rush to Sandra's side, grabbing hold of Howard's arms, with Jeep close behind, ready to fire at the creature but unable to get a clear shot because the women are in the way. He discards the gun and joins in, helping to grab Howard's arms as Howard screams, his body being torturously stretched in a human tug-of-war, inching further out the window. Kyle, alarmed, scans the roof as only a few more inches separate Charlie from certain death through the window, and Jeep is losing her grip. Charlie and Jeep tumble back into the diner, with claw-like hands still clutching Charlie's arms, now severed from their owners. Michael leaps over her, brandishing a butcher's knife in one hand and a machine gun in the other, as the window blinds transform into a wall of fire. Charlie flings the severed appendages off her, and she and Jeep hastily scoot away from the window. In a state of hysteria, Sandra attempts to push past Michael to pursue Howard, but he intercepts her before she can escape. Sandra frantically slaps at Michael as he carries her away from the window and forcefully seats her in a back booth. Just as she's about to speak, Kyle rushes into the room with a smile on his face, but his excitement quickly fades as he notices the broken window and surveys the room. Bob seizes Kyle's arm, and all eyes turn to Michael. Michael fixes his gaze on Percy, while Bob stares at him, unsure of how to react, and Charlie is taken aback as all eyes suddenly shift to her."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A dark, bloody shoe emerges from the ice cream truck, revealing a skeletally thin man in tattered coveralls as the camera pans up his blood-stained pant leg. Stepping into the headlights, his tall figure becomes clear as he surveys the diner, garage, and roof. On the roof, men await developments. Suddenly, the ice cream man's jaw unhinges, inciting fear in everyone except Michael. The man bolts toward the diner with insect-like speed, prompting Michael to fire, knocking him down in a twitching heap. As Michael maintains his aim, a convoy of vehicles bursts through a dust wall, swerving and colliding, with dark shapes scattering from the wreckage. Howard is abruptly dragged away from Sandra, waking her with a scream. Charlie, Audrey, and Jeep rush to help, grabbing Howard's arms, but Jeep can't shoot the creature due to the women's presence. Discarding his gun, Jeep assists in the tug-of-war as Howard is pulled further out the window. On the roof, Kyle watches in alarm as Charlie nears danger. Charlie and Jeep fall back into the diner, with severed hands still clutching Charlie's arms. Michael leaps over her, armed with a butcher's knife and machine gun, as the window blinds ignite. Charlie discards the appendages and retreats with Jeep. Sandra hysterically tries to reach Howard, but Michael intercepts her, carrying her to a back booth. Just as she's about to speak, Kyle enters, initially smiling but then dismayed by the scene. Bob grabs Kyle's arm, and all eyes turn to Michael, who looks at Percy, while Bob and Charlie react with uncertainty and shock."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A dark, bloody shoe steps out from the ice cream truck, a vehicle ironically associated with childhood joy now twisted into a harbinger of fear, and the camera moves up the long grey pant leg spotted with blood stains to reveal a skeletally thin man in tattered coveralls. As he steps into the beams of the headlights, casting a stark glow that highlights every unsettling detail, he becomes more clearly visible; he's tall. He surveys the diner, a roadside establishment common in remote stretches of highway, the garage, and the roof, assessing the situation. On the roof, where tension hangs like a storm cloud, the men wait for something to happen. That's when the ice cream man's jaw unhinges and stretches, a grotesque action reminiscent of horror film creatures, causing everyone except Michael, who appears to have encountered such horrors before, to practically hyperventilate with fear. The ice cream man bolts for the diner with startling speed, his movements resembling those of a human insect, an unsettling blend of man and machine-like precision. Michael aims and bullets rip into the creature's body, the echo of gunfire splitting the night, knocking him flat on his back, with arms and legs in a twisted, twitching mess. Michael keeps his aim steady. A rumbling of engines and headlights follow as a freeway, a symbol of modern life, full of vehicles of every variety punches through a wall of dust, racing toward the diner. Vehicles swerve and collide in a chaotic dance of metal, and dark shapes bolt from the burning vehicles, scattering like rats from a sinking ship. Suddenly Howard's body is torn away from Sandra as something grabs his legs with a primal force, waking Sandra and causing her to scream and hold on with desperation. Charlie and Audrey rush to Sandra's side, grabbing Howard's arms, with Jeep right behind them, ready to fire at the creature but unable to get a clear shot because the women are in the way. He discards the gun and helps grab Howard's arms as Howard screams and his body is torturously stretched in a human tug-of-war, lurching further out the window. Kyle looks around the roof with alarm, a place that had seemed a safe vantage point but is now part of the chaos, as only a few more inches separate Charlie from certain death through the window, and Jeep is losing her. Charlie and Jeep fall back into the diner, with claw-like hands still grasping Charlie's arms, no longer attached to their owners, which speaks to the supernatural violence they face. Michael leaps over her, wielding a butcher's knife in one hand and a machine gun in the other, as the window blinds turn into a wall of fire, completely transforming the interior into a battleground. Charlie flings the severed appendages off her, and she and Jeep scoot away from the window. Hysterical, Sandra tries to push past Michael to go after Howard, driven by love and panic, but he intercepts her before she can make it out. Sandra frantically slaps at Michael as he carries her away from the window and thrusts her down into a back booth. She's about to say something when Kyle rushes into the room with a smile on his face, initially oblivious to the carnage, but his excitement falls when he notices the broken window and takes in the room, now resembling a warzone. Bob grabs Kyle's arm, bringing a moment of human connection amidst the chaos, and all eyes turn to Michael, the unspoken leader. Michael looks squarely at Percy, whose face is a mask of confusion, as Bob stares at him, uncertain how to respond, and Charlie reacts in shock as all eyes suddenly turn to her, a pivotal moment that suggests a new development or revelation."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "A dark bloody shoe steps out from the ice cream truck and the camera moves up the long grey pant leg spotted with blood stains to reveal a skeletally thin man in tattered coveralls. As he steps into the beams of the headlights he becomes more clearly visible he is tall. He surveys the diner the garage and the roof assessing the situation. On the roof the men wait for something to happen. That is when the ice cream man's jaw unhinges and stretches causing everyone except Michael to practically hyperventilate with fear. The ice cream man bolts for the diner with startling speed his movements resembling those of a human insect. Michael aims and bullets rip into the creature's body knocking him flat on his back with arms and legs. in a twisted twitching mess. Michael keeps his aim. A rumbling of engines and headlights follow as a freeway full of vehicles of every variety punches through a wall of dust racing toward the diner. Vehicles swerve and collide and dark shapes bolt from the burning vehicles scattering. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Suddenly Howard's body is torn away from Sandra as something grabs his legs waking Sandra and causing her to scream and hold on. Charlie and Audrey rush to Sandra's side grabbing Howard's arms with Jeep right behind them ready to fire at the creature but unable to get a clear shot because the women are in the way. He discards the gun and helps grab Howard's arms as Howard screams and his body is torturously stretched in a human tugofwar lurching further out the window. Kyle looks around the roof with alarm as only a few more inches separate Charlie from certain death through the window and Jeep is losing her. Charlie and Jeep fall back into the diner with clawlike hands still grasping Charlie's arms no longer attached to their owners. Michael leaps over her wielding a butcher's knife in one hand and a machine gun in the other. as the window blinds turn into a wall of fire Charlie flings the severed appendages off her and she and Jeep scoot away from the window. Hysterical Sandra tries to push past Michael to go after Howard but he intercepts her before she can make it out. Sandra frantically slaps at Michael as he carries her away from the window and thrusts her down into a back booth. She is about to say something when Kyle rushes into the room with a smile on his face but his excitement falls when he notices the broken window and takes in the room. Bob grabs Kyle's arm and all eyes turn to Michael. Michael looks squarely at Percy as Bob stares at him uncertain how to respond and Charlie reacts in shock as all eyes suddenly turn to her."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "A dark bloody shoe steps out from the ice cream truck and the camera moves up the long grey pant leg spotted with blood stains to reveal a skeletally thin man in tattered coveralls. As he steps into the beams of the headlights he becomes more clearly visible he is tall. He surveys the diner the garage and the roof assessing the situation. On the roof the men wait for something to happen. That is when the ice cream man's jaw unhinges and stretches causing everyone except Michael to practically hyperventilate with fear. The ice cream man bolts for the diner with startling speed his movements resembling those of a human insect. Michael aims and bullets rip into the creature's body knocking him flat on his back with arms and legs. in a twisted twitching mess. Michael keeps his aim. A rumbling of engines and headlights follow as a freeway full of vehicles of every variety punches through a wall of dust racing toward the diner. Vehicles swerve and collide and dark shapes bolt from the burning vehicles scattering. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Suddenly Howard's body is torn away from Sandra as something grabs his legs waking Sandra and causing her to scream and hold on. Charlie and Audrey rush to Sandra's side grabbing Howard's arms with Jeep right behind them ready to fire at the creature but unable to get a clear shot because the women are in the way. He discards the gun and helps grab Howard's arms as Howard screams and his body is torturously stretched in a human tugofwar lurching further out the window. Kyle looks around the roof with alarm as only a few more inches separate Charlie from certain death through the window and Jeep is losing her. Charlie and Jeep fall back into the diner with clawlike hands still grasping Charlie's arms no longer attached to their owners. Michael leaps over her wielding a butcher's knife in one hand and a machine gun in the other. as the window blinds turn into a wall of fire Charlie flings the severed appendages off her and she and Jeep scoot away from the window. Hysterical Sandra tries to push past Michael to go after Howard but he intercepts her before she can make it out. Sandra frantically slaps at Michael as he carries her away from the window and thrusts her down into a back booth. She is about to say something when Kyle rushes into the room with a smile on his face but his excitement falls when he notices the broken window and takes in the room. Bob grabs Kyle's arm and all eyes turn to Michael. Michael looks squarely at Percy as Bob stares at him uncertain how to respond and Charlie reacts in shock as all eyes suddenly turn to her."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "A dark bloody shoe steps out from the ice cream truck and the camera moves up the long grey pant leg spotted with blood stains to reveal a skeletally thin man in tattered coveralls. As he steps into the beams of the headlights he becomes more clearly visible he is tall. He surveys the diner the garage and the roof assessing the situation. On the roof the men wait for something to happen. That is when the ice cream man's jaw unhinges and stretches causing everyone except Michael to practically hyperventilate with fear. The ice cream man bolts for the diner with startling speed his movements resembling those of a human insect. as the window blinds turn into a wall of fire Charlie flings the severed appendages off her and she and Jeep scoot away from the window. Hysterical Sandra tries to push past Michael to go after Howard but he intercepts her before she can make it out. Sandra frantically slaps at Michael as he carries her away from the window and thrusts her down into a back booth. She is about to say something when Kyle rushes into the room with a smile on his face but his excitement falls when he notices the broken window and takes in the room. Bob grabs Kyle's arm and all eyes turn to Michael. Michael looks squarely at Percy as Bob stares at him uncertain how to respond and Charlie reacts in shock as all eyes suddenly turn to her."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "A dark bloody shoe steps out from the ice cream truck and the camera moves up the long grey pant leg spotted with blood stains to reveal a skeletally thin man in tattered coveralls. As he steps into the beams of the headlights he becomes more clearly visible he is tall. She is about to say something when Kyle rushes into the room with a smile on his face but his excitement falls when he notices the broken window and takes in the room. Bob grabs Kyle's arm and all eyes turn to Michael. Michael looks squarely at Percy as Bob stares at him uncertain how to respond and Charlie reacts in shock as all eyes suddenly turn to her."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "A bright, feathered hat tumbles out from the bakery cart, and the parrot flutters up the short red curtain painted with polka dots to reveal a plump giraffe in polished overalls. As it bounces into the glow of the lampposts, it becomes more dreamlike; it's tiny. It examines the rollercoaster, the barn, and the trampoline, questioning the predicament. On the trampoline, the hamsters anticipate something to unfold. That's when the baker's beak unseals and contracts, leaving everyone except Lisa to faintly giggle with joy. The baker skates toward the treehouse with sluggish grace, its gestures echoing those of a robotic worm. Lisa whispers and flowers bloom into the robot's chassis, propping it upright on its front, with tentacles and antennae in a tangled, resting pattern. Lisa maintains her whisper. A roiling of waves and streetlights come next as a highway full of submarines of various colors dives through a curtain of glitter, swimming toward the treehouse. Submarines drift and synchronize, and glowing creatures swim from the glowing submarines, clustering. Suddenly Howard's kite is carried away from Wanda as someone tugs on his tail, waking Wanda and causing her to yawn and wave. Charlie and Audrey dance to Wanda's rhythm, tapping Howard's kitestring, with Tray trailing behind them, eager to paint the seaweed but unable to find a steady stroke because the dolphins are in the whirlwind. She dispenses the paintbrush and helps wave Howard's kitestring as Howard bellows and his tail is playfully bobbed in a cosmic see-saw, floating further through the clouds. Dana scans around the trampoline with wonder as only several more giggles separate Charlie from certain joy beneath the clouds, and Tray is gaining her. Charlie and Tray spring into the treehouse, with vine-like ropes still swinging from Charlie's kitestring, no longer tethered to their holders. Lisa soars above her, juggling a pizza cutter in one hoof and a saxophone in the other, as the sunbeams shimmer into a sea of sparkles. Charlie hurls the fluttering tendrils off her, and she and Tray glide away from the clouds. Overjoyed, Wanda tries to spin around Lisa to pursue Howard, but she intercepts her before she can float up. Wanda feebly taps at Lisa as she ushers her away from the clouds and sets her down into a front hammock. She's about to shout when Dana bursts into the canopy with a melody on her lips, but her harmony fades when she recognizes the whole in the sparkle and surveys the canopy. Victor clutches Dana's hoof, and every eye swivels to Lisa. Lisa gazes directly at Terry, as Victor watches her, unsure how to react, and Charlie gasps as all eyes abruptly glide to her."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A dark, bloody shoe emerges from an ice cream truck, revealing a tall, skeletally thin man in blood-stained coveralls. As he steps into the headlights, he assesses the scene at a diner and garage. On the roof, men watch anxiously as his jaw unnaturally unhinges, terrifying everyone except Michael. The ice cream man charges the diner with insect-like speed, but Michael shoots him down. Meanwhile, a chaotic scene unfolds outside as vehicles crash and dark figures scatter. Howard is violently dragged away, prompting Sandra to scream and hold on. Charlie, Audrey, and Jeep try to save Howard, resulting in a tug-of-war over his body. Jeep discards his gun to help, while Michael leaps to action with weapons in hand. As the window becomes engulfed in flames, Sandra tries to reach Howard but is stopped by Michael. Chaos ensues as Kyle enters, initially smiling, but quickly becomes disturbed by the destruction. Bob, Kyle, and others look to Michael, prompting an uncertain response from him as Charlie reacts in shock."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Michael looks squarely at Percy as Bob stares at him uncertain how to respond and Charlie reacts in shock as all eyes suddenly turn to her Bob grabs Kyle's arm and all eyes turn to Michael  She's about to say something when Kyle rushes into the room with a smile on his face but his excitement falls when he notices the broken window and takes in the room  Sandra frantically slaps at Michael as he carries her away from the window and thrusts her down into a back booth  Hysterical Sandra tries to push past Michael to go after Howard but he intercepts her before she can make it out  Charlie flings the severed appendages off her and she and Jeep scoot away from the window  as the window blinds turn into a wall of fire  Michael leaps over her wielding a butcher's knife in one hand and a machine gun in the other  Charlie and Jeep fall back into the diner with clawlike hands still grasping Charlie's arms no longer attached to their owners  Kyle looks around the roof with alarm as only a few more inches separate Charlie from certain death through the window and Jeep is losing her  He discards the gun and helps grab Howard's arms as Howard screams and his body is torturously stretched in a human tugofwar lurching further out the window  Charlie and Audrey rush to Sandra's side grabbing Howard's arms with Jeep right behind them ready to fire at the creature but unable to get a clear shot because the women are in the way  Suddenly Howard's body is torn away from Sandra as something grabs his legs waking Sandra and causing her to scream and hold on  Vehicles swerve and collide and dark shapes bolt from the burning vehicles scattering  A rumbling of engines and headlights follow as a freeway full of vehicles of every variety punches through a wall of dust racing toward the diner  Michael keeps his aim  in a twisted twitching mess  Michael aims and bullets rip into the creature's body knocking him flat on his back with arms and legs  The ice cream man bolts for the diner with startling speed his movements resembling those of a human insect  That's when the ice cream man's jaw unhinges and stretches causing everyone except Michael to practically hyperventilate with fear  On the roof the men wait for something to happen  He surveys the diner the garage and the roof assessing the situation  he's tall  As he steps into the beams of the headlights he becomes more clearly visible  A dark bloody shoe steps out from the ice cream truck and the camera moves up the long grey pant leg spotted with blood stains to reveal a skeletally thin man in tattered coveralls "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "As he steps into the beams of the headlights he becomes more clearly visible he is tall A dark bloody shoe steps out from the ice cream truck and the camera moves up the long grey pant leg spotted with blood stains to reveal a skeletally thin man in tattered coveralls On the roof the men wait for something to happen He surveys the diner the garage and the roof assessing the situation The ice cream man bolts for the diner with startling speed his movements resembling those of a human insect That is when the ice cream man's jaw unhinges and stretches causing everyone except Michael to practically hyperventilate with fear in a twisted twitching mess Michael aims and bullets rip into the creature's body knocking him flat on his back with arms and legs A rumbling of engines and headlights follow as a freeway full of vehicles of every variety punches through a wall of dust racing toward the diner Michael keeps his aim Suddenly Howard's body is torn away from Sandra as something grabs his legs waking Sandra and causing her to scream and hold on Vehicles swerve and collide and dark shapes bolt from the burning vehicles scattering He discards the gun and helps grab Howard's arms as Howard screams and his body is torturously stretched in a human tugofwar lurching further out the window Charlie and Audrey rush to Sandra's side grabbing Howard's arms with Jeep right behind them ready to fire at the creature but unable to get a clear shot because the women are in the way Charlie and Jeep fall back into the diner with clawlike hands still grasping Charlie's arms no longer attached to their owners Kyle looks around the roof with alarm as only a few more inches separate Charlie from certain death through the window and Jeep is losing her as the window blinds turn into a wall of fire Charlie flings the severed appendages off her and she and Jeep scoot away from the window Michael leaps over her wielding a butcher's knife in one hand and a machine gun in the other Sandra frantically slaps at Michael as he carries her away from the window and thrusts her down into a back booth Hysterical Sandra tries to push past Michael to go after Howard but he intercepts her before she can make it out Bob grabs Kyle's arm and all eyes turn to Michael She is about to say something when Kyle rushes into the room with a smile on his face but his excitement falls when he notices the broken window and takes in the room Michael looks squarely at Percy as Bob stares at him uncertain how to respond and Charlie reacts in shock as all eyes suddenly turn to her"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Charlie and Audrey rush to Sandra's side grabbing Howard's arms with Jeep right behind them ready to fire at the creature but unable to get a clear shot because the women are in the way  He discards the gun and helps grab Howard's arms as Howard screams and his body is torturously stretched in a human tugofwar lurching further out the window  Kyle looks around the roof with alarm as only a few more inches separate Charlie from certain death through the window and Jeep is losing her  Charlie and Jeep fall back into the diner with clawlike hands still grasping Charlie's arms no longer attached to their owners  Michael leaps over her wielding a butcher's knife in one hand and a machine gun in the other  as the window blinds turn into a wall of fire  Charlie flings the severed appendages off her and she and Jeep scoot away from the window  Hysterical Sandra tries to push past Michael to go after Howard but he intercepts her before she can make it out  Sandra frantically slaps at Michael as he carries her away from the window and thrusts her down into a back booth  She's about to say something when Kyle rushes into the room with a smile on his face but his excitement falls when he notices the broken window and takes in the room  Bob grabs Kyle's arm and all eyes turn to Michael  Michael looks squarely at Percy as Bob stares at him uncertain how to respond and Charlie reacts in shock as all eyes suddenly turn to her A dark bloody shoe steps out from the ice cream truck and the camera moves up the long grey pant leg spotted with blood stains to reveal a skeletally thin man in tattered coveralls  As he steps into the beams of the headlights he becomes more clearly visible  he's tall  He surveys the diner the garage and the roof assessing the situation  On the roof the men wait for something to happen  That's when the ice cream man's jaw unhinges and stretches causing everyone except Michael to practically hyperventilate with fear  The ice cream man bolts for the diner with startling speed his movements resembling those of a human insect  Michael aims and bullets rip into the creature's body knocking him flat on his back with arms and legs  in a twisted twitching mess  Michael keeps his aim  A rumbling of engines and headlights follow as a freeway full of vehicles of every variety punches through a wall of dust racing toward the diner  Vehicles swerve and collide and dark shapes bolt from the burning vehicles scattering  Suddenly Howard's body is torn away from Sandra as something grabs his legs waking Sandra and causing her to scream and hold on "
        }
      ]
    }
  ]
}