{
  "ground_truth": "The storm is passing now, blown by the driving wind. The camera rises up to find Javert, the officer in charge of the convict workforce, looking on, his face rain-lashed and expressionless. Behind Javert, through the storm rain, there is a glimpse of a forest of half-built ships, their ribbed frames like great skeletons in the mist. In the foreground, convicts are at work on another ship that is almost completed, laboring in the crashing spray. With a last great heave, the lines of convicts haul the damaged ship onto the slipway. Javert stands above the men on the top of the dock, as lines of convicts labor beneath him on the steep steps of the dock wall. Javert nods to the guards, and they begin to form the chained men into lines to return to their prison. Javert approaches Jean Valjean, seeing him and pointing his stick at Valjean in silent command. Valjean stares back for a moment, defying him, then drops down into the seething water and re-emerges with the great mast in his hands, held over his head. His head breaks water with his bitter gaze still on Javert, as he throws the mast ashore in a deliberate display of strength. Valjean walks away, hardly able to take in that he is free at last. He makes his way up a rising track, a worn knapsack on his back, and strides down the long rising road, pulling his thin coat close around him against the cold winter wind. He comes to a stop at the top of the hill, where he sees, lit by the rising sun, a wide vista of fields and towns and villages stretching into the distance, with the snow-capped Alps beyond. He passes a long line of laborers working and approaches the overseer. Behind and below him lies Toulon at the sea's edge. The overseer notices shaved hair showing under his cap. Bewildered, fearful, and suspicious, Valjean gets up and goes with the Bishop into the house by the church, where there is a simple table on which are laid bread and wine with silver cutlery. The bishop's sister, Madame Baptistine, stands, and two silver candlesticks light the room, illuminating walls painted with religious scenes. Valjean hesitates, and the Bishop looks from the silver to Valjean. The old Bishop holds out the two silver candlesticks, and Valjean, utterly bewildered, takes them. Amazed, Valjean looks up, and silenced by the Bishop's gentle tones, the policemen turn and leave. Valjean takes out his yellow passport and stares at it, then kneels in the church. Slowly, he examines the yellow passport and raises it high, as if to the altar. Valjean stands and turns, walking fast to the door of the church.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Here's the text transformed with synonyms:\n\nThe tempest is passing now, driven by the fierce gale. The camera ascends to locate Javert, the officer in charge of the prisoner workforce, observing, his visage rain-lashed and impassive. Behind Javert, through the storm rain, there is a glimpse of a woodland of half-constructed vessels, their ribbed frameworks like immense skeletons in the haze. In the foreground, prisoners are at toil on another vessel that is nearly finished, laboring in the crashing spray. With a final immense effort, the lines of prisoners drag the damaged vessel onto the slipway. Javert stands above the men on the top of the quay, as lines of prisoners toil beneath him on the steep steps of the quay wall. Javert nods to the sentries, and they commence to form the shackled men into lines to return to their penitentiary. Javert approaches Jean Valjean, observing him and pointing his baton at Valjean in tacit direction. Valjean gazes back for a moment, defying him, then drops into the roiling water and re-emerges with the immense mast in his hands, held over his head. His head breaks water with his bitter stare still on Javert, as he hurls the mast ashore in an intentional display of power. Valjean walks away, scarcely able to comprehend that he is free at last. He makes his way up a rising path, a worn haversack on his back, and strides down the long rising road, pulling his thin coat close around him against the cold winter gale. He comes to a halt at the top of the rise, where he sees, lit by the rising sun, a broad panorama of fields and towns and hamlets stretching into the distance, with the snow-capped Alps beyond. He passes a long line of laborers working and approaches the overseer. Behind and below him lies Toulon at the sea's edge. The overseer notices shaved hair showing under his cap. Bewildered, fearful, and suspicious, Valjean gets up and goes with the Bishop into the abode by the church, where there is a simple table on which are laid bread and wine with silver cutlery. The bishop's sister, Madame Baptistine, stands, and two silver candlesticks light the room, illuminating walls adorned with religious vistas. Valjean hesitates, and the Bishop looks from the silver to Valjean. The old Bishop extends the two silver candlesticks, and Valjean, utterly perplexed, takes them. Astonished, Valjean looks up, and silenced by the Bishop's gentle tones, the constables turn and depart. Valjean takes out his yellow permit and stares at it, then kneels in the church. Slowly, he inspects the yellow permit and raises it high, as if to the altar. Valjean stands and turns, walking swiftly to the door of the church."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The storm is now being passed by, as the driving wind blows it. The camera is raised up to find Javert, the officer in charge of the convict workforce, looking on, his face rain-lashed and expressionless. Behind Javert, through the storm rain, a forest of half-built ships can be glimpsed, their ribbed frames like great skeletons in the mist. In the foreground, another ship is being worked on by convicts, almost completed, laboring in the crashing spray. With a last great heave, the damaged ship is hauled onto the slipway by the lines of convicts. Above the men on the top of the dock, Javert stands, as the convict lines labor beneath him on the steep steps of the dock wall. The guards are nodded to by Javert, and they form the chained men into lines to return to their prison. Jean Valjean is approached by Javert, who sees him and points his stick at Valjean in silent command. Valjean stares back for a moment, defying him, then he drops down into the seething water and re-emerges with the great mast held over his head. His head breaks water with his bitter gaze still on Javert as the mast is thrown ashore by him in a deliberate display of strength. Hardly able to take in that he is free at last, Valjean walks away. Up a rising track, he makes his way, a worn knapsack on his back, and strides down the long rising road, his thin coat pulled close around him against the cold winter wind. At the top of the hill, he comes to a stop, where lit by the rising sun, a wide vista of fields and towns and villages stretches into the distance, with the snow-capped Alps beyond. He passes a long line of laborers working and approaches the overseer. Behind and below him, Toulon lies at the sea's edge. Under his cap, shaved hair is noticed by the overseer. Bewildered, fearful, and suspicious, Valjean gets up and goes with the Bishop into the house by the church, where bread and wine with silver cutlery are laid on a simple table. Standing, Madame Baptistine, the bishop's sister, is present, and the room is lit by two silver candlesticks, illuminating walls painted with religious scenes. Valjean hesitates, and the Bishop looks from the silver to Valjean. The two silver candlesticks are held out by the old Bishop, and Valjean, utterly bewildered, takes them. Amazed, Valjean looks up, and silenced by the Bishop's gentle tones, the policemen turn and leave. His yellow passport is taken out by Valjean, who stares at it, then kneels in the church. The yellow passport is slowly examined and raised high by him, as if to the altar. Valjean stands and turns, walking fast to the door of the church."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The storm subsides, driven by fierce winds. The camera reveals Javert, in charge of the convict workforce, his expression stoic and rain-lashed. Behind him, in the stormy rain, are half-built ship skeletons. Convicts work on an almost completed ship, laboring in crashing spray. With a final heave, they haul a damaged ship onto the slipway. Javert stands above them on the dock, watching guards form the chained convicts into lines for their prison return. He approaches Jean Valjean, silently commanding him with a stick. Valjean defies Javert, dives into the water, re-emerges with a mast over his head, and throws it ashore to display strength. Valjean, feeling free, walks up a track, a knapsack on his back, pulling his coat against the cold wind. At a hilltop, he sees a vista of fields, towns, and the distant snow-capped Alps. Passing laborers, he approaches an overseer. Toulon lies below at the sea's edge. The overseer notices Valjean's shaved hair under his cap. Bewildered and fearful, Valjean follows the Bishop into the house with a simple table set with bread, wine, and silver cutlery. Madame Baptistine stands as silver candlesticks light religious scenes on the walls. The Bishop offers the candlesticks to a bewildered Valjean. Amazed, Valjean is silenced by the Bishop’s gentle voice as policemen leave. With his yellow passport in hand, Valjean kneels in the church, then raises it high toward the altar before exiting swiftly."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The storm subsides with strong winds as the camera focuses on Javert, the convict workforce officer, drenched and expressionless. Behind him, storm-lashed half-built ships loom like skeletal frames. Nearby, convicts labor on nearly finished ships, hauling damaged ones onto the slipway under Javert's watch. He signals guards to line the chained men for prison return. Javert confronts Jean Valjean, who defiantly retrieves a mast from the water, showcasing strength, before walking away, feeling his newfound freedom. He ascends a hill, viewing fields, towns, and the Alps. Passing laborers, he approaches an overseer, noticing his shaved head. Suspicious, Valjean enters the Bishop's house, seeing bread, wine, and silverware. Madame Baptistine stands by, illuminated by silver candlesticks. The Bishop offers Valjean the candlesticks; police leave, silenced by the Bishop's gentle voice. Valjean examines his yellow passport, raises it to the altar, and exits the church."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The storm, which has been wreaking havoc, is now beginning to pass, pushed along by the relentless force of the driving wind. The camera ascends, lifting its perspective to reveal Javert, the officer in command of the convict workforce. His face, lashed by the relentless rain, remains utterly expressionless as he observes the scene. Behind Javert, through the torrential storm rain, there is a fleeting glimpse of a forest of half-constructed ships. Their ribbed frames rise eerily through the mist like enormous skeletons. In the foreground, convicts are toiling away on another vessel that is nearing completion, laboring intensely amidst the crashing spray. With one final great effort, the lines of convicts manage to haul the damaged ship onto the slipway. Javert stands in a position of authority above the men, stationed on top of the dock. Below him, lines of convicts toil on the steep steps of the dock wall. Javert gives a nod to the guards, signaling them to start organizing the chained men into lines to be escorted back to their prison cells. Javert then approaches Jean Valjean, fixes his gaze on him, and points his stick at Valjean, silently commanding compliance. Valjean meets his gaze for a moment, defying Javert with silent determination. He then plunges into the roiling water and re-emerges triumphantly, holding the large mast over his head. His head breaks the water's surface, his eyes still locked in a bitter stare on Javert, as he deliberately tosses the mast ashore in a powerful demonstration of strength. Valjean walks away, barely able to comprehend that he is finally free. He makes his way up a rising track, a worn knapsack on his back, and strides purposefully along the long, ascending road, pulling his thin coat tightly around him to shield against the biting cold of the winter wind. He comes to a halt at the crest of a hill, where the rising sun illuminates a vast panorama of fields and towns and villages stretched out into the distance, with the majestic, snow-capped Alps looming beyond. Passing a long line of laborers engaged in their work, he approaches the overseer. Behind him, and below, Toulon lies at the sea's edge. The overseer catches sight of the shaved hair peeking out from beneath Valjean's cap. Bewildered, fearful, and filled with suspicion, Valjean rises and accompanies the Bishop into the house next to the church, which houses a simple table adorned with bread and wine alongside silver cutlery. The bishop's sister, Madame Baptistine, stands nearby, and two silver candlesticks cast a warm light over the room, illuminating walls beautifully painted with religious scenes. Valjean hesitates, glancing from the silver to the Bishop, who calmly holds out the two silver candlesticks. Utterly bewildered, Valjean accepts them, his astonishment evident. He looks up, silenced by the Bishop's gentle tones, and the policemen, influenced by this unexpected kindness, turn away and leave. Valjean retrieves his yellow passport, staring at it intently before kneeling in the church. Slowly and deliberately, he examines the yellow passport and raises it high, as if in a gesture of offering to the altar. Valjean stands resolutely and turns, walking briskly to the church's door, stepping into the new chapter of his life."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The formidable storm, which has been causing significant damage and turmoil, is now gradually beginning to pass, urged along by the unyielding and powerful force of the driving wind. The camera gracefully ascends, shifting its viewpoint upward to unveil Javert, the officer who commands the convict workforce with an air of authority. His face, continually lashed by the relentless and unending rain, remains utterly expressionless and stoic as he observes the unfolding scene before him. Behind Javert, through the torrential downpour that persists in the storm, there appears a fleeting glimpse of a forest of half-constructed ships, their skeletal, ribbed frames eerily rising through the mist like enormous skeletons of long-lost creatures. In the foreground, a small army of convicts is diligently toiling away on another vessel that is nearing completion, laboring intensely amidst the relentless crashing spray.\n\nWith one final, monumental effort, the long lines of convicts manage to haul the damaged ship onto the slipway. Javert stands in a commanding position of authority above the men, stationed on top of the dock in a domineering stance. Below him, the long lines of weary convicts toil on the steep, wet steps of the dock wall. Javert gives a nod to the guards stationed nearby, signaling them to begin the task of organizing the chained men into orderly lines to be escorted back to their prison cells. Javert then approaches Jean Valjean, fixing his unwavering gaze upon him, and points his stick sternly at Valjean, silently commanding compliance. Valjean meets his gaze for a moment, defiantly staring back at Javert with silent determination. He then plunges into the tumultuous, roiling water and re-emerges triumphantly, holding the large mast defiantly over his head. His head breaks the water's churning surface, his eyes still locked in a bitter, challenging stare on Javert, as he deliberately and powerfully tosses the mast ashore in a grand demonstration of his immense strength.\n\nValjean walks away, barely able to comprehend the reality that he is finally free from the chains that bound him. He makes his way up a rising track, with a worn knapsack slung across his back, and strides purposefully along the long, ascending road, pulling his thin coat tightly around him in an effort to shield himself against the biting cold of the unforgiving winter wind. He comes to a halt at the crest of a hill, where the rising sun illuminates a vast, breathtaking panorama of fields, towns, and villages stretched out into the seemingly endless distance, with the majestic, snow-capped Alps looming beyond as a backdrop. Passing a long line of laborers who are deeply engaged in their work, he approaches the overseer. Behind him and below, the city of Toulon lies at the sea's edge, a reminder of the world he has left behind. The overseer catches sight of the shaved hair peeking out from beneath Valjean's cap. Bewildered, filled with fear and suspicion, Valjean rises and accompanies the Bishop into the house adjacent to the church, which houses a simple table adorned with bread and wine, alongside silver cutlery.\n\nThe bishop's sister, Madame Baptistine, stands nearby, and two silver candlesticks cast a warm, inviting light over the room, illuminating the walls that are beautifully painted with scenes of religious significance. Valjean hesitates for a moment, glancing from the immaculate silver to the Bishop, who calmly and generously holds out the two silver candlesticks towards him. Utterly bewildered and overcome with amazement, Valjean accepts them, his astonishment and disbelief clearly evident on his face. He looks up, silenced by the Bishop's gentle and kind tones, and the policemen, influenced and softened by this unexpected act of kindness, turn away and leave the scene. Valjean retrieves his yellow passport, staring at it intently and contemplatively before kneeling in the church. Slowly and deliberately, he examines the yellow passport, raising it high as if in a gesture of offering to the altar. Valjean stands resolutely and turns, walking briskly to the church's door, stepping out purposefully into the new chapter of his life, filled with hope and possibility."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The storm gradually loses its intensity, driven away by the relentless winds, as the camera smoothly ascends to capture Javert, the officer overseeing the convict workforce, who stands stoically, his face unflinching yet battered by the rain. Positioned behind Javert and barely visible through the relentless storm and rain, is a forest of half-constructed ships, their skeletal frames reaching skyward like colossal, mist-shrouded skeletons. In the immediate foreground, convicts toil tirelessly on another vessel, which nears completion, laboring against the backdrop of crashing spray. With one final, tremendous effort, the convicts collectively heave the damaged ship onto the slipway. From his vantage point atop the dock, Javert surveys the scene as the chain of convicts below him tirelessly labor up the steep steps of the dock wall. With a single nod, he silently communicates to the guards, who respond by organizing the chained convicts into orderly lines, preparing them to march back to their prison cells. Javert strides purposefully toward Jean Valjean, fixing his gaze upon him and extending his baton in a wordless command. For a brief, tense moment, Valjean locks eyes with Javert, silently challenging him, before diving into the turbulent waters, resurfacing with the majestic mast held aloft in a show of formidable strength. His eyes locked onto Javert, Valjean hurls the mast onto the shore with deliberate force. With a newfound sense of freedom, Valjean begins his journey, barely comprehending the reality of his liberation. He ascends a rising path, his worn knapsack slung over his shoulder, and strides down the long, sloping road, pulling his thin coat tightly around himself to ward off the biting winter wind. Upon reaching the summit of a hill, he pauses to take in a breathtaking panorama bathed in the light of the rising sun, revealing a vast expanse of fields, towns, and villages, stretching all the way to the distant, snow-covered Alps. He passes a line of laborers hard at work and approaches the overseer, while behind and below him, Toulon lies nestled by the sea. The overseer, taking note of Valjean's shaved hair peeking out from beneath his cap, regards him with a mix of confusion, fear, and suspicion. Overwhelmed, Valjean rises to follow the Bishop into the modest house by the church, where a simple table is set with bread, wine, and silver cutlery. Madame Baptistine, the Bishop's sister, stands by, while two silver candlesticks cast a warm glow across the room, illuminating walls adorned with religious imagery. Valjean hesitates, his eyes shifting from the silver to the Bishop, who extends the two silver candlesticks with a gentle gesture. Stunned into silence, Valjean accepts them, and the police, likewise subdued by the Bishop's gentle demeanor, depart without protest. Alone, Valjean retrieves his yellow passport, staring intently at it before kneeling in the church. He slowly raises the passport high, almost in supplication to the altar. Rising to his feet, Valjean turns and, with newfound resolve, swiftly makes his way to the door of the church."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As the storm subsides, the camera captures Javert, the unyielding officer overseeing the convict workforce, standing amidst the rain, with half-built ship skeletons visible in the mist behind him. Convicts labor in the foreground, hauling a damaged ship onto the slipway. From his vantage point atop the dock, Javert signals the guards to form the convicts into lines for their return to prison. Approaching Valjean, Javert silently commands him with a pointed stick. Valjean defiantly meets Javert's gaze, plunges into the water, and re-emerges, hoisting the ship's mast above his head before casting it ashore in a display of strength, then walks away, embracing his newfound freedom. He ventures up a winding track, pulling his coat tighter against the cold wind, until he pauses to admire the expansive view of fields and towns, with the Alps in the background. Upon reaching a group of laborers, he is noticed by an overseer. Conflicted and apprehensive, Valjean follows the Bishop into a modestly furnished house where the Bishop, alongside his sister, Madame Baptistine, offers him hospitality. Overwhelmed by the Bishop's kindness, Valjean accepts two silver candlesticks, astonished by the gesture. Reflecting on his life, he examines his yellow passport, raises it toward the altar in the church, and, with newfound resolve, quickly exits."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The storm is passing now, blown by the driving wind that often heralds the end of summer's tumultuous weather. The camera rises up to find Javert, the officer in charge of the convict workforce in 19th-century France, looking on, his face rain-lashed and expressionless. Behind Javert, through the storm rain, there is a glimpse of a forest of half-built ships, their ribbed frames like great skeletons in the mist, reminiscent of Toulon's historical shipbuilding dockyards. In the foreground, convicts are at work on another ship that is almost completed, laboring in the crashing spray from the Mediterranean Sea. With a last great heave, the lines of convicts haul the damaged ship onto the slipway, a critical stage in ship construction for launching vessels into the water. Javert stands above the men on the top of the dock, as lines of convicts labor beneath him on the steep steps of the dock wall, a scene capturing the harsh discipline of life in prison labor camps. Javert nods to the guards, and they begin to form the chained men into lines to return to their prison, likely returning to Toulon's notorious fortress-prison. Javert approaches Jean Valjean, whose history of imprisonment for stealing a loaf of bread during a time of great need haunts him, seeing him and pointing his stick at Valjean in silent command. Valjean stares back for a moment, defying him, then drops down into the seething water and re-emerges with the great mast in his hands, held over his head. His head breaks water with his bitter gaze still on Javert, as he throws the mast ashore in a deliberate display of strength, a testament to his inner resilience and defiance. Valjean walks away, hardly able to take in that he is free at last after years of forced servitude. He makes his way up a rising track, a worn knapsack on his back, and strides down the long rising road, pulling his thin coat close around him against the cold winter wind that sweeps down from the nearby coastal hills. He comes to a stop at the top of the hill, where he sees, lit by the rising sun, a wide vista of fields and towns and villages stretching into the distance, with the snow-capped Alps beyond, a magnificent landscape symbolizing the freedom he yearns for. He passes a long line of laborers working on a project likely tied to regional agriculture and approaches the overseer. Behind and below him lies Toulon, a historically significant port city, at the sea's edge. The overseer notices shaved hair showing under his cap, a telltale sign of his recent incarceration. Bewildered, fearful, and suspicious, Valjean gets up and goes with the Bishop into the house by the church, a sanctuary of peace and forgiveness, where there is a simple table on which are laid bread and wine with silver cutlery. The bishop's sister, Madame Baptistine, stands, and two silver candlesticks light the room, illuminating walls painted with religious scenes, creating an atmosphere of divine grace. Valjean hesitates, and the Bishop looks from the silver to Valjean, offering a chance for redemption. The old Bishop holds out the two silver candlesticks, and Valjean, utterly bewildered, takes them, his first encounter with genuine kindness in many years. Amazed, Valjean looks up, and silenced by the Bishop's gentle tones, the policemen turn and leave, showing the power of compassion to alter rigid judgment. Valjean takes out his yellow passport, a document marking him as an ex-convict, and stares at it, then kneels in the church, overwhelmed by the Bishop's mercy. Slowly, he examines the yellow passport and raises it high, as if to the altar, making a symbolic gesture toward starting anew. Valjean stands and turns, walking fast to the door of the church, determined to transform his life."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Behind and below him lies Toulon at the sea's edge Javert approaches Jean Valjean seeing him and pointing his stick at Valjean in silent command The storm is passing now blown by the driving wind The camera rises up to find Javert the officer in charge of the convict workforce looking on his face rainlashed and expressionless Behind Javert through the storm rain there is a glimpse of a forest of halfbuilt ships their ribbed frames like great skeletons in the mist In the foreground convicts are at work on another ship that is almost completed laboring in the crashing spray With a last great heave the lines of convicts haul the damaged ship onto the slipway Javert stands above the men on the top of the dock as lines of convicts labor beneath him on the steep steps of the dock wall Amazed Valjean looks up and silenced by the Bishop's gentle tones In the foreground convicts are at work on another ship that is almost completed laboring in the crashing spray The camera rises up to find Javert the officer in charge of the convict workforce looking on his face rainlashed and expressionless Javert nods to the guards and they begin to form the chained men into lines to return to their prison Javert approaches Jean Valjean seeing him and pointing his stick at Valjean in silent command Valjean stares back for a moment defying him then drops down into the seething water and reemerges with the great mast in his hands held over his head With a last great heave the lines of convicts haul the damaged ship onto the slipway His head breaks water with his bitter gaze still on Javert as he throws the mast ashore in a deliberate display of strength Behind Javert through the storm rain there is a glimpse of a forest of halfbuilt ships their ribbed frames like great skeletons in the mist Valjean walks away hardly able to take in that he is free at last He makes his way up a rising track a worn knapsack on his back and strides down the long rising road pulling his thin coat close around him against the cold winter wind Valjean takes out his yellow passport and stares at it then kneels in the church He comes to a stop at the top of the hill where he sees lit by the rising sun a wide vista of fields and towns and villages stretching into the distance with the snowcapped Alps beyond He passes a long line of laborers working and approaches the overseer Valjean stands and turns walking fast to the door of the church The storm is passing now blown by the driving wind Behind and below him lies Toulon at the sea's edge The overseer notices shaved hair showing under his cap Valjean stares back for a moment defying him then drops down into the seething water and reemerges with the great mast in his hands held over his head Bewildered fearful and suspicious Valjean gets up and goes with the Bishop into the house by the church where there is a simple table on which are laid bread and wine with silver cutlery The bishop's sister Madame Baptistine stands and two silver candlesticks light the room illuminating walls painted with religious scenes Valjean hesitates and the Bishop looks from the silver to Valjean Slowly he examines the yellow passport and raises it high as if to the altar He passes a long line of laborers working and approaches the overseer The old Bishop holds out the two silver candlesticks and Valjean utterly bewildered takes them Amazed Valjean looks up and silenced by the Bishop's gentle tones the policemen turn and leave Valjean takes out his yellow passport and stares at it then kneels in the church Slowly he examines the yellow passport and raises it high as if to the altar Valjean stands and turns walking fast to the door of the church"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The storm is passing now blown by the driving wind. The camera rises up to find Javert the officer in charge of the convict workforce looking on his face rainlashed and expressionless. Behind Javert through the storm rain there is a glimpse of a forest of halfbuilt ships their ribbed frames like great skeletons in the mist. In the foreground convicts are at work on another ship that is almost completed laboring in the crashing spray. With a last great heave the lines of convicts haul the damaged ship onto the slipway. Javert stands above the men on the top of the dock as lines of convicts labor beneath him on the steep steps of the dock wall. Javert nods to the guards and they begin to form the chained men into lines to return to their prison. Javert approaches Jean Valjean seeing him and pointing his stick at Valjean in silent command. Valjean stares back for a moment defying him then drops down into the seething water and reemerges with the great mast in his hands held over his head. His head breaks water with his bitter gaze still on Javert as he throws the mast ashore in a deliberate display of strength. Valjean walks away hardly able to take in that he is free at last. He makes his way up a rising track a worn knapsack on his back and strides down the long rising road pulling his thin coat close around him against the cold winter wind. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. He comes to a stop at the top of the hill where he sees lit by the rising sun a wide vista of fields and towns and villages stretching into the distance with the snowcapped Alps beyond. He passes a long line of laborers working and approaches the overseer. Behind and below him lies Toulon at the sea's edge. The overseer notices shaved hair showing under his cap. Bewildered fearful and suspicious Valjean gets up and goes with the Bishop into the house by the church where there is a simple table on which are laid bread and wine with silver cutlery. The bishop's sister Madame Baptistine stands and two silver candlesticks light the room illuminating walls painted with religious scenes. Valjean hesitates and the Bishop looks from the silver to Valjean. The old Bishop holds out the two silver candlesticks and Valjean utterly bewildered takes them. Amazed Valjean looks up and silenced by the Bishop's gentle tones. the policemen turn and leave. Valjean takes out his yellow passport and stares at it then kneels in the church. Slowly he examines the yellow passport and raises it high as if to the altar. Valjean stands and turns walking fast to the door of the church."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The storm is passing now blown by the driving wind. The camera rises up to find Javert the officer in charge of the convict workforce looking on his face rainlashed and expressionless. Behind Javert through the storm rain there is a glimpse of a forest of halfbuilt ships their ribbed frames like great skeletons in the mist. In the foreground convicts are at work on another ship that is almost completed laboring in the crashing spray. With a last great heave the lines of convicts haul the damaged ship onto the slipway. Javert stands above the men on the top of the dock as lines of convicts labor beneath him on the steep steps of the dock wall. Javert nods to the guards and they begin to form the chained men into lines to return to their prison. Javert approaches Jean Valjean seeing him and pointing his stick at Valjean in silent command. Valjean stares back for a moment defying him then drops down into the seething water and reemerges with the great mast in his hands held over his head. His head breaks water with his bitter gaze still on Javert as he throws the mast ashore in a deliberate display of strength. Valjean walks away hardly able to take in that he is free at last. He makes his way up a rising track a worn knapsack on his back and strides down the long rising road pulling his thin coat close around him against the cold winter wind. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. He comes to a stop at the top of the hill where he sees lit by the rising sun a wide vista of fields and towns and villages stretching into the distance with the snowcapped Alps beyond. He passes a long line of laborers working and approaches the overseer. Behind and below him lies Toulon at the sea's edge. The overseer notices shaved hair showing under his cap. Bewildered fearful and suspicious Valjean gets up and goes with the Bishop into the house by the church where there is a simple table on which are laid bread and wine with silver cutlery. The bishop's sister Madame Baptistine stands and two silver candlesticks light the room illuminating walls painted with religious scenes. Valjean hesitates and the Bishop looks from the silver to Valjean. The old Bishop holds out the two silver candlesticks and Valjean utterly bewildered takes them. Amazed Valjean looks up and silenced by the Bishop's gentle tones. the policemen turn and leave. Valjean takes out his yellow passport and stares at it then kneels in the church. Slowly he examines the yellow passport and raises it high as if to the altar. Valjean stands and turns walking fast to the door of the church."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The storm is passing now blown by the driving wind. The camera rises up to find Javert the officer in charge of the convict workforce looking on his face rainlashed and expressionless. Behind Javert through the storm rain there is a glimpse of a forest of halfbuilt ships their ribbed frames like great skeletons in the mist. In the foreground convicts are at work on another ship that is almost completed laboring in the crashing spray. With a last great heave the lines of convicts haul the damaged ship onto the slipway. Javert stands above the men on the top of the dock as lines of convicts labor beneath him on the steep steps of the dock wall. Valjean hesitates and the Bishop looks from the silver to Valjean. The old Bishop holds out the two silver candlesticks and Valjean utterly bewildered takes them. Amazed Valjean looks up and silenced by the Bishop's gentle tones. the policemen turn and leave. Valjean takes out his yellow passport and stares at it then kneels in the church. Slowly he examines the yellow passport and raises it high as if to the altar. Valjean stands and turns walking fast to the door of the church."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The storm is passing now blown by the driving wind. The camera rises up to find Javert the officer in charge of the convict workforce looking on his face rainlashed and expressionless. Valjean takes out his yellow passport and stares at it then kneels in the church. Slowly he examines the yellow passport and raises it high as if to the altar. Valjean stands and turns walking fast to the door of the church."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The storm is passing now, blown by the driving wind. The camera rises up to find a penguin, the officer in charge of the convict workforce, looking on, its face rain-lashed and expressionless. Behind the penguin, through the storm rain, there is a glimpse of a forest of half-built ships, their ribbed frames like great skeletons in the mist. In the foreground, flamingos are at work on another ship that is almost completed, laboring in the crashing spray. With a last great heave, the lines of flamingos haul the damaged ship onto the slipway. The penguin stands above the flamingos on the top of the dock, as lines of flamingos labor beneath it on the steep steps of the dock wall. The penguin nods to the giraffes, and they begin to form the chained flamingos into lines to return to their zoo. The penguin approaches a lion, seeing it and pointing its stick at the lion in silent command. The lion stares back for a moment, defying the penguin, then drops down into the seething water and re-emerges with the great mast in its paws, held over its head. Its head breaks water with its bitter gaze still on the penguin, as the lion throws the mast ashore in a deliberate display of strength. The lion walks away, hardly able to take in that it is free at last. It makes its way up a rising track, a worn knapsack on its back, and strides down the long rising road, pulling its thin coat close around it against the cold winter wind. The lion comes to a stop at the top of the hill, where it sees, lit by the rising sun, a wide vista of fields and towns and villages stretching into the distance, with the snow-capped Alps beyond. The lion passes a long line of ants working and approaches the overseer. Behind and below it lies Toulon at the sea's edge. The overseer notices shaved hair showing under its cap. Bewildered, fearful, and suspicious, the lion gets up and goes with the kangaroo into the house by the church, where there is a simple table on which are laid bread and wine with silver cutlery. The kangaroo's sister, Madame Elephantine, stands, and two silver candlesticks light the room, illuminating walls painted with religious scenes. The lion hesitates, and the kangaroo looks from the silver to the lion. The old kangaroo holds out the two silver candlesticks, and the lion, utterly bewildered, takes them. Amazed, the lion looks up, and silenced by the kangaroo's gentle tones, the pandas turn and leave. The lion takes out its yellow passport and stares at it, then kneels in the church. Slowly, it examines the yellow passport and raises it high, as if to the altar. The lion stands and turns, walking fast to the door of the church."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The storm is passing now, blown by the driving wind. The camera rises up to find Javert, the officer in charge of the convict workforce, looking on, his face snow-lashed and expressionless. Behind Javert, through the storm snow, there is a glimpse of a field of half-built wagons, their ribbed frames like great skeletons in the mist. In the foreground, convicts are at work on another wagon that is almost completed, laboring in the crashing spray. With a last great heave, the lines of convicts haul the damaged wagon onto the causeway. Javert stands above the men on the top of the dock, as lines of convicts labor beneath him on the steep steps of the dock wall. Javert nods to the guards, and they begin to form the chained men into lines to return to their fortress. Javert approaches Jean Valjean, seeing him and pointing his flag at Valjean in silent command. Valjean stares back for a moment, defying him, then drops down into the seething sand and re-emerges with the great anvil in his hands, held over his head. His head breaks sand with his bitter gaze still on Javert, as he throws the anvil ashore in a deliberate display of strength. Valjean walks away, hardly able to take in that he is free at last. He makes his way up a rising trail, a worn satchel on his back, and strides down the long rising path, pulling his thin scarf close around him against the cold summer wind. He comes to a stop at the top of the mountain, where he sees, lit by the rising moon, a wide vista of hills and rivers and orchards stretching into the distance, with the snow-capped Andes beyond. He passes a long line of merchants working and approaches the foreman. Behind and below him lies Cannes at the sea's edge. The foreman notices shaved hair showing under his hood. Bewildered, fearful, and suspicious, Valjean gets up and goes with the Bishop into the house by the school, where there is a simple cabinet on which are laid cheese and cider with copper cutlery. The bishop's sister, Madame Baptistine, stands, and two copper lanterns light the room, illuminating walls painted with historical scenes. Valjean hesitates, and the Bishop looks from the copper to Valjean. The old Bishop holds out the two copper lanterns, and Valjean, utterly bewildered, takes them. Amazed, Valjean looks up, and silenced by the Bishop's gentle tones, the soldiers turn and leave. Valjean takes out his blue passport and stares at it, then kneels in the school. Slowly, he examines the blue passport and raises it high, as if to the desk. Valjean stands and turns, walking fast to the door of the school."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The storm is dissipating now, carried by the relentless wind. The camera tilts up to discover Javert, the officer in charge of the convict workforce, observing, his face rain-soaked and inscrutable. Behind Javert, through the storm rain, there is a view of a forest of half-constructed ships, their ribbed frames resembling great skeletons in the mist. In the foreground, convicts are engaged on another ship that is almost finished, toiling in the crashing spray. With a final great pull, the lines of convicts drag the damaged ship onto the slipway. Javert stands above the men on the top of the dock, as lines of convicts toil beneath him on the steep steps of the dock wall. Javert gestures to the guards, and they start to assemble the chained men into lines to return to their prison. Javert approaches Jean Valjean, observing him and raising his stick at Valjean in silent command. Valjean gazes back for a moment, defying him, then plunges down into the roiling water and surfaces with the great mast in his hands, lifted above his head. His head emerges from the water with his bitter gaze still on Javert, as he hurls the mast ashore in a deliberate display of strength. Valjean departs, barely able to comprehend that he is free at last. He moves his way up a rising track, a worn knapsack on his back, and marches down the long rising road, tightening his thin coat close around him against the cold winter wind. He pauses at the top of the hill, where he observes, illuminated by the rising sun, a wide panorama of fields and towns and villages stretching into the distance, with the snow-capped Alps beyond. He passes a long line of laborers working and nears the overseer. Behind and below him lies Toulon at the sea's edge. The overseer notices shaved hair showing under his cap. Bewildered, fearful, and suspicious, Valjean rises and proceeds with the Bishop into the house by the church, where there is a simple table on which are placed bread and wine with silver cutlery. The bishop's sister, Madame Baptistine, stands, and two silver candlesticks illuminate the room, casting light on walls painted with religious scenes. Valjean pauses, and the Bishop glances from the silver to Valjean. The old Bishop extends the two silver candlesticks, and Valjean, utterly bewildered, accepts them. Awestruck, Valjean gazes up, and muted by the Bishop's gentle tones, the policemen turn and depart. Valjean takes out his yellow passport and gazes at it, then bows in the church. Slowly, he scrutinizes the yellow passport and lifts it high, as if to the altar. Valjean rises and turns, hastening to the door of the church."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The sandwich is shrinking now, blown by the swirling breeze. The suitcase rises up to find Galileo, the gardener in charge of the parade orchestra, observing on, his hand snow-dusted and expressionless. Behind Galileo, through the shrink rain, there is a glimpse of a library of half-built bicycles, their ribbed frames like great octopuses in the fog. In the foreground, astronauts are at work on another bicycle that is almost completed, laboring in the crashing waves. With a last great heave, the lines of astronauts haul the injured bicycle onto the runway. Galileo stands above the cats on the top of the mountain, as lines of astronauts labor beneath him on the steep steps of the mountain cave. Galileo nods to the owls, and they begin to form the tangled cats into lines to return to their playground. Galileo approaches Achilles, seeing him and pointing his umbrella at Achilles in silent command. Achilles stares back for a moment, defying him, then drops down into the bubbling fountain and re-emerges with the enormous shovel in his hands, held over his head. His head breaks water with his critical gaze still on Galileo, as he throws the shovel ashore in a deliberate display of strength. Achilles walks away, hardly able to take in that he is free at last. He makes his way up a rising staircase, a worn lantern on his back, and strides down the long rising alley, pulling his thin shirt close around him against the crisp summer breeze. He comes to a stop at the top of the mountain, where he sees, lit by the rising stars, a wide vista of paintings and bridges and statues stretching into the distance, with the snow-capped pyramids beyond. He passes a long line of musicians working and approaches the chef. Behind and below him lies Istanbul at the river's bend. The chef notices braided hair showing under his scarf. Bewildered, fearful, and suspicious, Achilles gets up and goes with the Captain into the barn by the fountain, where there is a simple chair on which are laid grapes and coffee with golden plates. The captain's brother, Monsieur Clement, stands, and two golden lanterns light the barn, illuminating walls painted with mythical creatures. Achilles hesitates, and the Captain looks from the gold to Achilles. The young Captain holds out the two golden lanterns, and Achilles, utterly bewildered, takes them. Astonished, Achilles looks up, and silenced by the Captain's gentle tones, the dolphins turn and leave. Achilles takes out his blue suitcase and stares at it, then kneels in the barn. Slowly, he examines the blue suitcase and raises it high, as if to the sky. Achilles stands and turns, walking fast to the door of the barn."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The avalanche is subsiding now, carried by the rushing river. The drone descends to find Maxine, the gardener in charge of the flower greenhouse, sitting down, her face sun-kissed and expressionless. Beside Maxine, through the snow flurries, there is a glimpse of a forest of nearly finished sculptures, their intricate forms like majestic giants in the fog. In the foreground, artists are at work on another sculpture that is almost detailed, sketching in the gentle mist. With a final great effort, the group of artists push the completed sculpture onto the walkway. Maxine sits beneath the artists at the base of the hill, as lines of artists sketch above her on the gentle slopes of the field. Maxine waves to the architects, and they begin to gather the unchained artists into groups to return to their studio. Maxine moves toward Jacques Brel, noticing him and waving her scarf at Brel in silent demand. Brel gazes back for a moment, challenging her, then climbs up onto the gentle hillock and appears with the ornate brush in his hands, held close to his chest. His chest rises with his calm gaze still on Maxine, as he places the brush on the ground in a delicate display of artistry. Brel meanders away, scarcely able to comprehend that he is burdened once more. He finds his way down a descending path, a dusty bag in his hand, and strolls along the winding descending lane, wrapping his woolen shawl tightly around him against the warm summer breeze. He pauses at the bottom of the valley, where he observes, lit by the setting moon, a broad expanse of waves and coves and harbors stretching into the horizon, with the sandy shores beyond. He watches a long procession of musicians rehearsing and approaches the composer. Ahead and above him lies Rome at the mountain's peak. The composer observes neat locks peeking over his hat. Confused, anxious, and doubtful, Brel stands and enters with the Fisherman into the tower by the market, where there is a grand seat on which are laid fruits and juice with wooden utensils. The fisherman's brother, Brother George, reclines, and two golden firebrands brighten the space, revealing walls adorned with abstract designs. Brel pauses, and the Fisherman looks from the gold to Brel. The young Fisherman offers up the two golden firebrands, and Brel, completely confused, receives them. Astonished, Brel looks down, and silenced by the Fisherman's soft whispers, the travelers bow and depart. Brel takes out his green leaflet and glances at it, then bows in the tower. Slowly, he inspects the green leaflet and lifts it low, as if to the hearth. Brel kneels and turns, drifting slowly to the window of the tower."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The tornado is swirling now, swept along by the howling breeze. The camera zooms in to find Javert, the officer in charge of the criminal team, observing, his face snow-flecked and impassive. Behind Javert, through the tornado’s snow, there is a glimpse of a meadow of half-assembled cars, their skeletal frames like great bones in the fog. In the foreground, criminals are at leisure on another vehicle that is nearly finished, resting in the pounding rain. With a final great shove, the lines of criminals carry the broken vehicle onto the roadway. Javert perches above the crew on the brim of the bridge, as rows of criminals toil beside him on the steep rungs of the bridge wall. Javert winks to the officers, and they begin to arrange the shackled crew into queues to return to their detention. Javert approaches Jean Valjean, observing him and waving his cane at Valjean in silent signal. Valjean glares back for a moment, challenging him, then plunges down into the frothing mud and re-surfaces with the great anchor in his hands, held above his head. His head emerges from mud with his intense gaze still on Javert, as he heaves the anchor to shore in a deliberate show of power. Valjean saunters away, barely able to comprehend that he is liberated at last. He makes his way up a descending ramp, a tattered pouch on his back, and ambles down the long descending trail, clutching his thin scarf close around him against the frosty autumn breeze. He pauses at the bottom of the valley, where he sees, illuminated by the setting moon, a narrow landscape of forests and hamlets stretching into the horizon, with the fog-covered Andes beyond. He passes a short line of artists creating and approaches the manager. Behind and above him lies Toulon at the mountain's edge. The manager notices long hair peeking under his hat. Confused, anxious, and distrustful, Valjean rises and goes with the Bishop into the hut by the school, where there is a grand podium on which are placed cheese and juice with copper dishes. The bishop's sibling, Madame Baptistine, sits, and two copper lanterns brighten the surroundings, revealing walls adorned with historical scenes. Valjean pauses, and the Bishop glances from the copper to Valjean. The elderly Bishop presents the two copper lanterns, and Valjean, completely puzzled, receives them. Astounded, Valjean looks up, and hushed by the Bishop's soothing gestures, the detectives turn and depart. Valjean uncovers his green passport and gazes at it, then bows in the school. Gradually, he inspects the green passport and lifts it high, as if to the ceiling. Valjean rises and veers, sprinting quickly to the exit of the school."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The breeze is fading now, nudged by the playful breeze. The kite descends down to locate Zinnia, the gardener in charge of the flower orchestra, observing closely, her face sun-dappled and indifferent. Beyond Zinnia, through the gentle drizzle, there is a peek of a fjord of half-grown trees, their leafy branches like grand specters in the fog. In the backdrop, musicians are rehearsing on another tree that is nearly complete, singing in the rustling wind. With a final great toss, the chorus of musicians swing the broken instrument onto the pathway. Zinnia hovers beside the players on the edge of the field, as rows of musicians harmonize around her on the slippery slopes of the hillock. Zinnia blinks to the judges, and they start to gather the unchained players into rows to proceed to their dormitory. Zinnia addresses Jove, observing him and waving her pen at Jove in wordless order. Jove gazes back briefly, challenging her, then leaps into the swirling air and surfaces with the grand baton in his grasp, held above his shoulders. His shoulders crest air with his fierce glare still on Zinnia, as he hurls the baton landward in a purposeful exhibit of prowess. Jove marches onward, scarcely managing to comprehend that he is liberated finally. He travels his route up a descending path, a heavy rucksack on his shoulders, and paces along the winding descending street, clutching his wool scarf snug around him against the warm summer breeze. He pauses at the bottom of the valley, where he perceives, dim by the setting moon, a narrow panorama of gardens and lakes and hamlets sprawling into the nearness, with the icy beach beyond. He wanders past a short group of dancers spinning and addresses the choreographer. Above and opposite him sprawls Calais at the mountain's base. The choreographer acknowledges messy whiskers peeking under his hat. Confused, eager, and curious, Jove hops up and journeys with the Monk into the barn beside the grove, where there is a lavish podium on which are arranged cheese and tea with porcelain dishes. The monk's cousin, Monsieur Harmony, reclines, and several gold lanterns brighten the barn, casting shadows painted with mythical images. Jove pauses, and the Monk glances from the gold to Jove. The young Monk gestures with several gold lanterns, and Jove, completely baffled, grasps them. Astonished, Jove glances down, and quieted by the Monk's mellow tunes, the firefighters pivot and vanish. Jove tugs out his purple badge and marvels at it, then squats in the grove. Gradually, he peruses the purple badge and lowers it low, as if to the meadow. Jove crouches and spins, leaping slowly to the window of the grove."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The storm subsides as Javert, the officer overseeing the convicts, stands stoically amid rain-lashed winds. Convicts labor on nearly completed ships, hauling a damaged vessel onto the slipway. Javert signals to the guards to line up the chained men for their return to prison. He confronts Jean Valjean, who defies him, diving into the water and emerging with a ship's mast in a display of strength. Freed at last, Valjean heads up a rising track, clutching his thin coat against the cold, and reaches a hilltop with a vista of fields and snow-capped Alps. Passing workers, he encounters an overseer. Fearful and suspicious, Valjean follows the Bishop into his home. There, the Bishop offers him silver candlesticks, signaling kindness and trust. Valjean, bewildered, accepts them, silencing the policemen. Reflecting on his yellow passport, he kneels in the church, then departs quickly, a changed man."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Valjean stands and turns walking fast to the door of the church Slowly he examines the yellow passport and raises it high as if to the altar Valjean takes out his yellow passport and stares at it then kneels in the church the policemen turn and leave Amazed Valjean looks up and silenced by the Bishop's gentle tones The old Bishop holds out the two silver candlesticks and Valjean utterly bewildered takes them Valjean hesitates and the Bishop looks from the silver to Valjean The bishop's sister Madame Baptistine stands and two silver candlesticks light the room illuminating walls painted with religious scenes Bewildered fearful and suspicious Valjean gets up and goes with the Bishop into the house by the church where there is a simple table on which are laid bread and wine with silver cutlery The overseer notices shaved hair showing under his cap Behind and below him lies Toulon at the sea's edge He passes a long line of laborers working and approaches the overseer He comes to a stop at the top of the hill where he sees lit by the rising sun a wide vista of fields and towns and villages stretching into the distance with the snowcapped Alps beyond He makes his way up a rising track a worn knapsack on his back and strides down the long rising road pulling his thin coat close around him against the cold winter wind Valjean walks away hardly able to take in that he is free at last His head breaks water with his bitter gaze still on Javert as he throws the mast ashore in a deliberate display of strength Valjean stares back for a moment defying him then drops down into the seething water and reemerges with the great mast in his hands held over his head Javert approaches Jean Valjean seeing him and pointing his stick at Valjean in silent command Javert nods to the guards and they begin to form the chained men into lines to return to their prison Javert stands above the men on the top of the dock as lines of convicts labor beneath him on the steep steps of the dock wall With a last great heave the lines of convicts haul the damaged ship onto the slipway In the foreground convicts are at work on another ship that is almost completed laboring in the crashing spray Behind Javert through the storm rain there is a glimpse of a forest of halfbuilt ships their ribbed frames like great skeletons in the mist The camera rises up to find Javert the officer in charge of the convict workforce looking on his face rainlashed and expressionless The storm is passing now blown by the driving wind"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Bewildered fearful and suspicious Valjean gets up and goes with the Bishop into the house by the church where there is a simple table on which are laid bread and wine with silver cutlery He comes to a stop at the top of the hill where he sees lit by the rising sun a wide vista of fields and towns and villages stretching into the distance with the snowcapped Alps beyond His head breaks water with his bitter gaze still on Javert as he throws the mast ashore in a deliberate display of strength The old Bishop holds out the two silver candlesticks and Valjean utterly bewildered takes them Valjean hesitates and the Bishop looks from the silver to Valjean Javert nods to the guards and they begin to form the chained men into lines to return to their prison Javert stands above the men on the top of the dock as lines of convicts labor beneath him on the steep steps of the dock wall Valjean walks away hardly able to take in that he is free at last The overseer notices shaved hair showing under his cap the policemen turn and leave He makes his way up a rising track a worn knapsack on his back and strides down the long rising road pulling his thin coat close around him against the cold winter wind The bishop's sister Madame Baptistine stands and two silver candlesticks light the room illuminating walls painted with religious scenes The camera rises up to find Javert the officer in charge of the convict workforce looking on his face rainlashed and expressionless Behind and below him lies Toulon at the sea's edge Valjean takes out his yellow passport and stares at it then kneels in the church He passes a long line of laborers working and approaches the overseer Behind Javert through the storm rain there is a glimpse of a forest of halfbuilt ships their ribbed frames like great skeletons in the mist Slowly he examines the yellow passport and raises it high as if to the altar With a last great heave the lines of convicts haul the damaged ship onto the slipway Valjean stands and turns walking fast to the door of the church Javert approaches Jean Valjean seeing him and pointing his stick at Valjean in silent command Valjean stares back for a moment defying him then drops down into the seething water and reemerges with the great mast in his hands held over his head The storm is passing now blown by the driving wind In the foreground convicts are at work on another ship that is almost completed laboring in the crashing spray Amazed Valjean looks up and silenced by the Bishop's gentle tones"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He passes a long line of laborers working and approaches the overseer Behind and below him lies Toulon at the sea's edge The overseer notices shaved hair showing under his cap Bewildered fearful and suspicious Valjean gets up and goes with the Bishop into the house by the church where there is a simple table on which are laid bread and wine with silver cutlery The bishop's sister Madame Baptistine stands and two silver candlesticks light the room illuminating walls painted with religious scenes Valjean hesitates and the Bishop looks from the silver to Valjean The old Bishop holds out the two silver candlesticks and Valjean utterly bewildered takes them Amazed Valjean looks up and silenced by the Bishop's gentle tones the policemen turn and leave Valjean takes out his yellow passport and stares at it then kneels in the church Slowly he examines the yellow passport and raises it high as if to the altar Valjean stands and turns walking fast to the door of the church The storm is passing now blown by the driving wind The camera rises up to find Javert the officer in charge of the convict workforce looking on his face rainlashed and expressionless Behind Javert through the storm rain there is a glimpse of a forest of halfbuilt ships their ribbed frames like great skeletons in the mist In the foreground convicts are at work on another ship that is almost completed laboring in the crashing spray With a last great heave the lines of convicts haul the damaged ship onto the slipway Javert stands above the men on the top of the dock as lines of convicts labor beneath him on the steep steps of the dock wall Javert nods to the guards and they begin to form the chained men into lines to return to their prison Javert approaches Jean Valjean seeing him and pointing his stick at Valjean in silent command Valjean stares back for a moment defying him then drops down into the seething water and reemerges with the great mast in his hands held over his head His head breaks water with his bitter gaze still on Javert as he throws the mast ashore in a deliberate display of strength Valjean walks away hardly able to take in that he is free at last He makes his way up a rising track a worn knapsack on his back and strides down the long rising road pulling his thin coat close around him against the cold winter wind He comes to a stop at the top of the hill where he sees lit by the rising sun a wide vista of fields and towns and villages stretching into the distance with the snowcapped Alps beyond"
        }
      ]
    }
  ]
}