{
  "ground_truth": "He kneels by her side as Eponine is dying and then dies in Marius's arms. Marius looks up at the others, his eyes full of tears, and holds out his note. The landlady climbs the stairs, followed by Gavroche. The door opens a crack to reveal a cautious Valjean, who looks up, deeply distressed, and points to Javert in a dark corner, his hands tied. Javert looks up and meets Valjean's eyes in a steady shared look. Suddenly Valjean spots a couple of snipers creeping over the roofs to gain an angle of attack on them; they are aiming at Enjolras. Swiftly, Valjean grabs a gun and shoots up at them, sending them scattering. Quickly, other students join in, and the snipers are driven back. There is a burst of gunfire from both ends of the street as a brief firefight ensues, but the snipers have disappeared. Enjolras turns to Valjean, while Javert hears this with grim satisfaction. Valjean uses the knife to cut Javert free and raises his gun, pointing it at Javert. Marius is manically working to raise the height of one of the smaller barricades. Grantaire drunkenly starts singing a drinking song, and it is taken up more seriously by Feuilly as bottles are passed around. Valjean is moving through the cafe when he hears Marius through a window and moves to the window. Marius sits beneath it, and Valjean listens to Marius's song, moved by it. Valjean paces, unable to sleep, inside the cafe, comes to a stop, and gazes on Marius as he sleeps through the window. Valjean is now kneeling next to the sleeping Marius. Crane up and up to see the little world of the barricaded street now surrounded by waiting soldiers and the streets around them packed with soldiers in their thousands, so many that we know the little band can never win. Many of the rest of the rebels are sleeping. Crane up and up until the barricade and the army that entraps it become a small pool of darkness in the center of the bright lights of Paris. The sun is still below the rooftops as Enjolras re-enters the barricade through the secret gate. Below him, the students are up and getting ready. There is silence and uncertainty, yet no one moves to go. The rays of the rising sun break through, lighting up Gavroche. Crack! A musket shot, and Gavroche falls face down onto the barricade. Enjolras gazes on his pitifully small group as the sun now appears above the rooftops of the city. In its wake comes a massive barrage of musket fire. Valjean moves among them, tending to the wounded, lifting down the dead, regardless of his own safety. And the big guns fire—BOOM! BOOM! BOOM! The bombardment hits the barricade, rocking it.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He bends by her side as Eponine is perishing and then expires in Marius's arms. Marius glances up at the others, his eyes full of tears, and extends his note. The landlady ascends the stairs, trailed by Gavroche. The door opens a crack to disclose a wary Valjean, who gazes up, deeply troubled, and gestures to Javert in a dark corner, his hands bound. Javert glances up and meets Valjean's eyes in a steady mutual look. Suddenly Valjean notices a pair of sharpshooters sneaking over the rooftops to gain an angle of attack on them; they are aiming at Enjolras. Swiftly, Valjean seizes a firearm and fires up at them, sending them scattering. Quickly, other students join in, and the sharpshooters are driven back. There is a burst of gunfire from both ends of the street as a brief skirmish ensues, but the sharpshooters have vanished. Enjolras turns to Valjean, while Javert hears this with grim satisfaction. Valjean uses the dagger to cut Javert free and raises his firearm, directing it at Javert. Marius is frantically working to elevate the height of one of the smaller barricades. Grantaire drunkenly starts singing a drinking song, and it is taken up more earnestly by Feuilly as bottles are circulated. Valjean is moving through the cafe when he hears Marius through a window and moves to the window. Marius sits beneath it, and Valjean listens to Marius's song, stirred by it. Valjean paces, unable to slumber, inside the cafe, comes to a stop, and gazes on Marius as he slumbers through the window. Valjean is now kneeling next to the slumbering Marius. Crane up and up to see the little world of the barricaded street now encircled by waiting soldiers and the streets around them crowded with soldiers in their thousands, so many that we know the little band can never triumph. Many of the rest of the rebels are slumbering. Crane up and up until the barricade and the army that traps it become a small pool of darkness in the center of the bright lights of Paris. The sun is still below the rooftops as Enjolras re-enters the barricade through the secret gate. Below him, the students are up and preparing. There is silence and doubt, yet no one moves to go. The rays of the ascending sun break through, illuminating Gavroche. Crack! A musket shot, and Gavroche falls face down onto the barricade. Enjolras gazes on his pitifully small assembly as the sun now appears above the rooftops of the city. In its wake comes a massive barrage of musket fire. Valjean moves among them, tending to the wounded, lifting down the dead, regardless of his own safety. And the big guns fire—BOOM! BOOM! BOOM! The bombardment strikes the barricade, rocking it."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He kneels by her side as Eponine is dying, and then Marius holds her as she dies in his arms. The others are looked up at by Marius, his eyes full of tears, and he holds out his note. The stairs are climbed by the landlady, who is followed by Gavroche. The door is opened a crack by a cautious Valjean, who looks up, deeply distressed, and he points to Javert in a dark corner, his hands tied. Valjean's eyes are met by Javert in a steady shared look. Suddenly, a couple of snipers creeping over the roofs to gain an angle of attack on them are spotted by Valjean; Enjolras is aimed at by them. A gun is swiftly grabbed by Valjean, and he shoots up at the snipers, sending them scattering. Quickly, other students join in, and they drive back the snipers. A burst of gunfire comes from both ends of the street as a brief firefight ensues, but the snipers have disappeared. Valjean is turned to by Enjolras, while this is heard by Javert with grim satisfaction. The knife is used by Valjean to cut Javert free, and his gun is raised by him, pointing it at Javert. The height of one of the smaller barricades is being manically raised by Marius. A drinking song is drunkenly started by Grantaire, and Feuilly takes it up more seriously as bottles are passed around. Valjean is moving through the cafe when Marius is heard by him through a window, and he moves to the window. Beneath it, Marius sits, and Valjean is moved by Marius's song as he listens to it. Unable to sleep, Valjean paces inside the cafe, comes to a stop, and Marius is gazed at by him as he sleeps through the window. Valjean is now kneeling next to the sleeping Marius. The little world of the barricaded street, now surrounded by waiting soldiers, is seen as we crane up and up, with the streets around them packed with soldiers in their thousands, so many that the little band is known to never win. Many of the rest of the rebels are sleeping. Crane up and up until the barricade and the army that entraps it become a small pool of darkness in the center of the bright lights of Paris. The sun is still below the rooftops as Enjolras re-enters the barricade through the secret gate. Below him, the students are up and getting ready. Silence and uncertainty are present, yet no one moves to go. The rays of the rising sun light up Gavroche as they break through. Crack! A musket is shot, and Gavroche falls face down onto the barricade. Enjolras gazes at his pitifully small group as the sun now appears above the rooftops of the city. In its wake comes a massive barrage of musket fire. Valjean moves among them, tending to the wounded, lifting down the dead, regardless of his own safety. And the big guns fire—BOOM! BOOM! BOOM! The barricade is hit by the bombardment, rocking it."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He kneels by her side as Eponine dies in Marius's arms. Marius, teary-eyed, holds out his note. The landlady and Gavroche ascend the stairs. The door opens slightly, revealing a cautious Valjean, distressed, pointing to Javert in a dark corner, hands tied. Javert meets Valjean's gaze steadily. Valjean spots snipers aiming at Enjolras and swiftly shoots, scattering them. Other students join, driving the snipers back. A brief firefight ensues, but the snipers vanish. Enjolras turns to Valjean, while Javert listens with grim satisfaction. Valjean cuts Javert free and raises his gun at him. Marius frantically raises a smaller barricade. Grantaire drunkenly sings, joined by Feuilly as bottles circulate. Valjean hears Marius's song through a window, moved by it. Unable to sleep, Valjean paces inside the cafe, watching Marius sleep. Valjean kneels next to Marius. The barricaded street is surrounded by soldiers, indicating the rebels can't win. Many rebels sleep. The barricade and army become a small dark pool amid Paris's bright lights. As the sun rises, Enjolras re-enters through a secret gate. Students prepare in silence. Sunlight illuminates Gavroche. Crack! A musket shot, and Gavroche falls. Enjolras gazes at his small group as musket fire follows. Valjean tends to the wounded and dead, ignoring his safety. The big guns fire—BOOM! BOOM! BOOM! The bombardment rocks the barricade."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He kneels by Eponine as she dies in Marius's arms. Marius, teary-eyed, holds out his note. The landlady and Gavroche ascend the stairs. Valjean, distressed, opens the door slightly, pointing to Javert tied in a corner. Javert meets Valjean's gaze. Valjean spots snipers targeting Enjolras, grabs a gun, and fires, scattering them. Students join in, driving the snipers back. A brief firefight ensues, but the snipers vanish. Enjolras turns to Valjean, while Javert listens grimly. Valjean cuts Javert free and points a gun at him. Marius frantically raises a barricade. Grantaire sings a drinking song, joined by Feuilly. Valjean hears Marius's song through a window, moved by it. Valjean paces inside the cafe, watching Marius sleep. He kneels by Marius. The barricaded street is surrounded by soldiers, ensuring defeat. Rebels sleep as the barricade becomes a dark spot amid Paris's lights. Enjolras returns through a secret gate. Students prepare silently. Sunlight illuminates Gavroche. Crack! A musket shot, and Gavroche falls. Enjolras sees his small group as musket fire begins. Valjean tends to the wounded and dead, ignoring his safety. The big guns fire, shaking the barricade."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He kneels gently by her side as Eponine is in the throes of dying, and then she passes away in Marius's arms. Marius, overwhelmed with emotion, looks up at the others, his eyes brimming with tears, and he holds out his note with a trembling hand. The landlady makes her way up the stairs, closely followed by Gavroche. The door creaks open just a crack, revealing a cautious Valjean, who looks up with a deeply distressed expression and points toward Javert, who is sitting in a dark corner with his hands tied. Javert looks up and meets Valjean's eyes in a steady, shared look of understanding. Suddenly, Valjean notices a couple of snipers stealthily creeping over the rooftops, trying to gain a strategic angle of attack on them; they are aiming directly at Enjolras. With swift precision, Valjean grabs a gun and fires up at them, causing them to scatter in panic. Quickly, other students join in the defense, and the snipers are driven back. There is a burst of gunfire from both ends of the street as a brief firefight ensues, but soon the snipers have disappeared. Enjolras turns to Valjean with gratitude, while Javert hears this with a grim sense of satisfaction. Valjean uses a knife to cut Javert free and then raises his gun, pointing it at Javert. Meanwhile, Marius is manically working to raise the height of one of the smaller barricades. Grantaire, in a drunken stupor, starts singing a drinking song, and it is taken up more seriously by Feuilly as bottles are passed around among them. Valjean is moving through the cafe when he hears Marius through a window and moves closer to listen. Marius sits beneath it, and Valjean listens to Marius's song, deeply moved by it. Valjean paces restlessly, unable to sleep, inside the cafe, comes to a stop, and gazes at Marius as he sleeps through the window. Valjean is now kneeling next to the sleeping Marius. The camera cranes up and up to reveal the little world of the barricaded street now surrounded by waiting soldiers, with the streets around them packed with soldiers in their thousands, so many that it becomes clear the little band can never win. Many of the rest of the rebels are sleeping. The camera cranes up and up until the barricade and the army that entraps it become a small pool of darkness in the center of the bright lights of Paris. The sun is still below the rooftops as Enjolras re-enters the barricade through the secret gate. Below him, the students are up and getting ready. There is a heavy silence and uncertainty, yet no one moves to leave. The rays of the rising sun break through, illuminating Gavroche. Crack! A musket shot rings out, and Gavroche falls face down onto the barricade. Enjolras gazes upon his pitifully small group as the sun now appears above the rooftops of the city. In its wake comes a massive barrage of musket fire. Valjean moves among them, tending to the wounded, lifting down the dead, regardless of his own safety. And then the big guns fire—BOOM! BOOM! BOOM! The bombardment hits the barricade, rocking it violently."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He kneels gently, with great care and tenderness, beside her frail form as Eponine is caught in the throes of dying, and then, in a moment filled with poignant sorrow, she takes her last breath in Marius's arms. Marius, overwhelmed and consumed with grief and emotion, looks up at the others, his eyes glistening with unshed tears, and he extends his note with a trembling, unsteady hand. The landlady makes her determined way up the stairs, closely followed by the alert Gavroche. The door creaks open, just a small crack, revealing a cautious and wary Valjean, who looks up with a deeply distressed and troubled expression on his face and points toward Javert, who is seated in a shadowy corner with his hands bound. Javert lifts his gaze to meet Valjean's eyes in a steady, shared look of deep understanding and resignation. Suddenly, Valjean becomes aware of a couple of snipers stealthily creeping over the rooftops, attempting to find a strategic angle for their attack on the group; their target is Enjolras. With swift and precise action, Valjean grabs a gun and fires up at them, causing them to scatter in a panicked retreat. Quickly, other students join in the defense, and the snipers are successfully driven back. There is a burst of gunfire from both ends of the narrow street as a brief, intense firefight ensues, but soon the snipers have vanished. Enjolras turns to Valjean with a look of profound gratitude, while Javert observes this with a grim sense of satisfaction. Valjean uses a knife to cut Javert free from his bindings and then raises his gun, pointing it directly at Javert. Meanwhile, Marius is manically working, with frantic energy, to raise the height of one of the smaller, more vulnerable barricades. Grantaire, caught in a drunken stupor, begins singing a raucous drinking song, and it is taken up more seriously by Feuilly as bottles are passed around among them, creating a sense of fleeting camaraderie. Valjean is moving through the dimly lit cafe when he hears Marius's voice through a window and moves closer to listen intently. Marius sits beneath it, and Valjean listens to Marius's song, deeply moved by its poignant melodies. Valjean paces restlessly, unable to find any sleep or rest, inside the cafe, then comes to a stop and gazes at Marius as he sleeps through the window. Valjean is now kneeling next to the sleeping Marius, filled with a mix of emotions. The camera cranes up and up to reveal the small, enclosed world of the barricaded street now surrounded by waiting soldiers, with the streets around them densely packed with soldiers in their thousands, so many in number that it becomes unmistakably clear the little band of rebels can never hope to win. Many of the rest of the rebels are sleeping. The camera cranes up and up until the barricade and the army that entraps it become a small pool of darkness in the center of the bright, vibrant lights of Paris. The sun is still below the rooftops as Enjolras re-enters the barricade through the secret gate. Below him, the students are awakening and preparing themselves. There is a heavy silence and uncertainty in the air, yet no one makes a move to leave. The rays of the rising sun break through, casting their warm light upon Gavroche. Crack! A musket shot rings out, and Gavroche falls face down onto the top of the barricade. Enjolras gazes upon his pitifully small group as the sun now fully appears above the rooftops of the sprawling city. In its wake comes a massive barrage of musket fire, echoing through the streets. Valjean moves among them, tending to the wounded, lifting down the dead, showing little regard for his own safety. And then the big guns fire—BOOM! BOOM! BOOM! The bombardment strikes the barricade with tremendous force, rocking it violently."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He kneels gently by her side, his presence a comforting shadow as Eponine's life ebbs away, and then, in a poignant moment, she dies in Marius's arms. Marius, overwhelmed with emotion, lifts his tear-filled eyes to the others around him, his expression a silent plea, and extends his hand to offer his note. Meanwhile, the landlady ascends the stairs with deliberate steps, closely followed by Gavroche, their movements echoing in the quiet. The door creaks open just a sliver, revealing Valjean, who peers out with a cautious and deeply distressed gaze. He gestures towards a dark corner where Javert sits, his hands bound, and their eyes meet in a steady, unspoken exchange. Suddenly, Valjean's attention is caught by the sight of snipers stealthily advancing over the rooftops, seeking a vantage point to target Enjolras. With swift precision, Valjean seizes a gun and fires upwards, causing the snipers to scatter in disarray. In a rapid response, other students join the fray, their combined efforts successfully repelling the snipers. A sudden burst of gunfire erupts from both ends of the street, igniting a brief but intense firefight, yet the snipers have vanished. Enjolras turns to Valjean in acknowledgment, while Javert listens, his expression one of grim satisfaction. Valjean then uses a knife to cut Javert free, his movements deliberate, and raises his gun, aiming it at Javert with a steady hand. Meanwhile, Marius is frantically working to increase the height of one of the smaller barricades, his actions driven by urgency. Grantaire, in a drunken stupor, begins to sing a drinking song, which is picked up more earnestly by Feuilly as bottles circulate among them. Valjean moves through the cafe, his steps purposeful, when he hears Marius's voice through a window and approaches it. Marius sits beneath the window, and Valjean listens intently to Marius's song, visibly moved by its emotion. Restless and unable to sleep, Valjean paces inside the cafe, eventually coming to a halt to gaze at Marius, who sleeps peacefully through the window. Valjean then kneels beside the sleeping Marius, his presence a silent vigil. The scene shifts, revealing the small world of the barricaded street, now encircled by waiting soldiers, the surrounding streets teeming with soldiers in their thousands, a daunting force that underscores the futility of the rebels' stand. Many of the remaining rebels are asleep, their forms still and vulnerable. The perspective continues to rise, transforming the barricade and the encircling army into a small pool of darkness amidst the bright lights of Paris. As the sun remains hidden below the rooftops, Enjolras re-enters the barricade through a secret gate, his movements careful and deliberate. Below him, the students stir, preparing for the day with a mix of silence and uncertainty, yet none make a move to leave. The first rays of the rising sun pierce through, illuminating Gavroche in a moment of clarity. Suddenly, a musket shot rings out—Crack!—and Gavroche falls face down onto the barricade, a tragic figure. Enjolras surveys his pitifully small group, the sun now fully risen above the city's rooftops, heralding a massive barrage of musket fire. Amidst the chaos, Valjean moves with purpose among them, tending to the wounded and gently lowering the dead, heedless of his own safety. The air is filled with the thunderous roar of the big guns—BOOM! BOOM! BOOM!—as the bombardment strikes the barricade, shaking it to its core."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Marius kneels beside Eponine as she dies in his arms, then tearfully holds out his note to the others. The landlady and Gavroche ascend the stairs, revealing a cautious Valjean, who points to a tied-up Javert in a dark corner. Valjean and Javert exchange a steady look before Valjean spots snipers targeting Enjolras. Valjean swiftly shoots at them, scattering the snipers, and is joined by other students in driving them back. A brief firefight ensues, but the snipers retreat. Enjolras acknowledges Valjean, while Javert listens with grim satisfaction. Valjean cuts Javert free and raises his gun at him. Meanwhile, Marius frantically raises a barricade, and Grantaire's drunken song is taken up by Feuilly as bottles circulate. Valjean, moved by Marius's song, listens through a window and later watches Marius sleep. As dawn breaks, the barricaded street is surrounded by soldiers, revealing the rebels' dire situation. Enjolras returns through a secret gate as the students prepare in silence. The rising sun illuminates Gavroche, who is shot and falls on the barricade. Enjolras surveys his small group as a massive musket barrage begins. Valjean tends to the wounded and dead amidst the chaos, undeterred by the booming bombardment that rocks the barricade."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He kneels by her side as Eponine, a member of the Parisian working class caught up in the revolutionary fervor, is dying and then dies in Marius's arms. Marius, a passionate student revolutionary fighting for a democratic France, looks up at the others, his eyes full of tears, and holds out his note. The landlady, a tenant steward of a rundown tenement in the period of France's July Monarchy, climbs the stairs, followed by Gavroche, a street-smart urchin and symbol of defiance and resilience in Paris. The door opens a crack to reveal a cautious Valjean, an ex-convict seeking redemption, who looks up, deeply distressed, and points to Javert, a staunch and unyielding police inspector, in a dark corner, his hands tied. Javert looks up and meets Valjean's eyes in a steady shared look, symbolizing the tense moral struggle between law and justice. Suddenly Valjean spots a couple of snipers, sharp-shooters from the governmental forces, creeping over the roofs to gain an angle of attack on them; they are aiming at Enjolras, the charismatic leader of the student revolutionaries. Swiftly, Valjean grabs a gun, a relic from the Napoleonic wars, and shoots up at them, sending them scattering. Quickly, other students join in, and the snipers are driven back. There is a burst of gunfire from both ends of the street as a brief firefight ensues, but the snipers have disappeared into the narrow alleys of Paris. Enjolras turns to Valjean, while Javert hears this with grim satisfaction, his dedication to order unshaken. Valjean uses the knife, a tool for both survival and protection, to cut Javert free and raises his gun, pointing it at Javert. Marius is manically working to raise the height of one of the smaller barricades, a makeshift defense against the oppressive regime's soldiers. Grantaire, a skeptic and cynic with a fondness for drink, drunkenly starts singing a drinking song, and it is taken up more seriously by Feuilly, a passionate advocate for the working classes, as bottles are passed around. Valjean is moving through the cafe, a gathering place of ideas and camaraderie, when he hears Marius through a window and moves to the window. Marius sits beneath it, and Valjean listens to Marius's song, moved by it, recognizing the youth's idealism. Valjean paces, unable to sleep, inside the cafe, comes to a stop, and gazes on Marius as he sleeps through the window. Valjean is now kneeling next to the sleeping Marius. Crane up and up to see the little world of the barricaded street, echoing the historical events of the June Rebellion of 1832, now surrounded by waiting soldiers loyal to King Louis-Philippe, and the streets around them packed with soldiers in their thousands, so many that we know the little band can never win. Many of the rest of the rebels, driven by hopes of freedom, are sleeping. Crane up and up until the barricade and the army that entraps it become a small pool of darkness in the center of the bright lights of Paris, the city of revolution and enlightenment. The sun is still below the rooftops as Enjolras re-enters the barricade through the secret gate, a tactical entry known only to the revolutionaries. Below him, the students are up and getting ready, fueled by youthful zeal and the dream of change. There is silence and uncertainty, yet no one moves to go. The rays of the rising sun break through, lighting up Gavroche, a symbol of innocence lost in the struggle. Crack! A musket shot, and Gavroche, a beloved figure among the insurgents, falls face down onto the barricade. Enjolras gazes on his pitifully small group as the sun now appears above the rooftops of the city. In its wake comes a massive barrage of musket fire, echoing the harsh reality of their situation. Valjean moves among them, tending to the wounded, lifting down the dead, regardless of his own safety, embodying selfless courage. And the big guns fire—BOOM! BOOM! BOOM! The bombardment hits the barricade, rocking it, symbolizing the relentless might of the state."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He kneels by her side as Eponine is dying and then dies in Marius's arms. Marius looks up at the others his eyes full of tears and holds out his note. The landlady climbs the stairs followed by Gavroche. The door opens a crack to reveal a cautious Valjean who looks up deeply distressed and points to Javert in a dark corner his hands tied. Javert looks up and meets Valjean's eyes in a steady shared look. Suddenly Valjean spots a couple of snipers creeping over the roofs to gain an angle of attack on them. they are aiming at Enjolras. Swiftly Valjean grabs a gun and shoots up at them sending them scattering. Quickly other students join in and the snipers are driven back. There is a burst of gunfire from both ends of the street as a brief firefight ensues but the snipers have disappeared. Enjolras turns to Valjean while Javert hears this with grim satisfaction. Valjean uses the knife to cut Javert free and raises his gun pointing it at Javert. Marius is manically working to raise the height of one of the smaller barricades. Grantaire drunkenly starts singing a drinking song and it is taken up more seriously by Feuilly as bottles are passed around. Valjean is moving through the cafe when he hears Marius through a window and moves to the window. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Marius sits beneath it and Valjean listens to Marius's song moved by it. Valjean paces unable to sleep inside the cafe comes to a stop and gazes on Marius as he sleeps through the window. Valjean is now kneeling next to the sleeping Marius. Crane up and up to see the little world of the barricaded street now surrounded by waiting soldiers and the streets around them packed with soldiers in their thousands so many that we know the little band can never win. Many of the rest of the rebels are sleeping. Crane up and up until the barricade and the army that entraps it become a small pool of darkness in the center of the bright lights of Paris. The sun is still below the rooftops as Enjolras reenters the barricade through the secret gate. Below him the students are up and getting ready. There is silence and uncertainty yet no one moves to go. The rays of the rising sun break through lighting up Gavroche Crack. A musket shot and Gavroche falls face down onto the barricade. Enjolras gazes on his pitifully small group as the sun now appears above the rooftops of the city. In its wake comes a massive barrage of musket fire. Valjean moves among them tending to the wounded lifting down the dead regardless of his own safety. And the big guns fire—BOOM BOOM BOOM. The bombardment hits the barricade rocking it."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He kneels by her side as Eponine is dying and then dies in Marius's arms. Marius looks up at the others his eyes full of tears and holds out his note. The landlady climbs the stairs followed by Gavroche. The door opens a crack to reveal a cautious Valjean who looks up deeply distressed and points to Javert in a dark corner his hands tied. Javert looks up and meets Valjean's eyes in a steady shared look. Suddenly Valjean spots a couple of snipers creeping over the roofs to gain an angle of attack on them. they are aiming at Enjolras. Swiftly Valjean grabs a gun and shoots up at them sending them scattering. Quickly other students join in and the snipers are driven back. There is a burst of gunfire from both ends of the street as a brief firefight ensues but the snipers have disappeared. Enjolras turns to Valjean while Javert hears this with grim satisfaction. Valjean uses the knife to cut Javert free and raises his gun pointing it at Javert. Marius is manically working to raise the height of one of the smaller barricades. Grantaire drunkenly starts singing a drinking song and it is taken up more seriously by Feuilly as bottles are passed around. Valjean is moving through the cafe when he hears Marius through a window and moves to the window. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Marius sits beneath it and Valjean listens to Marius's song moved by it. Valjean paces unable to sleep inside the cafe comes to a stop and gazes on Marius as he sleeps through the window. Valjean is now kneeling next to the sleeping Marius. Crane up and up to see the little world of the barricaded street now surrounded by waiting soldiers and the streets around them packed with soldiers in their thousands so many that we know the little band can never win. Many of the rest of the rebels are sleeping. Crane up and up until the barricade and the army that entraps it become a small pool of darkness in the center of the bright lights of Paris. The sun is still below the rooftops as Enjolras reenters the barricade through the secret gate. Below him the students are up and getting ready. There is silence and uncertainty yet no one moves to go. The rays of the rising sun break through lighting up Gavroche Crack. A musket shot and Gavroche falls face down onto the barricade. Enjolras gazes on his pitifully small group as the sun now appears above the rooftops of the city. In its wake comes a massive barrage of musket fire. Valjean moves among them tending to the wounded lifting down the dead regardless of his own safety. And the big guns fire—BOOM BOOM BOOM. The bombardment hits the barricade rocking it."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He kneels by her side as Eponine is dying and then dies in Marius's arms. Marius looks up at the others his eyes full of tears and holds out his note. The landlady climbs the stairs followed by Gavroche. The door opens a crack to reveal a cautious Valjean who looks up deeply distressed and points to Javert in a dark corner his hands tied. Javert looks up and meets Valjean's eyes in a steady shared look. Suddenly Valjean spots a couple of snipers creeping over the roofs to gain an angle of attack on them. they are aiming at Enjolras. Swiftly Valjean grabs a gun and shoots up at them sending them scattering. There is silence and uncertainty yet no one moves to go. The rays of the rising sun break through lighting up Gavroche Crack. A musket shot and Gavroche falls face down onto the barricade. Enjolras gazes on his pitifully small group as the sun now appears above the rooftops of the city. In its wake comes a massive barrage of musket fire. Valjean moves among them tending to the wounded lifting down the dead regardless of his own safety. And the big guns fire—BOOM BOOM BOOM. The bombardment hits the barricade rocking it."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He kneels by her side as Eponine is dying and then dies in Marius's arms. Marius looks up at the others his eyes full of tears and holds out his note. The landlady climbs the stairs followed by Gavroche. In its wake comes a massive barrage of musket fire. Valjean moves among them tending to the wounded lifting down the dead regardless of his own safety. And the big guns fire—BOOM BOOM BOOM. The bombardment hits the barricade rocking it."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "He dances by her side as Samantha is chuckling and then laughs in Marcus's arms. Marcus gazes up at the cats, his eyes full of laughter, and holds out his flute. The chef swings down the ladder, followed by Leonardo. The curtain opens a bit to reveal a joyful Theodore, who smiles up, deeply content, and gestures to Frederick in a bright garden, his feet tied. Frederick smiles up and meets Theodore's smile in a steady shared grin. Suddenly Theodore notices a group of birds fluttering over the hills to gain a view of flight on them; they are looking at Penelope. Swiftly, Theodore grabs a broom and waves it at them, sending them flying. Quickly, other gardeners join in, and the birds are driven away. There is a burst of applause from both sides of the park as a brief celebration ensues, but the birds have vanished. Penelope turns to Theodore, while Frederick hears this with proud satisfaction. Theodore uses the spoon to untie Frederick and lowers his broom, pointing it at Frederick. Marcus is energetically jumping to lower the length of one of the wider fences. Oliver drunkenly starts humming a lullaby, and it is taken up more loudly by Finn as candies are passed around. Theodore is wandering through the library when he hears Marcus through a waterfall and skips to the waterfall. Marcus stands beneath it, and Theodore listens to Marcus's melody, entertained by it. Theodore waltzes, unable to nap, beside the library, comes to a halt, and stares at Marcus as he naps through the waterfall. Theodore is now dancing next to the napping Marcus. Zoom up and up to see the vast garden of the shielded alley now surrounded by gathering owls and the mountains around them filled with owls in their hundreds, so many that we know the little orchestra can never perform. Many of the rest of the artists are napping. Zoom up and up until the shield and the forest that encloses it become a small patch of moonlight in the center of the twinkling stars of the sky. The moon is still beneath the canopies as Penelope re-emerges to the shield through the hidden passage. Above her, the artists are up and getting ready. There is chatter and hesitation, yet no one stirs to leap. The beams of the moonlight break through, illuminating Leonardo. Boom! A thunderclap rumbles, and Leonardo tumbles face up onto the shield. Penelope gazes on her delightfully large orchestra as the moon now rises above the canopies of the forest. In its trail comes a massive chorus of crickets. Theodore skips among them, caring for the joyful, lifting up the happy, regardless of his own delight. And the great flutes sound—TOOT! TOOT! TOOT! The celebration hits the shield, shaking it."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "As Eponine dies in Marius's arms, Valjean, distressed, opens the door to find Javert tied up. They exchange a look before Valjean spots snipers aiming at Enjolras. Valjean shoots at them, causing a brief firefight where other students join in, driving the snipers back. Marius fortifies a barricade while Grantaire and Feuilly sing. Valjean listens to Marius's song, moved by it, and watches him sleep. The barricade street is surrounded by soldiers, highlighting the rebels' slim chance of victory. As dawn breaks, Enjolras returns, tensions rise, and Gavroche is shot. Valjean tends to the wounded amidst a massive musket barrage and cannon fire that rocks the barricade."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The bombardment hits the barricade rocking it And the big guns fire—BOOM BOOM BOOM  Valjean moves among them tending to the wounded lifting down the dead regardless of his own safety  In its wake comes a massive barrage of musket fire  Enjolras gazes on his pitifully small group as the sun now appears above the rooftops of the city  A musket shot and Gavroche falls face down onto the barricade  The rays of the rising sun break through lighting up Gavroche Crack  There is silence and uncertainty yet no one moves to go  Below him the students are up and getting ready  The sun is still below the rooftops as Enjolras reenters the barricade through the secret gate  Crane up and up until the barricade and the army that entraps it become a small pool of darkness in the center of the bright lights of Paris  Many of the rest of the rebels are sleeping  Crane up and up to see the little world of the barricaded street now surrounded by waiting soldiers and the streets around them packed with soldiers in their thousands so many that we know the little band can never win  Valjean is now kneeling next to the sleeping Marius  Valjean paces unable to sleep inside the cafe comes to a stop and gazes on Marius as he sleeps through the window  Marius sits beneath it and Valjean listens to Marius's song moved by it  Valjean is moving through the cafe when he hears Marius through a window and moves to the window  Grantaire drunkenly starts singing a drinking song and it is taken up more seriously by Feuilly as bottles are passed around  Marius is manically working to raise the height of one of the smaller barricades  Valjean uses the knife to cut Javert free and raises his gun pointing it at Javert  Enjolras turns to Valjean while Javert hears this with grim satisfaction  There is a burst of gunfire from both ends of the street as a brief firefight ensues but the snipers have disappeared  Quickly other students join in and the snipers are driven back  Swiftly Valjean grabs a gun and shoots up at them sending them scattering  they are aiming at Enjolras  Suddenly Valjean spots a couple of snipers creeping over the roofs to gain an angle of attack on them  Javert looks up and meets Valjean's eyes in a steady shared look  The door opens a crack to reveal a cautious Valjean who looks up deeply distressed and points to Javert in a dark corner his hands tied  The landlady climbs the stairs followed by Gavroche  Marius looks up at the others his eyes full of tears and holds out his note  He kneels by her side as Eponine is dying and then dies in Marius's arms "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Marius looks up at the others his eyes full of tears and holds out his note He kneels by her side as Eponine is dying and then dies in Marius's arms The door opens a crack to reveal a cautious Valjean who looks up deeply distressed and points to Javert in a dark corner his hands tied The landlady climbs the stairs followed by Gavroche Suddenly Valjean spots a couple of snipers creeping over the roofs to gain an angle of attack on them Javert looks up and meets Valjean's eyes in a steady shared look Swiftly Valjean grabs a gun and shoots up at them sending them scattering they are aiming at Enjolras There is a burst of gunfire from both ends of the street as a brief firefight ensues but the snipers have disappeared Quickly other students join in and the snipers are driven back Valjean uses the knife to cut Javert free and raises his gun pointing it at Javert Enjolras turns to Valjean while Javert hears this with grim satisfaction Grantaire drunkenly starts singing a drinking song and it is taken up more seriously by Feuilly as bottles are passed around Marius is manically working to raise the height of one of the smaller barricades Marius sits beneath it and Valjean listens to Marius's song moved by it Valjean is moving through the cafe when he hears Marius through a window and moves to the window Valjean is now kneeling next to the sleeping Marius Valjean paces unable to sleep inside the cafe comes to a stop and gazes on Marius as he sleeps through the window Many of the rest of the rebels are sleeping Crane up and up to see the little world of the barricaded street now surrounded by waiting soldiers and the streets around them packed with soldiers in their thousands so many that we know the little band can never win The sun is still below the rooftops as Enjolras reenters the barricade through the secret gate Crane up and up until the barricade and the army that entraps it become a small pool of darkness in the center of the bright lights of Paris There is silence and uncertainty yet no one moves to go Below him the students are up and getting ready A musket shot and Gavroche falls face down onto the barricade The rays of the rising sun break through lighting up Gavroche Crack In its wake comes a massive barrage of musket fire Enjolras gazes on his pitifully small group as the sun now appears above the rooftops of the city And the big guns fire—BOOM BOOM BOOM Valjean moves among them tending to the wounded lifting down the dead regardless of his own safety The bombardment hits the barricade rocking it"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Valjean paces unable to sleep inside the cafe comes to a stop and gazes on Marius as he sleeps through the window  Valjean is now kneeling next to the sleeping Marius  Crane up and up to see the little world of the barricaded street now surrounded by waiting soldiers and the streets around them packed with soldiers in their thousands so many that we know the little band can never win  Many of the rest of the rebels are sleeping  Crane up and up until the barricade and the army that entraps it become a small pool of darkness in the center of the bright lights of Paris  The sun is still below the rooftops as Enjolras reenters the barricade through the secret gate  Below him the students are up and getting ready  There is silence and uncertainty yet no one moves to go  The rays of the rising sun break through lighting up Gavroche Crack  A musket shot and Gavroche falls face down onto the barricade  Enjolras gazes on his pitifully small group as the sun now appears above the rooftops of the city  In its wake comes a massive barrage of musket fire  Valjean moves among them tending to the wounded lifting down the dead regardless of his own safety  And the big guns fire—BOOM BOOM BOOM  The bombardment hits the barricade rocking it He kneels by her side as Eponine is dying and then dies in Marius's arms  Marius looks up at the others his eyes full of tears and holds out his note  The landlady climbs the stairs followed by Gavroche  The door opens a crack to reveal a cautious Valjean who looks up deeply distressed and points to Javert in a dark corner his hands tied  Javert looks up and meets Valjean's eyes in a steady shared look  Suddenly Valjean spots a couple of snipers creeping over the roofs to gain an angle of attack on them  they are aiming at Enjolras  Swiftly Valjean grabs a gun and shoots up at them sending them scattering  Quickly other students join in and the snipers are driven back  There is a burst of gunfire from both ends of the street as a brief firefight ensues but the snipers have disappeared  Enjolras turns to Valjean while Javert hears this with grim satisfaction  Valjean uses the knife to cut Javert free and raises his gun pointing it at Javert  Marius is manically working to raise the height of one of the smaller barricades  Grantaire drunkenly starts singing a drinking song and it is taken up more seriously by Feuilly as bottles are passed around  Valjean is moving through the cafe when he hears Marius through a window and moves to the window  Marius sits beneath it and Valjean listens to Marius's song moved by it "
        }
      ]
    }
  ]
}