{
  "ground_truth": "Valjean comes out of the church into the graveyard and reaches a bell set on the edge of a promontory. He rips the yellow paper into pieces and throws the pieces out over the valley. We follow the scraps of yellow paper as they dance in the wind, then fall away into the void below. The scraps flutter in the wind. Below lies the steep drop down the mountainside to the dark valley. We follow this and accelerate upwards, leaving Valjean and the town of Digne far below, towards the sun breaking through the heavens with the alps beyond. One scrap of paper dances upwards in the sunlight. The camera then starts to tumble back down through mist and cloud below, through time and space, down to discover ships sitting in low tide on the mud of the estuary along the dockside of the town and red brick factory buildings. The camera hurtles towards three horses riding down a long muddy road on a flat plain towards the walled town of Montreuil-sur-Mer. Montreuil sits on an estuary leading out to the sea. As the riders enter the walled town, we see the poor clustered around the gates, destitute and sick people clammering to get in. Javert sees the destitution of the people, expressionless as ever. The police enter the harbour, and the beggars are pushed back as the gates open and close for the police. The long workspace is full of tables at which conservatively dressed women are working, making jewelry out of shellac, a black resin which looks like jet. The Foreman has stopped beside Fantine, a pretty young woman. As he leans over to whisper in her ear, Fantine, surprised, pricks her finger with her needle. The women start to take off their overalls and pack up their tools for the day. Fantine has taken out a letter. The main factory woman snatches the letter away from Fantine. Fantine tries to get the letter back. The letter is passed surreptitiously down the line of women workers. The main factory woman starts to take Fantine's letter over to the Foreman. The women scuffle. The owner enters the factory floor. Clean-shaven, well-fed, transformed: it's Valjean. Suddenly, Valjean sees Javert appear on the first-floor balcony of his office. His world drops away. On the factory floor, Fantine continues to defend herself to the Foreman, as the women sing. The Foreman pulls Fantine away. Below, Fantine turns and calls to Valjean in his office above with a pitiful cry. Valjean walks back to the stairs up to his office and shows some demonstration samples of their work, throwing a sharp glance.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Valjean emerges from the chapel into the cemetery and arrives at a chime placed on the brink of a headland. He tears the yellow document into fragments and tosses the fragments out over the gorge. We trace the bits of yellow document as they twirl in the breeze, then descend into the abyss underneath. The bits flutter in the breeze. Beneath lies the abrupt descent down the mountainside to the shadowy gorge. We trace this and speed upwards, leaving Valjean and the town of Digne far underneath, towards the sun bursting through the skies with the alps beyond. One bit of document twirls upwards in the daylight. The camera then begins to plunge back down through fog and mist underneath, through era and expanse, down to uncover vessels resting in low tide on the muck of the bay along the wharf of the town and red brick mill structures. The camera races towards three steeds galloping down a long muddy path on a flat expanse towards the fortified town of Montreuil-sur-Mer. Montreuil rests on a bay leading out to the ocean. As the riders enter the fortified town, we observe the impoverished gathered around the portals, destitute and sick individuals clamoring to get in. Javert observes the destitution of the individuals, impassive as always. The officers enter the port, and the vagrants are shoved back as the portals open and close for the officers. The long workspace is filled with tables at which conservatively attired women are laboring, creating adornments out of shellac, a dark resin which resembles jet. The Supervisor has paused beside Fantine, a beautiful young woman. As he reclines over to murmur in her ear, Fantine, astonished, pricks her digit with her needle. The women begin to remove their coveralls and organize their implements for the day. Fantine has extracted a note. The main factory woman seizes the note away from Fantine. Fantine attempts to retrieve the note. The note is handed surreptitiously down the sequence of women workers. The main factory woman begins to carry Fantine's note over to the Supervisor. The women quarrel. The proprietor enters the factory floor. Clean-shaven, well-nourished, transformed: it's Valjean. Suddenly, Valjean perceives Javert emerge on the first-level balcony of his office. His world collapses. On the factory floor, Fantine persists to defend herself to the Supervisor, as the women chant. The Supervisor drags Fantine away. Below, Fantine turns and calls to Valjean in his office above with a plaintive wail. Valjean strides back to the stairs up to his office and displays some demonstration samples of their work, casting a pointed gaze."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Valjean is seen coming out of the church into the graveyard and reaching a bell set on the edge of a promontory. The yellow paper is ripped into pieces by him, and the pieces are thrown out over the valley. The scraps of yellow paper are followed by us as they dance in the wind, then fall away into the void below. The wind flutters the scraps. The steep drop down the mountainside to the dark valley lies below. This is followed by us, and we accelerate upwards, leaving Valjean and the town of Digne far below, as the sun breaks through the heavens with the Alps beyond. Upwards in the sunlight, one scrap of paper is seen dancing. The mist and cloud below are tumbled back through by the camera, through time and space, down to discover ships that sit in low tide on the mud of the estuary along the dockside of the town and red brick factory buildings. Three horses are seen hurtling towards by the camera, riding down a long muddy road on a flat plain towards the walled town of Montreuil-sur-Mer. An estuary leading out to the sea is where Montreuil sits. The poor are seen clustered around the gates, destitute and sick people clambering to get in, as the riders enter the walled town. Javert sees the destitution of the people with his expressionless demeanor. The beggars are pushed back as the police open and close the gates of the harbor. The long workspace is seen to be full of tables at which women conservatively dressed are observed working, making jewelry out of shellac, a black resin which looks like jet. Beside Fantine, a pretty young woman, the Foreman is stopped. As a whisper is heard in her ear by him, Fantine, surprised, pricks her finger with her needle. The women start to take off their overalls and pack up their tools for the day. A letter is taken out by Fantine. The main factory woman snatches the letter away from Fantine. Fantine tries to get the letter back. Down the line of women workers, the letter is passed surreptitiously. The Foreman is approached by the main factory woman, who starts to take Fantine's letter. The women scuffle. Into the factory floor enters the owner. Clean-shaven, well-fed, transformed: Valjean is identified. Suddenly, Javert is seen by Valjean appearing on the first-floor balcony of his office. His world drops away. On the factory floor, Fantine defends herself to the Foreman as the women sing. Fantine is pulled away by the Foreman. Below, Fantine turns and calls to Valjean in his office above with a pitiful cry. To the stairs up to his office walks Valjean and shows some demonstration samples of their work, throwing a sharp glance."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Valjean exits the church into the graveyard, reaching a bell on a promontory's edge. He tears the yellow paper into pieces, tossing them into the valley. The scraps dance in the wind, then fall into the void below, over the steep mountainside drop to the dark valley. We ascend, leaving Valjean and Digne behind, towards the sun breaking through the heavens with the Alps beyond. One scrap rises in the sunlight. The camera tumbles back through mist and cloud, down to ships in low tide at the estuary by the town's dockside and red brick factories. It speeds towards three horses on a muddy road heading to Montreuil-sur-Mer, a walled town on an estuary leading to the sea. As the riders enter, the poor cluster around the gates, destitute and sick, clammering to enter. Javert observes the destitution, expressionless. The police enter the harbor, pushing back beggars as the gates open and close. Inside, women work at tables making jewelry from shellac, a black resin resembling jet. The Foreman stops by Fantine, a pretty young woman, and whispers in her ear, causing her to prick her finger. The women remove their overalls and pack up. Fantine takes out a letter, which the main factory woman snatches away. Fantine tries to retrieve it as it's passed down the line. The main factory woman takes it to the Foreman. The women scuffle. The owner, clean-shaven and well-fed, enters—it's Valjean. Suddenly, he sees Javert on the first-floor balcony, and his world drops away. On the factory floor, Fantine defends herself to the Foreman as the women sing. The Foreman pulls Fantine away. Below, Fantine calls to Valjean in his office with a pitiful cry. Valjean returns to his office stairs, showing demonstration samples with a sharp glance."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Valjean exits the church into the graveyard, reaching a bell on a promontory. He tears yellow paper into pieces, tossing them into the valley. The scraps flutter in the wind, falling into the void over the steep mountainside. We ascend, leaving Valjean and Digne, towards the sun and alps. One scrap rises in sunlight. The camera tumbles through mist to ships in low tide by the estuary and red brick factories. It speeds towards three horses on a muddy road to Montreuil-sur-Mer, where destitute people clamor at the gates. Javert observes expressionlessly. Police enter the harbor, pushing beggars back. Inside, women make jewelry from shellac. The Foreman whispers to Fantine, who pricks her finger. Women pack up, and Fantine's letter is snatched and passed among them. The main woman takes it to the Foreman. Valjean, transformed, enters. He sees Javert on the balcony, shaken. Fantine defends herself as women sing. The Foreman pulls her away. Fantine cries to Valjean, who returns to his office, showing demonstration samples with a sharp glance."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Valjean emerges from the solemn, quiet church and steps into the adjacent graveyard, making his way towards a solitary bell perched on the very edge of a rocky promontory. In a moment of decisive action, he tears the yellow paper into numerous pieces and releases them into the air, watching as the fragments are carried away over the expansive valley. Our gaze follows these scraps of yellow paper as they twirl and dance gracefully in the gentle wind before they eventually drift away into the vast emptiness below. The scraps continue to flutter and sway in the breeze. Below them lies a steep, precipitous drop down the rugged mountainside, leading to the shadowy valley. Our perspective shifts, accelerating upwards, leaving Valjean and the quaint town of Digne far below, as we ascend towards the radiant sun breaking through the heavens, with the majestic alps stretching beyond. One particular scrap of paper catches the sunlight, dancing upwards in its glow. The camera then begins a rapid descent, tumbling back down through layers of mist and cloud, traversing through time and space, until it reveals ships resting in low tide on the muddy estuary along the dockside of the town, surrounded by red brick factory buildings. The camera races towards three horses galloping down a long, muddy road on a flat plain, heading towards the fortified town of Montreuil-sur-Mer. Montreuil is situated on an estuary that leads out to the open sea. As the riders make their way into the walled town, we witness the impoverished masses clustered around the gates, destitute and sick individuals desperately clamoring to gain entry. Javert observes the dire destitution of the people, his face remaining as expressionless as ever. The police make their way into the harbor, and the beggars are pushed back as the gates open and close to allow the police entry. Inside, the long workspace is filled with tables where conservatively dressed women are diligently working, crafting jewelry from shellac, a black resin resembling jet. The Foreman pauses beside Fantine, a young woman with a pretty face. As he leans over to whisper something in her ear, Fantine, caught off guard, accidentally pricks her finger with her needle. The women begin to remove their overalls and pack up their tools for the day. Fantine retrieves a letter, but the main factory woman snatches it away from her. Fantine attempts to reclaim the letter. The letter is discreetly passed down the line of women workers. The main factory woman proceeds to take Fantine's letter over to the Foreman. A scuffle ensues among the women. The owner enters the factory floor. Clean-shaven, well-fed, and transformed: it is Valjean. Suddenly, Valjean notices Javert appearing on the first-floor balcony of his office, and his world seems to drop away. On the factory floor, Fantine continues to defend herself to the Foreman, as the women sing. The Foreman pulls Fantine away. Below, Fantine turns and calls out to Valjean in his office above with a pitiful cry. Valjean walks back to the stairs leading up to his office and presents some demonstration samples of their work, casting a sharp glance."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Valjean, with a sense of resolute determination, emerges from the solemn and quiet church. He steps deliberately into the adjacent graveyard, his feet carrying him purposefully towards a lonely bell that sits perched on the very edge of a rocky promontory. With a moment of decisive action, he tears the yellow paper into countless pieces and releases them into the air, observing intently as they are carried away by the wind over the expansive valley. Our gaze follows these scattered fragments of yellow paper as they twirl, twist, and dance with grace in the gentle wind before they gradually drift away into the vast emptiness below. The scraps continue to flutter and sway elegantly in the breeze. Below them, there is a steep, precipitous drop down the rugged mountainside, leading to the shadowy valley below. Our perspective undergoes a dramatic shift, accelerating upwards, leaving Valjean and the quaint, serene town of Digne far below, as we ascend towards the radiant sun that is breaking through the heavens, with the majestic alps stretching out beyond. A particular scrap of paper catches the sunlight, gleaming as it dances upwards in its glow. The camera then begins a rapid descent, tumbling back down through layers of mist and cloud, traversing through both time and space, until it reveals ships resting patiently in low tide on the muddy estuary along the dockside of the town, encircled by sturdy red brick factory buildings. The camera races swiftly towards three horses galloping down a long, uneven, muddy road that cuts across a flat plain, heading with great urgency towards the fortified town of Montreuil-sur-Mer. Positioned strategically on an estuary that leads directly out to the open sea, Montreuil is a town where the riders soon make their way into its protective walls. As we observe, we witness the impoverished masses clustered around the gates, where destitute and sick individuals are desperately clamoring to gain entry. Javert eyes the dire destitution of the people with his face remaining as impassive and expressionless as ever. The police make their way into the bustling harbor, and the beggars are forced to retreat as the gates open and close to allow the police to enter. Once inside, the spacious, long workspace is filled with tables, where conservatively dressed women are diligently working, their hands skillfully crafting jewelry from shellac, a black resin resembling jet. The Foreman pauses beside Fantine, a young woman whose pretty face conveys both innocence and vulnerability. As he leans over to whisper something in her ear, Fantine, caught off guard, accidentally pricks her finger with her needle. The women begin to remove their overalls and carefully pack up their tools for the day. Fantine retrieves a letter, but the main factory woman quickly snatches it away from her grip. Fantine attempts to reclaim the letter with determination. The letter makes its discreet journey down the line of women workers, hand to hand. The main factory woman proceeds to take Fantine's letter over to the Foreman. A scuffle erupts among the women, creating a sense of turmoil. The owner enters the factory floor, clean-shaven, well-fed, and utterly transformed: it is Valjean. Suddenly, Valjean notices Javert appearing on the first-floor balcony of his office, and in that instant, his world seems to drop away. On the factory floor, Fantine continues to defend herself to the Foreman, her voice blending with the singing of the other women. The Foreman pulls Fantine away. Below, Fantine turns and calls out to Valjean in his office above with a pitiful, heart-wrenching cry. Valjean walks back to the stairs leading up to his office, his mind focused, as he presents some demonstration samples of their work, casting a sharp, scrutinizing glance."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Valjean emerges from the church and steps into the graveyard, making his way towards a bell perched on the edge of a promontory. With a decisive motion, he tears the yellow paper into pieces, each fragment catching the air as he throws them out over the valley. The scraps of yellow paper are carried by the wind, swirling and dancing before they begin their descent into the void below. As they flutter, the camera captures the steep drop down the mountainside leading to the dark valley. We follow this visual journey, accelerating upwards, leaving Valjean and the town of Digne far below, as we ascend towards the sun breaking through the heavens, with the majestic alps stretching beyond. One particular scrap of paper catches the sunlight, dancing upwards before the camera shifts its focus, tumbling back down through layers of mist and cloud, traversing through time and space. This descent reveals ships resting in low tide on the mud of the estuary, nestled along the dockside of the town, with red brick factory buildings standing nearby. The camera then propels towards three horses galloping down a long, muddy road on a flat plain, heading towards the walled town of Montreuil-sur-Mer, which sits on an estuary leading out to the sea. As the riders approach the town, the scene reveals the poor huddled around the gates, destitute and sick, clamoring for entry. Javert observes the destitution with his usual expressionless demeanor. The police make their way into the harbor, causing the beggars to be pushed back as the gates open and close to admit the police. Inside, the long workspace is bustling with activity, filled with tables where conservatively dressed women are diligently working, crafting jewelry from shellac, a black resin resembling jet. The Foreman pauses beside Fantine, a pretty young woman, and as he leans over to whisper in her ear, she is startled and pricks her finger with her needle. The women begin to remove their overalls and pack up their tools for the day. Fantine retrieves a letter, but the main factory woman snatches it away from her. Fantine attempts to reclaim the letter, which is discreetly passed down the line of women workers. The main factory woman carries Fantine's letter over to the Foreman, prompting a scuffle among the women. At this moment, the owner enters the factory floor, clean-shaven, well-fed, and transformed: it is Valjean. Suddenly, Valjean's attention is drawn to Javert, who appears on the first-floor balcony of his office, causing Valjean's world to momentarily collapse. Meanwhile, on the factory floor, Fantine continues to defend herself to the Foreman as the women sing. The Foreman pulls Fantine away, and below, she turns and calls out to Valjean in his office above with a pitiful cry. Valjean then walks back to the stairs leading up to his office, pausing to show some demonstration samples of their work, casting a sharp glance as he does so."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Valjean exits the church into the graveyard and reaches a bell on a promontory, where he tears a yellow paper into pieces and throws them into the valley. The scraps dance in the wind before falling into the void below, revealing a steep drop to the dark valley. The camera follows the paper upwards, leaving Valjean and Digne behind, towards the sun breaking through the heavens and the Alps. One scrap ascends in the sunlight before the camera tumbles back down through mist and cloud, revealing ships in low tide at the estuary and red brick factory buildings. It then focuses on three horses riding down a muddy road towards Montreuil-sur-Mer, a walled town on an estuary. As the riders enter, destitute people clamor at the gates. Javert observes the scene, expressionless, as the police enter the harbor, pushing back the beggars. Inside, women work at tables making jewelry from shellac. The Foreman whispers to Fantine, causing her to prick her finger. As the women pack up, Fantine takes out a letter, which is snatched away and passed among the workers. The main factory woman takes it to the Foreman, leading to a scuffle. The owner, now clean-shaven and well-fed, is revealed to be Valjean. He sees Javert on the balcony, causing his world to drop away. On the factory floor, Fantine defends herself to the Foreman as the women sing. The Foreman pulls her away, and Fantine calls out to Valjean with a pitiful cry. Valjean returns to his office, demonstrating samples of their work with a sharp glance."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Valjean comes out of the church, a centuries-old stone sanctuary that has witnessed countless stories, into the graveyard and reaches a bell set on the edge of a promontory, a high cliff offering sweeping views of the surrounding landscape. He rips the yellow paper into pieces and throws the pieces out over the valley, a vast expanse that has long been celebrated for its breathtaking beauty. We follow the scraps of yellow paper as they dance in the wind, then fall away into the void below. The scraps flutter in the wind. Below lies the steep drop down the mountainside to the dark valley, known locally for its dense forests and hidden wildlife. We follow this and accelerate upwards, leaving Valjean and the town of Digne, a quiet enclave in the Provence region of France, far below, towards the sun breaking through the heavens with the alps, majestic and eternal, beyond. One scrap of paper dances upwards in the sunlight. The camera then starts to tumble back down through mist and cloud below, through time and space, down to discover ships sitting in low tide on the mud of the estuary along the dockside of the town and red brick factory buildings, relics of the industrial revolution. The camera hurtles towards three horses riding down a long muddy road on a flat plain towards the walled town of Montreuil-sur-Mer, a coastal town once famed for its military fortifications. Montreuil sits on an estuary leading out to the sea, where trade ships frequently docked. As the riders enter the walled town, we see the poor clustered around the gates, destitute and sick people clammering to get in, seeking refuge and opportunity. Javert, a stern and unyielding officer known throughout the region, sees the destitution of the people, expressionless as ever. The police enter the harbour, and the beggars are pushed back as the gates open and close for the police. The long workspace is full of tables at which conservatively dressed women are working, making jewelry out of shellac, a black resin which looks like jet and was popular in Victorian times. The Foreman has stopped beside Fantine, a pretty young woman with a tragic story. As he leans over to whisper in her ear, Fantine, surprised, pricks her finger with her needle. The women start to take off their overalls and pack up their tools for the day. Fantine has taken out a letter, a precious link to her cherished daughter, Cosette. The main factory woman snatches the letter away from Fantine. Fantine tries to get the letter back. The letter is passed surreptitiously down the line of women workers. The main factory woman starts to take Fantine's letter over to the Foreman. The women scuffle. The owner enters the factory floor. Clean-shaven, well-fed, transformed: it's Valjean, taking on a new identity to escape his past. Suddenly, Valjean sees Javert appear on the first-floor balcony of his office. His world drops away, as the weight of his concealed identity resurfaces. On the factory floor, Fantine continues to defend herself to the Foreman, as the women sing, their voices a haunting echo of their struggles. The Foreman pulls Fantine away. Below, Fantine turns and calls to Valjean in his office above with a pitiful cry, a heartbreakingly desperate plea for help. Valjean walks back to the stairs up to his office and shows some demonstration samples of their work, throwing a sharp glance that speaks volumes about the tension in the air."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Valjean comes out of the church into the graveyard and reaches a bell set on the edge of a promontory. He rips the yellow paper into pieces and throws the pieces out over the valley. We follow the scraps of yellow paper as they dance in the wind then fall away into the void below. The scraps flutter in the wind. Below lies the steep drop down the mountainside to the dark valley. We follow this and accelerate upwards leaving Valjean and the town of Digne far below towards the sun breaking through the heavens with the alps beyond. One scrap of paper dances upwards in the sunlight. The camera then starts to tumble back down through mist and cloud below through time and space down to discover ships sitting in low tide on the mud of the estuary along the dockside of the town and red brick factory buildings. The camera hurtles towards three horses riding down a long muddy road on a flat plain towards the walled town of MontreuilsurMer. Montreuil sits on an estuary leading out to the sea. As the riders enter the walled town we see the poor clustered around the gates destitute and sick people clammering to get in. Javert sees the destitution of the people expressionless as ever. The police enter the harbour and the beggars are pushed back as the gates open and close for the police. The long workspace is full of tables at which conservatively dressed women are working making jewelry out of shellac a black resin which looks like jet. The Foreman has stopped beside Fantine a pretty young woman. As he leans over to whisper in her ear Fantine surprised pricks her finger with her needle. The women start to take off their overalls and pack up their tools for the day. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Fantine has taken out a letter. The main factory woman snatches the letter away from Fantine. Fantine tries to get the letter back. The letter is passed surreptitiously down the line of women workers. The main factory woman starts to take Fantine's letter over to the Foreman. The women scuffle. The owner enters the factory floor. Cleanshaven wellfed transformed it is Valjean. Suddenly Valjean sees Javert appear on the firstfloor balcony of his office. His world drops away. On the factory floor. Fantine continues to defend herself to the Foreman as the women sing. The Foreman pulls Fantine away. Below. Fantine turns and calls to Valjean in his office above with a pitiful cry. Valjean walks back to the stairs up to his office. and shows some demonstration samples of their work throwing a sharp glance."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Valjean comes out of the church into the graveyard and reaches a bell set on the edge of a promontory. He rips the yellow paper into pieces and throws the pieces out over the valley. We follow the scraps of yellow paper as they dance in the wind then fall away into the void below. The scraps flutter in the wind. Below lies the steep drop down the mountainside to the dark valley. We follow this and accelerate upwards leaving Valjean and the town of Digne far below towards the sun breaking through the heavens with the alps beyond. One scrap of paper dances upwards in the sunlight. The camera then starts to tumble back down through mist and cloud below through time and space down to discover ships sitting in low tide on the mud of the estuary along the dockside of the town and red brick factory buildings. The camera hurtles towards three horses riding down a long muddy road on a flat plain towards the walled town of MontreuilsurMer. Montreuil sits on an estuary leading out to the sea. As the riders enter the walled town we see the poor clustered around the gates destitute and sick people clammering to get in. Javert sees the destitution of the people expressionless as ever. The police enter the harbour and the beggars are pushed back as the gates open and close for the police. The long workspace is full of tables at which conservatively dressed women are working making jewelry out of shellac a black resin which looks like jet. The Foreman has stopped beside Fantine a pretty young woman. As he leans over to whisper in her ear Fantine surprised pricks her finger with her needle. The women start to take off their overalls and pack up their tools for the day. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. Fantine has taken out a letter. The main factory woman snatches the letter away from Fantine. Fantine tries to get the letter back. The letter is passed surreptitiously down the line of women workers. The main factory woman starts to take Fantine's letter over to the Foreman. The women scuffle. The owner enters the factory floor. Cleanshaven wellfed transformed it is Valjean. Suddenly Valjean sees Javert appear on the firstfloor balcony of his office. His world drops away. On the factory floor. Fantine continues to defend herself to the Foreman as the women sing. The Foreman pulls Fantine away. Below. Fantine turns and calls to Valjean in his office above with a pitiful cry. Valjean walks back to the stairs up to his office. and shows some demonstration samples of their work throwing a sharp glance."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Valjean comes out of the church into the graveyard and reaches a bell set on the edge of a promontory. He rips the yellow paper into pieces and throws the pieces out over the valley. We follow the scraps of yellow paper as they dance in the wind then fall away into the void below. The scraps flutter in the wind. Below lies the steep drop down the mountainside to the dark valley. We follow this and accelerate upwards leaving Valjean and the town of Digne far below towards the sun breaking through the heavens with the alps beyond. One scrap of paper dances upwards in the sunlight. The camera then starts to tumble back down through mist and cloud below through time and space down to discover ships sitting in low tide on the mud of the estuary along the dockside of the town and red brick factory buildings. The camera hurtles towards three horses riding down a long muddy road on a flat plain towards the walled town of MontreuilsurMer. His world drops away. On the factory floor. Fantine continues to defend herself to the Foreman as the women sing. The Foreman pulls Fantine away. Below. Fantine turns and calls to Valjean in his office above with a pitiful cry. Valjean walks back to the stairs up to his office. and shows some demonstration samples of their work throwing a sharp glance."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Valjean comes out of the church into the graveyard and reaches a bell set on the edge of a promontory. He rips the yellow paper into pieces and throws the pieces out over the valley. We follow the scraps of yellow paper as they dance in the wind then fall away into the void below. The scraps flutter in the wind. Fantine turns and calls to Valjean in his office above with a pitiful cry. Valjean walks back to the stairs up to his office. and shows some demonstration samples of their work throwing a sharp glance."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Basil emerges from the library into the orchard and reaches a trumpet placed on the rim of a plateau. He shreds the purple fabric into confetti and tosses the confetti out over the canyon. We trail the fragments of purple fabric as they twirl in the breeze, then drift away into the abyss beneath. The fragments flutter in the breeze. Beneath lies the sheer plunge down the cliffside to the shadowy gorge. We follow this and zoom upwards, leaving Basil and the village of Marston far beneath, toward the moon piercing through the cosmos with the peaks beyond. One fragment of fabric twirls upwards in the moonlight. The lens then begins to spiral back down through haze and fog below, through epochs and dimensions, down to reveal balloons resting in low tide on the silt of the channel along the riverside of the village and stone cottage structures. The lens rushes towards five camels trotting down a narrow dusty path on a rolling plateau toward the gated city of Willowdale. Willowdale rests on a channel leading out to the ocean. As the travelers enter the gated city, we see the wealthy clustered around the entrances, prosperous and vibrant people calling to get out. Olaf observes the affluence of the people, unmoved as always. The merchants enter the bay, and the aristocrats are nudged forward as the gates revolve and retract for the merchants. The vast warehouse is stuffed with benches at which vibrantly dressed men are bustling, crafting sculptures out of clay, a white plaster which resembles marble. The Supervisor has halted beside Clarissa, a charming young lady. As he bends over to murmur in her ear, Clarissa, startled, scratches her palm with her quill. The men begin to remove their jackets and wrap up their materials for the evening. Clarissa has extracted a postcard. The chief warehouse man snatches the postcard away from Clarissa. Clarissa attempts to retrieve the postcard. The postcard is discreetly passed along the row of men workers. The chief warehouse man begins to hand Clarissa's postcard over to the Supervisor. The men jostle. The overseer enters the warehouse floor. Bearded, svelte, transformed: it's Basil. Abruptly, Basil notices Olaf appear on the second-floor terrace of his chamber. His reality collapses. On the warehouse floor, Clarissa persists in justifying herself to the Supervisor, as the men chant. The Supervisor yanks Clarissa away. Beneath, Clarissa turns and calls to Basil in his chamber above with a lamentable wail. Basil strides back to the ladder up to his chamber and displays some prototype models of their art, hurling a piercing gaze."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Valjean exits the church and tosses torn yellow paper from a promontory, the scraps dancing in the wind before falling into the valley. The scene transitions to Valjean departing from Digne, accelerating towards an estuary and the walled town of Montreuil-sur-Mer, where beggars gather at the gates. Javert observes the destitution, remaining expressionless, as police enter. Inside the factory, women craft jewelry from shellac. The foreman whispers to Fantine, causing her to prick her finger. She takes out a letter, which the main factory woman confiscates and attempts to take to the Foreman, prompting a scuffle among workers. Valjean, now a transformed factory owner, enters and spots Javert on the balcony, unsettling him. On the factory floor, Fantine defends herself to the Foreman, calling to Valjean with a pitiful cry. Valjean returns to his office, showing demonstration samples with a sharp glance."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Valjean walks back to the stairs up to his office and shows some demonstration samples of their work throwing a sharp glance Fantine turns and calls to Valjean in his office above with a pitiful cry  Below  The Foreman pulls Fantine away  Fantine continues to defend herself to the Foreman as the women sing  On the factory floor  His world drops away  Suddenly Valjean sees Javert appear on the firstfloor balcony of his office  Cleanshaven wellfed transformed it's Valjean  The owner enters the factory floor  The women scuffle  The main factory woman starts to take Fantine's letter over to the Foreman  The letter is passed surreptitiously down the line of women workers  Fantine tries to get the letter back  The main factory woman snatches the letter away from Fantine  Fantine has taken out a letter  The women start to take off their overalls and pack up their tools for the day  As he leans over to whisper in her ear Fantine surprised pricks her finger with her needle  The Foreman has stopped beside Fantine a pretty young woman  The long workspace is full of tables at which conservatively dressed women are working making jewelry out of shellac a black resin which looks like jet  The police enter the harbour and the beggars are pushed back as the gates open and close for the police  Javert sees the destitution of the people expressionless as ever  As the riders enter the walled town we see the poor clustered around the gates destitute and sick people clammering to get in  Montreuil sits on an estuary leading out to the sea  The camera hurtles towards three horses riding down a long muddy road on a flat plain towards the walled town of MontreuilsurMer  The camera then starts to tumble back down through mist and cloud below through time and space down to discover ships sitting in low tide on the mud of the estuary along the dockside of the town and red brick factory buildings  One scrap of paper dances upwards in the sunlight  We follow this and accelerate upwards leaving Valjean and the town of Digne far below towards the sun breaking through the heavens with the alps beyond  Below lies the steep drop down the mountainside to the dark valley  The scraps flutter in the wind  We follow the scraps of yellow paper as they dance in the wind then fall away into the void below  He rips the yellow paper into pieces and throws the pieces out over the valley  Valjean comes out of the church into the graveyard and reaches a bell set on the edge of a promontory "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He rips the yellow paper into pieces and throws the pieces out over the valley Valjean comes out of the church into the graveyard and reaches a bell set on the edge of a promontory The scraps flutter in the wind We follow the scraps of yellow paper as they dance in the wind then fall away into the void below We follow this and accelerate upwards leaving Valjean and the town of Digne far below towards the sun breaking through the heavens with the alps beyond Below lies the steep drop down the mountainside to the dark valley The camera then starts to tumble back down through mist and cloud below through time and space down to discover ships sitting in low tide on the mud of the estuary along the dockside of the town and red brick factory buildings One scrap of paper dances upwards in the sunlight Montreuil sits on an estuary leading out to the sea The camera hurtles towards three horses riding down a long muddy road on a flat plain towards the walled town of MontreuilsurMer Javert sees the destitution of the people expressionless as ever As the riders enter the walled town we see the poor clustered around the gates destitute and sick people clammering to get in The long workspace is full of tables at which conservatively dressed women are working making jewelry out of shellac a black resin which looks like jet The police enter the harbour and the beggars are pushed back as the gates open and close for the police As he leans over to whisper in her ear Fantine surprised pricks her finger with her needle The Foreman has stopped beside Fantine a pretty young woman Fantine has taken out a letter The women start to take off their overalls and pack up their tools for the day Fantine tries to get the letter back The main factory woman snatches the letter away from Fantine The main factory woman starts to take Fantine's letter over to the Foreman The letter is passed surreptitiously down the line of women workers The owner enters the factory floor The women scuffle Suddenly Valjean sees Javert appear on the firstfloor balcony of his office Cleanshaven wellfed transformed it is Valjean On the factory floor His world drops away The Foreman pulls Fantine away Fantine continues to defend herself to the Foreman as the women sing Fantine turns and calls to Valjean in his office above with a pitiful cry Below and shows some demonstration samples of their work throwing a sharp glance Valjean walks back to the stairs up to his office"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Fantine has taken out a letter  The main factory woman snatches the letter away from Fantine  Fantine tries to get the letter back  The letter is passed surreptitiously down the line of women workers  The main factory woman starts to take Fantine's letter over to the Foreman  The women scuffle  The owner enters the factory floor  Cleanshaven wellfed transformed it's Valjean  Suddenly Valjean sees Javert appear on the firstfloor balcony of his office  His world drops away  On the factory floor  Fantine continues to defend herself to the Foreman as the women sing  The Foreman pulls Fantine away  Below  Fantine turns and calls to Valjean in his office above with a pitiful cry  Valjean walks back to the stairs up to his office and shows some demonstration samples of their work throwing a sharp glance Valjean comes out of the church into the graveyard and reaches a bell set on the edge of a promontory  He rips the yellow paper into pieces and throws the pieces out over the valley  We follow the scraps of yellow paper as they dance in the wind then fall away into the void below  The scraps flutter in the wind  Below lies the steep drop down the mountainside to the dark valley  We follow this and accelerate upwards leaving Valjean and the town of Digne far below towards the sun breaking through the heavens with the alps beyond  One scrap of paper dances upwards in the sunlight  The camera then starts to tumble back down through mist and cloud below through time and space down to discover ships sitting in low tide on the mud of the estuary along the dockside of the town and red brick factory buildings  The camera hurtles towards three horses riding down a long muddy road on a flat plain towards the walled town of MontreuilsurMer  Montreuil sits on an estuary leading out to the sea  As the riders enter the walled town we see the poor clustered around the gates destitute and sick people clammering to get in  Javert sees the destitution of the people expressionless as ever  The police enter the harbour and the beggars are pushed back as the gates open and close for the police  The long workspace is full of tables at which conservatively dressed women are working making jewelry out of shellac a black resin which looks like jet  The Foreman has stopped beside Fantine a pretty young woman  As he leans over to whisper in her ear Fantine surprised pricks her finger with her needle  The women start to take off their overalls and pack up their tools for the day "
        }
      ]
    }
  ]
}