{
  "ground_truth": "The judge is too stunned to respond, and he goes over to Valjean and gently leads him out. Meanwhile, Fantine starts to spasm and sees something over Valjean's shoulder. Her eyes go glassy as she passes away. Valjean then hears the unforgettable voice of Javert behind him and stands to face him. Javert draws his sword and aims it at Valjean, who breaks a section of timber beam from the roof. They sing at the same time, duelling in song, and the men start to circle each other. Meanwhile, Cosette goes to put the broom away as Madame Thenardier imitates her singing. We see Cosette's frightened eyes peering out from a tiny gap in the wall as Eponine comes in from outside. Madame Thenardier sees that Cosette, far from going, is hiding behind the far wall and goes outside to open up the rather pathetic frost fair stall on the porch of the inn. The innkeeper's gang, posing as customers who have been loitering outside, come in, explaining to a fifth man who is a newer recruit a story from Monsieur Thenardier's past, and Madame Thenardier ushers him inside. She pretends to accidentally drop a comb from her hair, and the customer helpfully picks it up, allowing Madame Thenardier to pick his wallet from a back pocket as he stands up. Thenardier has thieved the pocket watch using his handshake as a distraction and fusses over them, all the while pissing into the very wine bottle he's using to serve the customer. He is going through the groom's trousers elsewhere, while Cosette has filled her buckets at the well in the wood and is now heading back, going slowly because the buckets are heavy. After a few steps, she pauses to rest the weight of the buckets and looks up, amazed to see Valjean. Thenardier turns to his wife as Valjean gives him money, and then Valjean gives more money. He leads Cosette to the door and lifts her into the waiting cab as Madame Thenardier takes the bunch of notes from her husband's hand and inspects them. Through the open door, Thenardier sees a man on horseback rattling up to the inn, where Javert strides in. Valjean's cab, moving fast, passes down the road into the city. Inside the cab, Valjean has one arm around Cosette to protect her from the jolting as he gazes at her slipping into a fitful sleep. Valjean and Cosette turn down a narrow street, no longer hurrying, and make their way down a darkened street. They begin running down narrow alleys, into small dark courtyards, not knowing which way to turn, until Valjean finds a section of tumble-down wall and climbs over.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The arbiter is excessively astonished to reply, and he proceeds over to Valjean and softly guides him out. Meanwhile, Fantine commences to convulse and perceives something over Valjean's shoulder. Her optics become glazed as she expires. Valjean then perceives the indelible voice of Javert behind him and rises to confront him. Javert unsheathes his blade and directs it at Valjean, who fractures a portion of wooden beam from the ceiling. They vocalize simultaneously, duelling in melody, and the males begin to orbit each other. Meanwhile, Cosette goes to place the broom away as Madame Thenardier mimics her singing. We observe Cosette's terrified eyes gazing out from a small opening in the barricade as Eponine enters from outdoors. Madame Thenardier discerns that Cosette, far from departing, is concealing behind the far partition and steps outside to unveil the somewhat pitiful frost fair stall on the veranda of the inn. The innkeeper's group, masquerading as patrons who have been lingering outside, enter, recounting to a fifth individual who is a newer recruit a tale from Monsieur Thenardier's history, and Madame Thenardier beckons him inside. She feigns to inadvertently drop a comb from her hair, and the patron obligingly retrieves it, enabling Madame Thenardier to lift his billfold from a rear pocket as he rises. Thenardier has filched the pocket watch using his handshake as a diversion and fusses over them, all the while urinating into the very wine bottle he's utilizing to serve the patron. He is rifling through the groom's pantaloons elsewhere, while Cosette has filled her pails at the well in the forest and is now proceeding back, moving slowly because the pails are burdensome. After a few paces, she pauses to rest the heft of the pails and glances up, astonished to observe Valjean. Thenardier turns to his spouse as Valjean gives him currency, and then Valjean gives more currency. He guides Cosette to the portal and elevates her into the awaiting carriage as Madame Thenardier takes the bundle of bills from her spouse's hand and examines them. Through the open portal, Thenardier perceives a man on horseback clattering up to the inn, where Javert strides in. Valjean's carriage, moving swiftly, passes down the road into the metropolis. Inside the carriage, Valjean has one limb around Cosette to shield her from the jouncing as he gazes at her slipping into a disturbed slumber. Valjean and Cosette turn down a narrow avenue, no longer hastening, and make their way down a darkened lane. They commence running down narrow passages, into small dim courtyards, not knowing which way to turn, until Valjean discovers a portion of crumbling barricade and ascends over."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The judge is too stunned to respond, and Valjean is gently led out by him. Meanwhile, something is seen over Valjean's shoulder by Fantine as she starts to spasm. Her eyes go glassy as death takes her. Valjean then hears the unforgettable voice of Javert behind him and stands to face him. A sword is drawn by Javert and aimed at Valjean, who breaks a section of timber beam from the roof. A duel in song is performed by them simultaneously, and each man is circled by the other. Meanwhile, the broom is put away by Cosette as her singing is imitated by Madame Thenardier. We see frightened eyes peering out from a tiny gap in the wall as Eponine comes in from outside. Cosette, far from going, is seen hiding behind the far wall by Madame Thenardier, who goes outside to open up the rather pathetic frost fair stall on the porch of the inn. The innkeeper's gang, posing as customers who have been loitering outside, explains to a fifth man, a newer recruit, a story from Monsieur Thenardier's past, and the man is ushered inside by Madame Thenardier. She pretends to accidentally drop a comb from her hair, and the comb is helpfully picked up by the customer, allowing her to pick his wallet from a back pocket as he stands up. Thenardier has thieved the pocket watch using his handshake as a distraction and fusses over them, all the while pissing into the very wine bottle he's using to serve the customer. The groom's trousers are gone through by him elsewhere, while buckets have been filled by Cosette at the well in the wood and she is now heading back, going slowly because the buckets are heavy. After a few steps, the weight of the buckets is rested and Valjean is seen by her as she looks up, amazed. His wife is turned to by Thenardier as money is given to him by Valjean, and then more money is given by Valjean. Cosette is led to the door by him and lifted into the waiting cab as the bunch of notes is taken from her husband's hand and inspected by Madame Thenardier. Through the open door, a man on horseback rattling up to the inn is seen by Thenardier, where Javert strides in. The road into the city is passed down by Valjean's cab, moving fast. Inside the cab, one arm is placed around Cosette by Valjean to protect her from the jolting as she slips into a fitful sleep and he gazes at her. A narrow street is turned down by Valjean and Cosette, no longer hurrying, and their way is made down a darkened street. Narrow alleys are run down by them, into small dark courtyards, not knowing which way to turn, until a section of tumble-down wall is found by Valjean and climbed over."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The judge, too stunned to respond, gently leads Valjean out. Fantine spasms, sees something over Valjean's shoulder, and her eyes go glassy as she dies. Valjean hears Javert's unforgettable voice and turns to face him. Javert draws his sword, aiming at Valjean, who breaks a timber beam. They sing, dueling in song, circling each other. Meanwhile, Cosette puts the broom away as Madame Thenardier imitates her singing. Cosette's frightened eyes peer from a wall gap as Eponine enters. Madame Thenardier sees Cosette hiding and opens a pathetic frost fair stall on the porch. The innkeeper's gang, posing as customers, enters, explaining a story from Monsieur Thenardier's past to a new recruit. Madame Thenardier drops a comb, and a customer picks it up, allowing her to steal his wallet. Thenardier steals a pocket watch using a handshake and serves wine while urinating in the bottle. He searches the groom's trousers as Cosette, with heavy buckets, pauses and sees Valjean. Thenardier turns to his wife as Valjean gives him money, then more. Valjean leads Cosette to a cab, lifting her inside as Madame Thenardier inspects the money. Through the door, Thenardier sees a man on horseback as Javert enters. Valjean's cab speeds into the city. Inside, Valjean protects Cosette as she sleeps fitfully. They turn down a narrow street, no longer hurrying, and run through alleys and courtyards until Valjean climbs over a tumble-down wall."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The judge, stunned, gently leads Valjean out. Fantine spasms, sees something over Valjean's shoulder, and dies. Valjean hears Javert's voice, turns to face him, and they duel in song. Cosette puts away the broom as Madame Thenardier imitates her singing. Cosette hides, frightened, as Eponine enters. Madame Thenardier opens a stall outside, and the innkeeper's gang, posing as customers, enters. Madame Thenardier picks a customer's wallet while Thenardier steals a pocket watch, distracting with a handshake. He serves wine while urinating in the bottle. Cosette fills buckets at the well, sees Valjean, and pauses. Valjean gives Thenardier money, leads Cosette to a cab, and Madame Thenardier inspects the notes. Thenardier sees Javert arrive as Valjean's cab speeds away. Inside, Valjean protects Cosette as she sleeps. They turn down a narrow street, run through alleys and courtyards, and Valjean climbs over a wall."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The judge, utterly taken aback and too stunned to formulate a response, approaches Valjean with a gentle demeanor and carefully guides him out of the room. Meanwhile, Fantine begins to experience spasms and catches sight of something beyond Valjean's shoulder. Her eyes become unfocused and glassy as she quietly passes away. At that moment, Valjean hears the unforgettable and unmistakable voice of Javert behind him, prompting him to stand and face his adversary. Javert, with a determined expression, draws his sword and points it directly at Valjean, who, in response, breaks off a section of the timber beam from the roof. They engage in a musical duel, singing simultaneously, as they begin to circle each other with intensity. \n\nMeanwhile, Cosette, with a sense of duty, goes to put the broom away, while Madame Thenardier mockingly imitates her singing. We catch a glimpse of Cosette's frightened eyes peering out from a tiny gap in the wall as Eponine enters from outside. Madame Thenardier notices that Cosette, instead of leaving, is actually hiding behind the far wall. She then steps outside to open up the rather pathetic and meager frost fair stall situated on the porch of the inn. The innkeeper's gang, masquerading as customers who have been lingering outside, enter the inn, explaining to a fifth man, who is a newer recruit, a story from Monsieur Thenardier's past. Madame Thenardier ushers him inside with a welcoming gesture. She pretends to accidentally drop a comb from her hair, and the unsuspecting customer helpfully picks it up, allowing Madame Thenardier to deftly pick his wallet from a back pocket as he stands up. Thenardier, with practiced skill, has already pilfered the pocket watch, using his handshake as a clever distraction, and fusses over them, all the while urinating into the very wine bottle he's using to serve the customer. He is rummaging through the groom's trousers elsewhere, while Cosette has filled her buckets at the well in the wood and is now making her way back, moving slowly because the buckets are heavy. After a few steps, she pauses to rest the weight of the buckets and looks up, amazed to see Valjean standing there. Thenardier turns to his wife as Valjean hands him money, and then Valjean gives even more money. He leads Cosette to the door and gently lifts her into the waiting cab as Madame Thenardier takes the bunch of notes from her husband's hand and inspects them with a scrutinizing eye. Through the open door, Thenardier observes a man on horseback approaching the inn with a rattle, where Javert strides in with purpose. Valjean's cab, moving swiftly, travels down the road into the bustling city. Inside the cab, Valjean has one protective arm around Cosette to shield her from the jolting motion as he gazes at her slipping into a fitful sleep. Valjean and Cosette turn down a narrow street, no longer in a hurry, and make their way down a darkened street. They begin running down narrow alleys, into small, dimly lit courtyards, uncertain of which direction to take, until Valjean discovers a section of a tumble-down wall and climbs over it."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The judge, completely astonished and so utterly shocked that he becomes almost speechless, approaches Valjean with the utmost gentle manner. He guides him carefully and thoughtfully out of the room. Meanwhile, Fantine, lying there, starts to have spasms, catching a glimpse of something beyond Valjean’s shoulder. Her eyes slowly become unfocused and take on a glassy appearance as she quietly and peacefully passes away. In that very moment, Valjean hears the unforgettable, unmistakable voice of Javert coming from behind him, prompting him to stand swiftly and face his adversary. Javert, with an expression full of determination and resolve, draws his sharp sword, pointing it directly at Valjean. In response, Valjean breaks off a section of the timber beam that hangs from the roof. The two engage in a musical duel, singing with intensity and simultaneously, while they begin to circle each other with fervor. \n\nAt the same time, Cosette, feeling a sense of responsibility, moves to put away the broom, while Madame Thenardier stands by, mockingly imitating her singing voice. We catch a fleeting glimpse of Cosette’s frightened eyes peeking out from a tiny gap in the wall just as Eponine enters from outside. Madame Thenardier takes notice that Cosette, instead of leaving as expected, is actually hiding behind the far wall. She then steps outside to open up the rather pathetic and meager-looking frost fair stall that is situated on the porch of the inn. The innkeeper's gang, cleverly masquerading as customers who have been loitering outside, enters the inn, explaining to a fifth man, who happens to be a newer recruit, an intriguing story from Monsieur Thenardier’s past. Madame Thenardier warmly ushers him inside with a welcoming gesture, pretending to accidentally drop a comb from her hair. The unsuspecting customer helpfully picks it up, which provides Madame Thenardier the opportunity to deftly pick his wallet from his back pocket as he stands back up. Thenardier, with his practiced skill, has already managed to pilfer the pocket watch, using a handshake as a clever distraction, and fusses over the customers, all the while urinating into the very wine bottle he is using to serve them. Meanwhile, he is also rummaging through the groom's trousers elsewhere, while Cosette, having filled her buckets at the well in the woods, is now making her way back, moving slowly because the buckets are exceptionally heavy. After a few steps, she pauses to rest the weight of the buckets and looks up with amazement to see Valjean standing there. Thenardier turns to his wife as Valjean hands him some money, and then Valjean gives even more money. He gently leads Cosette to the door and carefully lifts her into the waiting cab as Madame Thenardier takes the bunch of notes from her husband’s hand and inspects them with a scrutinizing eye. Through the open door, Thenardier notices a man on horseback approaching the inn with a noisy rattle, where Javert strides in with purpose. Valjean’s cab, moving swiftly, travels down the road into the bustling, lively city streets. Inside the cab, Valjean has one protective arm wrapped around Cosette to shield her from the jolting motion as she begins to slip into a fitful sleep. Valjean and Cosette turn down a narrow street, no longer in a hurry, and make their way down a darkened street. They begin running down narrow alleys, into small, dimly lit courtyards, unsure of which direction to take, until Valjean discovers a section of a tumble-down wall and manages to climb over it."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The judge, overwhelmed and speechless, takes a moment to collect himself before moving towards Valjean, gently placing a hand on his arm to guide him out of the room. As this unfolds, Fantine, lying nearby, begins to convulse, her body shaking uncontrollably. Her eyes, wide and unfocused, fixate on something beyond Valjean's shoulder, and as her vision blurs, her eyes become glassy, signaling her passing. In the midst of this, Valjean is suddenly alerted by the unmistakable voice of Javert behind him. He turns to confront Javert, who, with a swift motion, draws his sword and points it menacingly at Valjean. In response, Valjean quickly assesses his surroundings and breaks off a section of timber beam from the roof to defend himself. The two men engage in a tense standoff, their voices rising in a simultaneous, intense duet as they begin to circle each other, each step calculated and deliberate. Meanwhile, in another part of the inn, Cosette quietly moves to put away the broom, her actions shadowed by Madame Thenardier, who mockingly mimics her singing. Cosette's frightened eyes peek through a small gap in the wall, watching as Eponine enters from outside. Madame Thenardier, noticing that Cosette is not where she should be, realizes she is hiding behind the far wall. She steps outside to open the meager frost fair stall on the inn's porch. The innkeeper's gang, disguised as customers, loiter outside before entering, engaging a newer recruit with tales of Monsieur Thenardier's past exploits. Madame Thenardier, with a practiced air of nonchalance, drops a comb from her hair, prompting a customer to bend down and retrieve it. As he stands, she deftly picks his wallet from his back pocket. Simultaneously, Thenardier, using a handshake as a diversion, stealthily steals a pocket watch and fusses over the customers, all while urinating into the wine bottle he serves them. Elsewhere, he rummages through the groom's trousers. Meanwhile, Cosette, having filled her buckets at the well in the woods, begins her slow return, the heavy buckets weighing her down. She pauses after a few steps to rest, her eyes widening in amazement as she spots Valjean. Thenardier turns to his wife as Valjean hands him money, and then more money, ensuring their cooperation. Valjean gently leads Cosette to the door, lifting her into the waiting cab. Madame Thenardier, seizing the opportunity, takes the bundle of notes from her husband's hand and scrutinizes them. Through the open door, Thenardier catches sight of a man on horseback approaching the inn, and Javert strides in with purpose. As Valjean's cab speeds down the road towards the city, inside, Valjean wraps an arm protectively around Cosette, shielding her from the jolting ride as he watches her drift into a restless sleep. The cab turns down a narrow street, their pace no longer hurried, and they proceed down a darkened street. Suddenly, they break into a run, darting through narrow alleys and into small, dim courtyards, uncertain of their direction, until Valjean discovers a section of crumbling wall and climbs over, leading them to safety."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The judge, too stunned to respond, gently leads Valjean out as Fantine spasms, sees something over Valjean's shoulder, and passes away. Valjean hears Javert's unforgettable voice and turns to face him. Javert draws his sword, prompting Valjean to break a timber beam from the roof, and they engage in a musical duel while circling each other. Meanwhile, Cosette puts away the broom as Madame Thenardier imitates her singing. Cosette's frightened eyes peer from a gap in the wall as Eponine enters. Madame Thenardier notices Cosette hiding and goes outside to open a frost fair stall. The innkeeper's gang, posing as customers, enters and explains a story from Monsieur Thenardier's past to a new recruit, whom Madame Thenardier ushers inside. She drops a comb, and as a customer picks it up, she steals his wallet. Thenardier distracts another customer with a handshake to steal a pocket watch, all while urinating into a wine bottle he's serving. Meanwhile, Cosette fills her buckets at the well and slowly returns, pausing to rest and spotting Valjean. Thenardier turns to his wife as Valjean gives him money, then more, before leading Cosette to the door and lifting her into a waiting cab. Madame Thenardier inspects the money as Thenardier sees a man on horseback approaching, and Javert strides in. Valjean's cab speeds into the city, where he protects Cosette as she falls into a fitful sleep. They turn down a narrow street, slow their pace, and navigate darkened alleys and courtyards until Valjean finds a tumble-down wall to climb over."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The judge is too stunned to respond, and he, a respected figure in the town known for his stern judgments, goes over to Valjean and gently leads him out. Meanwhile, Fantine, who has suffered greatly due to her fall from grace in society after losing her job, starts to spasm and sees something over Valjean's shoulder. Her eyes go glassy as she passes away, leaving behind a life of hardship and unfulfilled dreams. Valjean then hears the unforgettable voice of Javert, a relentless police inspector obsessed with law and order, behind him and stands to face him. Javert, a man whose life is defined by his unwavering adherence to authority, draws his sword and aims it at Valjean, who breaks a section of timber beam from the roof. They sing at the same time, duelling in song, and the men start to circle each other, their voices echoing the tension of their clashing ideologies. Meanwhile, Cosette, a young girl who has lived a life of servitude under the Thenardiers, goes to put the broom away as Madame Thenardier imitates her singing with mockery. We see Cosette's frightened eyes peering out from a tiny gap in the wall, a place where she often hides to escape her harsh reality, as Eponine comes in from outside. Madame Thenardier, a woman skilled in deceit, sees that Cosette, far from going, is hiding behind the far wall and goes outside to open up the rather pathetic frost fair stall on the porch of the inn, a reminder of the family's struggling business. The innkeeper's gang, posing as customers who have been loitering outside, come in, explaining to a fifth man who is a newer recruit a story from Monsieur Thenardier's past, a history filled with schemes and tricks, and Madame Thenardier ushers him inside. She pretends to accidentally drop a comb from her hair, an old trick of hers, and the customer helpfully picks it up, allowing Madame Thenardier to pick his wallet from a back pocket as he stands up. Thenardier, a man who prides himself on his cunning, has thieved the pocket watch using his handshake as a distraction and fusses over them, all the while pissing into the very wine bottle he's using to serve the customer, an outrageous act of contempt. He is going through the groom's trousers elsewhere, while Cosette has filled her buckets at the well in the wood, a task she is all too familiar with, and is now heading back, going slowly because the buckets are heavy. After a few steps, she pauses to rest the weight of the buckets and looks up, amazed to see Valjean, who appears like a guardian angel to her. Thenardier turns to his wife as Valjean gives him money, trying to buy freedom for Cosette, and then Valjean gives more money to ensure no questions are asked. He leads Cosette to the door and lifts her into the waiting cab, a symbol of her escape from misery, as Madame Thenardier takes the bunch of notes from her husband's hand and inspects them with greed. Through the open door, Thenardier sees a man on horseback rattling up to the inn, where Javert strides in, his presence always marked by a sense of impending justice. Valjean's cab, moving fast, passes down the road into the city, where new possibilities await. Inside the cab, Valjean has one arm around Cosette to protect her from the jolting as he gazes at her slipping into a fitful sleep, a moment of peace after so much fear. Valjean and Cosette turn down a narrow street, no longer hurrying, and make their way down a darkened street, aware that they must remain vigilant. They begin running down narrow alleys, into small dark courtyards, not knowing which way to turn, until Valjean finds a section of tumble-down wall from the city's old fortifications and climbs over, leading them to a temporary refuge."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The judge is too stunned to respond and he goes over to Valjean and gently leads him out. Meanwhile Fantine starts to spasm and sees something over Valjean's shoulder. Her eyes go glassy as she passes away. Valjean then hears the unforgettable voice of Javert behind him and stands to face him. Javert draws his sword and aims it at Valjean who breaks a section of timber beam from the roof. They sing at the same time duelling in song and the men start to circle each other. Meanwhile Cosette goes to put the broom away as Madame Thenardier imitates her singing. We see Cosette's frightened eyes peering out from a tiny gap in the wall as Eponine comes in from outside. Madame Thenardier sees that Cosette far from going is hiding behind the far wall and goes outside to open up the rather pathetic frost fair stall on the porch of the inn. The innkeeper's gang posing as customers who have been loitering outside come in explaining to a fifth man who is a newer recruit a story from Monsieur Thenardier's past and Madame Thenardier ushers him inside. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. She pretends to accidentally drop a comb from her hair and the customer helpfully picks it up allowing Madame Thenardier to pick his wallet from a back pocket as he stands up. Thenardier has thieved the pocket watch using his handshake as a distraction and fusses over them all the while pissing into the very wine bottle he is using to serve the customer. He is going through the groom's trousers elsewhere while Cosette has filled her buckets at the well in the wood and is now heading back going slowly because the buckets are heavy. After a few steps she pauses to rest the weight of the buckets and looks up amazed to see Valjean. Thenardier turns to his wife as Valjean gives him money and then Valjean gives more money. He leads Cosette to the door and lifts her into the waiting cab as Madame Thenardier takes the bunch of notes from her husband's hand and inspects them. Through the open door Thenardier sees a man on horseback rattling up to the inn where Javert strides in. Valjean's cab moving fast passes down the road into the city. Inside the cab Valjean has one arm around Cosette to protect her from the jolting as he gazes at her slipping into a fitful sleep. Valjean and Cosette turn down a narrow street no longer hurrying and make their way down a darkened street. They begin running down narrow alleys into small dark courtyards not knowing which way to turn until Valjean finds a section of tumbledown wall and climbs over."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The judge is too stunned to respond and he goes over to Valjean and gently leads him out. Meanwhile Fantine starts to spasm and sees something over Valjean's shoulder. Her eyes go glassy as she passes away. Valjean then hears the unforgettable voice of Javert behind him and stands to face him. Javert draws his sword and aims it at Valjean who breaks a section of timber beam from the roof. They sing at the same time duelling in song and the men start to circle each other. Meanwhile Cosette goes to put the broom away as Madame Thenardier imitates her singing. We see Cosette's frightened eyes peering out from a tiny gap in the wall as Eponine comes in from outside. Madame Thenardier sees that Cosette far from going is hiding behind the far wall and goes outside to open up the rather pathetic frost fair stall on the porch of the inn. The innkeeper's gang posing as customers who have been loitering outside come in explaining to a fifth man who is a newer recruit a story from Monsieur Thenardier's past and Madame Thenardier ushers him inside. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. She pretends to accidentally drop a comb from her hair and the customer helpfully picks it up allowing Madame Thenardier to pick his wallet from a back pocket as he stands up. Thenardier has thieved the pocket watch using his handshake as a distraction and fusses over them all the while pissing into the very wine bottle he is using to serve the customer. He is going through the groom's trousers elsewhere while Cosette has filled her buckets at the well in the wood and is now heading back going slowly because the buckets are heavy. After a few steps she pauses to rest the weight of the buckets and looks up amazed to see Valjean. Thenardier turns to his wife as Valjean gives him money and then Valjean gives more money. He leads Cosette to the door and lifts her into the waiting cab as Madame Thenardier takes the bunch of notes from her husband's hand and inspects them. Through the open door Thenardier sees a man on horseback rattling up to the inn where Javert strides in. Valjean's cab moving fast passes down the road into the city. Inside the cab Valjean has one arm around Cosette to protect her from the jolting as he gazes at her slipping into a fitful sleep. Valjean and Cosette turn down a narrow street no longer hurrying and make their way down a darkened street. They begin running down narrow alleys into small dark courtyards not knowing which way to turn until Valjean finds a section of tumbledown wall and climbs over."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The judge is too stunned to respond and he goes over to Valjean and gently leads him out. Meanwhile Fantine starts to spasm and sees something over Valjean's shoulder. Her eyes go glassy as she passes away. Valjean then hears the unforgettable voice of Javert behind him and stands to face him. Javert draws his sword and aims it at Valjean who breaks a section of timber beam from the roof. He leads Cosette to the door and lifts her into the waiting cab as Madame Thenardier takes the bunch of notes from her husband's hand and inspects them. Through the open door Thenardier sees a man on horseback rattling up to the inn where Javert strides in. Valjean's cab moving fast passes down the road into the city. Inside the cab Valjean has one arm around Cosette to protect her from the jolting as he gazes at her slipping into a fitful sleep. Valjean and Cosette turn down a narrow street no longer hurrying and make their way down a darkened street. They begin running down narrow alleys into small dark courtyards not knowing which way to turn until Valjean finds a section of tumbledown wall and climbs over."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The judge is too stunned to respond and he goes over to Valjean and gently leads him out. Meanwhile Fantine starts to spasm and sees something over Valjean's shoulder. Inside the cab Valjean has one arm around Cosette to protect her from the jolting as he gazes at her slipping into a fitful sleep. Valjean and Cosette turn down a narrow street no longer hurrying and make their way down a darkened street. They begin running down narrow alleys into small dark courtyards not knowing which way to turn until Valjean finds a section of tumbledown wall and climbs over."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The rabbit is too confused to dance, and it hops over to the carrot and quickly nudges it away. Meanwhile, Daisy starts to giggle and notices something over the carrot's leaf. Her feet go wobbly as she dozes off. The carrot then hears the melodic laugh of the duck behind it and swivels to face it. The duck raises its umbrella and points it at the carrot, which snaps a chunk of baked bread from the ceiling. They whistle simultaneously, duelling in rhythm, and the creatures begin to leap around each other. Meanwhile, Poppy skips to stash the hat away as Lady Beetle mimics her whistling. We see Poppy's worried feet peeking out from a tiny hole in the forest as Rose trots in from beyond. Lady Beetle notices that Poppy, far from trotting away, is lurking behind the distant tree and scampers outside to reveal the rather shabby ice market booth on the edge of the meadow. The meadow's band, pretending to be explorers who have been pacing nearby, bounce in, narrating to a sixth fox who is an elder scout a tale from Mister Tortoise's history, and Lady Beetle encourages him indoors. She acts clumsily and lets an acorn fall from her dress, and the explorer kindly catches it, allowing Lady Beetle to grab his feather from a side basket as he stands straight. Tortoise has pilfered the hourglass using his embrace as a diversion and frets over them, all the while singing into the very honey jar he's using to share with the explorer. He is searching through the tailor's hat in another spot, while Poppy has re-filled her pails at the brook in the meadow and is now returning, moving quietly because the pails are heavy. After a few steps, she stops to balance the heft of the pails and glances up, surprised to spot the carrot. Tortoise turns to his partner as the carrot hands him marbles, and then the carrot offers more marbles. It guides Poppy to the gate and lifts her into the waiting sled as Lady Beetle snatches the stack of leaves from her partner's paw and examines them. Through the ajar gate, Tortoise notices a deer on skates tinkling up to the meadow, where the duck prances in. The carrot's sled, skidding swiftly, breezes along the path into the village. Inside the sled, the carrot has one leaf around Poppy to shield her from the jostling as it stares at her drifting into a peaceful nap. The carrot and Poppy weave down a narrow path, no longer rushing, and make their way through a dimly lit garden. They start dashing through tight avenues, into tiny shadowy yards, uncertain of which path to choose, until the carrot discovers a patch of crumbling fence and hops over."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The judge is too stunned to respond and gently leads Valjean out, as Fantine, seeing something over Valjean's shoulder, passes away. Javert appears, confronting Valjean with a drawn sword, leading to a sung duel as they circle each other. Meanwhile, Cosette puts away her broom with Madame Thenardier mimicking her singing. Cosette hides behind a wall while the innkeeper’s gang, posing as customers, share tales with a new recruit. Madame Thenardier steals the new customer's wallet while Monsieur Thenardier distracts another by pickpocketing his watch. Cosette, carrying heavy buckets, pauses and is amazed to see Valjean. Valjean pays Thenardier and takes Cosette to a waiting cab, while Madame Thenardier inspects the money. As Valjean's cab speeds to the city, Javert arrives at the inn. In the cab, Valjean comforts a sleepy Cosette. They navigate through dark streets and alleys, eventually climbing over a tumble-down wall to escape."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "They begin running down narrow alleys into small dark courtyards not knowing which way to turn until Valjean finds a section of tumbledown wall and climbs over Valjean and Cosette turn down a narrow street no longer hurrying and make their way down a darkened street  Inside the cab Valjean has one arm around Cosette to protect her from the jolting as he gazes at her slipping into a fitful sleep  Valjean's cab moving fast passes down the road into the city  Through the open door Thenardier sees a man on horseback rattling up to the inn where Javert strides in  He leads Cosette to the door and lifts her into the waiting cab as Madame Thenardier takes the bunch of notes from her husband's hand and inspects them  Thenardier turns to his wife as Valjean gives him money and then Valjean gives more money  After a few steps she pauses to rest the weight of the buckets and looks up amazed to see Valjean  He is going through the groom's trousers elsewhere while Cosette has filled her buckets at the well in the wood and is now heading back going slowly because the buckets are heavy  Thenardier has thieved the pocket watch using his handshake as a distraction and fusses over them all the while pissing into the very wine bottle he's using to serve the customer  She pretends to accidentally drop a comb from her hair and the customer helpfully picks it up allowing Madame Thenardier to pick his wallet from a back pocket as he stands up  The innkeeper's gang posing as customers who have been loitering outside come in explaining to a fifth man who is a newer recruit a story from Monsieur Thenardier's past and Madame Thenardier ushers him inside  Madame Thenardier sees that Cosette far from going is hiding behind the far wall and goes outside to open up the rather pathetic frost fair stall on the porch of the inn  We see Cosette's frightened eyes peering out from a tiny gap in the wall as Eponine comes in from outside  Meanwhile Cosette goes to put the broom away as Madame Thenardier imitates her singing  They sing at the same time duelling in song and the men start to circle each other  Javert draws his sword and aims it at Valjean who breaks a section of timber beam from the roof  Valjean then hears the unforgettable voice of Javert behind him and stands to face him  Her eyes go glassy as she passes away  Meanwhile Fantine starts to spasm and sees something over Valjean's shoulder  The judge is too stunned to respond and he goes over to Valjean and gently leads him out "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Meanwhile Fantine starts to spasm and sees something over Valjean's shoulder The judge is too stunned to respond and he goes over to Valjean and gently leads him out Valjean then hears the unforgettable voice of Javert behind him and stands to face him Her eyes go glassy as she passes away They sing at the same time duelling in song and the men start to circle each other Javert draws his sword and aims it at Valjean who breaks a section of timber beam from the roof We see Cosette's frightened eyes peering out from a tiny gap in the wall as Eponine comes in from outside Meanwhile Cosette goes to put the broom away as Madame Thenardier imitates her singing The innkeeper's gang posing as customers who have been loitering outside come in explaining to a fifth man who is a newer recruit a story from Monsieur Thenardier's past and Madame Thenardier ushers him inside Madame Thenardier sees that Cosette far from going is hiding behind the far wall and goes outside to open up the rather pathetic frost fair stall on the porch of the inn Thenardier has thieved the pocket watch using his handshake as a distraction and fusses over them all the while pissing into the very wine bottle he is using to serve the customer She pretends to accidentally drop a comb from her hair and the customer helpfully picks it up allowing Madame Thenardier to pick his wallet from a back pocket as he stands up After a few steps she pauses to rest the weight of the buckets and looks up amazed to see Valjean He is going through the groom's trousers elsewhere while Cosette has filled her buckets at the well in the wood and is now heading back going slowly because the buckets are heavy He leads Cosette to the door and lifts her into the waiting cab as Madame Thenardier takes the bunch of notes from her husband's hand and inspects them Thenardier turns to his wife as Valjean gives him money and then Valjean gives more money Valjean's cab moving fast passes down the road into the city Through the open door Thenardier sees a man on horseback rattling up to the inn where Javert strides in Valjean and Cosette turn down a narrow street no longer hurrying and make their way down a darkened street Inside the cab Valjean has one arm around Cosette to protect her from the jolting as he gazes at her slipping into a fitful sleep They begin running down narrow alleys into small dark courtyards not knowing which way to turn until Valjean finds a section of tumbledown wall and climbs over"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Thenardier has thieved the pocket watch using his handshake as a distraction and fusses over them all the while pissing into the very wine bottle he's using to serve the customer  He is going through the groom's trousers elsewhere while Cosette has filled her buckets at the well in the wood and is now heading back going slowly because the buckets are heavy  After a few steps she pauses to rest the weight of the buckets and looks up amazed to see Valjean  Thenardier turns to his wife as Valjean gives him money and then Valjean gives more money  He leads Cosette to the door and lifts her into the waiting cab as Madame Thenardier takes the bunch of notes from her husband's hand and inspects them  Through the open door Thenardier sees a man on horseback rattling up to the inn where Javert strides in  Valjean's cab moving fast passes down the road into the city  Inside the cab Valjean has one arm around Cosette to protect her from the jolting as he gazes at her slipping into a fitful sleep  Valjean and Cosette turn down a narrow street no longer hurrying and make their way down a darkened street  They begin running down narrow alleys into small dark courtyards not knowing which way to turn until Valjean finds a section of tumbledown wall and climbs over The judge is too stunned to respond and he goes over to Valjean and gently leads him out  Meanwhile Fantine starts to spasm and sees something over Valjean's shoulder  Her eyes go glassy as she passes away  Valjean then hears the unforgettable voice of Javert behind him and stands to face him  Javert draws his sword and aims it at Valjean who breaks a section of timber beam from the roof  They sing at the same time duelling in song and the men start to circle each other  Meanwhile Cosette goes to put the broom away as Madame Thenardier imitates her singing  We see Cosette's frightened eyes peering out from a tiny gap in the wall as Eponine comes in from outside  Madame Thenardier sees that Cosette far from going is hiding behind the far wall and goes outside to open up the rather pathetic frost fair stall on the porch of the inn  The innkeeper's gang posing as customers who have been loitering outside come in explaining to a fifth man who is a newer recruit a story from Monsieur Thenardier's past and Madame Thenardier ushers him inside  She pretends to accidentally drop a comb from her hair and the customer helpfully picks it up allowing Madame Thenardier to pick his wallet from a back pocket as he stands up "
        }
      ]
    }
  ]
}