{
  "ground_truth": "A soldier hurries off as Joe leads the group, and they pause to look back at the neighborhood under fire, with houses being destroyed as collateral damage. An explosion hits too close, causing the boys to scream and run between houses, tracked by explosions with varying proximity. They make it to a back door, enter a house, and take cover, silhouetted by explosion light from the windows. Out of breath, they find themselves in a strange kitchen when a loud explosion makes the light fixtures sway. Charles grabs a coke on the counter just as another loud blast occurs, accompanied by the sound of glass breaking and a creature roaring, visible in silhouette moving past the bay window, leading Joe to realize that the creature's presence coincides with the blasts. Joe runs, and the others follow, but as they reach the living room, a huge explosion blows out a wall, causing them all to fall, with Martin's leg ripped by concrete. Blood shows that Martin is in real pain, prompting Charles to use the tie from the curtains to fashion a tourniquet, which he wraps tightly around Martin's leg. Charles looks at Martin, cannot argue, and nods at Joe, who looks to Cary as Martin screams. Joe and Cary then run through the devastated neighborhood, past shattered houses and obliterated cars, the only figures in town. They stop at the graves, out of breath, and then run through the graveyard to a series of garage doors, trying the first with windows caked with dirt, then the second door, and finally a locked barn door. Together, they kick the door repeatedly until it opens, revealing a shed with a floor that drops forty feet down, with dirt piled along the sides. Catching their breath, Cary opens his backpack and takes out a Fourth of July sparkler.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A warrior rushes away as Joe guides the team, and they halt to glance back at the community under assault, with homes being demolished as incidental harm. A detonation strikes too near, causing the lads to shriek and dash between homes, tracked by detonations with differing closeness. They reach a rear portal, enter a home, and seek shelter, outlined by detonation illumination from the panes. Out of breath, they find themselves in a bizarre cooking area when a loud detonation makes the fixtures sway. Charles grabs a soda on the surface just as another loud blast occurs, accompanied by the noise of glass shattering and a beast bellowing, visible in outline moving past the bay pane, leading Joe to understand that the beast's presence coincides with the blasts. Joe races, and the others follow, but as they arrive at the sitting area, a massive detonation blows out a partition, causing them all to tumble, with Martin's limb torn by concrete. Blood shows that Martin is in actual agony, prompting Charles to use the tie from the drapes to create a tourniquet, which he wraps snugly around Martin's limb. Charles looks at Martin, cannot disagree, and nods at Joe, who looks to Cary as Martin shrieks. Joe and Cary then dash through the ravaged community, past shattered homes and annihilated vehicles, the only figures in town. They pause at the tombs, out of breath, and then dash through the cemetery to a series of garage portals, trying the first with panes caked with dirt, then the second portal, and finally a locked barn portal. Together, they kick the portal repeatedly until it opens, revealing a shed with a floor that drops forty feet down, with soil piled along the sides. Catching their breath, Cary opens his backpack and takes out a Fourth of July sparkler."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A soldier hurries off as the group is led by Joe, and they pause to look back at the neighborhood under fire, where collateral damage destroys houses. An explosion is caused too close, prompting the boys to scream and run between houses, as explosions with varying proximity track them. A back door is reached by them, and a house is entered, taking cover while they are silhouetted by explosion light from the windows. Out of breath, a strange kitchen is found by them when a loud explosion makes the light fixtures sway. A coke is grabbed by Charles on the counter just as another loud blast occurs, causing the sound of glass breaking and a creature to roar, visible in silhouette as it moves past the bay window, making Joe realize that the blasts coincide with the creature's presence. Joe runs, and the others follow, but as the living room is reached, a huge explosion blows out a wall, causing them all to fall, and Martin's leg is ripped by concrete. Blood shows that Martin is in real pain, which prompts Charles to fashion a tourniquet from the tie of the curtains, which is wrapped tightly around Martin's leg by him. Charles looks at Martin, cannot argue, and nods at Joe, who looks to Cary as Martin screams. Then, Joe and Cary run through the devastated neighborhood, past houses that have been shattered and cars that have been obliterated, being the only figures in town. They stop at the graves, out of breath, and then run through the graveyard to a series of garage doors, trying the first with windows caked with dirt, then the second door, and finally a locked barn door. They repeatedly kick the door together until it is opened, and a shed with a floor that drops forty feet down is revealed, with dirt piled along the sides. Catching their breath, Cary opens his backpack and takes out a Fourth of July sparkler."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A soldier rushes off as Joe leads the group, pausing to glance at the neighborhood under fire, with houses being destroyed by collateral damage. An explosion lands nearby, causing the boys to scream and run between houses, tracked by explosions of varying proximity. Reaching a back door, they enter a house and take cover, silhouetted by the explosion light. Out of breath in a strange kitchen, a loud explosion sways the light fixtures. Charles grabs a coke from the counter as another loud blast occurs, the sound of glass breaking, and a creature roars past the bay window, prompting Joe to realize the creature's presence coincides with the blasts. Joe runs with the others following, but a massive explosion in the living room blows out a wall, injuring Martin's leg with concrete. Blood shows Martin's pain, so Charles uses a curtain tie to make a tight tourniquet around his leg. Charles nods at Joe, who looks at Cary as Martin screams. Joe and Cary run through the devastated neighborhood, past shattered houses and obliterated cars, the only figures in town. They stop at graves, out of breath, then run to a series of garage doors, trying the first with dirt-caked windows, the second door, and finally a locked barn door. Together, they kick it until it opens, revealing a shed with a floor dropping forty feet, dirt piled along the sides. Catching their breath, Cary opens his backpack and removes a Fourth of July sparkler."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "As a soldier hurries off, Joe leads the group through a neighborhood under fire, with houses being destroyed. An explosion hits, making the boys scream and run between houses, tracked by nearby blasts. They reach a back door, enter a house, and take cover, silhouetted by explosion light. Out of breath in a strange kitchen, a loud blast sways the lights. Charles grabs a coke, and another blast breaks glass as a creature roars past the bay window, linking it to the blasts. Joe runs, followed by the others, but a huge explosion in the living room blows out a wall. Martin's leg is injured by concrete, showing blood. Charles makes a tourniquet from curtain ties for Martin, who screams as Joe and Cary run on. They pass shattered homes and cars, stopping at graves before running through a graveyard to several garage doors. After failing with two, they kick open a locked barn door, finding a shed with a floor that drops forty feet surrounded by dirt. Cary catches his breath, opens his backpack, and takes out a Fourth of July sparkler."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As Joe leads the group with determination, a soldier quickly hurries off, leaving the group to pause and anxiously glance back at the neighborhood under relentless fire. Houses are rapidly being destroyed, becoming mere collateral damage in the chaos. Suddenly, an explosion hits disturbingly close, prompting the boys to scream in panic and dash between the houses, all the while being tracked by explosions that vary in proximity, each more threatening than the last. They urgently make their way to a back door, swiftly entering a house to take cover. Inside, they are silhouetted by the intense light of explosions illuminating the windows. Breathless and in shock, they find themselves in what seems to be a strange and unfamiliar kitchen. \n\nWithout warning, a particularly loud explosion rocks the house, causing the light fixtures to sway precariously. Charles, acting on impulse, grabs a coke sitting on the counter mere moments before another loud blast reverberates through the air. This blast is coupled with the shattering sound of glass breaking and the terrifying roar of a creature, its silhouette ominously visible as it moves past the bay window. This chilling sight leads Joe to the urgent realization that the creature’s presence is directly linked with the thunderous blasts. Without hesitation, Joe starts running, and the others quickly follow suit. However, as they reach the living room, a massive explosion violently blows out a wall, sending them all tumbling to the ground. The chaos leaves Martin’s leg severely injured, ripped by flying concrete. Blood vividly shows that Martin is in genuine pain, a stark and terrifying reality.\n\nQuick-thinking Charles uses the tie from the curtains to create a makeshift tourniquet, wrapping it tightly around Martin’s leg in a desperate attempt to stop the bleeding. With a pained look, Charles gazes at Martin, unable to argue, and then nods in agreement at Joe, who looks with urgency to Cary as Martin screams in agony. Joe and Cary then sprint through the ravaged neighborhood, passing by shattered houses and obliterated cars, appearing as the lone figures in a desolate town. Eventually, they come to a halt at the graves, utterly breathless, before continuing their run through the graveyard toward a series of garage doors. They try the first door, its windows caked with layers of dirt, then move to the second door, and finally reach a stubbornly locked barn door. With determination, they repeatedly kick the door until it gives way, revealing a shed with a floor that precipitously drops forty feet down, flanked by piles of dirt along its sides. As they catch their breath, Cary opens his backpack and carefully takes out a Fourth of July sparkler."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With unwavering determination and a sense of urgency, Joe leads the group forward. Amidst this tense atmosphere, a soldier abruptly bolts away, causing the group to halt momentarily. They cast anxious glances back at the neighborhood, which is under a relentless and merciless barrage of fire. Houses, once homes, are rapidly being reduced to mere collateral damage amidst the chaos of destruction. In an instant, an explosion strikes disturbingly close, sending shockwaves of terror through the group. The boys scream in sheer panic and instinctively dash between the houses, all while being shadowed by a series of explosions that vary ominously in proximity, each more threatening than the last. Their immediate goal is to make it to a back door, and they urgently push forward, swiftly entering a house to take shelter. Inside, they are silhouetted by the intense flashes of light from the explosions that illuminate the windows. Breathless and in shock from their narrow escape, they find themselves standing in what appears to be a strange and unfamiliar kitchen, a stark contrast to the chaos outside.\n\nWithout any warning, a particularly loud explosion violently shakes the entire house, causing the light fixtures to sway dangerously overhead. Acting purely on impulse, Charles grabs a coke that is sitting on the counter, managing to do so mere moments before another deafening blast reverberates through the air. This blast is accompanied by the sound of shattering glass and the terrifying, guttural roar of an unknown creature. Its ominous silhouette becomes visible as it ominously moves past the bay window. This chilling sight sends a shiver down Joe's spine, leading to the urgent realization that the creature’s presence is directly linked to the thunderous blasts. Without hesitation, Joe breaks into a run, and the others quickly follow his lead. However, as they reach the living room, a massive explosion violently blows out an entire wall, sending them all tumbling helplessly to the ground. Amidst this chaos, Martin’s leg is severely injured, torn by the flying debris of concrete. Blood vividly oozes from the wound, starkly highlighting the genuine pain and terror of the situation.\n\nIn a moment of quick thinking, Charles uses the tie from the curtains to fashion a makeshift tourniquet, wrapping it tightly around Martin’s leg in a desperate attempt to stem the flow of blood. With a pained look of compassion, Charles gazes at Martin, knowing there is little time for debate. He nods in agreement at Joe, who looks with urgency toward Cary as Martin's screams echo in agony. Joe and Cary waste no time as they sprint through the ravaged neighborhood, passing by the haunting sights of shattered houses and obliterated cars, appearing as lone figures in a desolate, forsaken town. Their grueling pace eventually leads them to a halt at a set of graves, where they find themselves utterly breathless for a moment before continuing their desperate run through the eerily quiet graveyard toward a series of garage doors. They attempt the first door, its windows obscured by layers of accumulated dirt, then move swiftly to the second door, and finally reach a stubbornly locked barn door. Fueled by determination, they repeatedly kick the door until it finally yields, revealing a shed with a floor that dramatically drops forty feet down, surrounded by piles of dirt along its edges. Panting heavily as they catch their breath, Cary opens his backpack with care and retrieves a Fourth of July sparkler, gripping it tightly as though clinging to a fragment of hope amidst the chaos."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the soldier hastily makes his departure, Joe takes on the role of leader and guides the group forward, prompting them to halt momentarily and glance back at their neighborhood, now a chaotic scene with houses being destroyed as unintended casualties of the conflict. Suddenly, an explosion detonates alarmingly close, jolting the boys into a state of panic. Their instincts take over, causing them to scream and frantically dash between the houses, all the while accompanied by the relentless pursuit of explosions varying in proximity. In a desperate bid for safety, they manage to reach a back door, swiftly entering a house where they take cover, their figures darkened by the ominous glow of explosions through the windows. Breathing heavily and feeling disoriented, they find themselves in an unfamiliar kitchen. The atmosphere is abruptly shattered by a deafening explosion that sends light fixtures swinging perilously. Amidst the chaos, Charles deftly grabs a coke resting on the counter, his action punctuated by another loud blast, during which the terrifying sound of glass shattering fills the air and a creature, its silhouette menacing, moves past the bay window. It is at this moment that Joe connects the creature's ominous presence with the pattern of destructive blasts. Driven by urgency, Joe starts to flee, instinctively leading the others to follow suit. However, their escape is violently interrupted when a colossal explosion demolishes a wall in the living room, propelling them to the floor. In the aftermath, Martin finds his leg severely injured by concrete debris, the sight of blood confirming his intense pain. Reacting quickly, Charles resourcefully grabs a tie from the curtains and constructs a makeshift tourniquet, securing it tightly around Martin's wounded leg. Despite his own unease, Charles exchanges a determined look with Martin, who can't muster an argument, prompting Charles to nod towards Joe. With Martin's anguished screams resonating in their ears, Joe and Cary surge forward, navigating the devastated neighborhood, dodging past the ruins of shattered houses and obliterated vehicles, isolated in the eerily deserted town. Exhaustion clawing at their reserves, they stumble upon the graves, pausing only long enough to catch their breath before sprinting through the graveyard towards a row of garage doors. Methodically, they attempt to open the first door, its windows obscured by layers of dirt, then the second one, and finally reach a locked barn door. United in purpose, they forcefully kick the door until it yields, revealing a shed with a floor that dramatically plunges forty feet down, flanked by mounds of dirt along the sides. As they stand there, panting heavily, Cary reaches into his backpack and retrieves a Fourth of July sparkler, signaling their readiness for what lies ahead."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Joe leads the group as they hurriedly escape, glancing back at their neighborhood being destroyed. An explosion nearby sends them sprinting between houses until they find refuge in a house, lit by the light of nearby blasts. Out of breath in the kitchen, Charles grabs a coke just as another explosion causes the fixtures to sway. A creature's silhouette appears at the bay window, and Joe realizes the creature coincides with the blasts. Urgently, Joe runs with the others following, but a massive explosion in the living room topples them, injuring Martin. Blood indicates Martin's severe pain, prompting Charles to quickly apply a makeshift tourniquet using curtain fabric. Unable to protest, Charles nods at Joe, who signals Cary. Joe and Cary dash through the ravaged neighborhood, weaving past the debris of homes and vehicles, the only figures visible. They pause at the graves to catch their breath, continuing through a graveyard to several garage doors. After testing two, they break into a locked barn, discovering a shed with a precipitous drop inside. As they recuperate, Cary retrieves a sparkler from his backpack."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A soldier hurries off as Joe, a teenager known for his leadership skills honed through community activities, leads the group, and they pause to look back at the neighborhood under fire, with houses being destroyed as collateral damage in the conflict that erupted unexpectedly in the peaceful suburb. An explosion hits too close, its force akin to a small earthquake, causing the boys to scream and run between houses, tracked by explosions with varying proximity reminiscent of a dangerous battlefield. They make it to a back door, enter a house once filled with laughter from family gatherings, and take cover, silhouetted by explosion light from the windows, creating a haunting scene akin to a war-torn movie set. Out of breath, they find themselves in a strange kitchen, its layout unfamiliar, when a loud explosion makes the light fixtures sway like chandeliers in an old mansion. Charles grabs a coke on the counter, a rare comfort amidst chaos, just as another loud blast occurs, accompanied by the sound of glass breaking and a creature roaring, echoing like a legend from a horror tale, visible in silhouette moving past the bay window, leading Joe to realize that the creature's presence coincides with the blasts, much like a harbinger of destruction. Joe runs, and the others follow, but as they reach the living room, once the heart of the home, a huge explosion blows out a wall, causing them all to fall, with Martin's leg ripped by concrete, a grim reminder of the power of uncontrolled violence. Blood shows that Martin is in real pain, prompting Charles to use the tie from the curtains to fashion a tourniquet, a skill perhaps once learned in a first-aid class, which he wraps tightly around Martin's leg. Charles looks at Martin, cannot argue, and nods at Joe, who looks to Cary as Martin screams, his cry echoing through the destroyed home. Joe and Cary then run through the devastated neighborhood, past shattered houses and obliterated cars, once symbols of happy family life, the only figures in the eerily silent town. They stop at the graves, marked by headstones dating back decades, out of breath, and then run through the graveyard towards a series of garage doors, trying the first with windows caked with dirt, a testament to years of neglect, then the second door, and finally a locked barn door. Together, they kick the door repeatedly until it opens, revealing a shed with a floor that drops forty feet down, an unexpected plunge akin to a mine shaft, with dirt piled along the sides. Catching their breath, Cary opens his backpack and takes out a Fourth of July sparkler, a nostalgic remnant from happier times of celebration."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "A soldier hurries off as Joe leads the group and they pause to look back at the neighborhood under fire with houses being destroyed as collateral damage Catching their breath Cary opens his backpack and takes out a Fourth of July sparkler A soldier hurries off as Joe leads the group and they pause to look back at the neighborhood under fire with houses being destroyed as collateral damage Charles grabs a coke on the counter just as another loud blast occurs accompanied by the sound of glass breaking and a creature roaring visible in silhouette moving past the bay window leading Joe to realize that the creature's presence coincides with the blasts An explosion hits too close causing the boys to scream and run between houses tracked by explosions with varying proximity Together they kick the door repeatedly until it opens revealing a she would with a floor that drops forty feet down with dirt piled along the sides They make it to a back door enter a house and take cover silhouetted by explosion light from the windows Out of breath they find themselves in a strange kitchen when a loud explosion makes the light fixtures sway Charles grabs a coke on the counter just as another loud blast occurs accompanied by the sound of glass breaking and a creature roaring visible in silhouette moving past the bay window leading Joe to realize that the creature's presence coincides with the blasts Joe runs and the others follow but as they reach the living room a huge explosion blows out a wall causing them all to fall with Martin's leg ripped by concrete Blood shows that Martin is in real pain prompting Charles to use the tie from the curtains to fashion a tourniquet which he wraps tightly around Martin's leg Charles looks at Martin cannot argue and nods at Joe who looks to Cary as Martin screams Joe and Cary then run through the devastated neighborhood past shattered houses and obliterated cars the only figures in town They stop at the graves out of breath and then run through the graveyard to a series of garage doors trying the first with windows caked with dirt then the second door and finally a locked barn door Out of breath they find themselves in a strange kitchen when a loud explosion makes the light fixtures sway An explosion hits too close causing the boys to scream and run between houses tracked by explosions with varying proximity Together they kick the door repeatedly until it opens revealing a she would with a floor that drops forty feet down with dirt piled along the sides Catching their breath Cary opens his backpack and takes out a Fourth of July sparkler"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "A soldier hurries off as Joe leads the group and they pause to look back at the neighborhood under fire with houses being destroyed as collateral damage. An explosion hits too close causing the boys to scream and run between houses tracked by explosions with varying proximity. They make it to a back door enter a house and take cover silhouetted by explosion light from the windows. Out of breath they find themselves in a strange kitchen when a loud explosion makes the light fixtures sway. Charles grabs a coke on the counter just as another loud blast occurs accompanied by the sound of glass breaking and a creature roaring visible in silhouette moving past the bay window leading Joe to realize that the creature's presence coincides with the blasts. Joe runs and the others follow but as they reach the living room a huge explosion blows out a wall causing them all to fall with Martin's leg ripped by concrete. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. Blood shows that Martin is in real pain prompting Charles to use the tie from the curtains to fashion a tourniquet which he wraps tightly around Martin's leg. Charles looks at Martin cannot argue and nods at Joe who looks to Cary as Martin screams. Joe and Cary then run through the devastated neighborhood past shattered houses and obliterated cars the only figures in town. They stop at the graves out of breath and then run through the graveyard to a series of garage doors trying the first with windows caked with dirt then the second door and finally a locked barn door. Together they kick the door repeatedly until it opens revealing a she would with a floor that drops forty feet down with dirt piled along the sides. Catching their breath Cary opens his backpack and takes out a Fourth of July sparkler."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "A soldier hurries off as Joe leads the group and they pause to look back at the neighborhood under fire with houses being destroyed as collateral damage. An explosion hits too close causing the boys to scream and run between houses tracked by explosions with varying proximity. They make it to a back door enter a house and take cover silhouetted by explosion light from the windows. Out of breath they find themselves in a strange kitchen when a loud explosion makes the light fixtures sway. Charles grabs a coke on the counter just as another loud blast occurs accompanied by the sound of glass breaking and a creature roaring visible in silhouette moving past the bay window leading Joe to realize that the creature's presence coincides with the blasts. Joe runs and the others follow but as they reach the living room a huge explosion blows out a wall causing them all to fall with Martin's leg ripped by concrete. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Blood shows that Martin is in real pain prompting Charles to use the tie from the curtains to fashion a tourniquet which he wraps tightly around Martin's leg. Charles looks at Martin cannot argue and nods at Joe who looks to Cary as Martin screams. Joe and Cary then run through the devastated neighborhood past shattered houses and obliterated cars the only figures in town. They stop at the graves out of breath and then run through the graveyard to a series of garage doors trying the first with windows caked with dirt then the second door and finally a locked barn door. Together they kick the door repeatedly until it opens revealing a she would with a floor that drops forty feet down with dirt piled along the sides. Catching their breath Cary opens his backpack and takes out a Fourth of July sparkler."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "A soldier hurries off as Joe leads the group and they pause to look back at the neighborhood under fire with houses being destroyed as collateral damage. An explosion hits too close causing the boys to scream and run between houses tracked by explosions with varying proximity. They make it to a back door enter a house and take cover silhouetted by explosion light from the windows. They stop at the graves out of breath and then run through the graveyard to a series of garage doors trying the first with windows caked with dirt then the second door and finally a locked barn door. Together they kick the door repeatedly until it opens revealing a she would with a floor that drops forty feet down with dirt piled along the sides. Catching their breath Cary opens his backpack and takes out a Fourth of July sparkler."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "A soldier hurries off as Joe leads the group and they pause to look back at the neighborhood under fire with houses being destroyed as collateral damage. An explosion hits too close causing the boys to scream and run between houses tracked by explosions with varying proximity. Catching their breath Cary opens his backpack and takes out a Fourth of July sparkler."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A scientist hurries off as a giraffe leads the group, and they pause to look back at the neighborhood under fire, with houses being destroyed as collateral damage. An explosion hits too close, causing the cats to scream and run between houses, tracked by explosions with varying proximity. They make it to a back door, enter a house, and take cover, silhouetted by explosion light from the windows. Out of breath, they find themselves in a strange kitchen when a loud explosion makes the light fixtures sway. An elephant grabs a coke on the counter just as another loud blast occurs, accompanied by the sound of glass breaking and a creature roaring, visible in silhouette moving past the bay window, leading the giraffe to realize that the creature's presence coincides with the blasts. The giraffe runs, and the others follow, but as they reach the living room, a huge explosion blows out a wall, causing them all to fall, with a kangaroo's leg ripped by concrete. Blood shows that the kangaroo is in real pain, prompting the elephant to use the tie from the curtains to fashion a tourniquet, which the elephant wraps tightly around the kangaroo's leg. The elephant looks at the kangaroo, cannot argue, and nods at the giraffe, who looks to a penguin as the kangaroo screams. The giraffe and the penguin then run through the devastated neighborhood, past shattered houses and obliterated cars, the only figures in town. They stop at the graves, out of breath, and then run through the graveyard to a series of garage doors, trying the first with windows caked with dirt, then the second door, and finally a locked barn door. Together, they kick the door repeatedly until it opens, revealing a shed with a floor that drops forty feet down, with dirt piled along the sides. Catching their breath, the penguin opens his backpack and takes out a Fourth of July sparkler."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "A soldier hurries off as Joe leads the group, and they pause to look back at the carnival under fire, with tents being destroyed as collateral damage. A water balloon hits too close, causing the boys to scream and run between booths, tracked by fireworks with varying proximity. They make it to a side entrance, enter a tent, and take cover, silhouetted by pyrotechnic light from the flaps. Out of breath, they find themselves in a strange kitchen when a loud blast makes the banners sway. Charles grabs a lemonade on the counter just as another loud pop occurs, accompanied by the sound of balloons popping and a creature roaring, visible in silhouette moving past the cotton candy stand, leading Joe to realize that the creature's presence coincides with the blasts. Joe runs, and the others follow, but as they reach the funhouse, a huge firework blows out a wall, causing them all to fall, with Martin's leg ripped by plywood. Blood shows that Martin is in real pain, prompting Charles to use the ribbon from the streamers to fashion a tourniquet, which he wraps tightly around Martin's leg. Charles looks at Martin, cannot argue, and nods at Joe, who looks to Cary as Martin screams. Joe and Cary then run through the devastated carnival, past toppled ferris wheels and crushed carts, the only figures in town. They stop at the rides, out of breath, and then run through the fairground to a series of food stalls, trying the first with windows fogged up with grease, then the second door, and finally a locked equipment shed door. Together, they kick the door repeatedly until it opens, revealing a tent with a floor that drops forty feet down, with confetti piled along the sides. Catching their breath, Cary opens his backpack and takes out a New Year's Eve horn."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "A soldier loafs off as Joe guides the group, and they linger to glance back at the neighborhood under fire, with houses being rebuilt as collateral damage. An explosion misses too closely, causing the boys to laugh and saunter between houses, trailed by fireworks with varying proximity. They come to a back door, enter a house, and lounge, silhouetted by fireworks light from the windows. Panting, they find themselves in a cozy kitchen when a soft explosion makes the light fixtures dance. Charles snatches a coke on the counter just as another soft blast occurs, accompanied by the sound of glass playing and a creature humming, visible in silhouette moving past the bay window, leading Joe to suspect that the creature's presence coincides with the music. Joe strolls, and the others drift, but as they reach the living room, a gentle explosion patches a wall, causing them all to rise, with Martin's leg tickled by concrete. Laughter shows that Martin is in real delight, prompting Charles to use the tie from the curtains to fashion a belt, which he drapes loosely around Martin's leg. Charles glances at Martin, cannot argue, and winks at Joe, who gazes to Cary as Martin laughs. Joe and Cary then dance through the rejuvenated neighborhood, past repaired houses and restored cars, the only figures in town. They pause at the graves, chuckling, and then skip through the graveyard to a series of garage doors, trying the first with windows polished with dirt, then the second door, and finally a stubborn barn door. Together, they tap the door gently until it creaks open, revealing a shed with a floor that rises forty feet up, with dirt piled along the sides. Smiling, Cary opens his backpack and takes out a Fourth of July balloon."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A librarian hurries off as a satellite leads the parade, and they pause to look back at the aquarium under construction, with bicycles being destroyed as frequent damage. A waterfall hits too close, causing the pizza boxes to scream and run between elephants, tracked by puddles with varying proximity. They make it to a painting, enter a backpack, and take cover, silhouetted by waterfall light from the televisions. Out of breath, they find themselves in a strange cinema when a loud waterfall makes the mirrors sway. A squirrel grabs a suitcase on the treadmill just as another loud splash occurs, accompanied by the sound of feathers breaking and a robot roaring, visible in silhouette moving past the weather balloon, leading the satellite to realize that the robot's presence coincides with the splashes. The satellite runs, and the others follow, but as they reach the hammock, a huge waterfall blows out a bookshelf, causing them all to fall, with a spoon's handle ripped by cheesecake. Jam shows that the spoon is in real anguish, prompting the squirrel to use the leash from the hammocks to fashion a puzzle, which it wraps tightly around the spoon's handle. The squirrel looks at the spoon, cannot argue, and nods at the satellite, who looks to an apple as the spoon screams. The satellite and apple then run through the serene aquarium, past shattered bicycles and obliterated skateboards, the only shadows in town. They stop at the basements, out of breath, and then run through the basement to a series of lamp shades, trying the first with windows caked with frosting, then the second curtain, and finally a locked ladder door. Together, they kick the door repeatedly until it opens, revealing a warehouse with a carpet that drops forty feet down, with snow piled along the sides. Catching their breath, the apple opens its suitcase and takes out a birthday candle."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "A librarian creeps off as Alex directs the orchestra, and they pause to glance back at the festival under renovation, with tents being deconstructed as collateral repair. A siren blares too loud, causing the dancers to whisper and skip between tents, followed by sirens with varying intensity. They reach a side gate, enter a tent, and sit, illuminated by flashlight beams from the entrance. Out of breath, they find themselves in an unusual parlor when a loud siren makes the chandeliers sway. Samuel grabs a sandwich on the table just as another loud sound occurs, accompanied by the sound of wood splintering and a machine humming, visible in shadow moving past the curtain, leading Alex to perceive that the machine's activity coincides with the sounds. Alex dances, and the others trail, but as they enter the ballroom, a huge siren blows out a window, causing them all to stumble, with Jamie's arm scratched by glass. Marks show that Jamie is in real discomfort, prompting Samuel to use the napkin from the table to fashion a bandage, which he wraps securely around Jamie's arm. Samuel glances at Jamie, cannot contest, and gestures at Alex, who nods to Jordan as Jamie winces. Alex and Jordan then skip through the festival grounds, past collapsed tents and flattened booths, the only silhouettes in the area. They halt at the statues, out of breath, and then sprint through the sculpture garden to a row of storage sheds, testing the first with windows coated with dust, then the second door, and finally a sealed hangar door. Together, they pound the door repeatedly until it swings open, revealing a cabin with a floor that descends forty feet down, with boxes stacked along the sides. Catching their breath, Jordan opens his satchel and pulls out a New Year's Eve noisemaker."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "A soldier wanders off as Joe guides the group, and they halt to glance back at the village under siege, with trees being toppled as incidental damage. A firework bursts too close, causing the boys to laugh and skip between trees, followed by fireworks with varying nearness. They reach a front window, climb into a building, and hide, outlined by torchlight from the openings. Panting, they find themselves in a peculiar living room when a distant rumble makes the paintings tremble. Charles grabs a sandwich on the chair just as another distant pop occurs, accompanied by the sound of paper tearing and a creature bellowing, visible in outline gliding past the stained glass, leading Joe to understand that the creature's arrival aligns with the pops. Joe dances, and the others mimic, but as they enter the hallway, a giant rumble removes a doorway, causing them all to tumble, with Martin's arm bruised by bricks. Water shows that Martin is genuinely hurt, prompting Charles to use the ribbon from the blinds to fashion a makeshift bandage, which he ties loosely around Martin's arm. Charles glances at Martin, cannot contest, and gestures to Joe, who turns to Cary as Martin groans. Joe and Cary then skip through the ravaged village, past uprooted trees and demolished bicycles, the lone figures in town. They pause at the statues, breathless, and then dash through the park to a series of shop doors, testing the first with windows covered with mud, then the second door, and finally a chained shed door. Together, they shove the door repeatedly until it opens, uncovering a basement with a floor that drops twenty yards down, with rocks stacked along the sides. Regaining their breath, Cary opens his backpack and pulls out a carnival kazoo."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A librarian saunters away as Sam guides the entourage, and they linger to glance back at the festival under storm, with tents being dismantled as unintended consequence. A gust strikes too near, causing the dancers to gasp and dash between booths, monitored by breezes with varying intensity. They reach a cellar door, slip into a basement, and seek refuge, highlighted by lantern glow from the shutters. Winded, they find themselves in a peculiar laundry room when a sharp gust makes the curtains flutter. Frank snatches a sandwich on the table just as another sharp gust occurs, accompanied by the sound of wood snapping and a dinosaur roaring, visible in outline moving past the picture window, leading Sam to conclude that the dinosaur's appearance aligns with the gusts. Sam dashes, and the others trail, but as they enter the family room, a massive gust tears down a ceiling, causing them all to tumble, with Oliver's arm slashed by plaster. Scratches indicate that Oliver is in genuine distress, prompting Frank to use the vest from the drapes to create a bandage, which he secures snugly around Oliver's arm. Frank glances at Oliver, cannot dispute, and winks at Sam, who turns to Alex as Oliver howls. Sam and Alex then sprint through the ravaged festival, past dismantled tents and overturned stalls, the sole figures in town. They halt at the benches, breathless, and then race through the park to a line of tool sheds, trying the first with panes covered in grime, then the second latch, and finally a bolted wagon gate. Together, they pound the gate repeatedly until it swings open, revealing a loft with a platform that descends thirty meters down, with gravel heaped along the edges. Regaining their breath, Alex opens his satchel and pulls out a Valentine's Day candle."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Joe leads a group through a neighborhood under fire, dodging explosions as houses are destroyed. They take cover in a house's kitchen, illuminated by blasts. Charles grabs a coke amid another explosion and spots a creature outside, realizing its presence aligns with the blasts. A huge explosion in the living room injures Martin, prompting Charles to fashion a tourniquet for his leg. As Martin screams in pain, Joe and Cary run through the devastated town to a graveyard and force open a barn door revealing a deep shed. Cary then takes out a Fourth of July sparkler from his backpack."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Catching their breath Cary opens his backpack and takes out a Fourth of July sparkler Together they kick the door repeatedly until it opens revealing a she would with a floor that drops forty feet down with dirt piled along the sides They stop at the graves out of breath and then run through the graveyard to a series of garage doors trying the first with windows caked with dirt then the second door and finally a locked barn door Joe and Cary then run through the devastated neighborhood past shattered houses and obliterated cars the only figures in town Charles looks at Martin cannot argue and nods at Joe who looks to Cary as Martin screams Blood shows that Martin is in real pain prompting Charles to use the tie from the curtains to fashion a tourniquet which he wraps tightly around Martin's leg Joe runs and the others follow but as they reach the living room a huge explosion blows out a wall causing them all to fall with Martin's leg ripped by concrete Charles grabs a coke on the counter just as another loud blast occurs accompanied by the sound of glass breaking and a creature roaring visible in silhouette moving past the bay window leading Joe to realize that the creature's presence coincides with the blasts Out of breath they find themselves in a strange kitchen when a loud explosion makes the light fixtures sway They make it to a back door enter a house and take cover silhouetted by explosion light from the windows An explosion hits too close causing the boys to scream and run between houses tracked by explosions with varying proximity A soldier hurries off as Joe leads the group and they pause to look back at the neighborhood under fire with houses being destroyed as collateral damage"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Charles looks at Martin cannot argue and nods at Joe who looks to Cary as Martin screams Joe runs and the others follow but as they reach the living room a huge explosion blows out a wall causing them all to fall with Martin's leg ripped by concrete They make it to a back door enter a house and take cover silhouetted by explosion light from the windows Joe and Cary then run through the devastated neighborhood past shattered houses and obliterated cars the only figures in town They stop at the graves out of breath and then run through the graveyard to a series of garage doors trying the first with windows caked with dirt then the second door and finally a locked barn door Blood shows that Martin is in real pain prompting Charles to use the tie from the curtains to fashion a tourniquet which he wraps tightly around Martin's leg Catching their breath Cary opens his backpack and takes out a Fourth of July sparkler Out of breath they find themselves in a strange kitchen when a loud explosion makes the light fixtures sway Charles grabs a coke on the counter just as another loud blast occurs accompanied by the sound of glass breaking and a creature roaring visible in silhouette moving past the bay window leading Joe to realize that the creature's presence coincides with the blasts A soldier hurries off as Joe leads the group and they pause to look back at the neighborhood under fire with houses being destroyed as collateral damage An explosion hits too close causing the boys to scream and run between houses tracked by explosions with varying proximity Together they kick the door repeatedly until it opens revealing a she would with a floor that drops forty feet down with dirt piled along the sides"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Blood shows that Martin is in real pain prompting Charles to use the tie from the curtains to fashion a tourniquet which he wraps tightly around Martin's leg Charles looks at Martin cannot argue and nods at Joe who looks to Cary as Martin screams Joe and Cary then run through the devastated neighborhood past shattered houses and obliterated cars the only figures in town They stop at the graves out of breath and then run through the graveyard to a series of garage doors trying the first with windows caked with dirt then the second door and finally a locked barn door Together they kick the door repeatedly until it opens revealing a she would with a floor that drops forty feet down with dirt piled along the sides Catching their breath Cary opens his backpack and takes out a Fourth of July sparkler A soldier hurries off as Joe leads the group and they pause to look back at the neighborhood under fire with houses being destroyed as collateral damage An explosion hits too close causing the boys to scream and run between houses tracked by explosions with varying proximity They make it to a back door enter a house and take cover silhouetted by explosion light from the windows Out of breath they find themselves in a strange kitchen when a loud explosion makes the light fixtures sway Charles grabs a coke on the counter just as another loud blast occurs accompanied by the sound of glass breaking and a creature roaring visible in silhouette moving past the bay window leading Joe to realize that the creature's presence coincides with the blasts Joe runs and the others follow but as they reach the living room a huge explosion blows out a wall causing them all to fall with Martin's leg ripped by concrete"
        }
      ]
    }
  ]
}