{
  "ground_truth": "A lighter is used to ignite something that is dropped, illuminating a tunnel at the bottom of a nearly-dug hole, indicating it is too far to jump. A jeep roars past with Jack driving and Louis sitting beside him. Their interaction is awkward but not angry, revealing moments of vulnerability, fear, and sadness. Jack offers a small nod of forgiveness and gratitude, which Louis silently accepts. Joe begins climbing down a rope into the dark hole, followed by Cary, with the barn roof overhead. Cry soon joins them at the bottom, where they face three possible ways to go. As they walk into the tall oval dirt tunnel, distant sparkly light is visible. They reach an area resembling a living room, beneath another hole dug through a house. Continuing, they encounter an intersection with a new tunnel, hearing mechanical rumbling grow louder. Joe and Cary cautiously advance, confronted by something off-camera that invokes fear and amazement. They cross to the other side, where Cary bumps into a hanging Sheriff Pruitt. Joe stops Cary from screaming and leads him away, noticing tunnels illuminated by makeshift hanging bulbs. Stunned by their surroundings, Joe spots something alarming, and Cary sees a human leg among metal and machinery. They suppress the urge to scream, Joe whispering in panic. Moving for a better view, Joe discovers three hanging human bodies in a rock-wall inset, including Alice, causing his heart to pound and his resolve to strengthen, which Cary sees too. Cary opens his backpack, preparing explosives and ensuring he’s unseen by the creature. Joe, with a lit sparkler for light, races to find another entrance into the creature’s space, reaching an intersection and vanishing down the tunnel.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A lighter is utilized to ignite something that is dropped, illuminating a passageway at the base of a nearly-dug pit, indicating it is too distant to leap. A jeep roars past with Jack driving and Louis sitting beside him. Their interaction is awkward but not angry, revealing instances of vulnerability, fear, and sadness. Jack offers a small nod of forgiveness and gratitude, which Louis silently accepts. Joe begins descending down a rope into the dark cavity, followed by Cary, with the barn roof above. Cry soon joins them at the base, where they face three potential paths to go. As they walk into the tall oval earth passageway, distant sparkling light is visible. They reach an area resembling a living room, beneath another pit dug through a house. Continuing, they encounter an intersection with a new passageway, hearing mechanical rumbling grow louder. Joe and Cary cautiously advance, confronted by something off-camera that invokes fear and amazement. They cross to the other side, where Cary bumps into a hanging Sheriff Pruitt. Joe stops Cary from screaming and leads him away, noticing passageways illuminated by makeshift hanging bulbs. Stunned by their surroundings, Joe spots something alarming, and Cary sees a human leg among metal and machinery. They suppress the urge to scream, Joe whispering in panic. Moving for a better view, Joe discovers three hanging human bodies in a rock-wall inset, including Alice, causing his heart to pound and his resolve to strengthen, which Cary sees too. Cary opens his backpack, preparing explosives and ensuring he’s unseen by the creature. Joe, with a lit sparkler for light, races to find another entrance into the creature’s space, reaching an intersection and vanishing down the passageway."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Something that had been dropped is ignited by a lighter, illuminating a tunnel at the bottom of a nearly-dug hole, indicating it is too far to jump. Jack drives a jeep past with Louis sitting beside him. Their interaction is awkward but not angry, revealing moments of vulnerability, fear, and sadness. A small nod of forgiveness and gratitude is offered by Jack and silently accepted by Louis. A rope is climbed down by Joe into the dark hole, followed by Cary, with the barn roof overhead. Cry soon joins them at the bottom, where three possible ways to go are faced by them. As the tall oval dirt tunnel is walked into, distant sparkly light is visible. They reach an area resembling a living room, beneath another hole that has been dug through a house. Continuing, an intersection with a new tunnel is encountered, and they hear mechanical rumbling grow louder. Joe and Cary cautiously advance and confront something off-camera that invokes fear and amazement. They cross to the other side, and Cary bumps into a hanging Sheriff Pruitt. Cary is stopped by Joe from screaming and led away, noticing tunnels illuminated by makeshift hanging bulbs. Their surroundings stun them, and Joe spots something alarming, and Cary sees a human leg among metal and machinery. The urge to scream is suppressed, and panic is whispered by Joe. Moving for a better view, Joe discovers three hanging human bodies in a rock-wall inset, including Alice, causing his heart to pound and his resolve to strengthen, which Cary sees too. His backpack is opened by Cary, and explosives are prepared, ensuring he’s unseen by the creature. With a lit sparkler for light, Joe races to find another entrance into the creature’s space, reaching an intersection and vanishing down the tunnel."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A lighter ignites something dropped, illuminating a tunnel at the bottom of a dug hole, too far to jump. A jeep speeds by with Jack driving and Louis beside him. Their interaction is awkward but reveals vulnerability, fear, and sadness. Jack nods forgiveness and gratitude, which Louis accepts silently. Joe climbs down a rope into the dark hole, followed by Cary, under the barn roof. Cry joins them, facing three paths. In a tall dirt tunnel, they see distant sparkly light and reach a living room-like area below another house hole. At a new tunnel intersection, they hear mechanical rumbling. Joe and Cary advance cautiously, confronted by something off-camera that evokes fear and amazement. They cross and Cary bumps into a hanging Sheriff Pruitt. Joe stops Cary from screaming, leading him away, noticing tunnels lit by hanging bulbs. Joe spots something alarming, and Cary sees a human leg amid metal and machinery. Suppressing screams, Joe whispers in panic. For a better view, Joe finds three hanging bodies in a rock-wall inset, including Alice, strengthening his resolve. Cary sees this too and prepares explosives, ensuring the creature doesn’t see him. Joe, lit sparkler in hand, races to find another entrance, reaching an intersection and vanishing down the tunnel."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A lighter ignites something that drops, lighting a tunnel at the bottom of a dug hole, indicating it's too far to jump. A jeep passes with Jack driving and Louis beside him. Their exchange is awkward yet not hostile, showing vulnerability and fear. Jack nods in gratitude, and Louis accepts. Joe climbs a rope into the hole, followed by Cary, with the barn roof overhead. Cry joins at the bottom with three ways to go. In the tall dirt tunnel, they see distant sparkly light, reaching a living-room-like area beneath a house. At a tunnel intersection, mechanical rumblings grow louder. Joe and Cary advance, confronted by something off-camera with fear and awe. They cross and Cary bumps into a hanging Sheriff Pruitt. Joe prevents Cary from screaming and leads him away, noticing tunnels lit by hanging bulbs. Startled, Joe spots something alarming, while Cary sees a human leg among machinery. Stifling screams, Joe whispers in panic. Moving for a better look, Joe finds three hanging bodies, including Alice, strengthening his resolve. Cary opens his backpack for explosives, ensuring the creature doesn’t see him. Joe, with a lit sparkler, races to find another entrance, reaching an intersection and disappearing down the tunnel."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A lighter is carefully used to ignite an object that is then dropped, casting light into a tunnel located at the base of a nearly-dug hole, clearly indicating that it is much too deep for anyone to leap across safely. Meanwhile, a jeep roars past, driven confidently by Jack with Louis seated beside him. Their interaction is marked by an awkward tension but not outright anger, revealing subtle moments of vulnerability, fear, and underlying sadness. Jack offers a small, almost imperceptible nod of forgiveness and gratitude, which Louis silently acknowledges and accepts. \n\nJoe begins the descent by cautiously climbing down a rope that leads into the shadowy depths of the dark hole, with Cary following closely behind him, while the barn roof looms overhead. Soon, Cry joins them at the base of the hole, where they are presented with three different paths to choose from. As they proceed into the towering, oval-shaped dirt tunnel, they notice a distant, sparkly light glimmering ahead. They eventually reach a peculiar area that bears a resemblance to a living room, positioned beneath another hole that has been dug right through a house. Continuing onward, they arrive at an intersection with an entirely new tunnel, and the mechanical rumbling sound grows increasingly louder. \n\nJoe and Cary proceed with caution, confronted by something just out of the camera's view that evokes both fear and amazement. They manage to cross over to the other side, where Cary unexpectedly bumps into the hanging body of Sheriff Pruitt. Joe quickly stops Cary from screaming in shock and leads him away, as they both take notice of tunnels that are eerily illuminated by makeshift bulbs hanging from above. Stunned by the strangeness of their surroundings, Joe catches sight of something alarming, while Cary notices a human leg entwined among the metal and machinery. They suppress their initial urge to scream, with Joe whispering urgently in panic. \n\nIn an effort to get a better view, Joe edges forward and discovers three hanging human bodies embedded within a rock-wall inset, one of which is Alice, causing his heart to pound furiously, yet strengthening his resolve, a sight that Cary also witnesses. Determined to act, Cary opens his backpack, carefully preparing explosives while ensuring he remains unseen by the lurking creature. Meanwhile, Joe, holding a lit sparkler to provide light, races through the tunnel, desperately searching for another entrance into the creature’s space, ultimately reaching an intersection and disappearing down the tunnel."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A lighter is meticulously and carefully used to ignite an object, which is subsequently dropped, casting a faint but noticeable light into the entrance of a tunnel situated at the bottom of a freshly-dug, expansive hole. This scene clearly and unmistakably indicates that the hole is far too deep and wide for anyone to leap across safely. Meanwhile, a jeep roars past with a thunderous noise, confidently driven by Jack while Louis sits beside him. Their interaction is marked by an awkward tension permeating the air, but not outright anger, revealing subtle moments of vulnerability, underlying fear, and a hidden sadness. Jack offers a small, almost imperceptible nod of both forgiveness and gratitude, which Louis silently acknowledges and accepts with understanding. \n\nIn parallel, Joe begins his cautious descent by carefully climbing down a durable rope leading into the shadowy depths of the ominously dark hole, with Cary following closely behind, while the imposing barn roof looms high overhead. Shortly afterwards, Cry joins them at the base of the hole, where they are presented with three distinct paths from which to choose. As they proceed further into the towering, oval-shaped dirt tunnel, they notice a distant, sparkly light glimmering tantalizingly ahead. Eventually, they reach a peculiar and unexpected area that astonishingly resembles a living room, positioned directly beneath another hole that has been dug straight through a house. Continuing onward, they reach an intersection that connects with an entirely new tunnel, and the mechanical rumbling sound echoing through the space grows increasingly louder and more ominous. \n\nJoe and Cary advance with utmost caution, confronted by an unseen entity just out of the camera's view that evokes both a deep sense of fear and amazement. They manage to cross to the other side, where Cary unexpectedly bumps into the hanging, lifeless body of Sheriff Pruitt. Joe swiftly stops Cary from screaming in shock and quickly leads him away, as they both take note of tunnels eerily illuminated by makeshift bulbs hanging precariously from above. Stunned and bewildered by the strangeness of their surroundings, Joe catches sight of something particularly alarming, while Cary notices a human leg grotesquely entwined among the jumble of metal and machinery. They suppress their initial urge to scream, with Joe urgently whispering in a state of panic. \n\nIn a bid to obtain a better vantage point, Joe gingerly edges forward and discovers three hanging human bodies embedded within a rock-wall inset, one of which tragically turns out to be Alice. This discovery causes his heart to pound furiously within his chest, yet paradoxically strengthens his resolve; a sight that Cary, standing nearby, also witnesses. Determined to take action, Cary opens his backpack, carefully and methodically preparing explosives while ensuring he remains stealthily unseen by the lurking creature. Meanwhile, Joe, holding a lit sparkler to provide much-needed light, races through the tunnel, desperately searching for another entrance into the creature's space, ultimately reaching an intersection and disappearing down the dark, foreboding tunnel."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A lighter flicks to life, its flame eagerly reaching out to ignite something that, once dropped, sends a cascade of light illuminating the depths of a tunnel at the bottom of a nearly-dug hole, clearly indicating it's too far to jump. As the scene shifts, a jeep suddenly roars past, with Jack gripping the wheel intently and Louis sitting tense beside him. Their interaction, though devoid of anger, bristles with awkwardness, as their eyes occasionally meet, revealing flickers of vulnerability, fear, and deep-seated sadness between them. In a moment of silent understanding, Jack offers Louis a small nod of forgiveness and gratitude, which Louis acknowledges with a somber acceptance. Meanwhile, Joe begins the precarious descent, gripping a rope tightly as he lowers himself into the dark, yawning hole. Cary follows closely behind, the barn's roof slowly disappearing from view above them. Cry soon joins them at the bottom, where they pause to survey their surroundings, considering the three potential paths that stretch out before them. Choosing one, they venture into the towering oval dirt tunnel, where distant, sparkly light flickers in the distance, guiding their way. As they continue, they stumble upon an area uncannily resembling a living room, which lies beneath another hole cut through a house above. Undeterred, they carry on until they reach an intersection where a new tunnel beckons, the mechanical rumbling surrounding them growing ominously louder. Joe and Cary advance cautiously, their steps tentative and hearts pounding, as something unseen off-camera grips them with both fear and amazement. They muster the courage to cross to the other side, but amidst the tension, Cary inadvertently collides with a hanging Sheriff Pruitt. Joe reacts quickly, stopping Cary from uttering a scream, and instead, guides him away with urgent whispers, casting wary glances at tunnels eerily illuminated by makeshift hanging bulbs. Amidst their awe-struck surveillance of their surroundings, Joe's gaze catches something alarming—a human leg intertwined among the gleam of metal and machinery—which sends a chill down his spine as Cary withholds a scream, echoing Joe’s panic in hushed tones. As they navigate for a better vantage point, Joe stumbles upon three human bodies suspended in a rock-wall inset, one of which is Alice, a sight that makes his heart race with both dread and determination. Cary witnesses this revelation too, prompting him to decisively open his backpack, stealthily preparing explosives while ensuring he remains unseen by the lurking creature. Meanwhile, Joe, clutching a lit sparkler for illumination, dashes into the shadows, driven by urgency to locate another entrance leading into the creature’s domain, his silhouette disappearing swiftly down the tunnel as he reaches an intersection."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A lighter is used to ignite a dropped object, briefly illuminating a tunnel at the bottom of a deep hole, suggesting it's too far to jump. Meanwhile, Jack drives a jeep with Louis beside him, their interaction revealing vulnerability and silent forgiveness. Joe, with Cary and later Cry, descends into the dark hole beneath a barn roof, encountering three paths. As they proceed through the tall oval dirt tunnel, they see a distant sparkly light and enter an area resembling a living room beneath another house. At an intersection, the sound of mechanical rumbling intensifies. Joe and Cary cautiously move forward, startled by an unseen presence that triggers fear and amazement. Crossing to the other side, Cary bumps into a hanging Sheriff Pruitt. Joe prevents Cary from screaming and guides him through tunnels lit by hanging bulbs. Stunned by their surroundings, they spot something alarming: Cary sees human remains among metal and machinery, while Joe discovers three hanging bodies, including Alice. This sight strengthens Joe's resolve and affects Cary. As Cary discreetly prepares explosives, Joe, using a lit sparkler for light, searches for another entrance into the creature’s space, quickly disappearing down a tunnel at an intersection."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A lighter, commonly fueled by butane, is used to ignite something that is dropped, illuminating a tunnel at the bottom of a nearly-dug hole, indicating it is too far to jump. A jeep, its engine echoing through the deserted landscape, roars past with Jack driving and Louis sitting beside him. Their interaction is awkward but not angry, revealing moments of vulnerability, fear, and sadness that suggest a complicated history between them. Jack offers a small nod of forgiveness and gratitude, which Louis silently accepts. Joe, a seasoned climber, begins descending the rope into the dark hole, followed by Cary, with the barn roof overhead providing meager shelter from the elements. Cry soon joins them at the bottom, where they face three possible ways to go. As they walk into the tall oval dirt tunnel, distant sparkly light reminiscent of distant stars glimmering in the night sky is visible. They reach an area resembling a living room, eerily situated beneath another hole dug through a house known for its long-abandoned state. Continuing, they encounter an intersection with a new tunnel, hearing mechanical rumbling grow louder, suggesting the presence of some large machinery or perhaps a vehicle. Joe and Cary cautiously advance, confronted by something off-camera that invokes fear and amazement, perhaps an unearthly creature or advanced technology. They cross to the other side, where Cary bumps into a hanging Sheriff Pruitt, known in town for his strict but fair demeanor. Joe stops Cary from screaming and leads him away, noticing tunnels illuminated by makeshift hanging bulbs crafted from old flashlights and lanterns. Stunned by their surroundings, Joe spots something alarming, and Cary sees a human leg among metal and machinery, indicating a gruesome scene. They suppress the urge to scream, Joe whispering in panic, fearing they'll alert whatever else might be lurking. Moving for a better view, Joe discovers three hanging human bodies in a rock-wall inset, including Alice, a local woman whose mysterious disappearance had left the community in despair, causing his heart to pound and his resolve to strengthen, which Cary sees too. Cary opens his backpack, preparing explosives he had learned to make from his days in the scouts, ensuring he’s unseen by the creature. Joe, with a lit sparkler for light, races to find another entrance into the creature’s space, reaching an intersection and vanishing down the tunnel."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "A lighter is used to ignite something that is dropped illuminating a tunnel at the bottom of a nearlydug hole indicating it is too far to jump. A jeep roars past with Jack driving and Louis sitting beside him. Their interaction is awkward but not angry revealing moments of vulnerability fear and sadness. Jack offers a small nod of forgiveness and gratitude which Louis silently accepts. Joe begins climbing down a rope into the dark hole followed by Cary with the barn roof overhead. Cry soon joins them at the bottom where they face three possible ways to go. As they walk into the tall oval dirt tunnel distant sparkly light is visible. They reach an area resembling a living room beneath another hole dug through a house. Continuing they encounter an intersection with a new tunnel hearing mechanical rumbling grow louder. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Joe and Cary cautiously advance confronted by something offcamera that invokes fear and amazement. They cross to the other side where Cary bumps into a hanging Sheriff Pruitt. Joe stops Cary from screaming and leads him away noticing tunnels illuminated by makeshift hanging bulbs. Stunned by their surroundings Joe spots something alarming and Cary sees a human leg among metal and machinery. They suppress the urge to scream. Joe whispering in panic. Moving for a better view Joe discovers three hanging human bodies in a rockwall inset including Alice causing his heart to pound and his resolve to strengthen which Cary sees too. Cary opens his backpack preparing explosives and ensuring he is unseen by the creature. Joe with a lit sparkler for light races to find another entrance into the creature’s space reaching an intersection and vanishing down the tunnel."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "A lighter is used to ignite something that is dropped illuminating a tunnel at the bottom of a nearlydug hole indicating it is too far to jump. A jeep roars past with Jack driving and Louis sitting beside him. Their interaction is awkward but not angry revealing moments of vulnerability fear and sadness. Jack offers a small nod of forgiveness and gratitude which Louis silently accepts. Joe begins climbing down a rope into the dark hole followed by Cary with the barn roof overhead. Cry soon joins them at the bottom where they face three possible ways to go. As they walk into the tall oval dirt tunnel distant sparkly light is visible. They reach an area resembling a living room beneath another hole dug through a house. Continuing they encounter an intersection with a new tunnel hearing mechanical rumbling grow louder. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Joe and Cary cautiously advance confronted by something offcamera that invokes fear and amazement. They cross to the other side where Cary bumps into a hanging Sheriff Pruitt. Joe stops Cary from screaming and leads him away noticing tunnels illuminated by makeshift hanging bulbs. Stunned by their surroundings Joe spots something alarming and Cary sees a human leg among metal and machinery. They suppress the urge to scream. Joe whispering in panic. Moving for a better view Joe discovers three hanging human bodies in a rockwall inset including Alice causing his heart to pound and his resolve to strengthen which Cary sees too. Cary opens his backpack preparing explosives and ensuring he is unseen by the creature. Joe with a lit sparkler for light races to find another entrance into the creature’s space reaching an intersection and vanishing down the tunnel."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "A lighter is used to ignite something that is dropped illuminating a tunnel at the bottom of a nearlydug hole indicating it is too far to jump. A jeep roars past with Jack driving and Louis sitting beside him. Their interaction is awkward but not angry revealing moments of vulnerability fear and sadness. Jack offers a small nod of forgiveness and gratitude which Louis silently accepts. Joe begins climbing down a rope into the dark hole followed by Cary with the barn roof overhead. Joe whispering in panic. Moving for a better view Joe discovers three hanging human bodies in a rockwall inset including Alice causing his heart to pound and his resolve to strengthen which Cary sees too. Cary opens his backpack preparing explosives and ensuring he is unseen by the creature. Joe with a lit sparkler for light races to find another entrance into the creature’s space reaching an intersection and vanishing down the tunnel."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "A lighter is used to ignite something that is dropped illuminating a tunnel at the bottom of a nearlydug hole indicating it is too far to jump. A jeep roars past with Jack driving and Louis sitting beside him. Cary opens his backpack preparing explosives and ensuring he is unseen by the creature. Joe with a lit sparkler for light races to find another entrance into the creature’s space reaching an intersection and vanishing down the tunnel."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "A flashlight is used to illuminate something that is tossed, darkening a cavern at the top of a half-built tower, indicating it is too close to swim. A bicycle glides past with Sam pedaling and Mina balancing beside him. Their exchange is friendly but not joyful, revealing instances of confidence, excitement, and happiness. Sam offers a slight wink of encouragement and humor, which Mina silently enjoys. Alex starts sliding up a ladder into the bright tower, followed by Dana, with the tree branches underneath. Drift soon leaves them at the top, where they face three potential paths to climb. As they crawl into the low square stone cavern, nearby shimmering darkness is visible. They encounter a space resembling a kitchen, above another tunnel carved through a basement. Advancing, they discover an exit with an old cavern, hearing hydraulic humming fade away. Alex and Dana fearlessly retreat, startled by something on-camera that invokes relief and amusement. They jump to the opposite side, where Dana stumbles upon a floating Officer Mills. Alex stops Dana from giggling and pulls him around, spotting caverns darkened by permanent floating lanterns. Amazed by their surroundings, Alex notices something comforting, and Dana glimpses a wooden arm beside cloth and furniture. They embrace the urge to giggle, Alex shouting in calmness. Shifting for a clearer view, Alex uncovers three floating wooden statues in a river-wall recess, including Oliver, causing his mind to race and his confidence to weaken, which Dana ignores too. Dana closes his duffel bag, dismantling fireworks and ensuring he’s noticed by the entity. Alex, with an extinguished torch for darkness, strolls to locate another exit from the entity’s area, approaching a split and appearing down the cavern."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A lighter ignites something dropped, illuminating a tunnel at the bottom of a deep hole, too far to jump. Jack drives a jeep with Louis, their interaction awkward yet forgiving. Joe descends into the dark hole with Cary and Cry, exploring three possible paths. In a dirt tunnel, they find a living room-like area and hear mechanical sounds. Joe and Cary advance with caution, encountering hanging Sheriff Pruitt. Joe stops Cary from screaming, noticing tunnels lit by makeshift bulbs. Startled by their surroundings, they see a human leg amid metal and machinery. Joe discovers three hanging bodies, including Alice, strengthening his resolve. Cary prepares explosives discreetly, while Joe races with a lit sparkler to find another entrance, disappearing into the tunnel."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Joe with a lit sparkler for light races to find another entrance into the creature’s space reaching an intersection and vanishing down the tunnel Cary opens his backpack preparing explosives and ensuring he is unseen by the creature Moving for a better view Joe discovers three hanging human bodies in a rockwall inset including Alice causing his heart to pound and his resolve to strengthen which Cary sees too Joe whispering in panic They suppress the urge to scream Stunned by their surroundings Joe spots something alarming and Cary sees a human leg among metal and machinery Joe stops Cary from screaming and leads him away noticing tunnels illuminated by makeshift hanging bulbs They cross to the other side where Cary bumps into a hanging Sheriff Pruitt Joe and Cary cautiously advance confronted by something offcamera that invokes fear and amazement Continuing they encounter an intersection with a new tunnel hearing mechanical rumbling grow louder They reach an area resembling a living room beneath another hole dug through a house As they walk into the tall oval dirt tunnel distant sparkly light is visible Cry soon joins them at the bottom where they face three possible ways to go Joe begins climbing down a rope into the dark hole followed by Cary with the barn roof overhead Jack offers a small nod of forgiveness and gratitude which Louis silently accepts Their interaction is awkward but not angry revealing moments of vulnerability fear and sadness A jeep roars past with Jack driving and Louis sitting beside him A lighter is used to ignite something that is dropped illuminating a tunnel at the bottom of a nearlydug hole indicating it is too far to jump"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "A jeep roars past with Jack driving and Louis sitting beside him A lighter is used to ignite something that is dropped illuminating a tunnel at the bottom of a nearlydug hole indicating it is too far to jump Jack offers a small nod of forgiveness and gratitude which Louis silently accepts Their interaction is awkward but not angry revealing moments of vulnerability fear and sadness Cry soon joins them at the bottom where they face three possible ways to go Joe begins climbing down a rope into the dark hole followed by Cary with the barn roof overhead They reach an area resembling a living room beneath another hole dug through a house As they walk into the tall oval dirt tunnel distant sparkly light is visible Joe and Cary cautiously advance confronted by something offcamera that invokes fear and amazement Continuing they encounter an intersection with a new tunnel hearing mechanical rumbling grow louder Joe stops Cary from screaming and leads him away noticing tunnels illuminated by makeshift hanging bulbs They cross to the other side where Cary bumps into a hanging Sheriff Pruitt They suppress the urge to scream Stunned by their surroundings Joe spots something alarming and Cary sees a human leg among metal and machinery Moving for a better view Joe discovers three hanging human bodies in a rockwall inset including Alice causing his heart to pound and his resolve to strengthen which Cary sees too Joe whispering in panic Joe with a lit sparkler for light races to find another entrance into the creature’s space reaching an intersection and vanishing down the tunnel Cary opens his backpack preparing explosives and ensuring he is unseen by the creature"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Joe and Cary cautiously advance confronted by something offcamera that invokes fear and amazement They cross to the other side where Cary bumps into a hanging Sheriff Pruitt Joe stops Cary from screaming and leads him away noticing tunnels illuminated by makeshift hanging bulbs Stunned by their surroundings Joe spots something alarming and Cary sees a human leg among metal and machinery They suppress the urge to scream Joe whispering in panic Moving for a better view Joe discovers three hanging human bodies in a rockwall inset including Alice causing his heart to pound and his resolve to strengthen which Cary sees too Cary opens his backpack preparing explosives and ensuring he is unseen by the creature Joe with a lit sparkler for light races to find another entrance into the creature’s space reaching an intersection and vanishing down the tunnel A lighter is used to ignite something that is dropped illuminating a tunnel at the bottom of a nearlydug hole indicating it is too far to jump A jeep roars past with Jack driving and Louis sitting beside him Their interaction is awkward but not angry revealing moments of vulnerability fear and sadness Jack offers a small nod of forgiveness and gratitude which Louis silently accepts Joe begins climbing down a rope into the dark hole followed by Cary with the barn roof overhead Cry soon joins them at the bottom where they face three possible ways to go As they walk into the tall oval dirt tunnel distant sparkly light is visible They reach an area resembling a living room beneath another hole dug through a house Continuing they encounter an intersection with a new tunnel hearing mechanical rumbling grow louder"
        }
      ]
    }
  ]
}