{
  "ground_truth": "Izzy opens another car hood and sees pieces missing. As Jack heads back to his car, three residents walk with him, ad lib, but he stops when he notices four military trucks driving past slowly, with antennas atop the trucks, and the men inside seemingly scanning the area, which disturbs him. Meanwhile, Joe rides along a hillside, parks his bike, and walks toward the edge, moving into the doorway where his dad and others convene. Joe hears something, drops his flashlight, and the men all turn silent, putting Joe on the spot. Later, Joe paints his model on the floor of his living room while watching \"In Search Of\" and talking to Charles on his walkie talkie. In the middle of nowhere, a wooded area sees an Ohio Power cherry picker truck drive up and park beside a utility pole. Rooney, 49, with a cigarette in his mouth, makes notes on a weathered clipboard, glances at the power line, and doesn't understand what he sees as we push in on him. He radios in. At a loud town meeting, two hundred frustrated citizens crowd the auditorium. Jack is at the podium with town officials, including the local mayor, sitting on stage as Mrs. Babbit, 52, speaks into the microphone on the floor. The town roars its approval, and Jack tries as the town erupts in agreement. A short, bald man of 65, Mr. McCandless, speaks, and the mayor takes over as Jack has a sidebar meeting with someone and continues into the office. We dolly fast with an exasperated Jack as he writes, tailed by someone, heading for his office, where he sees Louis being escorted out by an officer across the room. Louis heads out, and Jack holds on as he turns and enters his office. As that door opens, we cut to the door of Joe's messy, motherless room opening as Joe and Alice enter. Joe could not be more self-conscious as he moves stacks of comics, tosses some dirty clothes behind the bed, and hangs a bath towel on his desk chair. Alice looks around as she enters and sits on the bed. Joe takes the five-car train model, and Alice moves close, holding it as Joe watches her. She really looks at it, but their tension is interrupted by an out-of-breath Charles. Jack is with Officer Tally, 24, who puts a map on his desk showing 28 dots in a circle, anywhere from a 20 to 150-mile radius, with Lillian at the center, stunning Jack. Officer Rosko is at his desk with a young woman and a ham radio beside a reel-to-reel tape deck, taking notes. Cary is behind the camera, with Charles beside him, as we see Alice behind the camera, watching Joe and smiling.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Izzy unlocks another automobile hood and perceives components missing. As Jack returns to his automobile, three inhabitants stroll with him, spontaneously, but he halts when he observes four military transports driving past slowly, with antennas atop the transports, and the men inside seemingly examining the vicinity, which unsettles him. Meanwhile, Joe rides along a hillside, parks his bicycle, and strides toward the edge, advancing into the entrance where his dad and others assemble. Joe perceives something, drops his flashlight, and the men all become silent, putting Joe on the spot. Later, Joe paints his replica on the floor of his living room while watching \"In Search Of\" and conversing with Charles on his walkie-talkie. In the middle of nowhere, a wooded region sees an Ohio Power cherry picker vehicle drive up and park beside a utility pole. Rooney, 49, with a cigarette in his mouth, makes notes on a weathered clipboard, glances at the power line, and doesn't comprehend what he perceives as we push in on him. He radios in. At a loud town gathering, two hundred frustrated citizens crowd the auditorium. Jack is at the podium with town officials, including the local mayor, sitting on stage as Mrs. Babbit, 52, speaks into the microphone on the floor. The town roars its approval, and Jack attempts as the town erupts in agreement. A short, bald man of 65, Mr. McCandless, speaks, and the mayor assumes control as Jack has a sidebar meeting with someone and continues into the office. We dolly fast with an exasperated Jack as he writes, tailed by someone, heading for his office, where he perceives Louis being escorted out by an officer across the room. Louis heads out, and Jack holds on as he turns and enters his office. As that door opens, we cut to the door of Joe's messy, motherless room opening as Joe and Alice enter. Joe could not be more self-conscious as he moves stacks of comics, tosses some dirty apparel behind the bed, and hangs a bath towel on his desk chair. Alice looks around as she enters and sits on the bed. Joe takes the five-car train replica, and Alice moves close, holding it as Joe watches her. She really looks at it, but their tension is interrupted by an out-of-breath Charles. Jack is with Officer Tally, 24, who puts a chart on his desk showing 28 dots in a circle, anywhere from a 20 to 150-mile radius, with Lillian at the center, stunning Jack. Officer Rosko is at his desk with a young woman and a ham radio beside a reel-to-reel tape deck, taking notes. Cary is behind the camera, with Charles beside him, as we see Alice behind the camera, observing Joe and smiling."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Another car hood is opened by Izzy, and pieces are seen missing by her. As Jack walks back to his car, he is accompanied by three residents who ad lib, but they are stopped by him when four military trucks are noticed by him, driving past slowly, with antennas atop the trucks, and men inside scanning the area, which is disturbing to him. Meanwhile, Joe rides along a hillside, parks his bike, and toward the edge, he walks, entering the doorway where his dad and others convene. Something is heard by Joe, and his flashlight is dropped by him, causing the men to turn silent, putting Joe on the spot. Later, a model is painted by Joe on the floor of his living room while \"In Search Of\" is watched by him and a conversation is held with Charles on his walkie-talkie. In the middle of nowhere, an Ohio Power cherry picker truck drives up and parks beside a utility pole in a wooded area. Rooney, 49, with a cigarette in his mouth, makes notes on a weathered clipboard, and at the power line, he glances, failing to understand what he sees as he is pushed in on by us. He radios in. At a loud town meeting, the auditorium is crowded by two hundred frustrated citizens. The podium is occupied by Jack with town officials, including the local mayor, sitting on stage while Mrs. Babbit, 52, speaks into the microphone on the floor. Approval is roared by the town, and as the town erupts in agreement, Jack tries. Mr. McCandless, a short, bald man of 65, speaks, and the mayor takes over as Jack has a sidebar meeting with someone and continues into the office. We dolly fast with an exasperated Jack as he writes, tailed by someone, heading for his office, where Louis is seen being escorted out by an officer across the room. Out goes Louis, and as he turns and enters his office, Jack holds on. As that door opens, the door of Joe's messy, motherless room is cut to, opening as Joe and Alice enter. Joe could not be more self-conscious as stacks of comics are moved by him, some dirty clothes are tossed behind the bed, and a bath towel is hung on his desk chair. As she enters and sits on the bed, Alice looks around. The five-car train model is taken by Joe, and as she moves close, holding it, she is watched by Joe. It is really looked at by her, but their tension is interrupted by Charles, who is out of breath. Jack is with Officer Tally, 24, who puts a map on his desk showing 28 dots in a circle, anywhere from a 20 to 150-mile radius, with Lillian at the center, stunning Jack. Officer Rosko is at his desk with a young woman and a ham radio beside a reel-to-reel tape deck, taking notes. Alice is watched by Cary, who is behind the camera, with Charles beside him, as Joe is watched by her, smiling."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Izzy opens a car hood and finds parts missing. Jack heads to his car with three residents when he sees four military trucks pass slowly, antennas on top, men inside scanning the area, unsettling him. Meanwhile, Joe parks his bike on a hillside and approaches where his dad and others meet. Hearing something, Joe drops his flashlight, causing silence. Later, Joe paints a model in the living room, watches \"In Search Of,\" and talks to Charles via walkie-talkie. In a remote wooded area, an Ohio Power cherry picker parks by a utility pole. Rooney, 49, with a cigarette, makes notes, puzzled by the power line, and radios in. At a noisy town meeting, 200 frustrated citizens fill the auditorium. Jack, on stage with officials, struggles as Mrs. Babbit, 52, speaks, and the town erupts in agreement. Mr. McCandless, 65, speaks before the mayor, while Jack sidelines to meet someone. In his office, an exasperated Jack sees Louis escorted out by an officer. We transition to Joe's messy room as he and Alice enter. Joe, self-conscious, tidies up, and Alice sits on the bed. Joe hands her a train model as she examines it. Their moment is interrupted by an out-of-breath Charles. Jack, with Officer Tally, 24, sees a map with 28 dots in a circle, 20 to 150 miles radius, centered on Lillian, stunning him. Officer Rosko takes notes with a young woman and ham radio beside a tape deck. Cary holds the camera, Charles beside him, and Alice smiles at Joe behind the lens."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Izzy opens a car hood, finds pieces missing. Jack heads to his car, but stops, disturbed by four military trucks slowly passing with antennas, seemingly scanning. Joe bikes to a hillside, parks, approaches a doorway where his dad convenes with others. Joe hears something, drops his flashlight, silencing the men. Later, Joe paints a model in his living room, chatting with Charles via walkie talkie. An Ohio Power truck parks in a wooded area; Rooney, 49, smokes, makes notes, puzzled by the power line, and radios in. At a loud meeting, 200 citizens fill the auditorium. Jack speaks at the podium alongside officials, as Mrs. Babbit, 52, addresses the crowd. Mr. McCandless, 65, speaks briefly; the mayor takes over. Exasperated Jack leaves for his office, sees Louis escorted out, then enters. We cut to Joe's room; he and Alice enter. Joe tidies up, moves comics, hides clothes. Alice sits on the bed, inspects Joe's train model. Their moment is interrupted by breathless Charles. Jack, with Officer Tally, 24, sees a map with 28 dots in a circle centered on Lillian—it stuns him. Officer Rosko works with a young woman, ham radio, and tape deck. Cary films as Charles watches Alice behind the camera, smiling at Joe."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Izzy carefully opens yet another car hood only to be met with the disheartening sight of missing pieces scattered throughout the space. As Jack makes his way back towards his vehicle, he finds himself accompanied by three of the local residents who engage him in impromptu conversation. However, his steps come to an abrupt halt as he spots four military trucks driving by in a deliberate, slow procession. These trucks, notable for their towering antennas perched on top, are filled with men who seem to be meticulously scanning the surrounding area, a scene that leaves him visibly disturbed. Meanwhile, Joe is riding his bike along a picturesque hillside. He brings his bike to a stop, parks it, and proceeds to walk toward the edge of the hill, heading into the entrance where his father along with others are assembled. Joe becomes aware of a sound, unexpectedly drops his flashlight, and the men collectively fall silent, placing Joe in an awkward spotlight. \n\nLater on, Joe is found sitting on the floor of his living room, absorbed in painting his model while watching the engaging show \"In Search Of.\" Simultaneously, he maintains a conversation with Charles over his walkie-talkie. Meanwhile, in a secluded wooded area, an Ohio Power cherry picker truck arrives and parks alongside a lonely utility pole. Rooney, a 49-year-old man with a cigarette perched from his lips, busily makes notes on his weathered clipboard. He casts a puzzled glance at the power line above, unable to comprehend what he observes, and radios in for assistance.\n\nIn the midst of a raucous town meeting, a crowd of two hundred frustrated citizens fills the auditorium to capacity. Jack stands at the podium, flanked by town officials, including the local mayor who is seated on stage. Mrs. Babbit, who is 52 years old, speaks into the microphone from the floor, eliciting a roar of approval from the gathered townspeople. The crowd erupts in agreement as Jack valiantly attempts to address concerns. Mr. McCandless, a short, bald man of 65 years, stands to speak, allowing the mayor to take over. Jack is seen engaged in a sidebar meeting before continuing his path towards his office. We move quickly with an overwhelmed Jack as he writes, followed closely by an individual trailing behind him, heading towards his office. Upon arrival, he witnesses Louis being escorted out by an officer across the room. As Louis makes his exit, Jack remains composed, turning to enter his office. Just as the door swings open, we transition to the door of Joe's cluttered, motherless room as it opens to reveal Joe and Alice entering. Joe, feeling acutely self-conscious, hastily moves stacks of comics aside, tosses some dirty clothes behind the bed, and drapes a bath towel over his desk chair. Alice takes in the surroundings as she enters, ultimately settling herself on the bed. Joe retrieves the five-car train model, and Alice leans in, holding it with attentive care as Joe watches her closely. She truly examines it, but their moment of tension is abruptly disrupted by the breathless arrival of Charles. \n\nMeanwhile, Jack finds himself in the company of Officer Tally, a 24-year-old who has laid out a map on Jack's desk. This map reveals 28 dots forming a circle ranging from a 20 to 150-mile radius, with Lillian positioned at the center, leaving Jack in a state of stunned disbelief. Over at another desk, Officer Rosko is busy with his own work alongside a young woman. Beside them sits a ham radio next to a reel-to-reel tape deck, and Rosko diligently takes notes. Cary stands behind the camera, with Charles by his side, as we glimpse Alice behind the camera, watching Joe with a smile."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Izzy, with great care and attention to detail, slowly opens yet another car hood. Her anticipation quickly turns to disappointment as she is confronted with the disheartening and chaotic sight of missing pieces seemingly scattered all throughout the engine space. Meanwhile, Jack is making his way back to his vehicle when he finds himself joined by three local residents. These individuals strike up an impromptu conversation with him, engaging him in light-hearted chatter. Just as he is immersed in their dialogue, Jack's steps come to a sudden and unexpected halt. His attention is drawn to the deliberate, slow procession of four military trucks driving by. These imposing vehicles, distinguished by their towering antennas perched assertively on top, are filled with men who appear to be scanning the surrounding area meticulously, creating a scene that visibly disturbs Jack, leaving him with a sense of unease. \n\nAt the same time, Joe is riding his trusty bike along a picturesque hillside, enjoying the scenic view. He brings his bicycle to a stop, parks it securely, and proceeds on foot towards the edge of the hill. There, he enters the area where his father, along with others, is gathered. As Joe approaches, he suddenly becomes aware of an unexpected sound, prompting him to drop his flashlight inadvertently. The sound causes the men to collectively fall silent, placing Joe in an awkward and unintended spotlight, drawing attention to his presence. \n\nLater on, Joe is depicted sitting comfortably on the floor of his living room. He is deeply absorbed in painting his model while simultaneously watching the engaging show \"In Search Of\" on television. During this time, he maintains a lively conversation with Charles over his walkie-talkie. Meanwhile, in a secluded and densely wooded area, an Ohio Power cherry picker truck arrives and comes to a stop next to a solitary utility pole. Inside the truck, Rooney, a 49-year-old man with a cigarette hanging lazily from his lips, is engrossed in making notes on his weathered and well-used clipboard. He casts a puzzled and curious glance up at the power line above, bewildered by what he observes, and promptly radios in for assistance to better understand the situation. \n\nIn the midst of a raucous and high-energy town meeting, a frustrated crowd of two hundred agitated citizens fills the auditorium to its full capacity. Jack stands prominently at the podium, flanked by various town officials, with the local mayor seated on stage beside him. Mrs. Babbit, a 52-year-old passionate speaker, addresses the assembly from the floor into the microphone, eliciting a roar of approval and agreement from the gathered townspeople. The crowd erupts in a chorus of voices in agreement as Jack valiantly attempts to address their multitude of concerns. Mr. McCandless, a short and distinguished bald man of 65 years, rises to speak, after which he allows the mayor to take over the proceedings. Jack is later seen engaged in a sidebar meeting before he resumes his path toward his office. We swiftly follow the overwhelmed Jack as he writes down notes, being closely followed by an individual trailing behind him on the way to his office. Upon his arrival, he witnesses Louis being escorted out by an officer across the room. As Louis takes his exit, Jack remains composed and calm, turning to enter his office. As he opens the door, we transition to the door of Joe's cluttered and motherless room as it opens to reveal Joe and Alice entering together. Joe, feeling acutely self-conscious about the state of his room, hurriedly moves stacks of comics aside, tosses some dirty clothes behind the bed, and drapes a bath towel over his desk chair. Alice takes in the surroundings with interest as she enters and eventually settles herself on the bed. Joe then retrieves the impressive five-car train model, and Alice, showing genuine interest, leans in, holding it with attentive care as Joe watches her closely. Alice truly examines the model with keen interest, but their moment of tension is suddenly and abruptly disrupted by the breathless arrival of Charles.\n\nMeanwhile, Jack finds himself in the company of Officer Tally, a 24-year-old officer who has laid out a large map on Jack's desk. This detailed map reveals 28 distinctive dots forming a circle that ranges from a 20 to 150-mile radius, with Lillian positioned right at the center. The revelation leaves Jack in a state of stunned disbelief. Over at another desk in the office, Officer Rosko is busily engaged in his own work. He is accompanied by a young woman as he works diligently. Beside them sits a ham radio next to a reel-to-reel tape deck, and Rosko takes meticulous notes to document their observations. Cary stands confidently behind the camera, with Charles by his side, as we catch a glimpse of Alice behind the lens, watching Joe with a warm smile."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Izzy moves to open another car hood and carefully examines the interior, immediately noticing that several components are missing, prompting a puzzled expression. Concurrently, Jack makes his way back to his car, accompanied by three residents who engage in spontaneous conversation with him. As they walk, Jack's attention is abruptly captured by the sight of four military trucks slowly rolling by, each adorned with antennas extending from the tops, and he observes the men inside, who seem to be meticulously scanning their surroundings, which unsettles him significantly. Meanwhile, Joe calmly navigates along a hillside on his bike. Upon reaching an ideal spot, he parks the bike and strides toward the edge, approaching the doorway where his father and several others are gathered. Suddenly, Joe's ears catch an unexpected sound which causes him to drop his flashlight, creating a tense silence among the men present, leaving Joe feeling conspicuously on the spot. Later, Joe is sprawled on the floor of his living room, diligently painting his model while simultaneously watching \"In Search Of\" on television and maintaining a conversation with Charles through his walkie-talkie. In a remote, wooded area, an Ohio Power cherry picker truck drives up and comes to a halt beside a utility pole. Rooney, a 49-year-old man with a cigarette dangling from his mouth, jots down notes on a weathered clipboard. He casts a quizzical glance at the power line, clearly puzzled by what he observes as the camera zooms in on him. He promptly radios in to report the situation. In contrast, a loud town meeting unfolds where two hundred frustrated citizens pack the auditorium to capacity. Jack stands at the podium accompanied by town officials, including the local mayor, who sit on stage. Mrs. Babbit, 52, takes the microphone on the floor and speaks, which elicits a roaring approval from the townspeople, and as Jack attempts to speak, the town erupts in agreement once more. A short, bald man of 65, Mr. McCandless, takes his turn to speak, followed by the mayor assuming control while Jack has a sidebar conversation with someone before moving into an adjoining office. We swiftly follow an exasperated Jack as he writes notes while someone trails behind him, making his way purposefully to his office, where his gaze falls on Louis being escorted out by an officer across the room. As Louis exits, Jack momentarily pauses before turning to enter his office. The moment his office door swings open, the scene transitions to the door of Joe's messy, motherless room similarly opening as Joe and Alice step inside. Joe, feeling acutely self-conscious, begins to rearrange his room by moving stacks of comics aside, tossing stray dirty clothes behind the bed, and draping a bath towel over his desk chair. Alice takes in the room's state as she sits down on the bed. Joe picks up the five-car train model and hands it to Alice, who moves closer and carefully holds it, capturing Joe's attentive gaze. She examines the model closely, but their growing tension is suddenly interrupted by an out-of-breath Charles bursting in. Simultaneously, Jack is with Officer Tally, 24, who lays a map on Jack's desk, revealing 28 dots forming a circle spanning a radius of anywhere from 20 to 150 miles, with Lillian prominently at the center, leaving Jack visibly stunned. Nearby, Officer Rosko sits at his desk, beside a young woman and a ham radio positioned next to a reel-to-reel tape deck, diligently taking notes. Cary stands behind the camera while Charles is beside him, and we catch a glimpse of Alice behind the camera, watching Joe and offering a smile."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Izzy inspects another car hood and notices missing pieces. As Jack returns to his car, three residents join him briefly before he stops, disturbed by the sight of four military trucks passing slowly with antennas and men scanning the area. Meanwhile, Joe rides his bike along a hillside, parks, and joins his dad and others near a doorway. Hearing something, Joe drops his flashlight, causing the group to fall silent, putting him on the spot. Later, Joe paints a model in his living room while watching \"In Search Of\" and chatting with Charles on his walkie-talkie. In a remote wooded area, an Ohio Power cherry picker truck parks by a utility pole. Rooney, 49, jots down notes on a weathered clipboard, puzzled by the power line, and radios in for clarification. At a loud town meeting, two hundred frustrated citizens fill the auditorium. Jack stands at the podium with town officials as Mrs. Babbit, 52, speaks into the microphone, and the crowd erupts in agreement. Mr. McCandless, 65, takes the microphone, followed by the mayor, while Jack has a quick sidebar meeting and heads to his office, noticing Louis being escorted out. Jack then enters his office. As the door opens, we shift to Joe's messy room as he and Alice enter. Joe, self-conscious, tidies up by moving comics and hiding dirty clothes, while Alice sits on the bed. Joe shows Alice a five-car train model, and she examines it closely until Charles interrupts them, out of breath. Meanwhile, Jack and Officer Tally, 24, review a map on Jack's desk with 28 dots forming a circle centered on Lillian, stunning Jack. Officer Rosko sits at another desk with a young woman and a ham radio beside a reel-to-reel tape deck, taking notes. Cary films as Charles stands beside him, capturing Alice watching Joe and smiling."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Izzy, an experienced mechanic known for her ability to diagnose issues quickly, opens another car hood and sees pieces missing, suggesting possible thefts in the area. As Jack heads back to his car, three residents walk with him, improvising a conversation about recent events in their small town, but he stops when he notices four military trucks from the nearby base driving past slowly. These trucks, equipped with antennas, have men inside seemingly scanning the area, which disturbs him as it brings back memories of previous conflicts. Meanwhile, Joe rides along a hillside known for its panoramic views of the town, parks his bike, and walks toward the edge, moving into the doorway of an old barn where his dad and others convene. Joe hears something, drops his flashlight, and the men all turn silent, putting Joe, a young and curious observer, on the spot. Later, Joe paints his model on the floor of his living room while watching \"In Search Of,\" a popular TV show exploring mysteries, and talking to Charles on his walkie talkie, a favorite hobby among neighborhood kids. In the middle of nowhere, a wooded area near an abandoned railway sees an Ohio Power cherry picker truck drive up and park beside a utility pole. Rooney, 49, a lineman with years of field experience, with a cigarette in his mouth, makes notes on a weathered clipboard, glances at the power line, and doesn't understand what he sees, suggesting an unusual disturbance, as we push in on him. He radios in, alerting his team. At a loud town meeting in the historical community center, two hundred frustrated citizens crowd the auditorium. Jack is at the podium with town officials, including the local mayor, sitting on stage as Mrs. Babbit, 52, a well-respected community leader, speaks into the microphone on the floor. The town roars its approval, and Jack tries as the town erupts in agreement on recent budget changes. A short, bald man of 65, Mr. McCandless, a retired school principal, speaks, and the mayor takes over as Jack has a sidebar meeting with someone and continues into the office. We dolly fast with an exasperated Jack, known for his dedication to uncovering the truth, as he writes, tailed by someone, heading for his office, where he sees Louis, a known troublemaker, being escorted out by an officer across the room. Louis heads out, and Jack holds on as he turns and enters his office. As that door opens, we cut to the door of Joe's messy, motherless room opening as Joe and Alice enter. Joe could not be more self-conscious as he moves stacks of comics, popular among his peers, tosses some dirty clothes behind the bed, and hangs a bath towel on his desk chair. Alice looks around the room filled with posters and model planes as she enters and sits on the bed. Joe takes the five-car train model, a prized possession, and Alice moves close, holding it as Joe watches her. She really looks at it, but their tension is interrupted by an out-of-breath Charles, known for his spontaneous energy. Jack is with Officer Tally, 24, a new recruit eager to prove himself, who puts a map on his desk showing 28 dots in a circle, anywhere from a 20 to 150-mile radius, with Lillian, a nearby town rumored to have secretive government projects, at the center, stunning Jack. Officer Rosko is at his desk with a young woman interested in journalism and a ham radio beside a reel-to-reel tape deck, taking notes. Cary is behind the camera, with Charles beside him, as we see Alice behind the camera, watching Joe and smiling, capturing a moment of friendship."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "At a loud town meeting two hundred frustrated citizens crowd the auditorium The town roars its approval and Jack tries as the town erupts in agreement Izzy opens another car hood and sees pieces missing He radios in Izzy opens another car hood and sees pieces missing As Jack heads back to his car three residents walk with him ad lib but he stops when he notices four military trucks driving past slowly with antennas atop the trucks and the men inside seemingly scanning the area which disturbs him Meanwhile Joe rides along a hillside parks his bike and walks toward the edge moving into the doorway where his dad and others convene She really looks at it but their tension is interrupted by an outofbreath Charles Later Joe paints his model on the floor of his living room while watching In Search Of and talking to Charles on his walkie talkie Joe hears something drops his flashlight and the men all turn silent putting Joe on the spot Later Joe paints his model on the floor of his living room while watching In Search Of and talking to Charles on his walkie talkie In the middle of nowhere a wooded area sees an Ohio Power cherry picker truck drive up and park beside a utility pole A short bald man of 65 Mr McCandless speaks and the mayor takes over as Jack has a sidebar meeting with someone and continues into the office Rooney 49 with a cigarette in his mouth makes notes on a weathered clipboard glances at the power line and does not understand what he sees as we push in on him As Jack heads back to his car three residents walk with him ad lib but he stops when he notices four military trucks driving past slowly with antennas atop the trucks and the men inside seemingly scanning the area which disturbs him He radios in At a loud town meeting two hundred frustrated citizens crowd the auditorium Jack is at the podium with town officials including the local mayor sitting on stage as Mrs Babbit 52 speaks into the microphone on the floor The town roars its approval and Jack tries as the town erupts in agreement Officer Rosko is at his desk with a young woman and a ham radio beside a reeltoreel tape deck taking notes A short bald man of 65 Mr McCandless speaks and the mayor takes over as Jack has a sidebar meeting with someone and continues into the office We dolly fast with an exasperated Jack as he writes tailed by someone heading for his office where he sees Louis being escorted out by an officer across the room Joe hears something drops his flashlight and the men all turn silent putting Joe on the spot Louis heads out and Jack holds on as he turns and enters his office As that door opens we cut to the door of Joe's messy motherless room opening as Joe and Alice enter Joe could not be more selfconscious as he moves stacks of comics tosses some dirty clothes behind the bed and hangs a bath towel on his desk chair Alice looks around as she enters and sits on the bed Jack is with Officer Tally 24 who puts a map on his desk showing 28 dots in a circle anywhere from a 20 to 150mile radius with Lillian at the center Joe takes the fivecar train model and Alice moves close holding it as Joe watches her stunning Jack She really looks at it but their tension is interrupted by an outofbreath Charles Jack is with Officer Tally 24 who puts a map on his desk showing 28 dots in a circle anywhere from a 20 to 150mile radius with Lillian at the center stunning Jack Officer Rosko is at his desk with a young woman and a ham radio beside a reeltoreel tape deck taking notes Cary is behind the camera with Charles beside him as we see Alice behind the camera watching Joe and smiling"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Izzy opens another car hood and sees pieces missing. As Jack heads back to his car three residents walk with him ad lib but he stops when he notices four military trucks driving past slowly with antennas atop the trucks and the men inside seemingly scanning the area which disturbs him. Meanwhile Joe rides along a hillside parks his bike and walks toward the edge moving into the doorway where his dad and others convene. Joe hears something drops his flashlight and the men all turn silent putting Joe on the spot. Later Joe paints his model on the floor of his living room while watching In Search Of and talking to Charles on his walkie talkie. In the middle of nowhere a wooded area sees an Ohio Power cherry picker truck drive up and park beside a utility pole. Rooney 49 with a cigarette in his mouth makes notes on a weathered clipboard glances at the power line and does not understand what he sees as we push in on him. He radios in. At a loud town meeting two hundred frustrated citizens crowd the auditorium. Jack is at the podium with town officials including the local mayor sitting on stage as Mrs Babbit 52 speaks into the microphone on the floor. The town roars its approval and Jack tries as the town erupts in agreement. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. A short bald man of 65 Mr McCandless speaks and the mayor takes over as Jack has a sidebar meeting with someone and continues into the office. We dolly fast with an exasperated Jack as he writes tailed by someone heading for his office where he sees Louis being escorted out by an officer across the room. Louis heads out and Jack holds on as he turns and enters his office. As that door opens we cut to the door of Joe's messy motherless room opening as Joe and Alice enter. Joe could not be more selfconscious as he moves stacks of comics tosses some dirty clothes behind the bed and hangs a bath towel on his desk chair. Alice looks around as she enters and sits on the bed. Joe takes the fivecar train model and Alice moves close holding it as Joe watches her. She really looks at it but their tension is interrupted by an outofbreath Charles. Jack is with Officer Tally 24 who puts a map on his desk showing 28 dots in a circle anywhere from a 20 to 150mile radius with Lillian at the center. stunning Jack. Officer Rosko is at his desk with a young woman and a ham radio beside a reeltoreel tape deck taking notes. Cary is behind the camera with Charles beside him as we see Alice behind the camera watching Joe and smiling."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Izzy opens another car hood and sees pieces missing. As Jack heads back to his car three residents walk with him ad lib but he stops when he notices four military trucks driving past slowly with antennas atop the trucks and the men inside seemingly scanning the area which disturbs him. Meanwhile Joe rides along a hillside parks his bike and walks toward the edge moving into the doorway where his dad and others convene. Joe hears something drops his flashlight and the men all turn silent putting Joe on the spot. Later Joe paints his model on the floor of his living room while watching In Search Of and talking to Charles on his walkie talkie. In the middle of nowhere a wooded area sees an Ohio Power cherry picker truck drive up and park beside a utility pole. Rooney 49 with a cigarette in his mouth makes notes on a weathered clipboard glances at the power line and does not understand what he sees as we push in on him. He radios in. At a loud town meeting two hundred frustrated citizens crowd the auditorium. Jack is at the podium with town officials including the local mayor sitting on stage as Mrs Babbit 52 speaks into the microphone on the floor. The town roars its approval and Jack tries as the town erupts in agreement. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. A short bald man of 65 Mr McCandless speaks and the mayor takes over as Jack has a sidebar meeting with someone and continues into the office. We dolly fast with an exasperated Jack as he writes tailed by someone heading for his office where he sees Louis being escorted out by an officer across the room. Louis heads out and Jack holds on as he turns and enters his office. As that door opens we cut to the door of Joe's messy motherless room opening as Joe and Alice enter. Joe could not be more selfconscious as he moves stacks of comics tosses some dirty clothes behind the bed and hangs a bath towel on his desk chair. Alice looks around as she enters and sits on the bed. Joe takes the fivecar train model and Alice moves close holding it as Joe watches her. She really looks at it but their tension is interrupted by an outofbreath Charles. Jack is with Officer Tally 24 who puts a map on his desk showing 28 dots in a circle anywhere from a 20 to 150mile radius with Lillian at the center. stunning Jack. Officer Rosko is at his desk with a young woman and a ham radio beside a reeltoreel tape deck taking notes. Cary is behind the camera with Charles beside him as we see Alice behind the camera watching Joe and smiling."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Izzy opens another car hood and sees pieces missing. As Jack heads back to his car three residents walk with him ad lib but he stops when he notices four military trucks driving past slowly with antennas atop the trucks and the men inside seemingly scanning the area which disturbs him. Meanwhile Joe rides along a hillside parks his bike and walks toward the edge moving into the doorway where his dad and others convene. Joe hears something drops his flashlight and the men all turn silent putting Joe on the spot. Later Joe paints his model on the floor of his living room while watching In Search Of and talking to Charles on his walkie talkie. In the middle of nowhere a wooded area sees an Ohio Power cherry picker truck drive up and park beside a utility pole. Joe takes the fivecar train model and Alice moves close holding it as Joe watches her. She really looks at it but their tension is interrupted by an outofbreath Charles. Jack is with Officer Tally 24 who puts a map on his desk showing 28 dots in a circle anywhere from a 20 to 150mile radius with Lillian at the center. stunning Jack. Officer Rosko is at his desk with a young woman and a ham radio beside a reeltoreel tape deck taking notes. Cary is behind the camera with Charles beside him as we see Alice behind the camera watching Joe and smiling."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Izzy opens another car hood and sees pieces missing. As Jack heads back to his car three residents walk with him ad lib but he stops when he notices four military trucks driving past slowly with antennas atop the trucks and the men inside seemingly scanning the area which disturbs him. stunning Jack. Officer Rosko is at his desk with a young woman and a ham radio beside a reeltoreel tape deck taking notes. Cary is behind the camera with Charles beside him as we see Alice behind the camera watching Joe and smiling."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Max opens another car hood and sees pieces missing. As Trevor heads back to his car, three gardeners walk with him, ad lib, but he stops when he notices four ice cream trucks driving past slowly, with antennas atop the trucks, and the artists inside seemingly scanning the area, which disturbs him. Meanwhile, Sam rides along a hillside, parks his bike, and walks toward the edge, moving into the doorway where his uncle and others convene. Sam hears something, drops his flashlight, and the pilots all turn silent, putting Sam on the spot. Later, Sam paints his model on the floor of his living room while watching \"In Search Of\" and talking to Martin on his walkie talkie. In the middle of nowhere, a wooded area sees a Texas Power cherry picker truck drive up and park beside a utility pole. Thompson, 49, with a pencil in his mouth, makes notes on a weathered clipboard, glances at the power line, and doesn't understand what he sees as we push in on him. He radios in. At a loud town meeting, two hundred frustrated tourists crowd the auditorium. Trevor is at the podium with town officials, including the local sheriff, sitting on stage as Ms. Harper, 52, speaks into the microphone on the floor. The town roars its approval, and Trevor tries as the town erupts in agreement. A short, bald man of 65, Mr. Johnston, speaks, and the sheriff takes over as Trevor has a sidebar meeting with someone and continues into the office. We dolly fast with an exasperated Trevor as he writes, tailed by someone, heading for his office, where he sees Oliver being escorted out by a teacher across the room. Oliver heads out, and Trevor holds on as he turns and enters his office. As that door opens, we cut to the door of Sam's messy, motherless room opening as Sam and Emily enter. Sam could not be more self-conscious as he moves stacks of comics, tosses some dirty clothes behind the bed, and hangs a bath towel on his desk chair. Emily looks around as she enters and sits on the bed. Sam takes the five-car train model, and Emily moves close, holding it as Sam watches her. She really looks at it, but their tension is interrupted by an out-of-breath Martin. Trevor is with Detective Lee, 24, who puts a map on his desk showing 28 dots in a circle, anywhere from a 20 to 150-mile radius, with Madison at the center, stunning Trevor. Detective Blake is at his desk with a young woman and a ham radio beside a reel-to-reel tape deck, taking notes. Francis is behind the camera, with Martin beside him, as we see Emily behind the camera, watching Sam and smiling."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Izzy opens another boat hatch and sees components missing. As Jack heads back to his tram, three tourists walk with him, ad lib, but he stops when he notices four ice cream trucks driving past slowly, with balloons atop the trucks, and the men inside seemingly scanning the area, which disturbs him. Meanwhile, Joe rides along a boardwalk, parks his skateboard, and walks toward the edge, moving into the tent where his dad and others convene. Joe hears something, drops his magnifying glass, and the men all turn silent, putting Joe on the spot. Later, Joe paints his kite on the floor of his dining room while watching \"In Search Of\" and talking to Charles on his cell phone. In the middle of nowhere, a grassland area sees an Ohio Power fire engine drive up and park beside a fountain. Rooney, 49, with a toothpick in his mouth, makes notes on a tattered ledger, glances at the streetlight, and doesn't understand what he sees as we push in on him. He radios in. At a loud town meeting, two hundred frustrated citizens crowd the gymnasium. Jack is at the podium with town officials, including the local mayor, sitting on stage as Mrs. Babbit, 52, speaks into the loudspeaker on the floor. The town roars its approval, and Jack tries as the town erupts in agreement. A short, bald man of 65, Mr. McCandless, speaks, and the mayor takes over as Jack has a sidebar meeting with someone and continues into the library. We dolly fast with an exasperated Jack as he writes, tailed by someone, heading for his library, where he sees Louis being escorted out by an usher across the room. Louis heads out, and Jack holds on as he turns and enters his library. As that door opens, we cut to the door of Joe's cluttered, motherless den opening as Joe and Alice enter. Joe could not be more self-conscious as he moves stacks of novels, tosses some dirty socks behind the bed, and hangs a curtain on his desk chair. Alice looks around as she enters and sits on the bed. Joe takes the five-car circus model, and Alice moves close, holding it as Joe watches her. She really looks at it, but their tension is interrupted by an out-of-breath Charles. Jack is with Officer Tally, 24, who puts a photograph on his desk showing 28 points in a circle, anywhere from a 20 to 150-mile radius, with Lillian at the center, stunning Jack. Officer Rosko is at his desk with a young woman and a cassette player beside a turntable, taking notes. Cary is behind the easel, with Charles beside him, as we see Alice behind the easel, watching Joe and smiling."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Izzy paints another car hood and finds pieces rearranged. As Jack rushes back to his car, three residents skip with him, ad lib, but he pauses when he hears four military trucks hovering past slowly, with antennas atop the trucks, and the men inside seemingly humming the area, which amuses him. Meanwhile, Joe dances along a hillside, balances his bike, and skips toward the edge, pirouetting into the doorway where his dad and others relax. Joe smells something, tosses his flashlight, and the men all hum silently, putting Joe on edge. Later, Joe sculpts his model on the floor of his living room while listening to \"In Search Of\" and singing to Charles on his walkie talkie. In the middle of nowhere, a wooded area watches an Ohio Power cherry picker truck float up and hover beside a utility pole. Rooney, 49, with a cigarette in his mouth, sketches on a weathered clipboard, blinks at the power line, and interprets what he sees as we zoom in on him. He whistles in. At a noisy town meeting, two hundred chattering citizens fill the auditorium. Jack is behind the podium with town officials, including the local mayor, dancing on stage as Mrs. Babbit, 52, whispers into the microphone on the floor. The town rumbles with agreement, and Jack gestures as the town claps in harmony. A short, bald man of 65, Mr. McCandless, shouts, and the mayor dances over as Jack has a sidebar meeting with someone and strolls into the office. We glide fast with a puzzled Jack as he sketches, tailed by someone, floating for his office, where he sees Louis being guided out by an officer across the room. Louis skips out, and Jack grips on as he pivots and enters his office. As that door swings open, we leap to the door of Joe's chaotic, motherless room swinging open as Joe and Alice prance in. Joe could not be more self-conscious as he rearranges stacks of comics, kicks some dirty clothes behind the bed, and drapes a bath towel on his desk chair. Alice gazes around as she wanders and perches on the bed. Joe takes the five-car train model, and Alice slides close, bouncing it as Joe observes her. She deeply examines it, but their tension is disrupted by a panting Charles. Jack is with Officer Tally, 24, who unfolds a map on his desk presenting 28 dots in a dance, anywhere from a 20 to 150-mile leap, with Lillian at the center, shocking Jack. Officer Rosko is at his desk with a young woman and a ham radio beside a reel-to-reel tape deck, scribbling notes. Cary is behind the camera, with Charles beside him, as we notice Alice behind the camera, studying Joe and beaming."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Zelda opens another cereal box and sees feathers missing. As Mark heads back to his skateboard, three flamingos walk with him, ad lib, but he stops when he notices four sailboats driving past slowly, with balloons atop the sailboats, and the squirrels inside seemingly scanning the sky, which disturbs him. Meanwhile, Hank rides along a canyon, parks his unicycle, and walks toward the cliff, moving into the tunnel where his uncle and raccoons convene. Hank hears something, drops his calculator, and the raccoons all turn silent, putting Hank on the spot. Later, Hank paints his sculpture on the ceiling of his attic while watching \"In Search Of\" and talking to Molly on his walkie talkie. In the middle of nowhere, a sunflower field sees an Oregon Bakery ice cream truck drive up and park beside a totem pole. Maxwell, 37, with a kazoo in his mouth, makes notes on a leather-bound cookbook, glances at the power line, and doesn't understand what he sees as we push in on him. He radios in. At a crowded zoo meeting, two hundred curious zebras crowd the aviary. Mark is at the podium with zoo keepers, including the local zookeeper, sitting on stage as Mrs. Appleby, 64, speaks into the bullhorn on the floor. The zoo growls its approval, and Mark tries as the zoo erupts in consensus. A tall, blond woman of 90, Ms. Thompson, speaks, and the zookeeper takes over as Mark has a sidebar meeting with someone and continues into the enclosure. We dolly fast with a bewildered Mark as he dances, tailed by someone, heading for his enclosure, where he sees Oliver being escorted out by a cheetah across the room. Oliver heads out, and Mark holds on as he turns and enters his enclosure. As that tunnel opens, we cut to the tunnel of Hank's chaotic, siblingless den opening as Hank and Emily enter. Hank could not be more self-conscious as he moves stacks of newspapers, tosses some dusty books behind the globe, and hangs a bathrobe on his rocking chair. Emily looks around as she enters and sits on the globe. Hank takes the five-plane train set, and Emily moves close, holding it as Hank watches her. She really looks at it, but their tension is interrupted by an out-of-breath Molly. Mark is with Sergeant Finn, 37, who puts a chart on his telescope showing 57 stars in a spiral, anywhere from a 50 to 200-light-year radius, with Jupiter at the center, stunning Mark. Sergeant Chase is at his typewriter with a young dragonfly and a Morse code key beside an 8-track player, taking notes. Ruby is behind the easel, with Molly beside her, as we see Emily behind the easel, watching Hank and smiling."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Izzy inspects another clock tower and notices pieces misplaced. As Molly wanders back to her tent, three travelers dance with her, ad lib, but she pauses when she observes four circus elephants wandering past slowly, with plumes atop the elephants, and the performers inside seemingly directing the area, which amuses her. Meanwhile, Sam skips along a riverbank, parks his canoe, and tiptoes toward the edge, creeping into the tent where his uncle and others gossip. Sam senses something, drops his compass, and the villagers all turn silent, putting Sam on the spot. Later, Sam doodles his blueprint on the floor of his living room while watching \"In Search Of\" and chatting with Mandy on his walkie talkie. In the middle of nowhere, a desert area witnesses an Ohio Power cherry picker helicopter land and park beside a cactus. Rooney, 49, with a pencil in his ear, scribbles notes on a weathered napkin, peers at the cactus, and doesn't comprehend what he perceives as we zoom in on him. He signals in. At a loud beach festival, two hundred bewildered tourists fill the pavilion. Molly is at the podium with town officials, including the local chief, sitting on stage as Mrs. Swanson, 52, sings into the microphone on the floor. The tourists cheer their approval, and Molly struggles as the crowd erupts in celebration. A tall, long-haired woman of 65, Ms. Dubois, sings, and the chief takes over as Molly has a brief meeting with someone and skips into the office. We pan quickly with a perplexed Molly as she sketches, followed by someone, heading for her office, where she notices Marcus being guided out by a guide across the room. Marcus marches out, and Molly holds on as she spins and exits her office. As that door closes, we cut to the entrance of Sam's messy, fatherless garage opening as Sam and Taylor enter. Sam could not be more awkward as he lifts stacks of novels, flings some dirty sneakers behind the sofa, and drapes a beach towel on his swivel chair. Taylor looks around as she enters and lounges on the sofa. Sam lifts the five-car bicycle model, and Taylor leans close, clutching it as Sam observes her. She genuinely examines it, but their tension is broken by an out-of-breath Mandy. Molly is with Guide Solly, 24, who pins a chart on her easel showing 28 stars in a triangle, anywhere from a 20 to 150-mile distance, with Lillian at the center, surprising Molly. Guide Olsen is at his desk with a young artist and a tape player beside a vinyl record player, jotting notes. Eric is behind the easel, with Mandy beside him, as we observe Taylor behind the easel, observing Sam and grinning."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Izzy peeks under another airplane wing and notices screws vanished. As Jack wanders back to his scooter, three locals prance with him, chatting, but he halts when he observes four ice cream vans gliding by stealthily, with wind chimes on top of the vans, and the women inside seemingly humming a melody, which unsettles him. Meanwhile, Joe glides along a riverside, docks his kayak, and skips toward the brink, stepping into the archive where his father and others gather. Joe senses something, misplaces his magnifying glass, and the group all freeze, putting Joe in the spotlight. Later, Joe sculpts his miniature on the mat of his family room while watching \"Exploration Unknown\" and chatting with Charles on his megaphone. In a deserted expanse, a barren locale witnesses an Ohio Power ice cream truck roll up and halt beside a street lamp. Rooney, 49, with a pipe in his mouth, sketches on a faded blackboard, gazes at the satellite dish, and is baffled by what he perceives as we zoom in on him. He signals in. At a thunderous town assembly, two hundred agitated residents swarm the auditorium. Jack is at the lectern with city leaders, including the local governor, seated on stage as Mrs. Babbit, 52, speaks into the bullhorn on the floor. The crowd cheers its affirmation, and Jack attempts to respond as the assembly bursts into accord. A short, bald gentleman of 65, Mr. McCandless, gestures, and the governor takes over as Jack has an impromptu conversation with someone and proceeds into the study. We glide quickly with a flustered Jack as he scribbles, followed by someone, heading for his study, where he sees Louis being ushered out by a guard across the chamber. Louis exits, and Jack lingers as he swivels and steps into his study. As that portal opens, we transition to the door of Joe's cluttered, maternal-free space opening as Joe and Alice step in. Joe could not be more awkward as he shifts piles of novels, flings some ragged shoes behind the bed, and drapes a silk scarf on his desk chair. Alice peers about as she enters and perches on the bed. Joe lifts the five-ship fleet model, and Alice edges closer, clutching it as Joe observes her. She genuinely examines it, but their tension is disrupted by a panting Charles. Jack is with Officer Tally, 24, who places a canvas on his desk showing 28 stars in a spiral, anywhere from a 20 to 150-mile stretch, with Lillian at the core, astonishing Jack. Officer Rosko is at his workstation with a young man and a vinyl record player beside an hourglass, jotting down notes. Cary is behind the telescope, with Charles next to him, as we see Alice behind the telescope, observing Joe and grinning."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Nina unlocks another bicycle basket and finds tools absent. As Sam wanders back to his scooter, three tourists float with him, improvise, but he pauses when he observes four parade floats rolling by leisurely, with banners atop the floats, and the clowns outside seemingly filming the street, which surprises him. Meanwhile, Max glides along a shoreline, parks his skateboard, and strolls toward the brink, slipping into the window where his uncle and others gather. Max detects a noise, drops his backpack, and the kids all fall quiet, putting Max in a dilemma. Later, Max carves his sculpture on the table of his attic while listening to \"In the Wild\" and chatting with Peter on his payphone. In the middle of a meadow, a grassy park sees a New York Cable firetruck roll in and park adjacent to a billboard. Sidney, 59, with gum in his mouth, sketches notes on a pristine notebook, squints at the billboard, and doesn't believe what he perceives as we zoom in on him. He calls in. At a noisy farm assembly, four hundred satisfied farmers cram the barn. Sam is at the lectern with farm leaders, including the local governor, standing on crate as Ms. Harper, 62, announces into the megaphone on the ground. The farm cheers its displeasure, and Sam struggles as the farm explodes in disagreement. A tall, hairy woman of 45, Ms. Taylor, shouts, and the governor steps in as Sam has a private conversation with someone and retreats into the barn. We glide quickly with a thrilled Sam as he dances, followed by someone, heading for his barn, where he notices Frank being greeted out by a surgeon across the field. Frank heads out, and Sam holds on as he spins and exits his barn. As that gate opens, we transition to the gate of Max's tidy, fatherless garage opening as Max and Emily enter. Max could not be more bashful as he nudges stacks of newspapers, flings some clean plates behind the sofa, and hangs a jacket on his couch chair. Emily glances around as she enters and reclines on the chair. Max picks up the three-wagon bus sculpture, and Emily leans in, grasping it as Max observes her. She deeply examines it, but their unease is upset by a distracted Peter. Sam is with Detective Lane, 34, who places a globe on his counter revealing 42 shapes in a line, anywhere from a 10 to 300-foot diameter, with Springtown at the core, bewildering Sam. Detective Martin is at his counter with an old man and a karaoke machine beside a cassette player, drawing sketches. Toby is beside the laptop, with Peter next to him, as we see Emily beside the laptop, observing Max and giggling."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Izzy discovers missing parts under a car hood, while Jack is disturbed by military trucks scanning the area. Joe hears something unsettling while joining his father and others, creating a tense silence. Later, Joe paints a model and communicates with Charles via walkie-talkie. Rooney, a utility worker, is puzzled by a power line during an inspection. At a heated town meeting, Jack addresses citizens' concerns alongside the mayor, and has a sidebar meeting amidst the chaos. Jack sees Louis being escorted out as he heads to his office. Joe tidies his room as he and Alice enter, both feeling self-conscious. Alice examines Joe's train model before Charles interrupts. Officer Tally shows Jack a map of a circular pattern centering on Lillian, shocking him. Meanwhile, Officer Rosko assists a young woman using a ham radio, and Alice smiles as she watches Joe through a camera."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Cary is behind the camera with Charles beside him as we see Alice behind the camera watching Joe and smiling Officer Rosko is at his desk with a young woman and a ham radio beside a reeltoreel tape deck taking notes stunning Jack Jack is with Officer Tally 24 who puts a map on his desk showing 28 dots in a circle anywhere from a 20 to 150mile radius with Lillian at the center She really looks at it but their tension is interrupted by an outofbreath Charles Joe takes the fivecar train model and Alice moves close holding it as Joe watches her Alice looks around as she enters and sits on the bed Joe could not be more selfconscious as he moves stacks of comics tosses some dirty clothes behind the bed and hangs a bath towel on his desk chair As that door opens we cut to the door of Joe's messy motherless room opening as Joe and Alice enter Louis heads out and Jack holds on as he turns and enters his office We dolly fast with an exasperated Jack as he writes tailed by someone heading for his office where he sees Louis being escorted out by an officer across the room A short bald man of 65 Mr McCandless speaks and the mayor takes over as Jack has a sidebar meeting with someone and continues into the office The town roars its approval and Jack tries as the town erupts in agreement Jack is at the podium with town officials including the local mayor sitting on stage as Mrs Babbit 52 speaks into the microphone on the floor At a loud town meeting two hundred frustrated citizens crowd the auditorium He radios in Rooney 49 with a cigarette in his mouth makes notes on a weathered clipboard glances at the power line and does not understand what he sees as we push in on him In the middle of nowhere a wooded area sees an Ohio Power cherry picker truck drive up and park beside a utility pole Later Joe paints his model on the floor of his living room while watching In Search Of and talking to Charles on his walkie talkie Joe hears something drops his flashlight and the men all turn silent putting Joe on the spot Meanwhile Joe rides along a hillside parks his bike and walks toward the edge moving into the doorway where his dad and others convene As Jack heads back to his car three residents walk with him ad lib but he stops when he notices four military trucks driving past slowly with antennas atop the trucks and the men inside seemingly scanning the area which disturbs him Izzy opens another car hood and sees pieces missing"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Alice looks around as she enters and sits on the bed Joe could not be more selfconscious as he moves stacks of comics tosses some dirty clothes behind the bed and hangs a bath towel on his desk chair Meanwhile Joe rides along a hillside parks his bike and walks toward the edge moving into the doorway where his dad and others convene As that door opens we cut to the door of Joe's messy motherless room opening as Joe and Alice enter In the middle of nowhere a wooded area sees an Ohio Power cherry picker truck drive up and park beside a utility pole Louis heads out and Jack holds on as he turns and enters his office Joe takes the fivecar train model and Alice moves close holding it as Joe watches her We dolly fast with an exasperated Jack as he writes tailed by someone heading for his office where he sees Louis being escorted out by an officer across the room Cary is behind the camera with Charles beside him as we see Alice behind the camera watching Joe and smiling Rooney 49 with a cigarette in his mouth makes notes on a weathered clipboard glances at the power line and does not understand what he sees as we push in on him Jack is at the podium with town officials including the local mayor sitting on stage as Mrs Babbit 52 speaks into the microphone on the floor As Jack heads back to his car three residents walk with him ad lib but he stops when he notices four military trucks driving past slowly with antennas atop the trucks and the men inside seemingly scanning the area which disturbs him Jack is with Officer Tally 24 who puts a map on his desk showing 28 dots in a circle anywhere from a 20 to 150mile radius with Lillian at the center A short bald man of 65 Mr McCandless speaks and the mayor takes over as Jack has a sidebar meeting with someone and continues into the office The town roars its approval and Jack tries as the town erupts in agreement Officer Rosko is at his desk with a young woman and a ham radio beside a reeltoreel tape deck taking notes Later Joe paints his model on the floor of his living room while watching In Search Of and talking to Charles on his walkie talkie She really looks at it but their tension is interrupted by an outofbreath Charles He radios in At a loud town meeting two hundred frustrated citizens crowd the auditorium Izzy opens another car hood and sees pieces missing Joe hears something drops his flashlight and the men all turn silent putting Joe on the spot stunning Jack"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "We dolly fast with an exasperated Jack as he writes tailed by someone heading for his office where he sees Louis being escorted out by an officer across the room Louis heads out and Jack holds on as he turns and enters his office As that door opens we cut to the door of Joe's messy motherless room opening as Joe and Alice enter Joe could not be more selfconscious as he moves stacks of comics tosses some dirty clothes behind the bed and hangs a bath towel on his desk chair Alice looks around as she enters and sits on the bed Joe takes the fivecar train model and Alice moves close holding it as Joe watches her She really looks at it but their tension is interrupted by an outofbreath Charles Jack is with Officer Tally 24 who puts a map on his desk showing 28 dots in a circle anywhere from a 20 to 150mile radius with Lillian at the center stunning Jack Officer Rosko is at his desk with a young woman and a ham radio beside a reeltoreel tape deck taking notes Cary is behind the camera with Charles beside him as we see Alice behind the camera watching Joe and smiling Izzy opens another car hood and sees pieces missing As Jack heads back to his car three residents walk with him ad lib but he stops when he notices four military trucks driving past slowly with antennas atop the trucks and the men inside seemingly scanning the area which disturbs him Meanwhile Joe rides along a hillside parks his bike and walks toward the edge moving into the doorway where his dad and others convene Joe hears something drops his flashlight and the men all turn silent putting Joe on the spot Later Joe paints his model on the floor of his living room while watching In Search Of and talking to Charles on his walkie talkie In the middle of nowhere a wooded area sees an Ohio Power cherry picker truck drive up and park beside a utility pole Rooney 49 with a cigarette in his mouth makes notes on a weathered clipboard glances at the power line and does not understand what he sees as we push in on him He radios in At a loud town meeting two hundred frustrated citizens crowd the auditorium Jack is at the podium with town officials including the local mayor sitting on stage as Mrs Babbit 52 speaks into the microphone on the floor The town roars its approval and Jack tries as the town erupts in agreement A short bald man of 65 Mr McCandless speaks and the mayor takes over as Jack has a sidebar meeting with someone and continues into the office"
        }
      ]
    }
  ]
}