{
  "ground_truth": "Overmyer enters and crosses to Nelec, who reviews a folder, but then Nelec sees something outside: the kids. Jack's cruiser pulls up, and Joe spins around as Jack arrives, grabbing his camera from Charles and saying firmly to Joe. Joe is stunned and instantly humiliated in front of Alice, and he's taken back to the squad car. Jack opens the car's back door, Joe gets in, and Jack slams it shut, then throws the camera and tripod into the passenger seat and slams that door before heading to the house and leaving Joe in the back. Nelec heads outside, and Jack moves to him; this lands on Nelec, and Jack heads off. Jack stops and turns to uncomfortable Nelec. Joe, his breathing heavy, sits in the car with his heart pounding, watching his father move over to talk to Nelec, close again, while Alice watches him sympathetically. The door opens, and Jack enters, letting Joe pass him. Joe closes the door hard and says angrily but restrained. Jack turns to leave, but Joe, enraged, says something that makes Jack stop, stunned, as Joe's heart pounds. Jack moves close to Joe, intimidating, and Joe steps back, feeling Jack is intense. Jack suddenly stops himself, realizing what he's saying and to whom he's saying it, but somehow, in this moment, he can't be a better father than law officer. More upset at himself than Joe, he heads out. Joe rides up a hill, revealing the town cemetery, and sits with his back against his mother's grave, holding her open locket and staring at it. But then he hears a sound and turns, hearing a deep and low sound in the distance. Joe is motionless. He stands, pulls out his flashlight, and aims the beam down the rows of graves toward the big caretaker's shed in the distance. He hears another intense, low sound, then a high pitch hit like metal on wood, and Joe backs up, nervous. Another odd sound occurs, which transitions us to Jack's squad car arriving at the abandoned airfield. Jack's car pulls up, and he gets out. Suddenly, the three large military trucks' headlights come on, all aimed at Jack; he is blinded and tries to see past an IV and medical machinery. He's looking at someone we don't yet see; in the background, Overmyer stands, watching. Nelec is quiet and simple. Now we see who he's talking to: battered and scraped, he lies in a medical bed, afraid but defiant. Dr. Woodward swallows and feels that his time on Earth is coming to an end no matter what he does here. By the door, Overmyer is quietly putting on his black gloves, while Nelec offers a vague, searching smile.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Overmyer penetrates and traverses to Nelec, who examines a dossier, but then Nelec notices something exterior: the children. Jack's patrol car arrives, and Joe rotates around as Jack appears, seizing his camera from Charles and declaring decisively to Joe. Joe is shocked and immediately mortified in front of Alice, and he's taken back to the squad car. Jack opens the car's rear door, Joe enters, and Jack shuts it firmly, then tosses the camera and stand into the passenger seat and closes that door before proceeding to the house and leaving Joe in the back. Nelec proceeds outward, and Jack advances to him; this impacts Nelec, and Jack departs. Jack halts and turns to uneasy Nelec. Joe, his respiration heavy, sits in the car with his heart racing, observing his father advance over to converse with Nelec, near again, while Alice observes him compassionately. The door opens, and Jack enters, allowing Joe to pass him. Joe closes the door firmly and declares angrily but restrained. Jack turns to depart, but Joe, infuriated, articulates something that causes Jack to halt, stunned, as Joe's heart races. Jack advances near to Joe, intimidating, and Joe retreats, sensing Jack is intense. Jack suddenly pauses himself, recognizing what he's declaring and to whom he's declaring it, but somehow, in this instant, he can't be a superior parent than law officer. More upset at himself than Joe, he exits. Joe rides up a hill, unveiling the town cemetery, and sits with his back against his mother's tombstone, clutching her open locket and gazing at it. But then he perceives a noise and turns, hearing a deep and low noise in the distance. Joe is motionless. He stands, extracts his flashlight, and aims the beam down the rows of graves toward the large caretaker's shed in the distance. He perceives another intense, low noise, then a high-pitched strike like metal on wood, and Joe retreats, anxious. Another peculiar noise occurs, which transitions us to Jack's squad car arriving at the deserted airfield. Jack's car arrives, and he exits. Suddenly, the three large military trucks' headlights ignite, all directed at Jack; he is blinded and attempts to see past an IV and medical apparatus. He's observing someone we don't yet see; in the background, Overmyer stands, observing. Nelec is silent and modest. Now we see who he's conversing with: battered and scraped, he reclines in a medical bed, fearful but defiant. Dr. Woodward swallows and senses that his time on Earth is approaching an end regardless of what he does here. By the door, Overmyer is quietly donning his black gloves, while Nelec extends an ambiguous, searching smile."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Overmyer enters and crosses to Nelec, who is reviewing a folder, but then the kids are seen outside by Nelec. Jack's cruiser is pulled up by him, and Joe is spun around as Jack arrives, with his camera being grabbed by him from Charles and a firm statement being made to Joe. Joe is stunned and instantly humiliated in front of Alice, and the squad car takes him back. The car's back door is opened by Jack, Joe gets in, and it is slammed shut by Jack, who then throws the camera and tripod into the passenger seat and slams that door before he heads to the house and leaves Joe in the back. Nelec heads outside, and Jack moves to him; this lands on Nelec, and Jack heads off. Uncomfortable Nelec is stopped and turned to by Jack. In the car, Joe, his breathing heavy, sits with his heart pounding, watching his father move over to talk to Nelec, close again, while Alice watches him sympathetically. The door is opened, and Jack enters, letting Joe pass him. The door is closed hard by Joe, and he speaks angrily but restrained. Leaving is turned to by Jack, but something is said by Joe, enraged, that makes Jack stop, stunned, as Joe's heart pounds. Jack moves close to Joe, intimidating, and feels himself being intense by Joe. Suddenly, Jack stops himself, realizing what is being said and to whom he's saying it, but somehow, in this moment, he can't be a better father than law officer. More upset at himself than Joe, he heads out. Joe rides up a hill, revealing the town cemetery, and is seated with his back against his mother's grave, holding her open locket and staring at it. But then a sound is heard by him, and he turns, hearing a deep and low sound in the distance. Joe is motionless. He stands, pulls out his flashlight, and aims the beam down the rows of graves toward the big caretaker's shed in the distance. Another intense, low sound is heard, then a high pitch hits like metal on wood, and Joe backs up, nervous. Another odd sound occurs, which transitions us to Jack arriving at the abandoned airfield with his squad car. Jack pulls up his car, and he gets out. Suddenly, the headlights of the three large military trucks come on, all aimed at Jack; he is blinded and tries to see past an IV and medical machinery. He's looking at someone we don't yet see; in the background, Overmyer stands, watching. Nelec is quiet and simple. Now we see who he's talking to: battered and scraped, Dr. Woodward lies in a medical bed, afraid but defiant. He swallows and feels that his time on Earth is coming to an end no matter what he does here. By the door, black gloves are quietly put on by Overmyer, while Nelec offers a vague, searching smile."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Overmyer enters and crosses to Nelec, who reviews a folder but then notices the kids outside. Jack's cruiser arrives, and Joe spins around as Jack approaches, grabbing his camera from Charles. Joe is humiliated in front of Alice and taken to the squad car. Jack opens the back door, Joe gets in, and Jack slams it shut, then throws the camera and tripod into the passenger seat before heading to the house, leaving Joe in the back. Nelec heads outside, and Jack moves to him, stopping to turn to an uncomfortable Nelec. Joe, breathing heavily, watches his father talk to Nelec while Alice watches sympathetically. Jack enters, letting Joe pass him. Joe closes the door hard and speaks angrily but restrained. Jack turns to leave, but Joe's words make him stop, stunned. Jack moves close, intimidating, and Joe steps back. Jack suddenly stops, realizing his actions, but can't be a better father than law officer. Upset at himself, he leaves. Joe rides to the town cemetery, sits against his mother's grave, holding her open locket. He hears a sound, turns, and aims his flashlight toward the caretaker's shed. Another intense sound occurs, transitioning to Jack's squad car at the abandoned airfield. Jack gets out, and three military trucks' headlights blind him. He tries to see past an IV and medical machinery. Overmyer stands watching, while Nelec is quiet. We see Dr. Woodward, battered and scraped, in a medical bed, feeling his time on Earth is ending. By the door, Overmyer puts on black gloves, while Nelec offers a vague smile."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Overmyer enters and crosses to Nelec, who reviews a folder but notices the kids outside. Jack's cruiser arrives, and Joe grabs his camera from Charles, feeling humiliated in front of Alice as he's taken to the squad car. Jack opens the door, Joe gets in, and Jack slams it shut, tossing the camera and tripod into the passenger seat before heading to the house. Nelec goes outside, and Jack approaches him, stopping to confront Nelec. Joe, breathing heavily, watches his father talk to Nelec while Alice looks on sympathetically. Jack enters, letting Joe pass, and Joe closes the door angrily. Jack turns to leave, but Joe's words make him stop, stunned. Jack moves close, intimidating Joe, then stops, realizing his role as a father versus a law officer. Upset, he leaves. Joe sits by his mother's grave, holding her locket, then hears a sound and turns, aiming his flashlight toward the caretaker's shed. He hears another sound and backs up nervously. The scene transitions to Jack's squad car at the abandoned airfield. Jack gets out, blinded by military truck headlights. Overmyer watches as Nelec, quiet and simple, talks to Dr. Woodward, who lies battered in a medical bed, feeling his end is near. Overmyer puts on black gloves, while Nelec offers a vague smile."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Overmyer makes his entrance and crosses the room to where Nelec is situated, who is intently reviewing a folder. However, Nelec's attention is suddenly diverted as he notices something outside: the kids. At that moment, Jack's cruiser pulls up, and Joe quickly spins around as Jack arrives. Joe hurriedly grabs his camera from Charles, saying something firmly to Joe. Joe is left feeling stunned and instantly humiliated in front of Alice, and he is then taken back to the squad car. Jack opens the back door of the car, and Joe gets in. Jack then slams the door shut with a decisive motion, before tossing the camera and tripod into the passenger seat and slamming that door as well. He then heads towards the house, leaving Joe sitting in the back of the car. Nelec makes his way outside, and Jack moves towards him; this interaction lands on Nelec, and Jack heads off. Jack stops in his tracks and turns to face the now uncomfortable Nelec. Meanwhile, Joe, with his breathing heavy and heart pounding, sits in the car, watching his father move over to engage in conversation with Nelec, who is once again close by, while Alice watches him with a sympathetic expression. The door opens, and Jack enters, allowing Joe to pass him. Joe closes the door with a hard motion and speaks angrily, though with restraint. Jack turns to leave, but Joe, now enraged, says something that causes Jack to stop in his tracks, stunned, as Joe's heart continues to pound. Jack moves closer to Joe, his presence intimidating, and Joe steps back, feeling the intensity of Jack's demeanor. Jack suddenly halts himself, realizing the gravity of what he's saying and to whom he's saying it, but somehow, in this moment, he finds himself unable to be a better father than a law officer. More upset with himself than with Joe, he heads out. Joe rides up a hill, revealing the town cemetery, and sits with his back against his mother's grave, holding her open locket and staring at it intently. But then he hears a sound and turns, hearing a deep and low sound resonating in the distance. Joe remains motionless. He stands, pulls out his flashlight, and aims the beam down the rows of graves toward the large caretaker's shed in the distance. He hears another intense, low sound, followed by a high-pitched hit like metal striking wood, and Joe backs up, feeling nervous. Another odd sound occurs, which transitions us to Jack's squad car arriving at the abandoned airfield. Jack's car pulls up, and he gets out. Suddenly, the headlights of three large military trucks come on, all aimed directly at Jack; he is momentarily blinded and tries to see past an IV and medical machinery. He is looking at someone we don't yet see; in the background, Overmyer stands, watching silently. Nelec remains quiet and simple. Now we see who he's talking to: battered and scraped, he lies in a medical bed, appearing both afraid and defiant. Dr. Woodward swallows, feeling that his time on Earth is inevitably coming to an end, no matter what actions he takes here. By the door, Overmyer is quietly putting on his black gloves, while Nelec offers a vague, searching smile."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As Overmyer makes a notable entrance, he crosses the expansive room with purposeful strides, heading directly to the spot where Nelec is already seated. Nelec is deeply engrossed in examining the folder in front of him, reviewing its contents with intense focus. However, his attention is soon drawn away, as something outside the window catches his eye: the presence of the kids. Suddenly, Jack's cruiser drives up, prompting Joe to quickly turn around at the sight of Jack’s arrival. In a hurried manner, Joe reaches out to grab his camera from Charles, speaking firmly to him. This interaction leaves Joe feeling stunned and instantly humiliated, especially in front of Alice, before he is taken back to the squad car. Jack approaches the vehicle, opens the back door, and Joe gets in. With a decisive motion, Jack then slams the door shut and proceeds to toss the camera and tripod into the passenger seat, slamming that door as well. He then makes his way toward the house, leaving Joe seated in the back of the car. \n\nMeanwhile, Nelec emerges from the building and heads outside, while Jack moves towards him; their interaction is significant, causing Jack to pause in his tracks and turn to face Nelec, who is visibly uncomfortable. Concurrently, Joe sits inside the car, his breathing heavy and his heart pounding. He watches his father as Jack engages in conversation with Nelec, who remains close by, while Alice observes Joe sympathetically. The door opens again, and Jack enters, allowing Joe to pass by him. Joe closes the door with a deliberate and hard motion, then speaks angrily yet with restraint. Jack turns to depart, but Joe, now overtaken by rage, says something that causes Jack to stop and stand still, stunned, while Joe’s heart continues its relentless pounding. Jack steps closer to his son, his presence intimidating, prompting Joe to retreat slightly, feeling the full force of Jack’s intense demeanor. Jack suddenly restrains himself, becoming acutely aware of the gravity of his words and the person he’s addressing. At that moment, he realizes, painfully, that he struggles to be a better father than a law enforcement officer. More frustrated with himself than with Joe, he exits the scene.\n\nJoe then rides to the top of a hill, revealing the solemn town cemetery. He sits with his back resting against his mother's grave, clutching her open locket, and stares at it with deep intensity. But his reverie is interrupted by the sound of a distant, low rumble. Joe remains still, listening carefully. He stands slowly, retrieving his flashlight, and directs the beam of light down the orderly rows of graves towards the large caretaker's shed in the distance. Another intense, low sound reaches his ears, followed by a high-pitched clanging noise reminiscent of metal striking wood, causing Joe to step back, feeling a surge of nervousness. An additional odd sound occurs, creating a seamless transition to the scene where Jack's squad car arrives at the deserted airfield. As Jack drives up and exits the vehicle, the headlights of three large military trucks suddenly illuminate, all directly focused on Jack, momentarily blinding him as he tries to peer past an IV stand and a set of medical machinery. He is staring at someone not yet visible to us; in the background, Overmyer stands silently, observing the situation. Nelec remains quiet and inscrutable. Now the person Jack is addressing comes into view: bruised and scraped, lying in a medical bed, they appear to be a mix of fear and defiance. Dr. Woodward swallows, accepting the inevitability of his fate, feeling that his time on Earth is drawing to a close regardless of the actions he takes now. By the door, Overmyer methodically puts on his black gloves as Nelec gives a slight, enigmatic smile, searching for something unspoken in the atmosphere."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Overmyer enters the room with a purposeful stride and makes his way directly to Nelec, who is intently reviewing a folder. As Nelec's eyes lift from the folder, he catches sight of something outside the window: the kids. At that moment, Jack's cruiser pulls up with a sense of urgency, causing Joe to spin around quickly as Jack arrives. Joe swiftly grabs his camera from Charles, his movements firm and decisive, and says something firmly to Joe. Joe is left stunned, his face flushed with instant humiliation in front of Alice, as he is led back to the squad car. Jack, with a practiced motion, opens the car's back door, and Joe climbs in, feeling the weight of the moment. Jack then slams the door shut with a finality that echoes in the air, before tossing the camera and tripod into the passenger seat with a casual throw, slamming that door as well. He then strides purposefully toward the house, leaving Joe alone in the back of the car. Nelec, having observed the scene, heads outside, and Jack moves toward him with a determined gait. This interaction lands heavily on Nelec, prompting Jack to head off, but he stops abruptly and turns back to face the now uncomfortable Nelec. Inside the car, Joe sits with his breathing heavy, his heart pounding in his chest as he watches his father approach Nelec to engage in a conversation, their proximity close once again, while Alice watches Joe with a sympathetic gaze. The car door opens, and Jack enters, allowing Joe to pass him with a tense exchange. Joe closes the door with a hard, deliberate motion and speaks angrily, though his voice is restrained. Jack turns to leave, but Joe, his emotions boiling over, says something that makes Jack stop in his tracks, stunned by the words. Joe's heart continues to pound as Jack moves closer to him, his presence intimidating, causing Joe to instinctively step back, feeling the intensity of Jack's demeanor. Jack suddenly halts, a realization dawning on him about what he's saying and to whom, but in this moment, he finds himself unable to be a better father than a law officer. More upset with himself than with Joe, Jack turns and heads out, leaving Joe to his thoughts. Joe rides up a hill, the landscape revealing the town cemetery, and he sits with his back against his mother's grave, holding her open locket in his hand and staring at it with a mix of longing and sorrow. But then, a sound reaches his ears, causing him to turn his head, listening intently to the deep, low sound resonating in the distance. Joe remains motionless for a moment, then stands, pulling out his flashlight and aiming its beam down the rows of graves toward the large caretaker's shed in the distance. He hears another intense, low sound, followed by a high-pitched hit like metal striking wood, prompting Joe to back up, his nerves on edge. Another odd sound occurs, seamlessly transitioning the scene to Jack's squad car as it arrives at the abandoned airfield. Jack's car pulls up, and he steps out, only to be suddenly blinded by the headlights of three large military trucks, all aimed directly at him. He squints, trying to see past the glare and the IV and medical machinery that obscure his view. He's looking at someone not yet visible, while in the background, Overmyer stands silently, observing. Nelec remains quiet and simple in his demeanor. Now, the focus shifts to reveal who Jack is talking to: Dr. Woodward, battered and scraped, lying in a medical bed, his expression a mix of fear and defiance. Dr. Woodward swallows, a sense of finality settling over him as he feels that his time on Earth is drawing to a close, regardless of his actions here. By the door, Overmyer quietly dons his black gloves, while Nelec offers a vague, searching smile, the atmosphere thick with unspoken tension."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Overmyer enters and approaches Nelec, who is reviewing a folder, but is distracted by the sight of the kids outside. As Jack's cruiser arrives, Joe quickly grabs his camera from Charles, feeling humiliated in front of Alice as Jack takes him to the squad car. Jack secures Joe in the back, tosses the camera and tripod into the passenger seat, and heads to the house, leaving Joe behind. Nelec steps outside, and Jack approaches him, leading to a tense exchange. Joe, anxious and breathing heavily, watches his father confront Nelec while Alice observes sympathetically. Jack returns, allowing Joe to exit the car, and a heated exchange ensues, leaving Jack momentarily stunned. Jack approaches Joe intimidatingly but then restrains himself, realizing his role as a father is overshadowed by his duties as a law officer. Frustrated, Jack leaves, and Joe rides to the cemetery, sitting by his mother's grave with her locket. Hearing strange sounds, Joe stands, flashlight in hand, and investigates the caretaker's shed, growing nervous as the noises intensify. Meanwhile, Jack arrives at the abandoned airfield, where military trucks suddenly illuminate him. Blinded, he tries to see past the medical setup, observing Overmyer and Nelec. Dr. Woodward, battered and defiant, lies in a medical bed, sensing his end is near. Overmyer quietly dons black gloves as Nelec offers a vague smile."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Overmyer, a local detective known for his meticulous attention to detail, enters and crosses to Nelec, a government official overseeing clandestine operations, who reviews a folder containing confidential documents, but then Nelec sees something outside: the kids from the nearby school, known for their curiosity and adventurous nature. Jack's cruiser pulls up, a characteristic model used by the town's police force, and Joe spins around as Jack arrives, grabbing his vintage Super 8 camera from Charles and saying firmly to Joe. Joe is stunned and instantly humiliated in front of Alice, whom he secretly admires, and he's taken back to the squad car. Jack opens the car's back door with a sense of urgency, Joe gets in, and Jack slams it shut, then throws the camera and tripod into the passenger seat with little regard for their fragility, and slams that door before heading to the house and leaving Joe in the back. Nelec heads outside, his presence commanding attention, and Jack moves to him; this lands on Nelec, known for his stoic demeanor, and Jack heads off. Jack stops and turns to uncomfortable Nelec, whose reputation for directness precedes him. Joe, his breathing heavy with anxiety, sits in the car with his heart pounding, watching his father move over to talk to Nelec, close again, while Alice watches him sympathetically, understanding the strain between father and son. The door opens, and Jack enters, letting Joe pass him. Joe closes the door hard and says angrily but restrained, his voice echoing the tension between them. Jack turns to leave, but Joe, enraged, says something that makes Jack stop, stunned, as Joe's heart pounds with emotions unspoken. Jack moves close to Joe, intimidating with his authoritative stance, and Joe steps back, feeling Jack is intense and unwavering. Jack suddenly stops himself, realizing what he's saying and to whom he's saying it, but somehow, in this moment, he can't be a better father than law officer, reflecting the conflict between his professional and personal roles. More upset at himself than Joe, he heads out, his mind a storm of regret and responsibility. Joe rides up a hill, revealing the town cemetery, a place of solace and reflection, and sits with his back against his mother's grave, holding her open locket, a cherished family heirloom, and staring at it. But then he hears a sound, unfamiliar yet eerie, and turns, hearing a deep and low sound in the distance, reminiscent of the town’s industrial past. Joe is motionless, caught in a mix of fear and curiosity. He stands, pulls out his flashlight, a gift from his late mother, and aims the beam down the rows of graves toward the big caretaker's shed in the distance, known for its tales of ghostly sightings. He hears another intense, low sound, then a high pitch hit like metal on wood, echoing loudly in the silent night, and Joe backs up, nervous, sensing an unusual presence. Another odd sound occurs, which transitions us to Jack's squad car arriving at the abandoned airfield, an area often whispered about in town lore. Jack's car pulls up, and he gets out. Suddenly, the three large military trucks' headlights come on, signaling a clandestine operation, all aimed at Jack; he is blinded and tries to see past an IV and medical machinery of unknown purpose. He's looking at someone we don't yet see; in the background, Overmyer stands, watching with a calculated expression. Nelec is quiet and simple, his demeanor betraying little of his intentions. Now we see who he's talking to: battered and scraped, he lies in a medical bed, afraid but defiant, an unwilling participant in circumstances beyond his control. Dr. Woodward, once a respected scientist, swallows and feels that his time on Earth is coming to an end no matter what he does here, reflecting on his past choices and their consequences. By the door, Overmyer is quietly putting on his black gloves, signaling an ominous task ahead, while Nelec offers a vague, searching smile, hinting at his own hidden agenda."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Overmyer enters and crosses to Nelec who reviews a folder but then Nelec sees something outside the kids. Jack's cruiser pulls up and Joe spins around as Jack arrives grabbing his camera from Charles and saying firmly to Joe. Joe is stunned and instantly humiliated in front of Alice and he is taken back to the squad car. Jack opens the car's back door. Joe gets in and Jack slams it shut. then throws the camera and tripod into the passenger seat and slams that door before heading to the house and leaving Joe in the back. Nelec heads outside and Jack moves to him. this lands on Nelec and Jack heads off. Jack stops and turns to uncomfortable Nelec. Joe his breathing heavy sits in the car with his heart pounding watching his father move over to talk to Nelec close again while Alice watches him sympathetically. The door opens and Jack enters letting Joe pass him. Joe closes the door hard and says angrily but restrained. Jack turns to leave but Joe enraged says something that makes Jack stop stunned as Joe's heart pounds. Jack moves close to Joe intimidating and Joe steps back feeling. Jack is intense. Jack suddenly stops himself realizing what he is saying and to whom he is saying it but somehow in this moment he cannot be a better father than law officer. More upset at himself than Joe he heads out. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Joe rides up a hill revealing the town cemetery and sits with his back against his mother's grave holding her open locket and staring at it. But then he hears a sound and turns hearing a deep and low sound in the distance. Joe is motionless. He stands pulls out his flashlight and aims the beam down the rows of graves toward the big caretaker's she would in the distance. He hears another intense low sound. then a high pitch hit like metal on wood and Joe backs up nervous. Another odd sound occurs which transitions us to Jack's squad car arriving at the abandoned airfield. Jack's car pulls up and he gets out. Suddenly the three large military trucks' headlights come on all aimed at Jack. he is blinded and tries to see past an IV and medical machinery. He is looking at someone we do not yet see in the background. Overmyer stands watching. Nelec is quiet and simple. Now we see who he is talking to battered and scraped. he lies in a medical bed afraid but defiant. Dr Woodward swallows and feels that his time on Earth is coming to an end no matter what he does here. By the door Overmyer is quietly putting on his black gloves while Nelec offers a vague searching smile."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Overmyer enters and crosses to Nelec who reviews a folder but then Nelec sees something outside the kids. Jack's cruiser pulls up and Joe spins around as Jack arrives grabbing his camera from Charles and saying firmly to Joe. Joe is stunned and instantly humiliated in front of Alice and he is taken back to the squad car. Jack opens the car's back door. Joe gets in and Jack slams it shut. then throws the camera and tripod into the passenger seat and slams that door before heading to the house and leaving Joe in the back. Nelec heads outside and Jack moves to him. this lands on Nelec and Jack heads off. Jack stops and turns to uncomfortable Nelec. Joe his breathing heavy sits in the car with his heart pounding watching his father move over to talk to Nelec close again while Alice watches him sympathetically. The door opens and Jack enters letting Joe pass him. Joe closes the door hard and says angrily but restrained. Jack turns to leave but Joe enraged says something that makes Jack stop stunned as Joe's heart pounds. Jack moves close to Joe intimidating and Joe steps back feeling. Jack is intense. Jack suddenly stops himself realizing what he is saying and to whom he is saying it but somehow in this moment he cannot be a better father than law officer. More upset at himself than Joe he heads out. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. Joe rides up a hill revealing the town cemetery and sits with his back against his mother's grave holding her open locket and staring at it. But then he hears a sound and turns hearing a deep and low sound in the distance. Joe is motionless. He stands pulls out his flashlight and aims the beam down the rows of graves toward the big caretaker's she would in the distance. He hears another intense low sound. then a high pitch hit like metal on wood and Joe backs up nervous. Another odd sound occurs which transitions us to Jack's squad car arriving at the abandoned airfield. Jack's car pulls up and he gets out. Suddenly the three large military trucks' headlights come on all aimed at Jack. he is blinded and tries to see past an IV and medical machinery. He is looking at someone we do not yet see in the background. Overmyer stands watching. Nelec is quiet and simple. Now we see who he is talking to battered and scraped. he lies in a medical bed afraid but defiant. Dr Woodward swallows and feels that his time on Earth is coming to an end no matter what he does here. By the door Overmyer is quietly putting on his black gloves while Nelec offers a vague searching smile."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Overmyer enters and crosses to Nelec who reviews a folder but then Nelec sees something outside the kids. Jack's cruiser pulls up and Joe spins around as Jack arrives grabbing his camera from Charles and saying firmly to Joe. Joe is stunned and instantly humiliated in front of Alice and he is taken back to the squad car. Jack opens the car's back door. Joe gets in and Jack slams it shut. then throws the camera and tripod into the passenger seat and slams that door before heading to the house and leaving Joe in the back. Nelec heads outside and Jack moves to him. this lands on Nelec and Jack heads off. Jack stops and turns to uncomfortable Nelec. he is blinded and tries to see past an IV and medical machinery. He is looking at someone we do not yet see in the background. Overmyer stands watching. Nelec is quiet and simple. Now we see who he is talking to battered and scraped. he lies in a medical bed afraid but defiant. Dr Woodward swallows and feels that his time on Earth is coming to an end no matter what he does here. By the door Overmyer is quietly putting on his black gloves while Nelec offers a vague searching smile."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Overmyer enters and crosses to Nelec who reviews a folder but then Nelec sees something outside the kids. Jack's cruiser pulls up and Joe spins around as Jack arrives grabbing his camera from Charles and saying firmly to Joe. Joe is stunned and instantly humiliated in front of Alice and he is taken back to the squad car. Jack opens the car's back door. he lies in a medical bed afraid but defiant. Dr Woodward swallows and feels that his time on Earth is coming to an end no matter what he does here. By the door Overmyer is quietly putting on his black gloves while Nelec offers a vague searching smile."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Gulliver hops and slides to Polaris, who inspects a blueprint, but then Polaris notices something inside: the ducks. Max's tractor trundles in, and Tim twirls around as Max approaches, snatching his telescope from Rufus and whispering softly to Tim. Tim is bewildered and instantly embarrassed in front of Clara, and he's whisked away to the supply truck. Max opens the truck's back hatch, Tim climbs in, and Max bangs it shut, then tosses the telescope and easel into the driver's seat and secures that hatch before wandering to the barn and leaving Tim in the back. Polaris scurries inside, and Max glides to him; this bounces on Polaris, and Max shuffles off. Max halts and pivots to uneasy Polaris. Tim, his breath quickening, lounges in the truck with his pulse racing, observing his parent drift over to chat with Polaris, close again, while Clara observes him kindly. The hatch swings, and Max appears, letting Tim squeeze past him. Tim snaps the hatch hard and mutters irritably but calmly. Max pivots to wander off, but Tim, infuriated, utters something that makes Max pause, shocked, as Tim's pulse races. Max glides close to Tim, daunting, and Tim retreats, sensing Max is fervent. Max abruptly halts himself, realizing what he's uttering and to whom he's uttering it, but somehow, in this pause, he can't be a more nurturing parent than forest ranger. More upset at himself than Tim, he wanders away. Tim pedals up a slope, revealing the village orchard, and leans with his back against his grandmother's tree, clutching her closed pendant and gazing at it. But then he detects a noise and pivots, picking up a soft and humming noise nearby. Tim is unmoving. He rises, draws out his flare, and directs the light along the paths of trees toward the large gardener's barn in the vicinity. He detects another vibrant, humming noise, then a shrill clang like glass on stone, and Tim retreats, uneasy. Another peculiar noise manifests, which shifts us to Max's supply truck reaching the deserted racecourse. Max's truck rolls in, and he steps out. Abruptly, the four towering police vans' floodlights ignite, all trained on Max; he is dazzled and attempts to gaze past an oxygen tank and surgical instruments. He's peering at someone obscured from view; in the backdrop, Gulliver stands, observing. Polaris is reserved and straightforward. Now we see who he's addressing: bruised and bruised, he reclines in a hospital cot, anxious but resolute. Dr. Redwood gulps and senses that his journey on Earth is drawing to a close regardless of his actions here. By the exit, Gulliver is silently wearing his gray mittens, while Polaris presents a vague, exploring grin."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Overmyer approaches Nelec, who notices the kids outside. As Jack arrives in his cruiser, Joe grabs his camera from Charles, feeling humiliated in front of Alice as Jack takes him to the car. Jack throws the camera and tripod into the seat and confronts Nelec, while Joe anxiously watches from the car. Alice observes sympathetically. When Jack enters the car, Joe expresses anger, prompting Jack to stop, stunned. Jack, realizing his struggle between being a father and a law officer, leaves upset. Joe visits his mother's grave, holding her locket, when he hears strange sounds near a caretaker's shed. Nervously, he investigates with a flashlight. Meanwhile, Jack arrives at an abandoned airfield, where he is blinded by military truck headlights. He sees a battered Dr. Woodward, fearing his end is near, while Overmyer dons black gloves, and Nelec offers a vague smile."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "By the door Overmyer is quietly putting on his black gloves while Nelec offers a vague searching smile Dr Woodward swallows and feels that his time on Earth is coming to an end no matter what he does here  he lies in a medical bed afraid but defiant  Now we see who he's talking to battered and scraped  Nelec is quiet and simple  Overmyer stands watching  He's looking at someone we don't yet see in the background  he is blinded and tries to see past an IV and medical machinery  Suddenly the three large military trucks' headlights come on all aimed at Jack  Jack's car pulls up and he gets out  Another odd sound occurs which transitions us to Jack's squad car arriving at the abandoned airfield  He hears another intense low sound then a high pitch hit like metal on wood and Joe backs up nervous  He stands pulls out his flashlight and aims the beam down the rows of graves toward the big caretaker's shed in the distance  Joe is motionless  But then he hears a sound and turns hearing a deep and low sound in the distance  Joe rides up a hill revealing the town cemetery and sits with his back against his mother's grave holding her open locket and staring at it  More upset at himself than Joe he heads out  Jack suddenly stops himself realizing what he's saying and to whom he's saying it but somehow in this moment he can't be a better father than law officer  Jack moves close to Joe intimidating and Joe steps back feeling Jack is intense  Jack turns to leave but Joe enraged says something that makes Jack stop stunned as Joe's heart pounds  Joe closes the door hard and says angrily but restrained  The door opens and Jack enters letting Joe pass him  Joe his breathing heavy sits in the car with his heart pounding watching his father move over to talk to Nelec close again while Alice watches him sympathetically  Jack stops and turns to uncomfortable Nelec  this lands on Nelec and Jack heads off  Nelec heads outside and Jack moves to him  then throws the camera and tripod into the passenger seat and slams that door before heading to the house and leaving Joe in the back  Joe gets in and Jack slams it shut  Jack opens the car's back door  Joe is stunned and instantly humiliated in front of Alice and he's taken back to the squad car  Jack's cruiser pulls up and Joe spins around as Jack arrives grabbing his camera from Charles and saying firmly to Joe  Overmyer enters and crosses to Nelec who reviews a folder but then Nelec sees something outside the kids "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Jack's cruiser pulls up and Joe spins around as Jack arrives grabbing his camera from Charles and saying firmly to Joe Overmyer enters and crosses to Nelec who reviews a folder but then Nelec sees something outside the kids Jack opens the car's back door Joe is stunned and instantly humiliated in front of Alice and he is taken back to the squad car then throws the camera and tripod into the passenger seat and slams that door before heading to the house and leaving Joe in the back Joe gets in and Jack slams it shut this lands on Nelec and Jack heads off Nelec heads outside and Jack moves to him Joe his breathing heavy sits in the car with his heart pounding watching his father move over to talk to Nelec close again while Alice watches him sympathetically Jack stops and turns to uncomfortable Nelec Joe closes the door hard and says angrily but restrained The door opens and Jack enters letting Joe pass him Jack moves close to Joe intimidating and Joe steps back feeling Jack turns to leave but Joe enraged says something that makes Jack stop stunned as Joe's heart pounds Jack suddenly stops himself realizing what he is saying and to whom he is saying it but somehow in this moment he cannot be a better father than law officer Jack is intense Joe rides up a hill revealing the town cemetery and sits with his back against his mother's grave holding her open locket and staring at it More upset at himself than Joe he heads out Joe is motionless But then he hears a sound and turns hearing a deep and low sound in the distance He hears another intense low sound He stands pulls out his flashlight and aims the beam down the rows of graves toward the big caretaker's she would in the distance Another odd sound occurs which transitions us to Jack's squad car arriving at the abandoned airfield then a high pitch hit like metal on wood and Joe backs up nervous Suddenly the three large military trucks' headlights come on all aimed at Jack Jack's car pulls up and he gets out He is looking at someone we do not yet see in the background he is blinded and tries to see past an IV and medical machinery Nelec is quiet and simple Overmyer stands watching he lies in a medical bed afraid but defiant Now we see who he is talking to battered and scraped By the door Overmyer is quietly putting on his black gloves while Nelec offers a vague searching smile Dr Woodward swallows and feels that his time on Earth is coming to an end no matter what he does here"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Joe rides up a hill revealing the town cemetery and sits with his back against his mother's grave holding her open locket and staring at it  But then he hears a sound and turns hearing a deep and low sound in the distance  Joe is motionless  He stands pulls out his flashlight and aims the beam down the rows of graves toward the big caretaker's shed in the distance  He hears another intense low sound then a high pitch hit like metal on wood and Joe backs up nervous  Another odd sound occurs which transitions us to Jack's squad car arriving at the abandoned airfield  Jack's car pulls up and he gets out  Suddenly the three large military trucks' headlights come on all aimed at Jack  he is blinded and tries to see past an IV and medical machinery  He's looking at someone we don't yet see in the background  Overmyer stands watching  Nelec is quiet and simple  Now we see who he's talking to battered and scraped  he lies in a medical bed afraid but defiant  Dr Woodward swallows and feels that his time on Earth is coming to an end no matter what he does here  By the door Overmyer is quietly putting on his black gloves while Nelec offers a vague searching smile Overmyer enters and crosses to Nelec who reviews a folder but then Nelec sees something outside the kids  Jack's cruiser pulls up and Joe spins around as Jack arrives grabbing his camera from Charles and saying firmly to Joe  Joe is stunned and instantly humiliated in front of Alice and he's taken back to the squad car  Jack opens the car's back door  Joe gets in and Jack slams it shut  then throws the camera and tripod into the passenger seat and slams that door before heading to the house and leaving Joe in the back  Nelec heads outside and Jack moves to him  this lands on Nelec and Jack heads off  Jack stops and turns to uncomfortable Nelec  Joe his breathing heavy sits in the car with his heart pounding watching his father move over to talk to Nelec close again while Alice watches him sympathetically  The door opens and Jack enters letting Joe pass him  Joe closes the door hard and says angrily but restrained  Jack turns to leave but Joe enraged says something that makes Jack stop stunned as Joe's heart pounds  Jack moves close to Joe intimidating and Joe steps back feeling Jack is intense  Jack suddenly stops himself realizing what he's saying and to whom he's saying it but somehow in this moment he can't be a better father than law officer  More upset at himself than Joe he heads out "
        }
      ]
    }
  ]
}