{
  "ground_truth": "Debbie gets out of the shower, followed by Pete, who sneaks down the hallway and kisses Sadie (13) to wake her, but she wants to be left alone as Pete breathes all over her while talking. Pete lifts a sleeping Charlotte (8) out of bed, walks her downstairs in a ridiculous manner due to her being too tall to be held like a baby, and they set up a tray of muffins and donuts on the table, decorating the room with birthday balloons and streamers, with Pete occasionally sneaking bacon, cupcakes, and mini donuts into his mouth. The house appears more cluttered and messier than previously depicted in Knocked Up. Debbie opens a window and sneaks a cigarette while Sadie watches Lost on her iPad and Pete and Debbie talk in the kitchen; Pete clears the breakfast dishes, turns on the faucet, and pours water on a cupcake. Meanwhile, Charlotte plays the theme from The Office on her keyboard, and Sadie tears apart her closet looking for clothes. Debbie is in workout gear when Pete enters wearing a lycra outfit with multiple logos. As Debbie leaves, Pete picks the soaking wet cupcake out of the sink and takes a bite. Debbie then runs up a long flight of stairs with her trainer Jason while her friend Barb trails behind. We then see Pete in a large group of bikers riding down San Vicente with his friend Barry, narrowly avoiding a collision when a car makes a right turn in front of him, prompting him to bang on the back of the car. Meanwhile, Debbie is doing sit-ups while talking to Jason, who holds her feet down, with Barb stretching on a yoga ball in the background and Jason demonstrating exercises. Pete and Barry eat frosted scones, enjoying some alone time to delay returning home. The family is driving with Sadie watching an episode of Lost on an iPad, and, during a violent scene, Charlotte grabs for Sadie’s iPad and starts trying to lick her. Pete and Debbie get out of the car and walk down the street into a store where they see their two employees, Jodi and a new, gorgeous employee named Desi, who is up on a ladder. Debbie goes behind the register, looks at Jodi, while Pete is still staring at Desi before he walks over to Debbie. Desi then comes down to help a customer at the front of the store. We see quick cuts of Debbie playing with the kids on the trampoline outside, doing a full flip and landing on her feet, with Pete nowhere to be found. Finally, Debbie walks down the hall and into the bathroom without knocking.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Debbie exits from the shower, trailed by Pete, who creeps down the corridor and kisses Sadie (13) to rouse her, but she wishes to be left solitary as Pete exhales all over her while speaking. Pete elevates a slumbering Charlotte (8) out of bed, carries her downstairs in a ludicrous way due to her being too tall to be held like an infant, and they set up a platter of pastries and fritters on the table, adorning the room with birthday balloons and streamers, with Pete occasionally filching bacon, cupcakes, and mini fritters into his mouth. The house seems more cluttered and untidy than formerly portrayed in Knocked Up. Debbie opens a window and filches a cigarette while Sadie watches Lost on her iPad and Pete and Debbie converse in the kitchen; Pete clears the breakfast dishes, activates the faucet, and pours water on a cupcake. Meanwhile, Charlotte plays the theme from The Office on her keyboard, and Sadie ransacks her closet seeking clothes. Debbie is in workout gear when Pete enters wearing a lycra outfit with multiple logos. As Debbie departs, Pete picks the drenched cupcake out of the sink and takes a bite. Debbie then dashes up a lengthy flight of stairs with her trainer Jason while her friend Barb lags behind. We then observe Pete in a large group of cyclists riding down San Vicente with his friend Barry, narrowly dodging a crash when a vehicle makes a right turn in front of him, prompting him to knock on the rear of the vehicle. Meanwhile, Debbie is doing sit-ups while chatting to Jason, who holds her feet down, with Barb extending on a yoga ball in the background and Jason demonstrating exercises. Pete and Barry consume frosted scones, relishing some solitary time to postpone returning home. The family is traveling with Sadie watching an episode of Lost on an iPad, and, during a violent scene, Charlotte grabs for Sadie’s iPad and starts attempting to lick her. Pete and Debbie exit the car and stroll down the street into a store where they see their two employees, Jodi and a new, beautiful employee named Desi, who is up on a ladder. Debbie goes behind the register, looks at Jodi, while Pete is still gazing at Desi before he walks over to Debbie. Desi then descends to assist a patron at the front of the store. We see quick cuts of Debbie playing with the kids on the trampoline outside, doing a full flip and landing on her feet, with Pete nowhere to be found. Finally, Debbie strolls down the hall and into the bathroom without knocking."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Debbie gets out of the shower, followed by Pete, who sneaks down the hallway and kisses Sadie (13) to wake her, but she wants to be left alone as Pete breathes all over her while talking. A sleeping Charlotte (8) is lifted out of bed by Pete, and she is walked downstairs in a ridiculous manner due to her being too tall to be held like a baby, and they set up a tray of muffins and donuts on the table, decorating the room with birthday balloons and streamers, while bacon, cupcakes, and mini donuts are occasionally sneaked into his mouth by Pete. The house appears more cluttered and messier than previously depicted in Knocked Up. A window is opened by Debbie, who sneaks a cigarette while Sadie watches Lost on her iPad and Pete and Debbie talk in the kitchen; the breakfast dishes are cleared by Pete, who turns on the faucet, and water is poured on a cupcake. Meanwhile, Charlotte plays the theme from The Office on her keyboard, and Sadie tears apart her closet looking for clothes. Debbie is in workout gear when Pete enters wearing a lycra outfit with multiple logos. As Debbie leaves, the soaking wet cupcake is picked out of the sink by Pete, who takes a bite. Debbie then runs up a long flight of stairs with her trainer Jason while her friend Barb trails behind. We then see Pete in a large group of bikers riding down San Vicente with his friend Barry, who narrowly avoids a collision when a car makes a right turn in front of him, prompting Pete to bang on the back of the car. Meanwhile, Debbie is doing sit-ups while talking to Jason, who holds her feet down, with Barb stretching on a yoga ball in the background and Jason demonstrating exercises. Frosted scones are eaten by Pete and Barry, who enjoy some alone time to delay returning home. The family is driving with Sadie watching an episode of Lost on an iPad, and, during a violent scene, Charlotte grabs for Sadie’s iPad and starts trying to lick her. Pete and Debbie get out of the car and walk down the street into a store where they see their two employees, Jodi and a new, gorgeous employee named Desi, who is up on a ladder. Debbie goes behind the register, looks at Jodi, while Desi is still stared at by Pete before he walks over to Debbie. Desi then comes down to help a customer at the front of the store. We see quick cuts of Debbie playing with the kids on the trampoline outside, doing a full flip and landing on her feet, with Pete nowhere to be found. Finally, Debbie walks down the hall and into the bathroom without knocking."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Debbie exits the shower, followed by Pete, who sneaks into Sadie's (13) room to kiss her awake, but she wants to be left alone due to his breathing while talking. Pete awkwardly carries Charlotte (8) downstairs because she is too tall to be held like a baby. They set up muffins and donuts on the table, decorating with balloons and streamers, while Pete sneaks bites of bacon, cupcakes, and mini donuts. The house appears messier than in Knocked Up. Debbie secretly smokes as Sadie watches Lost on her iPad; Pete and Debbie converse in the kitchen while Pete clears dishes and wets a cupcake. Meanwhile, Charlotte plays The Office theme on the keyboard, and Sadie searches for clothes in her closet. Debbie, in workout attire, leaves as Pete, in a logo-covered lycra outfit, retrieves the wet cupcake and bites it. Debbie runs stairs with trainer Jason while her friend Barb follows. Pete cycles with Barry on San Vicente, nearly colliding with a car, angrily hitting it. Debbie does sit-ups with Jason’s help, Barb stretches on a yoga ball as Jason demonstrates. Pete and Barry enjoy frosted scones, delaying their return home. The family drives with Sadie watching Lost on an iPad; during a violent scene, Charlotte tries to lick Sadie's iPad. Pete and Debbie walk into a store, seeing employees Jodi and the attractive new worker Desi on a ladder. Debbie goes behind the register, noticing Jodi, while Pete stares at Desi before joining Debbie. Desi assists a customer in the store. Quick cuts show Debbie playing on a trampoline, flipping and landing on her feet, while Pete is absent. Finally, Debbie enters the bathroom without knocking."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Debbie exits the shower, followed by Pete, who kisses Sadie (13) to wake her, but she wants to be left alone. Pete awkwardly carries sleeping Charlotte (8), sets up muffins and donuts with birthday decorations, sneaking snacks. The house is messier than in Knocked Up. Debbie smokes secretly while Sadie watches Lost. Pete clears dishes, pours water on a cupcake, Charlotte plays The Office theme on her keyboard, and Sadie searches for clothes. Debbie, in workout gear, leaves as Pete eats the wet cupcake. Pete and bikers, including Barry, ride down San Vicente, nearly colliding with a car. Debbie exercises with Jason and Barb. Pete and Barry delay returning home by eating scones. The family drives with Sadie watching Lost, Charlotte grabbing the iPad. Pete and Debbie enter a store, see employees Jodi and Desi on a ladder. Desi helps a customer, Pete stares, then joins Debbie. Debbie plays with the kids on a trampoline, landing a flip, then walks into the bathroom without knocking."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Debbie steps gracefully out of the warm, steamy shower. Shortly after, Pete quietly sneaks down the hallway, where he gently kisses Sadie, their thirteen-year-old daughter, in an attempt to wake her from her slumber. However, Sadie wishes to be left alone, feeling slightly annoyed as Pete talks and breathes too closely to her face. Meanwhile, Pete also lifts their younger daughter, eight-year-old Charlotte, from her bed. Due to her height, carrying her like a baby results in a rather awkward and humorous manner as he walks her downstairs. Together, they enthusiastically set up a tray laden with muffins and donuts on the table, skillfully decorating the room with festive birthday balloons and streamers. In between these tasks, Pete sneakily indulges in bacon, cupcakes, and mini donuts, finding brief moments of indulgence. The house noticeably appears more cluttered and messy than it was previously depicted in \"Knocked Up.\"\n\nDebbie, seeking a moment of solitude, opens a window and discreetly enjoys a cigarette, while Sadie remains engrossed, watching \"Lost\" on her iPad. In the kitchen, Pete and Debbie converse as Pete efficiently clears the breakfast dishes, turns on the faucet, and playfully pours water over a cupcake. Meanwhile, Charlotte is absorbed in her music, skillfully playing the theme from \"The Office\" on her keyboard, as Sadie rummages through her closet in a frantic search for clothes. Debbie, dressed in her workout attire, is soon joined by Pete, who wears a lycra outfit adorned with multiple logos. As Debbie exits, Pete retrieves the soaking wet cupcake from the sink and daringly takes a bite.\n\nDebbie then tackles a long flight of stairs, exercising with her trainer Jason, while her friend Barb follows behind. In another scene, Pete is among a large group of bikers, riding down San Vicente with his friend Barry. They experience a close call, narrowly avoiding a collision when a car recklessly makes a right turn in front of them, prompting Pete to retaliate by tapping on the car's rear. Meanwhile, Debbie is engaged in sit-ups, conversing with Jason, who anchors her feet, as Barb stretches on a yoga ball nearby, watching Jason demonstrate exercises. Pete and Barry indulge in frosted scones, savoring some peaceful alone time to delay the inevitable return home.\n\nThe family later drives together, with Sadie absorbed in an episode of \"Lost\" on her iPad. During a particularly intense scene, Charlotte reaches for Sadie's iPad and playfully attempts to lick her. Upon arriving, Pete and Debbie get out of the car and stroll down the street, entering a store where they encounter their two employees, Jodi, and a new, stunning employee named Desi, who is perched on a ladder. Debbie moves behind the register and exchanges a glance with Jodi, while Pete is momentarily captivated, staring at Desi before joining Debbie. Desi gracefully descends to assist a customer at the front of the store. The scene shifts to quick glimpses of Debbie outside, energetically playing with the kids on a trampoline, executing a full flip with precision and landing on her feet, while Pete is conspicuously absent. Lastly, Debbie walks confidently down the hall and enters the bathroom without knocking, asserting her presence."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Debbie steps out of the warm, steamy shower with an elegant and graceful motion. Shortly after this, Pete quietly makes his way down the hallway. He gently kisses Sadie, their thirteen-year-old daughter, in a tender attempt to stir her from her slumber. However, Sadie, feeling a bit annoyed, wishes to be left alone, as Pete talks and breathes a little too closely to her face. Meanwhile, Pete also tends to their younger daughter, eight-year-old Charlotte, by lifting her from her bed. Due to her height, carrying her like a baby results in a somewhat awkward and humorous manner as he carefully walks her downstairs. Together, with great enthusiasm, they set up a tray that is generously laden with muffins and donuts on the table, skillfully decorating the room with vibrant and festive birthday balloons and streamers. Amidst these tasks, Pete stealthily indulges in moments of enjoyment as he sneaks bites of bacon, cupcakes, and mini donuts. The house is noticeably more cluttered and messy than it was previously depicted in \"Knocked Up.\"\n\nSeeking a moment of solitude and peace, Debbie opens a window and discreetly indulges in a cigarette, while Sadie remains engrossed in watching \"Lost\" on her iPad. In the kitchen, Pete and Debbie engage in conversation as Pete efficiently handles clearing the breakfast dishes, turns on the faucet, and with playful intent, pours water over a cupcake. Meanwhile, Charlotte is completely absorbed in her music, skillfully playing the theme from \"The Office\" on her keyboard, while Sadie rummages through her closet in a frantic search for clothes. Debbie, dressed in her workout attire, is soon joined by Pete, who is wearing a lycra outfit adorned with numerous logos. As Debbie makes her exit, Pete retrieves the now soaking wet cupcake from the sink and daringly takes a bite.\n\nDebbie then tackles a long flight of stairs with determination, exercising with her trainer Jason, while her friend Barb follows closely behind. In another scene, Pete is part of a large group of bikers, riding down San Vicente alongside his friend Barry. They encounter a close call, narrowly avoiding a collision when a car recklessly makes a right turn in front of them, prompting Pete to respond by tapping on the car's rear. Meanwhile, Debbie is engaged in sit-ups, conversing with Jason, who helpfully anchors her feet, as Barb stretches on a yoga ball nearby, watching Jason skillfully demonstrate exercises. Pete and Barry indulge in frosted scones, savoring some peaceful alone time to delay the inevitable return home.\n\nLater, the family is seen driving together, with Sadie absorbed in an episode of \"Lost\" on her iPad. During a particularly intense scene, Charlotte reaches for Sadie's iPad and playfully attempts to lick her. Upon arriving at their destination, Pete and Debbie step out of the car and stroll leisurely down the street before entering a store. Inside, they encounter their two employees, Jodi, and a new, stunning employee named Desi, who is perched on a ladder. Debbie moves behind the register and exchanges a knowing glance with Jodi, while Pete becomes momentarily captivated, staring at Desi before joining Debbie. Desi then gracefully descends to assist a customer at the front of the store. The scene shifts to quick glimpses of Debbie outside, energetically playing with the kids on a trampoline, executing a full flip with precision and landing on her feet effortlessly, while Pete is noticeably absent from this scene. Lastly, Debbie walks confidently down the hall and enters the bathroom without knocking, asserting her presence with confidence."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "After stepping out of the shower, Debbie reaches for a towel, wraps it around herself, and dries off, while Pete follows shortly afterward, quietly exiting the bathroom. He tiptoes down the hallway, carefully trying not to make any noise as he approaches Sadie, who is still asleep. Leaning in close, he gently kisses her on the cheek to rouse her from her slumber. Sadie, still wanting to savor the last moments of sleep, turns away, grimacing slightly as Pete's breath tickles her face while he speaks to her. Turning his attention to Charlotte, Pete tenderly scoops up their sleeping daughter, albeit awkwardly, as she is now too tall to be carried like an infant, and they make their way downstairs. Once there, they place a tray of muffins and donuts on the table, setting up an inviting breakfast display. While arranging the room with birthday balloons and colorful streamers, Pete slyly indulges himself, sneaking bites of crispy bacon, cupcakes, and mini donuts, popping each treat into his mouth with quick, surreptitious movements. The house now bears a more cluttered and messier appearance than it did in the movie \"Knocked Up,\" with items strewn about haphazardly. Meanwhile, Debbie, craving a moment of solace, opens a window and discreetly lights a cigarette. She stands by the window, exhaling smoke into the outside air, while in the background, Sadie focuses intently on an episode of \"Lost\" playing on her iPad. In the kitchen, Pete and Debbie engage in a casual conversation. As their dialogue flows, Pete efficiently clears the breakfast dishes, stacking them methodically in the sink. He turns on the faucet, watching the water stream down before playfully pouring some over a cupcake. In another room, Charlotte energetically taps away at her keyboard, playing the theme from \"The Office.\" Simultaneously, Sadie frantically rummages through her closet, tossing garments aside as she searches for the perfect outfit. Debbie, now dressed in workout gear, prepares to leave when Pete enters the room, clad in a lycra outfit adorned with multiple logos. As Debbie steps out, Pete retrieves the now-soaked cupcake from the sink, contemplating its soggy state momentarily before defiantly taking a bite. Meanwhile, Debbie embarks on a vigorous run, ascending a lengthy flight of stairs, her trainer Jason matching her pace step-for-step, while her friend Barb follows closely, slightly out of breath. We shift focus to Pete, who rides among a throng of bikers cruising down San Vicente, with his friend Barry nearby. They veer around a car that unexpectedly makes a right turn, narrowly avoiding a collision, prompting Pete to assertively tap on the rear of the car as a cautionary gesture. Concurrently, Debbie is engrossed in her workout, executing sit-ups with precision as Jason holds her feet firmly in place. Barb can be seen in the backdrop, stretching on a yoga ball, while Jason demonstrates additional exercises. Later, Pete and Barry take a moment for themselves, devouring frosted scones while lingering, prolonging their return home. The scene transitions to the family driving together, with Sadie engrossed in an episode of \"Lost\" on her iPad. During a particularly violent scene, Charlotte, intrigued and mischievous, leans over, reaching for Sadie's iPad and attempts to lick the screen playfully. Upon reaching their destination, Pete and Debbie exit the car, each door closing with a soft thud, and proceed to walk down the street hand in hand. Entering a store, they encounter their employees, including Jodi and a new, eye-catching staff member named Desi, perched atop a ladder. As Desi climbs down to assist a customer, Pete's gaze lingers on her momentarily before he eventually directs his attention back to Debbie, who has moved behind the register, scrutinizing Jodi with a thoughtful look. Quick, energetic cuts show Debbie outside, bouncing exuberantly on a trampoline with her kids, executing a flawless full flip and landing gracefully on her feet, all the while with Pete absent from the scene. Finally, Debbie, with purposeful strides, walks down the hallway and into the bathroom, confidently disregarding the customary knock before entering."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Debbie and Pete, fresh from their shower, begin their morning routine. Pete playfully attempts to wake Sadie, who resists, then carries Charlotte downstairs awkwardly due to her size. They prepare a celebratory breakfast spread with muffins and donuts, decorating the room with birthday balloons and streamers, while Pete sneaks bites of bacon and sweets. The house is noticeably more cluttered than in previous scenes. Debbie sneaks a cigarette by the window, Sadie watches Lost on her iPad, and Pete helps tidy the kitchen, inadvertently soaking a cupcake in the process. Charlotte entertains with a keyboard rendition of The Office theme, while Sadie frantically searches her closet. Debbie, in workout attire, encounters Pete in a logo-covered lycra outfit. Leaving the house, Debbie exercises with her trainer Jason and friend Barb, running stairs and doing sit-ups, while Pete goes biking with Barry, narrowly avoiding a car accident. Later, they enjoy scones, cherishing their time away from home. The family drives with Sadie streaming Lost, sparking a skirmish with Charlotte over the iPad. Arriving at their store, Pete and Debbie engage with employees Jodi and the striking Desi, who assists a customer. The scene shifts to Debbie playfully doing flips on a trampoline with the kids, with Pete absent. Finally, Debbie enters the bathroom without announcing herself."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Debbie gets out of the shower in their suburban Los Angeles home, followed by Pete, who sneaks down the hallway and kisses Sadie, their 13-year-old daughter, to wake her, but she wants to be left alone as Pete breathes all over her while talking, a common complaint among teenagers. Pete lifts a sleeping Charlotte, their 8-year-old, out of bed and walks her downstairs in a ridiculous manner due to her being too tall to be held like a baby. Together, they set up a tray of muffins and donuts on the table, decorating the room with brightly colored birthday balloons and streamers often used in children’s parties, with Pete occasionally sneaking bacon, cupcakes, and mini donuts into his mouth. The house appears more cluttered and messier compared to its tidy look in their previous feature, Knocked Up, which captured their chaotic yet loving life. Debbie opens a window to sneak a cigarette, a habit she tried to quit several times, while Sadie watches Lost, the early 2000s hit TV drama, on her iPad and Pete and Debbie talk in the kitchen; Pete clears the breakfast dishes, turns on the faucet, and playfully pours water on a cupcake. Meanwhile, Charlotte, aspiring to learn music, plays the theme from The Office on her keyboard, a show known for its unique, catchy melody, and Sadie tears apart her closet looking for clothes. Debbie is in workout gear, perhaps from a trendy athletic brand, when Pete enters wearing a lycra cycling outfit emblazoned with multiple sponsor logos, common in cycling culture. As Debbie leaves, Pete picks the soaking wet cupcake out of the sink and takes a bite, unfazed by its state. Debbie then runs up a long flight of stairs at a local park with her trainer Jason, a dedicated fitness enthusiast, while her friend Barb trails behind. We then see Pete in a large group of bikers riding down San Vicente Boulevard, a popular cycling route in Los Angeles, with his friend Barry, narrowly avoiding a collision when a car makes a right turn in front of him, prompting him to bang on the back of the car in frustration—a frequent hazard for city cyclists. Meanwhile, Debbie is doing sit-ups while talking to Jason, who holds her feet down to ensure proper form, with Barb stretching on a yoga ball in the background and Jason demonstrating exercises designed for core strength. Pete and Barry later eat frosted scones at a local café, enjoying some alone time to delay returning home to their busy family life. The family is driving with Sadie watching an episode of Lost on an iPad, and during a violent scene, Charlotte, in her playful curiosity, grabs for Sadie’s iPad and starts trying to lick her, mimicking animal behavior. Pete and Debbie get out of the car and walk down the street into their boutique store, where they see their two employees, Jodi and a new, gorgeous employee named Desi, who is up on a ladder organizing displays. Debbie goes behind the register, looks at Jodi, while Pete is still staring at Desi before he walks over to Debbie, captivated by Desi's presence. Desi then comes down to help a customer at the front of the store, demonstrating her helpful and engaging demeanor. We see quick cuts of Debbie playing with the kids on the trampoline outside, doing a full flip and landing on her feet, showcasing her athleticism, with Pete nowhere to be found, likely taking a moment for himself. Finally, Debbie walks down the hall and into the bathroom without knocking, a testament to the informal comforts of their home life."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Debbie goes behind the register looks at Jodi while Pete is still staring at Desi before he walks over to Debbie Debbie gets out of the shower followed by Pete who sneaks down the hallway and kisses Sadie 13 to wake her but she wants to be left alone as Pete breathes all over her while talking The house appears more cluttered and messier than previously depicted in Knocked Up Finally Debbie walks down the hall and into the bathroom without knocking Pete lifts a sleeping Charlotte 8 out of bed walks her downstairs in a ridiculous manner due to her being too tall to be held like a baby and they set up a tray of muffins and donuts on the table decorating the room with birthday balloons and streamers with Pete occasionally sneaking bacon cupcakes and mini donuts into his mouth Debbie opens a window and sneaks a cigarette while Sadie watches Lost on her iPad and Pete and Debbie talk in the kitchen Pete and Barry eat frosted scones enjoying some alone time to delay returning home Pete lifts a sleeping Charlotte 8 out of bed walks her downstairs in a ridiculous manner due to her being too tall to be held like a baby and they set up a tray of muffins and donuts on the table decorating the room with birthday balloons and streamers with Pete occasionally sneaking bacon cupcakes and mini donuts into his mouth The house appears more cluttered and messier than previously depicted in Knocked Up Debbie opens a window and sneaks a cigarette while Sadie watches Lost on her iPad and Pete and Debbie talk in the kitchen Pete clears the breakfast dishes turns on the faucet and pours water on a cupcake Meanwhile Charlotte plays the theme from The Office on her keyboard and Sadie tears apart her closet looking for clothes Debbie is in workout gear when Pete enters wearing a lycra outfit with multiple logos As Debbie leaves Pete picks the soaking wet cupcake out of the sink and takes a bite Debbie then runs up a long flight of stairs with her trainer Jason while her friend Barb trails behind We then see Pete in a large group of bikers riding down San Vicente with his friend Barry narrowly avoiding a collision when a car makes a right turn in front of him prompting him to bang on the back of the car Desi then comes down to help a customer at the front of the store Meanwhile Debbie is doing situps while talking to Jason who holds her feet down with Barb stretching on a yoga ball in the background and Jason demonstrating exercises Pete and Barry eat frosted scones enjoying some alone time to delay returning home Debbie then runs up a long flight of stairs with her trainer Jason while her friend Barb trails behind The family is driving with Sadie watching an episode of Lost on an iPad and during a violent scene Charlotte grabs for Sadie’s iPad and starts trying to lick her Pete and Debbie get out of the car and walk down the street into a store where they see their two employees Jodi and a new gorgeous employee named Desi who is up on a ladder Debbie goes behind the register looks at Jodi while Pete is still staring at Desi before he walks over to Debbie Desi then comes down to help a customer at the front of the store We see quick cuts of Debbie playing with the kids on the trampoline outside doing a full flip and landing on her feet with Pete nowhere to be found Debbie gets out of the shower followed by Pete who sneaks down the hallway and kisses Sadie 13 to wake her but she wants to be left alone as Pete breathes all over her while talking Finally Debbie walks down the hall and into the bathroom without knocking"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Debbie gets out of the shower followed by Pete who sneaks down the hallway and kisses Sadie 13 to wake her but she wants to be left alone as Pete breathes all over her while talking. Pete lifts a sleeping Charlotte 8 out of bed walks her downstairs in a ridiculous manner due to her being too tall to be held like a baby and they set up a tray of muffins and donuts on the table decorating the room with birthday balloons and streamers with Pete occasionally sneaking bacon cupcakes and mini donuts into his mouth. The house appears more cluttered and messier than previously depicted in Knocked Up. Debbie opens a window and sneaks a cigarette while Sadie watches Lost on her iPad and Pete and Debbie talk in the kitchen. Pete clears the breakfast dishes turns on the faucet and pours water on a cupcake. Meanwhile Charlotte plays the theme from The Office on her keyboard and Sadie tears apart her closet looking for clothes. Debbie is in workout gear when Pete enters wearing a lycra outfit with multiple logos. As Debbie leaves Pete picks the soaking wet cupcake out of the sink and takes a bite. Debbie then runs up a long flight of stairs with her trainer Jason while her friend Barb trails behind. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. We then see Pete in a large group of bikers riding down San Vicente with his friend Barry narrowly avoiding a collision when a car makes a right turn in front of him prompting him to bang on the back of the car. Meanwhile Debbie is doing situps while talking to Jason who holds her feet down with Barb stretching on a yoga ball in the background and Jason demonstrating exercises. Pete and Barry eat frosted scones enjoying some alone time to delay returning home. The family is driving with Sadie watching an episode of Lost on an iPad and during a violent scene Charlotte grabs for Sadie’s iPad and starts trying to lick her. Pete and Debbie get out of the car and walk down the street into a store where they see their two employees Jodi and a new gorgeous employee named Desi who is up on a ladder. Debbie goes behind the register looks at Jodi while Pete is still staring at Desi before he walks over to Debbie. Desi then comes down to help a customer at the front of the store. We see quick cuts of Debbie playing with the kids on the trampoline outside doing a full flip and landing on her feet with Pete nowhere to be found. Finally Debbie walks down the hall and into the bathroom without knocking."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Debbie gets out of the shower followed by Pete who sneaks down the hallway and kisses Sadie 13 to wake her but she wants to be left alone as Pete breathes all over her while talking. Pete lifts a sleeping Charlotte 8 out of bed walks her downstairs in a ridiculous manner due to her being too tall to be held like a baby and they set up a tray of muffins and donuts on the table decorating the room with birthday balloons and streamers with Pete occasionally sneaking bacon cupcakes and mini donuts into his mouth. The house appears more cluttered and messier than previously depicted in Knocked Up. Debbie opens a window and sneaks a cigarette while Sadie watches Lost on her iPad and Pete and Debbie talk in the kitchen. Pete clears the breakfast dishes turns on the faucet and pours water on a cupcake. Meanwhile Charlotte plays the theme from The Office on her keyboard and Sadie tears apart her closet looking for clothes. Debbie is in workout gear when Pete enters wearing a lycra outfit with multiple logos. As Debbie leaves Pete picks the soaking wet cupcake out of the sink and takes a bite. Debbie then runs up a long flight of stairs with her trainer Jason while her friend Barb trails behind. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. We then see Pete in a large group of bikers riding down San Vicente with his friend Barry narrowly avoiding a collision when a car makes a right turn in front of him prompting him to bang on the back of the car. Meanwhile Debbie is doing situps while talking to Jason who holds her feet down with Barb stretching on a yoga ball in the background and Jason demonstrating exercises. Pete and Barry eat frosted scones enjoying some alone time to delay returning home. The family is driving with Sadie watching an episode of Lost on an iPad and during a violent scene Charlotte grabs for Sadie’s iPad and starts trying to lick her. Pete and Debbie get out of the car and walk down the street into a store where they see their two employees Jodi and a new gorgeous employee named Desi who is up on a ladder. Debbie goes behind the register looks at Jodi while Pete is still staring at Desi before he walks over to Debbie. Desi then comes down to help a customer at the front of the store. We see quick cuts of Debbie playing with the kids on the trampoline outside doing a full flip and landing on her feet with Pete nowhere to be found. Finally Debbie walks down the hall and into the bathroom without knocking."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Debbie gets out of the shower followed by Pete who sneaks down the hallway and kisses Sadie 13 to wake her but she wants to be left alone as Pete breathes all over her while talking. Pete lifts a sleeping Charlotte 8 out of bed walks her downstairs in a ridiculous manner due to her being too tall to be held like a baby and they set up a tray of muffins and donuts on the table decorating the room with birthday balloons and streamers with Pete occasionally sneaking bacon cupcakes and mini donuts into his mouth. The house appears more cluttered and messier than previously depicted in Knocked Up. Debbie opens a window and sneaks a cigarette while Sadie watches Lost on her iPad and Pete and Debbie talk in the kitchen. Pete clears the breakfast dishes turns on the faucet and pours water on a cupcake. Debbie goes behind the register looks at Jodi while Pete is still staring at Desi before he walks over to Debbie. Desi then comes down to help a customer at the front of the store. We see quick cuts of Debbie playing with the kids on the trampoline outside doing a full flip and landing on her feet with Pete nowhere to be found. Finally Debbie walks down the hall and into the bathroom without knocking."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Debbie gets out of the shower followed by Pete who sneaks down the hallway and kisses Sadie 13 to wake her but she wants to be left alone as Pete breathes all over her while talking. Pete lifts a sleeping Charlotte 8 out of bed walks her downstairs in a ridiculous manner due to her being too tall to be held like a baby and they set up a tray of muffins and donuts on the table decorating the room with birthday balloons and streamers with Pete occasionally sneaking bacon cupcakes and mini donuts into his mouth. We see quick cuts of Debbie playing with the kids on the trampoline outside doing a full flip and landing on her feet with Pete nowhere to be found. Finally Debbie walks down the hall and into the bathroom without knocking."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The kangaroo gets out of the shower, followed by the raccoon, who sneaks down the hallway and kisses the giraffe (13) to wake her, but she wants to be left alone as the raccoon breathes all over her while talking. The raccoon lifts a sleeping elephant (8) out of bed, walks her downstairs in a ridiculous manner due to her being too tall to be held like a baby, and they set up a tray of muffins and donuts on the table, decorating the room with birthday balloons and streamers, with the raccoon occasionally sneaking bacon, cupcakes, and mini donuts into his mouth. The house appears more cluttered and messier than previously depicted in Knocked Up. The kangaroo opens a window and sneaks a cigarette while the giraffe watches Lost on her iPad and the raccoon and the kangaroo talk in the kitchen; the raccoon clears the breakfast dishes, turns on the faucet, and pours water on a cupcake. Meanwhile, the elephant plays the theme from The Office on her keyboard, and the giraffe tears apart her closet looking for clothes. The kangaroo is in workout gear when the raccoon enters wearing a lycra outfit with multiple logos. As the kangaroo leaves, the raccoon picks the soaking wet cupcake out of the sink and takes a bite. The kangaroo then runs up a long flight of stairs with her trainer the penguin while her friend the panda trails behind. We then see the raccoon in a large group of bikers riding down San Vicente with his friend the squirrel, narrowly avoiding a collision when a car makes a right turn in front of him, prompting him to bang on the back of the car. Meanwhile, the kangaroo is doing sit-ups while talking to the penguin, who holds her feet down, with the panda stretching on a yoga ball in the background and the penguin demonstrating exercises. The raccoon and the squirrel eat frosted scones, enjoying some alone time to delay returning home. The family is driving with the giraffe watching an episode of Lost on an iPad, and, during a violent scene, the elephant grabs for the giraffe’s iPad and starts trying to lick her. The raccoon and the kangaroo get out of the car and walk down the street into a store where they see their two employees, the flamingo and a new, gorgeous employee named the peacock, who is up on a ladder. The kangaroo goes behind the register, looks at the flamingo, while the raccoon is still staring at the peacock before he walks over to the kangaroo. The peacock then comes down to help a customer at the front of the store. We see quick cuts of the kangaroo playing with the kids on the trampoline outside, doing a full flip and landing on her feet, with the raccoon nowhere to be found. Finally, the kangaroo walks down the hall and into the bathroom without knocking."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Debbie gets out of the bathtub, followed by Pete, who sneaks down the corridor and kisses Sadie (13) to wake her, but she wants to be left alone as Pete breathes all over her while talking. Pete lifts a sleeping Charlotte (8) out of bed, walks her downstairs in a ridiculous manner due to her being too tall to be held like a cat, and they set up a tray of bagels and croissants on the counter, decorating the room with anniversary lanterns and pinwheels, with Pete occasionally sneaking sausages, brownies, and mini croissants into his mouth. The apartment appears more cluttered and messier than previously depicted in Knocked Up. Debbie opens a balcony door and sneaks a vape while Sadie watches Game of Thrones on her tablet and Pete and Debbie talk in the living room; Pete clears the breakfast dishes, turns on the fan, and pours juice on a brownie. Meanwhile, Charlotte plays the theme from Friends on her flute, and Sadie tears apart her drawer looking for accessories. Debbie is in hiking gear when Pete enters wearing a spandex outfit with multiple patches. As Debbie leaves, Pete picks the soaking wet brownie out of the trash and takes a bite. Debbie then runs up a long hill with her trainer Jason while her friend Barb trails behind. We then see Pete in a large group of skateboarders riding down Main Street with his friend Barry, narrowly avoiding a collision when a scooter makes a right turn in front of him, prompting him to bang on the back of the scooter. Meanwhile, Debbie is doing lunges while talking to Jason, who holds her wrist down, with Barb stretching on a pilates mat in the background and Jason demonstrating stretches. Pete and Barry eat iced pastries, enjoying some alone time to delay returning home. The family is driving with Sadie watching an episode of Game of Thrones on a tablet, and during a dramatic scene, Charlotte grabs for Sadie’s tablet and starts trying to lick her. Pete and Debbie get out of the vehicle and walk down the alley into a market where they see their two employees, Jodi and a new, gorgeous employee named Desi, who is up on a stool. Debbie goes behind the counter, looks at Jodi, while Pete is still staring at Desi before he walks over to Debbie. Desi then comes down to help a shopper at the front of the market. We see quick cuts of Debbie playing with the kids on the seesaw outside, doing a full flip and landing on her feet, with Pete nowhere to be found. Finally, Debbie walks down the hallway and into the kitchen without knocking."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Debbie hops out of the shower, followed by Pete, who dances down the hallway and pats Sadie (13) on the head to wake her, but she wants to be left alone as Pete hums all over her while whispering. Pete drags a sleeping Charlotte (8) out of bed, skips her downstairs in a comical manner due to her being too tall to be carried like a newborn, and they toss a tray of muffins and donuts on the table, scattering the room with birthday balloons and streamers, with Pete occasionally flicking bacon, cupcakes, and mini donuts into his mouth. The house appears more cluttered and messier than previously depicted in Knocked Up. Debbie closes a window and twirls a pen while Sadie watches Lost on her iPad and Pete and Debbie dance in the kitchen; Pete tosses the breakfast dishes, turns off the faucet, and splashes water on a cupcake. Meanwhile, Charlotte taps the theme from The Office on her keyboard, and Sadie scatters her closet looking for clothes. Debbie is in workout gear when Pete enters wearing a lycra outfit with multiple logos. As Debbie leaves, Pete plucks the soaking wet cupcake out of the sink and juggles it. Debbie then skips up a long flight of stairs with her trainer Jason while her friend Barb wanders behind. We then see Pete in a large group of bikers gliding down San Vicente with his friend Barry, narrowly missing a collision when a car makes a right turn in front of him, prompting him to tap on the back of the car. Meanwhile, Debbie is jumping jacks while talking to Jason, who holds her feet down, with Barb bouncing on a yoga ball in the background and Jason modeling exercises. Pete and Barry devour frosted scones, savoring some alone time to delay returning home. The family is flying with Sadie watching an episode of Lost on an iPad, and, during a violent scene, Charlotte grabs for Sadie’s iPad and starts trying to nudge her. Pete and Debbie step out of the car and dance down the street into a store where they see their two employees, Jodi and a new, gorgeous employee named Desi, who is perched on a ladder. Debbie hops behind the register, glances at Jodi, while Pete is still eyeing Desi before he skips over to Debbie. Desi then descends to assist a customer at the front of the store. We see quick cuts of Debbie jumping with the kids on the trampoline outside, doing a full spin and landing on her toes, with Pete nowhere to be found. Finally, Debbie skips down the hall and into the bathroom without knocking."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The lamp gets out of the refrigerator, followed by the chair, which sneaks down the staircase and kisses the stapler (13) to wake it, but it wants to be left alone as the chair breathes all over it while talking. The chair lifts a sleeping bookshelf (8) out of the hammock, walks it downstairs in a ridiculous manner due to it being too tall to be held like a puppy, and they set up a tray of pineapples and bagels on the couch, decorating the garage with holiday lanterns and ribbons, with the chair occasionally sneaking waffles, pancakes, and mini bagels into its mouth. The boat appears more cluttered and messier than previously depicted in Rented Out. The lamp opens a drawer and sneaks a keyboard while the stapler watches Friends on its blender and the chair and the lamp talk in the attic; the chair clears the lunch utensils, turns on the lamp, and pours juice on a pancake. Meanwhile, the bookshelf plays the theme from The Simpsons on its guitar, and the stapler tears apart its suitcase looking for markers. The lamp is in hiking gear when the chair enters wearing a denim outfit with multiple zippers. As the lamp leaves, the chair picks the soaking wet pancake out of the freezer and takes a bite. The lamp then runs up a long flight of escalators with its veterinarian Alex while its cousin Charlie trails behind. We then see the chair in a large bunch of zebras riding down Maple Avenue with its cousin Frankie, narrowly avoiding a collision when a train makes a left turn in front of it, prompting it to bang on the back of the train. Meanwhile, the lamp is doing squats while talking to Alex, who holds its knees down, with Charlie stretching on a hula hoop in the background and Alex demonstrating dances. The chair and Frankie eat toasted muffins, enjoying some alone time to delay returning to the barn. The sandwich is driving with the stapler watching an episode of Friends on a blender, and, during a quiet scene, the bookshelf grabs for the stapler’s blender and starts trying to lick it. The chair and the lamp get out of the canoe and walk down the alley into a market where they see their two neighbors, Cindy and a new, handsome neighbor named Leo, who is up on a bench. The lamp goes behind the counter, looks at Cindy, while the chair is still staring at Leo before it walks over to the lamp. Leo then comes down to help an artist at the back of the market. We see quick cuts of the lamp playing with the raccoons on the seesaw outside, doing a full twist and landing on its hands, with the chair nowhere to be found. Finally, the lamp walks down the alley and into the closet without renting."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Martha wanders out of the sauna, trailed by Bob, who crawls up the staircase and tickles Nora (13) to wake her, but she wants to be undisturbed as Bob whispers all over her while laughing. Bob hoists a napping Jamie (8) out of her bed, drags her downstairs in an awkward manner due to her being too heavy to be lifted like a kitten, and they pile up a basket of croissants and bagels on the table, embellishing the room with anniversary lanterns and garlands, with Bob occasionally munching on bacon, cookies, and mini bagels. The apartment seems more cluttered and untidier than previously depicted in Mix-Up. Martha closes a curtain and sneaks a lollipop while Nora watches Friends on her tablet and Bob and Martha chat in the living room; Bob wipes the breakfast crumbs, turns on the kettle, and spills tea on a cookie. Meanwhile, Jamie plays the theme from Friends on her guitar, and Nora rummages through her dresser looking for accessories. Martha is in evening attire when Bob enters wearing a nylon suit with various patches. As Martha departs, Bob plucks the soggy cookie out of the bin and takes a nibble. Martha then skips up a steep set of ladders with her trainer Alex while her buddy Sue shuffles behind. We then spot Bob in a massive gathering of joggers running down Main Street with his buddy Mike, narrowly avoiding a crash when a van pulls into his lane, prompting him to tap on the back of the van. Meanwhile, Martha is doing planks while chatting with Alex, who supports her shoulders, with Sue balancing on a stability board in the corner and Alex highlighting workouts. Bob and Mike devour chocolate eclairs, savoring some downtime to postpone returning home. The family is driving with Nora watching an episode of Friends on a tablet, and during a dramatic scene, Jamie reaches for Nora’s tablet and begins trying to snack on her. Bob and Martha step out of the vehicle and tread down the boulevard into a boutique where they observe their two assistants, Kelly and a new, stunning assistant named Lucy, who is perched on a stool. Martha goes behind the desk, glances at Kelly, while Bob is still gazing at Lucy before he ambles over to Martha. Lucy then descends to assist a patron at the entrance of the boutique. We glimpse rapid sequences of Martha playing with the kids on the swing set outside, executing a perfect spin and landing gracefully, with Bob nowhere to be seen. Finally, Martha strides down the hallway and into the kitchen without knocking."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Debbie emerges from the hammock, followed by Pete, who tiptoes down the hallway and taps Sadie (13) on the nose to rouse her, but she prefers to be ignored as Pete whistles all around her while chatting. Pete nudges a lounging Charlotte (8) off the couch, dances her downstairs in an awkward posture due to her being too leggy to be cradled like a kitten, and they prepare a basket of croissants and bagels on the counter, adorning the room with holiday lanterns and confetti, with Pete occasionally slipping apples, brownies, and tiny éclairs into his mouth. The house seems more chaotic and untidy than previously shown in Knocked Up. Debbie opens a door and munches on a carrot while Sadie watches Friends on her tablet and Pete and Debbie chat in the den; Pete tidies the breakfast cups, turns on the radio, and sprinkles water on a brownie. Meanwhile, Charlotte strums the theme from Friends on her guitar, and Sadie rummages her closet searching for accessories. Debbie is in swim gear when Pete enters wearing a satin outfit covered with various emblems. As Debbie departs, Pete grabs the drenched brownie out of the sink and nibbles on it. Debbie then hikes up a steep hill with her guide Jason while her buddy Barb lags behind. We then see Pete in a large group of skaters gliding down Main Street with his pal Barry, narrowly evading a tumble when a bicycle swerves right in front of him, urging him to rap on the side of the bicycle. Meanwhile, Debbie is doing planks while chatting to Jason, who holds her ankles down, with Barb bouncing on a Pilates ball in the background and Jason illustrating poses. Pete and Barry sip iced coffees, relishing some quiet time to postpone returning home. The family is flying with Sadie watching an episode of Friends on a tablet, and, during a tense moment, Charlotte lunges for Sadie’s tablet and starts attempting to tickle her. Pete and Debbie step out of the airplane and saunter down the road into a park where they see their two co-workers, Jodi and a new, stunning associate named Desi, who is perched on a tree branch. Debbie strolls behind the bench, glances at Jodi, while Pete is still gawking at Desi before he ambles over to Debbie. Desi then climbs down to assist a passerby at the edge of the park. We see quick glimpses of Debbie frolicking with the kids on the merry-go-round outside, spinning around and landing on her hands, with Pete nowhere to be observed. Finally, Debbie strolls down the corridor and into the bedroom without hesitating."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Clara hops out of the canoe, followed by Max, who tiptoes through the forest and nudges Lulu (13) to startle her, but she prefers to be left in peace as Max hums all around her while whispering. Max swings a snoozing Oliver (8) out of the hammock, carries him uphill in a ridiculous manner due to him being too old to be cradled like a puppy, and they arrange a platter of pretzels and eclairs on the stump, decorating the area with holiday lights and garlands, with Max occasionally sneaking celery sticks, candy bars, and mini eclairs into his mouth. The garden appears more overgrown and chaotic than previously seen in Blown Up. Clara cracks open a gate and sneaks a chocolate bar while Lulu watches Friends on her tablet and Max and Clara chat in the meadow; Max tidies the picnic leftovers, turns on the hose, and pours water on an eclair. Meanwhile, Oliver plays the theme from Friends on his guitar, and Lulu rummages through her trunk hunting for shoes. Clara is in hiking attire when Max enters wearing a rubber suit covered in patches. As Clara departs, Max picks the soggy eclair out of the puddle and takes a nibble. Clara then jogs up a winding trail with her guide Tony while her companion Kim follows closely. We then see Max in a large pack of skaters gliding down The Boulevard with his buddy Alan, narrowly dodging a collision when a wagon makes a left turn in front of him, prompting him to thump on the back of the wagon. Meanwhile, Clara is doing push-ups while chatting with Tony, who holds her hands down, with Kim balancing on a workout ball in the background and Tony demonstrating movements. Max and Alan munch on frosted bagels, savoring some solitude to delay returning to the meadow. The group is wandering with Lulu watching a chapter of Friends on a tablet, and, during a dramatic part, Oliver lunges for Lulu’s tablet and starts attempting to chew it. Max and Clara climb out of the wagon and stroll down the path into a stand where they observe their two aides, Frankie and a new, charming aide named Dana, who is up on a stool. Clara moves behind the booth, glances at Frankie, while Max is still gazing at Dana before he strolls over to Clara. Dana then descends to assist a visitor at the front of the stand. We see quick flashes of Clara frolicking with the young ones on the merry-go-round outside, doing a full twist and landing on her fingers, with Max nowhere to be seen. Lastly, Clara meanders down the corridor and into the shed without announcing herself."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Debbie exits the shower, and Pete sneaks to wake Sadie (13) with a kiss, but she wants to be left alone. He humorously carries Charlotte (8) downstairs, setting up a birthday spread with muffins and donuts while sneaking bites. The house is messier than before. Debbie sneaks a cigarette as Sadie watches Lost on her iPad, and Pete pours water on a cupcake. Charlotte plays The Office theme on her keyboard, and Sadie searches her closet. Debbie, in workout gear, leaves with her trainer Jason and friend Barb, while Pete dons a lycra outfit to cycle with friend Barry, narrowly avoiding a car collision. Later, Pete and Barry relax over scones. The family drives with Sadie watching Lost, and Charlotte tries to lick her iPad. Pete and Debbie visit their store, noticing new employee Desi on a ladder. Debbie engages with the kids on a trampoline, performing a flip, before walking into the bathroom without knocking."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Finally Debbie walks down the hall and into the bathroom without knocking We see quick cuts of Debbie playing with the kids on the trampoline outside doing a full flip and landing on her feet with Pete nowhere to be found Desi then comes down to help a customer at the front of the store Debbie goes behind the register looks at Jodi while Pete is still staring at Desi before he walks over to Debbie Pete and Debbie get out of the car and walk down the street into a store where they see their two employees Jodi and a new gorgeous employee named Desi who is up on a ladder The family is driving with Sadie watching an episode of Lost on an iPad and during a violent scene Charlotte grabs for Sadie’s iPad and starts trying to lick her Pete and Barry eat frosted scones enjoying some alone time to delay returning home Meanwhile Debbie is doing situps while talking to Jason who holds her feet down with Barb stretching on a yoga ball in the background and Jason demonstrating exercises We then see Pete in a large group of bikers riding down San Vicente with his friend Barry narrowly avoiding a collision when a car makes a right turn in front of him prompting him to bang on the back of the car Debbie then runs up a long flight of stairs with her trainer Jason while her friend Barb trails behind As Debbie leaves Pete picks the soaking wet cupcake out of the sink and takes a bite Debbie is in workout gear when Pete enters wearing a lycra outfit with multiple logos Meanwhile Charlotte plays the theme from The Office on her keyboard and Sadie tears apart her closet looking for clothes Pete clears the breakfast dishes turns on the faucet and pours water on a cupcake Debbie opens a window and sneaks a cigarette while Sadie watches Lost on her iPad and Pete and Debbie talk in the kitchen The house appears more cluttered and messier than previously depicted in Knocked Up Pete lifts a sleeping Charlotte 8 out of bed walks her downstairs in a ridiculous manner due to her being too tall to be held like a baby and they set up a tray of muffins and donuts on the table decorating the room with birthday balloons and streamers with Pete occasionally sneaking bacon cupcakes and mini donuts into his mouth Debbie gets out of the shower followed by Pete who sneaks down the hallway and kisses Sadie 13 to wake her but she wants to be left alone as Pete breathes all over her while talking"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Pete and Debbie get out of the car and walk down the street into a store where they see their two employees Jodi and a new gorgeous employee named Desi who is up on a ladder The family is driving with Sadie watching an episode of Lost on an iPad and during a violent scene Charlotte grabs for Sadie’s iPad and starts trying to lick her Pete clears the breakfast dishes turns on the faucet and pours water on a cupcake We then see Pete in a large group of bikers riding down San Vicente with his friend Barry narrowly avoiding a collision when a car makes a right turn in front of him prompting him to bang on the back of the car Meanwhile Charlotte plays the theme from The Office on her keyboard and Sadie tears apart her closet looking for clothes As Debbie leaves Pete picks the soaking wet cupcake out of the sink and takes a bite We see quick cuts of Debbie playing with the kids on the trampoline outside doing a full flip and landing on her feet with Pete nowhere to be found Debbie is in workout gear when Pete enters wearing a lycra outfit with multiple logos Meanwhile Debbie is doing situps while talking to Jason who holds her feet down with Barb stretching on a yoga ball in the background and Jason demonstrating exercises Desi then comes down to help a customer at the front of the store Pete lifts a sleeping Charlotte 8 out of bed walks her downstairs in a ridiculous manner due to her being too tall to be held like a baby and they set up a tray of muffins and donuts on the table decorating the room with birthday balloons and streamers with Pete occasionally sneaking bacon cupcakes and mini donuts into his mouth Pete and Barry eat frosted scones enjoying some alone time to delay returning home The house appears more cluttered and messier than previously depicted in Knocked Up Debbie goes behind the register looks at Jodi while Pete is still staring at Desi before he walks over to Debbie Finally Debbie walks down the hall and into the bathroom without knocking Debbie then runs up a long flight of stairs with her trainer Jason while her friend Barb trails behind Debbie gets out of the shower followed by Pete who sneaks down the hallway and kisses Sadie 13 to wake her but she wants to be left alone as Pete breathes all over her while talking Debbie opens a window and sneaks a cigarette while Sadie watches Lost on her iPad and Pete and Debbie talk in the kitchen"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "We then see Pete in a large group of bikers riding down San Vicente with his friend Barry narrowly avoiding a collision when a car makes a right turn in front of him prompting him to bang on the back of the car Meanwhile Debbie is doing situps while talking to Jason who holds her feet down with Barb stretching on a yoga ball in the background and Jason demonstrating exercises Pete and Barry eat frosted scones enjoying some alone time to delay returning home The family is driving with Sadie watching an episode of Lost on an iPad and during a violent scene Charlotte grabs for Sadie’s iPad and starts trying to lick her Pete and Debbie get out of the car and walk down the street into a store where they see their two employees Jodi and a new gorgeous employee named Desi who is up on a ladder Debbie goes behind the register looks at Jodi while Pete is still staring at Desi before he walks over to Debbie Desi then comes down to help a customer at the front of the store We see quick cuts of Debbie playing with the kids on the trampoline outside doing a full flip and landing on her feet with Pete nowhere to be found Finally Debbie walks down the hall and into the bathroom without knocking Debbie gets out of the shower followed by Pete who sneaks down the hallway and kisses Sadie 13 to wake her but she wants to be left alone as Pete breathes all over her while talking Pete lifts a sleeping Charlotte 8 out of bed walks her downstairs in a ridiculous manner due to her being too tall to be held like a baby and they set up a tray of muffins and donuts on the table decorating the room with birthday balloons and streamers with Pete occasionally sneaking bacon cupcakes and mini donuts into his mouth The house appears more cluttered and messier than previously depicted in Knocked Up Debbie opens a window and sneaks a cigarette while Sadie watches Lost on her iPad and Pete and Debbie talk in the kitchen Pete clears the breakfast dishes turns on the faucet and pours water on a cupcake Meanwhile Charlotte plays the theme from The Office on her keyboard and Sadie tears apart her closet looking for clothes Debbie is in workout gear when Pete enters wearing a lycra outfit with multiple logos As Debbie leaves Pete picks the soaking wet cupcake out of the sink and takes a bite Debbie then runs up a long flight of stairs with her trainer Jason while her friend Barb trails behind"
        }
      ]
    }
  ]
}