{
  "ground_truth": "Pete is on the toilet playing Scrabble on his iPad when she angrily grabs his iPad and walks out. Pete stands on stage speaking to a small crowd, and the crowd applauds as Graham Parker, in his 60s, leaps on stage. Pete and Debbie watch Graham sing a very moving song, but although the music is great, it's a little depressing and not working on Debbie, so she quickly gets bored. Later, Pete and Debbie are driving home when an ambulance drives by with sirens blaring. They walk in mid-argument to find Sadie listening to a song on her iPhone, and everyone laughs and dances. Pete turns the iPod off, starts dancing around like it is fun, then stops his music. The next morning, Pete sits with the kids to eat breakfast while Debbie scurries around to prep them for school. Charlotte runs away towards her room, and Sadie screams, prompting Debbie to cover Sadie's mouth. Another parent, Beth, and her adorable child walk over, and then Beth and Katie walk off. As they walk into class, the teacher pulls Debbie aside but walks away before Debbie can defend herself. As Debbie pulls out of the lot, she lights a cigarette. Meanwhile, Pete paces around his office on the phone and is with Ronnie and Cat, employees at his record label, watching an electronic press kit for Graham Parker, featuring a montage of his performances from the seventies to the present. There is a scene with Graham and a journalist wearing a yarmulke, and another with Pete, Cat, and Ronnie, before Graham walks up. Pete and Debbie talk while Debbie holds a list of changes she wants to make, and Pete picks up a guitar and starts playing with it. Later in bed, Debbie has a computer on her lap, watching security cam footage of the store, revealing Desi's boyfriend entering, sitting behind the counter, with her on his lap as they kiss. Desi seems to be popping up and down a little. Meanwhile, Pete farts several times, each longer, until Debbie hits him with a pillow and he farts again. Charlotte jumps around in front of Sadie's door as Sadie sits on her bed doing homework. Charlotte grabs her head as if being dragged away and plays air guitar. Pete tosses a packet of M&M's in the garbage, throws out all of his cupcakes except for one, and takes a bite, trying to throw it away but eventually takes another bite, holding it over the garbage before finishing what little remains. Finally, Pete runs on a treadmill while getting an electrocardiogram.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Pete is on the lavatory engaging in Scrabble on his tablet when she furiously snatches his tablet and strides out. Pete stands on platform addressing a small gathering, and the gathering cheers as Graham Parker, in his 60s, springs on platform. Pete and Debbie observe Graham perform a very stirring tune, but although the melody is excellent, it's slightly gloomy and not affecting Debbie, so she swiftly becomes weary. Later, Pete and Debbie are driving home when an ambulance speeds by with sirens screeching. They enter mid-dispute to find Sadie listening to a track on her smartphone, and everyone chuckles and dances. Pete switches the device off, begins dancing around like it is amusing, then stops his song. The following dawn, Pete sits with the children to consume breakfast while Debbie scuttles around to ready them for school. Charlotte flees towards her chamber, and Sadie shrieks, prompting Debbie to cover Sadie's mouth. Another guardian, Beth, and her charming offspring stroll over, and then Beth and Katie depart. As they walk into class, the educator draws Debbie aside but departs before Debbie can vindicate herself. As Debbie pulls out of the parking, she ignites a cigarette. Meanwhile, Pete strides around his workplace on the phone and is with Ronnie and Cat, workers at his record label, watching a digital press kit for Graham Parker, featuring a montage of his shows from the seventies to the present. There is a scene with Graham and a reporter wearing a yarmulke, and another with Pete, Cat, and Ronnie, before Graham approaches. Pete and Debbie converse while Debbie clutch a list of modifications she desires to make, and Pete picks up a guitar and starts toying with it. Later in bed, Debbie has a laptop on her lap, viewing security cam footage of the outlet, revealing Desi's boyfriend entering, seating behind the counter, with her on his lap as they smooch. Desi appears to be bouncing up and down a bit. Meanwhile, Pete flatulates several times, each longer, until Debbie strikes him with a cushion and he flatulates again. Charlotte bounces around in front of Sadie's door as Sadie sits on her bed doing homework. Charlotte grabs her head as if being hauled away and mimics playing guitar. Pete flings a packet of M&M's in the bin, discards all of his pastries except for one, and takes a nibble, trying to dispose of it but eventually takes another nibble, holding it over the bin before finishing what little persists. Finally, Pete jogs on a treadmill while receiving an electrocardiogram."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Pete is on the toilet playing Scrabble on his iPad when his iPad is grabbed angrily by her and she walks out. The stage is stood on by Pete, who speaks to a small crowd, and Graham Parker, in his 60s, is applauded by the crowd as he leaps on stage. Graham sings a very moving song, which is watched by Pete and Debbie, but although the music is great, it is found by Debbie to be a little depressing and is not working on her, so boredom quickly sets in for her. Later, home is driven to by Pete and Debbie when an ambulance is driven by with sirens blaring. Mid-argument, their walk-in finds Sadie listening to a song on her iPhone, and laughter and dancing involve everyone. The iPod is turned off by Pete, and he starts dancing around like it is fun, then his music is stopped. The next morning, breakfast is sat with the kids by Pete while Debbie is scurrying around to prep them for school. Her room is run towards by Charlotte, and Sadie is prompted to scream, prompting Sadie's mouth to be covered by Debbie. Another parent, Beth, walks over with her adorable child, and then Beth walks off with Katie. As class is walked into, the teacher pulls Debbie aside but walks away before herself can be defended by Debbie. As the lot is pulled out of by Debbie, a cigarette is lit by her. Meanwhile, Pete is pacing around his office on the phone and watches an electronic press kit for Graham Parker, featuring a montage of his performances from the seventies to the present, with Ronnie and Cat, employees at his record label. There is a scene with Graham and a journalist wearing a yarmulke, and another with Pete, Cat, and Ronnie, before Graham walks up. Pete talks with Debbie while a list of changes is held by her that she wants to make, and a guitar is picked up by Pete and played with. Later in bed, Debbie watches security cam footage of the store on her laptop, revealing Desi's boyfriend entering, sitting behind the counter, with her on his lap as they kiss. Desi seems to pop up and down a little. Meanwhile, several farts are let out by Pete, each longer, until a pillow is hit on him by Debbie and he farts again. Sadie's door is jumped around in front of by Charlotte as Sadie sits on her bed doing homework. Charlotte plays air guitar and acts as if her head is being grabbed. A packet of M&M's is tossed in the garbage by Pete, who throws out all of his cupcakes except for one, and a bite is taken, attempting to throw it away but eventually another bite is taken, holding it over the garbage before what little remains is finished. Finally, a treadmill is run on by Pete while an electrocardiogram is given to him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Pete is on the toilet playing Scrabble on his iPad when she angrily takes it and leaves. On stage, Pete speaks to a small crowd, applauding as Graham Parker, in his 60s, joins him. Pete and Debbie watch Graham sing a moving song, but Debbie finds it depressing and gets bored. Later, driving home, an ambulance passes with sirens blaring. They walk in mid-argument to find Sadie listening to music on her iPhone, and everyone laughs and dances. Pete turns off the iPod, dances, then stops the music. The next morning, Pete eats breakfast with the kids while Debbie preps them for school. Charlotte runs to her room, and Sadie screams, prompting Debbie to cover her mouth. Beth and her child visit, then leave. As they enter class, the teacher pulls Debbie aside but leaves before she can respond. Debbie lights a cigarette as she drives away. Meanwhile, Pete paces his office on the phone with Ronnie and Cat, watching a press kit for Graham Parker, featuring a montage of his performances. Scenes include Graham with a journalist and Pete with Cat and Ronnie before Graham arrives. Pete and Debbie discuss changes while Pete plays guitar. Later, in bed, Debbie watches security footage of Desi's boyfriend entering the store, sitting with her as they kiss. Meanwhile, Pete farts repeatedly until Debbie hits him with a pillow. Charlotte jumps in front of Sadie's door as Sadie does homework. Charlotte pretends to be dragged away and plays air guitar. Pete throws away M&M's and cupcakes, but after trying to discard one, he finishes it. Finally, Pete runs on a treadmill during an electrocardiogram."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Pete plays Scrabble on his iPad in the bathroom when she angrily takes it and leaves. On stage, Pete speaks to a small crowd, applauded as Graham Parker, in his 60s, joins him. Pete and Debbie watch Graham sing a moving but depressing song, boring Debbie. Driving home, an ambulance passes with sirens blaring. They find Sadie listening to music, and everyone laughs and dances. Pete turns off the iPod, dances, then stops. The next morning, Pete eats breakfast with the kids while Debbie preps them for school. Charlotte runs off, Sadie screams, and Debbie covers her mouth. Beth and her child visit, then leave. The teacher pulls Debbie aside but leaves before she can respond. Debbie lights a cigarette while leaving. Pete paces his office, watching a Graham Parker press kit with employees Ronnie and Cat. Scenes show Graham with a journalist and Pete with his team. Pete and Debbie discuss changes while he plays guitar. In bed, Debbie watches security footage of Desi's boyfriend at the store. Pete farts repeatedly until Debbie hits him with a pillow. Charlotte jumps in front of Sadie's door, playing air guitar. Pete throws out M&M's and cupcakes, eats one, then runs on a treadmill during an electrocardiogram."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Pete finds himself in the bathroom, comfortably seated on the toilet, deeply engrossed in a game of Scrabble on his iPad. Suddenly, she bursts in, clearly upset, and snatches the iPad from his hands before storming out of the room. Later, Pete is standing on a stage, addressing a small gathering of people. The audience responds with applause as Graham Parker, a man in his 60s, energetically leaps onto the stage. Pete and Debbie are in the audience, watching Graham perform a song that is both deeply moving and emotionally charged. Despite the music's undeniable quality, its somber tone fails to resonate with Debbie, and she quickly loses interest. \n\nAs the evening progresses, Pete and Debbie find themselves driving home. Their journey is interrupted by the loud, urgent wail of an ambulance siren as it speeds past them. Upon arriving home, they enter mid-argument, only to discover Sadie absorbed in a song playing on her iPhone. The atmosphere lightens as everyone bursts into laughter and begins to dance. Pete, caught up in the moment, turns off the iPod and starts dancing around playfully, only to abruptly stop the music.\n\nThe following morning, Pete is seated with the kids, sharing breakfast, while Debbie busily scurries around, preparing them for school. In the midst of the morning chaos, Charlotte dashes off towards her room, and Sadie lets out a piercing scream, prompting Debbie to gently cover Sadie's mouth to quiet her. Meanwhile, another parent, Beth, accompanied by her adorable child, approaches them. After a brief exchange, Beth and Katie walk away. As they enter the classroom, the teacher pulls Debbie aside for a private word but walks away before Debbie has a chance to defend herself. Frustrated, Debbie lights a cigarette as she pulls out of the parking lot.\n\nMeanwhile, Pete is pacing around his office, engaged in a phone conversation. He is accompanied by Ronnie and Cat, employees at his record label, as they watch an electronic press kit for Graham Parker. The kit features a montage of Graham's performances spanning from the seventies to the present day. There is a scene with Graham and a journalist wearing a yarmulke, followed by another scene with Pete, Cat, and Ronnie, before Graham makes his entrance.\n\nLater, Pete and Debbie are engaged in conversation, with Debbie holding a list of changes she wants to implement. Pete, meanwhile, picks up a guitar and begins to play with it absentmindedly. That night, as they lie in bed, Debbie has a computer on her lap, watching security camera footage from the store. The footage reveals Desi's boyfriend entering the store, sitting behind the counter with Desi on his lap as they share a kiss. Desi appears to be bouncing up and down slightly. Meanwhile, Pete, lying beside her, farts several times, each one longer than the last, until Debbie playfully hits him with a pillow, prompting him to fart once more.\n\nIn another part of the house, Charlotte is energetically jumping around in front of Sadie's door while Sadie sits on her bed, focused on her homework. Charlotte grabs her head dramatically, as if being dragged away, and begins to play air guitar. In the kitchen, Pete tosses a packet of M&M's into the garbage, then throws out all of his cupcakes except for one. He takes a bite of the remaining cupcake, hesitates, and tries to throw it away, but eventually succumbs to temptation and takes another bite, holding it over the garbage before finishing what little remains. Finally, Pete is seen running on a treadmill while undergoing an electrocardiogram, a testament to his ongoing efforts to maintain his health."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Pete finds himself in the bathroom, comfortably seated on the toilet, and deeply absorbed in a game of Scrabble on his iPad. Suddenly and unexpectedly, she bursts into the room, visibly upset and without hesitation, snatches the iPad from his hands, before quickly storming out in frustration. Later on, Pete is standing on a stage, addressing a modest gathering of people. The audience responds with enthusiastic applause as Graham Parker, a lively man in his 60s, energetically leaps onto the stage. Pete and Debbie are part of the audience, attentively watching Graham as he performs a song that is both deeply moving and emotionally charged. Despite the undeniable quality of the music, its somber tone fails to resonate with Debbie, and she quickly loses interest, her attention drifting elsewhere.\n\nAs the evening continues, Pete and Debbie find themselves driving home in the car. Their journey is abruptly interrupted by the loud, urgent wail of an ambulance siren as it speeds past them with urgency. Upon arriving home, they enter mid-argument, only to discover Sadie deeply absorbed in a song playing on her iPhone. The atmosphere lightens considerably as everyone suddenly bursts into laughter and begins to dance around joyfully. Pete, caught up in the contagious moment, turns off the iPod and begins dancing around playfully, only to unexpectedly stop the music with a sudden halt.\n\nThe following morning, Pete is seated at the breakfast table with the kids, sharing a meal, while Debbie busily scurries around the house, preparing them for school. In the midst of the bustling morning chaos, Charlotte dashes off quickly towards her room, and Sadie lets out a piercing, high-pitched scream, prompting Debbie to gently cover Sadie's mouth in an attempt to quiet her down. Meanwhile, another parent, Beth, accompanied by her adorable child, approaches them for a brief interaction. After a short exchange, Beth and Katie walk away. As they enter the classroom, the teacher pulls Debbie aside for a private word of counsel but walks away before Debbie has a chance to defend herself against whatever was said. Frustrated and irritated, Debbie lights a cigarette as she pulls out of the parking lot.\n\nMeanwhile, Pete is pacing around his office, engaged in a lively phone conversation. He is accompanied by Ronnie and Cat, employees at his record label, as they watch an electronic press kit for Graham Parker unfold before them. The kit features a montage of Graham's memorable performances spanning from the seventies to the present day. There is a scene with Graham and a journalist wearing a yarmulke, followed by another scene with Pete, Cat, and Ronnie, before Graham makes his entrance.\n\nLater, Pete and Debbie are engaged in a conversation, with Debbie holding a list of changes she wants to implement. Pete, meanwhile, picks up a guitar and begins to play with it absentmindedly, strumming the strings with little focus. That night, as they lie in bed, Debbie has a computer resting on her lap, watching security camera footage from the store. The footage reveals Desi's boyfriend entering the store, sitting behind the counter with Desi on his lap as they share a kiss. Desi appears to be bouncing up and down slightly in the footage. Meanwhile, Pete, lying beside her, farts several times, each one longer and more pronounced than the last, until Debbie playfully hits him with a pillow, prompting him to fart once more, much to their amusement.\n\nIn another part of the house, Charlotte is energetically jumping around in front of Sadie's door while Sadie sits on her bed, focused intently on her homework. Charlotte grabs her head dramatically, as if being dragged away by some unseen force, and begins to play air guitar with enthusiasm. In the kitchen, Pete tosses a packet of M&M's into the garbage, then throws out all of his cupcakes except for one. He takes a thoughtful bite of the remaining cupcake, hesitates as if caught in a moral quandary, and tries to throw it away, but eventually, he succumbs to temptation and takes another bite, holding it over the garbage before finishing what little remains. Finally, Pete is seen running on a treadmill while undergoing an electrocardiogram, a testament to his ongoing, determined efforts to maintain his health and well-being."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Pete is sitting on the toilet, fully engrossed in a game of Scrabble on his iPad, when suddenly she bursts in, her face a mask of anger, and snatches the iPad from his hands before storming out of the room. Later, Pete finds himself standing on a stage, addressing a small crowd with a sense of purpose, and as he finishes speaking, the audience erupts into applause. In the midst of this, Graham Parker, a man in his 60s, energetically leaps onto the stage, capturing everyone's attention. Pete and Debbie stand together, watching Graham perform a deeply moving song. Despite the music's emotional depth, Debbie finds it somewhat depressing and soon loses interest, her attention drifting elsewhere. As the evening progresses, Pete and Debbie are driving home, the car filled with the hum of the road, when suddenly an ambulance speeds past them, its sirens blaring loudly, momentarily breaking the monotony of their journey. Upon arriving home, they walk in mid-argument, their voices raised, only to find Sadie absorbed in a song playing on her iPhone. The tension dissipates as laughter fills the room, and everyone begins to dance joyfully. Pete, caught up in the moment, turns off the iPod, starts dancing around with exaggerated, playful movements, and then abruptly stops the music, bringing the impromptu dance party to an end. The next morning, Pete sits down with the kids to share breakfast, while Debbie moves around the kitchen with purpose, preparing them for school. Suddenly, Charlotte bolts towards her room, and Sadie lets out a piercing scream, prompting Debbie to quickly cover Sadie's mouth in an attempt to quiet her. Just then, another parent, Beth, approaches with her adorable child in tow, and after a brief exchange, Beth and Katie walk off together. As they enter the classroom, the teacher pulls Debbie aside, but before Debbie can offer any defense, the teacher walks away, leaving her standing there. Frustrated, Debbie gets into her car, lights a cigarette, and drives off. Meanwhile, Pete is pacing around his office, phone in hand, engaged in a conversation, while Ronnie and Cat, his employees at the record label, sit nearby watching an electronic press kit for Graham Parker. The kit features a montage of Graham's performances spanning from the seventies to the present, including a scene with Graham and a journalist wearing a yarmulke, and another with Pete, Cat, and Ronnie, before Graham himself walks up. Later, Pete and Debbie are deep in conversation, with Debbie holding a list of changes she wants to implement, while Pete picks up a guitar and idly strums it. That night, as they lie in bed, Debbie has a computer on her lap, intently watching security camera footage of the store. The footage reveals Desi's boyfriend entering, sitting behind the counter with Desi on his lap as they kiss, Desi appearing to pop up and down slightly. Meanwhile, Pete, lying beside her, farts several times, each one longer than the last, until Debbie, exasperated, hits him with a pillow, only for him to fart again. In another part of the house, Charlotte is energetically jumping around in front of Sadie's door, while Sadie sits on her bed, focused on her homework. Charlotte, caught up in her own world, grabs her head as if being dragged away and begins to play air guitar with enthusiasm. In the kitchen, Pete tosses a packet of M&M's into the garbage, then proceeds to throw out all of his cupcakes except for one. He takes a bite of the remaining cupcake, hesitates, and tries to throw it away, but ultimately takes another bite, holding it over the garbage before finally finishing what little remains. Finally, Pete is seen running on a treadmill, his feet pounding rhythmically, while undergoing an electrocardiogram, the machine's wires attached to his body, monitoring his heart's activity."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Pete is on the toilet playing Scrabble on his iPad when she angrily takes it and leaves. Later, Pete speaks to a small crowd on stage, receiving applause as Graham Parker, in his 60s, joins him. Pete and Debbie watch Graham perform a moving song, but Debbie quickly loses interest. On their drive home, an ambulance passes with sirens blaring. They arrive mid-argument to find Sadie listening to music on her iPhone, leading to laughter and dancing. Pete turns off the iPod, dances playfully, then stops the music. The next morning, Pete has breakfast with the kids while Debbie prepares them for school. Charlotte runs off, and Sadie screams, prompting Debbie to cover her mouth. Beth and her child approach, then leave with Katie. As they enter class, the teacher pulls Debbie aside but leaves before she can respond. Debbie lights a cigarette as she drives away. Meanwhile, Pete paces his office on the phone with employees Ronnie and Cat, watching an electronic press kit for Graham Parker, featuring a montage of his performances. Scenes include Graham with a journalist and Pete with his employees before Graham arrives. Pete and Debbie discuss changes she wants to make while Pete plays with a guitar. Later in bed, Debbie watches security footage of Desi's boyfriend at the store, kissing Desi. Meanwhile, Pete farts repeatedly until Debbie hits him with a pillow, and he farts again. Charlotte jumps around in front of Sadie's door as Sadie does homework. Charlotte pretends to be dragged away and plays air guitar. Pete throws away a packet of M&M's and most of his cupcakes, hesitating before finishing the last one. Finally, Pete runs on a treadmill while undergoing an electrocardiogram."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Pete is on the toilet playing Scrabble on his iPad, a popular digital adaptation of the classic word game originally invented in the 1930s, when she angrily grabs his iPad and walks out. Pete stands on stage speaking to a small crowd, gathered at a local community center for live performances, and the crowd applauds as Graham Parker, a British rock musician known for his work with the band the Rumour in the late '70s, leaps on stage. Pete and Debbie watch Graham sing a very moving song that reflects his signature style of blending rock and soul, but although the music is great, it's a little depressing and not working on Debbie, so she quickly gets bored. Later, Pete and Debbie are driving home through the bustling city streets when an ambulance drives by with sirens blaring, signaling an emergency situation nearby. They walk in mid-argument to find Sadie listening to a song on her iPhone, a device that revolutionized personal music consumption when it was released by Apple in 2007, and everyone laughs and dances. Pete turns the iPod off, a predecessor to iPhones in Apple's lineup of music devices, starts dancing around like it is fun, then stops his music. The next morning, Pete sits with the kids to eat breakfast, a chaotic mix of cereal and toast, while Debbie scurries around their suburban kitchen to prep them for school. Charlotte runs away towards her room, and Sadie screams, prompting Debbie to cover Sadie's mouth in an attempt to maintain the morning peace. Another parent, Beth, a neighbor who often car-pools with them, and her adorable child walk over, and then Beth and Katie, her daughter, walk off. As they walk into class, housed in a typical American elementary school building, the teacher pulls Debbie aside but walks away before Debbie can defend herself against a new school policy. As Debbie pulls out of the lot in her SUV, she lights a cigarette, a habit she's been trying to quit. Meanwhile, Pete paces around his office on the phone, housed in a small but cozy space filled with music memorabilia, and is with Ronnie and Cat, employees at his record label, watching an electronic press kit for Graham Parker, featuring a montage of his performances from the seventies to the present, capturing the evolution of his musical style. There is a scene with Graham and a journalist wearing a yarmulke, indicating his Jewish heritage, and another with Pete, Cat, and Ronnie, before Graham walks up. Pete and Debbie talk while Debbie holds a list of changes she wants to make, reflecting her meticulous nature, and Pete picks up a guitar, a vintage Fender model, and starts playing with it. Later in bed, Debbie has a computer on her lap, watching security cam footage of the store, revealing Desi's boyfriend entering, sitting behind the counter, with her on his lap as they kiss, an action against store policy. Desi seems to be popping up and down a little, suggesting inappropriate behaviour at work. Meanwhile, Pete farts several times, each longer, until Debbie hits him with a pillow and he farts again, a source of humor for them despite Debbie's exasperation. Charlotte jumps around in front of Sadie’s door as Sadie sits on her bed doing homework, the usual evening struggle. Charlotte grabs her head as if being dragged away and plays air guitar, mimicking her favorite rock stars. Pete tosses a packet of M&M’s, known for their colorful candy shells, in the garbage, throws out all of his cupcakes except for one, a sign of his ongoing struggle with dieting, and takes a bite, trying to throw it away but eventually takes another bite, holding it over the garbage before finishing what little remains. Finally, Pete runs on a treadmill, a part of his new fitness routine, while getting an electrocardiogram, a test that monitors heart health."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Pete is on the toilet playing Scrabble on his iPad when she angrily grabs his iPad and walks out. Pete stands on stage speaking to a small crowd and the crowd applauds as Graham Parker in his 60s leaps on stage. Pete and Debbie watch Graham sing a very moving song but although the music is great it is a little depressing and not working on Debbie so she quickly gets bored. Later Pete and Debbie are driving home when an ambulance drives by with sirens blaring. They walk in midargument to find Sadie listening to a song on her iPhone and everyone laughs and dances. Pete turns the iPod off starts dancing around like it is fun then stops his music. The next morning Pete sits with the kids to eat breakfast while Debbie scurries around to prep them for school. Charlotte runs away towards her room and Sadie screams prompting Debbie to cover Sadie's mouth. Another parent Beth and her adorable child walk over and then Beth and Katie walk off. As they walk into class the teacher pulls Debbie aside but walks away before Debbie can defend herself. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. As Debbie pulls out of the lot she lights a cigarette. Meanwhile Pete paces around his office on the phone and is with Ronnie and Cat employees at his record label watching an electronic press kit for Graham Parker featuring a montage of his performances from the seventies to the present. There is a scene with Graham and a journalist wearing a yarmulke and another with Pete Cat and Ronnie before Graham walks up. Pete and Debbie talk while Debbie holds a list of changes she wants to make and Pete picks up a guitar and starts playing with it. Later in bed Debbie has a computer on her lap watching security cam footage of the store revealing Desi's boyfriend entering sitting behind the counter with her on his lap as they kiss. Desi seems to be popping up and down a little. Meanwhile Pete farts several times each longer until Debbie hits him with a pillow and he farts again. Charlotte jumps around in front of Sadie's door as Sadie sits on her bed doing homework. Charlotte grabs her head as if being dragged away and plays air guitar. Pete tosses a packet of MM's in the garbage throws out all of his cupcakes except for one and takes a bite trying to throw it away but eventually takes another bite holding it over the garbage before finishing what little remains. Finally Pete runs on a treadmill while getting an electrocardiogram."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Pete is on the toilet playing Scrabble on his iPad when she angrily grabs his iPad and walks out. Pete stands on stage speaking to a small crowd and the crowd applauds as Graham Parker in his 60s leaps on stage. Pete and Debbie watch Graham sing a very moving song but although the music is great it is a little depressing and not working on Debbie so she quickly gets bored. Later Pete and Debbie are driving home when an ambulance drives by with sirens blaring. They walk in midargument to find Sadie listening to a song on her iPhone and everyone laughs and dances. Pete turns the iPod off starts dancing around like it is fun then stops his music. The next morning Pete sits with the kids to eat breakfast while Debbie scurries around to prep them for school. Charlotte runs away towards her room and Sadie screams prompting Debbie to cover Sadie's mouth. Another parent Beth and her adorable child walk over and then Beth and Katie walk off. As they walk into class the teacher pulls Debbie aside but walks away before Debbie can defend herself. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. As Debbie pulls out of the lot she lights a cigarette. Meanwhile Pete paces around his office on the phone and is with Ronnie and Cat employees at his record label watching an electronic press kit for Graham Parker featuring a montage of his performances from the seventies to the present. There is a scene with Graham and a journalist wearing a yarmulke and another with Pete Cat and Ronnie before Graham walks up. Pete and Debbie talk while Debbie holds a list of changes she wants to make and Pete picks up a guitar and starts playing with it. Later in bed Debbie has a computer on her lap watching security cam footage of the store revealing Desi's boyfriend entering sitting behind the counter with her on his lap as they kiss. Desi seems to be popping up and down a little. Meanwhile Pete farts several times each longer until Debbie hits him with a pillow and he farts again. Charlotte jumps around in front of Sadie's door as Sadie sits on her bed doing homework. Charlotte grabs her head as if being dragged away and plays air guitar. Pete tosses a packet of MM's in the garbage throws out all of his cupcakes except for one and takes a bite trying to throw it away but eventually takes another bite holding it over the garbage before finishing what little remains. Finally Pete runs on a treadmill while getting an electrocardiogram."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Pete is on the toilet playing Scrabble on his iPad when she angrily grabs his iPad and walks out. Pete stands on stage speaking to a small crowd and the crowd applauds as Graham Parker in his 60s leaps on stage. Pete and Debbie watch Graham sing a very moving song but although the music is great it is a little depressing and not working on Debbie so she quickly gets bored. Later Pete and Debbie are driving home when an ambulance drives by with sirens blaring. They walk in midargument to find Sadie listening to a song on her iPhone and everyone laughs and dances. Desi seems to be popping up and down a little. Meanwhile Pete farts several times each longer until Debbie hits him with a pillow and he farts again. Charlotte jumps around in front of Sadie's door as Sadie sits on her bed doing homework. Charlotte grabs her head as if being dragged away and plays air guitar. Pete tosses a packet of MM's in the garbage throws out all of his cupcakes except for one and takes a bite trying to throw it away but eventually takes another bite holding it over the garbage before finishing what little remains. Finally Pete runs on a treadmill while getting an electrocardiogram."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Pete is on the toilet playing Scrabble on his iPad when she angrily grabs his iPad and walks out. Pete stands on stage speaking to a small crowd and the crowd applauds as Graham Parker in his 60s leaps on stage. Charlotte grabs her head as if being dragged away and plays air guitar. Pete tosses a packet of MM's in the garbage throws out all of his cupcakes except for one and takes a bite trying to throw it away but eventually takes another bite holding it over the garbage before finishing what little remains. Finally Pete runs on a treadmill while getting an electrocardiogram."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Rick lounges on the couch juggling apples when the penguin abruptly smashes the apples and skips away. Rick marches on ice chatting to a tiny penguin colony, and the colony honks as Marvin, past his prime, cartwheels onto the ice. Rick and Marge observe Marvin whisper a rather touching poem, but although the rhymes are decent, they’re a tad somber and not engaging Marge, so she swiftly loses interest. Later, Rick and Marge are surfing home when a fire truck zooms by with lights flashing. They sprint in mid-discussion to find Molly humming a tune on her walkman, and everyone snickers and spins. Rick powers the stereo down, begins twirling about like it’s a blast, then halts his tune. The next dawn, Rick lounges with the kittens to sip tea while Marge flits around to prep them for camp. Brenda dashes away towards her den, and Molly bellows, prompting Marge to warp Molly’s voice. Another giraffe, Nancy, and her comical cub prance over, and then Nancy and Lucy prance off. As they hop into the meadow, the ranger pulls Marge aside but leaps away before Marge can justify herself. As Marge zooms out of the pasture, she ignites a flare. Meanwhile, Rick glides around his cave on the walkie-talkie and is with Buster and Mouse, helpers at his treasure ship, observing a digital map for Marvin, showcasing a collage of his treasures from the ancient past to now. There’s a scene with Marvin and a monk wearing a crown, and another with Rick, Mouse, and Buster, before Marvin strolls up. Rick and Marge chat while Marge holds a scroll of questions she wants to ask, and Rick picks up a flute and begins doodling with it. Later in the nest, Marge has a notepad on her knees, observing telescope cam snapshots of the bazaar, showing Daisy’s friend waltzing in, reclining behind the booth, with her on his knees as they peek. Daisy appears to be bopping up and down slightly. Meanwhile, Rick grumbles several notes, each deeper, until Marge nudges him with a feather and he grumbles once more. Brenda somersaults in front of Molly’s den as Molly lounges on her hammock scribbling math problems. Brenda taps her head as if being lifted away and strums an imaginary banjo. Rick hurls a pouch of raisins into the compost, ejects all of his pies except for one, and nibbles, attempting to discard it but eventually nibbles again, hovering it over the compost before finishing what scant remains. Finally, Rick gallops on an elliptical while acquiring a stethoscope reading."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Pete is playing Scrabble on his iPad in the bathroom when it's grabbed from him angrily. Later, Pete and Debbie attend a concert by Graham Parker, but Debbie finds the music depressing. While driving home, they encounter an ambulance and later find Sadie dancing to music, leading to laughter and dancing. The next morning, Pete has breakfast with the kids, while Debbie prepares them for school. Another parent, Beth, walks over before heading to class, where a teacher pulls Debbie aside briefly. Debbie smokes a cigarette afterward. Pete is at his record label, discussing Graham Parker’s press kit with employees. Debbie reviews store security footage, seeing Desi and her boyfriend kissing behind the counter. Pete farts repeatedly, causing Debbie to hit him with a pillow. Charlotte plays air guitar outside Sadie’s room. Pete struggles with dieting, eventually eating a cupcake. Finally, Pete is seen running on a treadmill while undergoing an electrocardiogram."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Finally Pete runs on a treadmill while getting an electrocardiogram Pete tosses a packet of MM's in the garbage throws out all of his cupcakes except for one and takes a bite trying to throw it away but eventually takes another bite holding it over the garbage before finishing what little remains  Charlotte grabs her head as if being dragged away and plays air guitar  Charlotte jumps around in front of Sadie's door as Sadie sits on her bed doing homework  Meanwhile Pete farts several times each longer until Debbie hits him with a pillow and he farts again  Desi seems to be popping up and down a little  Later in bed Debbie has a computer on her lap watching security cam footage of the store revealing Desi's boyfriend entering sitting behind the counter with her on his lap as they kiss  Pete and Debbie talk while Debbie holds a list of changes she wants to make and Pete picks up a guitar and starts playing with it  There is a scene with Graham and a journalist wearing a yarmulke and another with Pete Cat and Ronnie before Graham walks up  Meanwhile Pete paces around his office on the phone and is with Ronnie and Cat employees at his record label watching an electronic press kit for Graham Parker featuring a montage of his performances from the seventies to the present  As Debbie pulls out of the lot she lights a cigarette  As they walk into class the teacher pulls Debbie aside but walks away before Debbie can defend herself  Another parent Beth and her adorable child walk over and then Beth and Katie walk off  Charlotte runs away towards her room and Sadie screams prompting Debbie to cover Sadie's mouth  The next morning Pete sits with the kids to eat breakfast while Debbie scurries around to prep them for school  Pete turns the iPod off starts dancing around like it is fun then stops his music  They walk in midargument to find Sadie listening to a song on her iPhone and everyone laughs and dances  Later Pete and Debbie are driving home when an ambulance drives by with sirens blaring  Pete and Debbie watch Graham sing a very moving song but although the music is great it's a little depressing and not working on Debbie so she quickly gets bored  Pete stands on stage speaking to a small crowd and the crowd applauds as Graham Parker in his 60s leaps on stage  Pete is on the toilet playing Scrabble on his iPad when she angrily grabs his iPad and walks out "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Pete stands on stage speaking to a small crowd and the crowd applauds as Graham Parker in his 60s leaps on stage Pete is on the toilet playing Scrabble on his iPad when she angrily grabs his iPad and walks out Later Pete and Debbie are driving home when an ambulance drives by with sirens blaring Pete and Debbie watch Graham sing a very moving song but although the music is great it is a little depressing and not working on Debbie so she quickly gets bored Pete turns the iPod off starts dancing around like it is fun then stops his music They walk in midargument to find Sadie listening to a song on her iPhone and everyone laughs and dances Charlotte runs away towards her room and Sadie screams prompting Debbie to cover Sadie's mouth The next morning Pete sits with the kids to eat breakfast while Debbie scurries around to prep them for school As they walk into class the teacher pulls Debbie aside but walks away before Debbie can defend herself Another parent Beth and her adorable child walk over and then Beth and Katie walk off Meanwhile Pete paces around his office on the phone and is with Ronnie and Cat employees at his record label watching an electronic press kit for Graham Parker featuring a montage of his performances from the seventies to the present As Debbie pulls out of the lot she lights a cigarette Pete and Debbie talk while Debbie holds a list of changes she wants to make and Pete picks up a guitar and starts playing with it There is a scene with Graham and a journalist wearing a yarmulke and another with Pete Cat and Ronnie before Graham walks up Desi seems to be popping up and down a little Later in bed Debbie has a computer on her lap watching security cam footage of the store revealing Desi's boyfriend entering sitting behind the counter with her on his lap as they kiss Charlotte jumps around in front of Sadie's door as Sadie sits on her bed doing homework Meanwhile Pete farts several times each longer until Debbie hits him with a pillow and he farts again Pete tosses a packet of MM's in the garbage throws out all of his cupcakes except for one and takes a bite trying to throw it away but eventually takes another bite holding it over the garbage before finishing what little remains Charlotte grabs her head as if being dragged away and plays air guitar Finally Pete runs on a treadmill while getting an electrocardiogram"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Meanwhile Pete paces around his office on the phone and is with Ronnie and Cat employees at his record label watching an electronic press kit for Graham Parker featuring a montage of his performances from the seventies to the present  There is a scene with Graham and a journalist wearing a yarmulke and another with Pete Cat and Ronnie before Graham walks up  Pete and Debbie talk while Debbie holds a list of changes she wants to make and Pete picks up a guitar and starts playing with it  Later in bed Debbie has a computer on her lap watching security cam footage of the store revealing Desi's boyfriend entering sitting behind the counter with her on his lap as they kiss  Desi seems to be popping up and down a little  Meanwhile Pete farts several times each longer until Debbie hits him with a pillow and he farts again  Charlotte jumps around in front of Sadie's door as Sadie sits on her bed doing homework  Charlotte grabs her head as if being dragged away and plays air guitar  Pete tosses a packet of MM's in the garbage throws out all of his cupcakes except for one and takes a bite trying to throw it away but eventually takes another bite holding it over the garbage before finishing what little remains  Finally Pete runs on a treadmill while getting an electrocardiogram Pete is on the toilet playing Scrabble on his iPad when she angrily grabs his iPad and walks out  Pete stands on stage speaking to a small crowd and the crowd applauds as Graham Parker in his 60s leaps on stage  Pete and Debbie watch Graham sing a very moving song but although the music is great it's a little depressing and not working on Debbie so she quickly gets bored  Later Pete and Debbie are driving home when an ambulance drives by with sirens blaring  They walk in midargument to find Sadie listening to a song on her iPhone and everyone laughs and dances  Pete turns the iPod off starts dancing around like it is fun then stops his music  The next morning Pete sits with the kids to eat breakfast while Debbie scurries around to prep them for school  Charlotte runs away towards her room and Sadie screams prompting Debbie to cover Sadie's mouth  Another parent Beth and her adorable child walk over and then Beth and Katie walk off  As they walk into class the teacher pulls Debbie aside but walks away before Debbie can defend herself  As Debbie pulls out of the lot she lights a cigarette "
        }
      ]
    }
  ]
}