{
  "ground_truth": "Debbie is getting a mammogram, and the machine clamps too hard on her breast, causing her to scream. Meanwhile, Pete gets his testicles examined. Debbie then undergoes a colonoscopy and later endures some very painful oral surgery, feeling a little high from the laughing gas. Dr. Bowe performs a prostate exam on Pete. Debbie visits the gynecologist, revealed to be Dr. Pelligino from the beginning of \"Knocked Up,\" and her legs are up in stirrups as two nurses enter the exam room. Debbie enters the bedroom, Sadie runs down the hallway, and Charlotte tries to open the door, which is locked, while Debbie gives Pete a blow job out of frame, making Pete super happy sitting on a chair. Charlotte shoves Sadie, leading to an escalating physical fight and muffled screams from the girls outside. Pete walks to the front door, greeted by his father Larry, revealing his small house is too close to the airport due to a low flying 747. Pete and Larry sit down to talk, and two other identical children enter and jump on Larry before the three exit. Larry stands and walks outside, followed by Pete, and prepares to spray the kids with a hose, eventually spraying Pete instead, as Larry's wife, Claire, enters. Larry gets up and walks outside once again. A nervous Debbie approaches a hostess and sees Oliver sitting stiffly at a table. Oliver shows Debbie photos on his iPhone before exiting, leaving Debbie to sadly scroll through the happy pictures of his new family. The family relaxes at dinner, with Charlotte using an app on her iPhone that animates her mouth to look like a talking monkey's while Sadie stomps off. Pete and Debbie drive down the Pacific Coast Highway, arriving at a beautiful hotel in Laguna. Pete makes a wood chipping splatter noise and runs into the bathroom looking for a cookie, which they both eat. They sit in silence, staring through each other in a haze, as they are stoned. As they enjoy their time, Pete and Debbie jump up and down on the bed, fall on it, kissing, and almost totally under the covers, watch as a waiter brings in a room service cart full of food. Pete does magic tricks for the waiter, and Debbie hands Pete a banana and two oranges, which he holds to his crotch in front of the waiter, before Pete takes a bite of the banana.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Debbie is receiving a mammogram, and the apparatus compresses too forcefully on her chest, causing her to shriek. Meanwhile, Pete gets his testicles inspected. Debbie then undergoes a colonoscopy and later withstands some very agonizing oral surgery, feeling a little euphoric from the laughing gas. Dr. Bowe conducts a prostate evaluation on Pete. Debbie visits the gynecologist, disclosed to be Dr. Pelligino from the start of \"Knocked Up,\" and her legs are up in stirrups as two nurses enter the examination room. Debbie enters the bedroom, Sadie runs down the hallway, and Charlotte tries to open the entrance, which is locked, while Debbie provides Pete a blow job out of frame, making Pete extremely content sitting on a chair. Charlotte pushes Sadie, leading to an escalating physical altercation and muffled cries from the girls outside. Pete walks to the main door, greeted by his father Larry, revealing his small dwelling is too near to the airport due to a low flying 747. Pete and Larry sit down to converse, and two other identical kids enter and leap on Larry before the three exit. Larry stands and walks outside, followed by Pete, and prepares to spray the children with a hose, eventually spraying Pete instead, as Larry's spouse, Claire, enters. Larry gets up and walks outside once more. A nervous Debbie approaches a hostess and sees Oliver seated stiffly at a table. Oliver shows Debbie photographs on his iPhone before leaving, leaving Debbie to sadly scroll through the cheerful pictures of his new household. The family relaxes at dinner, with Charlotte using an app on her iPhone that animates her mouth to resemble a talking monkey's while Sadie stomps off. Pete and Debbie drive down the Pacific Coast Highway, arriving at a splendid hotel in Laguna. Pete makes a wood chipping splatter noise and rushes into the bathroom searching for a cookie, which they both consume. They sit in silence, gazing through each other in a fog, as they are stoned. As they enjoy their time, Pete and Debbie jump up and down on the bed, fall on it, kissing, and almost completely under the covers, watch as a server brings in a room service cart full of food. Pete does magic tricks for the waiter, and Debbie hands Pete a banana and two oranges, which he holds to his groin in front of the server, before Pete takes a bite of the banana."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Debbie is getting a mammogram, and her breast is clamped too hard by the machine, causing her to scream. Meanwhile, Pete has his testicles examined by a doctor. Debbie then is subjected to a colonoscopy and later endures some very painful oral surgery, feeling a little high from the laughing gas. Pete undergoes a prostate exam performed by Dr. Bowe. Debbie visits the gynecologist, who is revealed to be Dr. Pelligino from the beginning of \"Knocked Up,\" and as two nurses enter the exam room, her legs are up in stirrups. The bedroom is entered by Debbie, the hallway is run down by Sadie, and Charlotte tries to open the door, which she finds locked, while a blow job is given to Pete by Debbie out of frame, making Pete super happy sitting on a chair. Sadie is shoved by Charlotte, leading to an escalating physical fight and muffled screams from the girls outside. The front door is walked to by Pete, where he is greeted by his father Larry, revealing his small house is too close to the airport due to a low flying 747. Pete and Larry sit down for a talk, and two other identical children enter and jump on Larry before the three exit. Larry stands and walks outside, followed by Pete, and as Larry's wife, Claire, enters, the kids are prepared to be sprayed with a hose by Larry, but eventually Pete is sprayed instead. Larry stands up and walks outside once again. A nervous Debbie approaches a hostess and sees Oliver, who sits stiffly at a table. Photos on his iPhone are shown to Debbie by Oliver before he exits, leaving Debbie to sadly scroll through the happy pictures of his new family. The family relaxes at dinner, with an app on her iPhone that animates her mouth to look like a talking monkey's being used by Charlotte while Sadie stomps off. The Pacific Coast Highway is driven down by Pete and Debbie, and they arrive at a beautiful hotel in Laguna. A wood chipping splatter noise is made by Pete, and he runs into the bathroom looking for a cookie, which is then eaten by both. They sit in silence, staring through each other in a haze, as they are stoned. As their time is enjoyed, Pete and Debbie jump up and down on the bed, fall on it, kissing, and almost totally under the covers, they watch as a room service cart full of food is brought in by a waiter. Magic tricks are performed by Pete for the waiter, and a banana and two oranges are handed to Pete by Debbie, which he holds to his crotch in front of the waiter, before a bite of the banana is taken by Pete."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Debbie undergoes a mammogram, which clamps too hard, causing her to scream. While Pete's testicles are examined, Debbie gets a colonoscopy and painful oral surgery, feeling high on laughing gas. Dr. Bowe performs Pete's prostate exam. Debbie visits the gynecologist, Dr. Pelligino from \"Knocked Up,\" with her legs in stirrups as two nurses enter. Debbie gives Pete a blow job out of frame in a locked room, making him happy. Charlotte and Sadie fight outside. Pete greets his father, Larry, noticing the small house is too close to the airport. They talk, and two identical children jump on Larry, who later sprays Pete with a hose instead of the kids. Larry's wife, Claire, enters. Debbie meets Oliver, who shows her family photos before leaving, making her sad. At dinner, Charlotte uses an iPhone app to animate her mouth like a monkey's, and Sadie stomps off. Pete and Debbie drive to a hotel in Laguna, get stoned, and silently stare through each other. They jump on the bed, kiss, and watch as a waiter brings room service. Pete does magic tricks, holding a banana and oranges to his crotch, before taking a bite of the banana."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Debbie gets a mammogram, screams as the machine clamps too hard, and then undergoes a colonoscopy and painful oral surgery. Meanwhile, Pete gets his testicles and prostate examined. Debbie visits Dr. Pelligino, the gynecologist, with legs in stirrups. In the bedroom, Debbie gives Pete a blow job, making him happy while Charlotte and Sadie fight outside. Pete greets his father Larry at the door, and they talk as two kids jump on Larry. Larry prepares to spray the kids with a hose but sprays Pete as Claire enters. At a restaurant, Debbie sadly views happy photos of Oliver's family. At dinner, Charlotte uses a talking monkey app, Sadie stomps off. Pete and Debbie drive to Laguna, get stoned in a hotel, jump on the bed, and receive room service. Pete performs magic for the waiter and makes a crude joke with fruit before eating a banana."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Debbie, who is scheduled for a mammogram, experiences a moment of pain when the machine clamps down with excessive force on her breast, causing her to let out a loud scream. Simultaneously, Pete is having his testicles thoroughly examined by a doctor. Afterward, Debbie goes through the process of a colonoscopy and later finds herself enduring extremely painful oral surgery while feeling slightly euphoric due to the effects of the laughing gas administered. Meanwhile, Dr. Bowe proceeds to conduct a prostate examination on Pete. Debbie makes a visit to the gynecologist, who is none other than Dr. Pelligino, previously seen at the beginning of \"Knocked Up.\" She finds herself with her legs positioned in stirrups as two nurses make their way into the examination room. Later, Debbie makes her way into the bedroom, while Sadie rushes along the hallway, and Charlotte attempts to open the bathroom door, which is locked securely, as Debbie discreetly performs a blow job on Pete, making him extremely happy as he sits comfortably on a chair. The encounter between Sadie and Charlotte devolves into a physical fight, characterized by muffled screams as the quarrel continues just outside in the hallway. \n\nPete proceeds to walk towards the front door and is greeted warmly by his father, Larry, who points out that his small house is disturbingly close to the airport, highlighted by the low-flying 747 aircraft overhead. The duo, Pete and Larry, takes a seat to engage in conversation, and are soon joined by two other children who look identical to each other, as they energetically jump onto Larry before the three eventually make their exit. Larry stands up and heads outside, trailed by Pete, as he gets ready to spray the playful children with a hose, but ends up inadvertently spraying Pete instead. Just then, Larry's wife, Claire, enters the scene. Larry stands up once again and makes his way outside. A somewhat anxious Debbie approaches a hostess, catching sight of Oliver sitting rigidly at a table. Oliver displays some photos on his iPhone to Debbie before leaving, and Debbie, feeling a twinge of sadness, scrolls through the joyful images of his newly formed family. \n\nLater, the family enjoys dinner in a relaxed setting, with Charlotte amusing herself by using an app on her iPhone that humorously manipulates her mouth to resemble that of a talking monkey, while Sadie angrily stomps away from the table. Pete and Debbie are seen driving down the breathtaking Pacific Coast Highway, eventually arriving at a stunningly beautiful hotel located in Laguna. Pete makes an amusing wood-chipping splatter noise before dashing into the bathroom in search of a cookie, which both he and Debbie enjoy together. They sit in a reflective silence, gazing through each other in a daze, as they remain stoned. As they relish their shared moment, Pete and Debbie enthusiastically jump up and down on the bed and fall onto it, kissing passionately and almost entirely covered by the bedcovers. They watch as a waiter enters the room, pushing a cart filled with delectable room service food. Pete entertains the waiter by performing some magic tricks, while Debbie playfully hands Pete a banana and two oranges, which he humorously holds against his crotch in front of the waiter before taking a bite out of the banana, adding to the lighthearted moment."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Debbie, who is scheduled to undergo a mammogram, finds herself in a moment of discomfort and pain when the machine clamps down with excessive force on her breast, prompting her to let out a loud, involuntary scream. Meanwhile, at the same time, Pete is in the midst of having his testicles carefully and thoroughly examined by a doctor. Once this particular ordeal ends, Debbie goes on to face the process of a colonoscopy, and later finds herself enduring the experience of extremely painful oral surgery. During this time, she feels a slight sense of euphoria due to the effects of the laughing gas that has been administered to her. Meanwhile, Dr. Bowe is conducting a prostate examination on Pete. Debbie also makes a visit to the gynecologist, Dr. Pelligino, who is the very same doctor introduced at the beginning of \"Knocked Up.\" She finds herself with her legs positioned in stirrups while two nurses make their way into the examination room to assist. Later, Debbie makes her way into the bedroom, while Sadie is seen rushing along the hallway, and Charlotte attempts to open the bathroom door, which is securely locked, as Debbie discreetly performs a blow job on Pete, making him extremely happy and content as he sits comfortably on a chair. The encounter between Sadie and Charlotte escalates into a physical altercation, featuring muted and muffled screams as their quarrel continues just outside in the hallway.\n\nPete subsequently walks towards the front door and is greeted with warmth by his father, Larry, who comments on how disturbingly close his small house is to the airport, with the presence of a low-flying 747 aircraft overhead serving as a constant reminder. The duo, Pete and Larry, then take a seat to engage in a conversation, and are soon joined by two other children, who bear an identical appearance to each other, as they energetically jump onto Larry before all three eventually make their exit. Larry stands up and heads outside, trailed by Pete, in preparation to spray the playful children with a hose, but ends up inadvertently spraying Pete instead. Just then, Larry's wife, Claire, makes her entrance into the scene. Larry stands up once again, making his way outside. A somewhat anxious and apprehensive Debbie approaches a hostess at a restaurant, catching sight of Oliver, who is sitting rigidly at a table. Oliver shares some photos on his iPhone with Debbie before he departs, leaving Debbie feeling a twinge of sadness as she scrolls through the joyful images of his newly formed family.\n\nLater, the family enjoys a dinner in a relaxed and serene setting, with Charlotte amusing herself by using an app on her iPhone that humorously manipulates her mouth to resemble that of a talking monkey, while Sadie angrily stomps away from the dinner table. Pete and Debbie are next seen driving down the breathtaking Pacific Coast Highway, and they eventually arrive at a stunningly beautiful hotel located in Laguna. Pete makes an amusing wood-chipping splatter noise before quickly darting into the bathroom in a quest to find a cookie, which both he and Debbie delight in together. They sit in a reflective silence, gazing into each other’s eyes in a daze, as they both remain comfortably stoned. As they relish their shared moment together, Pete and Debbie enthusiastically jump up and down on the bed, eventually falling onto it, engaging in passionate kisses, almost entirely covered by the bedcovers. They watch as a waiter enters the room, pushing a cart filled with a spread of delectable room service food. Pete goes on to entertain the waiter by performing some magical tricks, while Debbie playfully hands Pete a banana along with two oranges, which he humorously holds against his crotch in front of the waiter before taking a hearty bite out of the banana, adding to the lightheartedness of the moment."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Debbie walks into a medical clinic, preparing herself mentally for a mammogram. She approaches the machine and carefully positions herself as instructed, feeling the pressure as the machine clamps down on her breast. The pressure increases until it becomes too intense, prompting Debbie to let out a sharp scream of discomfort. In a different examination room, Pete stands nervously as the doctor thoroughly examines his testicles, ensuring everything is normal. Afterward, Debbie, feeling apprehensive, is led to another examination area where she undergoes a colonoscopy. She lies on her side, trying to relax as the medical staff gently guides the scope, enduring the uncomfortable procedure. Later, Debbie sits in a dentist's chair, feeling slightly detached due to the effects of laughing gas as the dentist performs oral surgery, wincing at the sharp bursts of pain despite the sedation. Meanwhile, Pete, now in another room, braces himself as Dr. Bowe conducts a prostate exam, feeling a mix of vulnerability and routine discomfort. At a gynecologist's office, Debbie finds herself seated with her legs up in stirrups, feeling exposed, as Dr. Pelligino, a familiar face from the past, conducts the examination. Two nurses enter the room, adding to the clinical bustle. At home, Debbie walks into the bedroom, sensing a moment of privacy. Sadie runs energetically down the hallway, followed closely by Charlotte, who reaches for the doorknob only to find it locked. Inside, Debbie discreetly tends to Pete, who sits comfortably on a chair, visibly delighted by her actions, even though they are out of direct view. Outside the room, tension rises as Charlotte, frustrated, shoves Sadie, sparking a physical scuffle accompanied by muffled cries as the situation escalates between the girls. Shifting scenes, Pete opens the front door to greet his father, Larry, amidst the roar of a 747 flying low overhead, accentuating how close Larry's modest house is to the airport. The two men sit together, engaging in conversation, when two identical children burst into the scene, excitedly jumping on Larry before exiting the room. Larry then stands and heads outside, Pete following close behind, as Larry mischievously aims a hose, initially intending to spray the children but instead soaking Pete when his wife Claire arrives on the scene. Larry, undeterred, resumes his playful antics, waving goodbye as he steps outside once more. Meanwhile, Debbie approaches a restaurant hostess, her nervous anticipation evident as she catches sight of Oliver sitting rigidly at a table. Feeling a wave of awkwardness, she sits as Oliver shares photos on his iPhone, capturing family moments filled with happiness. He departs, leaving Debbie alone, absorbed in the images of his contented new family, scrolling through them with a sense of melancholy. Later, as the family convenes for dinner, Charlotte entertains herself with an iPhone app that amusingly animates her mouth to resemble a talking monkey, prompting a bit of humor, while Sadie, feeling overwhelmed, stomps off in frustration. Shifting the scene once more, Pete and Debbie embark on a drive down the scenic Pacific Coast Highway, the coastal views leading them to a picturesque hotel in Laguna. At their room, an air of playfulness takes over as Pete mimics a wood-chipping sound, humorously searching for a cookie, which they share and eat with amusement. Under the hazy influence of their shared indulgences, they find themselves sitting quietly, engrossed in each other's presence. The mood lifts with laughter as they energetically leap onto the bed, bouncing with abandon before collapsing in a tangle of limbs and kisses, almost disappearing under the covers with a sense of carefree intimacy. Their revelry is briefly interrupted when a waiter enters, pushing a cart laden with room service treats. Pete entertains the waiter with whimsical magic tricks, eliciting a chuckle from Debbie as she hands him a banana and two oranges. Displaying them in a cheeky manner at his crotch, Pete elicits a knowing laugh before taking a hearty bite of the banana, savoring the moment and the absurdity of the evening."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Debbie undergoes a series of medical examinations, including a mammogram, colonoscopy, and painful oral surgery, where she feels slightly high from laughing gas. Meanwhile, Pete has his testicles examined and receives a prostate exam from Dr. Bowe. Debbie's visit to the gynecologist reveals Dr. Pelligino from \"Knocked Up,\" and she encounters two nurses entering the exam room. Later, in the bedroom, while Debbie discreetly pleasures Pete, their daughters, Charlotte and Sadie, engage in a physical fight outside the locked door. Pete is interrupted by his father, Larry, who visits their home near the airport, where they converse before Larry attempts to spray the children with a hose but ends up spraying Pete instead. Larry's wife, Claire, enters as Larry walks outside again. Debbie, feeling nervous, meets Oliver at a restaurant, who shows her photos of his new family before leaving, leaving her saddened as she views the pictures. During a family dinner, Charlotte plays with an app that animates her mouth while Sadie leaves upset. Pete and Debbie drive to a hotel in Laguna, where they get stoned, jump on the bed, and enjoy room service. Pete entertains the waiter with magic tricks, and in a playful moment, Debbie hands Pete a banana and two oranges, which he humorously displays before taking a bite of the banana."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Debbie is getting a mammogram, a crucial screening test for breast cancer detection, and the machine clamps too hard on her breast, causing her to scream. Meanwhile, Pete gets his testicles examined, a standard health check often done to detect abnormalities such as lumps. Debbie then undergoes a colonoscopy, a medical procedure used to examine the colon for gastrointestinal issues, and later endures some very painful oral surgery, feeling a little high from the laughing gas, a common anesthetic that induces euphoria to ease anxiety during dental procedures. Dr. Bowe, known for his thorough approach, performs a prostate exam on Pete, an important screening for prostate health in men. Debbie visits the gynecologist, revealed to be Dr. Pelligino from the beginning of \"Knocked Up,\" a romantic comedy film, and her legs are up in stirrups as two nurses enter the exam room. Debbie enters the bedroom, located at their suburban home, Sadie runs down the hallway in their two-story house, and Charlotte tries to open the door, which is locked, while Debbie gives Pete a blow job out of frame, making Pete super happy sitting on a chair. Charlotte shoves Sadie, leading to an escalating physical fight and muffled screams from the girls outside. Pete walks to the front door, greeted by his father Larry, revealing his small post-war bungalow-style house is too close to the airport due to a low flying 747, an iconic aircraft known for its distinctive hump and used for long-haul flights. Pete and Larry sit down to talk, and two other identical children enter and jump on Larry before the three exit. Larry stands and walks outside, followed by Pete, and prepares to spray the kids with a hose, eventually spraying Pete instead, as Larry's wife, Claire, enters, having just returned from her gardening club. Larry gets up and walks outside once again. A nervous Debbie approaches a hostess at an upscale restaurant and sees Oliver sitting stiffly at a table. Oliver shows Debbie photos on his iPhone, the popular smartphone by Apple, before exiting, leaving Debbie to sadly scroll through the happy pictures of his new family. The family relaxes at dinner, with Charlotte using an app on her iPhone that animates her mouth to look like a talking monkey's while Sadie stomps off in teenage frustration. Pete and Debbie drive down the Pacific Coast Highway, a scenic route famed for its stunning ocean views, arriving at a beautiful hotel in Laguna, a coastal city known for its art galleries and coves. Pete makes a wood chipping splatter noise and runs into the bathroom looking for a cookie, which they both eat. They sit in silence, staring through each other in a haze, as they are stoned, having indulged in some relaxation. As they enjoy their time, Pete and Debbie jump up and down on the bed, fall on it, kissing, and almost totally under the covers, watch as a waiter, dressed in a crisp uniform, brings in a room service cart full of gourmet food. Pete does magic tricks for the waiter, showing off his sleight of hand skills, and Debbie hands Pete a banana and two oranges, which he holds to his crotch in front of the waiter, before Pete takes a bite of the banana."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Debbie is getting a mammogram and the machine clamps too hard on her breast causing her to scream. Meanwhile Pete gets his testicles examined. Debbie then undergoes a colonoscopy and later endures some very painful oral surgery feeling a little high from the laughing gas. Dr Bowe performs a prostate exam on Pete. Debbie visits the gynecologist revealed to be Dr Pelligino from the beginning of Knocked Up and her legs are up in stirrups. as two nurses enter the exam room. Debbie enters the bedroom Sadie runs down the hallway and Charlotte tries to open the door which is locked while Debbie gives Pete a blow job out of frame making Pete super happy sitting on a chair. Charlotte shoves Sadie leading to an escalating physical fight and muffled screams from the girls outside. Pete walks to the front door greeted by his father. Larry revealing his small house is too close to the airport due to a low flying 747. Pete and Larry sit down to talk and two other identical children enter and jump on Larry before the three exit. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Larry stands and walks outside followed by Pete and prepares to spray the kids with a hose eventually spraying Pete instead as Larry's wife Claire enters. Larry gets up and walks outside once again. A nervous Debbie approaches a hostess and sees Oliver sitting stiffly at a table. Oliver shows Debbie photos on his iPhone before exiting leaving Debbie to sadly scroll through the happy pictures of his new family. The family relaxes at dinner with Charlotte using an app on her iPhone that animates her mouth to look like a talking monkey's while Sadie stomps off. Pete and Debbie drive down the Pacific Coast Highway arriving at a beautiful hotel in Laguna. Pete makes a wood chipping splatter noise and runs into the bathroom looking for a cookie which they both eat. They sit in silence staring through each other in a haze as they are stoned. As they enjoy their time Pete and Debbie jump up and down on the bed fall on it kissing and almost totally under the covers. watch as a waiter brings in a room service cart full of food. Pete does magic tricks for the waiter and Debbie hands. Pete a banana and two oranges which he holds to his crotch in front of the waiter before Pete takes a bite of the banana."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Debbie is getting a mammogram and the machine clamps too hard on her breast causing her to scream. Meanwhile Pete gets his testicles examined. Debbie then undergoes a colonoscopy and later endures some very painful oral surgery feeling a little high from the laughing gas. Dr Bowe performs a prostate exam on Pete. Debbie visits the gynecologist revealed to be Dr Pelligino from the beginning of Knocked Up and her legs are up in stirrups. as two nurses enter the exam room. Debbie enters the bedroom Sadie runs down the hallway and Charlotte tries to open the door which is locked while Debbie gives Pete a blow job out of frame making Pete super happy sitting on a chair. Charlotte shoves Sadie leading to an escalating physical fight and muffled screams from the girls outside. Pete walks to the front door greeted by his father. Larry revealing his small house is too close to the airport due to a low flying 747. Pete and Larry sit down to talk and two other identical children enter and jump on Larry before the three exit. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Larry stands and walks outside followed by Pete and prepares to spray the kids with a hose eventually spraying Pete instead as Larry's wife Claire enters. Larry gets up and walks outside once again. A nervous Debbie approaches a hostess and sees Oliver sitting stiffly at a table. Oliver shows Debbie photos on his iPhone before exiting leaving Debbie to sadly scroll through the happy pictures of his new family. The family relaxes at dinner with Charlotte using an app on her iPhone that animates her mouth to look like a talking monkey's while Sadie stomps off. Pete and Debbie drive down the Pacific Coast Highway arriving at a beautiful hotel in Laguna. Pete makes a wood chipping splatter noise and runs into the bathroom looking for a cookie which they both eat. They sit in silence staring through each other in a haze as they are stoned. As they enjoy their time Pete and Debbie jump up and down on the bed fall on it kissing and almost totally under the covers. watch as a waiter brings in a room service cart full of food. Pete does magic tricks for the waiter and Debbie hands. Pete a banana and two oranges which he holds to his crotch in front of the waiter before Pete takes a bite of the banana."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Debbie is getting a mammogram and the machine clamps too hard on her breast causing her to scream. Meanwhile Pete gets his testicles examined. Debbie then undergoes a colonoscopy and later endures some very painful oral surgery feeling a little high from the laughing gas. Dr Bowe performs a prostate exam on Pete. Debbie visits the gynecologist revealed to be Dr Pelligino from the beginning of Knocked Up and her legs are up in stirrups. as two nurses enter the exam room. Pete makes a wood chipping splatter noise and runs into the bathroom looking for a cookie which they both eat. They sit in silence staring through each other in a haze as they are stoned. As they enjoy their time Pete and Debbie jump up and down on the bed fall on it kissing and almost totally under the covers. watch as a waiter brings in a room service cart full of food. Pete does magic tricks for the waiter and Debbie hands. Pete a banana and two oranges which he holds to his crotch in front of the waiter before Pete takes a bite of the banana."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Debbie is getting a mammogram and the machine clamps too hard on her breast causing her to scream. Meanwhile Pete gets his testicles examined. watch as a waiter brings in a room service cart full of food. Pete does magic tricks for the waiter and Debbie hands. Pete a banana and two oranges which he holds to his crotch in front of the waiter before Pete takes a bite of the banana."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Denise is getting a shoeshine, and the polisher presses too hard on her heel, causing her to yelp. Meanwhile, Paul gets his elbows scrutinized. Denise then undergoes a dance lesson and later endures some very chaotic bowling alley fiascoes, feeling a bit dizzy from the constantly spinning lights. Mr. Browne conducts a physics experiment on Paul. Denise visits the florist, revealed to be Mr. Pinecone from the beginning of \"Dressed Up,\" and her arms are up in bouquets as two bakers enter the flower shop. Denise enters the living room, Sally rushes up the stairs, and Charlie tries to open the window, which is jammed, while Denise gives Paul a shoulder massage out of sight, making Paul super thrilled reclining on a hammock. Charlie nudges Sally, leading to an escalating pillow fight and hushed giggles from the kids in the hallway. Paul strolls to the garage door, greeted by his uncle Leo, revealing his tiny greenhouse is too near the highway due to a speeding motorcycle. Paul and Leo plop down to chat, and two other identical beagles dash in and leap on Leo before the trio scampers away. Leo stands and wanders outdoors, followed by Paul, and plans to sprinkle the dogs with a broom, eventually hitting Paul instead, as Leo’s partner, Claire, joins. Leo gets up and marches outside once more. A jittery Denise approaches a librarian and notices Oscar sitting awkwardly at a desk. Oscar shows Denise paintings on his tablet before departing, leaving Denise to wistfully flick through the vibrant artwork of his latest exhibition. The family gathers at breakfast, with Charlie using an app on her tablet that transforms her grin to resemble a grinning clown’s while Sally storms away. Paul and Denise cruise down the Woodland Trail, arriving at a charming cabin in Aspen. Paul makes a pebble-crunching sound and dashes into the kitchen looking for a muffin, which they both nibble. They sit in silence, gazing through each other in a daze, as they are daydreaming. As they savor their adventure, Paul and Denise spring up and down on the couch, tumble on it, cuddling, and almost entirely under the blanket, watch as a valet rolls in a service trolley brimming with desserts. Paul performs juggling tricks for the valet, and Denise hands Paul a pineapple and two plums, which he displays at his midriff in front of the valet, before Paul takes a bite of the pineapple."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Debbie undergoes a series of painful medical procedures, including a mammogram, colonoscopy, and oral surgery, while Pete experiences a prostate exam. In the bedroom, Debbie pleases Pete, causing a commotion outside as their daughters, Sadie and Charlotte, engage in a fight. Pete's father, Larry, visits, bringing family tension and comic relief, spraying Pete with a hose. Debbie meets Oliver, viewing photos of his happy new family, which leaves her dejected. The family shares a dinner where Charlotte uses a fun app, while Sadie leaves in frustration. Pete and Debbie escape to a Laguna hotel, getting high, and enjoy a playful time jumping on the bed. They share a moment of intimacy when room service arrives, with Pete performing magic tricks and making humorous gestures before enjoying their meal."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Pete a banana and two oranges which he holds to his crotch in front of the waiter before Pete takes a bite of the banana Pete does magic tricks for the waiter and Debbie hands watch as a waiter brings in a room service cart full of food As they enjoy their time Pete and Debbie jump up and down on the bed fall on it kissing and almost totally under the covers They sit in silence staring through each other in a haze as they are stoned Pete makes a wood chipping splatter noise and runs into the bathroom looking for a cookie which they both eat Pete and Debbie drive down the Pacific Coast Highway arriving at a beautiful hotel in Laguna The family relaxes at dinner with Charlotte using an app on her iPhone that animates her mouth to look like a talking monkey's while Sadie stomps off Oliver shows Debbie photos on his iPhone before exiting leaving Debbie to sadly scroll through the happy pictures of his new family A nervous Debbie approaches a hostess and sees Oliver sitting stiffly at a table Larry gets up and walks outside once again Larry stands and walks outside followed by Pete and prepares to spray the kids with a hose eventually spraying Pete instead as Larry's wife Claire enters Pete and Larry sit down to talk and two other identical children enter and jump on Larry before the three exit Larry revealing his small house is too close to the airport due to a low flying 747 Pete walks to the front door greeted by his father Charlotte shoves Sadie leading to an escalating physical fight and muffled screams from the girls outside Debbie enters the bedroom Sadie runs down the hallway and Charlotte tries to open the door which is locked while Debbie gives Pete a blow job out of frame making Pete super happy sitting on a chair as two nurses enter the exam room Debbie visits the gynecologist revealed to be Dr Pelligino from the beginning of Knocked Up and her legs are up in stirrups Dr Bowe performs a prostate exam on Pete Debbie then undergoes a colonoscopy and later endures some very painful oral surgery feeling a little high from the laughing gas Meanwhile Pete gets his testicles examined Debbie is getting a mammogram and the machine clamps too hard on her breast causing her to scream"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Meanwhile Pete gets his testicles examined Debbie is getting a mammogram and the machine clamps too hard on her breast causing her to scream Dr Bowe performs a prostate exam on Pete Debbie then undergoes a colonoscopy and later endures some very painful oral surgery feeling a little high from the laughing gas as two nurses enter the exam room Debbie visits the gynecologist revealed to be Dr Pelligino from the beginning of Knocked Up and her legs are up in stirrups Charlotte shoves Sadie leading to an escalating physical fight and muffled screams from the girls outside Debbie enters the bedroom Sadie runs down the hallway and Charlotte tries to open the door which is locked while Debbie gives Pete a blow job out of frame making Pete super happy sitting on a chair Larry revealing his small house is too close to the airport due to a low flying 747 Pete walks to the front door greeted by his father Larry stands and walks outside followed by Pete and prepares to spray the kids with a hose eventually spraying Pete instead as Larry's wife Claire enters Pete and Larry sit down to talk and two other identical children enter and jump on Larry before the three exit A nervous Debbie approaches a hostess and sees Oliver sitting stiffly at a table Larry gets up and walks outside once again The family relaxes at dinner with Charlotte using an app on her iPhone that animates her mouth to look like a talking monkey's while Sadie stomps off Oliver shows Debbie photos on his iPhone before exiting leaving Debbie to sadly scroll through the happy pictures of his new family Pete makes a wood chipping splatter noise and runs into the bathroom looking for a cookie which they both eat Pete and Debbie drive down the Pacific Coast Highway arriving at a beautiful hotel in Laguna As they enjoy their time Pete and Debbie jump up and down on the bed fall on it kissing and almost totally under the covers They sit in silence staring through each other in a haze as they are stoned Pete does magic tricks for the waiter and Debbie hands watch as a waiter brings in a room service cart full of food Pete a banana and two oranges which he holds to his crotch in front of the waiter before Pete takes a bite of the banana"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Larry gets up and walks outside once again A nervous Debbie approaches a hostess and sees Oliver sitting stiffly at a table Oliver shows Debbie photos on his iPhone before exiting leaving Debbie to sadly scroll through the happy pictures of his new family The family relaxes at dinner with Charlotte using an app on her iPhone that animates her mouth to look like a talking monkey's while Sadie stomps off Pete and Debbie drive down the Pacific Coast Highway arriving at a beautiful hotel in Laguna Pete makes a wood chipping splatter noise and runs into the bathroom looking for a cookie which they both eat They sit in silence staring through each other in a haze as they are stoned As they enjoy their time Pete and Debbie jump up and down on the bed fall on it kissing and almost totally under the covers watch as a waiter brings in a room service cart full of food Pete does magic tricks for the waiter and Debbie hands Pete a banana and two oranges which he holds to his crotch in front of the waiter before Pete takes a bite of the banana Debbie is getting a mammogram and the machine clamps too hard on her breast causing her to scream Meanwhile Pete gets his testicles examined Debbie then undergoes a colonoscopy and later endures some very painful oral surgery feeling a little high from the laughing gas Dr Bowe performs a prostate exam on Pete Debbie visits the gynecologist revealed to be Dr Pelligino from the beginning of Knocked Up and her legs are up in stirrups as two nurses enter the exam room Debbie enters the bedroom Sadie runs down the hallway and Charlotte tries to open the door which is locked while Debbie gives Pete a blow job out of frame making Pete super happy sitting on a chair Charlotte shoves Sadie leading to an escalating physical fight and muffled screams from the girls outside Pete walks to the front door greeted by his father Larry revealing his small house is too close to the airport due to a low flying 747 Pete and Larry sit down to talk and two other identical children enter and jump on Larry before the three exit Larry stands and walks outside followed by Pete and prepares to spray the kids with a hose eventually spraying Pete instead as Larry's wife Claire enters"
        }
      ]
    }
  ]
}