{
  "ground_truth": "Pete takes a framed item off of his wall, and then Larry answers the door, where Pete stands with a framed drawing made by John Lennon and hands it to him. Meanwhile, Sadie and a bunch of other kids are building sets for a school play, and Sadie talks with a friend while Pete and Debbie watch from afar, sitting next to each other. Debbie tries to gently break the news, feeling totally deflated, and then she walks through the campus upset. She sees a kid, darts over to him, and encounters Joseph, the kid who insulted Sadie on her Facebook. Debbie becomes quieter, scarier, and more confrontational, causing Joseph to look upset, and then she storms off. Debbie pulls open the door to find Pete on the toilet playing on his iPad; she exits, and Pete flips her off after she's gone. Later, Debbie and Desi are talking as they walk down the stairs into a loud club, where they talk to a group of young men, one of whom takes a plate of his teeth out. Desi tries to put them in her mouth, and everyone laughs, as she looks insane and tries to kiss Debbie. Still laughing, she hands the teeth back to their owner, who pops them back in to cheers from the crowd. Elsewhere, Pete is on stage in a half-filled nightclub, watching Graham Parker perform with his band. The song resonates with Pete, reflecting the issues he is facing and prompting a strong emotional connection. Billie Joe Armstrong sits nearby, watching the show as Desi and Debbie dance with hockey players to a Nikki Minaj song, with Debbie letting loose and having the time of her life. Debbie talks to a hockey player named Jay, who is twenty-four and cute, making them both laugh. As Graham packs up, Pete approaches him, and Billie Joe comes over to congratulate Graham before they walk away. Pete sits in the car, crying while Debbie drops Desi off at her apartment, where Debbie looks shocked, and Desi nods. Pete is later on his iPad, lying in bed when Debbie comes in to talk, her shirt unbuttoned and topless. She exits into the bathroom, and after a silence, she returns dressed, prompting Pete to walk out of the room, with Debbie following. Charlotte plays piano in her room alone, overhearing Debbie and Pete fighting through the wall, leading Debbie to start walking away. The family then lays in bed watching Spongebob Squarepants, but the atmosphere is tense as Charlotte licks her fingers, pokes Sadie with her wet fingers, resulting in Sadie leaving and slamming the door. Charlotte writes a note at her desk, walks by Sadie's room, and puts the note on the door. Pete sits alone, listening to music.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Pete grabs a bordered object off of his partition, and then Larry replies the entrance, where Pete stands with a bordered sketch crafted by John Lennon and transfers it to him. Meanwhile, Sadie and a cluster of additional children are constructing scenes for a school production, and Sadie chats with a companion while Pete and Debbie observe from afar, seated adjacent to one another. Debbie attempts to softly disclose the information, feeling completely deflated, and then she traverses the grounds distressed. She notices a child, dashes over to him, and encounters Joseph, the child who offended Sadie on her Facebook. Debbie becomes quieter, more intimidating, and more combative, causing Joseph to appear troubled, and then she storms off. Debbie pulls open the entrance to find Pete on the toilet playing on his iPad; she exits, and Pete flips her off after she's gone. Later, Debbie and Desi are conversing as they descend the steps into a noisy club, where they speak to a gathering of young men, one of whom removes a plate of his dentures. Desi attempts to insert them in her mouth, and everyone chuckles, as she appears deranged and tries to kiss Debbie. Still laughing, she passes the dentures back to their possessor, who inserts them back in to cheers from the audience. Elsewhere, Pete is on stage in a half-filled nightclub, observing Graham Parker perform with his band. The melody resonates with Pete, mirroring the dilemmas he is encountering and prompting a strong emotional link. Billie Joe Armstrong sits nearby, observing the show as Desi and Debbie dance with hockey players to a Nikki Minaj tune, with Debbie letting loose and having the time of her existence. Debbie talks to a hockey player named Jay, who is twenty-four and attractive, making them both chuckle. As Graham packs up, Pete approaches him, and Billie Joe comes over to compliment Graham before they stroll away. Pete sits in the vehicle, weeping while Debbie drops Desi off at her apartment, where Debbie appears astonished, and Desi nods. Pete is later on his iPad, lying in bed when Debbie comes in to converse, her blouse unbuttoned and topless. She exits into the bathroom, and after a silence, she returns dressed, prompting Pete to walk out of the chamber, with Debbie trailing. Charlotte plays piano in her room alone, overhearing Debbie and Pete arguing through the partition, leading Debbie to start walking away. The family then lays in bed observing Spongebob Squarepants, but the atmosphere is tense as Charlotte licks her fingers, pokes Sadie with her moist fingers, resulting in Sadie departing and slamming the entrance. Charlotte writes a note at her desk, walks by Sadie's room, and places the note on the entrance. Pete sits alone, listening to melodies."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A framed item is taken off of the wall by Pete, and then the door is answered by Larry, where Pete is standing with a framed drawing made by John Lennon and hands it to him. Meanwhile, sets for a school play are being built by Sadie and a bunch of other kids, and Sadie is talking with a friend while Pete and Debbie watch from afar, sitting next to each other. The news is gently broken by Debbie, who feels totally deflated, and then she walks through the campus upset. She sees a kid, darts over to him, and she encounters Joseph, the kid who insulted Sadie on her Facebook. Debbie becomes quieter, scarier, and more confrontational, causing Joseph to look upset, and then she storms off. The door is pulled open by Debbie to find Pete on the toilet playing on his iPad; she exits, and after she is gone, he flips her off. Later, Debbie and Desi are talking as they walk down the stairs into a loud club, where a group of young men is talked to, and one of them takes a plate of his teeth out. The teeth are tried to be put in Desi's mouth by her, and everyone laughs, as she looks insane and tries to kiss Debbie. Still laughing, the teeth are handed back to their owner by her, who pops them back in to cheers from the crowd. Elsewhere, Pete is on stage in a half-filled nightclub, watching Graham Parker perform with his band. The issues Pete is facing are reflected by the song, resonating with him and prompting a strong emotional connection. Billie Joe Armstrong sits nearby, watching the show as Desi and Debbie dance with hockey players to a Nikki Minaj song, with Debbie letting loose and having the time of her life. A hockey player named Jay, who is twenty-four and cute, is talked to by Debbie, making them both laugh. As Graham packs up, Pete approaches him, and Graham is congratulated by Billie Joe before they walk away. Pete sits in the car, crying while Desi is dropped off at her apartment by Debbie, where Debbie looks shocked, and Desi nods. Pete is later on his iPad, lying in bed when Debbie comes in to talk, her shirt unbuttoned and topless. She exits into the bathroom, and after a silence, she returns dressed, prompting Pete to walk out of the room, with Debbie following. Piano is played by Charlotte in her room alone, overhearing Debbie and Pete fight through the wall, leading Debbie to start walking away. The family then lays in bed watching Spongebob Squarepants, but the atmosphere is tense as Charlotte licks her fingers, pokes Sadie with her wet fingers, resulting in Sadie leaving and slamming the door. A note is written by Charlotte at her desk, walks by Sadie's room, and she puts the note on the door. Music is listened to by Pete as he sits alone."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Pete removes a framed item from his wall and gives it to Larry at the door—a drawing by John Lennon. Meanwhile, Sadie and other kids build sets for a school play, as Sadie chats with a friend. Pete and Debbie watch from afar. Debbie, feeling deflated, tries to break the news gently, then walks through campus upset. She confronts Joseph, the kid who insulted Sadie on Facebook, becoming quieter and more confrontational, causing him distress before she storms off. Debbie finds Pete on the toilet with his iPad; she leaves, and he flips her off. Later, Debbie and Desi descend into a loud club, talking to young men. One removes his teeth, Desi tries them on, and everyone laughs as she returns them. Elsewhere, Pete watches Graham Parker perform in a half-filled nightclub, resonating with his issues. Billie Joe Armstrong watches nearby as Desi and Debbie dance with hockey players to a Nikki Minaj song, with Debbie enjoying herself. Debbie talks to a cute, twenty-four-year-old hockey player named Jay, making them both laugh. As Graham packs up, Pete approaches him, and Billie Joe congratulates Graham before they leave. Pete cries in the car while Debbie drops Desi off, looking shocked. Later, Pete is on his iPad in bed when Debbie enters, topless, then exits to the bathroom. She returns dressed, prompting Pete to leave the room, with Debbie following. Charlotte plays piano alone, overhearing Debbie and Pete fighting, leading Debbie to walk away. The family lies in bed watching Spongebob Squarepants, but tension rises as Charlotte pokes Sadie with wet fingers, causing Sadie to leave and slam the door. Charlotte writes a note, places it on Sadie's door, and Pete sits alone, listening to music."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Pete removes a framed item from his wall and gives it to Larry at the door; it's a drawing by John Lennon. Sadie and other kids build sets for a school play while Pete and Debbie watch. Debbie, feeling deflated, tries to break the news and walks upset through campus. She confronts Joseph, who insulted Sadie on Facebook, becoming scarier and more confrontational, then storms off. Debbie finds Pete on the toilet with his iPad; she leaves, and he flips her off. Later, Debbie and Desi enter a loud club, talk to young men, and laugh as Desi tries on fake teeth. Pete watches Graham Parker perform, resonating with his issues. Billie Joe Armstrong watches nearby as Desi and Debbie dance with hockey players to a Nikki Minaj song. Debbie talks to a cute hockey player named Jay. After Graham's performance, Pete approaches him, and Billie Joe congratulates Graham. Pete cries in the car while Debbie drops Desi off, looking shocked. Pete is on his iPad in bed when Debbie, topless, enters to talk, then leaves to the bathroom. She returns dressed, prompting Pete to leave, with Debbie following. Charlotte plays piano, overhearing Debbie and Pete fighting, leading Debbie to walk away. The family watches Spongebob Squarepants in bed, but tension rises as Charlotte pokes Sadie, who leaves angrily. Charlotte writes a note, places it on Sadie's door, and Pete sits alone, listening to music."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Pete carefully removes a framed item from his wall, handling it with a sense of purpose. Meanwhile, Larry answers the door, where Pete stands holding a framed drawing that was created by none other than John Lennon. Pete hands this precious piece to Larry. At the same time, Sadie, along with a group of other enthusiastic kids, is busy constructing sets for an upcoming school play. Sadie engages in a lively conversation with a friend, while Pete and Debbie observe from a distance, sitting closely together. Debbie attempts to gently break some news, feeling utterly deflated, and then she walks through the campus, visibly upset. She spots a kid, quickly moves towards him, and encounters Joseph, the very kid who had insulted Sadie on her Facebook page. Debbie becomes quieter, her demeanor turning scarier and more confrontational, which causes Joseph to appear visibly upset, and then she storms off in a huff. Debbie forcefully pulls open the door to find Pete sitting on the toilet, engrossed in playing on his iPad; she exits, and Pete flips her off after she has left. Later on, Debbie and Desi are engaged in conversation as they descend the stairs into a bustling, loud club. There, they interact with a group of young men, one of whom amusingly removes a plate of his teeth. Desi, in a moment of wild abandon, tries to put them in her mouth, causing everyone to burst into laughter, as she looks utterly insane and attempts to kiss Debbie. Still laughing, she returns the teeth to their owner, who pops them back in to cheers from the crowd. Elsewhere, Pete finds himself on stage in a half-filled nightclub, watching Graham Parker perform with his band. The song deeply resonates with Pete, reflecting the personal issues he is grappling with and prompting a strong emotional connection. Nearby, Billie Joe Armstrong sits, watching the show as Desi and Debbie dance energetically with hockey players to a Nikki Minaj song, with Debbie letting loose and having the time of her life. Debbie strikes up a conversation with a hockey player named Jay, who is twenty-four and quite cute, making them both laugh heartily. As Graham packs up his equipment, Pete approaches him, and Billie Joe comes over to congratulate Graham before they all walk away. Pete sits alone in the car, tears streaming down his face, while Debbie drops Desi off at her apartment, where Debbie looks shocked, and Desi nods in understanding. Later, Pete is on his iPad, lying in bed when Debbie enters to talk, her shirt unbuttoned and topless. She exits into the bathroom, and after a moment of silence, she returns fully dressed, prompting Pete to walk out of the room, with Debbie following closely behind. Charlotte plays the piano in her room, all alone, overhearing Debbie and Pete fighting through the wall, which leads Debbie to start walking away. The family then lies in bed together, watching Spongebob Squarepants, but the atmosphere is tense. Charlotte mischievously licks her fingers and pokes Sadie with her wet fingers, resulting in Sadie leaving the room and slamming the door behind her. Charlotte writes a note at her desk, walks by Sadie's room, and places the note on the door. Pete sits alone, lost in thought, listening to music."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Pete, with deliberate care and a clear sense of purpose, cautiously removes a framed item from its place on the wall. At the same time, Larry responds to the sound of the doorbell, where he finds Pete standing there holding a framed drawing. This drawing happens to be a cherished creation by the famous John Lennon himself. Pete, with care and reverence, hands this valuable piece of art to Larry. Simultaneously, Sadie is immersed in an exciting project, building sets alongside a group of other eager and enthusiastic kids for an upcoming school play. As she works, Sadie engages in a lively and animated conversation with a friend, while Pete and Debbie watch attentively from a distance, sitting closely together, observing the scene. Debbie, feeling utterly deflated and defeated, tries to gently break some difficult news. Visibly upset, she walks through the campus, her emotions evident. She spots a kid, swiftly approaches him, and encounters Joseph, the same young boy who had previously insulted Sadie on her Facebook page. Debbie falls silent, her demeanor becoming noticeably scarier and more confrontational, which causes Joseph to appear visibly upset, and then she storms off in a huff, filled with raw emotion. In frustration, Debbie pulls open the door to find Pete, who is engrossed in a game on his iPad while sitting on the toilet; she exits, her departure met with Pete flipping her off as she leaves. Later, Debbie and Desi find themselves descending the stairs into a bustling, loud club, engaged in conversation. There, amid the lively atmosphere, they interact with a group of young men, one of whom entertainingly removes a plate of his teeth. In a moment of wild abandon, Desi attempts to put them in her mouth, causing everyone around to erupt with laughter, as she appears utterly insane and amusingly tries to kiss Debbie. Still chuckling, she returns the teeth to their owner, who then pops them back into his mouth to the cheers of the surrounding crowd. Meanwhile, elsewhere, Pete finds himself in a half-filled nightclub, seated on stage, observing Graham Parker perform with his talented band. The music deeply resonates with Pete, providing a reflection of the personal issues he is currently grappling with, and it prompts a strong emotional connection within him. Nearby, Billie Joe Armstrong is seated, attentively watching the show as Desi and Debbie dance energetically with a group of hockey players to a Nikki Minaj song, with Debbie fully letting loose and thoroughly enjoying herself. In the midst of this, Debbie strikes up a friendly conversation with a hockey player named Jay, who is twenty-four and notably quite cute, causing them both to laugh heartily. After Graham finishes packing up his equipment, Pete approaches him to speak, and Billie Joe comes over to congratulate Graham warmly before they all depart together. In a moment of solitude, Pete sits alone in the car, tears flowing down his face, while Debbie drops Desi off at her apartment, where the scene leaves Debbie looking shocked, and Desi nodding in silent understanding. Later on, Pete lies in bed, intently focused on his iPad, when Debbie enters the room to talk, her shirt unbuttoned, leaving her topless. She steps into the bathroom for a brief moment, returning fully dressed, prompting Pete to leave the room with Debbie following closely behind him. Meanwhile, Charlotte plays the piano alone in her room, listening to the sounds of Debbie and Pete fighting through the wall, which leads Debbie to begin walking away. Eventually, the family lies together in bed, watching Spongebob Squarepants on TV, although the atmosphere remains tense and uneasy. Mischievously, Charlotte licks her fingers before playfully poking Sadie with her wet fingers, prompting Sadie to leave the room in a huff, slamming the door behind her. Charlotte, with a determined air, writes a note at her desk, walks past Sadie's room, and carefully places the note on the door. Meanwhile, Pete sits alone, lost in thought, as he listens to music and reflects on everything that has happened."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Pete carefully reaches up to the wall, gently removing a framed item and holding it securely in his hands. He then makes his way to the door, where Larry stands waiting. As the door opens, Pete stands there, presenting a framed drawing created by John Lennon, and hands it over to Larry with a sense of significance. Meanwhile, in a different setting, Sadie, along with a group of other children, is actively engaged in constructing sets for an upcoming school play. Amidst the bustling activity, Sadie converses with a friend, sharing thoughts and laughter, while Pete and Debbie observe from a distance, seated side by side. Debbie, feeling a heavy weight of emotion, attempts to gently convey some difficult news, her demeanor reflecting a sense of deflation. Afterward, she walks through the campus, visibly upset, her mind preoccupied with the situation. Her attention is suddenly drawn to a kid, prompting her to quickly move towards him. She encounters Joseph, the very kid who had previously insulted Sadie on her Facebook. Debbie's demeanor shifts, becoming quieter yet more intimidating and confrontational, which causes Joseph to appear visibly upset. With a sense of finality, she storms off, leaving Joseph in her wake. Later, Debbie pulls open a door to find Pete sitting on the toilet, absorbed in a game on his iPad. She exits the room, and after she is gone, Pete expresses his frustration by flipping her off. The scene shifts to a later moment when Debbie and Desi are engaged in conversation while descending the stairs into a loud, vibrant club. They approach a group of young men, one of whom amusingly removes a plate of his teeth. Desi, in a playful and outrageous gesture, attempts to put the teeth in her mouth, eliciting laughter from everyone around as she appears comically insane and tries to kiss Debbie. Amidst the laughter, she returns the teeth to their owner, who promptly pops them back in, receiving cheers from the surrounding crowd. In another part of the city, Pete finds himself in a half-filled nightclub, intently watching Graham Parker perform with his band. The music resonates deeply with Pete, mirroring the personal issues he is grappling with and forging a strong emotional connection. Nearby, Billie Joe Armstrong sits, also watching the performance, while Desi and Debbie dance energetically with hockey players to a Nikki Minaj song. Debbie, feeling liberated, lets loose and enjoys the moment to the fullest. Amidst the lively atmosphere, Debbie strikes up a conversation with a hockey player named Jay, who is twenty-four and charming, leading to shared laughter between them. As Graham begins to pack up his equipment, Pete approaches him, and Billie Joe joins them to offer congratulations to Graham before they all part ways. Later, Pete sits alone in his car, overcome with emotion, and begins to cry. Meanwhile, Debbie drops Desi off at her apartment, where a moment of surprise passes between them as Debbie looks shocked and Desi nods in acknowledgment. Later, Pete is seen lying in bed, engrossed in his iPad, when Debbie enters the room, her shirt unbuttoned, revealing her topless state. She exits into the bathroom, leaving a silence in her wake, and then returns, now dressed, prompting Pete to leave the room, with Debbie following closely behind. In another part of the house, Charlotte sits alone in her room, playing the piano, her ears picking up the sounds of Debbie and Pete's argument through the wall. The tension escalates, leading Debbie to begin walking away. Eventually, the family gathers in bed to watch Spongebob Squarepants, but the atmosphere remains tense. Charlotte, in a moment of mischief, licks her fingers and pokes Sadie with her wet fingers, causing Sadie to leave the room in frustration, slamming the door behind her. Charlotte then writes a note at her desk, walks past Sadie's room, and places the note on the door. Meanwhile, Pete sits alone, lost in the music playing through his headphones, reflecting on the events that have unfolded."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Pete removes a framed drawing by John Lennon from his wall and gives it to Larry at the door. Meanwhile, Sadie and other kids work on school play sets, with Sadie chatting with a friend as Pete and Debbie watch from a distance. Debbie, feeling deflated, tries to break some news and then walks through the campus upset. She confronts Joseph, the kid who insulted Sadie on Facebook, becoming intimidating and causing him distress before storming off. Debbie finds Pete in the bathroom on his iPad, exits, and Pete reacts with a rude gesture. Later, Debbie and Desi descend into a loud club, where they interact with young men, one of whom removes his teeth. Desi humorously tries them on, causing laughter, and returns them to cheers. Elsewhere, Pete watches Graham Parker perform in a nightclub, feeling a strong emotional connection to the music. Billie Joe Armstrong is nearby, while Desi and Debbie dance with hockey players to a Nikki Minaj song, with Debbie enjoying herself. Debbie chats with a young hockey player named Jay, sharing a laugh. After Graham's performance, Pete approaches him, and Billie Joe congratulates Graham before they leave. Pete sits in his car, crying, while Debbie drops Desi off at her apartment, looking shocked as Desi nods. Later, Pete is on his iPad in bed when Debbie enters, topless, and then leaves to the bathroom. She returns dressed, prompting Pete to leave the room with Debbie following. Charlotte plays piano alone, overhearing Debbie and Pete's argument, leading Debbie to walk away. The family lies in bed watching Spongebob Squarepants, but tension arises as Charlotte annoys Sadie, causing Sadie to leave and slam the door. Charlotte writes a note, places it on Sadie's door, and Pete sits alone, listening to music."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Pete takes a framed item off of his wall, and then Larry answers the door, where Pete stands with a framed drawing made by John Lennon, one of the founding members of The Beatles, and hands it to him. Meanwhile, Sadie and a bunch of other kids are building sets for a school play, a production that had won state awards in previous years for its creativity and execution, and Sadie talks with a friend while Pete and Debbie watch from afar, sitting next to each other. Debbie tries to gently break the news, feeling totally deflated from the weight of an argument about their finances, and then she walks through the campus upset. She sees a kid, darts over to him, and encounters Joseph, the kid who insulted Sadie on her Facebook, a social media platform where teenagers often express themselves but also face cyberbullying. Debbie becomes quieter, scarier, and more confrontational, causing Joseph to look upset, and then she storms off. Debbie pulls open the door to find Pete on the toilet playing on his iPad, a device widely used for entertainment and communication; she exits, and Pete flips her off, an expression of frustration, after she's gone. Later, Debbie and Desi are talking as they walk down the stairs into a loud club, popular for its vibrant nightlife, where they talk to a group of young men, one of whom takes a plate of his teeth out, revealing a humorous party trick. Desi tries to put them in her mouth, and everyone laughs, as she looks insane and tries to kiss Debbie. Still laughing, she hands the teeth back to their owner, who pops them back in to cheers from the crowd. Elsewhere, Pete is on stage in a half-filled nightclub, a frequent venue for emerging musicians, watching Graham Parker, an acclaimed British rock singer known since the 1970s, perform with his band. The song resonates with Pete, reflecting the issues he is facing and prompting a strong emotional connection. Billie Joe Armstrong, the lead vocalist of Green Day, sits nearby, watching the show as Desi and Debbie dance with hockey players to a Nikki Minaj song, known for its catchy beats and empowering lyrics, with Debbie letting loose and having the time of her life. Debbie talks to a hockey player named Jay, who is twenty-four and cute, making them both laugh as they share stories. As Graham packs up, Pete approaches him, and Billie Joe comes over to congratulate Graham before they walk away, reminiscing about the old days of rock and roll. Pete sits in the car, crying from a mix of emotional exhaustion and relief, while Debbie drops Desi off at her apartment, where Debbie looks shocked, and Desi nods, acknowledging a shared secret. Pete is later on his iPad, lying in bed when Debbie comes in to talk, her shirt unbuttoned and topless, a sign of vulnerability and intimacy. She exits into the bathroom, and after a silence, she returns dressed, prompting Pete to walk out of the room, feeling a mix of unresolved emotions, with Debbie following. Charlotte plays piano in her room alone, practicing for an upcoming recital, overhearing Debbie and Pete fighting through the wall, leading Debbie to start walking away. The family then lays in bed watching Spongebob Squarepants, a beloved animated series known for its humor and whimsy, but the atmosphere is tense as Charlotte licks her fingers, pokes Sadie with her wet fingers, resulting in Sadie leaving and slamming the door, expressing her annoyance. Charlotte writes a note at her desk, expressing her feelings in words, walks by Sadie's room, and puts the note on the door. Pete sits alone, listening to music that echoes his current turmoil and longing for resolution."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Pete takes a framed item off of his wall and then Larry answers the door where Pete stands with a framed drawing made by John Lennon and hands it to him  Meanwhile Sadie and a bunch of other kids are building sets for a school play and Sadie talks with a friend while Pete and Debbie watch from afar sitting next to each other  Debbie tries to gently break the news feeling totally deflated and then she walks through the campus upset  Elsewhere Pete is on stage in a halffilled nightclub watching Graham Parker perform with his band  The song resonates with Pete reflecting the issues he is facing and prompting a strong emotional connection  Billie Joe Armstrong sits nearby watching the show as Desi and Debbie dance with hockey players to a Nikki Minaj song with Debbie letting loose and having the time of her life  Debbie talks to a hockey player named Jay who is twentyfour and cute making them both laugh  As Graham packs up Pete approaches him and Billie Joe comes over to congratulate Graham before they walk away  Pete sits in the car crying while Debbie drops Desi off at her apartment where Debbie looks shocked and Desi nods  Pete is later on his iPad lying in bed when Debbie comes in to talk her shirt unbuttoned and topless  She exits into the bathroom and after a silence she returns dressed prompting Pete to walk out of the room with Debbie following  Charlotte plays piano in her room alone overhearing Debbie and Pete fighting through the wall leading Debbie to start walking away  The family then lays in bed watching Spongebob Squarepants but the atmosphere is tense as Charlotte licks her fingers pokes Sadie with her wet fingers resulting in Sadie leaving and slamming the door  Charlotte writes a note at her desk walks by Sadie's room and puts the note on the door  She sees a kid darts over to him and encounters Joseph the kid who insulted Sadie on her Facebook  Debbie becomes quieter scarier and more confrontational causing Joseph to look upset and then she storms off  Debbie pulls open the door to find Pete on the toilet playing on his iPad  she exits and Pete flips her off after she's gone  Later Debbie and Desi are talking as they walk down the stairs into a loud club where they talk to a group of young men one of whom takes a plate of his teeth out  Desi tries to put them in her mouth and everyone laughs as she looks insane and tries to kiss Debbie  Still laughing she hands the teeth back to their owner who pops them back in to cheers from the crowd  Elsewhere Pete is on stage in a halffilled nightclub watching Graham Parker perform with his band  The song resonates with Pete reflecting the issues he is facing and prompting a strong emotional connection  Billie Joe Armstrong sits nearby watching the show as Desi and Debbie dance with hockey players to a Nikki Minaj song with Debbie letting loose and having the time of her life  Debbie talks to a hockey player named Jay who is twentyfour and cute making them both laugh  As Graham packs up Pete approaches him and Billie Joe comes over to congratulate Graham before they walk away  Pete sits in the car crying while Debbie drops Desi off at her apartment where Debbie looks shocked and Desi nods  Pete is later on his iPad lying in bed when Debbie comes in to talk her shirt unbuttoned and topless  She exits into the bathroom and after a silence she returns dressed prompting Pete to walk out of the room with Debbie following  Charlotte plays piano in her room alone overhearing Debbie and Pete fighting through the wall leading Debbie to start walking away  The family then lays in bed watching Spongebob Squarepants but the atmosphere is tense as Charlotte licks her fingers pokes Sadie with her wet fingers resulting in Sadie leaving and slamming the door  Charlotte writes a note at her desk walks by Sadie's room and puts the note on the door  Pete sits alone listening to music"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Pete takes a framed item off of his wall and then Larry answers the door where Pete stands with a framed drawing made by John Lennon and hands it to him. Meanwhile Sadie and a bunch of other kids are building sets for a school play and Sadie talks with a friend while Pete and Debbie watch from afar sitting next to each other. Debbie tries to gently break the news feeling totally deflated and then she walks through the campus upset. She sees a kid darts over to him and encounters Joseph the kid who insulted Sadie on her Facebook. Debbie becomes quieter scarier and more confrontational causing Joseph to look upset and then she storms off. Debbie pulls open the door to find Pete on the toilet playing on his iPad. she exits and Pete flips her off after she is gone. Later Debbie and Desi are talking as they walk down the stairs into a loud club where they talk to a group of young men one of whom takes a plate of his teeth out. Desi tries to put them in her mouth and everyone laughs as she looks insane and tries to kiss Debbie. Still laughing she hands the teeth back to their owner who pops them back in to cheers from the crowd. Elsewhere Pete is on stage in a halffilled nightclub watching Graham Parker perform with his band. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. The song resonates with Pete reflecting the issues he is facing and prompting a strong emotional connection. Billie Joe Armstrong sits nearby watching the show as Desi and Debbie dance with hockey players to a Nikki Minaj song with Debbie letting loose and having the time of her life. Debbie talks to a hockey player named Jay who is twentyfour and cute making them both laugh. As Graham packs up Pete approaches him and Billie Joe comes over to congratulate Graham before they walk away. Pete sits in the car crying while Debbie drops Desi off at her apartment where Debbie looks shocked and Desi nods. Pete is later on his iPad lying in bed when Debbie comes in to talk her shirt unbuttoned and topless. She exits into the bathroom and after a silence she returns dressed prompting Pete to walk out of the room with Debbie following. Charlotte plays piano in her room alone overhearing Debbie and Pete fighting through the wall leading Debbie to start walking away. The family then lays in bed watching Spongebob Squarepants but the atmosphere is tense as Charlotte licks her fingers pokes Sadie with her wet fingers resulting in Sadie leaving and slamming the door. Charlotte writes a note at her desk walks by Sadie's room and puts the note on the door. Pete sits alone listening to music."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Pete takes a framed item off of his wall and then Larry answers the door where Pete stands with a framed drawing made by John Lennon and hands it to him. Meanwhile Sadie and a bunch of other kids are building sets for a school play and Sadie talks with a friend while Pete and Debbie watch from afar sitting next to each other. Debbie tries to gently break the news feeling totally deflated and then she walks through the campus upset. She sees a kid darts over to him and encounters Joseph the kid who insulted Sadie on her Facebook. Debbie becomes quieter scarier and more confrontational causing Joseph to look upset and then she storms off. Debbie pulls open the door to find Pete on the toilet playing on his iPad. she exits and Pete flips her off after she is gone. Later Debbie and Desi are talking as they walk down the stairs into a loud club where they talk to a group of young men one of whom takes a plate of his teeth out. Desi tries to put them in her mouth and everyone laughs as she looks insane and tries to kiss Debbie. Still laughing she hands the teeth back to their owner who pops them back in to cheers from the crowd. Elsewhere Pete is on stage in a halffilled nightclub watching Graham Parker perform with his band. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. The song resonates with Pete reflecting the issues he is facing and prompting a strong emotional connection. Billie Joe Armstrong sits nearby watching the show as Desi and Debbie dance with hockey players to a Nikki Minaj song with Debbie letting loose and having the time of her life. Debbie talks to a hockey player named Jay who is twentyfour and cute making them both laugh. As Graham packs up Pete approaches him and Billie Joe comes over to congratulate Graham before they walk away. Pete sits in the car crying while Debbie drops Desi off at her apartment where Debbie looks shocked and Desi nods. Pete is later on his iPad lying in bed when Debbie comes in to talk her shirt unbuttoned and topless. She exits into the bathroom and after a silence she returns dressed prompting Pete to walk out of the room with Debbie following. Charlotte plays piano in her room alone overhearing Debbie and Pete fighting through the wall leading Debbie to start walking away. The family then lays in bed watching Spongebob Squarepants but the atmosphere is tense as Charlotte licks her fingers pokes Sadie with her wet fingers resulting in Sadie leaving and slamming the door. Charlotte writes a note at her desk walks by Sadie's room and puts the note on the door. Pete sits alone listening to music."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Pete takes a framed item off of his wall and then Larry answers the door where Pete stands with a framed drawing made by John Lennon and hands it to him. Meanwhile Sadie and a bunch of other kids are building sets for a school play and Sadie talks with a friend while Pete and Debbie watch from afar sitting next to each other. Debbie tries to gently break the news feeling totally deflated and then she walks through the campus upset. She sees a kid darts over to him and encounters Joseph the kid who insulted Sadie on her Facebook. Debbie becomes quieter scarier and more confrontational causing Joseph to look upset and then she storms off. Debbie pulls open the door to find Pete on the toilet playing on his iPad. She exits into the bathroom and after a silence she returns dressed prompting Pete to walk out of the room with Debbie following. Charlotte plays piano in her room alone overhearing Debbie and Pete fighting through the wall leading Debbie to start walking away. The family then lays in bed watching Spongebob Squarepants but the atmosphere is tense as Charlotte licks her fingers pokes Sadie with her wet fingers resulting in Sadie leaving and slamming the door. Charlotte writes a note at her desk walks by Sadie's room and puts the note on the door. Pete sits alone listening to music."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Pete takes a framed item off of his wall and then Larry answers the door where Pete stands with a framed drawing made by John Lennon and hands it to him. Meanwhile Sadie and a bunch of other kids are building sets for a school play and Sadie talks with a friend while Pete and Debbie watch from afar sitting next to each other. Debbie tries to gently break the news feeling totally deflated and then she walks through the campus upset. Charlotte writes a note at her desk walks by Sadie's room and puts the note on the door. Pete sits alone listening to music."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Steve takes a framed item off of his wall, and then Tom answers the door, where Steve stands with a framed drawing made by John Lennon and hands it to him. Meanwhile, Max and a bunch of other kids are building sets for a school play, and Max talks with a friend while Steve and Nora watch from afar, sitting next to each other. Nora tries to gently break the news, feeling totally deflated, and then she walks through the campus upset. She sees a kid, darts over to him, and encounters Michael, the kid who insulted Max on her Facebook. Nora becomes quieter, scarier, and more confrontational, causing Michael to look upset, and then she storms off. Nora pulls open the door to find Steve on the toilet playing on his iPad; she exits, and Steve flips her off after she's gone. Later, Nora and Emma are talking as they walk down the stairs into a loud club, where they talk to a group of young men, one of whom takes a plate of his teeth out. Emma tries to put them in her mouth, and everyone laughs, as she looks insane and tries to kiss Nora. Still laughing, she hands the teeth back to their owner, who pops them back in to cheers from the crowd. Elsewhere, Steve is on stage in a half-filled nightclub, watching Graham Parker perform with his band. The song resonates with Steve, reflecting the issues he is facing and prompting a strong emotional connection. Jack White sits nearby, watching the show as Emma and Nora dance with hockey players to a Nikki Minaj song, with Nora letting loose and having the time of her life. Nora talks to a hockey player named Sam, who is twenty-four and cute, making them both laugh. As Graham packs up, Steve approaches him, and Jack comes over to congratulate Graham before they walk away. Steve sits in the car, crying while Nora drops Emma off at her apartment, where Nora looks shocked, and Emma nods. Steve is later on his iPad, lying in bed when Nora comes in to talk, her shirt unbuttoned and topless. She exits into the bathroom, and after a silence, she returns dressed, prompting Steve to walk out of the room, with Nora following. Lily plays piano in her room alone, overhearing Nora and Steve fighting through the wall, leading Nora to start walking away. The family then lays in bed watching Spongebob Squarepants, but the atmosphere is tense as Lily licks her fingers, pokes Max with her wet fingers, resulting in Max leaving and slamming the door. Lily writes a note at her desk, walks by Max's room, and puts the note on the door. Steve sits alone, listening to music."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Pete takes a canvas item off of his ceiling, and then Larry answers the gate, where Pete stands with a framed sculpture made by Pablo Picasso and hands it to him. Meanwhile, Sadie and a bunch of other kids are building sculptures for a school exhibition, and Sadie talks with a friend while Pete and Debbie watch from afar, sitting next to each other. Debbie tries to gently break the news, feeling totally deflated, and then she walks through the garden upset. She sees a dog, darts over to him, and encounters Joseph, the dog who insulted Sadie on her Instagram. Debbie becomes quieter, scarier, and more confrontational, causing Joseph to look upset, and then she storms off. Debbie pulls open the curtain to find Pete on the couch playing on his Game Boy; she exits, and Pete flips her off after she's gone. Later, Debbie and Desi are talking as they walk down the escalator into a loud restaurant, where they talk to a group of young women, one of whom takes a lens of his glasses out. Desi tries to put it in her eye, and everyone laughs, as she looks insane and tries to kiss Debbie. Still laughing, she hands the lens back to its owner, who pops it back in to cheers from the crowd. Elsewhere, Pete is on stage in a half-filled arena, watching Graham Parker perform with his chorus. The song resonates with Pete, reflecting the issues he is facing and prompting a strong emotional connection. Billie Joe Armstrong sits nearby, watching the show as Desi and Debbie dance with rugby players to a Taylor Swift song, with Debbie letting loose and having the time of her life. Debbie talks to a rugby player named Jay, who is twenty-four and cute, making them both laugh. As Graham packs up, Pete approaches him, and Billie Joe comes over to congratulate Graham before they walk away. Pete sits in the vehicle, crying while Debbie drops Desi off at her house, where Debbie looks shocked, and Desi nods. Pete is later on his Game Boy, lying in bed when Debbie comes in to talk, her hair unbuttoned and topless. She exits into the shower, and after a silence, she returns dressed, prompting Pete to walk out of the room, with Debbie following. Charlotte plays violin in her room alone, overhearing Debbie and Pete fighting through the floor, leading Debbie to start walking away. The family then lays in bed watching Adventure Time, but the atmosphere is tense as Charlotte licks her spoon, pokes Sadie with her wet spoon, resulting in Sadie leaving and slamming the window. Charlotte writes a poem at her table, walks by Sadie's closet, and puts the poem on the door. Pete sits alone, listening to podcasts."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Pete hurls a framed item off of his wall, and then Larry shuts the door, where Pete kneels with a framed drawing made by John Lennon and drops it into his hands. Meanwhile, Sadie and a bunch of other kids are dismantling sets for a school play, and Sadie debates with a friend while Pete and Debbie spy from afar, squatting next to each other. Debbie attempts to quietly deliver the news, feeling utterly energized, and then she jogs through the campus cheerful. She notices a kid, skates over to him, and stumbles upon Joseph, the kid who praised Sadie on her Facebook. Debbie becomes louder, gentler, and more tender, causing Joseph to look relieved, and then she sprints off. Debbie slams open the door to find Pete on the toilet sketching on his iPad; she chuckles, and Pete waves her off after she's gone. Later, Debbie and Desi are laughing as they skip down the stairs into a quiet club, where they shout to a group of young men, one of whom pulls a pen out of his pocket. Desi tries to doodle on her arm, and everyone gasps, as she looks ridiculous and pretends to hug Debbie. Still amused, she tosses the pen back to the owner, who stuffs it back in to applause from the crowd. Nearby, Pete is seated in a packed nightclub, sketching Graham Parker perform with his band. The song irritates Pete, mirroring the triumphs he is dismissing and prompting a weak emotional detachment. Billie Joe Armstrong stands nearby, ignoring the show as Desi and Debbie sleep with hockey players to a Nikki Minaj song, with Debbie remaining reserved and having a quiet time. Debbie jokes with a hockey player named Jay, who is twenty-four and grumpy, making them both look confused. As Graham sets up, Pete ignores him, and Billie Joe steps over to criticize Graham before they run away. Pete stands in the car, chuckling while Debbie picks Desi up from her apartment, where Debbie looks amused, and Desi winks. Pete is later doodling on his iPad, sitting on the floor when Debbie comes in to whisper, her shirt ironed and spotless. She enters the bathroom, and after a laugh, she reappears undressed, prompting Pete to rush into the room, with Debbie hesitating. Charlotte dances in her room alone, overhearing Debbie and Pete laughing through the wall, leading Debbie to start skipping away. The family then jumps in bed watching Spongebob Squarepants, but the atmosphere is lively as Charlotte claps her hands, pokes Sadie with her dry fingers, resulting in Sadie grinning and closing the door. Charlotte scribbles a picture at her desk, runs by Sadie's room, and tapes the picture on the door. Pete sings alone, composing music."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Mitchell takes a woven basket off of his table, and then Gary answers the elevator, where Mitchell stands with a woven scarf made by David Bowie and hands it to it. Meanwhile, Clara and a bunch of other raccoons are building statues for a community concert, and Clara talks with a neighbor while Mitchell and Elaine watch from afar, sitting next to each other. Elaine tries to gently break the news, feeling totally deflated, and then she walks through the airport upset. She sees a monkey, darts over to it, and encounters Martin, the monkey who insulted Clara on her Instagram. Elaine becomes quieter, scarier, and more confrontational, causing Martin to look upset, and then she storms off. Elaine pulls open the window to find Mitchell on the hammock playing on his laptop; she exits, and Mitchell flips it off after she's gone. Later, Elaine and Chloe are talking as they walk down the escalator into a quiet library, where they talk to a group of elderly women, one of whom takes a shoe off his head. Chloe tries to put it on her foot, and everyone laughs, as she looks insane and tries to kiss Elaine. Still laughing, she hands the shoe back to their owner, who pops it back on to cheers from the audience. Elsewhere, Mitchell is on a rooftop in a half-filled cinema, watching Elvis Presley perform with his orchestra. The song resonates with Mitchell, reflecting the challenges he is facing and prompting a strong emotional connection. Mick Jagger sits nearby, watching the act as Chloe and Elaine dance with magicians to a Taylor Swift song, with Elaine letting loose and having the time of her life. Elaine talks to a magician named Max, who is twenty-four and charming, making them both laugh. As Elvis packs up, Mitchell approaches him, and Mick Jagger comes over to congratulate Elvis before they walk away. Mitchell sits in the train, crying while Elaine drops Chloe off at her mansion, where Elaine looks shocked, and Chloe nods. Mitchell is later on his laptop, lying in bed when Elaine comes in to talk, her jacket unbuttoned and barefoot. She exits into the shower, and after a silence, she returns dressed, prompting Mitchell to walk out of the cabin, with Elaine following. Sophie plays guitar in her room alone, overhearing Elaine and Mitchell arguing through the wall, leading Elaine to start walking away. The family then lays in bed watching Tom and Jerry, but the atmosphere is tense as Sophie licks her fingers, pokes Clara with her wet fingers, resulting in Clara leaving and slamming the window. Sophie writes a message at her table, walks by Clara's room, and puts the message on the window. Mitchell sits alone, listening to podcasts."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Rick removes a framed artifact from his wall, and then Mona welcomes the visitor, where Rick stands with a framed illustration created by Elvis Presley and gives it to her. Meanwhile, Jessie and a bunch of other animals are assembling costumes for a community event, and Jessie chats with a companion while Rick and Nancy observe from afar, situated beside one another. Nancy attempts to subtly deliver the information, feeling utterly defeated, and then she strolls through the marketplace distressed. She notices a dog, dashes over to it, and confronts Michael, the dog who barked at Jessie on her Instagram. Nancy becomes softer, calmer, and more inquisitive, causing Michael to appear baffled, and then she strides away. Nancy swings open the gate to find Rick on the hammock reading on his tablet; she departs, and Rick waves goodbye after she's out of sight. Subsequently, Nancy and Daryl are conversing as they descend the hill into a bustling bazaar, where they converse with a cluster of teenagers, one of whom removes a pair of earbuds. Daryl attempts to place them in her ears, and everyone chuckles, as she appears bizarre and attempts to hug Nancy. Still chuckling, she returns the earbuds to their owner, who inserts them back in to applause from the crowd. Elsewhere, Rick is backstage at a sparsely attended concert hall, observing Bob Dylan perform with his ensemble. The tune connects with Rick, mirroring the dilemmas he is experiencing and inciting a profound emotional response. Paul McCartney sits nearby, observing the performance as Daryl and Nancy sway with surfers to a Rihanna song, with Nancy letting go and enjoying herself immensely. Nancy converses with a surfer named Max, who is twenty-four and handsome, causing them both to chuckle. As Bob packs up, Rick approaches him, and Paul McCartney comes over to commend Bob before they amble away. Rick sits in the vehicle, weeping while Nancy drops Daryl at her home, where Nancy appears astonished, and Daryl agrees. Rick is eventually on his tablet, reclining in bed when Nancy enters to chat, her blouse unbuttoned and topless. She retreats into the washroom, and after a pause, she returns clothed, prompting Rick to depart from the chamber, with Nancy trailing. Gabriel plays guitar in his room alone, overhearing Nancy and Rick debating through the barrier, leading Nancy to start wandering off. The family then sprawls in bed watching Tom and Jerry, but the ambiance is strained as Gabriel nibbles his nails, pricks Jessie with his damp nails, resulting in Jessie departing and slamming the entrance. Gabriel drafts a letter at his desk, strides by Jessie's room, and attaches the letter to the door. Rick sits alone, listening to podcasts."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Pete removes a framed vegetable from his countertop, and then Larry beckons the window, where Pete stands with a framed sculpture crafted by John Lennon and tosses it to him. Meanwhile, Sadie and a swarm of other dogs are sculpting models for a school concert, and Sadie whispers with a neighbor while Pete and Debbie gaze from afar, lounging beside each other. Debbie attempts to subtly deliver the announcement, feeling utterly inflated, and then she leaps through the auditorium cheerful. She spots a hamster, glides over to him, and confronts Joseph, the hamster who praised Sadie on her Twitter. Debbie becomes louder, friendlier, and more diplomatic, causing Joseph to look delighted, and then she tiptoes away. Debbie slides open the window to find Pete in the bathtub knitting on his iPad; she enters, and Pete waves at her after she's gone. Later, Debbie and Desi are laughing as they dance up the escalator into a quiet library, where they whisper to a crowd of old women, one of whom removes a belt of his shoes out. Desi tries to wear them on her ears, and everyone cries, as she looks serene and tries to hug Debbie. Still crying, she hands the shoes back to their owner, who kicks them back on to applause from the audience. Elsewhere, Pete is backstage in a packed concert hall, observing Graham Parker paint with his band. The artwork resonates with Pete, reflecting the joys he is experiencing and prompting a strong intellectual connection. Billie Joe Armstrong naps nearby, observing the art as Desi and Debbie float with soccer players to a Taylor Swift poem, with Debbie holding back and having the calm of her life. Debbie whispers to a soccer player named Jay, who is seventy-two and grumpy, making them both yawn. As Graham unrolls his canvases, Pete cheers him, and Billie Joe rolls over to congratulate Graham before they hop away. Pete kneels in the hammock, laughing while Debbie picks Desi up at her mansion, where Debbie looks amused, and Desi hums. Pete is later on his iPad, standing in the shower when Debbie crawls in to sing, her hat tilted and backwards. She returns to the patio, and after a silence, she reenters dressed, prompting Pete to march out of the garden, with Debbie trailing. Charlotte plays drums in her kitchen alone, overhearing Debbie and Pete singing through the ceiling, leading Debbie to start jumping away. The family then lounges in the kitchen watching Tom and Jerry, but the atmosphere is cheerful as Charlotte claps her hands, hugs Sadie with her dry thumbs, resulting in Sadie staying and laughing loudly. Charlotte draws a map at her table, flies by Sadie's window, and tapes the map on the ceiling. Pete kneels together, reading to music."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Rufus picks a dusty relic off of his shelf, and then Marvin unlocks the portal, where Rufus waits with a dusty portrait painted by Elvis Presley and tosses it to him. Meanwhile, Clara and a swarm of other goats are crafting shields for a parade float, and Clara whispers with an acquaintance while Rufus and Betty spy from a hilltop, crouching beside one another. Betty attempts to gently spill the secret, feeling completely deflated, and then she trudges through the forest flustered. She spots a goat, dashes over to it, and stumbles upon Oliver, the goat who mocked Clara in her journal. Betty becomes quieter, eerier, and more aggressive, causing Oliver to feel uneasy, and then she stomps off. Betty slides open the curtain to find Rufus on the sofa sketching on his sketchpad; she departs, and Rufus salutes her after she's vanished. Later, Betty and Tori are chatting as they float down the branch into a crowded cave, where they converse with a pack of young wolves, one of whom extracts a slab of his scales out. Tori tries to slip them on her face, and everyone howls, as she appears bonkers and tries to lick Betty. Still chuckling, she returns the scales to their keeper, who secures them back in with applause from the wolves. Far away, Rufus is on a platform in an empty tavern, observing Elton John jam with his crew. The tune harmonizes with Rufus, echoing the dilemmas he is confronting and inducing a fierce sentimental bond. Paul McCartney perches nearby, observing the gig as Tori and Betty sway with soccer players to a Taylor Swift tune, with Betty letting loose and basking in her euphoria. Betty chats to a soccer player named Luke, who is thirty-two and charming, causing them both to giggle. As Elton packs up, Rufus greets him, and Paul McCartney strolls over to laud Elton before they amble away. Rufus reclines in the carriage, sobbing while Betty drops Tori off at her shack, where Betty looks startled, and Tori winks. Rufus is later on his sketchpad, sprawled in the meadow when Betty enters to chat, her jacket unbuttoned and bare. She vanishes into the bush, and after a pause, she reemerges dressed, prompting Rufus to stroll out of the clearing, with Betty trailing. Daphne strums a banjo in her den alone, overhearing Betty and Rufus quarreling through the foliage, leading Betty to start wandering away. The herd then huddles in the hammock watching Bugs Bunny, but the ambiance is uneasy as Daphne snaps her fingers, nudges Clara with her damp fingers, resulting in Clara departing and slamming the portal. Daphne scribbles a message at her podium, strolls by Clara's den, and affixes the message to the portal. Rufus lounges alone, humming to himself."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Pete takes a framed drawing by John Lennon off his wall and gives it to Larry. Meanwhile, Sadie and other kids build sets for a school play while Pete and Debbie watch. Debbie feels deflated and upset, confronting Joseph, a kid who insulted Sadie online, and then storms off. She finds Pete on the toilet and leaves. Later, Debbie and Desi enter a loud club, where they talk to young men; Desi tries on fake teeth, causing laughter. Pete watches Graham Parker perform, resonating with his issues, while Billie Joe Armstrong watches too. Debbie dances with hockey players, enjoying herself, and talks to a young player, Jay. Afterward, Pete sits crying in his car, and Debbie looks shocked after dropping off Desi. Pete and Debbie's tension carries over as Charlotte overhears their fight and later writes a note for Sadie. The family lies in bed tensely watching Spongebob, resulting in Sadie leaving in frustration. Charlotte leaves a note on Sadie's door, while Pete sits alone, listening to music."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Pete sits alone listening to music Charlotte writes a note at her desk walks by Sadie's room and puts the note on the door  The family then lays in bed watching Spongebob Squarepants but the atmosphere is tense as Charlotte licks her fingers pokes Sadie with her wet fingers resulting in Sadie leaving and slamming the door  Charlotte plays piano in her room alone overhearing Debbie and Pete fighting through the wall leading Debbie to start walking away  She exits into the bathroom and after a silence she returns dressed prompting Pete to walk out of the room with Debbie following  Pete is later on his iPad lying in bed when Debbie comes in to talk her shirt unbuttoned and topless  Pete sits in the car crying while Debbie drops Desi off at her apartment where Debbie looks shocked and Desi nods  As Graham packs up Pete approaches him and Billie Joe comes over to congratulate Graham before they walk away  Debbie talks to a hockey player named Jay who is twentyfour and cute making them both laugh  Billie Joe Armstrong sits nearby watching the show as Desi and Debbie dance with hockey players to a Nikki Minaj song with Debbie letting loose and having the time of her life  The song resonates with Pete reflecting the issues he is facing and prompting a strong emotional connection  Elsewhere Pete is on stage in a halffilled nightclub watching Graham Parker perform with his band  Still laughing she hands the teeth back to their owner who pops them back in to cheers from the crowd  Desi tries to put them in her mouth and everyone laughs as she looks insane and tries to kiss Debbie  Later Debbie and Desi are talking as they walk down the stairs into a loud club where they talk to a group of young men one of whom takes a plate of his teeth out  she exits and Pete flips her off after she's gone  Debbie pulls open the door to find Pete on the toilet playing on his iPad  Debbie becomes quieter scarier and more confrontational causing Joseph to look upset and then she storms off  She sees a kid darts over to him and encounters Joseph the kid who insulted Sadie on her Facebook  Debbie tries to gently break the news feeling totally deflated and then she walks through the campus upset  Meanwhile Sadie and a bunch of other kids are building sets for a school play and Sadie talks with a friend while Pete and Debbie watch from afar sitting next to each other  Pete takes a framed item off of his wall and then Larry answers the door where Pete stands with a framed drawing made by John Lennon and hands it to him "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Still laughing she hands the teeth back to their owner who pops them back in to cheers from the crowd  She sees a kid darts over to him and encounters Joseph the kid who insulted Sadie on her Facebook  Elsewhere Pete is on stage in a halffilled nightclub watching Graham Parker perform with his band  Pete is later on his iPad lying in bed when Debbie comes in to talk her shirt unbuttoned and topless  Pete sits in the car crying while Debbie drops Desi off at her apartment where Debbie looks shocked and Desi nods  Charlotte plays piano in her room alone overhearing Debbie and Pete fighting through the wall leading Debbie to start walking away  Meanwhile Sadie and a bunch of other kids are building sets for a school play and Sadie talks with a friend while Pete and Debbie watch from afar sitting next to each other  The family then lays in bed watching Spongebob Squarepants but the atmosphere is tense as Charlotte licks her fingers pokes Sadie with her wet fingers resulting in Sadie leaving and slamming the door  Debbie becomes quieter scarier and more confrontational causing Joseph to look upset and then she storms off  Debbie pulls open the door to find Pete on the toilet playing on his iPad  she exits and Pete flips her off after she's gone  The song resonates with Pete reflecting the issues he is facing and prompting a strong emotional connection  Debbie tries to gently break the news feeling totally deflated and then she walks through the campus upset  Pete sits alone listening to music Billie Joe Armstrong sits nearby watching the show as Desi and Debbie dance with hockey players to a Nikki Minaj song with Debbie letting loose and having the time of her life  Pete takes a framed item off of his wall and then Larry answers the door where Pete stands with a framed drawing made by John Lennon and hands it to him  Desi tries to put them in her mouth and everyone laughs as she looks insane and tries to kiss Debbie  As Graham packs up Pete approaches him and Billie Joe comes over to congratulate Graham before they walk away  Later Debbie and Desi are talking as they walk down the stairs into a loud club where they talk to a group of young men one of whom takes a plate of his teeth out  Debbie talks to a hockey player named Jay who is twentyfour and cute making them both laugh  She exits into the bathroom and after a silence she returns dressed prompting Pete to walk out of the room with Debbie following  Charlotte writes a note at her desk walks by Sadie's room and puts the note on the door "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The song resonates with Pete reflecting the issues he is facing and prompting a strong emotional connection  Billie Joe Armstrong sits nearby watching the show as Desi and Debbie dance with hockey players to a Nikki Minaj song with Debbie letting loose and having the time of her life  Debbie talks to a hockey player named Jay who is twentyfour and cute making them both laugh  As Graham packs up Pete approaches him and Billie Joe comes over to congratulate Graham before they walk away  Pete sits in the car crying while Debbie drops Desi off at her apartment where Debbie looks shocked and Desi nods  Pete is later on his iPad lying in bed when Debbie comes in to talk her shirt unbuttoned and topless  She exits into the bathroom and after a silence she returns dressed prompting Pete to walk out of the room with Debbie following  Charlotte plays piano in her room alone overhearing Debbie and Pete fighting through the wall leading Debbie to start walking away  The family then lays in bed watching Spongebob Squarepants but the atmosphere is tense as Charlotte licks her fingers pokes Sadie with her wet fingers resulting in Sadie leaving and slamming the door  Charlotte writes a note at her desk walks by Sadie's room and puts the note on the door  Pete sits alone listening to music Pete takes a framed item off of his wall and then Larry answers the door where Pete stands with a framed drawing made by John Lennon and hands it to him  Meanwhile Sadie and a bunch of other kids are building sets for a school play and Sadie talks with a friend while Pete and Debbie watch from afar sitting next to each other  Debbie tries to gently break the news feeling totally deflated and then she walks through the campus upset  She sees a kid darts over to him and encounters Joseph the kid who insulted Sadie on her Facebook  Debbie becomes quieter scarier and more confrontational causing Joseph to look upset and then she storms off  Debbie pulls open the door to find Pete on the toilet playing on his iPad  she exits and Pete flips her off after she's gone  Later Debbie and Desi are talking as they walk down the stairs into a loud club where they talk to a group of young men one of whom takes a plate of his teeth out  Desi tries to put them in her mouth and everyone laughs as she looks insane and tries to kiss Debbie  Still laughing she hands the teeth back to their owner who pops them back in to cheers from the crowd  Elsewhere Pete is on stage in a halffilled nightclub watching Graham Parker perform with his band "
        }
      ]
    }
  ]
}