{
  "ground_truth": "Harry frees Ron, and as Cedric and Cho emerge to a cheering crowd, Viktor and Hermione follow with chants of 'Krum, Krum, Krum' from the onlookers. The Beauxbatons girls appear worried, and Harry notices the blonde girl that Fleur could not rescue. He loosens the rope binding her and heads for the surface with both Ron and the girl. Attacked and held down, Harry pushes Ron and the girl upwards. They surface, coughing but safe, receiving help from a Beauxbatons girl. Underwater, Harry propels himself to the surface with a spell, bursting out onto the decking amidst the crowd. Fleur, Hermione, and even Fleur again, shower Harry with kisses, while Cedric and his friends cheer. As they walk away from the lake, Harry's friends continue cheering him on. Barty Crouch waits for Harry, and Mad-Eye approaches them, after which Barty walks away. Harry experiences pain in his head and sees Barty Crouch lying lifeless on the ground. Mad-Eye points to a door, which Harry enters, and he is left alone in the room. Harry reaches into a snack bowl, retrieves a handful, and it transforms into a small, biting creature. The man next to Dumbledore speaks, and Dumbledore shakes his hand; their handshake passes through Harry, who seems ghostly and without presence. A cage rises from the floor as proceedings begin, and Igor protests loudly, with Barty hitting the gavel repeatedly. Barty Crouch junior attempts to run and is zapped by Mad-Eye, falling into the court's center amidst an uproar. Guards seize Barty junior, as Dumbledore extracts a quivering string of magic from his head. The door opens to reveal Harry watching; Igor leaves, and Severus shuts the door in Harry's face. The champions emerge, greeted by crowd cheers and excitement from the Bulgarian crowd. As a cannon fires and Mr. Filch shrugs comically, Dumbledore groans, and Harry and Cedric enter the maze through separate entrances, which close behind them. The maze, tall and enveloped in heavy mist, confronts Cedric with closing walls, prompting him to run. Fleur, running scared, is attacked and knocked down, and Viktor finds her unconscious before continuing on. Harry sees Fleur being swallowed by undergrowth but arrives too late to help, so he sends up a red spark. A heavy wind starts blowing, and as walls close in, Harry runs.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Harry releases Ron, and as Cedric and Cho appear to a jubilant crowd, Viktor and Hermione follow with chants of 'Krum, Krum, Krum' from the spectators. The Beauxbatons girls seem anxious, and Harry observes the fair-haired girl that Fleur could not save. He loosens the cord binding her and heads for the surface with both Ron and the girl. Assaulted and restrained, Harry pushes Ron and the girl upward. They emerge, choking but secure, receiving aid from a Beauxbatons girl. Submerged, Harry propels himself to the surface with a charm, bursting out onto the platform amidst the crowd. Fleur, Hermione, and even Fleur again, shower Harry with kisses, while Cedric and his companions cheer. As they depart from the lake, Harry's friends continue applauding him. Barty Crouch waits for Harry, and Mad-Eye approaches them, after which Barty walks away. Harry experiences agony in his head and sees Barty Crouch lying motionless on the ground. Mad-Eye points to a door, which Harry enters, and he is left alone in the room. Harry reaches into a snack bowl, retrieves a handful, and it transforms into a small, biting creature. The man next to Dumbledore speaks, and Dumbledore shakes his hand; their handshake passes through Harry, who seems spectral and without presence. A cage ascends from the floor as proceedings begin, and Igor protests vociferously, with Barty striking the gavel repeatedly. Barty Crouch junior attempts to escape and is zapped by Mad-Eye, collapsing into the court's center amidst an uproar. Guards seize Barty junior, as Dumbledore extracts a trembling strand of magic from his head. The door opens to reveal Harry watching; Igor exits, and Severus shuts the door in Harry's face. The champions emerge, greeted by crowd cheers and excitement from the Bulgarian spectators. As a cannon fires and Mr. Filch shrugs comically, Dumbledore groans, and Harry and Cedric enter the maze through separate entrances, which close behind them. The maze, towering and enveloped in dense mist, confronts Cedric with closing walls, prompting him to sprint. Fleur, running frightened, is assaulted and knocked down, and Viktor finds her unconscious before moving on. Harry sees Fleur being engulfed by undergrowth but arrives too late to assist, so he sends up a red spark. A strong wind starts blowing, and as walls close in, Harry runs."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Ron is freed by Harry, and as Cedric and Cho are seen emerging to a cheering crowd, they are followed by Viktor and Hermione, with chants of 'Krum, Krum, Krum' echoing from the onlookers. A worried appearance is shown by the Beauxbatons girls, and the blonde girl that Fleur could not rescue is noticed by Harry. The rope binding her is loosened by him, and with both Ron and the girl, he heads for the surface. Harry is attacked and held down, but he pushes Ron and the girl upwards. They are helped by a Beauxbatons girl after they surface, coughing but safe. By using a spell, Harry propels himself to the surface, bursting out onto the decking amidst the crowd. Harry is kissed by Fleur, Hermione, and even Fleur again, while cheers are given by Cedric and his friends. As the group walks away from the lake, Harry is continued to be cheered on by his friends. Harry is waited for by Barty Crouch, and Mad-Eye approaches them, after which Barty walks away. Pain is experienced in Harry's head, and Barty Crouch is seen lying lifeless on the ground by him. A door is pointed to by Mad-Eye, and Harry enters it, being left alone in the room. Into a snack bowl, Harry reaches and retrieves a handful, which transforms into a small, biting creature. The man next to Dumbledore speaks, and Dumbledore's hand is shaken; their handshake passes through Harry, making him seem ghostly and without presence. A cage rises from the floor as proceedings begin, and loud protests are made by Igor, with the gavel being hit repeatedly by Barty. Mad-Eye zaps Barty Crouch junior as he attempts to run, and he falls into the court's center amidst an uproar. Barty junior is seized by guards, while a quivering string of magic is extracted from his head by Dumbledore. The door opens to reveal Harry watching; Igor leaves, and the door is shut in Harry's face by Severus. The champions are greeted by the cheers and excitement of the Bulgarian crowd as they emerge. As a cannon fires and Mr. Filch shrugs comically, a groan is let out by Dumbledore, and Cedric and Harry enter the maze through separate entrances, which close behind them. Cedric is confronted by the tall maze, enveloped in heavy mist, with closing walls prompting him to run. Fleur, scared and running, is knocked down after being attacked, and she is found unconscious by Viktor before he continues on. Fleur is seen by Harry being swallowed by undergrowth, but help arrives too late, so he sends up a red spark. A heavy wind begins to blow, and he runs as walls close in."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Harry frees Ron, and Cedric and Cho emerge to cheers, followed by Viktor and Hermione with chants of 'Krum, Krum, Krum.' The Beauxbatons girls seem worried, and Harry sees the blonde girl Fleur couldn't save. He unties her and heads to the surface with Ron and the girl. Attacked, Harry pushes them up, and they surface safely with help from a Beauxbatons girl. Harry uses a spell to reach the surface and is celebrated by Fleur, Hermione, and Cedric. Walking from the lake, his friends cheer. Barty Crouch waits for Harry, Mad-Eye joins them, then Barty leaves. Harry feels pain and sees Barty Crouch lifeless. Mad-Eye points to a door Harry enters, leaving him alone. He takes snacks, which turn into small biting creatures. A man speaks to Dumbledore, their handshake passing through ghostly Harry. A cage rises as proceedings begin, Igor protests loudly, Barty hits the gavel, and Barty Crouch junior tries to escape but is zapped by Mad-Eye. Guards seize him as Dumbledore extracts a magic string from his head. The door opens, revealing Harry watching; Igor exits, and Severus closes the door. The champions are greeted by cheering crowds. A cannon fires, Mr. Filch shrugs comically, Dumbledore groans, and Harry and Cedric enter the maze through closing entrances. The misty maze confronts Cedric with closing walls, and he runs. Fleur, scared, is attacked, found unconscious by Viktor, who moves on. Harry sees Fleur swallowed by undergrowth, too late to help, so he sends a red spark. Heavy wind blows, and as walls close in, Harry runs."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Harry frees Ron, and Cedric and Cho emerge to cheers, followed by Viktor and Hermione with chants of 'Krum.' The Beauxbatons girls look worried, and Harry sees the girl Fleur couldn't save. He frees her, heads to the surface with Ron and the girl, and pushes them up when attacked. They emerge safe, aided by a Beauxbatons girl. Harry spells himself to the surface, greeted by a cheering crowd. Fleur, Hermione, and Fleur again kiss Harry while Cedric and friends cheer. Leaving the lake, Harry's friends cheer him. Barty Crouch waits, Mad-Eye approaches, and Barty departs. Harry feels pain and sees Barty Crouch lifeless. Mad-Eye points to a door, Harry enters and is alone. He reaches into a bowl, the snack becomes a biting creature. A man near Dumbledore speaks, their handshake passes through ghostly Harry. A cage rises, Igor protests, and Barty hits the gavel. Barty Crouch junior runs but Mad-Eye zaps him to the court's center. Guards seize him as Dumbledore extracts magic from his head. Harry watches, Igor leaves, Severus shuts the door on him. Champions emerge to crowd cheers, a cannon fires, Mr. Filch shrugs. Dumbledore groans, and Harry and Cedric enter the maze through separate entrances, which close. The tall maze in mist confronts Cedric, forcing him to run. Fleur, frightened, is attacked, and Viktor finds her unconscious. Harry sees Fleur swallowed by undergrowth, sends a red spark, and runs as wind blows and walls close."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Harry, with determination etched on his face, manages to set Ron free. At the same time, Cedric and Cho make their way to the surface, greeted by a cheering and jubilant crowd. Following closely behind them are Viktor and Hermione, accompanied by enthusiastic chants of 'Krum, Krum, Krum' from the excited spectators. The girls from Beauxbatons seem visibly concerned, and Harry's keen eyes catch sight of the blonde girl Fleur was unable to save. Harry swiftly unties the rope that binds her and together, they ascend toward the surface with Ron and the girl in tow. In a sudden, tense moment, Harry is attacked and forced underwater, but he heroically pushes Ron and the girl upwards to safety. They break the surface, coughing but unharmed, and are immediately assisted by a caring Beauxbatons girl. Meanwhile, beneath the water's surface, Harry uses a spell to propel himself upward, bursting out onto the decking amidst the gathered crowd. Fleur, Hermione, and even Fleur once again, in gratitude and relief, shower Harry with kisses, while Cedric and his friends enthusiastically cheer him on.\n\nAs Harry and his friends walk away from the lake, the cheers of encouragement continue to echo around them. Waiting expectantly for Harry is Barty Crouch, and soon Mad-Eye Moody approaches their group, leading to Barty walking away from them. Suddenly, Harry feels a sharp pain in his head and witnesses Barty Crouch lying lifeless on the ground. Mad-Eye points to a nearby door, and Harry, with a sense of foreboding, enters, finding himself alone in a room. Reaching into a snack bowl, he retrieves a handful, which shockingly transforms into a small, biting creature. A man standing next to Dumbledore speaks, and as Dumbledore shakes his hand, their handshake mysteriously passes through Harry, who seems ghostly and devoid of presence. The proceedings take on a more ominous tone as a cage rises from the floor. Igor's protests echo loudly, while Barty relentlessly hits the gavel. Barty Crouch junior attempts a desperate escape but is quickly zapped by Mad-Eye, sending him tumbling into the court's center amid great commotion. Guards swiftly seize Barty junior, as Dumbledore extracts a quivering, ethereal string of magic from his own head. The door opens, revealing Harry watching intently; Igor departs, and Severus shuts the door firmly in Harry's face.\n\nThe champions, eliciting loud cheers and palpable excitement from the Bulgarian crowd, emerge triumphantly. As the cannon fires with resonating loudness, Mr. Filch comically shrugs, causing Dumbledore to groan. Harry and Cedric, each feeling the weight of anticipation, enter the vast, mysterious maze through separate entrances that close ominously behind them. Within the maze, towering and shrouded in dense, heavy mist, Cedric finds himself confronted by closing walls, prompting him to sprint. Fleur, filled with fear, is viciously attacked and knocked to the ground, while Viktor discovers her unconscious form before pressing onwards. Harry arrives just in time to see Fleur being swallowed by the relentless undergrowth, but it's too late for him to assist, so he sends up a red spark in distress. A powerful, heavy wind begins to blow fiercely, and as the walls of the maze start closing in, Harry races forward in a desperate bid to escape."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Harry, with unwavering determination clearly etched on his face, manages to set Ron free from his bindings. At precisely the same moment, Cedric and Cho are making their triumphant way to the surface of the water, where they are greeted by a cheering and jubilant crowd of onlookers. Not far behind them are Viktor and Hermione, making their approach with enthusiastic chants of 'Krum, Krum, Krum' echoing from the excited spectators who are keenly watching the proceedings. The girls from Beauxbatons appear noticeably concerned, and Harry's sharp eyes catch sight of the blonde girl whom Fleur had been unable to rescue. Harry swiftly unties the rope that binds her, and together, they all begin their ascent toward the surface, with Ron and the girl alongside them. In a sudden and tense moment, Harry finds himself attacked and dragged underwater, but with heroic effort, he manages to push Ron and the girl upward to safety. As they break the surface, they are coughing but thankfully unharmed, and a caring Beauxbatons girl immediately assists them. Meanwhile, beneath the water's surface, Harry uses a spell to propel himself upward and bursts out onto the decking amidst the gathered crowd. Fleur, Hermione, and, once again, Fleur in an expression of gratitude and relief, shower Harry with kisses, while Cedric and his friends energetically cheer him on.\n\nAs Harry and his friends begin to walk away from the lake, the echoes of cheers and encouragement continue to reverberate all around them. Waiting expectantly for Harry's arrival is Barty Crouch, and soon Mad-Eye Moody approaches their group, prompting Barty to walk away from them. Suddenly, Harry experiences a sharp pain in his head and witnesses Barty Crouch in a lifeless state on the ground. Mad-Eye gestures toward a nearby door, and Harry, filled with a sense of foreboding, enters to find himself alone in a room. Reaching into a bowl filled with snacks, he grabs a handful, only to be shocked as they transform into small, biting creatures. A man standing next to Dumbledore speaks, and as Dumbledore reaches out to shake his hand, their handshake mysteriously passes through Harry, who seems ghostly and devoid of presence. The proceedings take on an ominous tone as a cage rises from the floor. Igor's protests echo loudly in the room, while Barty relentlessly strikes the gavel. Barty Crouch junior attempts a desperate escape but is swiftly zapped by Mad-Eye, sending him tumbling into the court's center amid great commotion. Guards quickly seize Barty junior, as Dumbledore extracts a quivering, ethereal string of magic from his own head. The door opens to reveal Harry watching intently; Igor departs, and Severus shuts the door firmly in Harry's face.\n\nThe champions emerge triumphantly, eliciting loud cheers and palpable excitement from the enthusiastic Bulgarian crowd. As the cannon fires with resonating loudness, Mr. Filch comically shrugs in response, causing Dumbledore to groan in exasperation. Harry and Cedric, each feeling the heavy weight of anticipation, enter the vast and mysterious maze through separate entrances that close ominously behind them. Within the maze, which is towering and shrouded in dense, heavy mist, Cedric finds himself confronted by walls that are closing in on him, prompting him to sprint forward. Fleur, filled with fear, is viciously attacked and knocked to the ground, while Viktor discovers her unconscious form before deciding to press onwards. Harry arrives just in time to see Fleur being swallowed by the relentless undergrowth, but it's too late for him to assist, so he sends up a red spark in a distress signal. A powerful, heavy wind begins to blow fiercely through the maze, and as the walls of the maze start closing in on him, Harry races forward in a desperate bid to escape."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Harry carefully releases Ron from his bindings and, as Cedric and Cho emerge to an enthusiastic and cheering crowd, Viktor and Hermione follow closely behind, with the crowd chanting 'Krum, Krum, Krum' in unison. The Beauxbatons girls appear visibly anxious, and Harry's gaze lands on the blonde girl whom Fleur was unable to save. With determined focus, he loosens the rope that binds her, securing both Ron and the girl as he begins his ascent toward the surface. As they are attacked and he is held down, Harry musters the strength to push both Ron and the girl upward, ensuring they reach safety. Breaking through the water's surface, they gasp for air, coughing but unharmed, as they are aided by a nearby Beauxbatons girl. Meanwhile, Harry uses a spell to propel himself through the water, launching himself onto the decking amidst the throng of onlookers. Fleur and Hermione each express their gratitude by showering him with kisses, and Fleur repeats her gesture, while Cedric and his friends join in with cheers of support. As they depart from the lakeside, Harry finds his friends keeping the cheers coming, providing a buoyant atmosphere. Barty Crouch stands waiting for Harry, and as Mad-Eye Moody approaches them, Barty retreats. Suddenly, Harry is struck by a sharp pain in his head, and his vision blurs to reveal Barty Crouch lying motionless on the ground. Mad-Eye directs Harry toward a door, which Harry proceeds to open and enter, finding himself alone in a room. He reaches into a bowl meant for snacks and, to his surprise, retrieves a handful that transforms unexpectedly into a small creature that bites him. Next to him, a man speaks to Dumbledore, who proceeds to shake the man's hand, and this cordial gesture eerily passes through Harry as if he is merely an apparition, without any real presence. Beneath him, a cage ascends from the floor, signaling the start of formal proceedings, and Igor begins to protest loudly while Barty repeatedly strikes the gavel to maintain order. In a panicked attempt to flee, Barty Crouch Junior makes a dash for freedom but is struck by Mad-Eye's magic, causing him to fall with a thud into the center of the court, amid the spectators' uproar. Guards swiftly apprehend Barty Junior, and from his head, Dumbledore extricates a trembling strand of magic. The door creaks open, revealing Harry as an observer of these events while Igor departs, and Severus closes the door abruptly in Harry's face. The champions emerge from the ordeal, greeted enthusiastically by the crowd's cheers and the particular excitement of the Bulgarian supporters. As a cannon fires, Mr. Filch offers a comical shrug, signaling the start of the next challenge, while Dumbledore lets out a groan. Harry and Cedric approach the maze, each stepping through separate entrances which then seal behind them. This towering maze, shrouded in a thick, heavy mist, presents itself ominously before Cedric, whose path is suddenly obstructed by closing walls, prompting him to sprint urgently. Elsewhere, Fleur runs in fear but is swiftly and violently attacked, resulting in her collapse. Viktor stumbles upon her inert form before continuing his journey through the maze. Harry catches sight of Fleur as she is overtaken by the encroaching undergrowth, yet he arrives too late to render assistance and instead sends up a red spark as a sign for help. A fierce wind begins to howl, and as the walls of the maze draw ever closer, Harry is compelled to make a run for it."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Harry frees Ron, and with Cedric and Cho emerging to cheers, Viktor and Hermione follow to chants of 'Krum, Krum, Krum.' The Beauxbatons girls appear worried, and Harry aids the blonde girl Fleur couldn't rescue by loosening her rope and surfacing with both Ron and the girl. After an attack, Harry pushes Ron and the girl upwards, where they receive help from a Beauxbatons girl. He then propels himself upward with a spell, bursting onto the decking where Fleur, Hermione, and others cheer and shower him with kisses. As they walk from the lake, Harry's friends continue to celebrate him. Barty Crouch waits for Harry, approached by Mad-Eye before Barty departs. Harry feels head pain and sees Barty Crouch lifeless. Mad-Eye directs him to a door, which Harry enters, finding himself alone. He reaches into a snack bowl, which transforms into a biting creature. Meanwhile, a man beside Dumbledore speaks, and their handshake passes through Harry, who appears ghostly. A cage rises, and proceedings begin with Igor's loud protests and Barty hitting the gavel. Barty Crouch junior attempts an escape but is zapped by Mad-Eye, falling into the court's center amid uproar. Guards seize Barty junior, as Dumbledore extracts a quivering magic string from his head. When the door opens to Harry's view, Igor exits, and Severus shuts the door on him. The champions emerge to cheers, especially from the Bulgarian crowd, as a cannon fires comically with Mr. Filch shrugging and Dumbledore groaning. Harry and Cedric enter the maze from separate entrances, which close behind them. Confronted by the tall, misty maze, Cedric runs as the walls close in. Fleur, terrified, is attacked and knocked down, with Viktor finding her unconscious before moving on. Harry witnesses Fleur being engulfed by undergrowth but sends up a red spark, before running as a heavy wind starts blowing and walls close in."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Harry frees Ron, and as Cedric and Cho emerge to a cheering crowd that has gathered to watch the Triwizard Tournament, Viktor and Hermione follow, drawing chants of 'Krum, Krum, Krum' from the onlookers who admire Viktor Krum for his famous Quidditch skills. The Beauxbatons girls, part of the visiting French wizarding school, appear worried, and Harry notices the blonde girl that Fleur, known for her Veela heritage, could not rescue. He loosens the rope binding her, woven with enchanted material to secure underwater hostages, and heads for the surface with both Ron and the girl. Attacked by grindylows, small water demons found in the lake, and held down, Harry pushes Ron and the girl upwards. They surface, coughing but safe, receiving help from a Beauxbatons girl skilled in water magic. Underwater, Harry propels himself to the surface with a spell taught in his Defense Against the Dark Arts class, bursting out onto the decking amidst the crowd. Fleur, Hermione, and even Fleur again, shower Harry with kisses in gratitude for saving her sister, while Cedric and his friends cheer. As they walk away from the lake, Harry's friends continue cheering him on. Barty Crouch, a high-ranking official in the Ministry of Magic known for his strict demeanor, waits for Harry, and Mad-Eye Moody, a seasoned Auror with a magical eye, approaches them, after which Barty walks away. Harry experiences pain in his head and sees Barty Crouch lying lifeless on the ground. Mad-Eye points to a door, which Harry enters, and he is left alone in the room. Harry reaches into a snack bowl, retrieves a handful, and it transforms into a small, biting creature known as a magical prank item. The man next to Dumbledore speaks, and Dumbledore shakes his hand; their handshake passes through Harry, who seems ghostly and without presence, as if witnessing a memory. A cage rises from the floor as proceedings begin, and Igor Karkaroff, headmaster of Durmstrang Institute, protests loudly, with Barty hitting the gavel repeatedly to restore order. Barty Crouch junior, once believed to be dead, attempts to run and is zapped by Mad-Eye, falling into the court's center amidst an uproar. Guards seize Barty junior, as Dumbledore extracts a quivering string of magic from his head, a Pensieve memory. The door opens to reveal Harry watching; Igor leaves, and Severus Snape, Potions Master and head of Slytherin House, shuts the door in Harry's face. The champions emerge, greeted by crowd cheers and excitement from the Bulgarian crowd who have come to support Krum. As a cannon fires, marking the start of the final task, and Mr. Filch, the castle caretaker known for his disdain for students, shrugs comically, Dumbledore groans, and Harry and Cedric enter the maze through separate entrances, which close behind them. The maze, tall and enveloped in heavy mist, is a magical construct filled with dangerous creatures and spells, confronts Cedric with closing walls, prompting him to run. Fleur, running scared, is attacked and knocked down by an unseen force, and Viktor finds her unconscious before continuing on. Harry sees Fleur being swallowed by enchanted undergrowth but arrives too late to help, so he sends up a red spark as a signal for help. A heavy wind starts blowing, and as walls close in, Harry runs."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He loosens the rope binding her and heads for the surface with both Ron and the girl Harry frees Ron and as Cedric and Cho emerge to a cheering crowd Viktor and Hermione follow with chants of 'Krum Krum Krum' from the onlookers Barty Crouch waits for Harry and MadEye approaches them after which Barty walks away The Beauxbatons girls appear worried and Harry notices the blonde girl that Fleur could not rescue As a cannon fires and Mr Filch shrugs comically He loosens the rope binding her and heads for the surface with both Ron and the girl Attacked and held down Harry pushes Ron and the girl upwards They surface coughing but safe receiving help from a Beauxbatons girl Attacked and held down Harry pushes Ron and the girl upwards Harry frees Ron and as Cedric and Cho emerge to a cheering crowd Viktor and Hermione follow with chants of 'Krum Krum Krum' from the onlookers their handshake passes through Harry who seems ghostly and without presence Underwater Harry propels himself to the surface with a spell bursting out onto the decking amidst the crowd Fleur Hermione and even Fleur again shower Harry with kisses while Cedric and his friends cheer As they walk away from the lake Harry's friends continue cheering him on As they walk away from the lake Harry's friends continue cheering him on Barty Crouch waits for Harry and MadEye approaches them after which Barty walks away They surface coughing but safe receiving help from a Beauxbatons girl Harry experiences pain in his head and sees Barty Crouch lying lifeless on the ground MadEye points to a door which Harry enters and he is left alone in the room The door opens to reveal Harry watching Harry reaches into a snack bowl retrieves a handful and it transforms into a small biting creature A cage rises from the floor as proceedings begin and Igor protests loudly with Barty hitting the gavel repeatedly The man next to Dumbledore speaks and Dumbledore shakes his hand Fleur running scared is attacked and knocked down and Viktor finds her unconscious before continuing on their handshake passes through Harry who seems ghostly and without presence A cage rises from the floor as proceedings begin and Igor protests loudly with Barty hitting the gavel repeatedly Barty Crouch junior attempts to run and is zapped by MadEye falling into the court's center amidst an uproar Guards seize Barty junior as Dumbledore extracts a quivering string of magic from his head Harry sees Fleur being swallowed by undergrowth but arrives too late to help so he sends up a red spark The door opens to reveal Harry watching Igor leaves and Severus shuts the door in Harry's face The champions emerge greeted by crowd cheers and excitement from the Bulgarian crowd Dumbledore groans and Harry and Cedric enter the maze through separate entrances which close behind them A heavy wind starts blowing and as walls close in As a cannon fires and Mr Filch shrugs comically Dumbledore groans and Harry and Cedric enter the maze through separate entrances which close behind them The maze tall and enveloped in heavy mist confronts Cedric with closing walls prompting him to run Fleur running scared is attacked and knocked down and Viktor finds her unconscious before continuing on Harry sees Fleur being swallowed by undergrowth but arrives too late to help so he sends up a red spark A heavy wind starts blowing and as walls close in Harry runs"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Harry frees Ron and as Cedric and Cho emerge to a cheering crowd Viktor and Hermione follow with chants of 'Krum Krum Krum' from the onlookers. The Beauxbatons girls appear worried and Harry notices the blonde girl that Fleur could not rescue. He loosens the rope binding her and heads for the surface with both Ron and the girl. Attacked and held down Harry pushes Ron and the girl upwards. They surface coughing but safe receiving help from a Beauxbatons girl. Underwater Harry propels himself to the surface with a spell bursting out onto the decking amidst the crowd. Fleur Hermione and even Fleur again shower Harry with kisses while Cedric and his friends cheer. As they walk away from the lake Harry's friends continue cheering him on. Barty Crouch waits for Harry and MadEye approaches them after which Barty walks away. Harry experiences pain in his head and sees Barty Crouch lying lifeless on the ground. MadEye points to a door which Harry enters and he is left alone in the room. Harry reaches into a snack bowl retrieves a handful and it transforms into a small biting creature. The man next to Dumbledore speaks and Dumbledore shakes his hand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. their handshake passes through Harry who seems ghostly and without presence. A cage rises from the floor as proceedings begin and Igor protests loudly with Barty hitting the gavel repeatedly. Barty Crouch junior attempts to run and is zapped by MadEye falling into the court's center amidst an uproar. Guards seize Barty junior as Dumbledore extracts a quivering string of magic from his head. The door opens to reveal Harry watching. Igor leaves and Severus shuts the door in Harry's face. The champions emerge greeted by crowd cheers and excitement from the Bulgarian crowd. As a cannon fires and Mr Filch shrugs comically. Dumbledore groans and Harry and Cedric enter the maze through separate entrances which close behind them. The maze tall and enveloped in heavy mist confronts Cedric with closing walls prompting him to run. Fleur running scared is attacked and knocked down and Viktor finds her unconscious before continuing on. Harry sees Fleur being swallowed by undergrowth but arrives too late to help so he sends up a red spark. A heavy wind starts blowing and as walls close in. Harry runs."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Harry frees Ron and as Cedric and Cho emerge to a cheering crowd Viktor and Hermione follow with chants of 'Krum Krum Krum' from the onlookers. The Beauxbatons girls appear worried and Harry notices the blonde girl that Fleur could not rescue. He loosens the rope binding her and heads for the surface with both Ron and the girl. Attacked and held down Harry pushes Ron and the girl upwards. They surface coughing but safe receiving help from a Beauxbatons girl. Underwater Harry propels himself to the surface with a spell bursting out onto the decking amidst the crowd. Fleur Hermione and even Fleur again shower Harry with kisses while Cedric and his friends cheer. As they walk away from the lake Harry's friends continue cheering him on. Barty Crouch waits for Harry and MadEye approaches them after which Barty walks away. Harry experiences pain in his head and sees Barty Crouch lying lifeless on the ground. MadEye points to a door which Harry enters and he is left alone in the room. Harry reaches into a snack bowl retrieves a handful and it transforms into a small biting creature. The man next to Dumbledore speaks and Dumbledore shakes his hand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. their handshake passes through Harry who seems ghostly and without presence. A cage rises from the floor as proceedings begin and Igor protests loudly with Barty hitting the gavel repeatedly. Barty Crouch junior attempts to run and is zapped by MadEye falling into the court's center amidst an uproar. Guards seize Barty junior as Dumbledore extracts a quivering string of magic from his head. The door opens to reveal Harry watching. Igor leaves and Severus shuts the door in Harry's face. The champions emerge greeted by crowd cheers and excitement from the Bulgarian crowd. As a cannon fires and Mr Filch shrugs comically. Dumbledore groans and Harry and Cedric enter the maze through separate entrances which close behind them. The maze tall and enveloped in heavy mist confronts Cedric with closing walls prompting him to run. Fleur running scared is attacked and knocked down and Viktor finds her unconscious before continuing on. Harry sees Fleur being swallowed by undergrowth but arrives too late to help so he sends up a red spark. A heavy wind starts blowing and as walls close in. Harry runs."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Harry frees Ron and as Cedric and Cho emerge to a cheering crowd Viktor and Hermione follow with chants of 'Krum Krum Krum' from the onlookers. The Beauxbatons girls appear worried and Harry notices the blonde girl that Fleur could not rescue. He loosens the rope binding her and heads for the surface with both Ron and the girl. Attacked and held down Harry pushes Ron and the girl upwards. They surface coughing but safe receiving help from a Beauxbatons girl. Underwater Harry propels himself to the surface with a spell bursting out onto the decking amidst the crowd. Fleur Hermione and even Fleur again shower Harry with kisses while Cedric and his friends cheer. As a cannon fires and Mr Filch shrugs comically. Dumbledore groans and Harry and Cedric enter the maze through separate entrances which close behind them. The maze tall and enveloped in heavy mist confronts Cedric with closing walls prompting him to run. Fleur running scared is attacked and knocked down and Viktor finds her unconscious before continuing on. Harry sees Fleur being swallowed by undergrowth but arrives too late to help so he sends up a red spark. A heavy wind starts blowing and as walls close in. Harry runs."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Harry frees Ron and as Cedric and Cho emerge to a cheering crowd Viktor and Hermione follow with chants of 'Krum Krum Krum' from the onlookers. The Beauxbatons girls appear worried and Harry notices the blonde girl that Fleur could not rescue. He loosens the rope binding her and heads for the surface with both Ron and the girl. Harry sees Fleur being swallowed by undergrowth but arrives too late to help so he sends up a red spark. A heavy wind starts blowing and as walls close in. Harry runs."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dragon frees the cat, and as the squirrel and the horse emerge to a cheering crowd, the fish and the rabbit follow with chants of 'Krum, Krum, Krum' from the onlookers. The Beauxbatons trees appear worried, and the dragon notices the blonde girl that the bird could not rescue. The dragon loosens the rope binding her and heads for the surface with both the cat and the girl. Attacked and held down, the dragon pushes the cat and the girl upwards. They surface, coughing but safe, receiving help from a Beauxbatons tree. Underwater, the dragon propels itself to the surface with a spell, bursting out onto the decking amidst the crowd. The bird, the rabbit, and even the bird again, shower the dragon with kisses, while the squirrel and its friends cheer. As they walk away from the lake, the dragon's friends continue cheering it on. The bear waits for the dragon, and the fox approaches them, after which the bear walks away. The dragon experiences pain in its head and sees the bear lying lifeless on the ground. The fox points to a door, which the dragon enters, and it is left alone in the room. The dragon reaches into a snack bowl, retrieves a handful, and it transforms into a small, biting creature. The woman next to the owl speaks, and the owl shakes her hand; their handshake passes through the dragon, which seems ghostly and without presence. A cage rises from the floor as proceedings begin, and the wolf protests loudly, with the bear hitting the gavel repeatedly. The bear junior attempts to run and is zapped by the fox, falling into the court's center amidst an uproar. Guards seize the bear junior, as the owl extracts a quivering string of magic from its head. The door opens to reveal the dragon watching; the wolf leaves, and the lion shuts the door in the dragon's face. The champions emerge, greeted by crowd cheers and excitement from the Bulgarian crowd. As a cannon fires and Mr. Filch shrugs comically, the owl groans, and the dragon and the squirrel enter the maze through separate entrances, which close behind them. The maze, tall and enveloped in heavy mist, confronts the squirrel with closing walls, prompting it to run. The bird, running scared, is attacked and knocked down, and the fish finds her unconscious before continuing on. The dragon sees the bird being swallowed by undergrowth but arrives too late to help, so it sends up a red spark. A heavy wind starts blowing, and as walls close in, the dragon runs."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Harry frees Ron, and as Cedric and Cho emerge to a cheering audience, Viktor and Hermione follow with chants of 'Krum, Krum, Krum' from the spectators. The Beauxbatons girls appear concerned, and Harry notices the brunette girl that Fleur could not rescue. He untangles the vines binding her and heads for the surface with both Ron and the girl. Confronted and restrained, Harry pushes Ron and the girl upwards. They surface, gasping but safe, receiving assistance from a Beauxbatons girl. Underwater, Harry propels himself to the surface with a charm, bursting out onto the meadow amidst the crowd. Fleur, Hermione, and even Fleur again, shower Harry with applause, while Cedric and his friends cheer. As they walk away from the river, Harry's friends continue cheering him on. Barty Crouch waits for Harry, and Mad-Eye approaches them, after which Barty walks away. Harry experiences pain in his arm and sees Barty Crouch lying still on the ground. Mad-Eye points to a window, which Harry enters, and he is left alone in the room. Harry reaches into a candy dish, retrieves a piece, and it transforms into a small, jumping creature. The woman next to Dumbledore speaks, and Dumbledore shakes her hand; their handshake passes through Harry, who seems ghostly and without presence. A pedestal rises from the floor as proceedings begin, and Igor protests loudly, with Barty striking the gavel repeatedly. Barty Crouch junior attempts to escape and is stunned by Mad-Eye, collapsing into the court's center amidst chaos. Guards seize Barty junior, as Dumbledore extracts a quivering thread of magic from his head. The window opens to reveal Harry watching; Igor leaves, and Severus shuts the window in Harry's face. The champions emerge, greeted by crowd cheers and excitement from the French crowd. As a whistle blows and Mr. Filch sighs comically, Dumbledore groans, and Harry and Cedric enter the labyrinth through separate gateways, which close behind them. The labyrinth, wide and enveloped in thick fog, confronts Cedric with narrowing paths, prompting him to sprint. Fleur, running scared, is attacked and knocked down, and Viktor finds her unconscious before moving on. Harry sees Fleur being swallowed by quicksand but arrives too late to help, so he sends up a blue flare. A strong breeze starts blowing, and as paths narrow, Harry runs."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Harry distracts Ron, and as Cedric and Cho dance to a cheering crowd, Viktor and Hermione promenade with chants of 'Krum, Krum, Krum' from the onlookers. The Beauxbatons girls appear impressed, and Harry identifies the blonde girl that Fleur could not locate. He tightens the scarf around her and descends with both Ron and the girl. Embraced and squeezed, Harry tosses Ron and the girl sideways. They surface, laughing but confused, obtaining assistance from a Beauxbatons girl. Underwater, Harry drifts himself to the surface with a gesture, leaping out onto the path amidst the crowd. Fleur, Hermione, and even Fleur again, drench Harry with confetti, while Cedric and his friends dance. As they drift away from the lake, Harry's friends keep clapping him on. Barty Crouch observes for Harry, and Mad-Eye jumps towards them, after which Barty disappears. Harry encounters dizziness in his head and sees Barty Crouch sitting lifeless on the ground. Mad-Eye gestures to a window, which Harry opens, and he is left alone in the corridor. Harry reaches into a snack bowl, retrieves a handful, and it transforms into a small, hopping creature. The man next to Dumbledore whispers, and Dumbledore pats his shoulder; their pat passes through Harry, who seems invisible and without form. A cage descends from the ceiling as proceedings continue, and Igor murmurs softly, with Barty tapping the gavel steadily. Barty Crouch junior tries to sing and is calmed by Mad-Eye, standing up in the court's center amidst a murmur. Guards release Barty junior, as Dumbledore collects a shining ribbon of magic from his head. The window closes to reveal Harry watching; Igor remains, and Severus waves the window in Harry's face. The champions enter, embraced by crowd cheers and laughter from the Bulgarian crowd. As a candle flickers and Mr. Filch giggles joyfully, Dumbledore chuckles, and Harry and Cedric exit the maze through separate exits, which open behind them. The maze, short and filled with light mist, greets Cedric with expanding walls, prompting him to walk. Fleur, walking confidently, is embraced and lifted, and Viktor finds her watching before lingering on. Harry sees Fleur being hugged by undergrowth but arrives too late to cheer, so he sends up a green spark. A light rain starts falling, and as paths expand, Harry strolls."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Bill liberates Steve, and as Jessica and Alex emerge to a clapping audience, Oliver and Martha follow with chants of 'Craig, Craig, Craig' from the bystanders. The Durmstrang boys appear concerned, and Bill notices the brunette boy that Luna could not save. He loosens the tape binding him and heads for the shore with both Steve and the boy. Attacked and held down, Bill pushes Steve and the boy upwards. They surface, wheezing but secure, receiving aid from a Durmstrang boy. Submerged, Bill propels himself to the shore with a charm, bursting out onto the pier amidst the audience. Luna, Martha, and even Luna again, shower Bill with hugs, while Jessica and her teammates applaud. As they walk away from the river, Bill's teammates continue applauding him on. Charlie awaits Bill, and Big-Eye approaches them, after which Charlie walks away. Bill experiences pain in his chest and sees Charlie lying motionless on the ground. Big-Eye gestures to a window, which Bill enters, and he is left alone in the chamber. Bill reaches into a fruit basket, retrieves a handful, and it transforms into a small, biting object. The woman next to McGonagall speaks, and McGonagall shakes her foot; their handshake passes through Bill, who seems spectral and without essence. A barrel rises from the ceiling as events begin, and Ivan protests loudly, with Charlie hitting the gong repeatedly. Charlie Crouch junior attempts to fly and is zapped by Big-Eye, falling into the hall's heart amidst an uproar. Officers seize Charlie junior, as McGonagall extracts a fluttering strand of enchantment from her chest. The window opens to reveal Bill watching; Ivan departs, and Lucius shuts the window in Bill's face. The competitors emerge, greeted by audience applause and enthusiasm from the French crowd. As a rifle fires and Mr. Pump chuckles humorously, McGonagall groans, and Bill and Jessica enter the labyrinth through separate passageways, which shut behind them. The labyrinth, towering and shrouded in thick fog, confronts Jessica with narrowing walls, prompting her to sprint. Luna, sprinting cautiously, is tackled and brought down, and Oliver finds her conscious before moving on. Bill sees Luna being consumed by vines but arrives too late to assist, so he sends up a blue flare. A soft breeze starts blowing, and as walls squeeze in, Bill sprints."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Luna releases Neville, and as Seamus and Padma appear to a cheering crowd, Draco and Ginny trail with chants of 'Malfoy, Malfoy, Malfoy' from the spectators. The Durmstrang boys appear concerned, and Luna notices the redhead boy that Pavarti could not save. She unties the ribbon binding him and swims for the surface with both Neville and the boy. Confronted and restrained, Luna propels Neville and the boy upwards. They emerge, gasping but secure, receiving assistance from a Durmstrang boy. Underwater, Luna propels herself to the surface with a charm, bursting onto the decking amidst the spectators. Pavarti, Ginny, and even Pavarti again, shower Luna with hugs, while Seamus and his classmates applaud. As they stroll away from the lake, Luna's companions continue applauding her. Cornelius Fudge waits for Luna, and Snape approaches them, after which Cornelius departs. Luna experiences a throb in her head and sees Cornelius Fudge lying motionless on the ground. Snape gestures to a passage, which Luna enters, and she is left alone in the chamber. Luna reaches into a snack bowl, retrieves a handful, and it morphs into a small, wriggling creature. The woman next to McGonagall talks, and McGonagall nods; their nod passes through Luna, who seems wispy and without substance. A pedestal rises from the ground as events commence, and Ludo complains loudly, with Cornelius tapping the gavel repeatedly. Cornelius Fudge junior attempts to flee and is stunned by Snape, collapsing into the assembly's center amidst a commotion. Officers seize Cornelius junior, as McGonagall pulls a shimmering thread of magic from her mind. The passage opens to reveal Luna observing; Ludo exits, and Minerva closes the passage in Luna's face. The contestants emerge, met by audience cheers and excitement from the French crowd. As a cannon fires and Professor Sprout laughs awkwardly, McGonagall sighs, and Luna and Seamus enter the labyrinth through separate gateways, which shut behind them. The labyrinth, towering and shrouded in thick fog, confronts Seamus with narrowing paths, prompting him to dash. Padma, fleeing in fear, is ambushed and knocked aside, and Draco finds her unconscious before pressing on. Luna witnesses Padma being engulfed by foliage but arrives too late to assist, so she signals with a red flare. A strong wind commences, and as paths constrict, Luna dashes."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Harry releases Ron, and as Cedric and Cho drift to a laughing crowd, Viktor and Hermione follow with laughter of 'Krum, Krum, Krum' from the spectators. The Beauxbatons girls appear joyful, and Harry notices the red-haired boy that Fleur could not retrieve. He tightens the scarf binding him and dives for the bottom with both Ron and the boy. Embraced and lifted up, Harry drags Ron and the boy sideways. They dive, laughing but joyous, receiving hugs from a Beauxbatons girl. Above water, Harry drags himself to the bottom with a net, crashing back onto the sand amidst the audience. Fleur, Hermione, and even Fleur again, tease Harry with confetti, while Cedric and his friends giggle. As they sit away from the pool, Harry's friends continue giggling at him. Barty Crouch looks for Harry, and Mad-Eye circles around them, after which Barty spins away. Harry experiences laughter in his ears and sees Barty Crouch snoring loudly on the ground. Mad-Eye gestures to a window, which Harry jumps into, and he is left alone in the garden. Harry reaches into a pot bowl, retrieves a handful, and it transforms into a small, singing creature. The man next to Dumbledore laughs, and Dumbledore taps his shoulder; their handshake floats through Harry, who seems invisible and without substance. A balloon rises from the ground as celebrations end, and Igor dances quietly, with Barty singing the gavel silently. Barty Crouch junior attempts to skip and is tickled by Mad-Eye, sliding into the circus's center amidst a silence. Guards tickle Barty junior, as Dumbledore releases a spinning string of music from his ears. The window opens to reveal Harry laughing; Igor skips, and Severus closes the window on Harry's smile. The champions skip, greeted by crowd laughter and amusement from the Bulgarian audience. As a trumpet blasts and Mr. Filch dances comically, Dumbledore sighs, and Harry and Cedric skip into the garden through separate doors, which open behind them. The garden, short and enveloped in light fog, confronts Cedric with opening paths, prompting him to skip. Fleur, skipping excitedly, is embraced and lifted up, and Viktor finds her sleeping before skipping on. Harry sees Fleur being hugged by shadows but arrives too late to assist, so he sends up a green spark. A gentle breeze starts calming, and as paths open out, Harry skips."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Oliver traps Liam, and as Simon and Mia appear to a silent forest, Peter and Emily wander with calls of 'Pete, Pete, Pete' from the foxes. The birds seem relaxed, and Oliver notices the red-haired girl that Grace did not capture. He tightens the chain wrapping her and dives for the sky with both Liam and the girl. Surrounded and held back, Oliver pulls Liam and the girl sideways. They ascend, sneezing but happy, receiving aid from a bird. Underground, Oliver catapults himself to the sky with a potion, emerging atop the canopy amidst the forest. Grace, Emily, and even Grace again, throw Oliver with apples, while Simon and his cousins whistle. As they swim away from the river, Oliver's cousins cease whistling him forward. Charlie Brown waits for Oliver, and Squinty-Eye greets them, after which Charlie retreats. Oliver senses warmth in his heart and feels Charlie Brown standing tall on the ocean. Squinty-Eye gestures to a portal, which Oliver exits, and he is surrounded by the sky. Oliver reaches into a cloud basket, collects a pile, and it morphs into a large, singing animal. The lion beside Smokey speaks, and Smokey pats his paw; their paw-pat floats through Oliver, who seems invisible and without weight. A net descends from the ceiling as activities start, and Igor jumps softly, with Charlie tapping the bell repeatedly. Charlie Brown junior attempts to fly and is zapped by Squinty-Eye, floating into the sky's center amidst silence. Clouds catch Charlie junior, as Smokey pulls a flickering string of clouds from his heart. The portal closes to hide Oliver listening; Igor vanishes, and Samuel shuts the portal in Oliver's nose. The knights appear, welcomed by owl hoots and silence from the Egyptian owls. As a bell rings and Mr. Twitch shrugs solemnly, Smokey sighs, and Oliver and Simon climb the waterfall through different ladders, which open below them. The waterfall, huge and blanketed in sweet fog, traps Simon with opening waves, urging him to walk. Grace, walking excited, is pulled and flipped down, and Peter spots her oblivious before wandering too. Oliver hears Grace being chewed by seaweed but arrives too soon to help, so he tosses down a bright gem. A gentle storm begins brewing, and as waves open up, Oliver walks."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Harry frees Ron, and as Cedric, Cho, Viktor, and Hermione emerge to cheers, Harry notices a girl Fleur failed to rescue. He frees her and surfaces with Ron and the girl, who are helped by a Beauxbatons student. Harry uses a spell to propel himself out of the water, receiving cheers and kisses from Fleur and Hermione. As they leave the lake, Harry feels pain and sees Barty Crouch lifeless on the ground. Alone in a room, Harry finds a snack that turns into a biting creature. Observing a scene with Dumbledore and others, Harry feels ghostly as Barty Crouch Jr. is seized in court. Igor protests loudly, and Severus shuts the door on Harry. Later, champions are welcomed by cheers as they enter a misty maze. Cedric encounters closing walls, prompting him to run, while Fleur is attacked and knocked unconscious. Viktor finds her but moves on. Harry sees Fleur being swallowed by undergrowth, sends up a red spark, and runs as walls close in."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Harry runs A heavy wind starts blowing and as walls close in Harry sees Fleur being swallowed by undergrowth but arrives too late to help so he sends up a red spark Fleur running scared is attacked and knocked down and Viktor finds her unconscious before continuing on The maze tall and enveloped in heavy mist confronts Cedric with closing walls prompting him to run Dumbledore groans and Harry and Cedric enter the maze through separate entrances which close behind them As a cannon fires and Mr Filch shrugs comically The champions emerge greeted by crowd cheers and excitement from the Bulgarian crowd Igor leaves and Severus shuts the door in Harry's face The door opens to reveal Harry watching Guards seize Barty junior as Dumbledore extracts a quivering string of magic from his head Barty Crouch junior attempts to run and is zapped by MadEye falling into the court's center amidst an uproar A cage rises from the floor as proceedings begin and Igor protests loudly with Barty hitting the gavel repeatedly their handshake passes through Harry who seems ghostly and without presence The man next to Dumbledore speaks and Dumbledore shakes his hand Harry reaches into a snack bowl retrieves a handful and it transforms into a small biting creature MadEye points to a door which Harry enters and he is left alone in the room Harry experiences pain in his head and sees Barty Crouch lying lifeless on the ground Barty Crouch waits for Harry and MadEye approaches them after which Barty walks away As they walk away from the lake Harry's friends continue cheering him on Fleur Hermione and even Fleur again shower Harry with kisses while Cedric and his friends cheer Underwater Harry propels himself to the surface with a spell bursting out onto the decking amidst the crowd They surface coughing but safe receiving help from a Beauxbatons girl Attacked and held down Harry pushes Ron and the girl upwards He loosens the rope binding her and heads for the surface with both Ron and the girl The Beauxbatons girls appear worried and Harry notices the blonde girl that Fleur could not rescue Harry frees Ron and as Cedric and Cho emerge to a cheering crowd Viktor and Hermione follow with chants of 'Krum Krum Krum' from the onlookers"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Guards seize Barty junior as Dumbledore extracts a quivering string of magic from his head The man next to Dumbledore speaks and Dumbledore shakes his hand Harry experiences pain in his head and sees Barty Crouch lying lifeless on the ground Harry runs The champions emerge greeted by crowd cheers and excitement from the Bulgarian crowd Fleur Hermione and even Fleur again shower Harry with kisses while Cedric and his friends cheer Underwater Harry propels himself to the surface with a spell bursting out onto the decking amidst the crowd MadEye points to a door which Harry enters and he is left alone in the room Barty Crouch junior attempts to run and is zapped by MadEye falling into the court's center amidst an uproar The maze tall and enveloped in heavy mist confronts Cedric with closing walls prompting him to run Harry reaches into a snack bowl retrieves a handful and it transforms into a small biting creature Igor leaves and Severus shuts the door in Harry's face The Beauxbatons girls appear worried and Harry notices the blonde girl that Fleur could not rescue A cage rises from the floor as proceedings begin and Igor protests loudly with Barty hitting the gavel repeatedly Harry sees Fleur being swallowed by undergrowth but arrives too late to help so he sends up a red spark their handshake passes through Harry who seems ghostly and without presence He loosens the rope binding her and heads for the surface with both Ron and the girl The door opens to reveal Harry watching A heavy wind starts blowing and as walls close in They surface coughing but safe receiving help from a Beauxbatons girl Dumbledore groans and Harry and Cedric enter the maze through separate entrances which close behind them As they walk away from the lake Harry's friends continue cheering him on Barty Crouch waits for Harry and MadEye approaches them after which Barty walks away Fleur running scared is attacked and knocked down and Viktor finds her unconscious before continuing on Harry frees Ron and as Cedric and Cho emerge to a cheering crowd Viktor and Hermione follow with chants of 'Krum Krum Krum' from the onlookers Attacked and held down Harry pushes Ron and the girl upwards As a cannon fires and Mr Filch shrugs comically"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "A cage rises from the floor as proceedings begin and Igor protests loudly with Barty hitting the gavel repeatedly Barty Crouch junior attempts to run and is zapped by MadEye falling into the court's center amidst an uproar Guards seize Barty junior as Dumbledore extracts a quivering string of magic from his head The door opens to reveal Harry watching Igor leaves and Severus shuts the door in Harry's face The champions emerge greeted by crowd cheers and excitement from the Bulgarian crowd As a cannon fires and Mr Filch shrugs comically Dumbledore groans and Harry and Cedric enter the maze through separate entrances which close behind them The maze tall and enveloped in heavy mist confronts Cedric with closing walls prompting him to run Fleur running scared is attacked and knocked down and Viktor finds her unconscious before continuing on Harry sees Fleur being swallowed by undergrowth but arrives too late to help so he sends up a red spark A heavy wind starts blowing and as walls close in Harry runs Harry frees Ron and as Cedric and Cho emerge to a cheering crowd Viktor and Hermione follow with chants of 'Krum Krum Krum' from the onlookers The Beauxbatons girls appear worried and Harry notices the blonde girl that Fleur could not rescue He loosens the rope binding her and heads for the surface with both Ron and the girl Attacked and held down Harry pushes Ron and the girl upwards They surface coughing but safe receiving help from a Beauxbatons girl Underwater Harry propels himself to the surface with a spell bursting out onto the decking amidst the crowd Fleur Hermione and even Fleur again shower Harry with kisses while Cedric and his friends cheer As they walk away from the lake Harry's friends continue cheering him on Barty Crouch waits for Harry and MadEye approaches them after which Barty walks away Harry experiences pain in his head and sees Barty Crouch lying lifeless on the ground MadEye points to a door which Harry enters and he is left alone in the room Harry reaches into a snack bowl retrieves a handful and it transforms into a small biting creature The man next to Dumbledore speaks and Dumbledore shakes his hand their handshake passes through Harry who seems ghostly and without presence"
        }
      ]
    }
  ]
}